       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TBCHDOCK.
       AUTHOR.              JEFF BUNGO.
       DATE-WRITTEN.        FEBRUARY 1995.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      * THIS PROGRAM ALLOWS BATCH RECEIPTS INTO CSIS.
      * PROGRAM IS USED FOR PRAPS RECEIVER DOWNLOADS.

      *C
      *C 04/21/97  JEFF BUNGO
      *C   MODIFY PROGRAM TO PROCESS ASN'S FROM FRANCHISE VENDORS
      *C   TO PRECREATE RECEIVING SLIPS.  THESE ASN RECEIVING SLIPS
      *C   WILL HAVE A QUANTITY FOR ASN QUANTITY, BUT DELIVERED QTY
      *C   OF ZERO, SHOWING INTRANSIT.
      *C
      *C 10/30/97  CA YODER
      *C    ADDED CENTURY FOR DATABASE CHANGE TO MCFPCSTERM.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C  07/28/99     CA YODER
      *C     CHANGED TC 324 TO INCLUDE DES MOINES PLANT WHEN MOVING
      *C     NEW QUANTITY TO TC RECORD INSTEAD OF ADJUSTED QTY.
      *C
      *C  05/15/00     CA YODER
      *C     CORRECTED LOGIC TO MOVE FREIGHT BILL DATE INFORMATION TO
      *C     DFREIGHT.  PROGRAM WAS NOT MOVING THE YEAR IF YEAR = ZERO.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS400.
       OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES.  C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT PRINT-FILE   ASSIGN TO PRINTER-MCPRT.
            SELECT REC-INPUT    ASSIGN TO DATABASE-DOCKFILE
                                FILE STATUS IS FILE-STATUS.
            SELECT DK-ERROR-FILE ASSIGN TO DISK-DKERFILE
                                FILE STATUS IS FILE-STATUS.
            SELECT DDAILYTC
              ASSIGN TO DATABASE-MCFLCS1601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM-O
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
             SELECT DPOITEM-I
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DPOITEM-O
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM-I
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVITEM-O
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DFREIGHT-O
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DFREIGHT-I
               ASSIGN TO DATABASE-MCFLCS2405
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO-O
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV-I
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV2-I
               ASSIGN TO DATABASE-MCFLCS0102
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPORCV-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DPORECD-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DREQD-I
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MREQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT DTALLY-O
               ASSIGN TO DATABASE-MCFLCS4701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRAWLOT-O
               ASSIGN TO DATABASE-MCFLCS4601
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT DRCVCORR-O
               ASSIGN TO DATABASE-MCFLCS5401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT USAGEFIL-O
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT KFRTERMS-O
               ASSIGN TO DATABASE-MCFLCSTERM
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  REC-INPUT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS DATA-RECORD,
                          START-CONTROL-RECORD,
                          END-CONTROL-RECORD.
       01  DATA-RECORD.
           05  FILLER                 PIC X.
           05  RECORD-TYPE            PIC X(4).
           05  PO-NO-IN.
               10  PO-NO-IN-1-7       PIC X(07).
               10  PO-NO-IN-8-10      PIC X(03).
           05  KELLY-SEQ-IN           PIC X(6).
           05  NON-KELLY-SEQ-IN REDEFINES KELLY-SEQ-IN.
               10  RS-NO-IN           PIC X(3).
               10  FILLER             PIC X(3).
           05  RECORD-DATA            PIC X(112).
           05  ITM-DATA REDEFINES RECORD-DATA.
               10  ITM-NUMBER-IN      PIC X(4).
               10  ITM-CORP-CODE-IN   PIC X(7).
               10  ITM-QTY-RCVD-IN    PIC S9(8)V9(4) COMP-3.
               10  ITM-UM-RCVD-IN     PIC X(2).
               10  ITM-TALLY-IN       PIC X(4).
               10  ITM-COMPLETE-IN    PIC X(1).
               10  ITM-CONT-QTY-IN    PIC S9(8)V9(4) COMP-3.
               10  ITM-CONT-UM-IN     PIC X(2).
               10  ITM-MOLD-IN        PIC X(1).
               10  ITM-LOT-IN         PIC X(4).
               10  ITM-COMMENT-IN     PIC X(70).
               10  FILLER             PIC X(3).
           05  FR1-DATA REDEFINES RECORD-DATA.
               10  FR1-FRT-TYPE-IN    PIC X(1).
               10  FR1-EMPLOYEE-IN    PIC X(4).
               10  FR1-PACK-SLIP-IN   PIC X(12).
               10  FR1-CARRIER-IN     PIC X(4).
               10  FR1-CHARGES-IN     PIC S9(13)V9(2) COMP-3.
               10  FR1-BILL-DATE-IN   PIC 9(8) COMP-4.
               10  FR1-CARR-WEIGHT-IN PIC 9(8) COMP-4.
               10  FR1-DOCK-WEIGHT-IN PIC 9(8) COMP-4.
               10  FR1-LOT-IN         PIC X(8).
               10  FR1-SEALS-IN       PIC X(63).
           05  FR2-DATA REDEFINES RECORD-DATA.
               10  FR2-BILL-NUMBER-IN PIC X(16).
               10  FR2-ORIGIN-IN      PIC X(9).
               10  FR2-RAIL-CAR-IN    PIC X(10).
               10  FR2-Z-BILL-IN      PIC X(6).
               10  FR2-OSD-NUMBER-IN  PIC X(3).
               10  FR2-COMMENTS-IN    PIC X(68).
       01  START-CONTROL-RECORD.
           05  FILLER                 PIC X.
           05  START-LABEL            PIC X(17).
           05  SEND-SEQ               PIC 9(6).
           05  LOAD-SWITCH            PIC X.
           05  FILLER                 PIC X(108).
       01  END-CONTROL-RECORD.
           05  FILLER                 PIC X.
           05  END-LABEL              PIC X(21).
           05  FILLER                 PIC X(1).
           05  END-CONTROL-COUNT      PIC 9(6).
           05  FILLER                 PIC X(104).
       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRT-REC.
       01  PRT-REC           PIC X(132).
       FD  DK-ERROR-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS DK-ERROR-REC.
       01  DK-ERROR-REC.
           05  CTL                       PIC X(1).
           05  DK-ERROR-LINE.
               10  CONTROL-DATE          PIC X(6).
               10  FILLER                PIC X(126).
       FD  DDAILYTC
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.
       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.
       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.
       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-O.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.
       FD  DRCVITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC-I.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.
       FD  DRCVITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC-O.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.
       FD  DFREIGHT-O
           LABEL RECORDS ARE STANDARD.
       01  DFREIGHT-REC-O.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.
       FD  DFREIGHT-I
           LABEL RECORDS ARE STANDARD.
       01  DFREIGHT-REC-I.
           COPY DDS-MCRPCS2400  OF MCFLCS2405.
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-O.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.
       FD  MPORCV2-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC2-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0102.
       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-O.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.
       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.
       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-MCRPCS2100  OF MCFLCS2102.
       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.
       FD  DTALLY-O
           LABEL RECORDS ARE STANDARD.
       01  DTALLY-REC-O.
           COPY DDS-MCRPCS4700  OF MCFLCS4701.
       FD  DRAWLOT-O
           LABEL RECORDS ARE STANDARD.
       01  DRAWLOT-REC-O.
           COPY DDS-MCRPCS4600  OF MCFLCS4601.
       FD  DRCVCORR-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORR-REC-O.
           COPY DDS-MCRPCS5400  OF MCFLCS5401.
       FD  USAGEFIL-O
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-O.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.
       FD  KFRTERMS-O
           LABEL RECORDS ARE STANDARD.
       01  KFRTERMS-REC-O.
           COPY DDS-MCFRCSTERM  OF MCFLCSTERM.

       WORKING-STORAGE SECTION.
       77  SUMMARY-REPORT-PRINT       PIC X  VALUE "N".
       77  TEST-NUMERIC               PIC S9(8).

       01  ASN-FLAG                   PIC X  VALUE "N".
           88  ASN                           VALUE "Y".
           88  NOT-ASN                       VALUE "N".
       01  RECEIVED-FLAG              PIC X  VALUE "N".
           88  ALREADY-RECEIVED              VALUE "Y".
           88  NOT-RECEIVED                  VALUE "N".

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
       01  FOUND-DVENDITM-ENTRY       PIC 9.

       01  PLANT-NUMERIC              PIC 9(3).

       01  SEQ-NO-CONVERT             PIC 9(6).

       01  RETURN-FLAGS.
           05  RETURN-DD              PIC X.
           05  FILLER                 PIC X.

       01  RS-FRT-ERR                    PIC X      VALUE SPACES.
       01  RS-ITM-ERR                    PIC X      VALUE SPACES.

       01  RS-CREATED                    PIC X      VALUE SPACES.

       01  DIRECT-CHARGE-SW              PIC X      VALUE "N".
           88  DIRECT-CHARGE                        VALUE "Y".

       01  STOREROOM-ITEM-SW             PIC X      VALUE "N".
           88  STOREROOM-ITEM                       VALUE "Y".

       01  AUTO-STORE-SW                 PIC X      VALUE "N".

       01  CONTAINER-FLAG                PIC 9      VALUE 0.
           88  CONTAINER-ONLY                       VALUE 1.

      *----------  ITEM NUMBER FOR RETURNABLE CONTAINERS
       01  WORK-ITEM.
           05  FILLER                    PIC X            VALUE SPACE.
           05  SHIFTED-ITEM.
               07  WK-ITEM               PIC X(3)         VALUE SPACES.
               07  WK-ASTERICK           PIC X            VALUE "*".

      *----------  THE FOLLOWING 2 FIELDS ARE USED TO CONVERT A
      *            QUANTITY INTO STOREROOM UNIT OF MEASURE.
       01  WS-CONVERT-FLD                PIC S9(8)V9(4)   VALUE ZEROS.
       01  WS-RESULT-FLD                 PIC S9(8)        VALUE ZEROS.

       01  SAVE-UNIT-PRICE               PIC S9(10)V9(2)  VALUE ZEROS.
       01  TOTAL-DLVR                    PIC 9(8)V9(4)    VALUE ZEROS.

       01  ADJUSTED-QUANTITIES.
           05  ADJ-QTY                   PIC S9(8)V9(4)   VALUE ZEROS.
           05  ADJ-DLVR-TOTAL            PIC S9(8)V9(4)   VALUE ZEROS.
           05  ADJ-STR-QTY               PIC S9(8)V9(4)   VALUE ZEROS.
           05  KELLY-ADJ-STR-QTY         PIC S9(8)V9(4)   VALUE ZEROS.
           05  ADJ-ONHAND-TOTAL          PIC S9(8)        VALUE ZEROS.

       01  RECORD-COUNT               PIC 9(6)       VALUE ZEROS.

       01  FREIGHT-DATE-CN.
           05  FREIGHT-CC         PIC X(2).
           05  FREIGHT-YMD.
               10  FREIGHT-YY     PIC X(2).
               10  FREIGHT-MM     PIC X(2).
               10  FREIGHT-DD     PIC X(2).

      *****ARGUMENT VALUES*****
       01  CODE-ARG                   PIC X(8)   VALUE SPACES.
       01  ITEM-ARG                   PIC X(4)   VALUE SPACES.
       01  VEN-ARG                    PIC X(10)  VALUE SPACES.
       01  MPLT-ARG                   PIC X(4)   VALUE SPACES.
       01  REQ-ARG                    PIC X(12)  VALUE SPACES.
       01  PO-ARG                     PIC X(14)  VALUE SPACES.
       01  RS-ARG                     PIC X(14)  VALUE SPACES.
       01  RS-ARG-RD REDEFINES RS-ARG.
           05  RS-ARG-PREFIX          PIC X(1).
           05  RS-ARG-2-14.
               10  RS-ARG-2-11        PIC X(10).
               10  RS-ARG-RS          PIC X(3).
               10  RS-ARG-RS-9 REDEFINES RS-ARG-RS PIC 9(3).
       01  LOT-ARG.
           05  LOT-CORP-CODE          PIC X(8).
           05  LOT-LOT                PIC X(4).
       01  OLD-LOT                    PIC X(4).

      *----------VARIABLES FOR SUBROUTINE CALLS
       COPY TUMCF OF COPYLIB.
       COPY TDATECHK OF COPYLIB.
       COPY DOCKMISC OF COPYLIB.
       COPY HMSGBUF OF COPYLIB.
       01  DIRDEL-AREA                PIC X(60).
       01  DIRDEL-TABLE REDEFINES DIRDEL-AREA.
           02  PLANT-AREA OCCURS 6 TIMES.
               03  DIRDEL-STR-DEPT    PIC X(4).
               03  DIRDEL-DATE        PIC X(6).
       01  P-A                        PIC 9.
       01  AUTOSTORE-AREA             PIC X(12).
       01  AUTOSTORE-TABLE REDEFINES AUTOSTORE-AREA.
           02  AUTOSTR-AREA OCCURS 4 TIMES
                            INDEXED BY I.
               03  AUTOSTORE-GRP      PIC X(2).
               03  AUTOSTORE-SW       PIC X.
       01  CVR-FILLER                 PIC X(10)  VALUE SPACES.
       01  CVF-FILLER                 PIC X(10)  VALUE SPACES.
       01  SRF-ERROR-FLD              PIC S9(4) BINARY VALUE 0.
       COPY RCVFLAGS OF COPYLIB.
       COPY RCVQTY OF COPYLIB.
       01  SD-LINE.
           COPY RCVITEM OF COPYLIB.
       01  DOCK-OVERSHIPMENT.
           05  CODED-OVERSHIPMENT     PIC 99.
           05  NONCODED-OVERSHIPMENT  PIC 99.
           05  CODED-RAW-OVERSHIPMENT PIC 99.
           05  RAW-MATERIAL-GROUP.
               07  RM-GROUP OCCURS 6 TIMES PIC X(2).
       COPY LANGUAGE OF COPYLIB.
       COPY FRTDOCK OF COPYLIB.
       01  CDD-PO-ADDL-DATA              PIC X(8).
       01  CDD-PO-PRIME                  PIC X(3).
       01  CDD-INTERNAL-PO               PIC X.
       01  USER-AREA                     PIC X(2400).

       01  PO-SUB-BREAKDOWN.
           05  PO-SUB-CHAR            PIC X(1).
           05  FILLER                 PIC X(3).

       01  HOLD-DATA-RECORD           PIC X(21).

       01  HOLD-FR1-DATA.
           05  FR1-FRT-TYPE-HOLD      PIC X(1).
           05  FR1-EMPLOYEE-HOLD      PIC X(4).
           05  FR1-PACK-SLIP-HOLD     PIC X(12).
           05  FR1-CARRIER-HOLD       PIC X(4).
           05  FR1-CHARGES-HOLD       PIC S9(13)V9(2) COMP-3.
           05  FR1-BILL-DATE-HOLD     PIC S9(8) COMP-4.
           05  FR1-CARR-WEIGHT-HOLD   PIC S9(8) COMP-4.
           05  FR1-CARR-WEIGHT-HOLD-X REDEFINES FR1-CARR-WEIGHT-HOLD
                                      PIC X(4).
           05  FR1-DOCK-WEIGHT-HOLD   PIC S9(8) COMP-4.
           05  FR1-LOT-HOLD           PIC X(8).
           05  FR1-SEALS-HOLD         PIC X(63).

       01  HOLD-FR2-DATA.
           05  FR2-BILL-NUMBER-HOLD   PIC X(16).
           05  FR2-ORIGIN-HOLD        PIC X(9).
           05  FR2-RAIL-CAR-HOLD      PIC X(10).
           05  FR2-Z-BILL-HOLD        PIC X(6).
           05  FR2-OSD-NUMBER-HOLD    PIC X(3).
           05  FR2-COMMENTS-HOLD      PIC X(68).

       01  HOLD-KELLY-QTY              PIC S9(8)V9(4).

       01  ERROR-DETAIL-LINE.
           05  ERR-KELLY-SEQ           PIC X(6)   VALUE SPACES.
           05  FILLER                  PIC X(2)   VALUE SPACES.
           05  ERR-PO                  PIC X(10)  VALUE SPACES.
           05  FILLER                  PIC X(3)   VALUE SPACES.
           05  ERR-ITM                 PIC X(4)   VALUE SPACES.
           05  FILLER                  PIC X(2)   VALUE SPACES.
           05  FIELDS-IN-ERROR         PIC X(105) VALUE SPACES.
           05  FIELDS-IN-ERROR-R REDEFINES FIELDS-IN-ERROR.
               10  ERR-LIT-1           PIC X(18).
               10  ERR-VALUE-1         PIC X(15).
               10  ERR-VALUE-1-9 REDEFINES ERR-VALUE-1 PIC Z(9)9.9(4).
               10  FILLER              PIC X(2).
               10  ERR-LIT-2           PIC X(18).
               10  ERR-VALUE-2         PIC X(15).
               10  ERR-VALUE-2-9 REDEFINES ERR-VALUE-1 PIC Z(9)9.9(4).
               10  FILLER              PIC X(2).
               10  ERR-LIT-3           PIC X(18).
               10  ERR-VALUE-3         PIC X(15).
               10  ERR-VALUE-3-9 REDEFINES ERR-VALUE-1 PIC Z(9)9.9(4).
               10  FILLER              PIC X(2).

       01  ERROR-MSG-LINE.
           05  FILLER                  PIC X(18)  VALUE SPACES.
           05  ERR-RECORD-TYPE         PIC X(4)   VALUE SPACES.
           05  FILLER                  PIC X(2)   VALUE SPACES.
           05  ERR-MSG                 PIC X(80)  VALUE SPACES.
           05  FILLER                  PIC X(2)   VALUE SPACES.
           05  ERR-PROCESSED           PIC X(20)  VALUE SPACES.
           05  FILLER                  PIC X(2)   VALUE SPACES.
           05  FILLER                  PIC X(4)   VALUE ALL "*".

       01  RECORD-COUNTER-MESSAGE.
           05  FILLER                PIC X(14) VALUE "*TOTAL RECORDS".
           05  FILLER                PIC X(13) VALUE " PROCESSED   ".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  TOT-REC-PROCESS       PIC 9(6)  VALUE ZEROS.

       01  RECORD-RECV-MESSAGE.
           05  FILLER                PIC X(14) VALUE "*TOTAL RECORDS".
           05  FILLER                PIC X(15) VALUE " TRANSMITTED   ".
           05  TOTAL-REC-RECV        PIC 9(6)  VALUE ZEROS.

       01  ERROR-PAGE-CTR            PIC 9(4)  VALUE ZEROS.
       01  ERROR-LINE-CTR            PIC 9(4)  VALUE ZEROS.
       01  REPORT-PAGE-CTR           PIC 9(4)  VALUE ZEROS.
       01  REPORT-LINE-CTR           PIC 9(4)  VALUE ZEROS.

       01  BATCH-CORR-REASON         PIC X(142)
                  VALUE "CORRECTED BY BATCH".

019500 01  IMAGE-ERR-INSTRUCTION-1.
019600     05  FILLER    PIC X(21) VALUE " F A T A L  E R R O R".
019700     05  FILLER    PIC X(22) VALUE "  O C C U R E D  P R O".
019800     05  FILLER    PIC X(21) VALUE " C E S S I N G  C E A".
019900     05  FILLER    PIC X(12) VALUE " S E D | | |".
020000
020100 01  IMAGE-ERR-INSTRUCTION-2.
020200     05  FILLER    PIC X(5)  VALUE SPACES.
020300     05  FILLER    PIC X(15) VALUE "PLEASE CONTACT ".
020400     05  FILLER    PIC X(18) VALUE "PROGRAMMING STAFF ".
020500     05  FILLER    PIC X(21) VALUE "*RECEIVING UPDATE PGM".
020600
020700 01  ERROR-MSG.
020800     05  FILLER    PIC X(5)  VALUE SPACES.
020900     05  FILLER    PIC X(20) VALUE "ERROR OCCURED WHILE ".
021000     05  FILLER    PIC X(17) VALUE "PROCESSING RECORD".
021100     05  FILLER    PIC X(8)  VALUE " NUMBER ".
021200     05  REC-NO-OUT  PIC 9(6)  VALUE ZEROS.
021300
021400 01  BU-DISPLAY-AREA.
021500     05  FILLER          PIC X(2)  VALUE SPACES.
021600     05  BU-DISPLAY-MSG  PIC X(27) VALUE SPACES.
021700     05  FILLER          PIC X(2)  VALUE SPACES.
021800     05  BU-DISPLAY-STAT PIC 9(4)  VALUE ZEROES.
021900     05  FILLER          PIC X(2)  VALUE SPACES.
022000     05  BU-DISPLAY-FLD  PIC X(14) VALUE SPACES.
022100
022200 01  BU-DISPLAY REDEFINES BU-DISPLAY-AREA.
022300     05  BU-MSG1         PIC X(25).
022400     05  BU-MSG2         PIC 9(4).
022500     05  BU-MSG3         PIC X(15).
022600     05  BU-MSG4         PIC 9(4).
022700     05  FILLER          PIC X(3).

       01  STAR-LINE.
           05  FILLER    PIC X(80) VALUE ALL "*".
       01  DASH-LINE.
           05  FILLER    PIC X(80) VALUE ALL "-".
       01  DASH-LINE-132.
           05  FILLER    PIC X(132) VALUE ALL "-".

       01  REPORT-TITLE.
           05  FILLER    PIC X(1)  VALUE SPACES.
           05  PRT-PLANT PIC X(3)  VALUE SPACES.
           05  FILLER    PIC X(1)  VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "R E C E I V I N G   ".
           05  FILLER    PIC X(13) VALUE "R E P O R T #".
           05  PRT-SEQ   PIC X(06) VALUE SPACES.
           05  FILLER    PIC X(2)  VALUE SPACES.
           05  PRT-DATE  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(4)  VALUE SPACES.
           05  PRT-TIME  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(4)  VALUE SPACES.
           05  FILLER    PIC X(5)  VALUE "PAGE:".
           05  PRT-PAGE  PIC ZZZ9.

       01  REPORT-ASN-TITLE.
           05  FILLER    PIC X(1)  VALUE SPACES.
           05  PRT-PLANT-ASN PIC X(3)  VALUE SPACES.
           05  FILLER    PIC X(1)  VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "    A S N   R C V   ".
           05  FILLER    PIC X(13) VALUE "R E P O R T #".
           05  PRT-SEQ-ASN   PIC X(06) VALUE SPACES.
           05  FILLER    PIC X(2)  VALUE SPACES.
           05  PRT-DATE-ASN  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(4)  VALUE SPACES.
           05  PRT-TIME-ASN  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(4)  VALUE SPACES.
           05  FILLER    PIC X(5)  VALUE "PAGE:".
           05  PRT-PAGE-ASN  PIC ZZZ9.

       01  REPORT-HEADING-TITLE.
           05  KELLY-SEQ-LIT PIC X(8)   VALUE "  RCVR  ".
           05  FILLER        PIC X(11)  VALUE "PURCH ORDER".
           05  FILLER        PIC X(2)   VALUE SPACES.
           05  FILLER        PIC X(4)   VALUE "ITEM".
           05  FILLER        PIC X(03)  VALUE SPACES.
           05  FILLER        PIC X(09)  VALUE "CORP CODE".
           05  FILLER        PIC X(05)  VALUE SPACES.
           05  FILLER        PIC X(08)  VALUE "QTY DLVR".
           05  FILLER        PIC X(08)  VALUE SPACES.
           05  FILLER        PIC X(08)  VALUE "QTY STOR".
           05  FILLER        PIC X(8)   VALUE SPACES.
           05  FILLER        PIC X(5)   VALUE "ERROR".
           05  FILLER        PIC X(53)  VALUE SPACES.

       01  REPORT-ASN-HEADING-TITLE.
           05  FILLER        PIC X(8)   VALUE SPACES.
           05  FILLER        PIC X(11)  VALUE "PURCH ORDER".
           05  FILLER        PIC X(2)   VALUE SPACES.
           05  FILLER        PIC X(4)   VALUE "ITEM".
           05  FILLER        PIC X(03)  VALUE SPACES.
           05  FILLER        PIC X(09)  VALUE "CORP CODE".
           05  FILLER        PIC X(05)  VALUE SPACES.
           05  FILLER        PIC X(08)  VALUE "ASN QTY ".
           05  FILLER        PIC X(08)  VALUE SPACES.
           05  FILLER        PIC X(08)  VALUE SPACES.
           05  FILLER        PIC X(8)   VALUE SPACES.
           05  FILLER        PIC X(5)   VALUE "ERROR".
           05  FILLER        PIC X(53)  VALUE SPACES.

       01  REPORT-FRT-RECORD.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  KELLY-SEQ-RPT PIC X(6)   VALUE SPACES.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  PO-NO-RPT     PIC X(10)  VALUE SPACES.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  RS-NO-RPT     PIC X(3)   VALUE SPACES.
           05  FILLER        PIC X(3)   VALUE SPACES.
           05  RCV-DATE-RPT  PIC X(8)   VALUE SPACES.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  FRT-CORR-IND  PIC X(10)  VALUE SPACES.
           05  FILLER        PIC X(30)  VALUE SPACES.
           05  FRT-ERR-IND   PIC X(5)   VALUE SPACES.
           05  FILLER        PIC X(53)  VALUE SPACES.

       01  REPORT-ITM-RECORD.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  ITM-CORR-IND  PIC X(10)  VALUE SPACES.
           05  FILLER        PIC X(10)  VALUE SPACES.
           05  ITEM-NO-RPT   PIC X(4)   VALUE SPACES.
           05  FILLER        PIC X(4)   VALUE SPACES.
           05  CORP-CODE-RPT PIC X(7)   VALUE SPACES.
           05  FILLER        PIC X(6)   VALUE SPACES.
           05  QTY-DLVR-RPT  PIC ------9 VALUE SPACES.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  UM-RPT        PIC X(2)   VALUE SPACES.
           05  FILLER        PIC X(3)   VALUE SPACES.
           05  QTY-STOR-RPT  PIC ------9.99 VALUE SPACES.
           05  FILLER        PIC X(1)   VALUE SPACES.
           05  UM-STOR-RPT   PIC X(2)   VALUE SPACES.
           05  FILLER        PIC X(4)   VALUE SPACES.
           05  ITM-ERR-IND   PIC X(5)   VALUE SPACES.
           05  FILLER        PIC X(53)  VALUE SPACES.

       01  ERROR-TITLE.
           05  FILLER    PIC X(5)  VALUE SPACES.
           05  FILLER    PIC X(5)  VALUE "PAGE:".
           05  ERR-PAGE  PIC ZZZ9.
           05  FILLER    PIC X(19) VALUE SPACES.
           05  FILLER    PIC X(06) VALUE "PLANT ".
           05  ERR-PLANT PIC X(03) VALUE SPACES.
           05  FILLER    PIC X(16) VALUE " BATCH RECEIVING".
           05  FILLER    PIC X(21) VALUE " ERROR LISTING REPORT".
           05  FILLER    PIC X(10) VALUE " FOR SEQ #".
           05  ERR-SEQ   PIC X(06) VALUE SPACES.
           05  FILLER    PIC X(19) VALUE SPACES.
           05  ERR-DATE  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(2)  VALUE SPACES.
           05  ERR-TIME  PIC X(8)  VALUE SPACES.

       01  ERROR-ASN-TITLE.
           05  FILLER    PIC X(5)  VALUE SPACES.
           05  FILLER    PIC X(5)  VALUE "PAGE:".
           05  ERR-PAGE-ASN  PIC ZZZ9.
           05  FILLER    PIC X(19) VALUE SPACES.
           05  FILLER    PIC X(06) VALUE "PLANT ".
           05  ERR-PLANT-ASN PIC X(03) VALUE SPACES.
           05  FILLER    PIC X(16) VALUE " BATCH ASN RCVG ".
           05  FILLER    PIC X(21) VALUE " ERROR LISTING REPORT".
           05  FILLER    PIC X(10) VALUE " FOR SEQ #".
           05  ERR-SEQ-ASN   PIC X(06) VALUE SPACES.
           05  FILLER    PIC X(19) VALUE SPACES.
           05  ERR-DATE-ASN  PIC X(8)  VALUE SPACES.
           05  FILLER    PIC X(2)  VALUE SPACES.
           05  ERR-TIME-ASN  PIC X(8)  VALUE SPACES.


022200*----------  DATE AND TIME AREAS TO CALCULATE VENDOR LEAD TIMES
022300*           (CALCULATED FROM PO DATE)
       01  CALC-LT                    PIC 9(4)   VALUE ZEROS.
       01  CALC-LT2                   PIC 9(4)   VALUE ZEROS.
022500 01  TODAYS-JULIAN              PIC 9(5).
022600 01  PO-JULIAN                  PIC 9(5).
       01  J-JULIAN                   PIC 9(5).
       01  J-JULIANX                  PIC X(5).
022700
026200
026300 01  ACTIVITY-DATE.
026400     05  YY                     PIC XX.
026500     05  MM                     PIC XX.
026600     05  DD                     PIC XX.
026700 01  ACTIVITY-DATE-9 REDEFINES ACTIVITY-DATE.
026800     05  YY-9                   PIC 99.
026900     05  MM-9                   PIC 99.
027000     05  DD-9                   PIC 99.
027100
027200 01  WORK-DATE.
027300     05  WORK-YY                PIC XX.
027400     05  WORK-MM                PIC XX.
027500     05  WORK-DD                PIC XX.
027600
027700 01  WS-DATE.
027800     05  WS-MM                  PIC XX.
027900     05  FILLER                 PIC X.
028000     05  WS-DD                  PIC XX.
028100     05  FILLER                 PIC X.
028200     05  WS-YY                  PIC XX.

       01  WORK-DATE-CYMD             PIC 9(8).
       01  WORK-DATE-CYMD-X REDEFINES WORK-DATE-CYMD.
           05  WORK-DATE-C            PIC X(2).
           05  WORK-DATE-YMD.
               10  WORK-DATE-Y        PIC X(2).
               10  WORK-DATE-M        PIC X(2).
               10  WORK-DATE-D        PIC X(2).

       01  DATE-CYMD.
           05  DATE-CYMD-CC           PIC 9(2).
           05  DATE-CYMD-YMD.
               10  DATE-CYMD-YY       PIC 9(2).
               10  DATE-CYMD-MM       PIC 9(2).
               10  DATE-CYMD-DD       PIC 9(2).

       01  PO-RECEIVING-SLIP.
           05  PURCHASE-ORDER.
               10  PO-INDIC           PIC X      VALUE "P".
               10  WS-PO              PIC X(10)  VALUE SPACES.
               10  WS-PO2 REDEFINES WS-PO.
                   15  FILLER         PIC X(7).
                   15  WS-RLSE        PIC X(3).
            10  WS-RCVR               PIC X(3).
            10  WS-RCVR-9 REDEFINES WS-RCVR PIC 9(3).

       COPY OVRPFDATA OF COPYLIB.
       COPY CCHKOBJ   OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
       COPY MPLTINFO OF COPYLIB.
       COPY MPORCV   OF COPYLIB.
       COPY DPOITEM  OF COPYLIB.
       COPY DPORECD  OF COPYLIB.
       COPY DVENDITM OF COPYLIB.
       COPY DRCVITEM OF COPYLIB.
       COPY DFREIGHT OF COPYLIB.
       COPY MSTORERM OF COPYLIB.
       COPY DREQD    OF COPYLIB.
       COPY MREQ     OF COPYLIB.
       COPY USAGEFIL OF COPYLIB.
       COPY DTALLY   OF COPYLIB.
       COPY DRAWLOT  OF COPYLIB.
       COPY DRCVCORR OF COPYLIB.
       COPY DBSTAT   OF COPYLIB.
       COPY DDAILYTC OF COPYLIB.
       COPY TC323    OF COPYLIB.
       COPY TC423    OF COPYLIB.
       COPY TC350    OF COPYLIB.
       COPY TC450    OF COPYLIB.
       COPY TC352    OF COPYLIB.
       COPY TC325    OF COPYLIB.
       COPY TC425    OF COPYLIB.
       COPY TC354    OF COPYLIB.
       COPY TC326    OF COPYLIB.
       COPY TC327    OF COPYLIB.

       PROCEDURE DIVISION.

       00-BATCH-DOCK.
           PERFORM 1-HOUSEKEEP THRU 1-HOUSEKEEP-X.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ THRU 2-EOJ-X.
           GOBACK.

       1-HOUSEKEEP.
           OPEN INPUT  REC-INPUT.
           OPEN EXTEND DK-ERROR-FILE.
           OPEN INPUT DPORECD-I DPOITEM-I MSTORERM-I MPORCV-I MPORCV2-I
                      DREQD-I MREQ-I MPLTINFO-I DRCVITEM-I
                      DFREIGHT-I.
           OPEN I-O   MPLTINFO-O
                      MPORCV-O
                      DDAILYTC
                      DPOITEM-O
                      DVENDITM-O
                      DRCVITEM-O
                      DFREIGHT-O
                      DRAWLOT-O
                      DTALLY-O
                      USAGEFIL-O
                      KFRTERMS-O
                      DRCVCORR-O
                      MSTORERM-O.

      *----------  FIND THE PLANT NUMBER AND PASS IT TO SUBROUTINES
           MOVE "P 01" TO MPLT-ARG.
           MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MPLTINFO - TBCHDOCK" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.
           MOVE MPLTINFO-COMPANY TO PLT-NUMBER-PASS
                                    ERR-PLANT
                                    ERR-PLANT-ASN
                                    PRT-PLANT-ASN
                                    PRT-PLANT.

      *-------  FIND OVERSHIPMENT PERCENTAGES AND RAW MATERIAL MAJOR GROUPS
           MOVE "OVSH" TO MPLT-ARG.
           MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MPLTINFO - TBCHDOCK " TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.
           MOVE MPLTINFO-CODED-OVSH-VALUE TO CODED-OVERSHIPMENT.
           MOVE MPLTINFO-NCODED-OVSH-VALUE TO NONCODED-OVERSHIPMENT.
           MOVE MPLTINFO-CODED-RM-OVSH-VALUE TO CODED-RAW-OVERSHIPMENT.
           MOVE MPLTINFO-RM-MAJOR-GROUP TO RAW-MATERIAL-GROUP.
           MOVE MPLTINFO-TALLY-CLASS TO TALLY-CLASS.
           IF MPLTINFO-BATCH-REPORT = SPACES
              MOVE "N" TO SUMMARY-REPORT-PRINT
           ELSE
              MOVE MPLTINFO-BATCH-REPORT TO SUMMARY-REPORT-PRINT.
           IF SUMMARY-REPORT-PRINT = "Y"
               OPEN OUTPUT PRINT-FILE.
           MOVE SPACES TO DIRDEL-AREA, AUTOSTORE-AREA.
      *-----GET AUTOSTORE MAJOR GROUPS
           MOVE 1 TO P-A.
           PERFORM 12-LOAD-AUTOSTORE THRU 12-LOAD-AUTOSTORE-X.
      *----------  FIND THE STOREROOM DEPARTMENTS FOR DIRECT DELIVERY
           MOVE "DSTR" TO MPLT-ARG.
           MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MPLTINFO - TBCHDOCK " TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.
           MOVE 1 TO P-A.
           PERFORM 13-READ-DIRDEL-FILE THRU 13-READ-DIRDEL-FILE-X.

      *----- FIND FLAG TO CHECK FOR TRANSACTION 326.
           MOVE "P326" TO MPLT-ARG.
           MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE "N" TO MISC-P326-SW
           ELSE
               MOVE MPLTINFO-P326-SW TO MISC-P326-SW.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT        TO ACTIVITY-DATE.
           MOVE DATE-SLASH-OUT      TO PRT-DATE  ERR-DATE ERR-DATE-ASN
                                       PRT-DATE-ASN.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME  ERR-TIME
                                       PRT-TIME-ASN  ERR-TIME-ASN.
      *----- MOVE A CONTROL DATE TO THE ERROR FILE SO THAT
      *-----   TPRTRPT CAN PRINT BY RANGE OF DATES
           MOVE SPACES       TO DK-ERROR-REC.
           MOVE "*"          TO CTL.
           MOVE DATE-YMD-OUT TO CONTROL-DATE.
           WRITE DK-ERROR-REC.

       1-HOUSEKEEP-X.
           EXIT.

       12-LOAD-AUTOSTORE.
           MOVE MPLTINFO-MJRGRP (P-A) TO AUTOSTORE-GRP (P-A).
           MOVE MPLTINFO-STORE-SW (P-A) TO AUTOSTORE-SW (P-A).
           ADD 1 TO P-A.
           IF P-A < 5
              GO TO 12-LOAD-AUTOSTORE.
       12-LOAD-AUTOSTORE-X.
           EXIT.

       13-READ-DIRDEL-FILE.
           MOVE MPLTINFO-DEPT-STR (P-A)  TO DIRDEL-STR-DEPT (P-A).
           IF P-A = 6
              GO TO 13-READ-DIRDEL-FILE-X
           END-IF.
           ADD 1 TO P-A.
           GO TO 13-READ-DIRDEL-FILE.
       13-READ-DIRDEL-FILE-X.
           EXIT.

       2-EOJ.
           IF SUMMARY-REPORT-PRINT = "Y"
               MOVE RECORD-RECV-MESSAGE     TO  PRT-REC
               WRITE PRT-REC AFTER ADVANCING 3 LINES
               MOVE RECORD-COUNT            TO  TOT-REC-PROCESS
               MOVE RECORD-COUNTER-MESSAGE  TO  PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1 LINES
           END-IF.

           MOVE SPACES       TO DK-ERROR-REC.
           MOVE "3"          TO CTL.
           MOVE RECORD-RECV-MESSAGE     TO DK-ERROR-LINE.
           WRITE DK-ERROR-REC.
           MOVE "1"          TO CTL.
           MOVE RECORD-COUNTER-MESSAGE  TO DK-ERROR-LINE.
           WRITE DK-ERROR-REC.

       2-SHUTDOWN-DB.
           CLOSE      DPORECD-I DPOITEM-I MSTORERM-I MPORCV-I MPORCV2-I
                      DREQD-I MREQ-I MPLTINFO-I DRCVITEM-I.
           CLOSE      MPLTINFO-O
                      MPORCV-O
                      DDAILYTC
                      DPOITEM-O
                      DVENDITM-O
                      DRCVITEM-O
                      DFREIGHT-O
                      DRAWLOT-O
                      DTALLY-O
                      USAGEFIL-O
                      KFRTERMS-O
                      DRCVCORR-O
                      MSTORERM-O.
           CLOSE REC-INPUT.
           CLOSE DK-ERROR-FILE.
           IF SUMMARY-REPORT-PRINT = "Y"
               CLOSE PRINT-FILE.
           GOBACK.
       2-EOJ-X.
           EXIT.

       6-MAIN.
       6-FIND-START-LABEL.
           READ REC-INPUT
               AT END
                   GO TO 6-MAIN-X.

           IF START-LABEL = "RECEIVING RECORDS"
               ADD 1 TO RECORD-COUNT
               SET NOT-ASN TO TRUE
           ELSE
               IF START-LABEL = "ASN RECORDS"
                   ADD 1 TO RECORD-COUNT
                   SET ASN TO TRUE
               ELSE
                   GO TO 6-FIND-START-LABEL.

           IF NOT-ASN
               MOVE SEND-SEQ TO ERR-SEQ  PRT-SEQ  ERR-SEQ-ASN.
           PERFORM 85-ERROR-HEAD THRU 85-ERROR-HEAD-X.
           PERFORM 80-REPORT-HEAD THRU 80-REPORT-HEAD-X.

           IF NOT-ASN
             MOVE "PRCV" TO MPLT-ARG
             MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O
             READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             IF FILE-STATUS NOT = "00"
              MOVE FILE-STATUS TO BU-DISPLAY-STAT
              MOVE "** NO PRCV KEY IN MPLTINFO **" TO BU-DISPLAY-MSG
              PERFORM 9999-PRINT-FATAL-ERROR THRU 9999-EXIT
              PERFORM 999-SEQ-ERROR THRU 999-EXIT
              GO TO 99-PRINT-FATAL-ERROR
             END-IF

             IF SEND-SEQ NOT = MPLTINFO-KELLY-RCVR
              MOVE "EXPECTED SEQUENCE NUMBER " TO BU-MSG1
              MOVE MPLTINFO-KELLY-RCVR TO BU-MSG2
              MOVE "  --  RECEIVED " TO BU-MSG3
              MOVE SEND-SEQ TO BU-MSG4
              PERFORM 9999-PRINT-FATAL-ERROR THRU 9999-EXIT
              PERFORM 999-SEQ-ERROR THRU 999-EXIT
              GO TO 99-PRINT-FATAL-ERROR
             END-IF

             IF MPLTINFO-KELLY-RCVR NOT = 999999
               ADD 1 TO MPLTINFO-KELLY-RCVR
             ELSE
               MOVE 1 TO MPLTINFO-KELLY-RCVR
             END-IF
             REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE

             IF FILE-STATUS NOT = "00"
              MOVE FILE-STATUS TO BU-DISPLAY-STAT
              MOVE  "REWRITE MPLTINFO " TO BU-DISPLAY-MSG
              PERFORM 9999-PRINT-FATAL-ERROR THRU 9999-EXIT
              PERFORM 999-SEQ-ERROR THRU 999-EXIT
              GO TO 99-PRINT-FATAL-ERROR
             END-IF
      *------- DO A START > HIGH-VALUES TO UNLOCK
             MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC-O
             START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-START
           END-IF.

       6-READ-NEXT-RECORD.
           READ REC-INPUT
               AT END
                   GO TO 6-MAIN-X
           END-READ.
           MOVE DATA-RECORD TO HOLD-DATA-RECORD.

           IF END-LABEL = "END RECEIVING RECORDS" OR
                          "END ASN RECORDS"
               ADD 1 TO RECORD-COUNT
               IF NOT-ASN
                   ADD  END-CONTROL-COUNT TO TOTAL-REC-RECV
               END-IF
               GO TO 6-FIND-START-LABEL.

           ADD 1 TO RECORD-COUNT.

           MOVE PO-NO-IN     TO WS-PO.
           MOVE "000"        TO WS-RCVR.
           MOVE PO-RECEIVING-SLIP TO PO-ARG.
           MOVE PO-RECEIVING-SLIP TO RS-ARG.

       6-CHECK-RECORDS.
           MOVE SPACES TO ERROR-DETAIL-LINE
                          ERROR-MSG-LINE.
      ******************************************************
      * CHECK THAT RECEIVING SLIP RECORDS COME IN SEQUENCE *
      * OF FR1, FR2, ITM... FOR EACH RECEIVING SLIP.       *
      ******************************************************
           IF RECORD-TYPE = "FR1 "
               MOVE "N" TO RS-CREATED
               MOVE "N" TO RS-FRT-ERR
               MOVE "N" TO RS-ITM-ERR
               MOVE FR1-DATA TO HOLD-FR1-DATA
               MOVE SPACES TO HOLD-FR2-DATA
      *********GET FR2 DATA
               READ REC-INPUT
                  AT END
      ************** ERROR, FR1 WITHOUT FR2 AND ITEMS
                     MOVE HOLD-DATA-RECORD TO DATA-RECORD
                     MOVE HOLD-FR1-DATA TO RECORD-DATA
                     MOVE  "* FR1 RECORD WITHOUT FR2 AND ITM RECORDS *"
                        TO ERR-MSG
                     MOVE "FR1 " TO ERR-RECORD-TYPE
                     PERFORM 99-WRITE-ERROR
                     GO TO 6-MAIN-X
               END-READ
               ADD 1 TO RECORD-COUNT
               MOVE DATA-RECORD TO HOLD-DATA-RECORD
               IF RECORD-TYPE = "FR2 "
                 IF ASN
                     MOVE PO-NO-IN     TO WS-PO
                     MOVE "000"        TO WS-RCVR
                     MOVE PO-RECEIVING-SLIP TO PO-ARG
                     MOVE PO-RECEIVING-SLIP TO RS-ARG
                 END-IF
                 MOVE FR2-DATA TO HOLD-FR2-DATA
      *************GET FIRST ITEM ON RECEIVER
                   READ REC-INPUT
                     AT END
      ****************** ERROR, FR1 & FR2, WITHOUT ITEMS
                       MOVE HOLD-DATA-RECORD TO DATA-RECORD
                       MOVE HOLD-FR2-DATA TO RECORD-DATA
                       MOVE  "* FR1 & FR2 RECORDS WITHOUT ITM RECORDS *"
                            TO ERR-MSG
                        MOVE "ITM " TO ERR-RECORD-TYPE
                        PERFORM 99-WRITE-ERROR
                        GO TO 6-MAIN-X
                   END-READ
                   ADD 1 TO RECORD-COUNT
                   MOVE DATA-RECORD TO HOLD-DATA-RECORD
                   IF RECORD-TYPE = "ITM "
                       PERFORM 61-PROCESS-NEW-RCVG-SLIP
                         THRU 61-PROCESS-NEW-RCVG-SLIP-X
                   ELSE
      **************** ERROR, FR1 & FR2 WITHOUT ITEMS
                       MOVE  "* FR1 & FR2 RECORDS WITHOUT ITM RECORDS *"
                            TO ERR-MSG
                       MOVE "ITM " TO ERR-RECORD-TYPE
                       PERFORM 99-WRITE-ERROR
                   END-IF
               ELSE
      ************ ERROR, FR1 WITHOUT FR2, CHECK FOR NEXT RECEIVER
                   MOVE  "* FR1 WITHOUT FR2 RECORD *"
                        TO ERR-MSG
                   MOVE "FR2 " TO ERR-RECORD-TYPE
                   PERFORM 99-WRITE-ERROR
                   GO TO 6-CHECK-RECORDS
               END-IF
           ELSE
           IF RECORD-TYPE = "ITM "
               MOVE "N" TO RS-ITM-ERR
               IF RS-FRT-ERR NOT = "Y"
                 IF HOLD-FR1-DATA NOT = SPACES
                   IF RS-CREATED = "Y"
                       PERFORM 65-PROCESS-ITM THRU 65-PROCESS-ITM-X
                   ELSE
                       PERFORM 61-PROCESS-NEW-RCVG-SLIP THRU
                               61-PROCESS-NEW-RCVG-SLIP-X
                   END-IF
                 ELSE
      ************   ERROR, ITEM WITHOUT FREIGHT
                     MOVE  "* ITM RECORD WITHOUT ANY FRT RECORDS *"
                          TO ERR-MSG
                     MOVE "FR1 " TO ERR-RECORD-TYPE
                     PERFORM 99-WRITE-ERROR
                 END-IF
               END-IF
           ELSE
           IF RECORD-TYPE = "FR2 "
      *-------ASN'S WILL COME WITH ONLY ONE FR1, ORDER STARTS WITH FR2
             IF NOT-ASN
      ******** ERROR, FR2 WITHOUT FR1
               MOVE  "* FR2 RECORD WITHOUT A FR1 RECORD *"
                    TO ERR-MSG
               MOVE "FR1 " TO ERR-RECORD-TYPE
               PERFORM 99-WRITE-ERROR
               GO TO 6-READ-NEXT-RECORD
             ELSE
                   MOVE "N" TO RS-CREATED
                   MOVE "N" TO RS-FRT-ERR
                   MOVE "N" TO RS-ITM-ERR
                   MOVE PO-NO-IN     TO WS-PO
                   MOVE "000"        TO WS-RCVR
                   MOVE PO-RECEIVING-SLIP TO PO-ARG
                   MOVE PO-RECEIVING-SLIP TO RS-ARG
                   MOVE FR2-DATA TO HOLD-FR2-DATA
      *************GET FIRST ITEM ON RECEIVER
                   READ REC-INPUT
                     AT END
      ****************** ERROR, FR1 & FR2, WITHOUT ITEMS
                       MOVE HOLD-DATA-RECORD TO DATA-RECORD
                       MOVE HOLD-FR2-DATA TO RECORD-DATA
                       MOVE  "* FR1 & FR2 RECORDS WITHOUT ITM RECORDS *"
                            TO ERR-MSG
                        MOVE "ITM " TO ERR-RECORD-TYPE
                        PERFORM 99-WRITE-ERROR
                        GO TO 6-MAIN-X
                   END-READ
                   ADD 1 TO RECORD-COUNT
                   MOVE DATA-RECORD TO HOLD-DATA-RECORD
                   IF RECORD-TYPE = "ITM "
                       PERFORM 61-PROCESS-NEW-RCVG-SLIP
                         THRU 61-PROCESS-NEW-RCVG-SLIP-X
                   ELSE
      **************** ERROR, FR1 & FR2 WITHOUT ITEMS
                       MOVE  "* FR1 & FR2 RECORDS WITHOUT ITM RECORDS *"
                            TO ERR-MSG
                       MOVE "ITM " TO ERR-RECORD-TYPE
                       PERFORM 99-WRITE-ERROR
                   END-IF
             END-IF
           ELSE
           IF RECORD-TYPE = "FR1C"
               MOVE "N" TO RS-CREATED
               MOVE "N" TO RS-FRT-ERR
               MOVE "N" TO RS-ITM-ERR
               MOVE FR1-DATA TO HOLD-FR1-DATA
               MOVE SPACES TO HOLD-FR2-DATA
      *********GET FR2C DATA
               READ REC-INPUT
                  AT END
      ************** ERROR, FR1C WITHOUT FR2C
                     MOVE HOLD-DATA-RECORD TO DATA-RECORD
                     MOVE HOLD-FR1-DATA TO RECORD-DATA
                     MOVE  "* FR1C RECORD WITHOUT A FR2C RECORD *"
                         TO ERR-MSG
                     MOVE "FR2C" TO ERR-RECORD-TYPE
                     PERFORM 99-WRITE-ERROR
                     GO TO 6-MAIN-X
               END-READ
               ADD 1 TO RECORD-COUNT
               MOVE DATA-RECORD TO HOLD-DATA-RECORD
               IF RECORD-TYPE = "FR2C"
                   MOVE FR2-DATA TO HOLD-FR2-DATA
                   PERFORM 66-CORRECT-FRT THRU 66-CORRECT-FRT-X
               ELSE
      ************ ERROR, FR1C WITHOUT FR2C, CHECK FOR NEXT RECEIVER
                   MOVE  "* FR1C RECORD WITHOUT A FR2C RECORD *"
                       TO ERR-MSG
                   MOVE "FR2C" TO ERR-RECORD-TYPE
                   PERFORM 99-WRITE-ERROR
                   GO TO 6-CHECK-RECORDS
               END-IF
           ELSE
           IF RECORD-TYPE = "FR2C"
      ************ ERROR, FR2C WITHOUT FR1C
               MOVE  "* FR2C RECORD WITHOUT A FR1C RECORD *"
                   TO ERR-MSG
               MOVE "FR1C" TO ERR-RECORD-TYPE
               PERFORM 99-WRITE-ERROR
           ELSE
           IF RECORD-TYPE = "ITMC"
               MOVE "N" TO RS-CREATED
               MOVE "N" TO RS-FRT-ERR
               MOVE "N" TO RS-ITM-ERR
               PERFORM 67-CORRECT-ITM THRU 67-CORRECT-ITM-X
           ELSE
      *********ERROR, INVALID RECORD TYPE
               MOVE  "* INVALID RECORD TYPE *"
                   TO ERR-MSG
                      ERR-LIT-1
               MOVE RECORD-TYPE TO ERR-VALUE-1
                                   ERR-RECORD-TYPE
               PERFORM 99-WRITE-ERROR
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF.

           GO TO 6-READ-NEXT-RECORD.
       6-MAIN-X.
           EXIT.

       61-PROCESS-NEW-RCVG-SLIP.
           PERFORM 611-PO-EXIST THRU 611-PO-EXIST-X.
      *------IF ASN, CHECK IF ALREADY DOWNLOADED
      *------  IF ALREADY RECEIVED AGAINST, ASSUME RECEIPT BEFORE ASN
      *------  OTHERWISE REPLACE THE ASN
           IF ASN
      *       FIND PACKING SLIP (SHIPMENT NUMBER) FOR THIS PO
              PERFORM 612-FIND-PO-SHIPMENT THRU 612-FIND-PO-SHIPMENT-X
              IF FILE-STATUS = "00"
                 IF FRT-ASN-INDIC = SPACES
                   MOVE "* ASN ALREADY RECEIVED AGAINST, NOT ACCEPTED *"
                      TO ERR-MSG
                   MOVE "RCV SLIP NUMBER:" TO ERR-LIT-1
                   MOVE FRT-PO-RCV-NO TO ERR-VALUE-1
                   MOVE "ASN SHIP NUMBER:" TO ERR-LIT-2
                   MOVE FRT-PACK-SLIP TO ERR-VALUE-2
                   PERFORM 99-WRITE-ERROR
                   MOVE "Y" TO RS-FRT-ERR
                 ELSE
      *             REPLACE ASN BY DELETING
                    PERFORM 613-DELETE-ASN THRU 613-DELETE-ASN-X
                 END-IF
              END-IF
           END-IF.
           IF A-KELLY-PLANT
             MOVE KELLY-SEQ-IN TO PORCVSEQ OF MPORCV-REC2-I
             READ MPORCV2-I
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-READ
             IF FILE-STATUS = "00"
      ********* ERROR, SEQUENCE NUMBER (RCVG SLIP) ALREADY EXISTS
                 MOVE "* RECEIVING SLIP ALREADY EXISTS *"
                    TO ERR-MSG
                 MOVE "RCV SLIP NUMBER:" TO ERR-LIT-1
                 MOVE KELLY-SEQ-IN TO ERR-VALUE-1
                 MOVE "ON PURCH ORDER:" TO ERR-LIT-2
                 MOVE PORCVNO OF MPORCV-REC2-I TO ERR-VALUE-2
                 PERFORM 99-WRITE-ERROR
                 MOVE "Y" TO RS-FRT-ERR
             END-IF
           END-IF.
           IF RS-FRT-ERR NOT = "Y"
             MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I
             READ DPORECD-I INTO BUF-DPORECD
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-READ
             PERFORM 62-EDIT-FRT THRU 62-EDIT-FRT-X
             IF RS-FRT-ERR NOT = "Y"
               MOVE "N" TO CALLING-ROUTINE-FLAG
               PERFORM 64-EDIT-ITM THRU 64-EDIT-ITM-X
               IF RS-ITM-ERR NOT = "Y"
                 PERFORM 7-CREATE-RS THRU 7-CREATE-RS-X
               END-IF
             ELSE
               PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
             END-IF
           ELSE
             PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
           END-IF.
       61-PROCESS-NEW-RCVG-SLIP-X.
           EXIT.

       611-PO-EXIST.
      ********************************************************
      *  MPORCV   - GET    DOES THE PURCHASE ORDER EXIST??   *
      ********************************************************
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-I.
           READ MPORCV-I INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS-1 = "2"
               MOVE  "* PURCHASE ORDER DOES NOT EXIST *" TO ERR-MSG
               PERFORM 99-WRITE-ERROR
               MOVE "Y" TO RS-FRT-ERR
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPORCV ACCUM        " TO BU-DISPLAY-MSG
               MOVE FILE-STATUS                 TO BU-DISPLAY-STAT
               MOVE PO-ARG                      TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           ELSE
               MOVE PO-ARG TO MISC-RS-ARG
               CALL "CVALRCVR" USING MISCELLANEOUS-DATA,
                                 USER-AREA, MESSAGE-BUFFER,
                                 LANG-SETNUM, LANG-MSGNUM,
                                 BUF-DPORECD, CVR-FILLER
               IF  LANG-SETNUM NOT = ZEROES
                   MOVE "Y" TO RS-FRT-ERR
                   MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
                   MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE CATREAD-MSG-TEXT TO ERR-MSG
                   PERFORM 99-WRITE-ERROR.
       611-PO-EXIST-X.
           EXIT.

       612-FIND-PO-SHIPMENT.
           MOVE FR1-PACK-SLIP-HOLD TO FRTPACKSLP OF DFREIGHT-REC-I.
           START DFREIGHT-I KEY = EXTERNALLY-DESCRIBED-KEY.
       612-LOOP.
           IF FILE-STATUS = "00"
              READ DFREIGHT-I NEXT INTO BUF-DPOFREIGHT
              IF FILE-STATUS = "00"
                IF FRT-PACK-SLIP = FR1-PACK-SLIP-HOLD
                  IF FRT-PO-NUM NOT = PO-NO-IN-1-7 OR
                     FRT-PO-RLSE NOT = PO-NO-IN-8-10
                      GO TO 612-LOOP
                  END-IF
                ELSE
                  MOVE "10" TO FILE-STATUS
              END-IF
           END-IF.
       612-FIND-PO-SHIPMENT-X.
           EXIT.

       613-DELETE-ASN.
      *-----DELETE AN ASN BY DELETING DPOFREIGHT,
      *-----  UPDATING ACCUMULATED ASN QTYS BY SUBTRACTING RCV ASN QTY
      *-----  DELETE RECEIVING SLIP ITEMS
           MOVE FRT-PO-RCV-NO TO RS-ARG.
           MOVE RS-ARG TO PORCVNO OF DFREIGHT-O.
           READ DFREIGHT-O.
           DELETE DFREIGHT-O.
           IF FILE-STATUS NOT = "00"
              MOVE FILE-STATUS TO BU-DISPLAY-STAT
              MOVE "613 DELETE DFREIGHT ERROR" TO BU-DISPLAY-MSG
              MOVE RS-ARG TO BU-DISPLAY-FLD
              PERFORM 99-PRINT-FATAL-ERROR.
      *-----DELETE MPORCV ENTRY FOR RECEIVING SLIP
           MOVE RS-ARG TO PORCVNO OF MPORCV-O.
           READ MPORCV-O.
           DELETE MPORCV-O.
           IF FILE-STATUS NOT = "00"
              MOVE FILE-STATUS TO BU-DISPLAY-STAT
              MOVE "613 DELETE MPORCV ERROR" TO BU-DISPLAY-MSG
              MOVE RS-ARG TO BU-DISPLAY-FLD
              PERFORM 99-PRINT-FATAL-ERROR.
           MOVE RS-ARG TO PORCVNO OF DRCVITEM-O.
           MOVE ZEROS TO ITEMNO OF DRCVITEM-O.
           START DRCVITEM-O KEY NOT < EXTERNALLY-DESCRIBED-KEY.
       613-ITEM-LOOP.
           READ DRCVITEM-O NEXT INTO BUF-DRCVITEM.
           IF FILE-STATUS = "00"
             IF RCV-PO-RCV-NO = RS-ARG
                 MOVE RS-ARG(1:11) TO PO-ARG
                 MOVE ZEROS TO PO-ARG(12:3)
                 MOVE PO-ARG TO PORCVNO OF DPOITEM-O
                 MOVE RCV-ITEM-NUMBER TO ITEMNO OF DPOITEM-O
                 READ DPOITEM-O INTO BUF-DPOITEM
                 END-READ
                 IF FILE-STATUS NOT = "00"
                     GO TO 613-ITEM-LOOP
                 END-IF
                 SUBTRACT RCV-ASN-QTY FROM ITM-ASN-QTY
                 REWRITE DPOITEM-REC-O FROM BUF-DPOITEM
                 END-REWRITE
                 IF FILE-STATUS NOT = "00"
                   MOVE FILE-STATUS TO BU-DISPLAY-STAT
                   MOVE "613 REWRITE DFREIGHT ERROR" TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
                 END-IF
                 DELETE DRCVITEM-O
                 IF FILE-STATUS NOT = "00"
                   MOVE FILE-STATUS TO BU-DISPLAY-STAT
                   MOVE "613 DELETE DRCVITEM ERROR" TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
                 END-IF
                 GO TO 613-ITEM-LOOP
             END-IF
           END-IF.
       613-DELETE-ASN-X.
           EXIT.

       62-EDIT-FRT.
           PERFORM 621-PREP-CVALFRT THRU 621-PREP-CVALFRT-X.
           CALL "CVALFRT" USING PLT-NUMBER, MESSAGE-BUFFER,
                                SRF-ERROR-FLD, KELLY-PO-IND,
                                FREIGHT-SCREEN-BUFFER,
                                LANGUAGE-PARMS, CVF-FILLER.

           IF MESSAGE-BUFFER NOT = SPACES
              MOVE "Y" TO RS-FRT-ERR
              MOVE "FR  " TO ERR-RECORD-TYPE
              MOVE MESSAGE-BUFFER TO ERR-MSG
              PERFORM 99-WRITE-ERROR.
           IF LANG-SETNUM NOT = ZEROES
              MOVE "Y" TO RS-FRT-ERR
              MOVE "FR  " TO ERR-RECORD-TYPE
              MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
              MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE CATREAD-MSG-TEXT TO ERR-MSG
              PERFORM 99-WRITE-ERROR.

           IF PO-NO-CHECK-INDIC = "X" AND NOT A-KELLY-PLANT
               IF FR1-PACK-SLIP-HOLD = SPACES
                   MOVE "Y" TO RS-FRT-ERR
                   MOVE "FR1 " TO ERR-RECORD-TYPE
                   MOVE "* PACKING SLIP REQUIRED FOR INVOICELESS PO *"
                      TO ERR-MSG
                   PERFORM 99-WRITE-ERROR.
       62-EDIT-FRT-X.
           EXIT.

       621-PREP-CVALFRT.
           MOVE SPACES                    TO MESSAGE-BUFFER.
           MOVE ZEROES                    TO LANG-SETNUM,
                                             LANG-MSGNUM.
           INITIALIZE FREIGHT-SCREEN-BUFFER.
           MOVE FR1-FRT-TYPE-HOLD TO TYPE-FREIGHT-BUF.
           MOVE FR1-EMPLOYEE-HOLD TO EMPLOYEE-BUF.
           MOVE FR1-PACK-SLIP-HOLD TO P-SLIP-NO-BUF.
           MOVE FR1-CARRIER-HOLD TO CARRIER-BUF.
           IF FR1-CHARGES-HOLD NOT NUMERIC
               MOVE ZEROS TO FR1-CHARGES-HOLD.
           MOVE FR1-CHARGES-HOLD TO FREIGHT-CHARGES-BUF9.
           IF NOT ASN
             MOVE FR1-BILL-DATE-HOLD TO TEST-NUMERIC
             IF TEST-NUMERIC NOT NUMERIC
                 MOVE ZEROS TO FR1-BILL-DATE-HOLD
             END-IF
             IF FR1-BILL-DATE-HOLD NOT = ZEROS
               MOVE FR1-BILL-DATE-HOLD TO WORK-DATE-CYMD
               MOVE WORK-DATE-Y TO YY-BUF
               MOVE WORK-DATE-M TO MM-BUF
               MOVE WORK-DATE-D TO DD-BUF
             ELSE
               MOVE SPACES TO FREIGHT-DATE-BUF
           ELSE
             IF FR2-BILL-NUMBER-HOLD NOT = SPACES
               MOVE YY          TO YY-BUF
               MOVE MM          TO MM-BUF
               MOVE DD          TO DD-BUF
             ELSE
               MOVE SPACES TO FREIGHT-DATE-BUF
           END-IF.
           IF ASN AND FR1-CARR-WEIGHT-HOLD-X = SPACES
             MOVE ZEROS TO FR1-CARR-WEIGHT-HOLD.
           MOVE FR1-CARR-WEIGHT-HOLD TO TEST-NUMERIC.
           IF TEST-NUMERIC NOT NUMERIC
               MOVE ZEROS TO FR1-CARR-WEIGHT-HOLD.
           MOVE FR1-CARR-WEIGHT-HOLD TO CARR-WT-BUF.
           MOVE FR1-DOCK-WEIGHT-HOLD TO TEST-NUMERIC.
           IF TEST-NUMERIC NOT NUMERIC
               MOVE ZEROS TO FR1-DOCK-WEIGHT-HOLD.
           MOVE FR1-DOCK-WEIGHT-HOLD TO OUR-WT-BUF.
           MOVE FR1-LOT-HOLD TO LOT-NO-BUF.
           MOVE FR1-SEALS-HOLD TO SEALS-BUF.
           MOVE FR2-BILL-NUMBER-HOLD TO FREIGHT-NO-BUF.
           MOVE FR2-ORIGIN-HOLD TO ORIGIN-BUF.
           MOVE FR2-RAIL-CAR-HOLD TO CAR-NO-BUF.
           MOVE FR2-Z-BILL-HOLD TO Z-BILL-BUF.
           MOVE FR2-OSD-NUMBER-HOLD TO OSD-NO-BUF.
           MOVE FR2-COMMENTS-HOLD TO COMMENT-BUF.
       621-PREP-CVALFRT-X.
           EXIT.

       64-EDIT-ITM.
           MOVE RECORD-TYPE TO ERR-RECORD-TYPE.
           MOVE ITM-NUMBER-IN TO ERR-ITM.
           IF ITM-CORP-CODE-IN = "NO PART"
               MOVE "NON-STR" TO ITM-CORP-CODE-IN.
           IF ITM-NUMBER-IN = SPACES
               MOVE "Y" TO RS-ITM-ERR
               MOVE "ITEM NUMBER IS REQUIRED" TO ERR-MSG
               PERFORM 99-WRITE-ERROR.
           IF ITM-CORP-CODE-IN = SPACES
               MOVE "Y" TO RS-ITM-ERR
               MOVE "CORPORATE CODE IS REQUIRED" TO ERR-MSG
               PERFORM 99-WRITE-ERROR.
           MOVE ITM-NUMBER-IN TO ITEM-ARG.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           MOVE ITEM-ARG TO ITEMNO OF DPOITEM-REC-I.
           READ DPOITEM-I INTO BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE "Y" TO RS-ITM-ERR
               MOVE "ITEM NUMBER" TO ERR-LIT-1
               MOVE ITM-NUMBER-IN TO ERR-VALUE-1
               MOVE "ITEM NUMBER NOT FOUND" TO ERR-MSG
               PERFORM 99-WRITE-ERROR
           ELSE
               IF ITM-CORP-CODE-IN NOT = ITM-CORP-CODE
                   MOVE "Y" TO RS-ITM-ERR
                   MOVE "CORP CODES DO NOT MATCH ON ITEM"
                     TO ERR-MSG
                   MOVE "RECEIVE CORP CODE" TO ERR-LIT-1
                   MOVE ITM-CORP-CODE-IN TO ERR-VALUE-1
                   MOVE "PO ITEM CORP CODE" TO ERR-LIT-2
                   MOVE ITM-CORP-CODE TO ERR-VALUE-2
                   PERFORM 99-WRITE-ERROR
               ELSE
                   IF ITM-CORP-CODE-IN NOT = "NON-STR"
                       MOVE ITM-CORP-CODE-IN TO CODE-ARG
                       MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I
                       READ MSTORERM-I INTO BUF-MSTORERM
                          INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                       END-READ
                       IF FILE-STATUS NOT = "00"
                           MOVE "Y" TO RS-ITM-ERR
                           MOVE "CORP CODE DOES NOT EXISTS" TO ERR-MSG
                           MOVE "CORP CODE" TO ERR-LIT-1
                           MOVE ITM-CORP-CODE-IN TO ERR-VALUE-1
                           PERFORM 99-WRITE-ERROR
                       END-IF
                   END-IF
               END-IF
           END-IF.
           IF ITM-QTY-RCVD-IN NOT NUMERIC
               MOVE "Y" TO RS-ITM-ERR
               MOVE "QUANTITY RECEIVED MUST BE NUMERIC" TO ERR-MSG
               PERFORM 99-WRITE-ERROR
           ELSE
               IF ITM-QTY-RCVD-IN = ZEROS AND
                  RECORD-TYPE NOT = "ITMC"
                   MOVE "Y" TO RS-ITM-ERR
                   MOVE "QUANTITY RECEIVED IS REQUIRED" TO ERR-MSG
                   PERFORM 99-WRITE-ERROR.
           IF ITM-UM-RCVD-IN = SPACES
               MOVE "Y" TO RS-ITM-ERR
               MOVE "UNIT OF MEASURE RECEIVED IS REQUIRED"
                 TO ERR-MSG
               PERFORM 99-WRITE-ERROR.
      *-----ISC SENDING UM FOR CASE AS CA, CONVERT TO CS; GA->GL
           IF ASN
              IF ITM-UM-RCVD-IN = "CA"
                MOVE "CS" TO ITM-UM-RCVD-IN
              ELSE
                IF ITM-UM-RCVD-IN = "GA"
                  MOVE "GL" TO ITM-UM-RCVD-IN
                END-IF
              END-IF
           END-IF.
           IF ITM-MOLD-IN NOT = SPACES
              IF ITM-MOLD-IN NOT = "S" AND NOT = "A"
                  MOVE "Y" TO RS-ITM-ERR
                  MOVE "TIRE MOLD MUST BE A, S OR BLANK"
                    TO ERR-MSG
                  PERFORM 99-WRITE-ERROR.
           IF RS-ITM-ERR NOT = "Y"
               PERFORM 643-PREP-CVALITEM THRU 643-PREP-CVALITEM-X
               CALL "CVALITEM" USING     MISCELLANEOUS-DATA,
                                         SRF-ERROR-FLD, LANG-SETNUM,
                                         LANG-MSGNUM,
                                         PASSED-FLAGS,
                                         BUF-DPORECD,
                                         DE-FIELDS-2,
                                         SD-LINE,
                                         DOCK-OVERSHIPMENT
               IF  LANG-SETNUM NOT = 0
                   MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
                   MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE CATREAD-MSG-TEXT TO ERR-MSG
                   PERFORM 99-WRITE-ERROR
                   MOVE "Y" TO RS-ITM-ERR.
       64-EDIT-ITM-X.
           EXIT.

       643-PREP-CVALITEM.
      *----- SET VARIABLES FOR CALL TO CVALITEM FOR ADDL EDITS
           INITIALIZE SD-LINE.
           INITIALIZE DE-FIELDS-2.
      *----- SET PASS-DOCK-TRANS TO "MD" TO SKIP OVERSHIPMENT CHECK
           MOVE "MD" TO PASS-DOCK-TRANS.
           MOVE "Y" TO VAL-ACCEPT-OVERSHIPMENT-SW.
           MOVE ITM-NUMBER-IN    TO SD-ITM
                                    QTY-ITM.
           MOVE ITM-CORP-CODE-IN TO SD-CODE.
           MOVE ITM-QTY-ORD      TO SD-QTY-ORD.
           MOVE ITM-UM           TO SD-UM.
      *------IF ASN MOVE IN THE ASN QTY
      *    IF NOT ASN
             MOVE ITM-QTY-DLVR     TO SD-PREV-DLVR.
      *    ELSE
      *      MOVE ITM-ASN-QTY      TO SD-PREV-DLVR.
           MOVE ITM-UNIT-PRICE   TO SD-UNIT-PRICE.
           MOVE ITM-PRICE-UM     TO SD-PRICE-UM.
           MOVE ITM-QTY-STORED   TO SD-PREV-STORED.
           IF ITM-CONTAINER = "*"
               MOVE ITM-CONTAINER TO SD-CONTAINER
           ELSE
               MOVE SPACES TO SD-CONTAINER
           END-IF.
           IF ITM-CLASS NOT = SPACES
               MOVE ITM-CLASS TO SD-CLASS
           ELSE
               MOVE STR-CLASS TO SD-CLASS
           END-IF.
           MOVE ITM-SUB-DETL    TO SD-SUB-DETL.
           MOVE "Y"             TO SD-DIRECT-SW.
           MOVE PO-PRIME        TO CDD-PO-PRIME.
           MOVE PO-INTERNAL-ORDER-INDIC TO CDD-INTERNAL-PO.
           MOVE ITM-ADDL-DATA   TO CDD-PO-ADDL-DATA
                                   SD-ADDL-DATA.
           IF SD-CODE NOT = "NON-STR"
               CALL "CDDCHECK" USING PLT-NUMBER,
                                     DIRDEL-AREA,
                                     ITM-SUB-DETL,
                                     CDD-PO-ADDL-DATA,
                                     CDD-PO-PRIME,
                                     CDD-INTERNAL-PO,
                                     PO-CO,
                                     SD-CLASS
                                     RETURN-FLAGS
                                     PO-SUB
               MOVE RETURN-DD   TO SD-DIRECT-SW
           END-IF.
           IF A-KELLY-PLANT
               MOVE ITM-KELLY-PO-QTY TO SD-PO-QTY-ORD
               MOVE ITM-KELLY-PO-UM  TO SD-KELLY-PO-UM
               IF PO-BLANKET-INDIC = "B" OR
                  PO-BLANKET-INDIC = "Y"
                  MOVE 1      TO SD-KELLY-CF
               ELSE
                  IF SD-QTY-ORD = ZERO OR SD-PO-QTY-ORD = ZERO
                    MOVE 1 TO SD-KELLY-CF
                  ELSE
                    DIVIDE SD-QTY-ORD BY SD-PO-QTY-ORD
                      GIVING SD-KELLY-CF ROUNDED
                  END-IF
               END-IF
           END-IF.
           IF A-KELLY-PLANT
               IF PO-TYPE = "2"
                   MOVE "YES" TO QTY-RAW-YESNO
                   MOVE "Y" TO SD-RAW-FLAG
                   MOVE STR-RAW-LOT TO SD-LOT-NO
               END-IF
           ELSE
               IF SD-MAJOR-GROUP = RM-GROUP (1) OR RM-GROUP (2) OR
                                   RM-GROUP (3) OR RM-GROUP (4) OR
                                   RM-GROUP (5) OR RM-GROUP (6)
                   MOVE "YES" TO QTY-RAW-YESNO
                   MOVE "Y" TO SD-RAW-FLAG
                   MOVE STR-RAW-LOT TO SD-LOT-NO
               END-IF
           END-IF.
           IF SD-RAW-FLAG = "Y"
               IF ITM-LOT-IN = SPACES
                   MOVE "S    " TO QTY-RAW-LOT
               ELSE
                   MOVE ITM-LOT-IN TO QTY-RAW-LOT
               END-IF
           ELSE
               MOVE SPACES TO QTY-RAW-LOT
           END-IF.
           MOVE ITM-QTY-RCVD-IN   TO QTY-DLVR.
           MOVE ITM-UM-RCVD-IN    TO QTY-UM.
           MOVE ITM-TALLY-IN      TO QTY-TALLY.
           MOVE ITM-COMPLETE-IN   TO QTY-MATERIAL-COMPLETE.
           IF ITM-CONT-QTY-IN NUMERIC
               MOVE ITM-CONT-QTY-IN   TO QTY-CONT-DLVR
           ELSE
               MOVE ZEROS             TO QTY-CONT-DLVR.
           MOVE ITM-CONT-UM-IN    TO QTY-CONT-UM.
       643-PREP-CVALITEM-X.
           EXIT.

       65-PROCESS-ITM.
           IF RECORD-TYPE NOT = "ITMC"
               MOVE PO-ARG TO PORCVNO OF MPORCV-REC-I
               READ MPORCV-I INTO BUF-MPORCV
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF M-PO-LAST-RCVR NUMERIC
                   MOVE M-PO-LAST-RCVR TO RS-ARG-RS-9
               ELSE
                   MOVE ZEROS TO RS-ARG-RS-9
           END-IF.
           MOVE "N" TO CALLING-ROUTINE-FLAG.
           PERFORM 64-EDIT-ITM THRU 64-EDIT-ITM-X.
           IF RS-ITM-ERR NOT = "Y"
               PERFORM 74-ADD-ITM THRU 74-ADD-ITM-X
           ELSE
               PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X
           END-IF.
       65-PROCESS-ITM-X.
           EXIT.

       66-CORRECT-FRT.
           IF A-KELLY-PLANT
               MOVE KELLY-SEQ-IN TO PORCVSEQ OF MPORCV-REC2-I
               READ MPORCV2-I INTO BUF-MPORCV
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               MOVE M-PO-RCV-NO TO RS-ARG
           ELSE
               MOVE RS-NO-IN TO WS-RCVR
               MOVE PO-RECEIVING-SLIP TO RS-ARG
               MOVE RS-ARG TO PORCVNO OF MPORCV-REC-I
               READ MPORCV-I INTO BUF-MPORCV
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
            MOVE  "* RECEIVING SLIP DOES NOT EXIST *" TO ERR-MSG
            PERFORM 99-WRITE-ERROR
           ELSE
            IF A-KELLY-PLANT
               IF M-PO-RCV-NO-2-8 NOT = PO-NO-IN-1-7 OR
                  M-PO-RCV-NO-9-11 NOT = PO-NO-IN-8-10
                 MOVE  "* RECEIVING SLIP ON DIFFERENT PO *" TO ERR-MSG
                 MOVE "FR1C" TO ERR-RECORD-TYPE
                 MOVE "RCV SLIP FOR PO " TO ERR-LIT-1
                 MOVE PO-NO-IN TO ERR-VALUE-1
                 MOVE "ALREADY ON PO " TO ERR-LIT-2
                 MOVE M-PO-RCV-NO-2-8 TO ERR-VALUE-2
                 PERFORM 99-WRITE-ERROR
                 MOVE "Y" TO RS-FRT-ERR
               END-IF
            ELSE
             MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I
             READ DPORECD-I INTO BUF-DPORECD
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-READ
             PERFORM 62-EDIT-FRT THRU 62-EDIT-FRT-X
             IF RS-FRT-ERR NOT = "Y"
               MOVE RS-ARG TO PORCVNO OF DFREIGHT-REC-O
               READ DFREIGHT-O INTO BUF-DPOFREIGHT
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                  MOVE FILE-STATUS TO BU-DISPLAY-STAT
                  MOVE "READ DFREIGHT ERROR" TO BU-DISPLAY-MSG
                  MOVE RS-ARG TO BU-DISPLAY-FLD
                  PERFORM 99-PRINT-FATAL-ERROR
               END-IF
               PERFORM 730-MOVE-FRT THRU 730-MOVE-FRT-X
               REWRITE DFREIGHT-REC-O FROM BUF-DPOFREIGHT
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                  MOVE FILE-STATUS TO BU-DISPLAY-STAT
                  MOVE "REWRITE DFREIGHT ERROR" TO BU-DISPLAY-MSG
                  MOVE RS-ARG TO BU-DISPLAY-FLD
                  PERFORM 99-PRINT-FATAL-ERROR
               END-IF
               PERFORM 662-WRITE-FRTC-TC THRU 662-WRITE-FRTC-TC
               IF FRT-TYPE NOT = PO-FREIGHT-TERMS
                   PERFORM 732-DIFF-FRT-TERMS THRU 732-DIFF-FRT-TERMS-X
               END-IF
             END-IF
            END-IF
           END-IF.
           PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X.
       66-CORRECT-FRT-X.
           EXIT.

       662-WRITE-FRTC-TC.
      *-----FOR BATCH RECEIVING CREATE A 551/651 AND A 552 TRANS.
      *----- INSTEAD OF THE NORMAL 351/451 AND 352 TO INDICATE
      *----- THAT THE RECEIPT WAS VIA BATCH.
           MOVE SPACES TO BUF-DDAILYTC.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT              TO DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME.
           MOVE PLT-NUMBER                TO DDAILYTC-PLT.
           IF FRT-CHARGES-9 > 999999.99
               MOVE "651"                 TO DDAILYTC-TC
               MOVE RS-ARG                TO TC450-RS
               MOVE FRT-CARRIER           TO TC450-CARRIER
               MOVE FRT-BILL-NO           TO TC450-PRO-NUMBER
               MOVE FRT-BILL-DATE         TO TC450-PRO-DATE
               MOVE FRT-CHARGES-9         TO TC450-CHARGES
           ELSE
               MOVE "551"                 TO DDAILYTC-TC
               MOVE RS-ARG                TO TC350-RS
               MOVE FRT-CARRIER           TO TC350-CARRIER
               MOVE FRT-BILL-NO           TO TC350-PRO-NUMBER
               MOVE FRT-BILL-DATE         TO TC350-PRO-DATE
               MOVE FRT-PACK-SLIP         TO TC350-PACK-SLIP
               IF FRT-CHARGES-X = SPACES
                   MOVE ZERO              TO TC350-CHARGES
               ELSE
                   MOVE FRT-CHARGES-9     TO TC350-CHARGES
               END-IF
           END-IF.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DDAILYTC 351/451 ERROR" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.

           MOVE "553"                     TO DDAILYTC-TC.
           MOVE SPACES                    TO DDAILYTC-DATA.
           MOVE RS-ARG                    TO TC352-RS.
           MOVE FRT-ZBILL                 TO TC352-ZBILL.
           MOVE FRT-SPLC                  TO TC352-SPLC.
           IF AN-AKRON-PLANT
               MOVE FRT-CARRIER-WT        TO TC352-WEIGHT
           ELSE
               IF FRT-CARRIER-WT = ZEROS
                  MOVE FRT-OUR-WT         TO TC352-WEIGHT
               ELSE
                  MOVE FRT-CARRIER-WT     TO TC352-WEIGHT
               END-IF
           END-IF.
           MOVE FRT-RAIL-CAR              TO TC352-CAR.
           MOVE FRT-TYPE                  TO TC352-TYPE.
           IF NOT A-KELLY-PLANT AND NOT AN-AKRON-PLANT
               MOVE FRT-EMPL              TO VENDOR-PAID-PACK-SLIP
           END-IF.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DDAILYTC 352 ERROR" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.
       662-WRITE-FRTC-TC-X.
           EXIT.

       67-CORRECT-ITM.
           IF A-KELLY-PLANT
               MOVE KELLY-SEQ-IN TO PORCVSEQ OF MPORCV-REC2-I
               READ MPORCV2-I INTO BUF-MPORCV
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               MOVE M-PO-RCV-NO TO RS-ARG
           ELSE
               MOVE RS-NO-IN TO WS-RCVR
               MOVE PO-RECEIVING-SLIP TO RS-ARG
               MOVE RS-ARG TO PORCVNO OF MPORCV-REC-I
               READ MPORCV-I INTO BUF-MPORCV
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
             MOVE  "* RECEIVING SLIP DOES NOT EXIST *" TO ERR-MSG
             MOVE "ITMC" TO ERR-RECORD-TYPE
             PERFORM 99-WRITE-ERROR
             MOVE "Y" TO RS-FRT-ERR
             PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
             GO TO 67-CORRECT-ITM-X
           END-IF.
           IF A-KELLY-PLANT
              IF M-PO-RCV-NO-2-8 NOT = PO-NO-IN-1-7 OR
                 M-PO-RCV-NO-9-11 NOT = PO-NO-IN-8-10
                 MOVE  "* RECEIVING SLIP ON DIFFERENT PO *" TO ERR-MSG
                 MOVE "ITMC" TO ERR-RECORD-TYPE
                 MOVE "RCV SLIP FOR PO " TO ERR-LIT-1
                 MOVE PO-NO-IN TO ERR-VALUE-1
                 MOVE "ALREADY ON PO " TO ERR-LIT-2
                 MOVE M-PO-RCV-NO-2-8 TO ERR-VALUE-2
                 PERFORM 99-WRITE-ERROR
                 MOVE "Y" TO RS-FRT-ERR
                 PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
                 GO TO 67-CORRECT-ITM-X
             END-IF
           END-IF.

           MOVE PO-ARG TO MISC-RS-ARG.
           CALL "CVALRCVR" USING MISCELLANEOUS-DATA,
                                 USER-AREA, MESSAGE-BUFFER,
                                 LANG-SETNUM, LANG-MSGNUM,
                                 BUF-DPORECD, CVR-FILLER.
           IF  LANG-SETNUM NOT = ZEROES
               MOVE "Y" TO RS-ITM-ERR
               MOVE LANG-SETNUM          TO  CATREAD-MSG-SET
               MOVE LANG-MSGNUM          TO  CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE CATREAD-MSG-TEXT TO ERR-MSG
               MOVE "ITMC" TO ERR-RECORD-TYPE
               PERFORM 99-WRITE-ERROR
               PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
               PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X
               GO TO 67-CORRECT-ITM-X
           END-IF.

           MOVE ITM-NUMBER-IN TO ITEM-ARG.
           MOVE RS-ARG TO PORCVNO OF DRCVITEM-REC-I.
           MOVE ITEM-ARG TO ITEMNO OF DRCVITEM-REC-I.
           READ DRCVITEM-I INTO BUF-DRCVITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
      *----- IF CORRECTED RCVG ITEM DOES NOT EXIST, ADD THE RCVG ITEM
           IF FILE-STATUS NOT = "00"
             MOVE ITM-QTY-RCVD-IN TO ADJ-QTY
             PERFORM 65-PROCESS-ITM THRU 65-PROCESS-ITM-X
             GO TO 67-CORRECT-ITM-X
           END-IF.

      *----- EDIT CORRECTED ITEM
           MOVE "C" TO CALLING-ROUTINE-FLAG.
           MOVE RCV-QTY-DLVR TO CORRECTION-RS-PREV-DLVR.
           PERFORM 64-EDIT-ITM THRU 64-EDIT-ITM-X.
           IF RS-ITM-ERR = "Y"
               PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
               PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X
               GO TO 67-CORRECT-ITM-X.

      *-----SKIP PROCESSING IF QTY, UM, AND CONTAINER NOT CHANGED.
      *-----IF ONLY THE CONTAINER WAS CORRECTED, SEND A TRANSACTION
      *-----   BUT DO NOT UPDATE ANYTHING.
           IF A-KELLY-PLANT
               COMPUTE HOLD-KELLY-QTY ROUNDED =
                  RCV-QTY-DLVR / SD-KELLY-CF
               IF ITM-QTY-RCVD-IN = HOLD-KELLY-QTY
                  IF ITM-CONT-UM-IN = SPACES
                      GO TO 67-CORRECT-ITM-X
                  ELSE
                      MOVE "N" TO SD-DIRECT-SW
                      MOVE 1 TO CONTAINER-FLAG
                  END-IF
               END-IF
           ELSE
               IF ITM-QTY-RCVD-IN = RCV-QTY-DLVR
                   IF ITM-UM-RCVD-IN = ITM-UM
                       IF ITM-CONT-UM-IN = SPACES
                           GO TO 67-CORRECT-ITM-X
                       ELSE
                           MOVE 1 TO CONTAINER-FLAG
                           MOVE "N" TO SD-DIRECT-SW
                       END-IF
                   END-IF
               END-IF
           END-IF.
           IF CONTAINER-ONLY
              GO TO 67-UPDATE-RCVR.

           IF ITM-QTY-RCVD-IN < 0
             MOVE  "QUANTITY CANNOT BE BELOW ZERO" TO ERR-MSG
             MOVE "QTY IS NEGATIVE" TO ERR-LIT-1
             MOVE ITM-QTY-RCVD-IN TO ERR-VALUE-1-9
             MOVE "ITMC" TO ERR-RECORD-TYPE
             MOVE "Y" TO RS-ITM-ERR
             PERFORM 99-WRITE-ERROR
             PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X
             PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X
             GO TO 67-CORRECT-ITM-X
           END-IF.

           PERFORM 671-CALC-ADJ-QTY THRU 671-CALC-ADJ-QTY-X.

           IF NOT A-KELLY-PLANT
               IF ADJ-DLVR-TOTAL < ITM-QTY-PAID
                   MOVE "CANNOT REDUCE QTY DELIVERED BELOW QTY PAID"
                      TO ERR-MSG
                   MOVE "QTY RCV REDUCED TO" TO ERR-LIT-1
                   MOVE ADJ-DLVR-TOTAL TO ERR-VALUE-1-9
                   MOVE "QUANTITY PAID" TO ERR-LIT-2
                   MOVE ITM-QTY-PAID TO ERR-VALUE-2-9
                   MOVE "ITMC" TO ERR-RECORD-TYPE
                   MOVE "Y" TO RS-ITM-ERR
                   PERFORM 99-WRITE-ERROR
                   PERFORM 81-WRITE-FRT-REPORT THRU
                           81-WRITE-FRT-REPORT-X
                   PERFORM 82-WRITE-ITM-REPORT THRU
                           82-WRITE-ITM-REPORT-X
                   GO TO 67-CORRECT-ITM-X
               END-IF
           END-IF.

           MOVE "N" TO AUTO-STORE-SW.
           IF SD-DIRECT-SW = "N"
             PERFORM 7411-CHECK-AUTO-STORE THRU 7411-CHECK-AUTO-STORE-X.

      *----- IF NOT A DIRECT DELIVER AND NOT A NON CODED ITEM AND
      *-----    NOT AN AUTO STORE ITEM CHECK NEW DLVR AGAINST STORED
           IF SD-DIRECT-SW NOT = "Y" AND
              ITM-CORP-CODE-IN NOT = "NON-STR" AND
              AUTO-STORE-SW NOT = "Y"
               IF ADJ-QTY < 0
                   IF ITM-QTY-RCVD-IN < RCV-QTY-STORED
                       MOVE "CANNOT REDUCE DELIVERED BELOW STORED"
                         TO ERR-MSG
                       MOVE "QTY RCV REDUCED TO" TO ERR-LIT-1
                       MOVE ITM-QTY-RCVD-IN TO ERR-VALUE-1-9
                       MOVE "QUANTITY STORED" TO ERR-LIT-2
                       MOVE RCV-QTY-STORED TO ERR-VALUE-2-9
                       MOVE "ITMC" TO ERR-RECORD-TYPE
                       MOVE "Y" TO RS-ITM-ERR
                       PERFORM 99-WRITE-ERROR
                       PERFORM 81-WRITE-FRT-REPORT THRU
                               81-WRITE-FRT-REPORT-X
                       PERFORM 82-WRITE-ITM-REPORT THRU
                               82-WRITE-ITM-REPORT-X
                       GO TO 67-CORRECT-ITM-X
                   END-IF
              END-IF
           END-IF.

      *----- IF AN AUTO STORE ITEM DO NOT REDUCE STORE ONHAND BELOW ZERO
           IF AUTO-STORE-SW = "Y"
               IF ADJ-QTY < 0
                   IF A-KELLY-PLANT
                       COMPUTE ADJ-ONHAND-TOTAL ROUNDED =
                               STR-ONHAND + ADJ-STR-QTY
                   ELSE
                       COMPUTE ADJ-ONHAND-TOTAL ROUNDED =
                               STR-ONHAND + KELLY-ADJ-STR-QTY
                   END-IF
                   IF ADJ-ONHAND-TOTAL < 0
                       MOVE "CANNOT REDUCE STORE ONHAND BELOW ZERO"
                         TO ERR-MSG
                       MOVE "CURRENT ONHAND IS" TO ERR-LIT-1
                       MOVE STR-ONHAND TO ERR-VALUE-1-9
                       MOVE "TRY TO REDUCE BY" TO ERR-LIT-2
                       IF A-KELLY-PLANT
                          MOVE KELLY-ADJ-STR-QTY TO ERR-VALUE-2-9
                       ELSE
                           MOVE ADJ-STR-QTY TO ERR-VALUE-2-9
                       END-IF
                       MOVE "ITMC" TO ERR-RECORD-TYPE
                       MOVE "Y" TO RS-ITM-ERR
                       PERFORM 99-WRITE-ERROR
                       PERFORM 81-WRITE-FRT-REPORT THRU
                               81-WRITE-FRT-REPORT-X
                       PERFORM 82-WRITE-ITM-REPORT THRU
                               82-WRITE-ITM-REPORT-X
                       GO TO 67-CORRECT-ITM-X
                   END-IF
               END-IF
           END-IF.

           IF SD-DIRECT-SW NOT = "Y"
               PERFORM 672-UPDATE-PO-STATUS THRU 672-UPDATE-PO-STATUS-X.
           PERFORM 741-UPDATE-ACCUM THRU 741-UPDATE-ACCUM-X.
       67-UPDATE-RCVR.
           PERFORM 673-UPDATE-RCVR THRU 673-UPDATE-RCVR-X.
           PERFORM 744-UPDATE-STOREROOM THRU 744-UPDATE-STOREROOM-X.
           IF SD-DIRECT-SW = "Y"
               PERFORM 745-UPDATE-USAGE THRU 745-UPDATE-USAGE-X.
           IF RCV-QTY-DLVR < 1 AND OLD-LOT NOT = SPACES
               PERFORM 674-UPDATE-LOT THRU 674-UPDATE-LOT-X.
           PERFORM 675-WRITE-CORR-REASON THRU 675-WRITE-CORR-REASON-X.
           PERFORM 676-WRITE-ITMC-TC THRU 676-WRITE-ITMC-TC-X.
           PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X.
           PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X.
       67-CORRECT-ITM-X.
           EXIT.

       671-CALC-ADJ-QTY.
           SUBTRACT RCV-QTY-DLVR FROM ITM-QTY-RCVD-IN
               GIVING ADJ-QTY ROUNDED.
           ADD ADJ-QTY TO ITM-QTY-DLVR GIVING ADJ-DLVR-TOTAL.

      *-----CONVERT ADJUSTED QUANTITY TO STOREROOM UM
           IF NOT A-KELLY-PLANT
               IF ITM-CORP-CODE-IN NOT = "NON-STR"
                   MOVE "00"               TO UMCF-RET-CODE
                   MOVE SD-UM              TO UMCF-DEST-UM
                   MOVE ITM-UM-RCVD-IN     TO UMCF-SOURCE-UM
                   MOVE ADJ-QTY            TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                      UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE NOT = "00"
                       MOVE "ADJ QTY CONVERSION ERROR" TO BU-DISPLAY-MSG
                       MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD
                       PERFORM 99-PRINT-FATAL-ERROR
                   ELSE
                       MOVE UMCF-QTY-STR-UM-DEC TO ADJ-STR-QTY
                   END-IF
               END-IF
           END-IF.
       671-CALC-ADJ-QTY-X.
           EXIT.

       672-UPDATE-PO-STATUS.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-O.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MPORCV-O ERROR" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.

           IF M-PO-RCV-STAT = "XX"
               MOVE "MM" TO M-PO-RCV-STAT.

           REWRITE MPORCV-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-REWRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "REWRITE MPORCV-O ERROR" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.
       672-UPDATE-PO-STATUS-X.
           EXIT.

       673-UPDATE-RCVR.
           MOVE RS-ARG TO PORCVNO OF DRCVITEM-REC-O.
           MOVE ITEM-ARG TO ITEMNO OF DRCVITEM-REC-O.
           READ DRCVITEM-O INTO BUF-DRCVITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
              MOVE FILE-STATUS TO BU-DISPLAY-STAT
              MOVE "READ DRCVITEM-O ERROR" TO BU-DISPLAY-MSG
              MOVE RS-ARG TO BU-DISPLAY-FLD
              PERFORM 99-PRINT-FATAL-ERROR
           END-IF.

           MOVE ITM-QTY-RCVD-IN TO RCV-QTY-DLVR.
           IF RCV-QTY-DLVR < 1 AND RCV-LOT NOT = SPACES
               MOVE RCV-LOT TO OLD-LOT
               MOVE SPACES TO RCV-LOT
           END-IF.
           IF ITM-COMPLETE-IN = "X"
               MOVE "X" TO RCV-COMPLETE-FLAG
           END-IF.
           IF SD-DIRECT-SW = "Y" OR AUTO-STORE-SW = "Y"
               MOVE ITM-QTY-RCVD-IN TO RCV-QTY-STORED
           END-IF.

           MOVE ITM-UM TO RCV-ITEM-UM.
           IF A-KELLY-PLANT
               MOVE ITM-UM-RCVD-IN TO RCV-KELLY-PO-UM
               MOVE ITM-QTY-RCVD-IN TO RCV-KELLY-PO-QTY
               MULTIPLY SD-KELLY-CF BY ITM-QTY-RCVD-IN
                  GIVING RCV-QTY-DLVR ROUNDED
           END-IF.
           IF NOT CONTAINER-ONLY
               REWRITE DRCVITEM-REC-O FROM BUF-DRCVITEM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE FILE-STATUS TO BU-DISPLAY-STAT
                   MOVE "REWRITE DRCVITEM ERROR" TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.
       673-UPDATE-RCVR-X.
           EXIT.

       674-UPDATE-LOT.
           MOVE RCV-CORP-CODE TO LOT-CORP-CODE.
           MOVE OLD-LOT TO LOT-LOT.
           MOVE LOT-ARG TO CORPLOT OF DRAWLOT-REC-O.
           READ DRAWLOT-O INTO BUF-DRAWLOT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS = "00"
               DELETE DRAWLOT-O
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-DELETE
               IF FILE-STATUS NOT = "00"
                   MOVE "DELETE DRAWLOT ERROR" TO BU-DISPLAY-FLD
                   MOVE LOT-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.
       674-UPDATE-LOT-X.
           EXIT.

       675-WRITE-CORR-REASON.
           MOVE SPACES TO BUF-DRCVCORR.
           MOVE RS-ARG TO CORR-PO-NUMBER.
           MOVE ITM-NUMBER-IN TO CORR-ITEM.
           MOVE ITM-CORP-CODE-IN TO CORR-CORP-CODE.
           MOVE DATE-CYMD TO CORR-DATE-CN.
           MOVE BATCH-CORR-REASON TO CORR-REASON.
           WRITE DRCVCORR-REC-O FROM BUF-DRCVCORR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DRCVCORR ERROR" TO BU-DISPLAY-MSG
               MOVE RS-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.
       675-WRITE-CORR-REASON-X.
           EXIT.

       676-WRITE-ITMC-TC.
      *------ CALCULATE UNIT PRICE IN STOREROOM UNIT OF MEASURE.  TO
      *------ BE USED IN TRANSACTIONS 523, 623, 325, AND 425.
           IF ITM-CORP-CODE-IN NOT = "NON-STR"
               MOVE "PR"                     TO  UMCF-RET-CODE
               MOVE STR-UM                   TO  UMCF-DEST-UM
               MOVE SD-PRICE-UM              TO  UMCF-SOURCE-UM
               MOVE SD-UNIT-PRICE            TO  UMCF-SOURCE-QTY
               CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
                                  UMCF-QUANTITY-AREA
               IF UMCF-RET-CODE NOT = "00"
                 MOVE "PRICE UMCF ERROR " TO BU-DISPLAY-MSG
                 MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD
                 PERFORM 99-PRINT-FATAL-ERROR
               ELSE
                 MOVE UMCF-QTY-STR-UM-DEC  TO  SAVE-UNIT-PRICE.

           MOVE SPACES                TO BUF-DDAILYTC.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT          TO DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME.
           MOVE PLT-NUMBER            TO DDAILYTC-PLT.

      *************************************************************
      *      WRITE A TRANSACTION 524(BATCH DOCK CORRECT) FOR EVERY*
      *      RECEIVER ON EVERY ITEM.  ALSO WRITE A 524 FOR        *
      *      ANY RETURNABLE CONTAINERS.                           *
      *      IF UNIT PRICE > 9,999,999.99 THEN WRITE TC 624.      *
      *************************************************************
           MOVE SPACES                   TO  DDAILYTC-DATA.
           MOVE "524"                    TO  DDAILYTC-TC.

           IF SD-UNIT-PRICE  > 9999999.99
              PERFORM 677-ITMC-TC424 THRU 677-ITMC-TC424-X
              GO TO 676-WRITE-TC.

           MOVE ITM-CORP-CODE-IN         TO  TC323-CORPCODE.
           IF ITM-CORP-CODE-IN = "NON-STR"
              MOVE ITM-UM-RCVD-IN        TO  TC323-UM
           ELSE
              MOVE STR-UM                TO  TC323-UM.
           MOVE RS-ARG                   TO  TC323-RS.
           MOVE ITM-NUMBER-IN            TO  TC323-ITEM.
           MOVE SD-TC323-TC-FLAG         TO  TC323-TC-FLAG.
      *----------  CHANGE PRICE QTY TO STR UM IF NOT KELLY OR AKRON
           IF AN-AKRON-PLANT
              MOVE SD-UNIT-PRICE         TO  TC323-UNIT-PRICE
           ELSE
           IF NOT A-KELLY-PLANT
               IF ITM-CORP-CODE-IN = "NON-STR"
                  MOVE SD-UNIT-PRICE         TO  TC323-UNIT-PRICE
               ELSE
                  MOVE SAVE-UNIT-PRICE       TO  TC323-UNIT-PRICE
               END-IF.

           IF A-KELLY-PLANT
              MOVE SD-KELLY-PO-UM        TO  TC323-KELLY-PO-UM
              MOVE SD-CLASS              TO  TC323-KELLY-CLASS
              MOVE SD-SUB-DETL           TO  TC323-KELLY-SUBD
              MOVE KELLY-SEQ-IN          TO  TC323-KELLY-SEQ
              IF KELLY-PO-IND = "B"
                 MOVE ADJ-QTY       TO  TC323-KELLY-PRICE
                 IF ITM-CORP-CODE-IN = "NON-STR"
                    MOVE ADJ-QTY    TO  TC323-NONCODED-RCV-QTY
                 ELSE
                    MOVE ADJ-QTY    TO  TC323-CODED-RCV-QTY
              ELSE
                 IF ITM-CORP-CODE-IN = "NON-STR"
                    MOVE ADJ-QTY       TO  TC323-NONCODED-RCV-QTY
                                                TC323-KELLY-PRICE
                 ELSE
                    MOVE KELLY-ADJ-STR-QTY  TO  TC323-CODED-RCV-QTY
                                                TC323-KELLY-PRICE
           ELSE
              MOVE PO-PRIME              TO  TC323-PRIME
              MOVE SD-CLASS              TO  TC323-SUB
              MOVE SD-SUB-DETL           TO  TC323-SUB-DETAIL
              MOVE SD-ADDL-DATA          TO  TC323-ADDL-DATA
              IF AN-AKRON-PLANT OR (PLT-NUMBER-PASS = "310")
                IF ITM-CORP-CODE-IN  = "NON-STR"
                  MOVE SD-PO-QTY-DLVR        TO  TC323-NONCODED-RCV-QTY
                  MOVE SD-UM                 TO  TC323-UM
                ELSE
                  MOVE SD-PO-QTY-DLVR        TO  TC323-CODED-RCV-QTY
                  MOVE SD-UM                 TO  TC323-UM
              ELSE
                IF ITM-CORP-CODE-IN  = "NON-STR"
                  MOVE ADJ-QTY               TO  TC323-NONCODED-RCV-QTY
                  MOVE SD-UM                 TO  TC323-UM
                ELSE
                  MOVE ADJ-STR-QTY           TO  TC323-CODED-RCV-QTY
                  MOVE STR-UM                TO  TC323-UM.

           IF AN-AKRON-PLANT
               IF PO-INTERNAL-ORDER-INDIC = "X"
                   MOVE "N"                  TO  TC323-TC-FLAG
               END-IF
               IF PO-PRIME = "121"
                   IF PO-SUB = "102" OR "108"
                       MOVE "N"              TO  TC323-TC-FLAG
                   END-IF
               END-IF
               MOVE PO-SUB                   TO  PO-SUB-BREAKDOWN
               IF PO-PRIME = "121"
                   IF PO-SUB-CHAR = "4"
                       MOVE "N"              TO  TC323-TC-FLAG.

       676-WRITE-TC.
           IF NOT CONTAINER-ONLY
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE DDAILYTC TC324 " TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR.

           IF ITM-CONTAINER = "*"
             IF ITM-CONT-QTY-IN NOT = ZEROS AND
                ITM-CONT-UM-IN NOT = SPACES
      *----------  PUT 324 FOR CONTAINER CORRECTION
               MOVE ITM-CONT-UM-IN           TO  TC323-UM
               MOVE ITM-CONT-QTY-IN          TO  TC323-CODED-RCV-QTY
               MOVE ITM-NUMBER-IN            TO  WORK-ITEM
               MOVE "*"                      TO  WK-ASTERICK
               MOVE SHIFTED-ITEM             TO  TC323-ITEM
               IF A-KELLY-PLANT
                  MOVE ZEROS                 TO  TC323-KELLY-PRICE
               ELSE
                  MOVE ZEROS                 TO  TC323-UNIT-PRICE
               END-IF
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS   TO  FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE DDAILYTC TC324 CONTAINER"
                                           TO  BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR.
           IF AUTO-STORE-SW = "Y"
               MOVE SPACES TO DDAILYTC-DATA
               IF SD-UNIT-PRICE > 99999.99
                   MOVE "425" TO DDAILYTC-TC
                   MOVE ITM-CORP-CODE-IN TO TC425-CORPCODE
                   MOVE RS-ARG-2-14      TO TC425-RS
                   MOVE ITM-NUMBER-IN    TO TC425-ITEM
                   MOVE STR-UM TO TC425-UM
                   MOVE SD-UNIT-PRICE    TO TC425-PO-UNIT-PRICE
                   IF A-KELLY-PLANT
                       COMPUTE TC425-STORED-QTY ROUNDED =
                         KELLY-ADJ-STR-QTY + ZERO
                       MOVE KELLY-SEQ-IN TO TC425-KELLY-SEQ
                   ELSE
                       COMPUTE TC425-STORED-QTY ROUNDED =
                         ADJ-STR-QTY + ZERO
                       MOVE M-PO-RCV-SEQ TO TC425-KELLY-SEQ
                   END-IF
                   MOVE PO-CURRENCY-CODE TO TC425-CURRENCY-CODE
                   MOVE SD-CLASS         TO TC425-CLASS
               ELSE
                   MOVE "325" TO DDAILYTC-TC
                   MOVE ITM-CORP-CODE-IN TO TC325-CORPCODE
                   MOVE RS-ARG TO TC325-RS
                   MOVE ITM-NUMBER-IN    TO TC325-ITEM
                   MOVE STR-UM TO TC325-UM
                   MOVE SAVE-UNIT-PRICE  TO TC325-PO-UNIT-PRICE
                   IF A-KELLY-PLANT
                       COMPUTE TC325-STORED-QTY ROUNDED =
                         KELLY-ADJ-STR-QTY + ZERO
                       MOVE KELLY-SEQ-IN TO TC325-KELLY-SEQ
                   ELSE
                       COMPUTE TC325-STORED-QTY ROUNDED =
                         ADJ-STR-QTY + ZERO
                       MOVE RS-ARG TO PORCVNO OF MPORCV-REC-I
                       READ MPORCV-I INTO BUF-MPORCV
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                       END-READ
                       MOVE M-PO-RCV-SEQ TO TC325-KELLY-SEQ
                   END-IF
                   MOVE PO-CURRENCY-CODE TO TC325-CURRENCY-CODE
                   MOVE STR-CLASS        TO TC325-CLASS
               END-IF
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE ERR DDAILYTC TC325" TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.
           IF MISC-P326-SW = "Y"
               MOVE SPACES TO DDAILYTC-DATA
               MOVE "326" TO DDAILYTC-TC
               MOVE ITM-CORP-CODE-IN TO TC326-CORPCODE
               MOVE RS-ARG TO TC326-RS
               MOVE ITM-NUMBER-IN TO TC326-ITEM
               MOVE ITM-COMPANY TO TC326-COMPANY
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE DDAILYTC TC326" TO BU-DISPLAY-MSG
                   MOVE RS-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR.
       676-WRITE-ITMC-TC-X.
           EXIT.

       677-ITMC-TC424.
           MOVE ITM-CORP-CODE-IN         TO  TC423-CORPCODE.
           IF AN-AKRON-PLANT
            IF ITM-CORP-CODE-IN  = "NON-STR"
              MOVE SD-PO-QTY-DLVR        TO  TC423-NONCODED-RCV-QTY
              MOVE ITM-UM-RCVD-IN        TO  TC423-UM
            ELSE
              MOVE SD-PO-QTY-DLVR        TO  TC423-CODED-RCV-QTY
              MOVE ITM-UM-RCVD-IN        TO  TC423-UM
           ELSE
            IF ITM-CORP-CODE-IN  = "NON-STR"
              MOVE ADJ-QTY               TO  TC423-NONCODED-RCV-QTY
              MOVE ITM-UM-RCVD-IN        TO  TC423-UM
            ELSE
              MOVE ADJ-STR-QTY           TO  TC423-CODED-RCV-QTY
              MOVE ITM-UM-RCVD-IN        TO  TC423-UM.


           MOVE "624"                    TO  DDAILYTC-TC.
           MOVE RS-ARG-2-14              TO  TC423-RS.
           MOVE ITM-NUMBER-IN            TO  TC423-ITEM.
           MOVE SD-TC323-TC-FLAG         TO  TC423-TC-FLAG.

      *----------  CHANGE PRICE QTY TO STR UM IF NOT KELLY OR AKRON
           IF AN-AKRON-PLANT
              MOVE SD-UNIT-PRICE         TO  TC423-UNIT-PRICE
           ELSE
           IF NOT A-KELLY-PLANT
               IF ITM-CORP-CODE-IN  = "NON-STR"
                  MOVE SD-UNIT-PRICE         TO  TC423-UNIT-PRICE
               ELSE
                  MOVE SAVE-UNIT-PRICE       TO  TC423-UNIT-PRICE.

           IF A-KELLY-PLANT
              MOVE SD-PO-QTY-DLVR        TO  TC423-KELLY-PRICE
              MOVE SD-KELLY-PO-UM        TO  TC423-KELLY-PO-UM
              MOVE SD-CLASS              TO  TC423-KELLY-CLASS
              MOVE SD-SUB-DETL           TO  TC423-SUB-DETAIL
              MOVE KELLY-SEQ-IN          TO  TC423-KELLY-SEQ
              IF ITM-CORP-CODE-IN = "NON-STR"
                 MOVE SD-STR-QTY-DLVR    TO  TC423-NONCODED-RCV-QTY
              ELSE
                 MOVE SD-STR-QTY-DLVR    TO  TC423-CODED-RCV-QTY
           ELSE
              MOVE PO-PRIME              TO  TC423-PRIME
              MOVE SD-CLASS              TO  TC423-SUB
              MOVE SD-SUB-DETL           TO  TC423-SUB-DETAIL
              MOVE SD-ADDL-DATA          TO  TC423-ADDL-DATA.
       677-ITMC-TC424-X.
           EXIT.

       7-CREATE-RS.
           PERFORM 71-GET-NEXT-RS THRU 71-GET-NEXT-RS-X.
           PERFORM 72-ADD-RS THRU 72-ADD-RS-X.
           PERFORM 73-ADD-FRT THRU 73-ADD-FRT-X.
           PERFORM 74-ADD-ITM THRU 74-ADD-ITM-X.
       7-CREATE-RS-X.
           EXIT.

       71-GET-NEXT-RS.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-O.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MPORCV ACCUM" TO BU-DISPLAY-MSG
               MOVE PO-ARG                      TO BU-DISPLAY-FLD
               GO TO 99-PRINT-FATAL-ERROR.

           IF M-PO-LAST-RCVR-X = SPACES
               MOVE 1 TO M-PO-LAST-RCVR
                         RS-ARG-RS-9
           ELSE
               ADD 1 TO M-PO-LAST-RCVR
               MOVE M-PO-LAST-RCVR TO RS-ARG-RS-9
           END-IF.

           REWRITE MPORCV-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE MPORCV" TO BU-DISPLAY-MSG
               MOVE FILE-STATUS                 TO BU-DISPLAY-STAT
               MOVE PO-ARG                      TO BU-DISPLAY-FLD
               GO TO 99-PRINT-FATAL-ERROR.
       71-GET-NEXT-RS-X.
           EXIT.

       72-ADD-RS.
           IF NOT A-KELLY-PLANT
               MOVE "PSQR" TO MPLT-ARG
               MOVE MPLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-O
               READ MPLTINFO-O INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                  MOVE FILE-STATUS TO BU-DISPLAY-STAT
                  MOVE "READ MPLTINFO PSQR" TO BU-DISPLAY-MSG
                  PERFORM 99-PRINT-FATAL-ERROR
               END-IF

               ADD 1                          TO MPLTINFO-RCV-SEQ
               REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                  MOVE FILE-STATUS TO BU-DISPLAY-STAT
                  MOVE "REWRITE MPLTINFO PSQR" TO BU-DISPLAY-MSG
                  MOVE MPLTINFO-RCV-SEQ TO BU-DISPLAY-FLD
                  PERFORM 99-PRINT-FATAL-ERROR
               END-IF
               MOVE MPLTINFO-RCV-SEQ TO SEQ-NO-CONVERT
           ELSE
               MOVE KELLY-SEQ-IN TO SEQ-NO-CONVERT
           END-IF.

           MOVE RS-ARG TO M-PO-RCV-NO.
           PERFORM 721-FIND-RS-STATUS THRU 721-FIND-RS-STATUS-X.
           MOVE SEQ-NO-CONVERT TO M-PO-RCV-SEQ.
           WRITE MPORCV-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
                MOVE FILE-STATUS TO BU-DISPLAY-STAT
                MOVE "WRITE MPORCV" TO BU-DISPLAY-MSG
                MOVE RS-ARG TO BU-DISPLAY-FLD
                PERFORM 99-PRINT-FATAL-ERROR
           END-IF.
           MOVE "Y" TO RS-CREATED.
       72-ADD-RS-X.
           EXIT.

       721-FIND-RS-STATUS.
      *----NEED TO DETERMINE RS STATUS BY ITEMS ON THE PO
      *---  IF ASHEBORO THEN STATUS = SPACES
      *---  IF PO HAS DIRECT CHARGE AND STOREROOM ITEMS THEN STATUS = MX
      *---  IF PO HAS ALL DIRECT CHARGE ITEMS THEN STATUS = XX
      *---  IF PO HAS ALL STOREROOM ITEMS THEN STATUS = SPACES
           IF THE-ASHEBORO-PLANT
               MOVE SPACES TO M-PO-RCV-STAT
               GO TO 721-FIND-RS-STATUS-X.

           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-START.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "START ON DPOITEM" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           END-IF.
           MOVE "N" TO DIRECT-CHARGE-SW.
           MOVE "N" TO STOREROOM-ITEM-SW.
       721-LOOP-DPOITEM.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS = "00"
               IF ITM-PO-RCV-NO = PO-ARG
                   IF ITM-CORP-CODE = "NON-STR"
                       MOVE "Y" TO DIRECT-CHARGE-SW
                   ELSE
                       CALL "CDDCHECK" USING PLT-NUMBER,
                                     DIRDEL-AREA,
                                     ITM-SUB-DETL,
                                     CDD-PO-ADDL-DATA,
                                     CDD-PO-PRIME,
                                     CDD-INTERNAL-PO,
                                     PO-CO,
                                     SD-CLASS
                                     RETURN-FLAGS
                       IF RETURN-DD = "Y"
                           MOVE "Y" TO DIRECT-CHARGE-SW
                       ELSE
                           MOVE "Y" TO STOREROOM-ITEM-SW
                       END-IF
                   END-IF
                   GO TO 721-LOOP-DPOITEM
               END-IF
           END-IF.
           IF DIRECT-CHARGE AND STOREROOM-ITEM
               MOVE "MX  " TO M-PO-RCV-STAT
           ELSE
           IF DIRECT-CHARGE AND NOT STOREROOM-ITEM
               MOVE "XX  " TO M-PO-RCV-STAT
           ELSE
           IF NOT DIRECT-CHARGE AND STOREROOM-ITEM
               MOVE SPACES TO M-PO-RCV-STAT.
       721-FIND-RS-STATUS-X.
           EXIT.

       73-ADD-FRT.
      *************************************************************
      *        UPDATE FREIGHT SEGMENT WITH FREIGHT DATA           *
      *************************************************************
           INITIALIZE BUF-DPOFREIGHT.
           PERFORM 730-MOVE-FRT THRU 730-MOVE-FRT-X.
           WRITE DFREIGHT-REC-O FROM BUF-DPOFREIGHT
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DFREIGHT - ADD-FRT" TO BU-DISPLAY-MSG
               MOVE RS-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR
           ELSE
      *----------IF ASN DO NOT WRITE FRT TC
               IF NOT ASN
                   PERFORM 731-WRITE-FRT-TC THRU 731-WRITE-FRT-TC-X
               END-IF
               IF FRT-TYPE NOT = PO-FREIGHT-TERMS
                   PERFORM 732-DIFF-FRT-TERMS THRU 732-DIFF-FRT-TERMS-X
               END-IF
           END-IF.
           PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X.
       73-ADD-FRT-X.
           EXIT.

       730-MOVE-FRT.
           MOVE RS-ARG                 TO  FRT-PO-RCV-NO.
           MOVE FR1-FRT-TYPE-HOLD      TO  FRT-TYPE.
           MOVE FR1-EMPLOYEE-HOLD      TO  FRT-EMPL.
           MOVE FR1-PACK-SLIP-HOLD     TO  FRT-PACK-SLIP.
           MOVE FR1-CARRIER-HOLD       TO  FRT-CARRIER.
           MOVE FR2-BILL-NUMBER-HOLD   TO  FRT-BILL-NO.
           IF FR1-CHARGES-HOLD NOT = ZERO
               MOVE FR1-CHARGES-HOLD       TO  FRT-CHARGES-9.
           MOVE FR2-ORIGIN-HOLD        TO  FRT-SPLC.
           IF FR1-CARR-WEIGHT-HOLD NOT = ZERO
               MOVE FR1-CARR-WEIGHT-HOLD   TO  FRT-CARRIER-WT.
           IF FR1-DOCK-WEIGHT-HOLD NOT = ZERO
               MOVE FR1-DOCK-WEIGHT-HOLD   TO  FRT-OUR-WT.
           MOVE FR2-RAIL-CAR-HOLD      TO  FRT-RAIL-CAR.
           MOVE FR1-LOT-HOLD           TO  FRT-LOT.
           MOVE FR1-SEALS-HOLD         TO  FRT-SEALS.
           MOVE FR2-OSD-NUMBER-HOLD    TO  FRT-OSD.
           IF WORK-DATE-C NOT = "00"
               MOVE WORK-DATE-C        TO  FRT-CC
               MOVE WORK-DATE-Y        TO  FRT-YY.
      *--- CORRECTED LOGIC--WAS NOT MOVING THE YEAR IF IT WAS 2000.
      *****IF WORK-DATE-Y NOT = "00"
      *********MOVE WORK-DATE-Y        TO  FRT-YY.
           IF WORK-DATE-M NOT = "00"
               MOVE WORK-DATE-M        TO  FRT-MM.
           IF WORK-DATE-D NOT = "00"
               MOVE WORK-DATE-D        TO  FRT-DD.
           MOVE SPACES                 TO  FRT-REFERBACK.
           MOVE FR2-Z-BILL-HOLD        TO  FRT-ZBILL.
           MOVE FR2-COMMENTS-HOLD      TO  FRT-OSD-CLAIM.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT TO DATE-CYMD-YMD.
           IF DATE-CYMD-YY > 70
               MOVE 19 TO DATE-CYMD-CC
           ELSE
               MOVE 20 TO DATE-CYMD-CC
           END-IF.
           MOVE DATE-CYMD              TO  FRT-DATE-RCVD-CN.
      *------INDICATE THAT THIS RECORD IS AN ASN RECORD, WHEN
      *------  PHYSICALLY RECEIVED, THIS WILL BECOME BLANK.
           IF ASN
               MOVE "X" TO FRT-ASN-INDIC.
       730-MOVE-FRT-X.
           EXIT.

       731-WRITE-FRT-TC.
      *************************************************************
      *   NOTE -- TRANSACTIONS MUST BE KEPT IN THIS ORDER         *
      *           (550, 552, 523) BECAUSE OF IBM'S P7205 PROGRAM. *
      *           TRANSACTION 523 IS CREATED AFTER RETURNING      *
      *           FROM THIS ROUTINE.                              *
      *************************************************************
      *     DDAILYTC - PUT A TRANSACTION CODE OF 550 OR 650       *
      *           550/650 IS CREATED INSTEAD OF THE NORMAL 350/450*
      *           TO INDICATE BATCH RECEIPT.                      *
      *************************************************************
           MOVE SPACES                     TO BUF-DDAILYTC.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT               TO DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT  TO DDAILYTC-TIME.
           MOVE PLT-NUMBER                 TO DDAILYTC-PLT.
           MOVE SPACES                     TO DDAILYTC-DATA.

           IF FRT-CHARGES-9 > 9999999.99
              GO TO 731-CREATE-TC450.
           MOVE "550"                      TO DDAILYTC-TC.
           MOVE RS-ARG                     TO TC350-RS.
           MOVE FR1-CARRIER-HOLD           TO TC350-CARRIER.
           MOVE FR2-BILL-NUMBER-HOLD       TO TC350-PRO-NUMBER.
           MOVE WORK-DATE-D                TO TC350-PRO-DD.
           MOVE WORK-DATE-M                TO TC350-PRO-MM.
           MOVE WORK-DATE-Y                TO TC350-PRO-YY.
           IF AN-AKRON-PLANT
              MOVE FR2-RAIL-CAR-HOLD       TO TC350-PACK-SLIP
           ELSE
              MOVE FR1-PACK-SLIP-HOLD      TO TC350-PACK-SLIP.

           MOVE FR1-CHARGES-HOLD            TO TC350-CHARGES.
           GO TO 731-PUT-TC350.

       731-CREATE-TC450.
           MOVE "650"                       TO DDAILYTC-TC.
           MOVE RS-ARG                      TO TC450-RS.
           MOVE FR1-CARRIER-HOLD            TO TC450-CARRIER.
           MOVE WORK-DATE-D                 TO TC450-PRO-DD.
           MOVE WORK-DATE-M                 TO TC450-PRO-MM.
           MOVE WORK-DATE-Y                 TO TC450-PRO-YY.
           MOVE FR1-CHARGES-HOLD            TO TC450-CHARGES.

       731-PUT-TC350.
           IF DDAILYTC-TC = "650"
              IF FR1-FRT-TYPE-HOLD = "G" OR "C"
                 IF TC450-PRO-DATE = SPACES
                    MOVE DDAILYTC-DATE TO TC450-PRO-DATE.
           IF DDAILYTC-TC = "550"
              IF FR1-FRT-TYPE-HOLD = "G" OR "C"
                 IF TC450-PRO-DATE = SPACES
                    MOVE DDAILYTC-DATE TO TC350-PRO-DATE.

           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE 550 DDAILYTC 731 TBCHDOCK"
                                TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.

      *************************************************************
      *          DDAILYTC  PUT A TRANSACTION CODE OF 552          *
      *             A 552 IS CREATED INSTEAD OF A 352 TO INDICATE *
      *             A BATCH RECEIPT.                              *
      *************************************************************
           MOVE SPACES                    TO DDAILYTC-DATA.
           MOVE RS-ARG                    TO TC352-RS.
           MOVE "552"                     TO DDAILYTC-TC.

           IF A-KELLY-PLANT
              NEXT SENTENCE
           ELSE
           IF AN-AKRON-PLANT
               NEXT SENTENCE
           ELSE
               MOVE FR1-EMPLOYEE-HOLD TO VENDOR-PAID-PACK-SLIP.

           MOVE FR2-ORIGIN-HOLD           TO TC352-SPLC.

           MOVE FR2-RAIL-CAR-HOLD         TO TC352-CAR.
           MOVE FR1-FRT-TYPE-HOLD         TO TC352-TYPE.

      *---------- (11/5/85) IF VENDOR NEEDS TO BE PAID UPON RECEIPT,
      *                     PASS THE PACKING SLIP NUMBER.
           IF VENDOR-SW = "Y"
              MOVE FR1-PACK-SLIP-HOLD     TO VENDOR-PAID-PACK-SLIP.

      *----------  IF A PO HAS MORE THAN ONE Z-BILL, PUT "MULTZ". IF A PO
      *            HAD FREIGHT COME IN ON ANOTHER RECEIVER, PUT "MULTI".
      *            RECEIVER, PUT "MULTI".
           IF MISC-MULTIZ = "Z"
               MOVE "MULTZ"               TO TC352-ZBILL
           ELSE
               MOVE FR2-Z-BILL-HOLD       TO TC352-ZBILL.

           IF AN-AKRON-PLANT
              MOVE FR1-CARR-WEIGHT-HOLD TO TC352-WEIGHT
           ELSE
              IF FR1-CARR-WEIGHT-HOLD = ZEROES
                  MOVE FR1-DOCK-WEIGHT-HOLD TO TC352-WEIGHT
              ELSE
                  MOVE FR1-CARR-WEIGHT-HOLD TO TC352-WEIGHT.

       731-PUT-TC352.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE 552 DDAILYTC 731 TBCHDOCK" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.
       731-WRITE-FRT-TC-X.
           EXIT.

       732-DIFF-FRT-TERMS.
           MOVE SPACES TO KFRTERMS-REC-O.
           MOVE DDAILYTC-DATE     TO FREIGHT-YMD.
           IF FREIGHT-YY > "70"
               MOVE "19"          TO FREIGHT-CC
           ELSE
               MOVE "20"          TO FREIGHT-CC.
           MOVE FREIGHT-DATE-CN   TO KTERMDAT.
      **** MOVE DDAILYTC-DATE TO KTERMDAT.
           MOVE DDAILYTC-TIME TO KTERMTIM.
           MOVE PO-VEN-CODE   TO KTERMVEN.
           MOVE PO-ARG        TO KTERMPO.
           MOVE PO-FREIGHT-TERMS TO KTERMPOTRM.
           MOVE FRT-TYPE      TO KTERMRCVRT.
           WRITE KFRTERMS-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE KFRTTERMS ERROR" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.
       732-DIFF-FRT-TERMS-X.
           EXIT.

       74-ADD-ITM.
           PERFORM 741-UPDATE-ACCUM THRU 741-UPDATE-ACCUM-X.
      *-----IF ASN DO NOT UPDATE LEAD TIMES
           IF NOT ASN
            IF ITM-CORP-CODE-IN NOT = "NON-STR"
             PERFORM 742-UPDATE-LEAD-TIMES THRU 742-UPDATE-LEAD-TIMES-X.
           PERFORM 743-ADD-RS-ITM THRU 743-ADD-RS-ITM-X.
      *------DO NOT UPDATE STOREROOM IF ASN
           IF NOT ASN
             IF ITM-CORP-CODE-IN NOT = "NON-STR"
               PERFORM 744-UPDATE-STOREROOM THRU 744-UPDATE-STOREROOM-X.
      *------DO NOT UPDATE USAGE IF ASN
           IF NOT ASN
             IF SD-DIRECT-SW = "Y"
               PERFORM 745-UPDATE-USAGE THRU 745-UPDATE-USAGE-X.
           IF ITM-CORP-CODE-IN NOT = "NON-STR" AND
              ITM-TALLY-IN NOT = SPACES
               PERFORM 746-WRITE-TALLY THRU 746-WRITE-TALLY-X.
           IF SD-RAW-FLAG = "Y"
               PERFORM 747-WRITE-RAWLOT THRU 747-WRITE-RAWLOT-X.
      *------IF ASN DO NOT WRITE TRANSACTIONS
           IF NOT ASN
             PERFORM 748-WRITE-ITM-TC THRU 748-WRITE-ITM-TC-X.
           IF RECORD-TYPE = "ITMC"
               PERFORM 81-WRITE-FRT-REPORT THRU 81-WRITE-FRT-REPORT-X.
           PERFORM 82-WRITE-ITM-REPORT THRU 82-WRITE-ITM-REPORT-X.
       74-ADD-ITM-X.
           EXIT.

       741-UPDATE-ACCUM.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-O.
           MOVE ITEM-ARG TO ITEMNO OF DPOITEM-REC-O.
           READ DPOITEM-O INTO BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ DPOITEMO TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.

           IF RECORD-TYPE NOT = "ITMC"
               IF A-KELLY-PLANT
                   ADD SD-STR-QTY-DLVR SD-PREV-DLVR
                     GIVING ITM-QTY-DLVR ROUNDED
               ELSE
      *------------IF ASN ADD TO ACCUMULATED ASN QTY (IN SD-PREV-DLVR)
                   IF ASN
                     ADD SD-PO-QTY-DLVR SD-PREV-DLVR
                        GIVING ITM-ASN-QTY ROUNDED
                   ELSE
                     ADD SD-PO-QTY-DLVR SD-PREV-DLVR
                        GIVING ITM-QTY-DLVR ROUNDED
                   END-IF
               END-IF
               IF SD-UM = "LT" OR "AS"
                   MOVE .0001 TO ITM-QTY-DLVR
               END-IF
               MOVE "1" TO DATE-MODE

               CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS
               MOVE DATE-YMD-OUT TO DATE-CYMD-YMD
               IF DATE-CYMD-YY > 70
                   MOVE 19 TO DATE-CYMD-CC
               ELSE
                   MOVE 20 TO DATE-CYMD-CC
               END-IF
               IF NOT ASN
                   MOVE DATE-CYMD TO ITM-DATE-RCVD-CN
               ELSE
                   MOVE DATE-CYMD TO ITM-ASN-DATE
               END-IF

      *        IF ASN SKIP DIRECT DELIVERY AND AUTO STORE
      *        BECAUSE STUFF IS NOT HERE YET.
               IF NOT-ASN
                 IF SD-DIRECT-SW = "Y"
                   MOVE "DD" TO MM-STORED
                   MOVE SPACES TO DD-STORED
                                  YY-STORED
                                  CC-STORED
                   IF A-KELLY-PLANT
                       ADD SD-STR-QTY-DLVR SD-PREV-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                   ELSE
                       ADD SD-PO-QTY-DLVR SD-PREV-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                 ELSE
                   MOVE SPACES TO ITM-DATE-STORED-CN
                 END-IF

                 MOVE "N" TO AUTO-STORE-SW
                 IF SD-DIRECT-SW = "N"
                   PERFORM 7411-CHECK-AUTO-STORE THRU
                           7411-CHECK-AUTO-STORE-X
                 END-IF
                 IF AUTO-STORE-SW = "Y"
                   MOVE ITM-DATE-RCVD-CN TO ITM-DATE-STORED-CN
                   IF A-KELLY-PLANT
                       ADD SD-STR-QTY-DLVR SD-PREV-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                   ELSE
                       ADD SD-PO-QTY-DLVR SD-PREV-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                   END-IF
                 END-IF

                 IF ITM-COMPLETE-IN = "Y"
                   MOVE "*" TO ITM-COMPLETE-FLAG
                 END-IF
               END-IF
           ELSE
               IF A-KELLY-PLANT
                   MOVE ITM-QTY-RCVD-IN TO ITM-QTY-PAID
                   MULTIPLY SD-KELLY-CF BY ADJ-QTY
                       GIVING KELLY-ADJ-STR-QTY
                   ADD KELLY-ADJ-STR-QTY TO ITM-QTY-DLVR
                       GIVING ITM-QTY-DLVR ROUNDED
                   IF SD-DIRECT-SW = "Y" OR AUTO-STORE-SW = "Y"
                       ADD KELLY-ADJ-STR-QTY TO ITM-QTY-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                   END-IF
               ELSE
                   ADD ADJ-QTY TO ITM-QTY-DLVR
                       GIVING ITM-QTY-DLVR ROUNDED
                   IF SD-DIRECT-SW = "Y" OR AUTO-STORE-SW = "Y"
                       ADD ADJ-QTY TO ITM-QTY-STORED
                           GIVING ITM-QTY-STORED ROUNDED
                   END-IF
               END-IF
               IF ITM-QTY-STORED < ZEROS
                   MOVE ZEROS TO ITM-QTY-STORED
               END-IF
               IF ITM-COMPLETE-IN = "X"
                   MOVE "X" TO ITM-COMPLETE-FLAG
               END-IF
           END-IF.

           REWRITE DPOITEM-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-REWRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "REWRITE DPOITEM TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE PO-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
       741-UPDATE-ACCUM-X.
           EXIT.

       7411-CHECK-AUTO-STORE.
           SET I TO 1.
           SEARCH AUTOSTR-AREA
               AT END
                   MOVE "N" TO AUTO-STORE-SW
               WHEN AUTOSTORE-GRP (I) = SD-MAJOR-GROUP
                   MOVE AUTOSTORE-SW (I) TO AUTO-STORE-SW.
       7411-CHECK-AUTO-STORE-X.
           EXIT.

       742-UPDATE-LEAD-TIMES.
      *----- CALCULATE LEAD TIME FROM PO DATE AND CURRENT DATE
           CALL "CDATCALC" USING PO-DATE ACTIVITY-DATE CALC-LT.
           MOVE CALC-LT TO CALC-LT2.
           IF CALC-LT = ZEROS
               GO TO 742-UPDATE-LEAD-TIMES-X.

           MOVE ITM-CORP-CODE-IN TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC-O.
           START DVENDITM-O KEY = CORPCDE OF DVENDITM-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-START.
           IF FILE-STATUS NOT = "00"
               GO TO 742-UPDATE-LEAD-TIMES-X.
           MOVE 0 TO FOUND-DVENDITM-ENTRY.
       742-LOOP-FOR-VENDOR.
           READ DVENDITM-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS = "00"
               IF CODE-ARG NOT = VEN-ITM-CORPCODE
                   MOVE "10" TO FILE-STATUS.
           IF FILE-STATUS = "10" OR "14" OR "46"
               IF FOUND-DVENDITM-ENTRY = 0
                   MOVE SPACES TO BUF-DVENDITM
                   MOVE ZEROS TO VEN-ITM-PRICE
                                 VEN-EST-LT
                                 VEN-ITM-LT1
                                 VEN-ITM-LT2
                                 VEN-ITM-LT3
                                 VEN-LOW-QTY (1)
                                 VEN-LOW-QTY (2)
                                 VEN-LOW-QTY (3)
                                 VEN-HIGH-QTY (1)
                                 VEN-HIGH-QTY (2)
                                 VEN-HIGH-QTY (3)
                                 VEN-WORK-PRICE (1)
                                 VEN-WORK-PRICE (2)
                                 VEN-WORK-PRICE (3)
                                 VEN-BID-QTY
                                 VEN-SURCHARGE
                                 VEN-DISCOUNT-PERCENT
                                 VEN-NONCODED-ITEM
                                 VEN-ITM-YTD-BUS
                   MOVE PO-VEN-CODE TO VEN-ITM-VENCODE
                   MOVE CALC-LT TO VEN-ITM-LT1
                   MOVE CODE-ARG TO VEN-ITM-CORPCODE
                   WRITE DVENDITM-REC-O FROM BUF-DVENDITM
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-WRITE
                   IF FILE-STATUS NOT = "00"
                     MOVE FILE-STATUS TO BU-DISPLAY-STAT
                     MOVE "WRITE DVENDITM TBCHDOCK" TO BU-DISPLAY-MSG
                     MOVE CODE-ARG TO BU-DISPLAY-FLD
                     PERFORM 99-PRINT-FATAL-ERROR
                   END-IF
                   GO TO 742-UPDATE-LEAD-TIMES-X
               ELSE
                   GO TO 742-UPDATE-LEAD-TIMES-X
               END-IF.
           IF VEN-ITM-VENCODE NOT = PO-VEN-CODE
               GO TO 742-LOOP-FOR-VENDOR.
           MOVE VEN-ITM-LT2 TO VEN-ITM-LT3.
           MOVE VEN-ITM-LT1 TO VEN-ITM-LT2.
           MOVE CALC-LT TO VEN-ITM-LT1.
           MOVE 1 TO FOUND-DVENDITM-ENTRY.
           REWRITE DVENDITM-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-REWRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "REWRITE DVENDITM TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
           GO TO 742-LOOP-FOR-VENDOR.
       742-UPDATE-LEAD-TIMES-X.
           EXIT.

       743-ADD-RS-ITM.
           INITIALIZE BUF-DRCVITEM.
           MOVE ITM-CORP-CODE-IN      TO RCV-CORP-CODE.
           MOVE ITM-NUMBER-IN         TO RCV-ITEM-NUMBER.
           MOVE ITM-UM-RCVD-IN        TO RCV-ITEM-UM.
           MOVE ITM-COMMENT-IN        TO RCV-COMMENT.
           IF A-KELLY-PLANT
               MOVE SD-STR-QTY-DLVR   TO RCV-QTY-DLVR
           ELSE
      *--------IF ASN MOVE INTO ASN QTY
             IF NOT ASN
               MOVE SD-PO-QTY-DLVR    TO RCV-QTY-DLVR
             ELSE
               MOVE SD-PO-QTY-DLVR    TO RCV-ASN-QTY
             END-IF
           END-IF.
           IF ITM-UM-RCVD-IN = "LT" OR "AS"
               MOVE .0001             TO RCV-QTY-DLVR.
           MOVE ZEROS                 TO RCV-QTY-STORED.
           MOVE SPACES                TO RCV-DATE-STORED-CN.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT TO DATE-CYMD-YMD.
           IF DATE-CYMD-YY > 70
               MOVE 19 TO DATE-CYMD-CC
           ELSE
               MOVE 20 TO DATE-CYMD-CC.
      *------CHECK IF ASN FOR DATE
           IF NOT ASN
             MOVE DATE-CYMD             TO RCV-DATE-RCVD-CN
           ELSE
             MOVE DATE-CYMD             TO RCV-ASN-DATE
           END-IF
           MOVE RS-ARG                TO RCV-PO-RCV-NO.
      *------IF ASN, SKIP DIRECT DELIVERY AND AUTO STORE
           IF NOT ASN
             IF SD-DIRECT-SW = "Y"
              MOVE "DD"              TO RCV-MM-STORED
              MOVE SPACES            TO RCV-DD-STORED
                                        RCV-YY-STORED
                                        RCV-CC-STORED
              MOVE RCV-QTY-DLVR      TO RCV-QTY-STORED
             ELSE
              MOVE "N" TO AUTO-STORE-SW
              PERFORM 7411-CHECK-AUTO-STORE THRU 7411-CHECK-AUTO-STORE-X
              IF AUTO-STORE-SW = "Y"
                  MOVE RCV-DATE-RCVD-CN TO RCV-DATE-STORED-CN
                  MOVE RCV-QTY-DLVR  TO RCV-QTY-STORED
              END-IF
             END-IF
           END-IF.
      *-----CANNOT BE COMPLETE IF ASN
           IF NOT ASN
             IF ITM-COMPLETE-IN = "Y"
               MOVE "*"               TO RCV-COMPLETE-FLAG.
           IF A-KELLY-PLANT
               MOVE SD-KELLY-PO-UM    TO RCV-KELLY-PO-UM
               MOVE SD-PO-QTY-DLVR    TO RCV-KELLY-PO-QTY
           ELSE
               MOVE ZEROS             TO RCV-KELLY-PO-QTY.
           MOVE ZEROS                 TO RCV-EEC-NET-MASS
                                         RCV-EEC-SUPPL-UNITS.
      *------IF NOT ASN, INITIALIZE ASN FIELDS
           IF NOT ASN
               MOVE ZEROS             TO RCV-ASN-QTY
               MOVE SPACES            TO RCV-ASN-DATE.
           IF SD-RAW-FLAG = "Y"
               MOVE SD-LOT-NO         TO RCV-LOT
           ELSE
               MOVE SPACES            TO RCV-LOT.
           MOVE ITM-TALLY-IN          TO RCV-TALLY.
           MOVE SPACES                TO RCV-CHATNO.

           WRITE DRCVITEM-REC-O FROM BUF-DRCVITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DRCVITEM TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE RS-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
       743-ADD-RS-ITM-X.
           EXIT.

       744-UPDATE-STOREROOM.
           MOVE ITM-CORP-CODE-IN TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "READ MSTORERM TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.

           IF RECORD-TYPE = "ITMC"
               GO TO 744-UPDATE-ONHAND.

      *----------  DETERMINE LEAD TIME FROM REQ DATE FOR MSTORERM.
      *----------   IF NO REQ NUMBER, USE LEAD TIME FROM PO DATE
           MOVE PO-ARG TO PORCVNO OF DREQD-REC-I.
           START DREQD-I KEY = PORCVNO OF DREQD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-START.
       744-GET-DREQD.
           READ DREQD-I NEXT INTO BUF-DREQD
               AT END GO TO 744-UPDATE-LEAD-TIME
           END-READ.
           IF DREQD-PO-RCV-NO NOT = PO-ARG
               GO TO 744-UPDATE-LEAD-TIME.
           IF  DREQD-PO-ITM-NO NOT = ITM-NUMBER-IN
               GO TO 744-GET-DREQD.

           MOVE DREQD-REQ-NUMBER         TO  REQ-ARG.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-I.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF  FILE-STATUS NOT = "00"
               MOVE CALC-LT              TO  CALC-LT2
               GO TO 744-UPDATE-LEAD-TIME.

           CALL "CDATCALC" USING REQ-DATE, ACTIVITY-DATE, CALC-LT2.

       744-UPDATE-LEAD-TIME.
           IF  CALC-LT2 = 0
               IF  CALC-LT = 0
                   GO TO 744-UPDATE-ONHAND
               ELSE
                   MOVE CALC-LT          TO  CALC-LT2.

           MOVE STR-LAST-DLVTIMES (2)    TO  STR-LAST-DLVTIMES (3).
           MOVE STR-LAST-DLVTIMES (1)    TO  STR-LAST-DLVTIMES (2).
           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT TO DATE-CYMD-YMD.
           IF DATE-CYMD-YY > 70
               MOVE 19 TO DATE-CYMD-CC
           ELSE
               MOVE 20 TO DATE-CYMD-CC.
           MOVE DATE-CYMD                TO  STR-ACT-DATE-CN.
           MOVE CALC-LT2                 TO  STR-LAST-DLVTIMES (1).

       744-UPDATE-ONHAND.
      *-----UPDATE ONHAND FOR AUTO STORE ITEM
           IF AUTO-STORE-SW = "Y"
               IF RECORD-TYPE NOT = "ITMC"
                   COMPUTE STR-ONHAND ROUNDED =
                       SD-STR-QTY-DLVR + STR-ONHAND
                   COMPUTE STR-LOC-ONHAND (1) ROUNDED =
                     SD-STR-QTY-DLVR + STR-LOC-ONHAND (1)
                   MOVE RCV-DATE-RCVD-CN TO STR-ACT-DATE-CN
               ELSE
                   IF A-KELLY-PLANT
                       COMPUTE STR-ONHAND ROUNDED =
                           STR-ONHAND + KELLY-ADJ-STR-QTY
                       COMPUTE STR-LOC-ONHAND (1) ROUNDED =
                           STR-ONHAND + KELLY-ADJ-STR-QTY
                   ELSE
                       COMPUTE STR-ONHAND ROUNDED =
                           STR-ONHAND + ADJ-STR-QTY
                       COMPUTE STR-LOC-ONHAND (1) ROUNDED =
                           STR-ONHAND + ADJ-STR-QTY
                   END-IF
                   MOVE DATE-CYMD TO STR-ACT-DATE-CN
               END-IF
           END-IF.

      *-----UPDATE LOT NUMBER FOR RAW MATERIAL
           IF RECORD-TYPE NOT = "ITMC"
               IF  SD-SYSTEM-LOT = "S"
                  MOVE SD-LOT-NO        TO  STR-RAW-LOT.

           REWRITE MSTORERM-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-REWRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "REWRITE MSTORERM TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
       744-UPDATE-STOREROOM-X.
           EXIT.

       7441-CONVERT-TO-STR-UM.
      *************************************************************
      *    CONVERT A WORKING STORAGE FIELD TO STOREROOM UM        *
      *************************************************************
           IF  SD-UM = STR-UM
               MOVE ZEROES               TO  WS-RESULT-FLD
               ADD WS-CONVERT-FLD        TO  WS-RESULT-FLD ROUNDED
           ELSE
               IF  SD-UM = STR-UM1
                   MULTIPLY WS-CONVERT-FLD BY STR-UM1-CF
                       GIVING WS-RESULT-FLD ROUNDED
               ELSE
                   IF  SD-UM = STR-UM2
                       MULTIPLY WS-CONVERT-FLD BY STR-UM2-CF
                           GIVING WS-RESULT-FLD ROUNDED.
       7441-EXIT.
           EXIT.

       745-UPDATE-USAGE.
           MOVE ITM-CORP-CODE-IN TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-O.
           READ USAGEFIL-O INTO BUF-USAGEFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS = "23"
               MOVE ITM-CORP-CODE-IN TO K-CORP-CODE
               MOVE ZERO            TO K-MTH-USAGE (2)  K-MTH-USAGE (3)
                                       K-MTH-USAGE (4)  K-MTH-USAGE (5)
                                       K-MTH-USAGE (6)  K-MTH-USAGE (7)
                                       K-MTH-USAGE (8)  K-MTH-USAGE (9)
                                       K-MTH-USAGE (10) K-MTH-USAGE (11)
                                       K-MTH-USAGE (12) K-MTH-USAGE (13)
                                       K-MTH-USAGE (14) K-MTH-USAGE (1)
               MOVE ZERO      TO K-MTH-USAGE-DD (2)  K-MTH-USAGE-DD (3)
                                 K-MTH-USAGE-DD (4)  K-MTH-USAGE-DD (5)
                                 K-MTH-USAGE-DD (6)  K-MTH-USAGE-DD (7)
                                 K-MTH-USAGE-DD (8)  K-MTH-USAGE-DD (9)
                                 K-MTH-USAGE-DD (10) K-MTH-USAGE-DD (11)
                                 K-MTH-USAGE-DD (12) K-MTH-USAGE-DD (13)
                                 K-MTH-USAGE-DD (14) K-MTH-USAGE-DD (1)
               ADD SD-STR-QTY-DLVR TO K-MTH-USAGE (13)
                 GIVING K-MTH-USAGE (13) ROUNDED
               ADD SD-STR-QTY-DLVR TO K-MTH-USAGE-DD (13)
                 GIVING K-MTH-USAGE-DD (13) ROUNDED
               WRITE USAGEFIL-REC-O FROM BUF-USAGEFIL
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE FILE-STATUS TO BU-DISPLAY-STAT
                   MOVE "WRITE USAGEFIL TBCHDOCK" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           ELSE
               IF RECORD-TYPE NOT = "ITMC"
                   ADD SD-STR-QTY-DLVR TO K-MTH-USAGE (13)
                     GIVING K-MTH-USAGE (13) ROUNDED
                   ADD SD-STR-QTY-DLVR TO K-MTH-USAGE-DD (13)
                     GIVING K-MTH-USAGE-DD (13) ROUNDED
               ELSE
                   IF A-KELLY-PLANT
                       ADD KELLY-ADJ-STR-QTY TO K-MTH-USAGE (13)
                         GIVING K-MTH-USAGE (13) ROUNDED
                       ADD KELLY-ADJ-STR-QTY TO K-MTH-USAGE-DD (13)
                         GIVING K-MTH-USAGE-DD (13) ROUNDED
                   ELSE
                       ADD ADJ-STR-QTY TO K-MTH-USAGE (13)
                         GIVING K-MTH-USAGE (13) ROUNDED
                       ADD ADJ-STR-QTY TO K-MTH-USAGE-DD (13)
                         GIVING K-MTH-USAGE-DD (13) ROUNDED
                   END-IF
               END-IF
               REWRITE USAGEFIL-REC-O FROM BUF-USAGEFIL
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE FILE-STATUS TO BU-DISPLAY-STAT
                   MOVE "REWRITE USAGEFIL TBCHDOCK" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD
                   PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.
       745-UPDATE-USAGE-X.
           EXIT.

       746-WRITE-TALLY.
           MOVE ITM-CORP-CODE-IN    TO DTAL-CODE.
           MOVE ITM-TALLY-IN        TO DTAL-TALLY.
           MOVE ITM-NUMBER-IN       TO DTAL-ITEM.
           MOVE RS-ARG              TO DTAL-PO.
           WRITE DTALLY-REC-O FROM BUF-DTALLY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DTALLY TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE RS-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
       746-WRITE-TALLY-X.
           EXIT.

       747-WRITE-RAWLOT.
           MOVE ITM-CORP-CODE-IN   TO DRAW-CORP-ARG.
           MOVE SD-LOT-NO          TO DRAW-LOT-ARG.
           MOVE DRAWLOT-ARG        TO DRAWLOT-CORP-LOT.
           MOVE RS-ARG             TO DRAWLOT-PO.
           WRITE DRAWLOT-REC-O FROM BUF-DRAWLOT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DRAWLOT TBCHDOCK" TO BU-DISPLAY-MSG
               MOVE RS-ARG TO BU-DISPLAY-FLD
               PERFORM 99-PRINT-FATAL-ERROR.
       747-WRITE-RAWLOT-X.
           EXIT.

       748-WRITE-ITM-TC.
           MOVE SPACES                   TO BUF-DDAILYTC.
           ACCEPT DDAILYTC-DATE FROM DATE.
           ACCEPT DDAILYTC-TIME FROM TIME.
           MOVE PLT-NUMBER               TO DDAILYTC-PLT.
           MOVE SPACES                   TO DDAILYTC-DATA.

           IF SD-UNIT-PRICE > 9999999.99
               GO TO 748-CREATE-TC423.

           MOVE ITM-CORP-CODE-IN         TO TC323-CORPCODE.

           IF ITM-CORP-CODE-IN = "NON-STR"
               ADD ZERO SD-PO-QTY-DLVR
                   GIVING TC323-NONCODED-RCV-QTY ROUNDED
               IF A-KELLY-PLANT
                   MOVE SD-KELLY-PO-UM   TO TC323-UM
               ELSE
                   MOVE ITM-UM-RCVD-IN   TO TC323-UM
               END-IF
           ELSE
               IF AN-AKRON-PLANT
                   ADD ZERO SD-PO-QTY-DLVR
                       GIVING TC323-CODED-RCV-QTY ROUNDED
                   MOVE ITM-UM-RCVD-IN   TO TC323-UM
               ELSE
                   ADD ZERO SD-STR-QTY-DLVR
                       GIVING TC323-CODED-RCV-QTY ROUNDED
                   MOVE STR-UM           TO TC323-UM
               END-IF
           END-IF.
           IF AN-AKRON-PLANT
               IF SD-TC323-TC-FLAG = SPACES
                   IF FR2-OSD-NUMBER-HOLD NOT = SPACES
                       MOVE "D" TO SD-TC323-TC-FLAG.

           MOVE "523"                    TO DDAILYTC-TC.
           MOVE RS-ARG                   TO TC323-RS.
           MOVE ITM-NUMBER-IN            TO TC323-ITEM.
           MOVE SD-TC323-TC-FLAG         TO TC323-TC-FLAG.
           MOVE ITM-MOLD-IN              TO TC323-MOLD.

           MOVE SD-UNIT-PRICE TO SAVE-UNIT-PRICE.
           IF AN-AKRON-PLANT
               MOVE SD-UNIT-PRICE        TO TC323-UNIT-PRICE
           ELSE
           IF NOT A-KELLY-PLANT
               IF ITM-CORP-CODE-IN = "NON-STR"
                 MOVE SD-UNIT-PRICE      TO TC323-UNIT-PRICE
               ELSE
                 MOVE "PR"           TO UMCF-RET-CODE
                 MOVE ITM-UM-RCVD-IN TO UMCF-DEST-UM
                 MOVE SD-UNIT-PRICE  TO UMCF-SOURCE-QTY
                 MOVE SD-PRICE-UM    TO UMCF-SOURCE-UM
                 CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                    UMCF-QUANTITY-AREA
                 IF UMCF-RET-CODE NOT = "00"
                     MOVE "PRICE CONVERSION ERROR" TO BU-DISPLAY-MSG
                     MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD
                     PERFORM 99-PRINT-FATAL-ERROR
                 ELSE
                     MOVE UMCF-QTY-STR-UM-DEC TO TC323-UNIT-PRICE
                                                  SAVE-UNIT-PRICE
                 END-IF
               END-IF
               MOVE PLT-NUMBER TO PLANT-NUMERIC
               IF PLANT-NUMERIC > 599 OR THE-ASHEBORO-PLANT
                   MOVE PO-CURRENCY-CODE      TO TC323-CURRENCY-CODE
               END-IF
           END-IF.
           IF A-KELLY-PLANT
               MOVE SD-PO-QTY-DLVR      TO TC323-KELLY-PRICE
               MOVE SD-KELLY-PO-UM      TO TC323-KELLY-PO-UM
               MOVE SD-CLASS            TO TC323-KELLY-CLASS
               MOVE SD-SUB-DETL         TO TC323-KELLY-SUBD
               MOVE KELLY-SEQ-IN        TO TC323-KELLY-SEQ
           ELSE
               MOVE PO-PRIME            TO TC323-PRIME
               MOVE SD-CLASS            TO TC323-SUB
               MOVE SD-SUB-DETL         TO TC323-SUB-DETAIL
               MOVE SD-ADDL-DATA        TO TC323-ADDL-DATA.
           GO TO 748-WRITE-TC.

       748-CREATE-TC423.
           MOVE "623"                   TO DDAILYTC-TC.
           MOVE ITM-CORP-CODE-IN        TO TC423-CORPCODE.
           IF ITM-CORP-CODE-IN = "NON-STR"
               ADD ZERO SD-PO-QTY-DLVR
                   GIVING TC423-NONCODED-RCV-QTY ROUNDED
               IF A-KELLY-PLANT
                   MOVE SD-KELLY-PO-UM   TO TC423-UM
               ELSE
                   MOVE ITM-UM-RCVD-IN   TO TC423-UM
               END-IF
           ELSE
               IF AN-AKRON-PLANT
                   ADD ZERO SD-PO-QTY-DLVR
                       GIVING TC423-CODED-RCV-QTY ROUNDED
                   MOVE ITM-UM-RCVD-IN   TO TC423-UM
               ELSE
                   ADD ZERO SD-STR-QTY-DLVR
                       GIVING TC423-CODED-RCV-QTY ROUNDED
                   MOVE STR-UM           TO TC423-UM
               END-IF
           END-IF.
           IF AN-AKRON-PLANT
               IF SD-TC323-TC-FLAG = SPACES
                   IF FR2-OSD-NUMBER-HOLD NOT = SPACES
                       MOVE "D" TO SD-TC323-TC-FLAG.

           ADD SD-PREV-DLVR SD-PO-QTY-DLVR GIVING TOTAL-DLVR.
           IF TOTAL-DLVR > SD-QTY-ORD
               MOVE "A" TO SD-TC323-TC-FLAG.

           MOVE "623"                    TO DDAILYTC-TC.
           MOVE RS-ARG                   TO TC423-RS.
           MOVE ITM-NUMBER-IN            TO TC423-ITEM.
           MOVE SD-TC323-TC-FLAG         TO TC423-TC-FLAG.
           MOVE ITM-MOLD-IN              TO TC423-MOLD.

           MOVE SD-UNIT-PRICE TO SAVE-UNIT-PRICE.
           IF AN-AKRON-PLANT
               MOVE SD-UNIT-PRICE        TO TC423-UNIT-PRICE
           ELSE
           IF NOT A-KELLY-PLANT
               IF ITM-CORP-CODE-IN = "NON-STR"
                 MOVE SD-UNIT-PRICE      TO TC423-UNIT-PRICE
               ELSE
                 MOVE "PR"           TO UMCF-RET-CODE
                 MOVE ITM-UM-RCVD-IN TO UMCF-DEST-UM
                 MOVE SD-UNIT-PRICE  TO UMCF-SOURCE-QTY
                 MOVE SD-PRICE-UM    TO UMCF-SOURCE-UM
                 CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                    UMCF-QUANTITY-AREA
                 IF UMCF-RET-CODE NOT = "00"
                     MOVE "PRICE CONVERSION ERROR" TO BU-DISPLAY-MSG
                     MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD
                     PERFORM 99-PRINT-FATAL-ERROR
                 ELSE
                     MOVE UMCF-QTY-STR-UM-DEC TO TC423-UNIT-PRICE
                                                  SAVE-UNIT-PRICE
                 END-IF
               END-IF
               MOVE PLT-NUMBER TO PLANT-NUMERIC
               IF PLANT-NUMERIC > 599 OR THE-ASHEBORO-PLANT
                   MOVE PO-CURRENCY-CODE      TO TC423-CURRENCY-CODE
               END-IF
           END-IF.
           IF A-KELLY-PLANT
               MOVE SD-STR-QTY-DLVR     TO TC423-CODED-RCV-QTY
               MOVE SD-PO-QTY-DLVR      TO TC423-KELLY-PRICE
               MOVE SD-KELLY-PO-UM      TO TC423-KELLY-PO-UM
               MOVE SD-CLASS            TO TC423-KELLY-CLASS
               MOVE SD-SUB-DETL         TO TC423-KELLY-SUBD
               MOVE KELLY-SEQ-IN        TO TC423-KELLY-SEQ
           ELSE
               MOVE PO-PRIME            TO TC423-PRIME
               MOVE SD-CLASS            TO TC423-SUB
               MOVE SD-SUB-DETL         TO TC423-SUB-DETAIL
               MOVE SD-ADDL-DATA        TO TC423-ADDL-DATA.
       748-WRITE-TC.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DDAILYTC TC423 TBCHDOCK" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR.

      *-----CREATE TC323 FOR CONTAINERS
           IF SD-CONTAINER = "*"
               IF ITM-CORP-CODE-IN NOT = "NON-STR"
                 ADD ZERO ITM-CONT-QTY-IN
                   GIVING TC323-CODED-RCV-QTY ROUNDED
               ELSE
                 ADD ZERO ITM-CONT-QTY-IN
                   GIVING TC323-NONCODED-RCV-QTY ROUNDED
               END-IF
               MOVE ITM-CONT-UM-IN     TO TC323-UM
               MOVE ITM-NUMBER-IN      TO WORK-ITEM
               MOVE "*"                TO WK-ASTERICK
               MOVE SHIFTED-ITEM       TO TC323-ITEM
               IF A-KELLY-PLANT
                 MOVE ZEROS            TO TC323-KELLY-PRICE
               ELSE
                 MOVE ZEROS            TO TC323-UNIT-PRICE
               END-IF
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                 MOVE FILE-STATUS TO BU-DISPLAY-STAT
                 MOVE "WRITE DDAILYTC TC323 TBCHDOCK" TO BU-DISPLAY-MSG
                 PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.

      *-----CREATE TC326 IF PLANT SWITCH MISC-P326-SW IS SET
           IF MISC-P326-SW = "Y"
               MOVE SPACES            TO DDAILYTC-DATA
               MOVE "326"             TO DDAILYTC-TC
               MOVE ITM-CORP-CODE-IN  TO DDAILYTC-CODE
               MOVE RS-ARG            TO TC326-RS
               MOVE ITM-NUMBER-IN     TO TC326-ITEM
               MOVE ITM-COMPANY       TO TC326-COMPANY
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                 MOVE FILE-STATUS TO BU-DISPLAY-STAT
                 MOVE "WRITE DDAILYTC TC326 TBCHDOCK" TO BU-DISPLAY-MSG
                 PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.

      *-----CREATE TC327 FOR C-ORDER ITEM.  A C-ORDER IS A PO
      *-----  WHOSE ORDERED PRICE UM DIFFERS FROM RECEIVED
      *-----  PRICE UM.  THIS IS FOR AKRON ONLY ITEMS.
           IF AN-AKRON-PLANT AND SD-PRICE-QTY-DLVR NOT = ZEROS
               MOVE SPACES            TO DDAILYTC-DATA
               MOVE "327"             TO DDAILYTC-TC
               MOVE ITM-CORP-CODE-IN  TO TC327-CORPCODE
               MOVE RS-ARG            TO TC327-RS
               MOVE ITM-NUMBER-IN     TO TC327-ITEM
               MOVE SD-PRICE-QTY-DLVR TO TC327-NONCODED-PRICE-QTY
               MOVE SD-PRICE-UM       TO TC327-PRICE-UM
               MOVE SD-UNIT-PRICE     TO TC327-PO-PRICE
               MOVE PO-PRIME          TO TC327-PRIME
               MOVE SD-CLASS          TO TC327-SUB
               MOVE SD-SUB-DETL       TO TC327-SUB-DETAIL
               MOVE SD-ADDL-DATA      TO TC327-ADDL-DATA
               WRITE DDAILYTC-REC FROM BUF-DDAILYTC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                 MOVE FILE-STATUS TO BU-DISPLAY-STAT
                 MOVE "WRITE DDAILYTC TC327 TBCHDOCK" TO BU-DISPLAY-MSG
                 PERFORM 99-PRINT-FATAL-ERROR
               END-IF
           END-IF.

      *-----CREATE TC325 FOR AUTO STORE ITEM
           IF AUTO-STORE-SW = "Y"
             MOVE SPACES                   TO  DDAILYTC-DATA
             MOVE 1                        TO  DATE-MODE
             CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
             MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE
             MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME
             MOVE PLT-NUMBER-PASS TO DDAILYTC-PLT
      *------ NOTE: ANY CURRENCY CONVERSION OF TC325 PRICE IS DONE
      *------ IN THE CUTOFF (TCDLYABS)
             IF  SD-UNIT-PRICE NOT > 9999999.99
               MOVE "325"                    TO  DDAILYTC-TC
               IF  SD-MASTER-STOCK > SPACES
                 MOVE SD-MASTER-STOCK        TO  TC325-CORPCODE
               ELSE
                 MOVE SD-CODE                TO  TC325-CORPCODE
               END-IF
               MOVE RS-ARG                   TO  TC325-RS
               MOVE SD-ITM                   TO  TC325-ITEM
               COMPUTE TC325-STORED-QTY ROUNDED =
                   SD-STR-QTY-DLVR + ZERO
               MOVE STR-UM                   TO  TC325-UM
               MOVE SAVE-UNIT-PRICE          TO  TC325-PO-UNIT-PRICE
               MOVE SD-CLASS                 TO  TC325-CLASS
               MOVE PO-CURRENCY-CODE         TO  TC325-CURRENCY-CODE
               IF A-KELLY-PLANT
                   MOVE KELLY-SEQ-IN         TO  TC325-KELLY-SEQ
               ELSE
                   MOVE M-PO-RCV-SEQ         TO  TC325-KELLY-SEQ
               END-IF
             ELSE
               MOVE "425"                    TO  DDAILYTC-TC
               IF  SD-MASTER-STOCK > SPACES
                   MOVE SD-MASTER-STOCK      TO  TC425-CORPCODE
               ELSE
                   MOVE SD-CODE              TO  TC425-CORPCODE
               END-IF
               MOVE RS-ARG-2-14              TO  TC425-RS
               MOVE SD-ITM                   TO  TC425-ITEM
               COMPUTE TC425-STORED-QTY ROUNDED =
                     SD-STR-QTY-DLVR + ZERO
               MOVE STR-UM                   TO  TC425-UM
               MOVE SD-UNIT-PRICE            TO  TC425-PO-UNIT-PRICE
               IF A-KELLY-PLANT
                   MOVE KELLY-SEQ-IN         TO  TC425-KELLY-SEQ
               ELSE
                    MOVE M-PO-RCV-NO         TO  TC425-KELLY-SEQ
               END-IF
               MOVE PO-CURRENCY-CODE         TO  TC425-CURRENCY-CODE
               MOVE SD-CLASS                 TO  TC425-CLASS
             END-IF
             WRITE DDAILYTC-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-WRITE
             IF FILE-STATUS NOT = "00"
               MOVE FILE-STATUS TO BU-DISPLAY-STAT
               MOVE "WRITE DDAILYTC TC325 TBCHDOCK" TO BU-DISPLAY-MSG
               PERFORM 99-PRINT-FATAL-ERROR
             END-IF
           END-IF.
       748-WRITE-ITM-TC-X.
           EXIT.

       80-REPORT-HEAD.
           IF SUMMARY-REPORT-PRINT = "N"
               GO TO 80-REPORT-HEAD-X.
           ADD 1 TO REPORT-PAGE-CTR.
           MOVE REPORT-PAGE-CTR   TO PRT-PAGE.
           IF NOT ASN
             MOVE REPORT-TITLE      TO PRT-REC
           ELSE
             MOVE REPORT-ASN-TITLE  TO PRT-REC.
           IF REPORT-PAGE-CTR NOT = 1
               WRITE PRT-REC AFTER ADVANCING NEW-PAGE
           ELSE
               WRITE PRT-REC
           END-IF.
           IF A-KELLY-PLANT
               MOVE "  RCVR  " TO KELLY-SEQ-LIT
           ELSE
               MOVE SPACES TO KELLY-SEQ-LIT
           END-IF.
           IF NOT ASN
             MOVE REPORT-HEADING-TITLE TO PRT-REC
           ELSE
             MOVE REPORT-ASN-HEADING-TITLE TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE 4 TO REPORT-LINE-CTR.
       80-REPORT-HEAD-X.
           EXIT.

       81-WRITE-FRT-REPORT.
           IF SUMMARY-REPORT-PRINT = "N"
               GO TO 81-WRITE-FRT-REPORT-X.
           MOVE DASH-LINE TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           ADD 1 TO REPORT-LINE-CTR.
           IF REPORT-LINE-CTR > 60
               PERFORM 80-REPORT-HEAD THRU 80-REPORT-HEAD-X
           END-IF.
           MOVE SPACES TO REPORT-FRT-RECORD.
           IF A-KELLY-PLANT
               MOVE KELLY-SEQ-IN TO KELLY-SEQ-RPT
           ELSE
               MOVE SPACES TO KELLY-SEQ-RPT
           END-IF.
           MOVE PO-NO-IN TO PO-NO-RPT.
           MOVE RS-ARG-RS TO RS-NO-RPT.
           MOVE DATE-SLASH-OUT TO RCV-DATE-RPT.
           IF RECORD-TYPE = "FR1C" OR "FR2C" OR "ITMC"
               MOVE "CORRECTION" TO FRT-CORR-IND
           END-IF.
           IF RS-FRT-ERR = "Y"
               MOVE "ERROR" TO FRT-ERR-IND
           END-IF.
           MOVE REPORT-FRT-RECORD TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           ADD 1 TO REPORT-LINE-CTR.
       81-WRITE-FRT-REPORT-X.
           EXIT.

       82-WRITE-ITM-REPORT.
           IF SUMMARY-REPORT-PRINT = "N"
               GO TO 82-WRITE-ITM-REPORT-X.
           MOVE SPACES TO REPORT-ITM-RECORD.
           IF REPORT-LINE-CTR > 60
               PERFORM 80-REPORT-HEAD THRU 80-REPORT-HEAD-X
           END-IF.
           IF RECORD-TYPE = "ITMC"
              MOVE "CORRECTION" TO ITM-CORR-IND
           END-IF.
           MOVE ITM-NUMBER-IN TO ITEM-NO-RPT.
           MOVE ITM-CORP-CODE-IN TO CORP-CODE-RPT.
           MOVE ITM-QTY-RCVD-IN TO QTY-DLVR-RPT.
           MOVE ITM-UM-RCVD-IN TO UM-RPT.
           IF AUTO-STORE-SW = "Y"
               MOVE SD-STR-QTY-DLVR TO QTY-STOR-RPT
               MOVE STR-UM TO UM-STOR-RPT
           END-IF.
           IF RS-ITM-ERR = "Y"
               MOVE "ERROR" TO ITM-ERR-IND
           END-IF.
           MOVE REPORT-ITM-RECORD TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           ADD 1 TO REPORT-LINE-CTR.
       82-WRITE-ITM-REPORT-X.
           EXIT.

       85-ERROR-HEAD.
           ADD 1 TO ERROR-PAGE-CTR.
           MOVE ERROR-PAGE-CTR TO ERR-PAGE.
           MOVE "5" TO CTL.
           IF NOT ASN
             MOVE ERROR-TITLE TO DK-ERROR-LINE
           ELSE
             MOVE ERROR-ASN-TITLE TO DK-ERROR-LINE.
           WRITE DK-ERROR-REC.
           MOVE "1" TO CTL.
           MOVE DASH-LINE-132 TO DK-ERROR-LINE.
           WRITE DK-ERROR-REC.
           MOVE 2 TO ERROR-LINE-CTR.
       85-ERROR-HEAD-X.
           EXIT.

      *------ THIS VERSION OF CATREAD ASSUMES THE SET/MSG NUMBER
      *------ WILL BE IN CATREAD-MSG-NUMBER.
       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       99-PRINT-FATAL-ERROR.
           IF SUMMARY-REPORT-PRINT = "Y"
               MOVE STAR-LINE                 TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               WRITE PRT-REC AFTER ADVANCING 1 LINES
               MOVE IMAGE-ERR-INSTRUCTION-1    TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 3 LINES
               MOVE IMAGE-ERR-INSTRUCTION-2    TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               MOVE RECORD-COUNT               TO REC-NO-OUT
               MOVE ERROR-MSG                  TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               MOVE BU-DISPLAY-AREA            TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               MOVE STAR-LINE                  TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               WRITE PRT-REC AFTER ADVANCING 1 LINES
           END-IF.
           MOVE STAR-LINE                 TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE IMAGE-ERR-INSTRUCTION-1    TO DK-ERROR-LINE.
           MOVE "3" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE IMAGE-ERR-INSTRUCTION-2    TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE RECORD-COUNT               TO REC-NO-OUT.
           MOVE ERROR-MSG                  TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE BU-DISPLAY-AREA            TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE STAR-LINE                  TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           GO TO 2-EOJ.

       9999-PRINT-FATAL-ERROR.
           IF SUMMARY-REPORT-PRINT = "N"
               GO TO 9999-EXIT.
           MOVE STAR-LINE                 TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           WRITE PRT-REC AFTER ADVANCING 1 LINES.
           MOVE IMAGE-ERR-INSTRUCTION-1    TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE IMAGE-ERR-INSTRUCTION-2    TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           MOVE RECORD-COUNT               TO REC-NO-OUT.
           MOVE ERROR-MSG                  TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           MOVE BU-DISPLAY-AREA            TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           MOVE STAR-LINE                  TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 2 LINES.
           WRITE PRT-REC AFTER ADVANCING 1 LINES.
       9999-EXIT.
           EXIT.

      ************************************************************
      *                                                          *
      *              WRITE THE ERROR MESSAGE                     *
      *                                                          *
      ************************************************************
       99-WRITE-ERROR.
           IF ERROR-LINE-CTR > 60
              PERFORM 85-ERROR-HEAD THRU 85-ERROR-HEAD-X.
           IF A-KELLY-PLANT
               MOVE "  RCVR  " TO KELLY-SEQ-LIT
               MOVE KELLY-SEQ-IN TO ERR-KELLY-SEQ
           ELSE
               MOVE SPACES TO ERR-KELLY-SEQ
                              KELLY-SEQ-LIT
           END-IF.
           MOVE PO-NO-IN TO ERR-PO.
           IF ERR-RECORD-TYPE = "ITM " OR "ITMC"
               MOVE ITM-NUMBER-IN TO ERR-ITM
           ELSE
               MOVE SPACES TO ERR-ITM.
           MOVE ERROR-DETAIL-LINE TO DK-ERROR-LINE.
           MOVE "2" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE "1" TO CTL.
           MOVE ERROR-MSG-LINE TO DK-ERROR-LINE.
           WRITE DK-ERROR-REC.
           ADD 3 TO ERROR-LINE-CTR.
       99-WRITE-ERROR-X.
           EXIT.

       COPY OVRPFCALL OF COPYLIB.

      *----------  FOR SEQUENCE ERRORS ONLY
       999-SEQ-ERROR.
           MOVE "###########################################" TO PRT-REC
                                                          DK-ERROR-LINE.
           WRITE PRT-REC AFTER ADVANCING 3 LINES.
           MOVE "3" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE "#                                         #" TO PRT-REC
                                                          DK-ERROR-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE "1" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE "#  SEQUENCE ERROR - NO RECORDS PROCESSED  #" TO PRT-REC
                                                          DK-ERROR-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE "1" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE "#                                         #" TO PRT-REC
                                                          DK-ERROR-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE "1" TO CTL.
           WRITE DK-ERROR-REC.
           MOVE "###########################################" TO PRT-REC
                                                          DK-ERROR-LINE.
           WRITE PRT-REC AFTER ADVANCING 1 LINE.
           MOVE "1" TO CTL.
           WRITE DK-ERROR-REC.
       999-EXIT.
           EXIT.
