       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TBGTADJ.
       AUTHOR.        CA YODER.
       DATE-WRITTEN.  JUNE 1998.
      *REMARKS.
      *
      **************************************************************
      *                                                            *
      *   T B G T A D J                                            *
      *                                                            *
      *     THIS PROGRAM ALLOWS THE USER TO MAKE ADJUSTMENTS TO    *
      *     THE PO BUDGET AMOUNT.  ORIGINALLY WRITTEN FOR SOCIAL   *
      *     CIRCLE TO ADD FREIGHT CHARGE TO BUDGET AMOUNT.         *
      *                                                            *
      **************************************************************
      *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.    I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBGTADJ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC           PIC X(2000).
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       WORKING-STORAGE SECTION.
       77  COMP-SCREEN-INDIC       PIC X(3)    VALUE SPACES.
       77  HOLD-BUDGET-AMOUNT      PIC 9(12)   VALUE ZEROS.

       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X            VALUE SPACES.
           05  FILE-STATUS-2       PIC X            VALUE SPACES.
       01  RELATIVE-RECNO          PIC 9(9).

      **********************
      *  S W I T C H E S   *
      **********************

       01  SWITCH-AREA.
           05  FATAL-ERR-SW            PIC X       VALUE "N".
           05  EOJ-SW                  PIC X       VALUE "N".


       01  BUILD-PO-NUM.
           05  FILLER                  PIC X    VALUE "P".
           05  PO-NUM                  PIC X(7) VALUE SPACES.
           05  PO-RLSE                 PIC X(3) VALUE "000".
           05  PO-RCV                  PIC X(3) VALUE "000".

       COPY VCOMAREA IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FBGTADJ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  COMMAND-AREA.
           05  OVERRIDE-ZPAIDADJ      PIC X(34) VALUE
               "OVRDSPF FILE(ZBGTADJ) SHARE(*YES)".
           05  OVERRIDE-PARM2         PIC S9(10)V9(5) COMP-3 VALUE 34.

       01  SAVE-VIEW-STATUS          PIC S9(4) COMP-4 VALUE ZEROS.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(64)    VALUE SPACE.
           05  MSG-FLD               PIC X(12)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.

       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.

       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO  COMP-4.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.

       01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS COMP-4.

      **************************************************************
      **             TERMINAL I/O DATA AREA                       **
      **************************************************************

       01  SCREEN-1.
           05  S1-COMPANY                  PIC X(3).
           05  S1-PO-NUM                   PIC X(7).
           05  S1-PO-REL                   PIC X(3).
           05  S1-CMDLINE                  PIC X(79).
           05  S1-MSGLINE                  PIC X(79).

       01  SCREEN-2.
           05  S2-COMPANY                  PIC X(3).
           05  S2-PO-NUM.
               10  S2-PO-NUM-7             PIC X(7).
               10  S2-DASH                 PIC X.
               10  S2-PO-NUM-3             PIC X(3).
           05  S2-VEND-CODE                PIC X(10).
           05  S2-BUDGET-AMT               PIC Z(11)9.
           05  S2-FREIGHT                  PIC X.
           05  S2-ADJ-AMT                  PIC 9(12).
           05  S2-YES-OPT                  PIC X(3).
           05  S2-MSGLINE                  PIC X(79).

      **************************************************************
      **                DATABASE I/O BUFFER AREA                  **
      **************************************************************

       COPY MPLTINFO   IN COPYLIB.

       COPY DPORECD    IN COPYLIB.

      *****************************************
      **  PARAMETERS FOR CALLING 'STC360'
      **  WHICH IS THE SUB. FOR CUTTING
      **  TC 360 AND 361
      *****************************************

       01  STC360-TC                 PIC X(3) VALUE SPACES.
       01  STC360-COMPANY-SAVE       PIC X(3) VALUE SPACES.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".

       COPY DATAB      IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".

       01 ARG-VALUES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  PO-ARG                 PIC X(14) VALUE SPACES.

       01  DATES-AND-TIMES.
           05  CUR-DATE.
               10  YY               PIC XX.
               10  MM               PIC XX.
               10  DD               PIC XX.

       COPY TBLOWUP    IN COPYLIB.

       COPY LANGUAGE   IN COPYLIB.

       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD  IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
           MOVE "TBGTADJ"  TO  BU-PGM-NAME.
           CALL "QCMDEXC" USING OVERRIDE-ZPAIDADJ, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.

           OPEN INPUT    MPLTINFO-I
                I-O      DPORECD-I.

           MOVE 0          TO  HOLD-BUDGET-AMOUNT.

      **************************************************
      *   GET CO. AND PRIME FROM MPLTINFO              *
      *   USING 'P 01' AS THE ARGUMENT                 *
      **************************************************

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG               TO  BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY            TO  COMP-SCREEN-INDIC.
           ACCEPT CUR-DATE  FROM  DATE.

       1-H-X.
           EXIT.

       2-EOJ.
           CLOSE MPLTINFO-I, DPORECD-I,
                 DISPLAY-FILE.

       2-EOJ-X.
            EXIT.

      ******************************************************
      **   BLOWUP ROUTINE                                 **
      ******************************************************

       2-BLOWUP.
           MOVE "TBGTADJ"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.


       4-PGM-ERROR.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO S1-MSGLINE.

       4-PGM-ERROR-X.
           EXIT.

       4-PGM-ERROR2.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO S2-MSGLINE.

       4-PGM-ERROR2-X.
           EXIT.

      **************************************************
      *     6 - M A I N                                *
      **************************************************

       6-MAIN.
           MOVE "BGTADJ1"  TO  VIEW-NFNAME.

       6-PUT-BUFFER-1.
           MOVE SPACES             TO  SCREEN-1.
           MOVE ZEROS              TO  S1-PO-REL.
           MOVE COMP-SCREEN-INDIC  TO  S1-COMPANY.

       6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1           TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO  SCREEN-1.

       6-READ-SCREEN-1.
           IF VIEW-LASTKEY = 3
               GO TO 6-M-X
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        *** INVALID FUNCTION KEY ENTERED ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

      *****************************************************
      *    EDIT PURCHASE ORDER NUMBER                     *
      *****************************************************

       6-EDIT-PO-ENTRY.
           MOVE S1-PO-NUM               TO  PO-NUM.
           MOVE S1-PO-REL               TO  PO-RLSE.
           MOVE BUILD-PO-NUM            TO  PO-ARG,
                                            BU-DISPLAY-FLD (1).
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            *** PURCHASE ORDER DOES NOT EXIST ***
                   MOVE  16 TO LANG-SETNUM
                   MOVE  45 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 1  TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 6-SHOWFORM-SCREEN-1
               ELSE
                   MOVE "START DPORECD 6-ERO" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET DPORECD 6-EPE" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE SPACES            TO  SCREEN-2.
           MOVE COMP-SCREEN-INDIC TO  S2-COMPANY.
           MOVE PO-NUM            TO  S2-PO-NUM-7.
           MOVE "-"               TO  S2-DASH.
           MOVE PO-RLSE           TO  S2-PO-NUM-3.
           MOVE PO-VEN-CODE       TO  S2-VEND-CODE.
           MOVE PO-BUDGET-AMT     TO  S2-BUDGET-AMT.
           MOVE PO-FREIGHT-TERMS  TO  S2-FREIGHT.
           MOVE 0                 TO  S2-ADJ-AMT.

       6-LOAD-PO-INFO.
           PERFORM 62-PROCESS-ADJ  THRU  62-PA-X.
           GO TO 6-MAIN.

       6-M-X.
           EXIT.

       62-PROCESS-ADJ.

       62-PUT-BUFFER-2.
           MOVE "BGTADJ2"  TO  VIEW-NFNAME.
           MOVE COMP-SCREEN-INDIC  TO  S2-COMPANY.

       62-SHOWFORM-SCREEN-2.
      *-------- GIVE VERIFY FIELD IF NOT PREPAID FREIGHT; OTHERWISE
      *-------- PROCEED WITH UPDATE.
           IF PO-FREIGHT-TERMS = "P"
               MOVE B"0" TO IND(10)
           ELSE
               MOVE B"1" TO IND(10).
           MOVE SCREEN-2           TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO  SCREEN-2.

       62-READ-SCREEN-2.
           IF VIEW-LASTKEY = 3
               GO TO 62-PA-X
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        *** INVALID FUNCTION KEY ENTERED ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR2  THRU  4-PGM-ERROR2-X
               GO TO 62-SHOWFORM-SCREEN-2.

           IF PO-FREIGHT-TERMS NOT = "P" AND S2-YES-OPT NOT = "YES"
               MOVE "ENTER 'YES' TO PROCESS" TO MESSAGE-BUFFER
               MOVE 7  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR2  THRU  4-PGM-ERROR2-X
               GO TO 62-SHOWFORM-SCREEN-2.

           IF S2-ADJ-AMT = 0
               GO TO 62-PA-X.

           ADD S2-ADJ-AMT PO-BUDGET-AMT GIVING HOLD-BUDGET-AMOUNT.
           MOVE HOLD-BUDGET-AMOUNT TO PO-BUDGET-AMT.

           REWRITE DPORECD-REC-I FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "UPDATE DPORECD * 62-UL" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE "361"                TO  STC360-TC.
           MOVE COMP-SCREEN-INDIC    TO  STC360-COMPANY-SAVE.
           CALL "STC360" USING BASE,
                               STC360-COMPANY-SAVE,
                               STC360-TC,
                               BUF-DPORECD,
                               STATUS-AREA,
                               BU-DISPLAY-MSG,
                               BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.

       62-PA-X.
           EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       COPY DISPCALL IN COPYLIB.
