       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TBINLIST.
       AUTHOR.         KURT MOVSESIAN.
       INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   MAR 10, 1982.
      *D REMARKS.
      *D
      *D THIS REPORT LISTS ALL ITEMS IN 1 OF 3 WAYS.
      *D
      *D 1. IN ORDER OF STOREROOM BIN LOCATION
      *D 2. IN ORDER OF STOREROOM BIN LOCATION WITHIN ALL CLASSES
      *D 3. IN ORDER OF STOREROOM BIN LOCATION WITHIN USER SELECTED CLASSES
      *D
      *C CHANGES.
      *C
      *C FEB 24, 1994  CR KALMAN   REQUEST #6476
      *C   ADDED 2 MORE LIST OPTIONS.
      *C   4. IN ORDER OF STOREROOM BIN LOCATION FOR A RANGE OF BINS
      *C   5. IN ORDER OF STOREROOM BIN LOCATION WITHIN ALL CLASSES
      *C      FOR A RANGE OF CLASSES
      *C
      *C JUN 14, 1994  CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C 06/12/96      JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES. C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  ONLINE-PRT RECORD CONTAINS 132 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE          PIC X(132).


       SD  SORT-FILE RECORD CONTAINS 69 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SRT-CLASS       PIC X(3).
           05  SRT-CORP-CODE   PIC X(8).
           05  SRT-LOC         PIC X(12).
           05  SRT-KYD-ADJ     PIC X(46).

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1401.

       WORKING-STORAGE SECTION.

       77  CODE-ARG           PIC X(8)    VALUE SPACES.
       77  LINE-CTR           PIC 99    VALUE 60 COMP-4.
       77  PAGE-CTR           PIC 9(3)  VALUE 0  COMP-4.
       77  CLASS-SEL-CTR      PIC 9(2)  VALUE ZEROS COMP-4.
       77  CLASS-SUB          PIC 9(2)  VALUE ZEROS COMP-4.
       77  LOC-SUB            PIC 9(2)  VALUE ZEROS COMP-4.
       77  REPORT-FLAG        PIC X     VALUE " ".
9402CK 77  HOLD-FIELD         PIC X(12) VALUE SPACES.
9406CK 77  SCOPE              PIC X.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

      *************************************************************
      **                                                          **
      **          C O M M U N I C A T I O N S   A R E A S         **
      **                                                          **
      **************************************************************

       COPY TDATECHK IN COPYLIB.

       COPY DATAB IN COPYLIB.


       COPY ESCNAM2 IN COPYLIB.

       01  COMPRESS-PRINT             PIC X(8).

       01  NORMAL-PRINT               PIC X(8).

       COPY TBLOWUP IN COPYLIB.

       01  BUILD-CLASS-SEL.
           05 CLASS-SEL  OCCURS 5 TIMES  PIC X(3).


       01  MESSAGE-AREA.
           05  NO-SORTED-RECORDS   PIC X(45)
                 VALUE "*NO CORP-CODES FOUND WITH CLASSES SPECIFIED *".

       01  SWITCH-AREA.
           05  END-OF-INPUT-FILE               PIC X VALUE "N".
               88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
           05  END-OF-SORT-FILE                PIC X VALUE "N".
               88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
           05  DSET-DDESC             PIC X(16)  VALUE "DDESC;".

       COPY MSTORERM IN COPYLIB.

       COPY DDESC IN COPYLIB.

       01  REPORT1-H.
           05  FILLER       PIC X(6)  VALUE " PAGE".
           05  PRT-PAGE-NO  PIC ZZ9   VALUE ZEROS.
           05  FILLER       PIC X(5)  VALUE SPACES.
           05  FILLER       PIC X(8)  VALUE "TBINLIST".
           05  FILLER       PIC X(15) VALUE SPACES.
           05  FILLER       PIC X(23) VALUE "STOREROOM BIN LOCATIONS".
           05  FILLER       PIC X(9)  VALUE " ANALYSIS".
           05  FILLER       PIC X(22) VALUE SPACES.
           05  FILLER       PIC X(6)  VALUE "DATE  ".
           05  RPT-DATE     PIC X(8)  VALUE SPACES.
           05  FILLER       PIC X(3)  VALUE SPACES.
           05 PRT-TIME      PIC X(8)  VALUE SPACES.

       01  REPORT2-H.
           05  FILLER       PIC X(8)  VALUE SPACES.
           05  CLASS-LIT    PIC X(9)  VALUE "CLASS    ".
           05  FILLER       PIC X(4)  VALUE SPACES.
           05  FILLER       PIC X(12) VALUE "BIN LOCATION".
           05  FILLER       PIC X(6)  VALUE SPACES.
           05  FILLER       PIC X(9)  VALUE "CORP-CODE".
           05  FILLER       PIC X(7)  VALUE SPACES.
           05  FILLER       PIC X(17) VALUE "KEYWORD          ".
           05  FILLER       PIC X(12) VALUE "   ADJECTIVE".

       01  DOT-LINE.
           05  FILLER       PIC X(132)  VALUE ALL "-".

       01  DETAIL-PRINT.
           05  FILLER       PIC X(8)  VALUE SPACES.
           05  PRT-CLASS    PIC X(3)  VALUE SPACES.
           05  FILLER       PIC X(10) VALUE SPACES.
           05  PRT-BIN-LOC  PIC X(12) VALUE SPACES.
           05  FILLER       PIC X(6)  VALUE SPACES.
           05  PRT-CORP-CODE PIC X(8)  VALUE SPACES.
           05  FILLER       PIC X(8)  VALUE SPACES.
           05  PRT-KWD-ADJ  PIC X(46) VALUE SPACES.

      ************* PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG

       01  HD-RET-CODE                PIC S9(4)  COMP-4 VALUE 0.
       01  HD-FILE-NAME               PIC X(17)  VALUE SPACES.
       01  FNUM                       PIC S9(4)  COMP-4 VALUE 0.

       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

       LINKAGE SECTION.

       COPY THDPRTB IN COPYLIB.

9402CK 01  OPTION-AREA.
  .        05  SCREEN-FIELDS.
  .            10 OPT-ALL-BINS                     PIC X(1).
  .            10 OPT-STR-BIN                      PIC X(12).
  .            10 OPT-END-BIN                      PIC X(12).
  .            10 OPT-ALL-CLASSES                  PIC X(1).
  .            10 OPT-STR-CLASS                    PIC X(3).
  .            10 OPT-END-CLASS                    PIC X(3).
  .            10 OPT-CLASS-SELECT  OCCURS 5 TIMES PIC X(3).
9402CK     05  FILLER                              PIC X(65).


       PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-AREA.
9402CK MAIN SECTION.

9402CK 1-HSK.

9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           MOVE "DHDR07.PUB" TO HD-FILE-NAME.

           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI TO COMPRESS-PRINT.
           MOVE CHAR-10PI   TO NORMAL-PRINT.

           DISPLAY HD-ROUTE-DATA.
9402CK     DISPLAY OPTION-AREA.

      *----OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *----FILE, AND PRINT THE HEADER PAGE.

           MOVE HD-SPOOLER-NUMBER       TO  OVRPRTF-TOFILE-NUM.
           MOVE "*YES"                  TO  OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES         TO  OVRPRTF-COPIES.
           PERFORM 996-OVERRIDE-PRINT-FILE.

           OPEN OUTPUT ONLINE-PRT.

           CALL "THDPRT2" USING HD-RET-CODE,   HD-FILE-NAME, FNUM,
                                HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
              MOVE "THDPRT2 ERROR IN 200-OPEN-FILES-DBASE" TO
                 BU-DISPLAY-MSG
              MOVE "HD-RET-CODE = " TO BU-DISPLAY-FLD (1)
              MOVE HD-RET-CODE      TO BU-DISPLAY-FLD9 (1)
              GO TO 2-BLOWUP.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT  TO  RPT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.

           OPEN INPUT MSTORERM-I, DDESC-I.

9402CK     MOVE LOW-VALUES TO CORPCDE OF MSTORERM-REC-I.
  .        START MSTORERM-I KEY > CORPCDE OF MSTORERM-REC-I
  .           INVALID KEY
  .              MOVE "BAD START ON BSTORERM-I*1-HSK" TO BU-DISPLAY-MSG
  .              GO TO 2-BLOWUP.
  .
  .    6-MAIN.
  .
  .   ***************************************************************
  .   *                                                             *
  .   *  IF OPT-ALL-BINS = X      THE REPORT IS FOR ALL ITEMS AND   *
  .   *                           IS TO BE SORTED BY BIN LOC ONLY   *
  .   *                           ("B" IN REPORT FLAG)              *
  .   *                                                             *
  .   *  IF OPT-STR-BIN OR        THE REPORT IS FOR ALL ITEMS THAT  *
  .   *     OPT-END-BIN > SPACES  ARE IN THIS RANGE OF BINS AND IS  *
  .   *                           TO BE SORTED BY BIN LOC ONLY      *
  .   *                           ("B" IN REPORT FLAG)              *
  .   *                                                             *
  .   *  IF OPT-ALL-CLASSES = X   THE REPORT IS FOR ALL ITEMS AND   *
  .   *                           IS TO BE SORTED BY CLASS AND      *
  .   *                           BY STOREROOM WITHIN CLASS         *
  .   *                           ("A" IN REPORT FLAG)              *
  .   *                                                             *
  .   *  IF OPT-STR-CLASS OR      THE REPORT IS FOR ALL ITEMS       *
  .   *     OPT-END-CLASS         THAT ARE IN THIS RANGE OF CLASSES *
  .   *     > SPACES              AND IS TO BE SORTED BY CLASS AND  *
  .   *                           BY STOREROOM WITHIN CLASS         *
  .   *                           ("A" IN REPORT FLAG)              *
  .   *                                                             *
  .   *  IF SELECTION = CLASSES   THE REPORT IS FOR ALL ITEMS WITHIN*
  .   *                           SELECTED CLASSES AND IS TO BE     *
  .   *                           SORTED BY THOSE CLASSES AND BY    *
  .   *                           STOREROOM WITHIN THOSE CLASSES.   *
  .   *                           ("A" IN REPORT FLAG)              *
  .   *                                                             *
  .   ***************************************************************
  .
  .   *----MAKE SURE THE USER ENTERED THINGS CORRECTLY ON THE SCREEN.
  .   *----IF NOT, CHANGE THINGS AROUND OR USE DEFAULTS.
  .
  .        IF SCREEN-FIELDS = SPACES
  .           MOVE "X" TO OPT-ALL-BINS.
  .
  .        IF OPT-STR-BIN = SPACES  AND  OPT-END-BIN > SPACES
  .           MOVE OPT-END-BIN TO OPT-STR-BIN.
  .        IF OPT-STR-BIN > SPACES  AND  OPT-END-BIN = SPACES
  .           MOVE OPT-STR-BIN TO OPT-END-BIN.
  .        IF OPT-STR-BIN > OPT-END-BIN
  .           MOVE OPT-STR-BIN   TO HOLD-FIELD
  .           MOVE OPT-END-BIN   TO OPT-STR-BIN
  .           MOVE HOLD-FIELD    TO OPT-END-BIN.
  .
  .        IF OPT-STR-CLASS = SPACES  AND  OPT-END-CLASS > SPACES
  .           MOVE OPT-END-CLASS TO OPT-STR-CLASS.
  .        IF OPT-STR-CLASS > SPACES  AND  OPT-END-CLASS = SPACES
  .           MOVE OPT-STR-CLASS TO OPT-END-CLASS.
  .        IF OPT-STR-CLASS > OPT-END-CLASS
  .           MOVE OPT-STR-CLASS TO HOLD-FIELD
  .           MOVE OPT-END-CLASS TO OPT-STR-CLASS
  .           MOVE HOLD-FIELD    TO OPT-END-CLASS.
  .
  .        DISPLAY OPTION-AREA.
  .
  .   *----FIGURE OUT WHAT THE USER WANTS TO REPORT ON AND ACT ACCORDINGLY.
  .
  .        IF  OPT-ALL-BINS = "X"
  .         OR OPT-STR-BIN > SPACES
  .           GO TO 61-SORT-ON-BIN.
  .
  .        IF  OPT-ALL-CLASSES = "X"
  .         OR OPT-STR-CLASS > SPACES
  .           GO TO 62-SORT-ON-CLASS.
  .
  .   *----IF THE USER SELECTED CERTAIN CLASSES PUT THEM IN A SEPARATE
  .   *----TABLE AND COUNT HOW MANY THERE ARE FIRST.
  .
  .        INITIALIZE BUILD-CLASS-SEL, CLASS-SUB, CLASS-SEL-CTR.
  .        PERFORM UNTIL CLASS-SUB = 5
  .           ADD 1 TO CLASS-SUB
  .           IF OPT-CLASS-SELECT (CLASS-SUB) > SPACES
  .              ADD 1 TO CLASS-SEL-CTR
  .              MOVE OPT-CLASS-SELECT (CLASS-SUB)
  .                 TO CLASS-SEL (CLASS-SEL-CTR)
  .           END-IF
  .        END-PERFORM.
  .        IF CLASS-SEL-CTR > 0
  .           GO TO 62-SORT-ON-CLASS.
  .
  .    61-SORT-ON-BIN.
  .        MOVE "B" TO REPORT-FLAG.
9402CK     MOVE SPACES TO CLASS-LIT.
           SORT SORT-FILE
                ON ASCENDING KEY SRT-LOC
                INPUT  PROCEDURE IS 8-INPUT-RECORDS
                OUTPUT PROCEDURE IS 9-WRITE-RECORDS.
           GO TO 2-EOJ.

9402CK 62-SORT-ON-CLASS.
9402CK     MOVE "A" TO REPORT-FLAG.
           SORT SORT-FILE
                ON ASCENDING KEY SRT-CLASS
                                 SRT-LOC
                INPUT  PROCEDURE IS 8-INPUT-RECORDS
                OUTPUT PROCEDURE IS 9-WRITE-RECORDS.
9402CK     GO TO 2-EOJ.

       2-EOJ.
           CLOSE MSTORERM-I, DDESC-I.
           WRITE PRINT-RCD FROM NORMAL-PRINT  AFTER ADVANCING 0.
           CLOSE ONLINE-PRT.
           GOBACK.

       2-BLOWUP.
           MOVE "TBINLIST" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

       8-INPUT-RECORDS SECTION.

       8-BEGIN.
           PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
                   ALL-INPUT-RECORDS-PROCESSED.
           GO TO 8-IR-EXIT.

       81-PROCESS-INPUT-RECORDS.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "Y" TO END-OF-INPUT-FILE
                   GO TO 81-PIR-EXIT
               ELSE
                   MOVE "DBGET ERR MSTORERM 81-PROC-INP-REC"
                       TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           MOVE ZERO  TO  CLASS-SUB.

9402CK 81-CHECK-CLASS-QUALIFICATIONS.
  .
  .   *----AT THIS POINT A RECORD IS BEING CONSIDERED FOR THE REPORT.
  .   *----IF THE USER IS JUST CONCERNED WITH BINS, GO DIRECTLY TO GET
  .   *----A DESC FOR THIS RECORD. IF THE USER IS CONCERNED WITH CLASS,
  .   *----THEN CHECK TO MAKE SURE THE RECORD'S CLASS IS ONE THE USER
  .   *----WANTS. IF IT IS, GET A DESC. IF IT ISN'T, GO TO THE END OF
  .   *----THIS SECTION AND THEN GET ANOTHER RECORD.
  .
  .        IF   OPT-ALL-CLASSES = "X"
  .          OR OPT-ALL-BINS    = "X"
  .          OR OPT-STR-BIN     > SPACES
  .             GO TO 81-GET-DDESC.
  .
  .        IF OPT-STR-CLASS > SPACES
  .           IF    STR-CLASS >= OPT-STR-CLASS
  .             AND STR-CLASS <= OPT-END-CLASS
  .                 GO TO 81-GET-DDESC
  .           ELSE
  .             GO TO 81-PIR-EXIT.
  .
  .        IF CLASS-SEL-CTR > 0
  .           MOVE 0 TO CLASS-SUB
  .           PERFORM UNTIL CLASS-SUB = CLASS-SEL-CTR
  .              ADD 1 TO CLASS-SUB
  .              IF STR-CLASS = CLASS-SEL (CLASS-SUB)
  .                 GO TO 81-GET-DDESC
  .              END-IF
  .           END-PERFORM
9402CK        GO TO 81-PIR-EXIT.

       81-GET-DDESC.

      *----THIS PARAGRAPH GETS THE DESC AND STARTS TO SET UP THE
      *----SORT RECORD.

           MOVE CORP-CODE   TO  CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
           START DDESC-I KEY = CORPCDE OF DDESC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "DBFIND ERR IN 81-GET-DDSEC" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DDESC-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "* NO DESCRIPTION ON FILE *" TO SRT-KYD-ADJ
               ELSE
                   MOVE "DBGET ERR DDESC IN 81-GET-DDESC"
                      TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
           ELSE
               IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
                   MOVE "* NO DESCRIPTION ON FILE *" TO SRT-KYD-ADJ
               ELSE
                   MOVE KWRD-ADJ   TO  SRT-KYD-ADJ.

           MOVE CORP-CODE  TO  SRT-CORP-CODE.
           IF REPORT-FLAG = "B"
               MOVE SPACES     TO  SRT-CLASS
           ELSE
               MOVE STR-CLASS  TO  SRT-CLASS.

9402CK 81-CHECK-BIN-QUALIFICATIONS.
  .
  .   *----EACH STOREROOM ITEM HAS 6 POSSIBLE BIN LOCATIONS.
  .   *----A SORT RECORD NEEDS TO BE CREATED FOR EACH ONE
  .   *----UNLESS THE BIN LOCATION IS BLANK OR DOES NOT FIT
  .   *----THE USER'S CRITERIA. THEN IT IS SKIPPED.
  .
  .        IF   OPT-ALL-CLASSES = "X"
  .          OR OPT-STR-CLASS   > SPACE
  .          OR CLASS-SEL-CTR   > 0
  .          OR OPT-ALL-BINS    = "X"
  .           INITIALIZE  LOC-SUB
  .           PERFORM UNTIL LOC-SUB = 6
  .              ADD 1 TO LOC-SUB
  .              IF STR-LOC (LOC-SUB) > SPACES
  .                 MOVE STR-LOC (LOC-SUB) TO SRT-LOC
  .                 RELEASE SORT-REC
  .              END-IF
  .           END-PERFORM.
  .
  .        IF   OPT-STR-BIN     > SPACE
  .           INITIALIZE  LOC-SUB
  .           PERFORM UNTIL LOC-SUB = 6
  .              ADD 1 TO LOC-SUB
  .              IF    STR-LOC (LOC-SUB) >= OPT-STR-BIN
  .                AND STR-LOC (LOC-SUB) <= OPT-END-BIN
  .                 MOVE STR-LOC (LOC-SUB) TO SRT-LOC
  .                 RELEASE SORT-REC
  .              END-IF
9402CK        END-PERFORM.

       81-PIR-EXIT.
           EXIT.

       8-IR-EXIT.
           EXIT.

       9-WRITE-RECORDS SECTION.

9402CK 9-BEGIN.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
           MOVE SPACES TO PRINT-RCD.
           MOVE ZERO  TO  LINE-CTR, PAGE-CTR.
           PERFORM 921-PAGE-HDR.
           RETURN SORT-FILE AT END
               MOVE "Y"               TO END-OF-SORT-FILE
               MOVE NO-SORTED-RECORDS TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
           PERFORM 92-PROCESS-SORTED-RECORDS THRU 92-PSR-EXIT
                   UNTIL ALL-SORTED-RECORDS-PROCESSED.
           GO TO 9-WR-EXIT.

       92-PROCESS-SORTED-RECORDS.
           IF LINE-CTR > 55
               PERFORM 921-PAGE-HDR.
           MOVE SRT-CLASS            TO  PRT-CLASS.
           MOVE SRT-CORP-CODE        TO  PRT-CORP-CODE.
           MOVE SRT-LOC              TO  PRT-BIN-LOC.
           MOVE SRT-KYD-ADJ          TO  PRT-KWD-ADJ.

           ADD     1     TO LINE-CTR.
           WRITE PRINT-RCD FROM DETAIL-PRINT AFTER ADVANCING 1 LINES.
           RETURN SORT-FILE AT END
               MOVE          "Y"    TO END-OF-SORT-FILE
               GO TO 2-EOJ.
       92-PSR-EXIT.
           EXIT.

       921-PAGE-HDR.
           ADD 1  TO  PAGE-CTR.
           MOVE  PAGE-CTR  TO  PRT-PAGE-NO.
           WRITE PRINT-RCD FROM REPORT1-H AFTER ADVANCING NEW-PAGE.
           WRITE PRINT-RCD FROM REPORT2-H AFTER ADVANCING 2 LINES.
           WRITE PRINT-RCD FROM DOT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES  TO  PRINT-LINE.
           WRITE PRINT-RCD  AFTER ADVANCING 1 LINES.
           MOVE ZERO  TO  LINE-CTR.

       COPY OVRPFCALL IN COPYLIB.

       9-WR-EXIT.
           EXIT.
