000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TBKQTRPT.
000400 AUTHOR.              KURT MOVSESIAN.
000500 DATE-WRITTEN.        11/28/83.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*REMARKS.
000900*
001000**************************************************************
001100**                                                          **
001200**   T B K Q T R P T - QUOTE REPORT FOR A REQUIREMENT ORDER **
001300**                                                          **
001400**   THIS REPORT SUPPLIES A LISTING OF ALL QUOTES FOR ALL   **
001500**   CODED ITEMS FOR THE REQUIREMENT ORDER NUMBER           **
001600**   REQUESTED.                                             **
001700**                                                          **
001800**     XRSCREEN REPORT NO. - 44                             **
001900**     REPORT HEADER       - DHDR44.PUB                     **
002000**     FORM NAME IN FRSCREEN - FBKQTRPT                     **
002100**     QR1 ON THE PURCHASING MENU (UDCPURCH.PUB)            **
002200**                                                          **
002300**************************************************************
002700
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.  HP-3000.
003100 OBJECT-COMPUTER.  HP-3000.
003200 SPECIAL-NAMES. C01 IS NEW-PAGE.
003400
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
004500      SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
            SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
             SELECT DVENDITM
               ASSIGN TO DATABASE-MCFLCS0802
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
003900
004000
004100 DATA DIVISION.
004200 FILE SECTION.
004300 FD  PRINT-FILE
004400     LABEL RECORDS ARE OMITTED
004500     RECORD CONTAINS 132 CHARACTERS
004600     DATA RECORD IS PRINT-RCD.
004700 01  PRINT-RCD.
004800     05  PRINT-LINE        PIC X(132).
004900
       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

005100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X.
           05  FILE-STATUS-2            PIC X.
005200 77  PAGE-CTR                     PIC 9(3)   VALUE ZEROS.
005300 77  LINE-CTR                     PIC 9(2)   VALUE ZEROS.
005400 77  LINE-ADV                     PIC 9(2)   VALUE ZEROS.
005500 77  QUOTES-EXIST-FLAG            PIC X      VALUE "N".
005600 77  AT-LEAST-ONE-ITEM-SW         PIC X      VALUE SPACES.
005700     88  AT-LEAST-ONE-ITEM                   VALUE "Y".
005800
006100
006200 01  BUILD-PO-NUM.
006300     05  FILLER                   PIC X    VALUE "P".
006400     05  PO-NUM                   PIC X(7) VALUE SPACES.
006500     05  PO-RLSE                  PIC X(3) VALUE "999".
006600     05  PO-RCV                   PIC X(3) VALUE "000".
006700
006800 01  BUILD-TM-DISCOUNT-KEY.
006900     05  FILLER                   PIC X(3)  VALUE "TMP".
007000     05  BUILD-TM-DISCOUNT-VALUE  PIC X  VALUE SPACES.
007100
007200 01  BUILD-TM-DUE-DATE-KEY.
007300     05  FILLER                   PIC X(3)  VALUE "TMD".
007400     05  BUILD-TM-DATE-VALUE      PIC X     VALUE SPACES.
007500
007600*******************************
007700**  PARAMETERS FOR CALLING
007800**  'CDESC'
007900*******************************
008000
008100 COPY CDESC OF COPYLIB.
008200
008300 01  RET-CODE                     PIC X(2)  VALUE SPACES.
008400
008500**************************************************************
008600**************************************************************
008700**                                                          **
008800**                DATABASE I/O BUFFER AREA                  **
008900**                                                          **
009000**************************************************************
009100**************************************************************
009200
009300 COPY DVENDOR OF COPYLIB.
009400
009500 COPY DVENDITM OF COPYLIB.
009600
009700 COPY DPOITEM OF COPYLIB.
009800
009900 COPY MPLTINFO OF COPYLIB.
010200 COPY DATAB OF COPYLIB.
012400 01 ARG-VALUES.
012500     05  PO-ARG                 PIC X(14) VALUE SPACES.
012600     05  VEN-ARG                PIC X(10) VALUE SPACES.
012700     05  PLT-ARG                PIC X(4)  VALUE SPACES.
012800     05  CODE-ARG               PIC X(8)  VALUE SPACES.
012900
013000
013100**************************************************************
013200**                                                          **
013300**        E R R O R   M E S S A G E   A R E A S             **
013400**                                                          **
013500**************************************************************
013600
013700 COPY TBLOWUP OF COPYLIB.
013800
013900************************************************
014000*                                              *
014100*   PRINT HEADERS                              *
014200*                                              *
014300************************************************
014400
014500 01  PRT-NO-REQ-ORDER-MSG.
014600     05  FILLER  PIC X(21) VALUE "** REQUIREMENT ORDER ".
014700     05  FILLER  PIC X(19) VALUE "DOES NOT EXIST|| **".
014800
014900 01  PRT-NO-ITEM-MSG.
015000     05  FILLER  PIC X(17) VALUE "** NO ITEMS EXIST".
015100     05  FILLER  PIC X(17) VALUE " ON THIS ORDER **".
015200
015300 01  PRT-NO-CODE-ITEMS-MSG.
015400     05  FILLER  PIC X(18) VALUE "** NO CODED ITEMS ".
015500     05  FILLER  PIC X(20) VALUE "WERE FOUND FOR THIS ".
015600     05  FILLER  PIC X(20) VALUE "REQUIREMENT ORDER **".
015700
015800 01  PRT-NO-QUOTE-MSG.
015900     05  FILLER  PIC X(20) VALUE SPACES.
016000     05  FILLER  PIC X(19) VALUE "**  NO QUOTES EXIST".
016100     05  FILLER  PIC X(14) VALUE " FOR THE ABOVE".
016200     05  FILLER  PIC X(9)  VALUE " ITEM  **".
016300
016400 01  PRINT-HDR1.
016500     05  FILLER       PIC X(6)  VALUE " PAGE ".
016600     05  PAGE-NO-OUT  PIC ZZZ9  VALUE ZEROS.
016700     05  FILLER       PIC X(14) VALUE SPACES.
016800     05  PRT-CO       PIC X(3)  VALUE SPACES.
016900     05  FILLER       PIC X(3)  VALUE SPACES.
017000     05  FILLER       PIC X(17) VALUE "QUOTE REPORT FOR ".
017100     05  FILLER       PIC X(17) VALUE "REQUIREMENT ORDER" .
017200     05  FILLER       PIC X(9)  VALUE " NUMBER  ".
017300     05  PRT-BLANKET-NO  PIC X(7)  VALUE SPACES.
017400     05  FILLER       PIC X(15) VALUE SPACES.
017500     05  FILLER       PIC X(5)  VALUE "DATE ".
017600     05  PRT-DATE     PIC X(8)  VALUE SPACES.
017700     05  FILLER       PIC X(2)  VALUE SPACES.
017800     05  PRT-TIME     PIC X(8)  VALUE SPACES.
017900     05  FILLER       PIC X(5)  VALUE SPACES.
018000     05  FILLER       PIC X(8)  VALUE "TBKQTRPT".
018100
018200 01  PRINT-HDR2.
018300     05  FILLER       PIC X(20) VALUE SPACES.
018400     05  FILLER       PIC X(11) VALUE "VENDOR CODE".
018500     05  FILLER       PIC X(9)  VALUE SPACES.
018600     05  FILLER       PIC X(5)  VALUE "PRICE".
018700     05  FILLER       PIC X(5)  VALUE SPACES.
018800     05  FILLER       PIC X(2)  VALUE "UM".
018900     05  FILLER       PIC X(4)  VALUE SPACES.
019000     05  FILLER       PIC X(8)  VALUE "EXP DATE".
019100     05  FILLER       PIC X(6)  VALUE SPACES.
019200     05  FILLER       PIC X(5)  VALUE "TERMS".
019300     05  FILLER       PIC X(17) VALUE SPACES.
019400     05  FILLER       PIC X(3)  VALUE "FOB".
019500     05  FILLER       PIC X(18) VALUE SPACES.
019600     05  FILLER       PIC X(3)  VALUE "LT1".
019700     05  FILLER       PIC X     VALUE SPACES.
019800     05  FILLER       PIC X(3)  VALUE "LT2".
019900     05  FILLER       PIC X     VALUE SPACES.
020000     05  FILLER       PIC X(3)  VALUE "LT3".
020100     05  FILLER       PIC X(8)  VALUE SPACES.
020200
020300 01  DASH-LINE.
020400     05  FILLER       PIC X(132) VALUE ALL "-".
020500
020600 01  DETAIL-LINE1.
020700     05  FILLER       PIC X(16) VALUE " CORPORATE CODE ".
020800     05  PRT-CODE     PIC X(7)  VALUE SPACES.
020900     05  FILLER       PIC X(2)  VALUE SPACES.
021000     05  PRT-DESC     PIC X(80) VALUE SPACES.
021100     05  FILLER       PIC X(27) VALUE SPACES.
021200
021300 01  DETAIL-LINE2.
021400     05  FILLER       PIC X(13) VALUE "    ITEM NO. ".
021500     05  PRT-ITEM     PIC ZZZ9  VALUE ZEROS.
021600     05  FILLER       PIC X(115) VALUE SPACES.
021700
021800 01  DETAIL-LINE3.
021900     05  FILLER       PIC X(20) VALUE SPACES.
022000     05  PRT-VENDOR   PIC X(10) VALUE SPACES.
022100     05  FILLER       PIC X(2)  VALUE SPACES.
022200     05  PRT-PRICE    PIC Z(10)9.9999.
022300     05  FILLER       PIC X(2)  VALUE SPACES.
022400     05  PRT-UM       PIC X(2)  VALUE SPACES.
022500     05  FILLER       PIC X(4)  VALUE SPACES.
022600     05  PRT-EXP-DATE  PIC X(8)  VALUE SPACES.
022700     05  FILLER       PIC X(3)  VALUE SPACES.
022800     05  PRT-TERMS    PIC X(2)  VALUE SPACES.
022900     05  FILLER       PIC X(2)  VALUE SPACES.
023000     05  PRT-TERMS-PC-DESC  PIC X(5)  VALUE SPACES.
023100     05  PRT-TERMS-DD-DESC  PIC X(8)  VALUE SPACES.
023200     05  FILLER       PIC X(8)  VALUE SPACES.
023300     05  PRT-FOB      PIC X(20) VALUE SPACES.
023400     05  FILLER       PIC X     VALUE SPACES.
023500     05  PRT-LT1      PIC Z(3)  VALUE SPACES.
023600     05  FILLER       PIC X     VALUE SPACES.
023700     05  PRT-LT2      PIC Z(3)  VALUE SPACES.
023800     05  FILLER       PIC X     VALUE SPACES.
023900     05  PRT-LT3      PIC Z(3)  VALUE SPACES.
024000     05  FILLER       PIC X(8)  VALUE SPACES.
024100
024200 01  DETAIL-LINE4.
024300     05  FILLER       PIC X(23) VALUE SPACES.
024400     05  FILLER       PIC X(10) VALUE "CONTACT:  ".
024500     05  PRT-CONTACT  PIC X(34) VALUE SPACES.
024600     05  FILLER       PIC X(5)  VALUE SPACES.
024700     05  PRT-PHONE.
024800         10  PRT-CONTACT-AREA-CODE  PIC X(3)  VALUE SPACES.
024900         10  PRT-PHONE-DASH1        PIC X     VALUE SPACES.
025000         10  PRT-PHONE-FIRST3       PIC X(3)  VALUE SPACES.
025100         10  PRT-PHONE-DASH2        PIC X     VALUE SPACES.
025200         10  PRT-PHONE-LAST4        PIC X(4)  VALUE SPACES.
025300     05  FILLER       PIC X(4)   VALUE SPACES.
025400     05  FILLER       PIC X(16)  VALUE "EST. DLVR. TIME ".
025500     05  PRT-EST-DLV-TIME           PIC ZZZZ  VALUE ZEROS.
025600     05  FILLER       PIC X(5)  VALUE " DAYS".
025700     05  FILLER       PIC X(14) VALUE SPACES.
025800
025900 01  DETAIL-LINE5.
026000     05  FILLER       PIC X(23) VALUE SPACES.
026100     05  FILLER       PIC X(7)  VALUE "NOTE:  ".
026200     05  PRT-NOTE1    PIC X(44) VALUE SPACES.
026300     05  FILLER       PIC X(58) VALUE SPACES.
026400
026500 01  DETAIL-LINE6.
026600     05  FILLER       PIC X(30) VALUE SPACES.
026700     05  PRT-NOTE2    PIC X(44) VALUE SPACES.
026800     05  FILLER       PIC X(58) VALUE SPACES.
026900
027000 COPY THDPRTA OF COPYLIB.
027100
027200 COPY SPOOLER OF COPYLIB.
027300
027400 COPY TDATECHK OF COPYLIB.
027600
027700 COPY ESCNAM2 OF COPYLIB.
028200
       COPY CCRTFILE IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
021600*----------  E S C A P E   S E Q U E N C E S
021700 01  COMPRESS-PRINT             PIC X(8).
021800 01  NORMAL-PRINT               PIC X(8).
021900 01  ESC-TEXT-61                PIC X(8).
022000 01  ESC-TEXT-60                PIC X(8).
022100
       LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.
005900 01  USER-OPTIONS.
006000     05  SELECTED-REQ-ORDER       PIC X(7).
           05  FILLER                   PIC X(73).
028300
028400 PROCEDURE DIVISION USING HD-ROUTE-DATA, USER-OPTIONS.
028500
028600 PROC-DIV SECTION 01.
028700
028800 BEGIN-HERE.
028900     PERFORM 1-HSK THRU 1-H-X.
029000
029100     PERFORM 6-MAIN THRU 6-M-X.
029200
029300     PERFORM 2-EOJ  THRU 2-EOJ-X.
029400
029500     GOBACK.
029600
029700 1-HSK.
029800     CALL "TESCSEQ" USING ESC-NAME.
029900     MOVE CHAR-1636PI TO COMPRESS-PRINT.
030000     MOVE CHAR-10PI   TO NORMAL-PRINT.
030100
030200     OPEN INPUT DVENDITM DVENDOR DPOITEM MPLTINFO.
030700     MOVE "P 01"         TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
031000     IF COND-WORD NOT = ZERO
031100         MOVE "GET MPLTINFO * 1-HSK"   TO  BU-DISPLAY-MSG
031200         MOVE PLT-ARG   TO  BU-DISPLAY-FLD (4)
031300         GO TO 2-BLOWUP.
031400     MOVE MPLTINFO-COMPANY        TO  PRT-CO.
031500
031600     MOVE 1  TO  DATE-MODE.
031700     CALL "TDATECHK" USING DATE-CHECK-AREA.
031800     MOVE DATE-SLASH-OUT           TO  PRT-DATE.
031900     MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
032000
032100 1-H-X.
032200     EXIT.
032300
032400 2-EOJ.
032500     CLOSE DVENDITM DVENDOR DPOITEM MPLTINFO.
032900
033000 2-EOJ-X.
033100      EXIT.
033200
033300******************************************************
033400**                                                  **
033500**   BLOWUP ROUTINE                                 **
033600**                                                  **
033700******************************************************
033800
033900 2-BLOWUP.
034000     MOVE "TBKQTRPT"              TO  BU-PGM-NAME.
034100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
034200         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
034300             BU-DISPLAY-FLDS.
034600
034700 6-MAIN.
034800     PERFORM 60-ACCEPT-OPTIONS  THRU  60-ACCEPT-OPTIONS-X.
036600
036700     MOVE "DHDR44.PUB"       TO  HD-FILE-NAME.
078400*----------  OPEN OUTPUT FILE
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
036300     OPEN OUTPUT PRINT-FILE.
036800     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
036900          HD-ROUTE-DATA, ESC-NAME.
037000     IF HD-RET-CODE NOT = 0
037100         MOVE "THDPRT2 ERR 62-PSR" TO BU-DISPLAY-MSG
037200         MOVE HD-RET-CODE       TO BU-DISPLAY-FLD (4)
037300         GO TO 2-BLOWUP.
037400
037500
037600***********************************************************
037700**   IF PRINTING ON A CHARACTER PRINTER (HD-PAPER-FLAG   **
037800**   NOT = "X"), WE USE COMPRESSED PRINT TO FIT 132      **
037900**   CHARACTERS ON 8.5 IN WIDE PAPER.  ALSO, IF CP, WE   **
038000**   CHANGE THE TEXT LENGTH TO 61 LINES.                 **
038100***********************************************************
038200
038300     IF PAPER-IS-132-COLS
038400         NEXT SENTENCE
038500     ELSE
038600         WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
038700
038800     PERFORM 66-PAGE-HEADER.
038900
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
039200     IF COND-WORD NOT = 0
039300         IF COND-WORD = 17
039400             MOVE PRT-NO-REQ-ORDER-MSG  TO  PRINT-LINE
039500             MOVE 1               TO  LINE-ADV
039600             PERFORM 66-PRINT-LINE
039700             MOVE "Y"             TO  AT-LEAST-ONE-ITEM-SW
039800             GO TO 6-FINISH-REPORT
039900         ELSE
040000             MOVE "FIND DPOITEM ** 6-MAIN" TO BU-DISPLAY-MSG
040100             GO TO 2-BLOWUP.
040200
040300     IF CHAIN-LENGTH = 0
040400         MOVE PRT-NO-ITEM-MSG     TO  PRINT-LINE
040500         MOVE 1                   TO  LINE-ADV
040600         PERFORM 66-PRINT-LINE
040700         MOVE "Y"                 TO  AT-LEAST-ONE-ITEM-SW
040800         GO TO 6-FINISH-REPORT.
040900
041000 6-GET-DPOITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
041300     IF COND-WORD NOT = 0
041400         IF COND-WORD = 15
041500             GO TO 6-FINISH-REPORT
041600         ELSE
041700             MOVE "GET DPOITEM ** 6-MAIN" TO BU-DISPLAY-MSG
041800             GO TO 2-BLOWUP.
041900     IF ITM-CORP-CODE = "NON-STR"
042000         GO TO 6-GET-DPOITEM.
042100     MOVE ITM-CORP-CODE           TO  CODE-ARG,
042200                                      PRT-CODE.
042300     IF LINE-CTR  >  44
042400         PERFORM 66-PAGE-HEADER.
042500
042600     MOVE "Y"                     TO  AT-LEAST-ONE-ITEM-SW.
042700     PERFORM 61-GET-DESC  THRU  61-GD-X.
042800     MOVE DETAIL-LINE1            TO  PRINT-LINE.
042900     MOVE 2                       TO  LINE-ADV.
043000     PERFORM 66-PRINT-LINE.
043100     MOVE ITM-NUMBER              TO  PRT-ITEM.
043200     MOVE DETAIL-LINE2            TO  PRINT-LINE.
043300     MOVE 1                       TO  LINE-ADV.
043400     PERFORM 66-PRINT-LINE.
043500     PERFORM 62-PRINT-QUOTES  THRU  62-PQ-X.
043600     GO TO 6-GET-DPOITEM.
043700
043800 6-FINISH-REPORT.
043900     IF AT-LEAST-ONE-ITEM
044000         NEXT SENTENCE
044100     ELSE
044200         MOVE PRT-NO-CODE-ITEMS-MSG  TO  PRINT-LINE
044300         MOVE 1                   TO  LINE-ADV
044400         PERFORM 66-PRINT-LINE.
044500
044600     IF PAPER-IS-132-COLS
044700         NEXT SENTENCE
044800     ELSE
044900         WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.
045000
045100     MOVE SPACES TO PRINT-RCD.
045200     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
045300
046200     CLOSE PRINT-FILE.
046300
046400 6-M-X.
046500     EXIT.
046600
046700
046800
046900 60-ACCEPT-OPTIONS.
047900
048000     MOVE SELECTED-REQ-ORDER      TO  PO-NUM,
048100                                      PRT-BLANKET-NO.
048200     MOVE BUILD-PO-NUM            TO  PO-ARG,
048300                                      BU-DISPLAY-FLD (1).
048400 60-ACCEPT-OPTIONS-X.
048500     EXIT.
048600
048700
048800 61-GET-DESC.
048900     MOVE 1                       TO CDESC-LINES-TO-GET.
049000     MOVE "K"                     TO CDESC-DESC-OPTION.
049100     CALL "CDESC" USING RET-CODE,
049200                        BASE,
049300                        STATUS-AREA,
049400                        BU-DISPLAY-MSG,
049500                        CODE-ARG,
049600                        CDESC-DATA.
049700     IF BU-DISPLAY-MSG-1  NOT = SPACES
049800         MOVE CODE-ARG            TO  BU-DISPLAY-FLD (4)
049900         GO TO 2-BLOWUP.
050000
050100     IF CDESC-LINES-GOT  =  0
050200         MOVE "*** NO DESCRIPTION ON FILE ***" TO  PRT-DESC
050300     ELSE
050400         MOVE CDESC (1)           TO  PRT-DESC.
050500
050600 61-GD-X.
050700     EXIT.
050800
050900 62-PRINT-QUOTES.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC.
           START DVENDITM KEY = CORPCDE OF DVENDITM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE 99 TO COND-WORD.
051200     IF COND-WORD NOT = 0
051300         MOVE "FIND DVENDITM * 62-PQ"  TO  BU-DISPLAY-MSG
051400         MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (2)
051500         GO TO 2-BLOWUP.
051600
051700     MOVE "N"  TO  QUOTES-EXIST-FLAG.
051800
051900 62-GET-DVENDITM.
           MOVE 0 TO COND-WORD.
           READ DVENDITM NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
052200     IF COND-WORD NOT = 0
052300         IF COND-WORD = 15
052400             GO TO 62-CHECK-NO-QUOTES
052500         ELSE
052600             MOVE "GET DVENDITM * 62-GD"  TO  BU-DISPLAY-MSG
052700             MOVE CODE-ARG             TO  BU-DISPLAY-FLD (2)
052800             GO TO 2-BLOWUP.
052900
053000     IF VEN-QUOTE-FLAG = "Q"
053100         NEXT SENTENCE
053200     ELSE
053300         GO TO 62-GET-DVENDITM.
053400
053500     MOVE "Y"                     TO  QUOTES-EXIST-FLAG.
053600     MOVE VEN-ITM-VENCODE         TO  PRT-VENDOR, VEN-ARG.
053700     MOVE VEN-ITM-PRICE           TO  PRT-PRICE.
053800     MOVE VEN-ITM-PRICE-UM        TO  PRT-UM.
053900     IF VEN-ITM-PRICE-DATE = SPACES
054000         MOVE SPACES              TO  PRT-EXP-DATE
054100     ELSE
054200         MOVE 4                   TO  DATE-MODE
054300         MOVE VEN-ITM-PRICE-DATE  TO  DATE-VALIDATE-IN
054400         CALL "TDATECHK" USING DATE-CHECK-AREA
054500         MOVE DATE-SLASH-OUT      TO  PRT-EXP-DATE.
054600     MOVE VEN-TERMS               TO  PRT-TERMS.
054700     PERFORM 621-GET-TERM-DESC  THRU  621-GTD-X.
054800     MOVE VEN-FOB                 TO  PRT-FOB.
054900     MOVE VEN-ITM-LT1             TO  PRT-LT1.
055000     MOVE VEN-ITM-LT2             TO  PRT-LT2.
055100     MOVE VEN-ITM-LT3             TO  PRT-LT3.
055200     MOVE VEN-EST-LT              TO  PRT-EST-DLV-TIME.
055300     PERFORM 622-GET-DVENDOR-INFO  THRU  622-GDI-X.
055400
055500     MOVE DETAIL-LINE3            TO  PRINT-LINE.
055600     MOVE 1                       TO  LINE-ADV.
055700     PERFORM 66-PRINT-LINE.
055800     MOVE DETAIL-LINE4            TO  PRINT-LINE.
055900     PERFORM 66-PRINT-LINE.
056000     IF PRT-NOTE1 = SPACES
056100         MOVE SPACES              TO  PRINT-LINE
056200         PERFORM 66-PRINT-LINE
056300         GO TO 62-GET-DVENDITM
056400     ELSE
056500         MOVE DETAIL-LINE5        TO  PRINT-LINE
056600         PERFORM 66-PRINT-LINE.
056700     IF PRT-NOTE2 = SPACES
056800         MOVE SPACES              TO  PRINT-LINE
056900         PERFORM 66-PRINT-LINE
057000         GO TO 62-GET-DVENDITM
057100     ELSE
057200         MOVE DETAIL-LINE6        TO  PRINT-LINE
057300         PERFORM 66-PRINT-LINE.
057400     MOVE SPACES                  TO  PRINT-LINE.
057500     PERFORM 66-PRINT-LINE.
057600     GO TO 62-GET-DVENDITM.
057700
057800 62-CHECK-NO-QUOTES.
057900     IF QUOTES-EXIST-FLAG = "Y"
058000         NEXT SENTENCE
058100     ELSE
058200         MOVE PRT-NO-QUOTE-MSG    TO  PRINT-LINE
058300         MOVE 1                   TO  LINE-ADV
058400         PERFORM 66-PRINT-LINE.
058500
058600 62-PQ-X.
058700     EXIT.
058800
058900*******************************************
059000*
059100*   GET PAYMENT TERMS DESC. FOR PRINT
059200*   FROM MPLTINFO USING THE KEYS 'TMPn' AND
059300*   'TMDn' FOR DISCOUNT AMOUNT AND DUE DATE
059400*
059500*******************************************
059600
059700 621-GET-TERM-DESC.
059800     MOVE VEN-TERMS-PC          TO  BUILD-TM-DISCOUNT-VALUE.
059900     MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
060200     IF COND-WORD NOT = 0
060300         IF COND-WORD = 17
060400             MOVE SPACES          TO  PRT-TERMS-PC-DESC
060500         ELSE
060600             MOVE "GET MPLTINFO1 * 621-GTD" TO BU-DISPLAY-MSG
060700             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
060800             GO TO 2-BLOWUP
060900     ELSE
061000         MOVE MPLTINFO-DISC-AMNT-DESC TO PRT-TERMS-PC-DESC.
061100
061200     MOVE VEN-TERMS-DTE           TO  BUILD-TM-DATE-VALUE.
061300     MOVE BUILD-TM-DUE-DATE-KEY   TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
061600     IF COND-WORD NOT = 0
061700         IF COND-WORD = 17
061800             MOVE SPACES          TO  PRT-TERMS-DD-DESC
061900         ELSE
062000             MOVE "GET MPLTINFO2 * 621-GPT" TO BU-DISPLAY-MSG
062100             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
062200             GO TO 2-BLOWUP
062300     ELSE
062400         MOVE MPLTINFO-TMD-DESC       TO PRT-TERMS-DD-DESC.
062500
062600 621-GTD-X.
062700     EXIT.
062800
062900 622-GET-DVENDOR-INFO.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
063200     IF COND-WORD NOT = 0
063300         MOVE "FIND DVENDOR * 622-GDI"  TO  BU-DISPLAY-MSG
063400         MOVE VEN-ARG               TO  BU-DISPLAY-FLD (3)
063500         GO TO 2-BLOWUP.
063600     MOVE SPACES                  TO  PRT-CONTACT,
063700                                      PRT-PHONE,
063800                                      PRT-NOTE1,
063900                                      PRT-NOTE2.
064000
064100 622-GET-DVENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
064400     IF COND-WORD NOT = 0
064500         IF COND-WORD = 15
064600             GO TO 622-GDI-X
064700         ELSE
064800             MOVE "GET DVENDOR * 622-GD" TO BU-DISPLAY-MSG
064900             MOVE VEN-ARG            TO BU-DISPLAY-FLD (3)
065000             GO TO 2-BLOWUP.
065100
065200     IF VEN-ITM-NO  =  09
065300         MOVE VEN-CONTACT  TO  PRT-CONTACT
065400         IF VEN-CONTACT-PHONE  =  SPACES
065500             NEXT SENTENCE
065600         ELSE
065700         IF VEN-PH2-TEST  =  SPACES
065800             MOVE VEN-PH2-FIRST3  TO  PRT-PHONE-FIRST3
065900             MOVE VEN-PH2-LAST4   TO  PRT-PHONE-LAST4
066000             MOVE "-"             TO  PRT-PHONE-DASH2
066100         ELSE
066200         IF VEN-PH3-TEST  =  SPACES
066300             MOVE VEN-PH3-FIRST3  TO  PRT-PHONE-FIRST3
066400             MOVE VEN-PH3-LAST4   TO  PRT-PHONE-LAST4
066500             MOVE "-"             TO  PRT-PHONE-DASH2
066600         ELSE
066700             MOVE VEN-PH-AREA     TO  PRT-CONTACT-AREA-CODE
066800             MOVE VEN-PH-FIRST3   TO  PRT-PHONE-FIRST3
066900             MOVE VEN-PH-LAST4    TO  PRT-PHONE-LAST4
067000             MOVE "-"             TO  PRT-PHONE-DASH1,
067100                                      PRT-PHONE-DASH2
067200     ELSE
067300     IF VEN-ITM-NO  = 12
067400         MOVE VEN-FREE-NOTE-1     TO  PRT-NOTE1
067500     ELSE
067600     IF VEN-ITM-NO  = 13
067700         MOVE VEN-FREE-NOTE-2     TO  PRT-NOTE2.
067800     GO TO 622-GET-DVENDOR.
067900
068000 622-GDI-X.
068100     EXIT.
068200
068300 66-PRINT-LINE.
068400     WRITE PRINT-RCD AFTER ADVANCING LINE-ADV.
068500     ADD LINE-ADV  TO  LINE-CTR.
068600     IF LINE-CTR > 55
068700         PERFORM 66-PAGE-HEADER.
068800
068900 66-PAGE-HEADER.
069000     MOVE ZERO                    TO  LINE-CTR.
069100     ADD  1                       TO  PAGE-CTR.
069200     MOVE PAGE-CTR                TO  PAGE-NO-OUT.
069300     MOVE SPACES                  TO  PRINT-LINE.
069400     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
069500     WRITE PRINT-RCD FROM PRINT-HDR1 AFTER
069600         ADVANCING 1 LINES.
069700     WRITE PRINT-RCD FROM PRINT-HDR2 AFTER
069800         ADVANCING 2 LINES.
069900     WRITE PRINT-RCD FROM DASH-LINE AFTER
070000         ADVANCING 1 LINES.
046400 COPY OVRPFCALL IN COPYLIB.
