       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TBLKBYVN.
       AUTHOR.        CA YODER.
       DATE-WRITTEN.  DECEMBER 1997.
       DATE-COMPILED.
      *REMARKS.    REPORT OF REQUIREMENT ORDERS BY VENDOR CODE.
      ***************************************************************
      *                     T B L K B Y V N                         *
      *                                                             *
      *  THIS REPORT PRINTS REQUIREMENT ORDERS BY VENDOR CODE.      *
      *  A RANGE OF VENDOR CODES MAY BE ENTERED, OR IF "ALL" IS     *
      *  TYPED, ALL REQUIREMENT ORDERS WILL BE SHOWN.               *
      *                                                             *
      ***************************************************************
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   IBM-AS400.
       OBJECT-COMPUTER.   IBM-AS400.
       SPECIAL-NAMES.     C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-REPORT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0902
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  PRINT-REPORT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRT-REC.
           05  PRT-LINE                  PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 29 CHARACTERS.
       01  SORT-REC.
           05 SORT-PO-NO                 PIC X(7).
           05 SORT-VENDOR-CODE           PIC X(10).
           05 SORT-EXP-DATE-CN.
              10  SORT-EXP-DATE-CC       PIC X(2).
              10  SORT-EXP-DATE          PIC X(6).
           05 SORT-TERMS                 PIC X(2).
           05 SORT-CURRENCY              PIC X(2).

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0902.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0701.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0401.

       WORKING-STORAGE SECTION.
       77  MORE-RECORDS                  PIC X     VALUE "Y".
       77  NO-VENDOR-ERR-MSG             PIC X(22) VALUE
                                            "**VENDOR NOT ON FILE**".
       01  FILE-STATUS.
           05  FILE-STAT1                PIC X.
           05  FILE-STAT2                PIC X.

       01  SWITCH-AREA.
           05  END-OF-SORT-FILE          PIC X    VALUE "N".
               88  ALL-SORTED-RECORDS-PROCESSED            VALUE "Y".

      *----------  E S C A P E   S E Q U E N C E S
       01  COMPRESS-PRINT                PIC X(8).
       01  NORMAL-PRINT                  PIC X(8).
       01  ESC-TEXT-61                   PIC X(8).
       01  ESC-TEXT-60                   PIC X(8).
       COPY ESCNAM2   OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       COPY CCHKOBJ   OF COPYLIB.
       COPY THDPRTA   OF COPYLIB.

       COPY TBLOWUP   OF COPYLIB.
       COPY TDATECHK  OF COPYLIB.
       COPY CDESC     OF COPYLIB.

       COPY DATAB     OF COPYLIB.

       01  VEN-ARG                       PIC X(10) VALUE SPACES.
       01  VEN-TYPE-ARG                  PIC X(2)  VALUE SPACES.
       01  PLT-ARG                       PIC X(4)  VALUE SPACES.

       COPY MPLTINFO  OF COPYLIB.

       COPY DPORECD   OF COPYLIB.

       COPY DVENDOR  IN COPYLIB.

       COPY MVALIDUM   IN COPYLIB.

       01  LINE-CNT                       PIC S9(5) COMP-4 VALUE +60.
       01  PAGE-CNT                       PIC S9(5) COMP-4 VALUE +0.
       01  TOTAL-POS-TO-REPORT            PIC S9(7) COMP-4 VALUE +0.

       01  HEADER-1.
           05     FILLER      PIC X(2)   VALUE SPACES.
           05     FILLER      PIC X(7)   VALUE "PLANT  ".
           05  PRT-PLT        PIC X(3)   VALUE SPACES.
           05     FILLER      PIC X(37)  VALUE SPACES.
           05     FILLER      PIC X(33)  VALUE
                              "REQUIREMENT ORDERS BY VENDOR CODE".
           05     FILLER      PIC X(36)  VALUE SPACES.
           05     FILLER      PIC X(6)  VALUE "DATE: ".
           05  PRT-DATE       PIC X(8).

       01  HEADER-3-MSG.
           05  FILLER         PIC X(13) VALUE SPACES.
           05  FILLER         PIC X(16) VALUE "ALL VENDOR CODES".
           05  FILLER         PIC X(14) VALUE SPACES.

       01 HEADER-3.
           05     FILLER          PIC X(44) VALUE SPACES.
           05  PRT-RANGE-LIT.
               10     FILLER          PIC X(19) VALUE
                                      "VENDOR CODE RANGE  ".
               10 PRT-FROM-CODE       PIC X(10) VALUE SPACES.
               10     FILLER          PIC X(4)  VALUE " TO ".
               10 PRT-THRU-CODE       PIC X(10) VALUE SPACES.
           05  PRT-RANGE-LIT2  REDEFINES  PRT-RANGE-LIT
                                      PIC X(43).
           05     FILLER              PIC X(31) VALUE SPACES.
           05     FILLER              PIC X(6)  VALUE "PAGE: ".
           05  PRT-PAGE-CNT           PIC ZZ,ZZ9.

       01 HEADER-31.
           05     FILLER              PIC X(3)  VALUE SPACES.
           05     FILLER              PIC X(26) VALUE
                            "REPORTING ON BUYER CODE:  ".
           05  PRT-BUYER-CODE         PIC X(4)  VALUE SPACES.

       01  HEADER-5.
           05      FILLER                 PIC X(3)  VALUE SPACES.
           05      FILLER                 PIC X(9)  VALUE "PO NUMBER".
           05      FILLER                 PIC X(6)  VALUE SPACES.
           05      FILLER                 PIC X(6)  VALUE "VENDOR".
           05      FILLER                 PIC X(42) VALUE SPACES.
           05      FILLER                 PIC X(8)  VALUE "EXP DATE".
           05      FILLER                 PIC X(5)  VALUE SPACES.
           05      FILLER                 PIC X(5)  VALUE "TERMS".
           05      FILLER                 PIC X(4)  VALUE SPACES.
           05      FILLER                 PIC X(8)  VALUE "CURRENCY".
           05      FILLER                 PIC X(2)  VALUE SPACES.

       01  HEADER-6.
           05     FILLER                 PIC X(3)  VALUE SPACES.
           05     FILLER                 PIC X(11) VALUE "===========".
           05     FILLER                 PIC X(4)  VALUE SPACES.
           05     FILLER                 PIC X(44) VALUE ALL "=".
           05     FILLER                 PIC X(4)  VALUE SPACES.
           05     FILLER                 PIC X(8)  VALUE "========".
           05     FILLER                 PIC X(5)  VALUE SPACES.
           05     FILLER                 PIC X(5)  VALUE "=====".
           05     FILLER                 PIC X(4)  VALUE SPACES.
           05     FILLER                 PIC X(13) VALUE ALL "=".
           05     FILLER                 PIC X(4)  VALUE SPACES.

       01  EMPTY-SORT-MSG.
           05     FILLER                 PIC X(10) VALUE SPACE.
           05     FILLER                 PIC X(31) VALUE
                            " THERE WERE NO VENDOR CODES IN ".
           05     FILLER                PIC X(37) VALUE
                            "THE DATABASE WITHIN THE GIVEN RANGE. ".

       01 REPORT-DETAIL-LINE2.
           05       FILLER                PIC X(3)   VALUE SPACES.
           05  PRT-PO-NUM                 PIC X(7)   VALUE SPACES.
           05       FILLER                PIC X(1)   VALUE "-".
           05  PRT-PO-RLS                 PIC X(3)   VALUE SPACES.
           05       FILLER                PIC X(4)   VALUE SPACES.
           05  PRT-VENDOR-CODE            PIC X(10)  VALUE SPACES.
           05          FILLER             PIC X(38)  VALUE SPACES.
           05  PRT-EXP-DATE               PIC X(8)   VALUE SPACES.
           05      FILLER                 PIC X(7)   VALUE SPACES.
           05  PRT-TERMS                  PIC X(2)   VALUE SPACES.
           05      FILLER                 PIC X(5)   VALUE SPACES.
           05  PRT-CURRENCY               PIC X(16)  VALUE SPACES.

       01 REPORT-DETAIL-LINE2-B.
           05       FILLER                PIC X(20)  VALUE SPACES.
           05  PRT-VENDOR-NAME            PIC X(44)  VALUE SPACES.

       01 PRINT-TOTALS.
           05  FILLER                     PIC X(5)  VALUE SPACES.
           05  PRT-LIT                    PIC X(32) VALUE SPACES.
           05  PRT-TOTAL                  PIC Z,ZZZ,ZZ9.

       LINKAGE SECTION.
       COPY THDPRTB   OF COPYLIB.
       01  SORT-DATA.
           05  DE-LOW-RANGE              PIC X(10).
           05  DE-HIGH-RANGE             PIC X(10).
           05  DE-BUYER-CODE             PIC X(4).
           05  FILLER                    PIC X(56).

      **********************************************************************
      **    PROCESS REPORT OF REQUIREMENT ORDERS BY VENDOR CODE           **
      **********************************************************************
       PROCEDURE DIVISION USING HD-ROUTE-DATA SORT-DATA.

       00-MAIN.

            PERFORM 050-INITIALIZATION THRU 059-EXIT.

            SORT  SORT-FILE
                  ASCENDING KEY SORT-PO-NO
                  DESCENDING KEY SORT-EXP-DATE-CN
                  INPUT PROCEDURE IS 7-INPUT THRU 799-EXIT
                  OUTPUT PROCEDURE IS 8-OUTPUT THRU 899-EXIT.

            PERFORM 090-END-PROGRAM THRU 099-EXIT.

            GOBACK.

       050-INITIALIZATION.

      *----------  SET UP PRINTER ESCAPE SEQUENCES
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.
           MOVE TEXT-LENGTH-61 TO ESC-TEXT-61.
           MOVE TEXT-LENGTH-60 TO ESC-TEXT-60.
      *----------  OPEN OUTPUT FILE
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-REPORT-FILE.

      *----------  PRINT HEADER PAGE
           MOVE "DHDR103.PUB" TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME,
              FNUM, HD-ROUTE-DATA, ESC-NAME.
           IF PAPER-IS-132-COLS
                NEXT SENTENCE
           ELSE
               WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
               WRITE PRT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
           IF HD-RET-CODE NOT = 0
               DISPLAY "THDRPT ERROR".

           IF DE-LOW-RANGE NOT = "ALL"
               IF DE-HIGH-RANGE = SPACES OR < DE-LOW-RANGE
                   MOVE DE-LOW-RANGE     TO DE-HIGH-RANGE.

           IF DE-LOW-RANGE = "ALL"  OR (DE-LOW-RANGE = SPACES
                                    AND DE-HIGH-RANGE = SPACES)
               MOVE HEADER-3-MSG         TO PRT-RANGE-LIT2
           ELSE
               MOVE DE-LOW-RANGE         TO PRT-FROM-CODE
               MOVE DE-HIGH-RANGE        TO PRT-THRU-CODE.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT                 TO PRT-DATE.

           OPEN INPUT DPORECD, MPLTINFO, DVENDOR-I, MVALIDUM-I.

           IF DE-LOW-RANGE = "ALL" OR DE-LOW-RANGE = SPACES
               MOVE SPACES   TO VEN-ARG
           ELSE
               MOVE DE-LOW-RANGE TO VEN-ARG.

           MOVE VEN-ARG TO VENCDE OF DPORECD-REC.
           START DPORECD KEY >= VENCDE OF DPORECD-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STAT1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

           MOVE "P 01" TO PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STAT1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DBGET MPLTINFO 050 TBLKBYVN" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE MPLTINFO-COMPANY TO PRT-PLT.
           MOVE "Y" TO MORE-RECORDS.

       059-EXIT.  EXIT.

       090-END-PROGRAM.
      *----------  PRINT REPORT, CLOSE FILES, AND QUIT
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0
               WRITE PRT-REC FROM ESC-TEXT-60 AFTER ADVANCING 0.

           CLOSE PRINT-REPORT-FILE.
           CLOSE DPORECD, MPLTINFO, DVENDOR-I, MVALIDUM-I.

       099-EXIT.
           EXIT.

      ******************************************************************
      *  INPUT SECTION:  READ THE RANGE OF VENDOR CODES SPECIFIED AND  *
      *                  FIND POS WITH THOSE CODES.  WRITE TO SORT     *
      *                  FILE.                                         *
      ******************************************************************
       7-INPUT.
           PERFORM 720-READ-DPORECD THRU 720-EXIT.

           PERFORM 710-MAIN THRU 710-EXIT UNTIL
                    MORE-RECORDS = "N".

           GO TO 799-EXIT.

      *----------  FIND THE CODES THAT ARE WITHIN THE RANGE GIVEN AND WRITE
      *----------  TO SORT RECORD
       710-MAIN.
           IF PO-RLS-NO  =  "999"
               IF DE-BUYER-CODE = SPACES OR PO-BUYER-CODE
                   MOVE SPACES TO SORT-REC
                   MOVE PO-PO-NO            TO  SORT-PO-NO
                   MOVE PO-VEN-CODE         TO  SORT-VENDOR-CODE
                   MOVE PO-EXPECT-DATE-CN   TO  SORT-EXP-DATE-CN
                   MOVE PO-TERMS            TO  SORT-TERMS
                   MOVE PO-CURRENCY-CODE    TO  SORT-CURRENCY
                   RELEASE SORT-REC.

            PERFORM 720-READ-DPORECD THRU 720-EXIT.

       710-EXIT.
           EXIT.

       720-READ-DPORECD.
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "N" TO MORE-RECORDS
           ELSE
           IF DE-HIGH-RANGE > SPACES
               IF PO-VEN-CODE > DE-HIGH-RANGE
                   MOVE "N" TO MORE-RECORDS.

       720-EXIT.
           EXIT.

       799-EXIT.
           EXIT.

       8-OUTPUT.
           RETURN SORT-FILE AT END
               MOVE "Y" TO END-OF-SORT-FILE
               PERFORM 880-HEADINGS THRU 889-EXIT
               MOVE EMPTY-SORT-MSG TO PRT-LINE
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               GO TO 899-EXIT.

           PERFORM 810-PROCESS-SORTED-RECORDS THRU 819-EXIT
               UNTIL ALL-SORTED-RECORDS-PROCESSED.

           MOVE TOTAL-POS-TO-REPORT             TO PRT-TOTAL.
           MOVE "TOTAL PURCHASE ORDERS:  "      TO PRT-LIT.
           WRITE PRT-REC FROM PRINT-TOTALS AFTER ADVANCING 3 LINES.

           GO TO 899-EXIT.

       810-PROCESS-SORTED-RECORDS.
           ADD 1                            TO TOTAL-POS-TO-REPORT.
           IF LINE-CNT > 55
               PERFORM 880-HEADINGS THRU 889-EXIT.

           MOVE SORT-PO-NO                  TO PRT-PO-NUM.
           MOVE "999"                       TO PRT-PO-RLS.
           MOVE SORT-VENDOR-CODE            TO PRT-VENDOR-CODE.
           MOVE SORT-EXP-DATE               TO DATE-VALIDATE-IN.
           MOVE 4                           TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT              TO PRT-EXP-DATE.
           MOVE SORT-TERMS                  TO PRT-TERMS.
           MOVE SORT-CURRENCY      TO  VALIDUM OF MVALIDUM-I-REC.
           READ MVALIDUM-I INTO BUF-MVALIDUM
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ
           MOVE SPACES             TO  PRT-CURRENCY.
           IF FILE-STATUS = "00"
               STRING SORT-CURRENCY "  " VALID-CURRENCY-DESC
                                             DELIMITED BY SIZE
                                             INTO  PRT-CURRENCY.
           WRITE PRT-REC FROM REPORT-DETAIL-LINE2 AFTER ADVANCING
                                            2 LINES.
           ADD 2                            TO LINE-CNT.

           MOVE SORT-VENDOR-CODE TO VEN-ARG.
           MOVE "00" TO VEN-TYPE-ARG.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-I-REC.
           MOVE VEN-TYPE-ARG TO VENITMNO OF DVENDOR-I-REC.
           READ DVENDOR-I INTO BUF-DVENDOR
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STAT1 NOT = "2"
                 MOVE "READ DVENDOR*810-PSR" TO BU-DISPLAY-MSG
                 MOVE VEN-ARG TO BU-DISPLAY-FLD (1)
                 MOVE VEN-TYPE-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 990-BLOWUP.

           IF FILE-STAT1 = "2"
               MOVE NO-VENDOR-ERR-MSG  TO PRT-VENDOR-NAME
           ELSE
               MOVE VEN-NAME           TO PRT-VENDOR-NAME.

           WRITE PRT-REC FROM REPORT-DETAIL-LINE2-B AFTER ADVANCING
                                            1 LINE.
           ADD 1                            TO LINE-CNT.

           RETURN SORT-FILE  AT END
               MOVE "Y"                     TO END-OF-SORT-FILE.

       819-EXIT.  EXIT.

      *----------  PRINT REPORT HEADINGS
       880-HEADINGS.
            IF DE-BUYER-CODE = SPACES
                MOVE SPACES                    TO PRT-BUYER-CODE
            ELSE
                MOVE DE-BUYER-CODE             TO PRT-BUYER-CODE.

            MOVE 8                             TO LINE-CNT.
            ADD 1                              TO PAGE-CNT.
            MOVE PAGE-CNT                      TO PRT-PAGE-CNT.
            WRITE PRT-REC FROM HEADER-1 AFTER ADVANCING NEW-PAGE.
            WRITE PRT-REC FROM HEADER-3 AFTER ADVANCING 1.
            IF PRT-BUYER-CODE NOT = SPACES
                ADD 1                          TO LINE-CNT
                WRITE PRT-REC FROM HEADER-31 AFTER ADVANCING 1.
            WRITE PRT-REC FROM HEADER-5 AFTER ADVANCING 2.
            WRITE PRT-REC FROM HEADER-6.
       889-EXIT.  EXIT.

       899-EXIT.  EXIT.

       COPY OVRPFCALL IN COPYLIB.
      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       990-BLOWUP.
           WRITE PRT-REC FROM ESC-TEXT-61  AFTER ADVANCING 0.
           WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.

           MOVE "TBLKBYVN"     TO BU-PGM-NAME.
           MOVE SORT-PO-NO     TO BU-DISPLAY-FLD (3).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

       999-EXIT.  EXIT.
