000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID.    TBLKINQ2.
000600 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800*REMARKS.
      *****************************************************************
      ** BLANKET INQUIRES
      *****************************************************************
002400*   T B L K I N Q 2                                  *
002500*                                                    *
002600*   THIS PROGRAM PRINTS REQUIREMENT ORDERS INQUIRY   *
002700*   SCREEN WHEN THE USER HITS 'f1' ON THE BASIC      *
002800*   INQUIRY SCREEN OF MTLSTAT. THE SCREEN PRINTS     *
002900*   UP TO 11 BLANKETS ON THE SCREEN. BLANKETS        *
003000*   ARE IDENTIFIED BY '999' IN THE RLSE FIELD OF THE *
003100*   P.O. NUMBER                                      *
003200*                                                    *
003300******************************************************
003400*   N O T E    T H I S   S U B R O U T I N E   I S   *
003500*         C A L L E D    B Y :                       *
003600*      1. TMTLSTAT                                   *
003700*      2. TREQUPDT  (AKRON ONLY PLANTS)              *
003800*      3. TRQPUPDC                                   *
      *****************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
000900*   OCT 18, 1983
001000*       1. SCREEN PRINTS OUR NOW HANDLED BY THE SUBROUTINE
001100*         'TSCRPRNT'.
001200*          KURT MOVSESIAN.
      *C---------------------------------------------------------------
001400*    01/29/86.
001500*      ADDED A CHECK FOR VIEW STATUS OF 160 AFTER VREADFIELDS.
001600*      THIS INDICATES A SCREEN TIMEOUT, AND IS HANDLED AS IF
001700*      "f8" WAS PRESSED.  THIS CHANGE IS FOR MMIS PROGRAMS THAT
001800*      CALL THIS SUBPROG THRU "TMTLSTAT" - THEY SET THE TIMEOUT
001900*      KEY IN VIEW-COMAREA.  CIH.
      *C---------------------------------------------------------------
004100*     APRIL 18, 1985
004200*      1. TDATECHK WAS ADDED TO HANDLE DATES
004300*      2. TBLOWUP WAS ADDED TO FOR BLOWUP ROUTINE.
004400*            KURT MOVSESIAN.
004500*
      *C---------------------------------------------------------------
004600*   10/10/85  THIS PROGRAM IS A DUPLICATE OF TBLKTINQ, EXCEPT
004700*             FOR CHANGES NEEDED TO ACCOMODATE THE NATIVE
004800*             LANGUAGE SUPPORT FACILITY.  THESE CHANGES INCLUDE
004900*             ADDING OF LINKAGES INTO WORKING STORAGE.
      *C---------------------------------------------------------------
005000*   10/10/85  CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,
005100*             TDATECHK TO TDATECK2.
005200*             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE
005300*             SUPPORT VERSIONS OF THESE SUBROUTINES.
005400*                               -TW COTTON.
      *C---------------------------------------------------------------
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *C    NEW DISPLAY FILE ZTBLKINQ2 CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************

006200 ENVIRONMENT DIVISION.
006300 CONFIGURATION SECTION.

006400 SOURCE-COMPUTER.  HP-3000.
006500 OBJECT-COMPUTER.  HP-3000.

       COPY SPECIALN IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DPOITEM
                  ASSIGN TO DATABASE-MCFLCS1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
DCR01             ASSIGN TO WORKSTATION-ZTBLKINQ2-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

006900 DATA DIVISION.
007000
       FILE SECTION.
       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
DCR01  01  DISPLAY-REC        PIC X(2000).

007100 WORKING-STORAGE SECTION.
007200 77  SUB                         PIC S9(4)   VALUE ZEROS.
007300 77  FATAL-ERR-SW                PIC X       VALUE "N".
007400
007500 COPY FUNCTDEF IN COPYLIB.
007600
007700 01  MORE-THAN-11-REQ.
007800     05  FILLER  PIC X(69).
007900
008000 01  NO-REQ-MSG.
008100     05  FILLER  PIC X(69).
008200
008300
008400
008500
       COPY HMSGBUF IN COPYLIB.
009300
028800 01  FIELD-NUMBER         PIC S9(4) COMP VALUE 1.

       01  SCREEN-BUFFER               PIC X(2000).

009600 01  SCREEN-1.
009700     05  SCREEN-1-COMP           PIC X(3).
009800     05  DISP-CODE               PIC X(7).
009900     05  DISP-BLANKET-TABLE  OCCURS 11 TIMES.
010000         10  DISP-PO-NUM         PIC X(7).
010100         10  DISP-ITM-NUM        PIC ----9.
010200         10  DISP-UM             PIC XX.
010300         10  DISP-REQ-DATE       PIC X(8).
010400         10  DISP-EXP-DATE       PIC X(8).
010500     05  DISP-MORE-11-MSG        PIC X(69).
           05  DE-COMMAND-LINE         PIC X(79).
           05  DE-MESSAGE-LINE         PIC X(79).
010600
011200**************************************************************
011300**************************************************************
011400**                                                          **
011500**                DATABASE I/O BUFFER AREA                  **
011600**                                                          **
011700**************************************************************
011800**************************************************************
011900
012000 COPY DPOITEM IN COPYLIB.
012100
012200 COPY DPORECD IN COPYLIB.
012300
012400*********************
012500*                   *
012600*   DATA SET NAMES  *
012700*                   *
012800*********************
012900
013000 01  DSET-NAMES.
013100     05  DSET-NAME              PIC X(16)  VALUE SPACES.
013200     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
013300     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
013400
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

013500 COPY DBSTAT IN COPYLIB.
013600
013700 COPY DBMODES IN COPYLIB.
013800
013900 01 ITEMS-LISTING.
014000     05  ALL-ITEMS              PIC XX    VALUE "@;".
014100     05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
014200     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
014300
014400 01  ARG-VALUES.
014500     05  PO-ARG                 PIC X(14) VALUE SPACES.
014600
014700
014800 COPY TDATECHK   IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
014900
015000
015100 COPY TBLOWUP    IN COPYLIB.
015200
015300 LINKAGE SECTION.
015400
015500 01  BASE                    PIC X(10).
015600
015700
015800 01  CODE-ARG             PIC X(8).
015900
016000 01  COMP-SCREEN-INDIC    PIC X(3).
016100
016200 COPY VCOMLINK IN COPYLIB.
016300
016400 01  SCREEN-PRINT-PARMS.
016500     05  PRINTCNTL              PIC S9(4)  COMP-4.
016600     05  PAGECNTL               PIC S9(4)  COMP-4.
016700     05  SPOOLFIL-OPEN-SW       PIC X.
016800
016900 01  PASSED-SPOOL-PRT           PIC S9(2)  COMP-4.
017000
017100 COPY LANGSUB IN COPYLIB.
017200
017300
017400
017500 PROCEDURE DIVISION USING  BASE,
017600                           CODE-ARG,
017700                           COMP-SCREEN-INDIC,
017800                           VIEW-COMAREA,
017900                           SCREEN-PRINT-PARMS,
018000                           PASSED-SPOOL-PRT,
018100                           LANGUAGE-PARMS.
018200
018300
018400 1-BEGIN.
           MOVE 0 TO SUB.
           OPEN INPUT DPOITEM, DPORECD.
           OPEN I-O DISPLAY-FILE.
018500     MOVE "TBLKTINQ"  TO  BU-PGM-NAME.
018600     PERFORM 61-PRINT-BLANKET-SCREEN  THRU  61-PBS-X.
018700     IF FATAL-ERR-SW = "Y"
018800         GO TO 2-BLOWUP.
018900
           CLOSE DPOITEM, DPORECD.
           CLOSE DISPLAY-FILE.
019000     GOBACK.
019100
019200
019300 2-BLOWUP.
019400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
019500         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
019600                 BU-DISPLAY-FLDS.
019700
019800 2-BLOWUP-X.
019900     EXIT.
020000
020100
020200*4-SHOWFORM.
020300*    CALL "VSHOWFORM" USING  VIEW-COMAREA.
020400*    IF VIEW-STATUS  NOT = 0
020500*        MOVE "SHOWFORM 4-S *GETBLKT"  TO  BU-DISPLAY-MSG
020600*        MOVE "Y"                TO  FATAL-ERR-SW.
020700*
020800*4-SHOWFORM-X.
020900*    EXIT.
021000*
021100*4-VIEW-PUTWINDOW.
021200*    CALL "VPUTWINDOW" USING  VIEW-COMAREA
021300*                             MESSAGE-BUFFER
021400*                             MSG-ACTUALEN.
021500*
021600*    IF VIEW-STATUS EQUAL ZERO
021700*        NEXT SENTENCE
021800*    ELSE
021900*        MOVE "Y"    TO  FATAL-ERR-SW
022000*        MOVE "VPUTWINDOW 4-VE *GETBLKT"  TO  BU-DISPLAY-MSG.
022100*
022200*4-VIEW-PUTWINDOW-X.
022300*    EXIT.
022400*
022500
022600 61-PRINT-BLANKET-SCREEN.
022700     MOVE SPACES         TO  SCREEN-1.
022800     MOVE CODE-ARG       TO  DISP-CODE.
022900     MOVE COMP-SCREEN-INDIC  TO  SCREEN-1-COMP.
023000     MOVE ZERO           TO  SUB.
023100*    CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1,
023200*           STATUS-AREA, CODE-SEARCH, CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-REC.
           START DPOITEM KEY = CORPCDE OF DPOITEM-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
023300     IF COND-WORD NOT = 0
023400         MOVE "61-PBS *GETBLKT"  TO  BU-DISPLAY-MSG
023500         MOVE CODE-ARG                   TO  BU-DISPLAY-FLD (1)
023600         MOVE "Y"                        TO  FATAL-ERR-SW
023700         GO TO 61-PBS-X.
023800
023900 61-GET-DPOITEM.
024000*    CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5,
024100*        STATUS-AREA, ALL-ITEMS, BUF-DPOITEM, CODE-ARG.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DPOITEM-REC NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
024200     IF COND-WORD NOT = 0
024300         IF COND-WORD = 15
024400             IF SUB = 0
      *                "NO REQUIRMENT ORDERS EXIST FOR THIS CODE"
024500                 MOVE  14 TO LANG-SETNUM
024600                 MOVE   5 TO LANG-MSGNUM
024700                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024800                 MOVE MESSAGE-BUFFER TO NO-REQ-MSG
024900                 MOVE NO-REQ-MSG  TO  DISP-MORE-11-MSG
025000                 GO TO 61-WRITE-SCREEN-1
025100             ELSE
025200                 GO TO 61-WRITE-SCREEN-1
025300         ELSE
025400             MOVE "61-GET-DPOITEM *GETBLKT"  TO  BU-DISPLAY-MSG
025500             MOVE CODE-ARG               TO  BU-DISPLAY-FLD (1)
025600             MOVE "Y"                    TO  FATAL-ERR-SW
025700             GO TO 61-PBS-X.
025800
025900 61-CHECK-IF-BLKT.
026000     IF ITM-PO-RCVR  =  "000"
026100       IF ITM-PO-REL  =  "999"
026200         ADD 1                   TO SUB
026300         IF SUB < 12
026400           MOVE ITM-PO-NO          TO DISP-PO-NUM (SUB)
026500           MOVE ITM-NUMBER         TO DISP-ITM-NUM (SUB)
026600           MOVE ITM-UM             TO DISP-UM (SUB)
026700           PERFORM 611-GET-DATES  THRU  611-GD-X
026800           IF FATAL-ERR-SW = "Y"
026900               GO TO 61-PBS-X
027000           ELSE
027100               NEXT SENTENCE
027200         ELSE
027300           MOVE  13 TO LANG-SETNUM
027400           MOVE  26 TO LANG-MSGNUM
027500           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
027600           MOVE MESSAGE-BUFFER TO MORE-THAN-11-REQ
027700           MOVE MORE-THAN-11-REQ  TO  DISP-MORE-11-MSG
027800           GO TO 61-WRITE-SCREEN-1.
027900
028000     GO TO 61-GET-DPOITEM.
028100
028200
028300 61-WRITE-SCREEN-1.
028400     MOVE "FBLKTINQ"  TO  VIEW-NFNAME.
028500*    CALL "VGETNEXTFORM" USING VIEW-COMAREA.
028600*    IF VIEW-STATUS NOT = 0
028700*        MOVE "Y"  TO  FATAL-ERR-SW
028800*        MOVE "GET FGETBLKT 61-WS1*GETBLKT" TO BU-DISPLAY-MSG
028900*        GO TO 61-PBS-X.
029000*
029100*    CALL "VPUTBUFFER" USING VIEW-COMAREA,
029200*                            SCREEN-1,
029300*                            VIEW-DBUFLEN.
029400*    IF VIEW-STATUS NOT = 0
029500*        MOVE "Y"  TO  FATAL-ERR-SW
029600*        MOVE "PUT SCREEN1 61-WS1*GETBLKT" TO BU-DISPLAY-MSG
029700*        GO TO 61-PBS-X.
029800*
029900     MOVE SPACES  TO  MESSAGE-BUFFER.
030000*    CALL "VPUTWINDOW" USING VIEW-COMAREA,
030100*                            MESSAGE-BUFFER,
030200*                            MESSAGE-ACTLEN.
030300*    IF VIEW-STATUS NOT = 0
030400*        MOVE "Y"   TO  FATAL-ERR-SW
030500*        MOVE "PUTWINDOW 61-WS1*GETBLKT" TO BU-DISPLAY-MSG
030600*        GO TO 61-PBS-X.
030700*
030800*
030900 61-READ-SCREEN-1.
031000     IF FATAL-ERR-SW  =  "Y"
031100         GO TO 61-PBS-X.
           MOVE "N" TO SRF-ENTER-FLAG.
           MOVE 2 TO SRF-KEYSET.
           MOVE "I" TO SRF-FKEY (8).
           MOVE SCREEN-1 TO SCREEN-BUFFER.
       6110-SHOWFORM.
           MOVE SCREEN-1 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO SCREEN-1.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6110-SHOWFORM.


037700 61-PBS-X.
037800     EXIT.
037900
038000 611-GET-DATES.
038100     MOVE ITM-PO-RCV-NO         TO  PO-ARG.
038200*    CALL "DBFIND" USING BASE, DSET-DPORECD, MODE1,
038300*           STATUS-AREA, PO-SEARCH, PO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC.
           START DPORECD KEY = PORCVNO OF DPORECD-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
038400     IF COND-WORD NOT = 0
038500         MOVE "611-GD *GETBLKT"  TO  BU-DISPLAY-MSG
038600         MOVE PO-ARG                     TO  BU-DISPLAY-FLD (1)
038700         MOVE "Y"                        TO  FATAL-ERR-SW
038800         GO TO 611-GD-X.
038900
039000*    CALL "DBGET" USING BASE, DSET-DPORECD, MODE5,
039100*        STATUS-AREA, ALL-ITEMS, BUF-DPORECD, PO-ARG.
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
039200     IF COND-WORD NOT = 0
039300         MOVE "611-GD *GETBLKT"  TO  BU-DISPLAY-MSG
039400         MOVE PO-ARG                 TO  BU-DISPLAY-FLD (1)
039500         MOVE "Y"                    TO  FATAL-ERR-SW
039600         GO TO 611-GD-X.
039700
039800
039900     MOVE 4              TO  DATE-MODE.
040000     MOVE PO-DATE        TO  DATE-VALIDATE-IN.
040100     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
040200     MOVE DATE-SLASH-OUT TO  DISP-REQ-DATE (SUB).
040300     MOVE PO-EXPECT-DATE TO  DATE-VALIDATE-IN.
040400     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
040500     MOVE DATE-SLASH-OUT TO  DISP-EXP-DATE (SUB).
040600
040700 611-GD-X.
040800     EXIT.
040900
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.

       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

041000 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
042600 999-CATREAD-EXIT.
042700     EXIT.
