       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TBLOWUP.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        7/1/83.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *    ON MAY 4, 1984, MADE THE FOLLOWING CHANGES:
      *
      *    1.  NOW DISPLAYS THE ALPANUMERIC BU-DISPLAY-FLDs IN THE
      *    ARRAY ONLY IF NOT SPACES OR NOT ALL ZEROS.  THIS IS
      *    SO THAT CALLING PROGRAMS DONT NEED A LOOP TO INITIALIZE
      *    THE ARRAY.  THEY CAN JUST HAVE THE ARRAY (WHICH IS 5 S9(8)
      *    FIELDS AND 5 X(14) FIELDS) REDEFINE AN AREA OF ALL ZEROS.
      *
      *    2.  NOW DISPLAYS NUMERIC FIELDS IF NOT EQUAL TO ZERO.  USED
      *        TO DISPLAY THEM ONLY IF GREATER THAN ZERO (RESULTING IN
      *        A NEGATIVE FIELD NOT BEING DISPLAYED).
      *
      *    ON JUNE 6, 1984, CHANGED PROGRAM TO HANDLE NON-VIEW
      *    PROGRAMS.  THEY PASS A DUMMY PARAMETER FOR VIEW-COMAREA,
      *    AS FOLLOWS:
      *        01  DUMMY-VIEW-AREA.
      *            05  FILLER              PIC X(118) VALUE ALL "0".
      *            05  FILLER              PIC S9(4) COMP VALUE 9999.
      *     THE 9999 VALUE WILL GO INTO "VIEW-LABELINFO".  THIS WILL
      *    TELL "TBLOWUP" NOT TO DO THE FORMFILE AND TERMINAL FILE
      *    CLOSES.  CIH.
      *
      *    ON JUNE 29, 1984, ADDED A WRITE OF THE BLOWUP INFORMATION
      *    TO A FILE CALLED "BLOWUP.DB".  ALL PASSED INFORMATION
      *    WILL BE WRITTEN TO THIS FILE.  ANOTHER PROGRAM CALLED
      *    "TBLPRT" HAS BEEN WRITTEN TO DISPLAY A FORMATTED OUTPUT
      *    OF THIS FILE.  THE PROGRAM FIRST CHECKS FOR THE EXISTENCE
      *    OF "BLOWUP.DB" - IF NOT THERE, IT BUILDS IT.  CIH.
      *
      *    ON OCTOBER 4, 1984, MOVED THE CALL TO "DBEXPLAIN" TO
      *    THE LAST PART OF THE PROGRAM.  THIS IS BECAUSE SOMETIMES
      *    SOME CALLS TO "DBEXPLAIN" WILL GO OFF ON A BOUNDS VIOLATION
      *    IF CALLED WITHOUT CERTAIN DATABASE PARAMETERS CORRECTLY
      *    SET.  THIS WAY, IF A BOUNDS VIOLATION DOES OCCUR ON
      *    "DBEXPLAIN", THE ERROR MESSAGE FILE WILL STILL BE WRITTEN
      *    TO.  CIH.
      *
      *    12/30/85
      *      MADE THE FOLLOWING CHANGES:
      *        1.  CHANGE PROGRAM TO PRINT A BLOWUP MESSAGE TO THE
      *            NEAREST PRINTER (AS DETERMINED BY "TSPLPRT").
      *
      *        2.  CHANGED PROGRAM TO WRITE ALL VIEW ERRORS TO A
      *            SEPERATE FILE - THIS IS BECAUSE SO MANY OF THE
      *            BLOWUPS ARE DUE TO A VIEW READ OR WRITE ERROR TO
      *            THE TERMINAL - AND WE ARE MAINLY INTERESTED IN THE
      *            DATABASE ERRORS WHEN WE REVIEW THE BLOWUP FILE.
      *
      *        3.  CHANGED THE NAME OF THE BLOWUP FILE FROM "BLOWUP"
      *            TO "DBLOWUP" TO CONFORM TO OUR NEW NAMING CONVENTIONS.
      *
      *        4.  CHANGED BOTH BLOWUP FILES TO A CIRCULAR FILE.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BLOWUP-FILE
                  ASSIGN       TO DATABASE-MCFPBLOWUP
                  ORGANIZATION IS SEQUENTIAL
                  FILE STATUS  IS BLOWUP-FILE-STATUS.

           SELECT ONLINE-PRT
                  ASSIGN       TO PRINTER-MCPRTBL.

           SELECT DDAILYTC
                  ASSIGN       TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS DDAILYTC-STATUS.

           SELECT MPLTINFO
                  ASSIGN       TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS DDAILYTC-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZBLOWUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.


       DATA DIVISION.
       FILE SECTION.
       FD  BLOWUP-FILE
           LABEL RECORDS       ARE STANDARD
           RECORD              CONTAINS 374 CHARACTERS
           DATA RECORD         IS BLOWUP-RCD.
       01  BLOWUP-RCD.
           05  BF-PLT-CODE     PIC X(4).
           05  BF-BASE         PIC X(16).
           05  BF-PGM-NAME     PIC X(8).
           05  BF-STATUS-AREA  PIC X(20).
           05  BF-VIEW-COMAREA PIC X(120).
           05  BF-FILE-STATUS  PIC X(2).
           05  BF-MESSAGE      PIC X(60).
           05  BF-FLDS         PIC X(110).
           05  BF-DATE         PIC X(8).
           05  BF-TIME         PIC X(6).
           05  BF-USER         PIC X(8).
           05  BF-ACCOUNT      PIC X(8).
           05  BF-TERM         PIC X(4).

       FD  ONLINE-PRT
           LABEL RECORDS       ARE OMITTED
           RECORD              CONTAINS 132 CHARACTERS
           DATA RECORD         IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE      PIC X(132).

       FD  DDAILYTC
           LABEL RECORDS       ARE STANDARD.
       01  DDAILYTC-REC.
           COPY DDS-MCRPCS1600 OF MCFLCS1601.

       FD  MPLTINFO
           LABEL RECORDS       ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(1500).

       WORKING-STORAGE SECTION.
       77  SUB                 PIC 9(2)  VALUE 0.
       77  SAVE-VIEW-STATUS    PIC S9(4) COMP-4 VALUE 0.
       77  COMMAND1            PIC X(81) VALUE SPACES.
       77  COMMAND2            PIC X(81) VALUE SPACES.
       77  COND-WRD2           PIC S9(4) COMP-4 VALUE 0.
       77  I                   PIC 9(4) BINARY.

       01  CORPCODE-TEST.
           03  CORPCODE-AREA.
               05  FILLER          PIC X(6)  VALUE SPACES.
               05  TEST-IF-CODE1   PIC X     VALUE SPACE.
           03  BLANK-AREA.
               05  TEST-IF-CODE2   PIC X(7)  VALUE SPACES.

       01  X                   PIC 9     VALUE ZERO.
       01  MSG-WORK.
           05  MSG-WORK1       PIC X(40) VALUE SPACES.
           05  MSG-WORK2       PIC X(20) VALUE SPACES.

       01  PLT-BASE            PIC X(16) VALUE "  STORES;".
       01  PASSWORD            PIC X(8)  VALUE "JADE;   ".

       01  ALL-ITEM-LIST       PIC X(2)   VALUE "@;".
       01  MPLTINFO-ARG        PIC X(4)   VALUE "P 01".
       01  MODE1               PIC S9(4)  VALUE +1 COMP-4.
       01  MODE7               PIC S9(4)  VALUE +7 COMP-4.
       01  MODE3               PIC S9(4)  VALUE +3 COMP-4.
       01  BUF-MPLTINFO.
           05  MPLTINFO-KEY    PIC X(4).
           05  MPLTINFO-COMPANY PIC X(3).
           05  FILLER          PIC X(57).

           COPY DDAILYTC       OF COPYLIB.

           COPY TC500          OF COPYLIB.

      **************************************************************
      **                                                          **
      **        E R R O R   M E S S A G E   A R E A S             **
      **                                                          **
      **************************************************************

       01  HDR-AST-1                     PIC X(77) VALUE ALL "*".
       01  HDR-AST-2.
           05  FILLER                    PIC X(7)  VALUE ALL "*".
           05  FILLER                    PIC X(63) VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE ALL "*".
       01  HDR-AST-3.
           05  FILLER                    PIC X(7)  VALUE ALL "*".
           05  FILLER                    PIC X(19) VALUE SPACES.
           05  FILLER      PIC X(25) VALUE "P R O G R A M   A B E N D".
           05  FILLER                    PIC X(19) VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE ALL "*".
       01  HDR-4.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(25) VALUE "A program has terminated ".
           05  FIL PIC X(27) VALUE "abnormally at the terminal ".
           05  FIL PIC X(16) VALUE "described below.".
       01  HDR-5.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(27) VALUE "PLEASE CONTACT PROGRAMMING ".
           05  FIL PIC X(27) VALUE "STAFF IMMEDIATELY - DO NOT ".
           05  FIL                       PIC X(11) VALUE "CONTINUE TO".
       01  HDR-6.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(16) VALUE "USE THE PROGRAM.".
       01  HDR-7.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(26) VALUE "This printout is a record ".
           05  FIL PIC X(25) VALUE "of all information about ".
           05  FIL PIC X(12) VALUE "the abnormal".
       01  HDR-8.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(29) VALUE "termination of the program.  ".
           05  FIL PIC X(27) VALUE "PLEASE SEND IT TO THE LOCAL".
       01  HDR-9.
           05  FIL                       PIC X(5)  VALUE SPACES.
           05  FIL PIC X(27) VALUE "DATA PROCESSING DEPARTMENT ".
           05  FIL PIC X(14) VALUE "AT YOUR PLANT.".

       01  DE-FIELDS.
           05  BU-LINE-1                 PIC X(50) VALUE ALL "*".
           05  BU-LINE-2.
               10  FILLER                PIC X(2)  VALUE "**".
               10  FILLER                PIC X(15) VALUE SPACES.
               10  FILLER                PIC X(3)  VALUE "** ".
               10  DIS-NAM               PIC X(8).
               10  FILLER                PIC X(3)  VALUE " **".
               10  FILLER                PIC X(17) VALUE SPACES.
               10  FILLER                PIC X(2)  VALUE "**".
           05  BU-LINE-3.
               10  FILLER                PIC X(2)  VALUE "**".
               10  FILLER                PIC X(8)  VALUE SPACES.
               10  FILLER  PIC X(15) VALUE "WRITE DOWN THE ".
               10  FILLER  PIC X(13) VALUE "FOLLOWING AND".
               10  FILLER                PIC X(10) VALUE SPACES.
               10  FILLER                PIC X(2)  VALUE "**".
           05  BU-LINE-4.
               10  FILLER                PIC X(2)  VALUE "**".
               10  FILLER                PIC X(10) VALUE SPACES.
               10  FILLER  PIC X(20) VALUE "CONTACT PROGRAMMING ".
               10  FILLER                PIC X(5)  VALUE "STAFF".
               10  FILLER                PIC X(11) VALUE SPACES.
               10  FILLER                PIC X(2)  VALUE "**".
           05  BU-LINE-5                 PIC X(50) VALUE ALL "*".
           05  BU-DISPLAY-AREA.
               10  FILLER                PIC XX    VALUE "**".
               10  BU-DISPLAY-MSG        PIC X(27) VALUE SPACES.
               10  FILLER                PIC XX    VALUE "**".
               10  BU-DISPLAY-STAT       PIC S9(4) VALUE ZERO.
               10  FILLER                PIC XX    VALUE "**".
               10  FILLER                PIC X     VALUE SPACES.
               10  BU-DISPLAY-FLD        PIC X(9)  VALUE SPACES.
               10  FILLER                PIC X     VALUE SPACES.
               10  FILLER                PIC XX    VALUE "**".
           05  BU-LINE-7                 PIC X(50) VALUE ALL "*".
           05  DE-DISPLAY-AREA           PIC X(60).
           05  DE-BU-FLDS.
               10  DE-BU-FLDS-LINE OCCURS 5 TIMES.
                   15  DE-BU-FLD         PIC X(14).
                   15  DE-BU-FLD9        PIC ZZZZZZZZ.
           05  DE-FILE-STATUS            PIC X(2).

           COPY TSHWRDFM       IN COPYLIB.

           COPY DISPDAT2       IN COPYLIB.

           COPY IOFEEDBACK     IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY LANGUAGE       IN COPYLIB.

      *************************************************************
      **                                                          **
      **          C O M M U N I C A T I O N S   A R E A S         **
      **                                                          **
      **************************************************************

      *------ PARMS FOR 'CFINDPGM' AND 'CFNDLKJOB' TO FIND WHICH
      *------ JOB HAS FILE LOCKED AND LOOK IN PGM STACK TO SEE
      *------ WHICH PROGRAM IT IS RUNNING.
       01  JOB-NUMBER-NOTHING            PIC X(6)  VALUE SPACES.
       01  JOB-USER-NOTHING              PIC X(10) VALUE SPACES.
       01  JOB-NAME-THISONE              PIC X(10) VALUE "*".
       01  RET-STAT                      PIC X(2).
       01  JOB-NUMBER                    PIC X(6).
       01  JOB-USER                      PIC X(10).
       01  JOB-NAME                      PIC X(10).
       01  PGM-NAMES.
           05  PGM-NAME OCCURS 5 TIMES   PIC X(10).
       01  NUM-PGM-NAMES                 PIC 9(1).

       01  COMMAND                       PIC X(70).
       01  COMMAND-LEN PIC S9(10)V9(5) COMP-3 VALUE 70.

       01  WHO-VARIABLES.
           05  MOD                       PIC S9(4) COMP-4.
           05  CAP                       PIC S9(8) COMP-4.
           05  LATTR                     PIC S9(8) COMP-4.
           05  USERNAME                  PIC X(8).
           05  GRPNAME                   PIC X(8).
           05  ACCTNAME                  PIC X(8).
           05  HOMEGRP                   PIC X(8).
           05  TNUM                      PIC S9(4) COMP-4.
           05  FILLER                    PIC XX.

       01  SPOOLER-AREA.
           05  SPOOL-STAT                PIC S9     VALUE ZEROS COMP-4.
           05  SPOOL-PRT                 PIC S9(2)  VALUE ZEROS COMP-4.
           05  SPOOL-COPIES              PIC S9(2)  VALUE 1 COMP-4.
           05  SPOOL-PRIOR               PIC S9     VALUE ZEROS COMP-4.
           05  SPOOL-MSG                 PIC X(75)  VALUE SPACES.

       01  JCW-NAME                      PIC X(8)  VALUE SPACES.
       01  JCW-VALUE                     PIC S9(4) COMP-4 VALUE 0.
       01  JCW-STATUS                    PIC S9(4) COMP-4 VALUE 0.

           COPY TSPLPRT        IN COPYLIB.

           COPY THDPRT         IN COPYLIB.

           COPY TDATECHK       IN COPYLIB.

      **************************************************************
      **                                                          **
      **                  V I E W   W O R K                       **
      **                                                          **
      **************************************************************

           COPY FUNCTDEF       IN COPYLIB.

           COPY HMSGBUF        IN COPYLIB.

       01  FIELD-NUMBER        PIC S9(4) COMP VALUE 1.

      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************

       01  ERROR-BUF           PIC X(72) VALUE SPACES.
       01  ERROR-LEN           PIC S9(4) COMP-4 VALUE 0.
       01  BLOWUP-FILE-STATUS  PIC X(2).
       01  DDAILYTC-STATUS     PIC X(2).

      **************************************************************
      **                                                          **
      **               K S A M   W O R K                          **
      **                                                          **
      **************************************************************

       01  RESULT                        PIC 9(4)  VALUE 0.

      **************************************************************
      **                                                          **
      **    H E A D E R / D E T A I L   A R E A S                 **
      **                                                          **
      **************************************************************

       01  DATE-TIME-LINE.
           05  FILLER         PIC X(14) VALUE "DATE:         ".
           05  PRT-DATE                  PIC X(8).
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER                    PIC X(6)  VALUE "TIME: ".
           05  PRT-TIME                  PIC X(8).

       01  TERMINAL-LINE.
           05  FILLER     PIC X(14) VALUE "TERMINAL:     ".
           05  PRT-TERMINAL              PIC X(10).

       01  USER-LINE.
           05  FILLER     PIC X(14) VALUE "USER:         ".
           05  PRT-USER                  PIC X(8).
           05  FILLER                    PIC X(1)  VALUE ".".
           05  PRT-ACCOUNT               PIC X(8).

       01  PRT-PGM-NAME-LINE.
           05  FILLER     PIC X(14) VALUE "PROGRAM NAME: ".
           05  PRT-PGM-NAME              PIC X(8).

       01  PRT-MSG-LINE.
           05  FILLER         PIC X(14) VALUE "MESSAGE:      ".
           05  PRT-PASSED-MSG            PIC X(60).

       01  PRT-COND-LINE.
           05  FILLER         PIC X(14) VALUE "COND WORD:    ".
           05  PRT-COND-WORD             PIC ---9.

       01  FILE-STATUS-LINE.
           05  FILLER         PIC X(14) VALUE "FILE STATUS:  ".
           05  PRT-FILE-STATUS           PIC X(2).

       01  PRT-VIEW-LINE.
           05  FILLER         PIC X(12) VALUE "VIEW STATUS:".
           05  PRT-VIEW-STATUS           PIC --9.

       01  PRT-DISPLAY-FLD-LINE.
           05  FILLER                    PIC X(6) VALUE "FIELD ".
           05  PRT-DISPLAY-FLD-NO        PIC --9.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  PRT-DISPLAY-FLD           PIC X(14).

       01  PRT-DISPLAY-FLD9-LINE.
           05  FILLER                    PIC X(10) VALUE "NUM-FIELD ".
           05  PRT-DISPLAY-FLD9-NO       PIC --9.
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-DISPLAY-FLD9          PIC X(14).

      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.
       01  BASE                PIC X(16).

       01  BU-PGM-NAME         PIC X(8).

           COPY DBSTAT         IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

       01  FILE-STATUS.
           05  K-STAT-1        PIC X(1).
           05  FILLER          PIC X(1).

       01  PASSED-MSG.
           05  PASSED-MSG-SPL-FLAG       PIC X(24).
           05  FILLER                    PIC X(10).
           05  MSG-JOBSPEC               PIC X(26).

       01  DISPLAY-FLDS.
           05  BU-DISPLAY-LINE OCCURS 5  TIMES.
               10  DISPLAY-FLD           PIC X(14).
               10  DISPLAY-FLD9-X        PIC X(8).
               10  DISPLAY-FLD9 REDEFINES DISPLAY-FLD9-X  PIC S9(8).

       PROCEDURE DIVISION USING BASE BU-PGM-NAME STATUS-AREA
                                VIEW-COMAREA FILE-STATUS PASSED-MSG
                                DISPLAY-FLDS.

       6000-MAIN.
           OPEN I-O            DDAILYTC.
           OPEN INPUT          MPLTINFO.
           MOVE PASSED-MSG     TO  BU-DISPLAY-MSG.

           MOVE ZERO           TO  SUB.
           PERFORM 5 TIMES
               ADD 1           TO  SUB
               IF DISPLAY-FLD9-X (SUB) NOT NUMERIC
                   MOVE ZERO   TO  DISPLAY-FLD9 (SUB)
               END-IF
           END-PERFORM.

      *------ IF THE CALLING PROGRAM DID NOT PASS PROGRAM NAME,
      *------ USE THE 'WRKJOB *PGMSTK' COMMAND TO FIND ALL THE
      *------ CSIS/MMIS PROGRAMS IN THE STACK AND MOVE TO THE
      *------ DISPLAY FIELDS FOR LATER DEBUGGING
           IF BU-PGM-NAME < "A" OR > "X"
               CALL "CFINDPGM" USING  JOB-NUMBER-NOTHING,
                                      JOB-USER-NOTHING,
                                      JOB-NAME-THISONE,
                                      RET-STAT
                                      PGM-NAMES,
                                      NUM-PGM-NAMES
               IF RET-STAT = "00"
                  PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM-PGM-NAMES
                       MOVE PGM-NAME (I)     TO  DISPLAY-FLD (I)
                  END-PERFORM
               ELSE
                  MOVE "NOTAUTH" TO BU-PGM-NAME.

      *------ IF THIS IS A LOCKED RECORD ERROR, FIND OUT WHICH JOB
      *------ HAS THE RECORD LOCKED BY CALLING 'CFNDLKJB': WHICH
      *------ DISPLAYS THE CURRENT JOB LOG AND FINDS THE JOB THAT
      *------ HAS IT LOCKED FROM THERE.  THEN USING THAT JOB NUMBER,
      *------ CALL 'CFINDPGM' TO FIND THE CSIS/MMIS PROGRAMS IN THE
      *------ STACK OF THAT JOB.  THIS WILL IDENTIFY THE OFFENDING
      *------ PROGRAM.
           IF FILE-STATUS = "9D"
               CALL "CFNDLKJB" USING JOB-NUMBER
                                     JOB-USER
                                     JOB-NAME
                                     RET-STAT
               IF RET-STAT = "00"
                   MOVE SPACES           TO  MSG-JOBSPEC
                   STRING JOB-NUMBER DELIMITED BY SPACES,
                          "/" DELIMITED BY SIZE
                          JOB-USER DELIMITED BY SPACES,
                          "/" DELIMITED BY SIZE,
                          JOB-NAME DELIMITED BY SPACES
                      INTO MSG-JOBSPEC
                   CALL "CFINDPGM" USING  JOB-NUMBER,
                                          JOB-USER,
                                          JOB-NAME,
                                          RET-STAT
                                          PGM-NAMES,
                                          NUM-PGM-NAMES
                   IF RET-STAT = "00"
                       PERFORM VARYING I FROM 1 BY 1
                       UNTIL I > NUM-PGM-NAMES
                           MOVE PGM-NAME (I)     TO  DISPLAY-FLD (I)
                       END-PERFORM.

      ****************************************************
      **   IF THE CALLING PROGRAM PASSES "SPOOLER NUMBER**
      **   NOT FOUND" IN THE DISPLAY MESSAGE, THIS      **
      **   MEANS NOT TO GIVE ALL THE ERROR MESSAGES,    **
      **   BUT JUST TO DISPLAY A SPOOLFILE ERROR        **
      **   MESSAGE.                                     **
      ****************************************************

           IF PASSED-MSG-SPL-FLAG = "SPOOLER NUMBER NOT FOUND"
               DISPLAY "YOUR TERMINAL IS NOT IN THE SPOOLER FILE"
               DISPLAY "NO FURTHER PROCESSING CAN BE PERFORMED."
               DISPLAY "CONTACT YOUR DATA CENTER FOR HELP."
               GO TO 6500-WRITE-BLOWUP-FILE.

           MOVE COND-WORD                TO  BU-DISPLAY-STAT.
           MOVE FILE-STATUS              TO  BU-DISPLAY-FLD.
           MOVE BU-PGM-NAME              TO  DIS-NAM.
           MOVE PASSED-MSG               TO  DE-DISPLAY-AREA.
           MOVE FILE-STATUS              TO  DE-FILE-STATUS.

           MOVE 0                        TO  SUB.
       6200-DISPLAY-FLD-LOOP.
           ADD 1                         TO  SUB.
           IF SUB > 5
               GO TO 6250-DISPLAY-FLD9.
           IF DISPLAY-FLD (SUB) = SPACES OR "00000000000000"
               MOVE SPACES               TO  DE-BU-FLD (SUB)
           ELSE
               MOVE DISPLAY-FLD (SUB)    TO  DE-BU-FLD (SUB).
           GO TO 6200-DISPLAY-FLD-LOOP.

       6250-DISPLAY-FLD9.
           MOVE 0                        TO  SUB.
       6270-DISPLAY-FLD9-LOOP.
           ADD 1                         TO  SUB.
           IF SUB > 5
               GO TO 6500-WRITE-BLOWUP-FILE.
           IF DISPLAY-FLD9 (SUB)  = 0
               MOVE ZERO                 TO  DE-BU-FLD9 (SUB)
           ELSE
               MOVE DISPLAY-FLD9 (SUB)   TO  DE-BU-FLD9 (SUB).
           GO TO 6270-DISPLAY-FLD9-LOOP.

       6500-WRITE-BLOWUP-FILE.

      **************************************************************
      **   THE FOLLOWING LOGIC WRITES ALL THE BLOWUP INFORMATION  **
      **   TO A FILE - IN ORDER TO HAVE A PERMANENT RECORD OF THE **
      **   PROBLEM.                                               **
      **************************************************************

      ***   GET THE "CWHO" DATA FOR WRITING TO THE BLOWUP FILE.

           CALL "WHO" USING MOD CAP LATTR USERNAME GRPNAME
             ACCTNAME HOMEGRP TNUM.

           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.

           MOVE "000"                    TO  MPLTINFO-COMPANY.
           PERFORM 8000-CUT-TC500 THRU 8999-EXIT.

           OPEN EXTEND BLOWUP-FILE.

           MOVE BASE                     TO  BF-BASE.
           MOVE BU-PGM-NAME              TO  BF-PGM-NAME.
           MOVE STATUS-AREA              TO  BF-STATUS-AREA.
           MOVE VIEW-COMAREA             TO  BF-VIEW-COMAREA.
           MOVE FILE-STATUS              TO  BF-FILE-STATUS.
           MOVE PASSED-MSG               TO  BF-MESSAGE.
           MOVE DISPLAY-FLDS             TO  BF-FLDS.
           MOVE DATE-SLASH-OUT           TO  BF-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO BF-TIME.
           MOVE USERNAME                 TO  BF-USER.
           MOVE ACCTNAME                 TO  BF-ACCOUNT.
           MOVE TNUM                     TO  BF-TERM.
           MOVE MPLTINFO-COMPANY         TO  BF-PLT-CODE.

           WRITE BLOWUP-RCD.

           CLOSE BLOWUP-FILE.

           PERFORM 9100-PRINT-BLOWUP THRU 9190-PB-X.

       6600-DISPLAY-SCREEN.
      *****************************************************
      **   IF THE PROGRAM IS INTERACTIVE, DISPLAY THE    **
      **   BLOWUP MESSAGE TO THE TERMINAL.               **
      *****************************************************
           IF MOD = 7
               NEXT SENTENCE
           ELSE
               GO TO 6990-MAIN-X.

           OPEN I-O DISPLAY-FILE.
           MOVE "FBLOWUP"                TO  VIEW-NFNAME.
           MOVE 8                        TO  SRF-KEYSET.
           MOVE DE-FIELDS                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           CLOSE DISPLAY-FILE.


       6990-MAIN-X.
           CLOSE DDAILYTC.
           CLOSE MPLTINFO.
      *------ CALL A CL PROGRAM SO THAT IF 'TBLOWUP' IS CALLED
      *------ FROM A PROGRAM INSIDE A CL PROGRAM, THE CL PROGRAM
      *------ WILL NOT CONTINUE TO EXECUTE
           CALL "CLBLOWUP".
           STOP RUN.

      **************************************************
      * CUT TRANSACTION 500 FOR EVERY BLOWUP MSG THAT  *
      * IS NOT A DATABASE OPEN ERROR.  FOR EVERY ONE   *
      * BLOWUP, THERE WILL BE FOUR RECORDS.  A 1, 2,   *
      * 3, OR 4 WILL BE PLACED IN THE BYTE AFTER       *
      * CORPORATE CODE IN EACH TRANSACTION.  THE IBM   *
      * SORTS ON THIS FIELD.                           *
      **************************************************
       8000-CUT-TC500.
           MOVE SPACES                   TO  BUF-500.
      *----------  GET PLANT NUMBER
      *    CALL "DBGET" USING PLT-BASE, MPLTINFO, MODE7, STATUS-AREA2,
      *         ALL-ITEM-LIST, BUF-MPLTINFO, MPLTINFO-ARG.
           MOVE 0                        TO  COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17                  TO  COND-WORD.
           IF COND-WORD NOT = 0
              GO TO 8999-EXIT
           ELSE
              MOVE MPLTINFO-COMPANY      TO  DDAILYTC-PLT.

           MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT  TO DDAILYTC-TIME.
           MOVE "500"                    TO  DDAILYTC-TC.
           MOVE "1"                      TO  TC500-SORT1.
           MOVE BASE                     TO  TC500-BASE.
           MOVE BU-PGM-NAME              TO  TC500-PGM-NAME.
           MOVE COND-WORD                TO  TC500-COND-WORD.
           MOVE USERNAME                 TO  TC500-USER.
           MOVE DISPLAY-FLD(5)           TO  TC500-FLD-5.
           MOVE VIEW-STATUS              TO  TC500-VIEW-STAT.

      *----------  FIND CORPORATE CODE
           MOVE "NON-STR"                TO  TC500-CORPCODE.
           MOVE 1                        TO  X.
           PERFORM 8010-FLD-LOOP-FOR-CODE THRU 8019-EXIT.
           GO TO 8020-WRITE-RECORD.

       8010-FLD-LOOP-FOR-CODE.
           MOVE DISPLAY-FLD (X)          TO  CORPCODE-TEST.
           IF TEST-IF-CODE2 = SPACES
              MOVE CORPCODE-AREA         TO  TC500-CORPCODE
              GO TO 8019-EXIT.
           ADD 1                         TO  X.
           IF X < 6
              GO TO 8010-FLD-LOOP-FOR-CODE.
       8019-EXIT.  EXIT.

      *----------  WRITE RECORD 1 OUT OF 4
       8020-WRITE-RECORD.
      *    CALL "DBPUT" USING PLT-BASE DDAILYTC MODE1 STATUS-AREA2
      *                       ALL-ITEM-LIST BUF-DDAILYTC.
           MOVE 0                        TO  COND-WRD2.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC INVALID KEY
               MOVE 99                   TO  COND-WRD2.
           IF COND-WRD2 NOT = 0
              GO TO 8999-EXIT.

      *----------  CREATE RECORD 2
           MOVE SPACES                   TO  TC500-REC1.
           MOVE PASSED-MSG               TO  MSG-WORK.
           MOVE MSG-WORK1                TO  TC500-MSG1.
           MOVE DISPLAY-FLD (1)          TO  TC500-FLD-1.
           MOVE "2"                      TO  TC500-SORT1.

      *    CALL "DBPUT" USING PLT-BASE DDAILYTC MODE1 STATUS-AREA2
      *                       ALL-ITEM-LIST BUF-DDAILYTC.
           MOVE 0                        TO  COND-WRD2.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC INVALID KEY
               MOVE 99                   TO  COND-WRD2.
           IF COND-WRD2 NOT = 0
              GO TO 8999-EXIT.

      *----------  CREATE RECORD 3
           MOVE SPACES                   TO  TC500-REC1.
           MOVE MSG-WORK2                TO  TC500-MSG2.
           MOVE DISPLAY-FLD9 (1)         TO  TC500-FLD9-1.
           MOVE DISPLAY-FLD9 (2)         TO  TC500-FLD9-2.
           MOVE DISPLAY-FLD9 (3)         TO  TC500-FLD9-3.
           MOVE DISPLAY-FLD9 (4)         TO  TC500-FLD9-4.
           MOVE FILE-STATUS              TO  TC500-KSAM.
           MOVE "3"                      TO  TC500-SORT1.

      *    CALL "DBPUT" USING PLT-BASE DDAILYTC MODE1 STATUS-AREA2
      *                       ALL-ITEM-LIST BUF-DDAILYTC.
           MOVE 0                        TO  COND-WRD2.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC INVALID KEY
               MOVE 99                   TO  COND-WRD2.
           IF COND-WRD2 NOT = 0
              GO TO 8999-EXIT.

      *----------  CREATE RECORD 4
           MOVE SPACES                   TO  TC500-REC1.
           MOVE DISPLAY-FLD  (2)         TO  TC500-FLD-2.
           MOVE DISPLAY-FLD  (3)         TO  TC500-FLD-3.
           MOVE DISPLAY-FLD  (4)         TO  TC500-FLD-4.
           MOVE ACCTNAME                 TO  TC500-ACCT.
           MOVE TNUM                     TO  TC500-TERM.
           MOVE "4"                      TO  TC500-SORT1.

      *    CALL "DBPUT" USING PLT-BASE DDAILYTC MODE1 STATUS-AREA2
      *                       ALL-ITEM-LIST BUF-DDAILYTC.
           MOVE 0                        TO  COND-WRD2.
           WRITE DDAILYTC-REC FROM BUF-DDAILYTC INVALID KEY
               MOVE 99                   TO  COND-WRD2.
           IF COND-WRD2 NOT = 0
              GO TO 8999-EXIT.
      *
      *    CALL "DBUNLOCK" USING PLT-BASE DDAILYTC MODE3 STATUS-AREA2.
      *
       8999-EXIT.  EXIT.


       9100-PRINT-BLOWUP.
      *    CALL "TSPLPRT" USING SP-RET-CODE, SP-AREA.
      *    IF SP-RET-CODE = "NF"
      *        MOVE 99                   TO  SP-SPOOL-NO (1).
      *
      *    MOVE SP-SPOOL-NO (1)          TO  SPOOL-PRT.
      *
           OPEN OUTPUT ONLINE-PRT.

           MOVE USERNAME                 TO  PRT-USER.
           MOVE ACCTNAME                 TO  PRT-ACCOUNT.
           MOVE TNUM                     TO  PRT-TERMINAL.
           MOVE DATE-SLASH-OUT           TO  PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
           MOVE BU-PGM-NAME              TO  PRT-PGM-NAME.
           MOVE PASSED-MSG               TO  PRT-PASSED-MSG.
           MOVE COND-WORD                TO  PRT-COND-WORD.
           MOVE FILE-STATUS              TO  PRT-FILE-STATUS.
           MOVE VIEW-STATUS              TO  PRT-VIEW-STATUS.

      *------ FIRST THE HEADERS.
           WRITE PRINT-RCD FROM HDR-AST-1 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-1 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-2 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-2 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-3 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-2 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-2 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-1 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-AST-1 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-4     AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM HDR-5     AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-6     AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-7     AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM HDR-8     AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR-9     AFTER ADVANCING 1.

      *------ NOW THE INFORMATION ABOUT THE BLOWUP.
           WRITE PRINT-RCD FROM USER-LINE         AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM TERMINAL-LINE     AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM DATE-TIME-LINE    AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM PRT-PGM-NAME-LINE AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM PRT-MSG-LINE      AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM PRT-COND-LINE     AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM FILE-STATUS-LINE  AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM PRT-VIEW-LINE     AFTER ADVANCING 2.

           MOVE 0                        TO  SUB.
           PERFORM 5 TIMES
               ADD 1                     TO  SUB
               IF DISPLAY-FLD (SUB) = SPACES OR "00000000000000"
                   CONTINUE
               ELSE
                   MOVE DISPLAY-FLD (SUB) TO PRT-DISPLAY-FLD
                   MOVE SUB              TO  PRT-DISPLAY-FLD-NO
                   WRITE PRINT-RCD FROM PRT-DISPLAY-FLD-LINE
                      AFTER ADVANCING 2
               END-IF
           END-PERFORM.

           MOVE 0                        TO  SUB.
           PERFORM 5 TIMES
               ADD 1                     TO  SUB
               IF DISPLAY-FLD9 (SUB) NOT = ZERO
                   MOVE DISPLAY-FLD9 (SUB) TO PRT-DISPLAY-FLD
                   MOVE SUB              TO  PRT-DISPLAY-FLD-NO
                   WRITE PRINT-RCD FROM PRT-DISPLAY-FLD-LINE
                      AFTER ADVANCING 2
               END-IF
           END-PERFORM.

           CLOSE ONLINE-PRT.

      *------ IF WE ARE A BATCH JOB, DISPLAY TO THE STDLIST.
           IF MOD = 8
            DISPLAY HDR-AST-1
            DISPLAY HDR-AST-1
            DISPLAY HDR-AST-2
            DISPLAY HDR-AST-2
            DISPLAY HDR-AST-3
            DISPLAY HDR-AST-2
            DISPLAY HDR-AST-2
            DISPLAY HDR-AST-1
            DISPLAY HDR-AST-1
            DISPLAY HDR-4
            DISPLAY HDR-5
            DISPLAY HDR-6
            DISPLAY HDR-7
            DISPLAY HDR-8
            DISPLAY HDR-9
            DISPLAY USER-LINE
            DISPLAY TERMINAL-LINE
            DISPLAY DATE-TIME-LINE
            DISPLAY PRT-PGM-NAME-LINE
            DISPLAY PRT-MSG-LINE
            DISPLAY PRT-COND-LINE
            DISPLAY FILE-STATUS-LINE
            DISPLAY PRT-VIEW-LINE
            MOVE 0                       TO  SUB
            PERFORM 5 TIMES
                ADD 1                    TO  SUB
                IF DISPLAY-FLD (SUB) = SPACES OR "00000000000000"
                    CONTINUE
                ELSE
                    MOVE DISPLAY-FLD (SUB) TO PRT-DISPLAY-FLD
                    MOVE SUB             TO  PRT-DISPLAY-FLD-NO
                    DISPLAY PRT-DISPLAY-FLD-LINE
                END-IF
            END-PERFORM
            MOVE 0                       TO  SUB
            PERFORM 5 TIMES
                ADD 1                    TO  SUB
                IF DISPLAY-FLD9 (SUB) NOT = ZERO
                    MOVE DISPLAY-FLD (SUB) TO PRT-DISPLAY-FLD
                    MOVE SUB             TO  PRT-DISPLAY-FLD-NO
                    DISPLAY PRT-DISPLAY-FLD-LINE
                END-IF
            END-PERFORM.

       9190-PB-X.
           EXIT.

       9954-SETERROR.
           MOVE B"1"                     TO  IND (99).
           MOVE B"1"                     TO  IND (FIELD-NUMBER).

       COPY HCATREAD IN COPYLIB.
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
