000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TBTDLREQ.
000600*REMARKS.
000700*C    THIS PROGRAM DELETES ALL REQUISITIONS IN PURCHASING THAT ARE
000800*C    GREATER THAN 60 DAYS OLD AND NOT LINKED TO AN ACTIVE WORK
      *C    WORK ORDER.
      *C
      *C    05/29/2002    CA YODER
      *C      INSTEAD OF DELETING REQS OLDER THAN 60 DAYS, CHANGED
      *C      PROGRAM TO READ MPLTINFO TO GET THE NUMBER OF DAYS
      *C      THE PLANT WANTS TO USE.  IF NONE IS SPECIFIED,
      *C      DEFAULT TO 60 DAYS.
      *C
      *C    04/09/2003    CA YODER   DANVILLE REQUEST
      *C      CHANGED PROGRAM TO LOOK AT FINAL APPROVAL DATE RATHER
      *C      THAN REQUISITION DATE.  THIS WILL PREVENT A SITUATION
      *C      WHERE AN OLD REQ IS APPROVED AND THEN DELETED BEFORE
      *C      PURCHASING HAS A CHANCE TO ACT ON THE REQ.
      *C
      *C      ALSO ADDED LOGIC TO SKIP REQS THAT ARE LINKED TO A
      *C      QUOTE.
      *C

001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  IBM-AS400.
001600 OBJECT-COMPUTER.  IBM-AS400.
       COPY SPECIALN OF COPYLIB.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
002300     SELECT REQ-FILE
               ASSIGN TO DATABASE-DREQFIL
               ORGANIZATION IS SEQUENTIAL.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQDESC
               ASSIGN TO DATABASE-MCFLCS2301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-BASIC
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

002500 DATA DIVISION.
002600 FILE SECTION.
002800 FD  REQ-FILE
002900     LABEL RECORDS ARE OMITTED
003000     RECORD CONTAINS 12  CHARACTERS.
003100 01  REQ-RCD.
003200     05  REQ-NUMBER        PIC X(12).

       SD  SORT-FILE
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-REQ-NUMBER   PIC X(12).

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  DREQQUE
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE           PIC X(132).

       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  WO-BASIC-REC.
           COPY DDS-MCRPMM1000  OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-MCRPMM1100  OF MCFLMM1101.

003500 WORKING-STORAGE SECTION.
003600 77  DELETED-REQS-CTR      PIC 9(5) VALUE 0.
       77  LINE-CTR              PIC 99   VALUE 59.
003700 77  REQS-TO-DELETE-CTR    PIC 9(5) VALUE 0.
       77  WO-ACTIVE-SW          PIC 9    VALUE 0.
       77  NUM-DAYS              PIC 9(3) VALUE 0.
003800
       01  60DA-CHECK.
           05  CC-60DA.
               10  CC-60DA-9     PIC 99.
           05  YY-60DA.
               10  YY-60DA-9     PIC 99.
           05  MM-60DA.
               10  MM-60DA-9     PIC 99.
           05  DD-60DA.
               10  DD-60DA-9     PIC 99.

022300 COPY CCRTFILE IN COPYLIB.

       01  CDATE-CCYYMMDD.
           05  CDATE-CC          PIC 99.
           05  CDATE.
               10 CDATE-YY       PIC 99.
               10 CDATE-MM       PIC 99.
               10 CDATE-DD       PIC 99.

       01  FILE-STATUS.
           05  FILE-STATUS-1     PIC X.
           05  FILE-STATUS-2     PIC X.

       01  DETAIL-1.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  D-REQ             PIC X(12) VALUE SPACES.
           05  FILLER            PIC X(63) VALUE SPACES.

       01  GDATE.
           05 GYY                PIC 99.
           05 GMM                PIC 99.
           05 GDD                PIC 99.

       01  HEADER-0.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  FILLER            PIC X(29)
               VALUE "REQUISITIONS DELETED FROM THE".
           05  FILLER            PIC X(33)
               VALUE "SYSTEM ".
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  H0-DATE.
               10  H0-MM         PIC XX    VALUE SPACES.
               10  FILLER        PIC X     VALUE "/".
               10  H0-DD         PIC XX    VALUE SPACES.
               10  FILLER        PIC X     VALUE "/".
               10  H0-YY         PIC XX    VALUE SPACES.

       01  HEADER-U.
           05  FILLER            PIC X(80) VALUE ALL "-".

       01  INPUT-DATE-CN.
           05  INPUT-DATE-CC     PIC X(2).
           05  INPUT-DATE.
               10  INPUT-DATE-YY PIC X(2).
               10  FILLER        PIC X(4).

       COPY IOFEEDBACK IN COPYLIB.

      *--------- PARAMETERS FOR "JULGREG" ROUTINE.
       01  JULGREG-PARMS.
           05  GREG-DATE.
               10  GREG-CC       PIC X(2).
               10  GREG-YMD.
                   15  GREG-YY   PIC X(2).
                   15  GREG-MM   PIC X(2).
                   15  GREG-DD   PIC X(2).
           05  GREG-DATE-RD REDEFINES GREG-DATE.
               10  GREG-CCYY     PIC X(4).
               10  GREG-MMDD     PIC X(4).
           05  JULIAN-DATE.
               10  JUL-CCYY      PIC 9(4).
               10  JUL-DDD       PIC 9(3).
           05  DAY-DIGIT         PIC X.
           05  LEAP-YEAR-FLAG    PIC X.

       01  JDATE.
           05 JYY                PIC 99.
           05 JDDD               PIC 999.

       01  JUL-DIFF              PIC 999.

       COPY OVRPFDATA  IN COPYLIB.

003900**************************************************************
004000**************************************************************
004100**                                                          **
004200**                DATABASE I/O BUFFER AREA                  **
004300**                                                          **
004400**************************************************************
004500**************************************************************
004600
       COPY MPLT0    IN COPYLIB.
       COPY MPLTPREQ IN COPYLIB.

004700 COPY MREQ     IN COPYLIB.
004800
004900 COPY DREQD    IN COPYLIB.
005000
005100 COPY DREQITM  IN COPYLIB.
005200
005300 COPY DREQDESC IN COPYLIB.
005400
005500 COPY DREQQUE  IN COPYLIB.
005600
       01  WO-BASIC-DATA.             COPY DWOBASIC IN COPYLIB.

       01  WO-PLANNED-DATA.           COPY DWOPLAN  IN COPYLIB.

005700 COPY DATAB    IN COPYLIB.
005800
005900
006000*********************
006100*                   *
006200*   DATA SET NAMES  *
006300*                   *
006400*********************
006500
006600 01  DSET-NAMES.
006700     05  DSET-NAME              PIC X(16)  VALUE SPACES.
006800     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
006900     05  DSET-DREQITM           PIC X(16)  VALUE "DREQITM;".
007000     05  DSET-DREQD             PIC X(16)  VALUE "DREQD;".
007100     05  DSET-DREQDESC          PIC X(16)  VALUE "DREQDESC;".
007200     05  DSET-DREQQUE           PIC X(16)  VALUE "DREQQUE;".
007300
007400 01 ITEMS-LISTING.
007500     05  ALL-ITEMS              PIC XX    VALUE "@;".
007600     05  REQ-SEARCH             PIC X(11) VALUE "REQ-NUMBER;".
007700
007800 01 ARG-VALUES.
007900     05  REQ-ARG                PIC X(12) VALUE SPACES.
008000
008100 COPY MULTLOCK  IN COPYLIB.
008200
008300 01  ANSWER-SW PIC X  VALUE "N".
008400
008500 COPY TBLOWUP   IN COPYLIB.
008700
008800 PROCEDURE DIVISION.
008900 BEGIN-HERE.
009000     PERFORM 1-HSK THRU 1-H-X.
009100     PERFORM 6-MAIN  THRU 6-M-X.
009200
009300 2-EOJ.
           CLOSE MREQ, DREQD, DREQITM, DREQDESC, DREQQUE.
           CLOSE WO-BASIC, WO-PLANNED, MPLTINFO.
           CLOSE ONLINE-PRT.
009800     GOBACK.
009900
010000 1-HSK.
           OPEN I-O    MREQ.
           OPEN I-O    DREQD.
           OPEN I-O    DREQITM.
           OPEN I-O    DREQDESC.
           OPEN I-O    DREQQUE.
           OPEN INPUT  WO-BASIC.
           OPEN INPUT  WO-PLANNED.
           OPEN INPUT  MPLTINFO.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           ACCEPT CDATE        FROM DATE.
           MOVE CDATE-MM       TO H0-MM.
           MOVE CDATE-DD       TO H0-DD.
           MOVE CDATE-DD       TO H0-YY.
           IF CDATE-YY > 70
               MOVE 19         TO CDATE-CC
           ELSE
           MOVE 20             TO CDATE-CC.
           MOVE 59 TO LINE-CTR.

           MOVE 60             TO NUM-DAYS.
           MOVE "PREQ" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MPLTINFO-TBTDLREQ-DAY NUMERIC
                   IF MPLTINFO-TBTDLREQ-DAY > 0
                        MOVE MPLTINFO-TBTDLREQ-DAY TO NUM-DAYS.

           MOVE SPACES         TO JULGREG-PARMS.
           MOVE CDATE-CCYYMMDD  TO GREG-DATE.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           IF JUL-DDD > 365
              SUBTRACT 365     FROM JUL-DDD
              ADD 1            TO   JUL-CCYY
           ELSE
      *****IF JUL-DDD > 60
           IF JUL-DDD > NUM-DAYS
      ********SUBTRACT 60      FROM JUL-DDD
              SUBTRACT NUM-DAYS   FROM JUL-DDD
           ELSE
      *****SUBTRACT JUL-DDD    FROM 60 GIVING JUL-DIFF
           SUBTRACT JUL-DDD    FROM NUM-DAYS GIVING JUL-DIFF
           MOVE 365            TO   JUL-DDD
           SUBTRACT JUL-DIFF   FROM 365 GIVING JUL-DDD
           SUBTRACT 1          FROM JUL-CCYY.

           MOVE SPACES TO GREG-DATE, DAY-DIGIT, LEAP-YEAR-FLAG.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.

           MOVE GREG-CC        TO CC-60DA.
           MOVE GREG-YY        TO YY-60DA.
           MOVE GREG-MM        TO MM-60DA.
           MOVE GREG-DD        TO DD-60DA.

      *****DISPLAY "60DA-CHECK = " 60DA-CHECK.
           DISPLAY "DELETE REQS > " NUM-DAYS " OLD".
           DISPLAY "DELETE DATE = " 60DA-CHECK.
010500 1-H-X.
010600     EXIT.
010700
010800*********************************************
010900*                                           *
011000*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
011100*  FATAL ERROR OCCURS                       *
011200*                                           *
011300*********************************************
011400
011500 2-BLOWUP.
011600     MOVE "TBTDLREQ"  TO  BU-PGM-NAME.
011700     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
011800         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
011900                 BU-DISPLAY-FLDS.
012000
012100 6-MAIN.
      ***************************************************************
      **   CREATE TEMPORARY FILE ('DREQFIL') TO CONTAIN ALL REQS  ' *
      **   IN THE DATABASE THAT ARE NOT ASSIGNED TO A PURCHASE      *
      **   ORDER.                                                   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "DREQFIL"     TO CCRTFILE-FILE.
           MOVE "0012"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "10000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DREQFIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

012200     OPEN OUTPUT REQ-FILE.
012300     PERFORM 61-GET-REQS-TO-DELETE  THRU  61-GRTD-X.
012400     CLOSE REQ-FILE.

           IF REQS-TO-DELETE-CTR > 0
               SORT SORT-FILE ON ASCENDING SORT-REQ-NUMBER
                   USING REQ-FILE
                   GIVING REQ-FILE.
013400
013500     OPEN INPUT REQ-FILE.
013600     PERFORM 62-DELETE-REQ  THRU  62-DR-X.
013700     CLOSE REQ-FILE.
013800
013900 6-M-X.
014000     EXIT.
014100
014200*************************************************
014300*                                               *
014400*   SERIAL GET OF MREQ (MODE2)                  *
014500*                                               *
014600*************************************************
014700
014800 61-GET-REQS-TO-DELETE.
           MOVE 0 TO COND-WORD.
           READ MREQ NEXT INTO BUF-MREQ
               AT END MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
015100     IF COND-WORD NOT = 0
015200         IF COND-WORD = 11
015300             GO TO 61-GRTD-X
015400         ELSE
015500         MOVE MREQ-NUMBER  TO  BU-DISPLAY-FLD (1)
015600         MOVE "DBGET 61-GRTD"  TO  BU-DISPLAY-MSG
015700         GO TO 2-BLOWUP.
015800
015900**************************************************
016000*                                                *
016100*   CHECK TO SEE IF REQ. HAS BEEN RELEASED BY    *
016200*   MATCONT IF SO CHECK TO SEE IF REQ. HAS BEEN  *
016300*   PROCESSED (P.O.) BY PURCHASING               *
016400*                                                *
016500**************************************************
016600
016700     IF REQ-PURCH-RELEASE  =  "X"
016800         GO TO 61-GET-REQS-TO-DELETE.
016900
           IF REQ-MATCONT-RELEASE = "X"
               NEXT SENTENCE
           ELSE
           GO TO 61-GET-REQS-TO-DELETE.

      *----------- DON'T DELETE REQ IF IT'S LINKED TO A QUOTE.
           IF REQ-HOLD-STATUS-CODE = "QU"
               GO TO 61-GET-REQS-TO-DELETE.

      *----------- USE LAST APPROVAL DATE INSTEAD OF REQ DATE.  IN
      *----------- CEAAPPRV, THE REL-MC DATE IS SET WHEN THE FINAL
      *----------- APPROVER APPROVES THE REQ.
      *****IF REQ-DATE-CN < 60DA-CHECK
           IF REQ-REL-MC-DATE-CN < 60DA-CHECK
017100         NEXT SENTENCE
017200     ELSE
017300     GO TO 61-GET-REQS-TO-DELETE.
017400
017500     MOVE MREQ-NUMBER  TO  REQ-NUMBER
017600     ADD 1 TO REQS-TO-DELETE-CTR.
017700     WRITE REQ-RCD.
017800     GO TO 61-GET-REQS-TO-DELETE.
017900
018000 61-GRTD-X.
018100     EXIT.
018200
018300 62-DELETE-REQ.
018400     READ REQ-FILE  AT END
018500         DISPLAY DELETED-REQS-CTR " REQS WERE DELETED"
018600         GO TO 62-DR-X.
018700     MOVE REQ-NUMBER          TO  REQ-ARG, BU-DISPLAY-FLD (1).
018800
           MOVE REQ-ARG TO REQNO OF MREQ-REC.
           READ MREQ INTO BUF-MREQ.
           IF FILE-STATUS NOT = "00"
021100         MOVE "GET MREQ 62-LRS" TO BU-DISPLAY-MSG
021200         GO TO 2-BLOWUP.
021300
       62-DELETE-DREQD-SEGS.
           MOVE 0       TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC.
           START DREQD KEY = REQNO OF DREQD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
021600     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQITM-SEGS
               ELSE
021700         MOVE "DELETE DREQD SEGS" TO BU-DISPLAY-MSG
021800         GO TO 2-BLOWUP.
021900
022000     PERFORM 620-DELETE-DREQD  THRU  620-DD-X
022100         UNTIL COND-WORD = 15.

           IF WO-ACTIVE-SW = 1
               MOVE 0 TO WO-ACTIVE-SW
               GO TO 62-DELETE-REQ.
022200
       62-DELETE-DREQITM-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC.
           START DREQITM KEY = REQNO OF DREQITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
022500     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQDESC-SEGS
               ELSE
022600         MOVE "DELETE DREQITM SEGS" TO BU-DISPLAY-MSG
022700         GO TO 2-BLOWUP.
022800
022900     PERFORM 621-DELETE-DREQITM THRU 621-DD-X
023000         UNTIL COND-WORD = 15.
023100
       62-DELETE-DREQDESC-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
023400     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQQUE-SEGS
               ELSE
023500         MOVE "DELETE DREQDESC SEGS" TO BU-DISPLAY-MSG
023600         GO TO 2-BLOWUP.
023700
023800     PERFORM 622-DELETE-DREQDESC  THRU  622-DD-X
023900         UNTIL COND-WORD = 15.
024000
       62-DELETE-DREQQUE-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQQUE-REC.
           START DREQQUE KEY = REQNO OF DREQQUE-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
024300     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-MREQ
               ELSE
024400         MOVE "DELETE DREQQUE SEGS" TO BU-DISPLAY-MSG
024500         GO TO 2-BLOWUP.
024600
024700     PERFORM 623-DELETE-DREQQUE THRU 623-DD-X
024800         UNTIL COND-WORD = 15.
024900
       62-DELETE-MREQ.
           DELETE MREQ
025200     IF FILE-STATUS NOT = "00"
025300         MOVE "DELETE MREQ SEGS" TO BU-DISPLAY-MSG
025400         GO TO 2-BLOWUP.
025500     ADD 1 TO DELETED-REQS-CTR.
           MOVE REQ-ARG TO D-REQ.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1 LINES
               WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1 LINES
               MOVE 3 TO LINE-CTR
           ELSE
           WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1 LINES.
026400     GO TO 62-DELETE-REQ.
026500
026600 62-DR-X.     EXIT.
026700
026800 620-DELETE-DREQD.
           MOVE 0 TO COND-WORD.
           READ DREQD NEXT INTO BUF-DREQD
               AT END    MOVE 15 TO COND-WORD.
026900     IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DREQD-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
027100     IF COND-WORD NOT = 0
027200         IF COND-WORD = 15
027300             NEXT SENTENCE
027400         ELSE
027500             MOVE "GET DREQD 620-DD" TO BU-DISPLAY-MSG
027600             GO TO 2-BLOWUP
027700     ELSE
           IF DREQD-WO-NUMBER NOT = "          "
               MOVE 0 TO WO-ACTIVE-SW
               PERFORM 6200-CHECK-WO-ACTIVE THRU 6200-CWA-X
               IF WO-ACTIVE-SW = 1
                   NEXT SENTENCE
      *            DISPLAY "REQ " REQ-ARG " NOT DELETED AS WO "
      *                DREQD-WO-NUMBER " IS STILL ACTIVE"
               ELSE
               DELETE DREQD
028000         IF FILE-STATUS NOT = "00"
028100             MOVE "DELETE DREQD1" TO BU-DISPLAY-MSG
028200             GO TO 2-BLOWUP
               ELSE
               NEXT SENTENCE
           ELSE
           DELETE DREQD
028000     IF FILE-STATUS NOT = "00"
028100         MOVE "DELETE DREQD2" TO BU-DISPLAY-MSG
028200         GO TO 2-BLOWUP.
028300
028400 620-DD-X.    EXIT.
028500
       6200-CHECK-WO-ACTIVE.
           MOVE DREQD-WO-NUMBER TO WONUM OF WO-BASIC-REC.
           READ WO-BASIC INTO WO-BASIC-DATA
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE 1 TO WO-ACTIVE-SW
               GO TO 6200-CWA-X.
           MOVE DREQD-WO-NUMBER TO WONUM OF WO-PLANNED-REC.
           READ WO-PLANNED INTO WO-PLANNED-DATA
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE 1 TO WO-ACTIVE-SW.
       6200-CWA-X.    EXIT.

028600 621-DELETE-DREQITM.
           MOVE 0 TO COND-WORD.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQITM-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
028900     IF COND-WORD NOT = 0
029000         IF COND-WORD = 15
029100             NEXT SENTENCE
029200         ELSE
029300             MOVE "GET DREQITM 621-DD" TO BU-DISPLAY-MSG
029400             GO TO 2-BLOWUP
029500     ELSE
           DELETE DREQITM
029800     IF FILE-STATUS NOT = "00"
029900         MOVE "DELETE DREQITM" TO BU-DISPLAY-MSG
030000         GO TO 2-BLOWUP.
030100 621-DD-X.    EXIT.
030200
030300 622-DELETE-DREQDESC.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQDESC-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
030600     IF COND-WORD NOT = 0
030700         IF COND-WORD = 15
030800             NEXT SENTENCE
030900         ELSE
031000             MOVE "GET DREQDESC 622-DD" TO BU-DISPLAY-MSG
031100             GO TO 2-BLOWUP
031200     ELSE
           DELETE DREQDESC
031500     IF FILE-STATUS NOT = "00"
031600         MOVE "DELETE DREQDESC" TO BU-DISPLAY-MSG
031700         GO TO 2-BLOWUP.
031800 622-DD-X.    EXIT.
031900
032000 623-DELETE-DREQQUE.
           MOVE 0 TO COND-WORD.
           READ DREQQUE NEXT INTO BUF-DREQQUE
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DRQQ-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
032300     IF COND-WORD NOT = 0
032400         IF COND-WORD = 15
032500             NEXT SENTENCE
032600         ELSE
032700             MOVE "GET DREQQUE 623-DD" TO BU-DISPLAY-MSG
032800             GO TO 2-BLOWUP
032900     ELSE
           DELETE DREQQUE
033200     IF FILE-STATUS NOT = "00"
033300         MOVE "DELETE DREQQUE" TO BU-DISPLAY-MSG
033400         GO TO 2-BLOWUP.
033500 623-DD-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.
