000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TCALCEXP.
000400 AUTHOR.              KURT MOVSESIAN.
000500 DATE-WRITTEN.        FEB 13,1984.
      *C
      *C  03/14/94       JS BUNGO
      *C     ADDED CALL TO ESTABLISH THE COBOL ERROR HANDLER FOR
      *C     THIS PROGRAM.
      *C
      *C  09/16/1996     CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C

001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  HP-3000.
002200 OBJECT-COMPUTER.  HP-3000.
002300 SPECIAL-NAMES. C01 IS NEWPAGE.
002500
002600 INPUT-OUTPUT SECTION.
002700 FILE-CONTROL.
002800     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
002900     SELECT SORT-FILE  ASSIGN TO DISK-SORT.
003000
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-I
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

003100 DATA DIVISION.
003200 FILE SECTION.
003300
003400 FD  ONLINE-PRT
003500     LABEL RECORDS ARE OMITTED
003600     RECORD CONTAINS 132 CHARACTERS
003700     DATA RECORD IS PRINT-RCD.
003800 01  PRINT-RCD.
003900     05  PRINT-LINE             PIC X(132).
004000
004100 SD  SORT-FILE
004200     RECORD CONTAINS 82 CHARACTERS.
004300 01  SORT-RCD.
004400     05  SORT-CODE               PIC X(8).
004500     05  SORT-UM                 PIC XX.
004600     05  SORT-MAX                PIC 9(8).
004700     05  SORT-REORDER            PIC 9(8).
004800     05  SORT-EXPEDITE           PIC 9(8).
004900     05  SORT-DAILY-USAGE        PIC 9(8)V9(4).
005000     05  SORT-LEAD-TIME          PIC 9(4).
005100     05  SORT-EXPEDITE-95-AVAIL  PIC 9(8).
005200     05  SORT-REORDER-95-AVAIL   PIC 9(8).
005300     05  SORT-EXPEDITE-99-AVAIL  PIC 9(8).
005400     05  SORT-REORDER-99-AVAIL   PIC 9(8).
005500
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

005600 WORKING-STORAGE SECTION.
005800 77  EOF-SW                     PIC X      VALUE "N".
005900 77  SUB                        PIC S9(4)  COMP-4 VALUE ZEROS.
006000 77  PAGE-CTR                   PIC 9(4)   COMP-4 VALUE ZEROS.
006100 77  LINE-CTR                   PIC 9(4)   COMP-4 VALUE ZEROS.
006200 77  LINE-ADV                   PIC 9(4)   COMP-4 VALUE ZEROS.
006300 77  SAVE-PRINT-LINE            PIC X(132) VALUE SPACES.
006400 77  YEAR-TOTAL                 PIC 9(8)  COMP-4 VALUE ZEROS.
006500 77  LEAD-TIME                  PIC 9(4)  COMP-4 VALUE ZEROS.
006600 77  DAILY-USAGE                PIC 9(8)V9(4) COMP-4 VALUE ZEROS.
006700 77  LEAD-TIME-USAGE            PIC 9(8)V9(4) COMP-4 VALUE ZEROS.
006800 77  SQ-LT-USAGE                PIC 9(8)V9(4) COMP-4 VALUE ZEROS.
006900 77  EXPEDITE-95-AVAIL          PIC 9(8) COMP-4 VALUE ZEROS.
007000 77  REORDER-95-AVAIL           PIC 9(8) COMP-4 VALUE ZEROS.
007100 77  EXPEDITE-99-AVAIL          PIC 9(8) COMP-4 VALUE ZEROS.
007200 77  REORDER-99-AVAIL           PIC 9(8) COMP-4 VALUE ZEROS.
007300 77  REORDER-150-PCT            PIC 9(8) COMP-4 VALUE ZEROS.
007400 77  REORDER-50-PCT             PIC 9(8) COMP-4 VALUE ZEROS.
007500
       01  MCXCBLERR-SCOPE               PIC X     VALUE "C".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
007600
007700
007800**************************************************************
007900**                                                          **
008000**               K S A M   W O R K                          **
008100**                                                          **
008200**************************************************************
008300
008400 01  KEY-VALUE                     PIC X(8)  VALUE SPACES.
008500 01  KEY-LOC                       PIC S9(4) COMP-4 VALUE 3.
008600 01  RECSIZE                       PIC S9(4) COMP-4 VALUE 66.
008700 01  RESULT                        PIC 9(4)  VALUE ZEROS.
008800
008900 01  USAGE-REC.
009000     05  FILLER                   PIC XX.
009100     05  K-CORP-CODE              PIC X(8).
009200     05  K-MONTHS                 OCCURS 14 TIMES.
009300         10  K-MTH-USAGE          PIC S9(9) COMP-4.
009200     05  K-MONTHS-DD              OCCURS 14 TIMES.
009300         10  K-MTH-USAGE-DD       PIC S9(9) COMP-4.
009400
009500 01  FILETABLE.
009600     05  FILENUMBER               PIC S9(4) COMP-4 VALUE 0.
009700     05  FILENAME                 PIC X(8)  VALUE "USAGEFIL".
009800     05  I-O-TYPE                 PIC S9(4) COMP-4 VALUE 0.
009900     05  A-MODE                   PIC S9(4) COMP-4 VALUE 1.
010000     05  PREV-OP                  PIC S9(4) COMP-4 VALUE 0.
010100
010200 01  KSAM-STATUS.
010300     05  K-STAT-1                 PIC X.
010400     05  FILLER                   PIC X.
010600
010700 01  ITEM-LISTINGS.
010800     05  ALL-ITEMS              PIC XX     VALUE "@;".
010900     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
011000
011100
011200*************************
011300*                       *
011400*   ARG VALUES          *
011500*                       *
011600*************************
011700
011800 01  ARG-VALUES.
011900     05  CODE-ARG                  PIC X(8)  VALUE SPACES.
012000     05  PLT-ARG                   PIC X(4)  VALUE SPACES.
012100
012200*********************
012300*                   *
012400*   DATA SET NAMES  *
012500*                   *
012600*********************
012700
012800 01  DSET-NAMES.
012900     05  DSET-NAME              PIC X(16)  VALUE SPACES.
013000     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
013100     05  DSET-DDESC             PIC X(16)  VALUE "DDESC;".
013200     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
013300
013400 COPY DATAB IN COPYLIB.
013500
013600 COPY MSTORERM IN COPYLIB.
013700
013800 COPY DDESC IN COPYLIB.
013900
014000 COPY MPLTINFO IN COPYLIB.
014100
014200*****************
014300*               *
014400* HEADER PAGE   *
014500*               *
014600*****************
014700
014800 01  ALL-ASTERISKS.
014900     05  FILLER  PIC X(26)  VALUE SPACES.
015000     05  FILLER  PIC X(80)  VALUE ALL "*".
015100     05  FILLER  PIC X(26)  VALUE SPACES.
015200
015300 01  PART-ASTERISKS.
015400     05  FILLER  PIC X(26)  VALUE SPACES.
015500     05  FILLER  PIC X(3)   VALUE "***".
015600     05  FILLER  PIC X(74)  VALUE SPACES.
015700     05  FILLER  PIC X(3)   VALUE "***".
015800     05  FILLER  PIC X(26)  VALUE SPACES.
015900
016000 01  HEADER-PG-LINE-1.
016100     05  FILLER  PIC X(26)  VALUE SPACES.
016200     05  FILLER  PIC X(3)   VALUE "***".
016300     05  FILLER  PIC X(19)  VALUE SPACES.
016400     05  FILLER  PIC X(13)  VALUE "R30  OVERAGE ".
016500     05  FILLER  PIC X(19)  VALUE "MATERIAL PROJECTION".
016600     05  FILLER  PIC X(23)  VALUE SPACES.
016700     05  FILLER  PIC X(3)   VALUE "***".
016800     05  FILLER  PIC X(26)  VALUE SPACES.
016900
017000 01  HEADER-PG-LINE-2.
017100     05  FILLER  PIC X(26)  VALUE SPACES.
017200     05  FILLER  PIC X(3)   VALUE "***".
017300     05  FILLER  PIC X(8)   VALUE SPACES.
017400     05  FILLER  PIC X(18)  VALUE "THIS REPORT GIVES ".
017500     05  FILLER  PIC X(23)  VALUE "INFORMATION FOR STORES ".
017600     05  FILLER  PIC X(17)  VALUE "ITEMS WHICH HAVE ".
017700     05  FILLER  PIC X(8)   VALUE SPACES.
017800     05  FILLER  PIC X(3)   VALUE "***".
017900     05  FILLER  PIC X(26)  VALUE SPACES.
018000
018100 01  HEADER-PG-LINE-3.
018200     05  FILLER  PIC X(26)  VALUE SPACES.
018300     05  FILLER  PIC X(3)   VALUE "***".
018400     05  FILLER  PIC X(8)  VALUE SPACES.
018500     05  FILLER  PIC X(24)  VALUE "AN ONHAND QUANTITY THAT ".
018600     05  FILLER  PIC X(16)  VALUE "EXCEEDS ITS MAXI".
018700     05  FILLER  PIC X(18)  VALUE "MUM QUANTITY.  THE".
018800      05  FILLER  PIC X(8) VALUE SPACES.
018900     05  FILLER  PIC X(3)   VALUE "***".
019000     05  FILLER  PIC X(26)  VALUE SPACES.
019100
019200
019300 01  HEADER-PG-LINE-3A.
019400     05  FILLER  PIC X(26)  VALUE SPACES.
019500     05  FILLER  PIC X(3)   VALUE "***".
019600     05  FILLER  PIC X(8)   VALUE SPACES.
019700     05  FILLER  PIC X(18)  VALUE "USER MAY REQUEST A".
019800     05  FILLER  PIC X(23)  VALUE " REPORT OF HIS CURRENT ".
019900     05  FILLER  PIC X(17)  VALUE "OVERAGE, OR HE   ".
020000     05  FILLER  PIC X(8)   VALUE SPACES.
020100     05  FILLER  PIC X(3)   VALUE "***".
020200     05  FILLER  PIC X(26)  VALUE SPACES.
020300
020400
020500 01  HEADER-PG-LINE-3B.
020600     05  FILLER  PIC X(26)  VALUE SPACES.
020700     05  FILLER  PIC X(3)   VALUE "***".
020800     05  FILLER  PIC X(8)   VALUE SPACES.
020900     05  FILLER  PIC X(18)  VALUE "MAY WISH TO PROJEC".
021000     05  FILLER  PIC X(23)  VALUE "T WHAT HIS OVERAGE WILL".
021100     05  FILLER  PIC X(18)  VALUE " BE AT A FUTURE   ".
021200     05  FILLER  PIC X(7)   VALUE SPACES.
021300     05  FILLER  PIC X(3)   VALUE "***".
021400     05  FILLER  PIC X(26)  VALUE SPACES.
021500
021600
021700 01  HEADER-PG-LINE-3C.
021800     05  FILLER  PIC X(26)  VALUE SPACES.
021900     05  FILLER  PIC X(3)   VALUE "***".
022000     05  FILLER  PIC X(8)   VALUE SPACES.
022100     05  FILLER  PIC X(18)  VALUE "TIME.             ".
022200     05  FILLER  PIC X(23)  VALUE "                       ".
022300     05  FILLER  PIC X(18)  VALUE "                  ".
022400     05  FILLER  PIC X(7)   VALUE SPACES.
022500     05  FILLER  PIC X(3)   VALUE "***".
022600     05  FILLER  PIC X(26)  VALUE SPACES.
022700
022800
022900 01  HEADER-PG-LINE-3D.
023000     05  FILLER  PIC X(26)  VALUE SPACES.
023100     05  FILLER  PIC X(3)   VALUE "***".
023200     05  FILLER  PIC X(8)   VALUE SPACES.
023300     05  FILLER  PIC X(18)  VALUE "BY ENTERING R30 FR".
023400     05  FILLER  PIC X(23)  VALUE "OM THE REPORT MENU THE ".
023500     05  FILLER  PIC X(18)  VALUE "THE USER CAN      ".
023600     05  FILLER  PIC X(7)   VALUE SPACES.
023700     05  FILLER  PIC X(3)   VALUE "***".
023800     05  FILLER  PIC X(26)  VALUE SPACES.
023900
024000
024100 01  HEADER-PG-LINE-3E.
024200     05  FILLER  PIC X(26)  VALUE SPACES.
024300     05  FILLER  PIC X(3)   VALUE "***".
024400     05  FILLER  PIC X(8)   VALUE SPACES.
024500     05  FILLER  PIC X(18)  VALUE "REQUEST THE NUMBER".
024600     05  FILLER  PIC X(23)  VALUE " OF MONTHS IN THE FUTUR".
024700     05  FILLER  PIC X(18)  VALUE "E FOR WHICH HE   ".
024800     05  FILLER  PIC X(7)   VALUE SPACES.
024900     05  FILLER  PIC X(3)   VALUE "***".
025000     05  FILLER  PIC X(26)  VALUE SPACES.
025100
025200
025300 01  HEADER-PG-LINE-3F.
025400     05  FILLER  PIC X(26)  VALUE SPACES.
025500     05  FILLER  PIC X(3)   VALUE "***".
025600     05  FILLER  PIC X(8)   VALUE SPACES.
025700     05  FILLER  PIC X(18)  VALUE "WOULD LIKE HIS OVE".
025800     05  FILLER  PIC X(23)  VALUE "RAGE PROJECTED.  ENTERI".
025900     05  FILLER  PIC X(18)  VALUE "NG ""0"" FOR THE  ".
026000     05  FILLER  PIC X(7)   VALUE SPACES.
026100     05  FILLER  PIC X(3)   VALUE "***".
026200     05  FILLER  PIC X(26)  VALUE SPACES.
026300
026400
026500 01  HEADER-PG-LINE-3G.
026600     05  FILLER  PIC X(26)  VALUE SPACES.
026700     05  FILLER  PIC X(3)   VALUE "***".
026800     05  FILLER  PIC X(8)   VALUE SPACES.
026900     05  FILLER  PIC X(18)  VALUE "NUMBER OF MONTHS W".
027000     05  FILLER  PIC X(23)  VALUE "ILL PRODUCE THE REPORT ".
027100     05  FILLER  PIC X(18)  VALUE "FOR THE USER'S    ".
027200     05  FILLER  PIC X(7)   VALUE SPACES.
027300     05  FILLER  PIC X(3)   VALUE "***".
027400     05  FILLER  PIC X(26)  VALUE SPACES.
027500
027600
027700 01  HEADER-PG-LINE-3H.
027800     05  FILLER  PIC X(26)  VALUE SPACES.
027900     05  FILLER  PIC X(3)   VALUE "***".
028000     05  FILLER  PIC X(8)   VALUE SPACES.
028100     05  FILLER  PIC X(18)  VALUE "CURRENT OVERAGE.  ".
028200     05  FILLER  PIC X(23)  VALUE "                       ".
028300     05  FILLER  PIC X(18)  VALUE "                  ".
028400     05  FILLER  PIC X(7)   VALUE SPACES.
028500     05  FILLER  PIC X(3)   VALUE "***".
028600     05  FILLER  PIC X(26)  VALUE SPACES.
028700
028800 01  HEADER-PG-LINE-4.
028900     05  FILLER  PIC X(26)  VALUE SPACES.
029000     05  FILLER  PIC X(3)   VALUE "***".
029100     05  FILLER  PIC X(8)   VALUE SPACES.
029200     05  FILLER  PIC X(15)  VALUE "PROJECTED  OVER".
029300     05  FILLER  PIC X(25)  VALUE "AGE  DEFINITIONS:        ".
029400     05  FILLER  PIC X(18)  VALUE "                  ".
029500     05  FILLER  PIC X(8)  VALUE SPACES.
029600     05  FILLER  PIC X(3)   VALUE "***".
029700     05  FILLER  PIC X(26)  VALUE SPACES.
029800
029900 01  HEADER-PG-LINE-4A.
030000     05  FILLER  PIC X(26)  VALUE SPACES.
030100     05  FILLER  PIC X(3)   VALUE "***".
030200     05  FILLER  PIC X(8)   VALUE SPACES.
030300     05  FILLER  PIC X(15)  VALUE "   PROJECTED US".
030400     05  FILLER  PIC X(25)  VALUE "AGE = AVERAGE MONTHLY ISS".
030500     05  FILLER  PIC X(18)  VALUE "UE  X  # OF MONTHS".
030600     05  FILLER  PIC X(8)  VALUE SPACES.
030700     05  FILLER  PIC X(3)   VALUE "***".
030800     05  FILLER  PIC X(26)  VALUE SPACES.
030900
031000
031100 01  HEADER-PG-LINE-4B.
031200     05  FILLER  PIC X(26)  VALUE SPACES.
031300     05  FILLER  PIC X(3)   VALUE "***".
031400     05  FILLER  PIC X(8)   VALUE SPACES.
031500     05  FILLER  PIC X(15)  VALUE "   PROJECTED OV".
031600     05  FILLER  PIC X(25)  VALUE "ERAGE = (ONHAND - PROJECT".
031700     05  FILLER  PIC X(19)  VALUE "ED USAGE) - MAXIMUM".
031800     05  FILLER  PIC X(7)  VALUE SPACES.
031900     05  FILLER  PIC X(3)   VALUE "***".
032000     05  FILLER  PIC X(26)  VALUE SPACES.
032100
032200
032300 01  HEADER-PG-LINE-4C.
032400     05  FILLER  PIC X(26)  VALUE SPACES.
032500     05  FILLER  PIC X(3)   VALUE "***".
032600     05  FILLER  PIC X(8)   VALUE SPACES.
032700     05  FILLER  PIC X(15)  VALUE "   PROJECTED OV".
032800     05  FILLER  PIC X(25)  VALUE "ERAGE COST = PROJECTED OV".
032900     05  FILLER  PIC X(20) VALUE "ERAGE X AVERAGE COST".
033000     05  FILLER  PIC X(6)  VALUE SPACES.
033100     05  FILLER  PIC X(3)   VALUE "***".
033200     05  FILLER  PIC X(26)  VALUE SPACES.
033300
033400 01  HEADER-PG-LINE-5.
033500     05  FILLER  PIC X(26)  VALUE SPACES.
033600     05  FILLER  PIC X(3)   VALUE "***".
033700     05  FILLER  PIC X(6)   VALUE SPACES.
033800     05  FILLER  PIC X(22)  VALUE "NOTE:  THIS REPORT IS ".
033900     05  FILLER  PIC X(22)  VALUE "SORTED BY CLASS, THEN ".
034000     05  FILLER  PIC X(18)  VALUE "BY CORPORATE CODE.".
034100     05  FILLER  PIC X(6)   VALUE SPACES.
034200     05  FILLER  PIC X(3)   VALUE "***".
034300     05  FILLER  PIC X(26)  VALUE SPACES.
034400
034500 01  HEADER-PG-LINE-6.
034600     05  FILLER  PIC X(26)  VALUE SPACES.
034700     05  FILLER  PIC X(3)   VALUE "***".
034800     05  FILLER  PIC X(6)   VALUE SPACES.
034900     05  FILLER  PIC X(24)  VALUE "NOTE:  THIS REPORT DOES ".
035000     05  FILLER  PIC X(24)  VALUE "NOT INCLUDE ANY OBSOLETE".
035100     05  FILLER  PIC X(7)   VALUE " ITEMS.".
035200     05  FILLER  PIC X(13)  VALUE SPACES.
035300     05  FILLER  PIC X(3)   VALUE "***".
035400     05  FILLER  PIC X(26)  VALUE SPACES.
035500
035600
035700*****************************************************
035800*                                                   *
035900*   R E P O R T    H E A D E R S  &  D E T A I L S  *
036000*                                                   *
036100*****************************************************
036200
036300
036400 01  HEADER-1.
036500     05  FILLER          PIC X(6)  VALUE " PAGE ".
036600     05  PAGE-NO-OUT     PIC ZZZ9  VALUE ZEROS.
036700     05  FILLER          PIC X(5)  VALUE SPACES.
036800     05  FILLER          PIC X(15) VALUE "E X P E D I T E".
036900     05  FILLER          PIC X(9)  VALUE "  A N D  ".
037000     05  FILLER          PIC X(15) VALUE "R E O R D E R  ".
037100     05  FILLER          PIC X(14) VALUE "C A L C U L A ".
037200     05  FILLER          PIC X(9)  VALUE "T I O N S".
037300     05  FILLER          PIC X(3)  VALUE SPACES.
037400     05  PRT-CO          PIC X(3)  VALUE SPACES.
037500     05  FILLER          PIC X(10) VALUE SPACES.
037600     05  PRT-DATE        PIC X(8)  VALUE SPACES.
037700     05  FILLER          PIC X(3)  VALUE SPACES.
037800     05  PRT-TIME        PIC X(8)  VALUE SPACES.
037900     05  FILLER          PIC X(10) VALUE SPACES.
038000     05  FILLER          PIC X(8)  VALUE "TCALCEXP".
038100     05  FILLER          PIC X(3)  VALUE SPACES.
038200
038300 01  HEADER-2.
038400     05  FILLER          PIC X(82) VALUE SPACES.
038500     05  FILLER          PIC X(17) VALUE "95% AVAILABILITY".
038600     05  FILLER          PIC X(8)  VALUE SPACES.
038700     05  FILLER          PIC X(19) VALUE "99.9% AVAILABILITY".
038800     05  FILLER          PIC X(7)  VALUE SPACES.
038900
039000 01  HEADER-3.
039100     05  FILLER          PIC X(15) VALUE " CORP CODE   UM".
039200     05  FILLER          PIC X(16) VALUE "     DAILY USAGE".
039300     05  FILLER          PIC X(16) VALUE "   LEAD TIME    ".
039400     05  FILLER          PIC X(12) VALUE "MAXIMUM     ".
039500     05  FILLER          PIC X(10) VALUE "REORDER   ".
039600     05  FILLER          PIC X(12) VALUE "EXPEDITE    ".
039700     05  FILLER          PIC X(11) VALUE "REORDER    ".
039800     05  FILLER          PIC X(14) VALUE "EXPEDITE      ".
039900     05  FILLER          PIC X(12) VALUE "REORDER     ".
040000     05  FILLER          PIC X(8)  VALUE "EXPEDITE".
040100     05  FILLER          PIC X(8)  VALUE SPACES.
040200
040300 01  DETAIL-LINE-1.
040400     05  FILLER          PIC X(2)  VALUE SPACES.
040500     05  CORP-CODE-OUT   PIC X(7)  VALUE SPACES.
040600     05  FILLER          PIC X(4)  VALUE SPACES.
040700     05  UM-OUT          PIC X(2)  VALUE SPACES.
040800     05  FILLER          PIC X(3)  VALUE SPACES.
040900     05  USAGE-OUT       PIC Z(7)9.9(4) VALUE ZEROS.
041000     05  FILLER          PIC X(5)  VALUE SPACES.
041100     05  LEAD-TIME-OUT   PIC Z(3)9 VALUE ZEROS.
041200     05  FILLER          PIC X(6)  VALUE SPACES.
041300     05  MAX-OUT         PIC Z(7)9 VALUE ZEROS.
041400     05  FILLER          PIC X(4)  VALUE SPACES.
041500     05  REORDER-OUT     PIC Z(7)9 VALUE ZEROS.
041600     05  FILLER          PIC X(3)  VALUE SPACES.
041700     05  EXPEDITE-OUT    PIC Z(7)9 VALUE ZEROS.
041800     05  FILLER          PIC X(3)  VALUE SPACES.
041900     05  REORDER-95-AVAIL-OUT  PIC Z(7)9  VALUE ZEROS.
042000     05  FILLER          PIC X(4)  VALUE SPACES.
042100     05  EXPEDITE-95-AVAIL-OUT  PIC Z(7)9 VALUE ZEROS.
042200     05  FILLER          PIC X(5)  VALUE SPACES.
042300     05  REORDER-99-AVAIL-OUT  PIC Z(7)9  VALUE ZEROS.
042400     05  FILLER          PIC X(5)  VALUE SPACES.
042500     05  EXPEDITE-99-AVAIL-OUT  PIC Z(7)9  VALUE ZEROS.
042600     05  FILLER          PIC X(6)  VALUE SPACES.
042700
042800 01  DETAIL-LINE-2.
042900     05  FILLER          PIC X(10) VALUE SPACES.
043000     05  DESC-OUT        PIC X(80) VALUE SPACES.
043100     05  FILLER          PIC X(42) VALUE SPACES.
043200
043300
043400 01  DASH-LINE.
043500     05  FILLER          PIC X(132) VALUE ALL "-".
043600
043700
043800**************************************************
043900**                DATE AREAS                    **
044000**************************************************
044100
044200 01  DATES-AND-TIMES.
044300     05  HP-CUR-DATE.
044400         10  MM               PIC XX.
044500         10  FILLER           PIC X.
044600         10  DD               PIC XX.
044700         10  FILLER           PIC X.
044800         10  YY               PIC XX.
044900     05  CUR-DATE.
045000         10  YY               PIC XX.
045100         10  MM               PIC XX.
045200         10  DD               PIC XX.
045300
045400     05  HP-TIME.
045500         10  HH               PIC XX.
045600         10  MIN              PIC XX.
045700         10  SS               PIC XX.
045800
045900 01  MDY-DATE.
046000     05  MM-IN          PIC XX.
046100     05  FILLER         PIC X   VALUE "/".
046200     05  DD-IN          PIC XX.
046300     05  FILLER         PIC X   VALUE "/".
046400     05  YY-IN          PIC XX.
046500
046600 COPY TDATECHK IN COPYLIB.
046700
046800
046900*************************************************************
047000**                                                         **
047100**          E R R O R   M E S S A G E   A R E A S          **
047200**                                                         **
047300*************************************************************
047400
047500 COPY TBLOWUP IN COPYLIB.
047600
047700
047800
047900 PROCEDURE DIVISION.
048000
048100 PROC-DIV SECTION 01.
048200
048300
048400 1-BEGIN.
048500     PERFORM 1-HSK THRU 1-H-X.
048600
048700     PERFORM 6-MAIN THRU 6-M-X.
048800
048900     PERFORM 2-EOJ  THRU 2-EOJ-X.
049000
049100     GOBACK.
049200
049300
049400
049500 1-HSK.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
           OPEN INPUT MPLTINFO-I, MSTORERM-I, DDESC-I, USAGEFIL-I.
050100
051300     OPEN OUTPUT ONLINE-PRT.
051400
051500**************************************************
051600*                                                *
051700*   GET CO. AND PRIME FROM MPLTINFO              *
051800*   USING 'P 01' AS THE ARGUMENT                 *
051900*                                                *
052000**************************************************
052100
052200     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
052600         MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
052700         MOVE PLT-ARG                      TO  BU-DISPLAY-FLD (1)
052800         GO TO 2-BLOWUP.
052900     MOVE MPLTINFO-COMPANY     TO  PRT-CO.
053000
053100     MOVE 1                    TO  DATE-MODE.
053200     CALL "TDATECHK" USING DATE-CHECK-AREA.
053300     MOVE DATE-SLASH-OUT       TO  PRT-DATE.
053400     MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
053500
053600 1-H-X.
053700     EXIT.
053800
053900
054000 2-EOJ.
           CLOSE MPLTINFO-I, MSTORERM-I, DDESC-I, USAGEFIL-I.
055000
055100     CLOSE ONLINE-PRT.
055200
055300 2-EOJ-X.
055400     EXIT.
055500
055600*********************************************
055700*                                           *
055800*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
055900*  FATAL ERROR OCCURS                       *
056000*                                           *
056100*********************************************
056200
056300 2-BLOWUP.
056400     MOVE "TCALCEXP"              TO  BU-PGM-NAME.
056500     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
056600         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
056700                 BU-DISPLAY-FLDS.
056800
056900
057000
057100**************************************************
057200*                                                *
057300*     6 - M A I N                                *
057400*                                                *
057500**************************************************
057600
057700
057800 6-MAIN.
057900     SORT SORT-FILE
058000         ON ASCENDING KEY SORT-CODE
058100         INPUT PROCEDURE IS ABSTRACT-CODES
058200         OUTPUT PROCEDURE IS WRITE-REPORT.
058300
058400 6-M-X.
058500     EXIT.
058600
058700
058800
058900*******************************************
059000*                                         *
059100*    I N P U T    P R O C E D U R E       *
059200*                                         *
059300*******************************************
059400
059500 ABSTRACT-CODES SECTION.
059600
       61-START-MSTORERM.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY > CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "START MSTORERM * 61-SM" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

059700 61-ABSTRACT-LOOP.
059800
059900*** SERIAL GET THRU MSTORERM FOR CODES
060000
060100
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
060900             GO TO 61-AC-X
061000         ELSE
061100             MOVE "GET MSTORERM AL"  TO  BU-DISPLAY-MSG
061200             GO TO 2-BLOWUP.
060500*** END OF SEGMENT (MODE2) GIVES A COND-CODE OF "11"
061300
061400
061500 61-DOES-CODE-QUALIFY.
061600     IF STR-STOCK-OT = " "
061700         NEXT SENTENCE
061800     ELSE
061900         GO TO 61-ABSTRACT-LOOP.
062000     IF STR-EST-LT = ZEROS  AND  STR-LAST-DLVTIMES (1) = ZEROS
062100         GO TO 61-ABSTRACT-LOOP.
062200     IF STR-MAX = ZEROS AND
062300        STR-REORDER = ZEROS AND
062400        STR-EXPEDITE = ZEROS
062500          GO TO 61-ABSTRACT-LOOP.
062600
062700 61-GET-USAGE.
           MOVE CORP-CODE TO CORPCDE OF USAGEFIL-REC-I.
           READ USAGEFIL-I INTO USAGE-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
063200         MOVE "CKREADBYKEY ERR MS3F" TO BU-DISPLAY-MSG
063300         MOVE KEY-VALUE              TO BU-DISPLAY-FLD (1)
063400         GO TO 2-BLOWUP.
063500
063600     MOVE ZEROS                    TO  YEAR-TOTAL,
063700                                       SUB.
063800
063900 61-CALCULATE-USAGE.
064000     ADD 1  TO  SUB
064100     IF SUB  >  12
064200         GO TO 61-COMPUTE-NEW-EXPEDITES.
064300     ADD K-MTH-USAGE (SUB)  TO  YEAR-TOTAL.
064400     GO TO 61-CALCULATE-USAGE.
064500
064600 61-COMPUTE-NEW-EXPEDITES.
064700     DIVIDE YEAR-TOTAL  BY  365  GIVING  DAILY-USAGE.
064800     IF STR-EST-LT = ZEROS
064900         MOVE STR-LAST-DLVTIMES (1) TO  LEAD-TIME
065000     ELSE
065100         MOVE STR-EST-LT            TO  LEAD-TIME.
065200     MULTIPLY DAILY-USAGE BY LEAD-TIME
065300         GIVING LEAD-TIME-USAGE.
065400     COMPUTE SQ-LT-USAGE = LEAD-TIME-USAGE ** .5
065500     MULTIPLY SQ-LT-USAGE  BY  1.65
065600         GIVING EXPEDITE-95-AVAIL ROUNDED.
065700     MULTIPLY SQ-LT-USAGE  BY  3.09
065800         GIVING EXPEDITE-99-AVAIL ROUNDED.
065900     ADD EXPEDITE-95-AVAIL, LEAD-TIME-USAGE
066000         GIVING REORDER-95-AVAIL ROUNDED.
066100     ADD EXPEDITE-99-AVAIL, LEAD-TIME-USAGE
066200         GIVING REORDER-99-AVAIL ROUNDED.
066300     MULTIPLY STR-REORDER BY 1.5 GIVING
066400         REORDER-150-PCT ROUNDED.
066500     MULTIPLY STR-REORDER BY .5 GIVING
066600         REORDER-50-PCT ROUNDED.
066700
066800****  CHECK TO SEE IF PRESENT REORDER X 150% IS TOO LOW
066900
067000     IF REORDER-150-PCT  <  REORDER-95-AVAIL
067100         NEXT SENTENCE
067200     ELSE
067300
067400****  CHECK TO SEE IF PRESENT REORDER X 50% IS TOO HIGH
067500
067600     IF REORDER-50-PCT  >  REORDER-99-AVAIL
067700         NEXT SENTENCE
067800     ELSE
067900         GO TO 61-ABSTRACT-LOOP.
068000
068100 61-RELEASE-RCD.
068200     MOVE CORP-CODE                TO  SORT-CODE.
068300     MOVE STR-UM                   TO  SORT-UM.
068400     MOVE STR-MAX                  TO  SORT-MAX.
068500     MOVE STR-REORDER              TO  SORT-REORDER.
068600     MOVE STR-EXPEDITE             TO  SORT-EXPEDITE.
068700     MOVE DAILY-USAGE              TO  SORT-DAILY-USAGE.
068800     MOVE LEAD-TIME                TO  SORT-LEAD-TIME.
068900     MOVE EXPEDITE-95-AVAIL        TO  SORT-EXPEDITE-95-AVAIL.
069000     MOVE REORDER-95-AVAIL         TO  SORT-REORDER-95-AVAIL.
069100     MOVE EXPEDITE-99-AVAIL        TO  SORT-EXPEDITE-99-AVAIL.
069200     MOVE REORDER-99-AVAIL         TO  SORT-REORDER-99-AVAIL.
069300     RELEASE SORT-RCD.
069400     GO TO 61-ABSTRACT-LOOP.
069500
069600 61-AC-X.
069700     EXIT.
069800
069900*******************************************
070000*                                         *
070100*    O U T P U T   P R O C E D U R E      *
070200*                                         *
070300*******************************************
070400
070500 WRITE-REPORT SECTION.
070600 WRITE-RPT.
070700*    PERFORM 621-WRITE-HEADER-PAGE  THRU  621-WHP-X.
070800     MOVE 66  TO LINE-CTR.
070900
071000 62-RETURN-A-RECORD.
071100     RETURN SORT-FILE  AT END
071200         GO TO 62-WR-X.
071300
071400 62-MOVE-DATA-TO-PRINT.
071500     MOVE SORT-CODE                TO  CORP-CODE-OUT.
071600     MOVE SORT-UM                  TO  UM-OUT.
071700     MOVE SORT-DAILY-USAGE         TO  USAGE-OUT.
071800     MOVE SORT-LEAD-TIME           TO  LEAD-TIME-OUT.
071900     MOVE SORT-MAX                 TO  MAX-OUT.
072000     MOVE SORT-REORDER             TO  REORDER-OUT.
072100     MOVE SORT-EXPEDITE            TO  EXPEDITE-OUT.
072200     MOVE SORT-EXPEDITE-95-AVAIL   TO  EXPEDITE-95-AVAIL-OUT.
072300     MOVE SORT-REORDER-95-AVAIL    TO  REORDER-95-AVAIL-OUT.
072400     MOVE SORT-EXPEDITE-99-AVAIL   TO  EXPEDITE-99-AVAIL-OUT.
072500     MOVE SORT-REORDER-99-AVAIL    TO  REORDER-99-AVAIL-OUT.
072600     MOVE DETAIL-LINE-1            TO  PRINT-RCD.
072700     MOVE 2                        TO  LINE-ADV.
072800     PERFORM 621-WRITE-DETAIL-LINE.
072900
073000 62-GET-KEYWORD-ADJ.
073100     MOVE SORT-CODE                TO  CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
           START DDESC-I KEY = CORPCDE OF DDESC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
073500             MOVE "FIND DDESC * 62-GKA" TO BU-DISPLAY-MSG
073600             MOVE CODE-ARG              TO BU-DISPLAY-FLD (1)
073700             GO TO 2-BLOWUP.
073800
           MOVE 0 TO COND-WORD.
           READ DDESC-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
074300             MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
074100     IF COND-WORD NOT = 0
074200         IF COND-WORD = 15
074300             MOVE "* NO DESCRIPTION ON FILE *"
074400                 TO  DESC-OUT
074500         ELSE
074600             MOVE "GET DDESC * 62-GKA" TO BU-DISPLAY-MSG
074700             MOVE CODE-ARG             TO BU-DISPLAY-FLD (1)
074800             GO TO 2-BLOWUP
074900     ELSE
075000         MOVE DESC-DATA              TO  DESC-OUT.
075100     MOVE 1                       TO  LINE-ADV.
075200     MOVE DETAIL-LINE-2           TO  PRINT-RCD.
075300     PERFORM 621-WRITE-DETAIL-LINE.
075400
075500     GO TO 62-RETURN-A-RECORD.
075800
075900 621-WRITE-DETAIL-LINE.
076000     IF LINE-CTR > 56
076100         PERFORM 621-WRITE-HEADER-LINE.
076200     WRITE PRINT-RCD  AFTER ADVANCING  LINE-ADV.
076300     ADD LINE-ADV  TO  LINE-CTR.
076400
076500 621-WRITE-HEADER-LINE.
076600     MOVE PRINT-RCD       TO  SAVE-PRINT-LINE.
076700     MOVE ZEROS           TO  LINE-CTR.
076800     ADD 1                TO  PAGE-CTR
076900     MOVE PAGE-CTR        TO  PAGE-NO-OUT.
077000     WRITE PRINT-RCD FROM HEADER-1  AFTER
077100         ADVANCING NEWPAGE.
077200     WRITE PRINT-RCD FROM HEADER-2  AFTER
077300         ADVANCING 2 LINES.
077400     WRITE PRINT-RCD FROM HEADER-3  AFTER
077500         ADVANCING 1 LINES.
077600     WRITE PRINT-RCD FROM DASH-LINE  AFTER
077700         ADVANCING 1 LINES.
077800     MOVE SAVE-PRINT-LINE  TO  PRINT-RCD.
077900
078000*621-WRITE-HEADER-PAGE.
078100
078500*621-WHP-X.
078600*    EXIT.
078700
078800 62-WR-X.
078900     EXIT.
