000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TCALCAVG.
000400 AUTHOR.               MK MADDEN.
000600 INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000500 DATE-WRITTEN.         MAY 30, 1985.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      MATERIAL ACCUM MASTER DATA SET
001000*                      AND CALCULATE A NEW AVERAGE COST FOR ALL
001100*                      CODES THAT HAVE BEEN UPDATED IN DAILY
001200*                      ACTIVITY.  THIS PROGRAM WILL PRINT A
001300*                      REPORT OF ALL NEW AVERAGE COSTS AND
001400*                      WILL FLAG THOSE AVERAGE COSTS WHICH
001500*                      HAVE CHANGED MORE THAN 15%.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   12SEP1996    DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C
001700 ENVIRONMENT DIVISION.
001800 CONFIGURATION SECTION.
001900 SOURCE-COMPUTER.      IBM-AS400.
002000 OBJECT-COMPUTER.      IBM-AS400.
002100 SPECIAL-NAMES.        C01 IS TOP-OF-FORM.
002200
002300 INPUT-OUTPUT SECTION.
002400 FILE-CONTROL.
002500     SELECT ONLINE-PRT   ASSIGN TO PRINTER-MCPRT.

002600     SELECT SORT-FILE    ASSIGN TO DISK-SORT.

           SELECT MACTINFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MATLACUM-I
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MATLACUM-O
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-O
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002800 DATA DIVISION.
003000 FILE SECTION.
003100
003200 FD  ONLINE-PRT
003300     DATA RECORD IS PRT-REC
003400     RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS ARE OMITTED.
003700 01  PRT-REC                       PIC X(133).
003800
003900 SD  SORT-FILE
004000     DATA RECORD IS SORT-REC
004100     RECORD CONTAINS 36  CHARACTERS.
004300 01  SORT-REC.
004400     05  SORT-CLASS               PIC X(4).
004500     05  SORT-STORES-CODE         PIC X(8).
004600     05  SORT-PREV-AVG            PIC S9(6)V9(4).
004700     05  SORT-NEW-AVG             PIC S9(6)V9(4).
004800     05  SORT-15-FLAG             PIC X.
004900     05  SORT-50-FLAG             PIC X.
005000     05  SORT-UNIT-MEASURE        PIC XX.
005100
       FD  MACTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.

       FD  MATLACUM-I
           LABEL RECORDS ARE STANDARD.
       01  MATLACUM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0601.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       FD  MATLACUM-O
           LABEL RECORDS ARE STANDARD.
       01  MATLACUM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0601.

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1601.

005200 WORKING-STORAGE SECTION.
005300
005400 77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
005500 77  LINE-CNT                      PIC 99      VALUE 0.
005600 77  PAGE-CNT                      PIC 9(4)    VALUE 0.
005700 77  OLD-AVG-COST                  PIC 9(11)V9(4)  VALUE 0.
005800 77  NEW-AVG-COST                  PIC 9(11)V9(4)  VALUE 0.
005900 77  TOTAL-UNITS                   PIC S9(10)  VALUE 0.
006000 77  TOTAL-DOLLARS                 PIC S9(12)V99  VALUE 0.
006100 77  PLANT-PARALLEL-SW             PIC X(1)     VALUE SPACES.
006200     88  PLANT-IS-RUNNING-PARALLEL              VALUE "Y".
       77  MCXCBLERR-SCOPE               PIC X(1)     VALUE "C".
006300
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X        VALUE SPACES.
           05  FILE-STATUS-2             PIC X        VALUE SPACES.

006400 COPY SOPNRAV IN COPYLIB.
006500
006600 COPY TDATECHK IN COPYLIB.
006700
006800************************************************************
006900**     REPORT PRINT LINES                                 **
007000************************************************************
007100
007200 01  HEADER1.
007300     05  FILLER                     PIC X      VALUE SPACES.
007400     05  FILLER                     PIC X(19)
007500         VALUE "TCALCAVG".
007600     05  FILLER                     PIC X(42)
007700         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
007800     05  FILLER                     PIC X(5)   VALUE "DATE ".
007900     05  DATE-H1                    PIC X(8)   VALUE SPACES.
008000     05  FILLER                     PIC X(6)   VALUE SPACES.
008100
008200 01  HEADER2.
008300     05  FILLER                     PIC X      VALUE SPACES.
008400     05  FILLER                     PIC X(6)   VALUE "PAGE".
008500     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
008600     05  FILLER                     PIC X(13)  VALUE SPACES.
008700     05  FILLER                     PIC X(38)
008800         VALUE "AVERAGE COST CHANGE REPORT".
008900     05  FILLER                     PIC X(5)   VALUE "TIME ".
009000     05  TIME-H2                    PIC X(8)   VALUE SPACES.
009100
009200 01  HEADER3.
009300     05  FILLER                     PIC X(24)  VALUE SPACES.
009400     05  FILLER                     PIC X(16)  VALUE "PREVIOUS".
009500     05  FILLER                     PIC X(39)  VALUE "NEW".
009600
009700 01  HEADER4.
009800     05  FILLER                     PIC X(3)   VALUE SPACES.
009900     05  FILLER                     PIC X(37)
010000         VALUE "MATERIAL CODE  UM  ACTUAL COST".
010100     05  FILLER                     PIC X(41)
010200         VALUE "AVG COST       OVER 15%  OVER 50%".
010400
010500 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
010600
010700 01  DETAIL-LINE.
010800     05  FILLER                     PIC X(3)   VALUE SPACES.
010900     05  PRT-CLASS                  PIC X(3)   VALUE SPACES.
011000     05  PRT-HYPHEN                 PIC X      VALUE SPACES.
011100     05  PRT-MATLCODE               PIC X(7)   VALUE SPACES.
011200     05  FILLER                     PIC X(4)   VALUE SPACES.
011300     05  PRT-UM                     PIC XX     VALUE SPACES.
011400     05  FILLER                     PIC X(3)   VALUE SPACES.
011500     05  PRT-PREV-COST              PIC Z(6).Z(4).
011600     05  FILLER                     PIC X(5)   VALUE SPACES.
011700     05  PRT-NEW-COST               PIC Z(6).Z(4).
011800     05  FILLER                     PIC X(7)   VALUE SPACES.
011900     05  PRT-15-FLAG                PIC XXX    VALUE SPACES.
012000     05  FILLER                     PIC X(7)   VALUE SPACES.
012100     05  PRT-50-FLAG                PIC XXX    VALUE SPACES.
012200     05  FILLER                     PIC X(23)  VALUE SPACES.
012400
012500************************************************************
012600**                                                        **
012700**           D A T A B A S E   B U F F E R S              **
012800**                                                        **
012900************************************************************
013000
013100*********************
013200**  MACCOUNT-INFO  **
013300*********************
013400
013500 COPY MACTINFO IN COPYLIB.
013600
013700*********************
013800**  MMATL-ACCUM    **
013900*********************
014000
014100 COPY MATLACUM IN COPYLIB.
014200
014300*****************
014400*   MSTORERM    *
014500*****************
014600
014700 COPY MSTORERM IN COPYLIB.
014800
014900*************************
015000**   DDAILYTC          **
015100*************************
015200
015300 COPY DDAILYTC IN COPYLIB.
015400
015500 COPY TC311 IN COPYLIB.
015600
015700**********************************************************
015800*              D A T A    B A S E                        *
015900**********************************************************
016000
016100 COPY DBCSACCT IN COPYLIB.
016200
016300 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
016400 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
016500
016600 COPY DBMODES IN COPYLIB.
016700
016800 COPY DBSTAT  IN COPYLIB.
016900
017000 COPY MULTLOCK IN COPYLIB.
017100
017300 01  DATASET-NAMES.
017400     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
017500     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
017600     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
017700     05  DSET-DDAILYTC    PIC X(16)  VALUE "DDAILYTC;".
017800
017900 01  ITEMS-LISTING.
018000     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
018100
018200 01  IMAGE-ARGS.
018300     05  MACCT-KEY        PIC X(4)   VALUE SPACES.
018400     05  MMATL-CODE-ARG    PIC X(8)   VALUE SPACES.
018500
018600*******************************************************
018700*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
018800*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
018900*   READ ERRORS).                                     *
019000*******************************************************
019100
019200 COPY TBLOWUP IN COPYLIB.
019300
019400******************************************
019500**   PARAMETERS FOR CALLING 'CBLOWSRT'
019600******************************************
019700
019800 COPY CBLOWSRT IN COPYLIB.
019900
020100 PROCEDURE DIVISION.
020200
020300 001-BEGIN SECTION.
020400
020500 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

022300     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
022400                                     SORT-STORES-CODE
022500     INPUT PROCEDURE IS 050-PROCESS-TRANS
022600     OUTPUT PROCEDURE IS 700-CREATE-REPORT.
022700     PERFORM 1000-CLOSE-FILES.
022800     GOBACK.
022900
023100 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
023200     PERFORM 100-BEGIN.
023300     PERFORM 200-PROCESS-MASTER
023400         UNTIL END-OF-FILE.
023500
023600**********************************************************
023700*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
023800*  FOR SORTING OF RECORDS.                               *
023900**********************************************************
024000
024100     GO TO 699-PROCESS-EXIT.
024200
024300 100-BEGIN.
           OPEN INPUT MACTINFO-I, MATLACUM-I, MSTORERM-I.
           OPEN I-O   MATLACUM-O, MSTORERM-O, DDAILYTC-O.
026200
026300****************************************************
026400**   GET THE KEY 'PARA' OUT OF MACCOUNT-INFO.     **
026500**   IF THE KEY EXISTS THAT MEANS THE PLANT IS    **
026600**   RUNNING PARALLEL THEREFORE WE SHOULD'NT      **
026700**   UPDATE CSIS (UPDATE MSTORERM WITH NEW AVG    **
026800**   COST AND CUT TC 311).                        **
026900****************************************************
027000     MOVE SPACES                  TO PLANT-PARALLEL-SW.
027100     MOVE "PARA"                  TO MACCT-KEY.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-I.
           READ MACTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
027900     IF GOOD-CALL
028000         MOVE "Y"                 TO PLANT-PARALLEL-SW
028100     ELSE
028200         IF NO-ENTRY
028300             NEXT SENTENCE
028400         ELSE
028500             MOVE "GET MACCOUNT-INFO 'PARA'* 100"
028600                   TO BU-DISPLAY-MSG
028700             MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
028800             PERFORM 990-BLOWUP.
028900
029000     MOVE SPACES                  TO BUF-DDAILYTC.

           MOVE SPACES TO MATLCODE OF MATLACUM-REC-I.
           START MATLACUM-I KEY >= MATLCODE OF
              MATLACUM-REC-I
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

029100     PERFORM 400-GET-MMATL-ACCUM.
029200
029400 200-PROCESS-MASTER.
029500     IF (MATL-CLASS > 099 AND MATL-CLASS < 200) OR
029600        (MATL-CLASS > 399 AND MATL-CLASS < 500)
029700          NEXT SENTENCE
029800     ELSE
029900         IF MATL-AVG-COST-UPD NOT = SPACES
030000             PERFORM 500-GET-MSTORERM
030100             IF NO-ENTRY
030200                 NEXT SENTENCE
030300             ELSE
030400                 PERFORM 600-CALCULATE-NEW-COST
030500                 IF NEW-AVG-COST NOT = OLD-AVG-COST
030600                     IF PLANT-IS-RUNNING-PARALLEL
030700                         PERFORM 670-UPDATE-MMATL-ACCUM
030800                     ELSE
030900                         PERFORM 650-UPDATE-AVG-COST
031000                         PERFORM 660-ADD-DDAILYTC
031100                         PERFORM 670-UPDATE-MMATL-ACCUM
031200                 ELSE
031300                     PERFORM 670-UPDATE-MMATL-ACCUM.
031400
031500     PERFORM 400-GET-MMATL-ACCUM.
031600
031800 400-GET-MMATL-ACCUM.
           MOVE 0 TO COND-WORD.
           READ MATLACUM-I NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 11 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
032600     IF GOOD-CALL
032700         NEXT SENTENCE
032800     ELSE
032900         IF END-OF-FILE
033000             NEXT SENTENCE
033100         ELSE
033200             MOVE "DBGET MMATL-ACCUM * 400-GMA" TO BU-DISPLAY-MSG
033300             PERFORM 990-BLOWUP.
033400
033500     MOVE MATL-STORES-CODE        TO MMATL-CODE-ARG,
033600                                     BU-DISPLAY-FLD (1).
033800 500-GET-MSTORERM.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
034600     IF GOOD-CALL
035500         MOVE STR-AVG-COST TO OLD-AVG-COST
034800     ELSE
034900        IF NO-ENTRY
035000            NEXT SENTENCE
035100         ELSE
035200             MOVE "GET MSTORERM * 500-GM" TO BU-DISPLAY-MSG
035300             PERFORM 990-BLOWUP.
035400
035700 600-CALCULATE-NEW-COST.
035800********************************************************
035900**   CALL 'SOPNRAV' TO GET STOREROOM OPEN RECEIVERS
036000**   AND INVOICES
036100********************************************************
036200     MOVE MMATL-CODE-ARG          TO SOPNRAV-MATL-CODE.
036300     CALL "SOPNRAV" USING ACCTG-BASE,
036400                          SOPNRAV-PARMS,
036500                          STATUS-AREA,
036600                          BU-DISPLAY-MSG,
036700                          BU-DISPLAY-FLDS.
036800     IF BU-DISPLAY-MSG NOT = SPACES
036900         PERFORM 990-BLOWUP.
037000
037100************************************************************
037200**   IF BEGINNING BALANCE DOLLARS AND UNITS ARE BOTH
037300**   NEGATIVE AND NO ACCOUNTING ADJUSTMENT OF BOTH UNITS
037400**   AND DOLLARS HAVE BEEN MADE (EQUALS ZEROS)
037500**   THEN CONVERT BEGINNING BALANCE DOLLARS AND UNITS TO
037600**   ABSOLUTE VALUE BEFORE CALCULATING A NEW AVERAGE COST.
037700************************************************************
037800**      A T T E N T I O N ||||||||||||||||||||||||||
037900**   COMMENTED OUT LOGIC THAT USES ABSOLUTE VALUE OF
038000**   BEGINNING UNITS AND DOLLARS PER CSAS CONFERENCE MAY 89
038100**
038200*************************************************************
038300**
038400**   IF MATL-BEG-BAL-DOLLARS < 0  AND
038500**      MATL-BEG-BAL-UNITS  < 0  AND
038600**      MATL-ACCTG-DOLLAR-CORR = ZEROS  AND
038700**      MATL-ACCTG-UNIT-CORR = ZEROS
038800**       COMPUTE SAVE-BEG-BAL-UNITS = MATL-BEG-BAL-UNITS * -1
038900**       COMPUTE SAVE-BEG-BAL-DOLLARS = MATL-BEG-BAL-DOLLARS * -1
039000**   ELSE
039100**       MOVE MATL-BEG-BAL-UNITS  TO SAVE-BEG-BAL-UNITS
039200**       MOVE MATL-BEG-BAL-DOLLARS  TO SAVE-BEG-BAL-DOLLARS.
039300*********************************************************************
039400
039500     COMPUTE TOTAL-DOLLARS = MATL-BEG-BAL-DOLLARS +
039600        MATL-INV-DOLLARS + S-STR-OPEN-RCVR-DLRS +
039700        MATL-RTNVAL-DOLLARS +
039800        MATL-ACCTG-DOLLAR-CORR + MATL-TOT-ADJ-DOLLARS +
039900        MATL-RTN-DOLLARS - MATL-TOT-ISS-DOLLARS.
040000
040100     COMPUTE TOTAL-UNITS = MATL-BEG-BAL-UNITS +
040200        MATL-RCPT-UNITS + S-STR-OPEN-RCVR-UNITS +
040300        MATL-RTNVAL-UNITS +
040400        MATL-ACCTG-UNIT-CORR + MATL-ADJ-UNITS +
040500        MATL-RTN-UNITS - MATL-ISSUE-UNITS.
040600
040700     IF TOTAL-UNITS < 1
040800         MOVE OLD-AVG-COST TO NEW-AVG-COST
040900     ELSE
041000         IF TOTAL-DOLLARS < 0
041100             MOVE OLD-AVG-COST TO NEW-AVG-COST
041200         ELSE
041300             COMPUTE NEW-AVG-COST = TOTAL-DOLLARS /
041400                                    TOTAL-UNITS.
041500
041600     MOVE MATL-STORES-CODE        TO SORT-STORES-CODE.
041700     MOVE MATL-CLASS              TO SORT-CLASS.
041800     MOVE MATL-UNIT-MEASURE       TO SORT-UNIT-MEASURE.
041900     MOVE OLD-AVG-COST            TO SORT-PREV-AVG.
042000     MOVE NEW-AVG-COST            TO SORT-NEW-AVG.
042100     IF (NEW-AVG-COST / OLD-AVG-COST) > 1.15 OR
042200        (OLD-AVG-COST / NEW-AVG-COST) > 1.15
042300          MOVE 1                  TO SORT-15-FLAG
042400     ELSE
042500            MOVE SPACES TO SORT-15-FLAG.
042600     IF (NEW-AVG-COST / OLD-AVG-COST) > 1.50 OR
042700         (OLD-AVG-COST / NEW-AVG-COST) > 1.50
042800            MOVE 1                TO SORT-50-FLAG
042900      ELSE
043000          MOVE SPACES             TO SORT-50-FLAG.
043100
043200     IF SORT-15-FLAG = 1
043300         RELEASE SORT-REC.
043400     MOVE SPACES                  TO SORT-REC.
043500     MOVE 0                       TO SORT-PREV-AVG
043600                                     SORT-NEW-AVG.
043700
043800 650-UPDATE-AVG-COST.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045000         MOVE "READ MSTORERM * 650-UAC" TO BU-DISPLAY-MSG
045100         PERFORM 990-BLOWUP.
045200
045300     MOVE NEW-AVG-COST            TO STR-AVG-COST.
           REWRITE MSTORERM-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
046300         MOVE "REWRITE MSTORERM * 650-UAC" TO BU-DISPLAY-MSG
046400         PERFORM 990-BLOWUP.
047400
047500 660-ADD-DDAILYTC.
047600     MOVE 1                       TO DATE-MODE.
047700     CALL "TDATECHK" USING DATE-CHECK-AREA.
047800     MOVE DATE-YMD-OUT            TO DDAILYTC-DATE.
047900     MOVE DATE-UNFORMATTED-TIME-OUT  TO DDAILYTC-TIME.
048000     MOVE "311"                   TO DDAILYTC-TC.
048100     MOVE MATL-STORES-CODE        TO TC311-CORP-CODE.
048200     MOVE "5"                     TO TC311-ID-5.
048300     MOVE NEW-AVG-COST            TO TC311-AVG-COST.
048400     MOVE STR-STD-COST            TO TC311-STD-COST.
048500     MOVE STR-MKT-COST            TO TC311-MKT-COST.
048600     MOVE MATL-CLASS              TO TC311-CLASS-ID5.
050100
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
051100         MOVE "WRITE DDAILYTC * 660-AD" TO BU-DISPLAY-MSG
051200         PERFORM 990-BLOWUP.
051300
052500 670-UPDATE-MMATL-ACCUM.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MATLACUM-REC-O.
           READ MATLACUM-O INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045000         MOVE "READ MATLACUM * 670-UMA" TO BU-DISPLAY-MSG
045100         PERFORM 990-BLOWUP.

           MOVE SPACES TO MATL-AVG-COST-UPD.

           REWRITE MATLACUM-REC-O FROM BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
054900         MOVE "REWRITE MMATL-ACCUM * 670-UMA" TO BU-DISPLAY-MSG
055000         PERFORM 990-BLOWUP.
056000
056100 699-PROCESS-EXIT.
056200     EXIT.
056300
056400 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
056500     DISPLAY "BEGIN REPORT ".
056600     PERFORM 710-BEGIN-REPORT.
056700     PERFORM 720-MOVE-DATA
056800        UNTIL NO-MORE-SORT = "YES".
056900
057000**************************************************
057100**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
057200**  TO COMPLETE PROCESSING OF REPORT            **
057300**************************************************
057400
057500     GO TO 799-CREATE-EXIT.
057600
057700 710-BEGIN-REPORT.
057800     OPEN OUTPUT ONLINE-PRT.
057900     PERFORM 750-PRINT-HEADINGS.
058000     RETURN SORT-FILE
058100        AT END
058200            MOVE "YES" TO NO-MORE-SORT.
058300
058400 720-MOVE-DATA.
058500     PERFORM 730-PROCESS-CODE
058600        UNTIL NO-MORE-SORT = "YES".
058700     IF NO-MORE-SORT = "YES"
058800         NEXT SENTENCE
058900     ELSE
059000         PERFORM 750-PRINT-HEADINGS.
059100
059200 730-PROCESS-CODE.
059300     MOVE SORT-CLASS              TO PRT-CLASS.
059400     MOVE "-"                     TO PRT-HYPHEN.
059500     MOVE SORT-STORES-CODE        TO PRT-MATLCODE.
059600     MOVE SORT-UNIT-MEASURE       TO PRT-UM.
059700     MOVE SORT-PREV-AVG           TO PRT-PREV-COST.
059800     MOVE SORT-NEW-AVG            TO PRT-NEW-COST.
059900     IF SORT-15-FLAG = 1
060000         MOVE "***"               TO PRT-15-FLAG
060100     ELSE
060200         MOVE SPACES              TO PRT-15-FLAG.
060300     IF SORT-50-FLAG = 1
060400         MOVE "***"               TO PRT-50-FLAG
060500     ELSE
060600         MOVE SPACES              TO PRT-50-FLAG.
060700     WRITE PRT-REC FROM DETAIL-LINE AFTER 1.
060800     ADD 1                        TO LINE-CNT.
060900     IF LINE-CNT > 55
061000         PERFORM 750-PRINT-HEADINGS.
061100     MOVE SPACES                  TO PRT-REC
061200                                     DETAIL-LINE.
061300     RETURN SORT-FILE
061400        AT END
061500            MOVE "YES"            TO NO-MORE-SORT.
061600
061800 750-PRINT-HEADINGS.
061900     MOVE 1                       TO DATE-MODE.
062000     CALL "TDATECHK" USING DATE-CHECK-AREA.
062100     MOVE DATE-SLASH-OUT          TO DATE-H1.
062200     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
062300     ADD 1                        TO PAGE-CNT.
062400     MOVE PAGE-CNT                TO PAGE-H2.
062500     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING TOP-OF-FORM.
062600     WRITE PRT-REC FROM HEADER2 AFTER 1.
062700     WRITE PRT-REC FROM HEADER3 AFTER 2.
062800     WRITE PRT-REC FROM HEADER4 AFTER 1.
062900     WRITE PRT-REC FROM BLANK-LINE AFTER 1.
063000     MOVE 6                       TO LINE-CNT.
063100
063200 799-CREATE-EXIT.
063300     EXIT.
063400
063500 900-ERROR SECTION.
063600
063700 990-BLOWUP.
065200     MOVE "TCALCAVG"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                   BU-DISPLAY-FLDS.
066100
066300 1000-CLOSE-FILES.
066400     CLOSE ONLINE-PRT.
           CLOSE MACTINFO-I, MATLACUM-I, MSTORERM-I.
           CLOSE MATLACUM-O, MSTORERM-O, DDAILYTC-O.
