       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TCCDEL.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.            *** MACHINE CATALOG FILE DELETE PROGRAM
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CC-NOTE-MSTR
                  ASSIGN       TO DATABASE-MCFLMM2201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT CORP-CODE-LINK
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCCLINK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  CC-NOTE-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS CNMFREC.
       01  CNMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2201.

       FD  CORP-CODE-LINK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS CCLFREC.
       01  CCLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HIER-KEY-KEY        PIC X(14).
       77  F-KEY               PIC 99.
       77  RESPONSE            PIC X.
       77  TIM                 PIC X(06).
       77  F                   PIC XX.
       77  KEY-HOLD            PIC X(08).
       77  TRUE-VAL            PIC 1 VALUE B"1".
       77  CMDLIN              PIC X(79).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TCCDEL  ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(30) VALUE
                   "DELETION MODULE OF THE MMIS SP".
               10  PROG-DESC-A     PIC X(30) VALUE
                   "ARE PARTS MAINTENANCE PROGRAM.".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "DELETES LINKED CODES, SUBSYSTE".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "MS, OR TYPE NUMBERS FROM FILE.".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "RUNS FROM THE f7 KEY OF THE SP".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "ARE PARTS MAINTENANCE MENU.   ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  EQUIP-DATA.
               10  E-NUM       PIC X(06).
               10  T-NUM       PIC X(08).
               10  SS-NUM      PIC X(04).
           05  DELETE-SELECT.
               10  CC-BUF      PIC X(07).
               10  SS-BUF      PIC X(04).
               10  TP-BUF      PIC X(08).
           05  SCRN-MSG        PIC X(76).
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  CORP-CODE-DATA.
           05  HIER-KEY        PIC X(14).
           05  CC-LINK         PIC X(08).

       01  CORP-CODE-CHECK.
           05  HIER-KEY-CHECK.
               10  HIER-KEY-TYPE     PIC X(08).
               10  HIER-KEY-SUBS     PIC X(04).
               10  FILLER            PIC XX.
           05  CC-LINK-CHECK         PIC X(08).

       01  CC-NOTE-DATA.
           05  NOTE-KEY        PIC X(22).
           05  MACH-NOTE       PIC X(76).

       01  CAT-READ-BUF-1.
           05  DEL-CC          PIC X(07) VALUE SPACES.
           05  FILLER          PIC XX    VALUE SPACES.
           05  CAT-TEXT1-1     PIC X(15).

       01  CAT-READ-BUF-2.
           05  CAT-TEXT2-1     PIC X(25).
           05  DEL-SS          PIC X(04) VALUE SPACES.
           05  CAT-TEXT2-2     PIC X(08).
           05  FILLER          PIC X(08) VALUE SPACES.
           05  CAT-TEXT2-3     PIC X(26).

       01  CAT-READ-BUF-3.
           05  CAT-TEXT3-1     PIC X(20).
           05  DEL-TP          PIC X(08) VALUE SPACES.
           05  CAT-TEXT3-2     PIC X(08).
           05  FILLER          PIC X(08) VALUE SPACES.
           05  CAT-TEXT3-3     PIC X(26).

       01  CAT-READ-BUF-4.
           05  CAT-TEXT4-1     PIC X(30).
           05  TP-MSG          PIC X(08) VALUE SPACES.
           05  CAT-TEXT4-2     PIC X(37).

       01  DB-ERROR.
           05  DB-FUNC     PIC X(08) VALUE SPACES.
           05  FILLER      PIC X(20) VALUE " ERROR: FILE-STAT = ".
           05  CON-WORD    PIC XX.
           05  FILLER      PIC X(08) VALUE " FILE:  ".
           05  DB-FILE     PIC X(20) VALUE SPACES.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  MESSAGE-DATA.       COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

       01  LINK-DATA.
           05  EQP-SUB-LINK.
               10  EQP-NUM-LINK  PIC X(06).
               10  FILLER        PIC X(02).
               10  ESUBSYS-LINK  PIC X(04).
           05  TYPE-SUB-LINK.
               10  TYPE-NUM-LINK PIC X(08).
               10  TSUBSYS-LINK  PIC X(04).

       PROCEDURE DIVISION      USING DBPARAMETERS
                               LINK-DATA.

       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           PERFORM 1-HSK.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               CORP-CODE-LINK.
           CLOSE               CC-NOTE-MSTR.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       1-HSK.
           OPEN I-O            CORP-CODE-LINK.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO F
               ACCEPT TIM      FROM TIME
               DISPLAY
           "  ********************************************      TIME: "
           "   FAILURE TO OPEN FILE:  CORP-CODE-LINK            " TIM
           "                          (LOGICAL-MCFLMM2101)             "
           "    FILE STATUS IS:  " F "                                 "
           "   PLEASE WRITE DOWN ERROR ABOVE OR PRINT THIS            "
           "   SCREEN.  WAIT 5 MINUTES AND TRY AGAIN.                 "
           "  ********************************************            "
           "      PRESS 'ENTER' KEY TO CONTINUE:"
               ACCEPT RESPONSE
               MOVE 3          TO KEY-HIT
               GO TO END-OF-JOB.

           OPEN I-O            CC-NOTE-MSTR.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO F
               ACCEPT TIM      FROM TIME
               DISPLAY
           "  ********************************************      TIME: "
           "   FAILURE TO OPEN FILE:  CC-NOTE-MSTR              " TIM
           "                          (LOGICAL-MCFLMM2201)             "
           "    FILE STATUS IS:  " F "                                 "
           "   PLEASE WRITE DOWN ERROR ABOVE OR PRINT THIS            "
           "   SCREEN.  WAIT 5 MINUTES AND TRY AGAIN.                 "
           "  ********************************************            "
           "      PRESS 'ENTER' KEY TO CONTINUE:"
               ACCEPT RESPONSE
               MOVE 3          TO KEY-HIT
               GO TO END-OF-JOB.

           OPEN I-O            DISPLAY-FILE.
           MOVE "FCCDEL"       TO SCREEN-NAME.
      *M**************************************************************
      *M  MESSAGE:  066/226
      *M  F1-EQP NO.  F2-EQP TYPE  F3-EXIT  F4-SUBSYS  F5-MACH. NOTES
      *M  F6-F7-F8-DELETE
      *M**************************************************************
           MOVE   66           TO CATREAD-MSG-SET.
           MOVE  226           TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDLIN.

       6-RESET.
           MOVE "FCCDEL"       TO SCREEN-NAME.

       6-MAIN.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE EQP-NUM-LINK   TO E-NUM.
           MOVE TYPE-NUM-LINK  TO T-NUM.
           MOVE ESUBSYS-LINK   TO SS-NUM.
           IF EQP-NUM-LINK NOT = SPACES
               MOVE EQP-SUB-LINK TO KEY-HOLD
           ELSE
               MOVE TYPE-SUB-LINK TO KEY-HOLD.

       61-SHOWFORM-1.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE CMDLIN         TO CMDMSG.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 2 OR 3 OR 4 OR 5
               GO TO END-OF-JOB.

           IF KEY-HIT = 0
               GO TO 61-SHOWFORM-1.

       RESET-KEYS.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE EQP-NUM-LINK   TO E-NUM.
           MOVE TYPE-NUM-LINK  TO T-NUM.
           MOVE ESUBSYS-LINK   TO SS-NUM.

           IF KEY-HIT = 6
               MOVE "FCCDEL6"  TO SCREEN-NAME
               MOVE KEY-HIT    TO F-KEY
               GO TO 61-SHOWFORM-2.

           IF KEY-HIT = 7
               MOVE "FCCDEL7"  TO SCREEN-NAME
               MOVE KEY-HIT    TO F-KEY
               GO TO 61-SHOWFORM-2.

           IF KEY-HIT = 8
               MOVE "FCCDEL8"  TO SCREEN-NAME
               MOVE KEY-HIT    TO F-KEY.

       61-SHOWFORM-2.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE CMDLIN         TO CMDMSG.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 2 OR 3 OR 4 OR 5
               GO TO END-OF-JOB.

           IF KEY-HIT = 6 OR 7 OR 8
               MOVE KEY-HIT    TO F-KEY
               GO TO RESET-KEYS.

           IF DELETE-SELECT = SPACES
               GO TO 61-SHOWFORM-2.

           IF F-KEY = 6
               PERFORM 62-DEL-CODE THRU 62-DC-EXIT.

           IF F-KEY = 7
               PERFORM 62-DEL-SUBS THRU 62-DS-EXIT.

           IF F-KEY = 8
               PERFORM 62-DEL-TYPE THRU 62-DT-EXIT.

           GO TO 6-RESET.

       62-DEL-CODE.
           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           MOVE KEY-HOLD       TO HIER-KEY-TYPE.
           MOVE SS-NUM         TO HIER-KEY-SUBS.
           MOVE CC-BUF         TO CC-LINK.
           MOVE HIER-KEY-CHECK TO HIER-KEY HIER-KEY-KEY
                                  HIERKEY OF CORP-CODE-LINK.
           START CORP-CODE-LINK KEY = HIERKEY OF CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *M**************************************************************
      *M  MESSAGE:  029/024
      *M  CORPORATE CODE NOT LINKED TO THIS LEVEL
      *M**************************************************************
               MOVE  29        TO CATREAD-MSG-SET
               MOVE  24        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2
             ELSE
               MOVE "START   " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

       62-DC-DBGET.
           READ CORP-CODE-LINK NEXT INTO CORP-CODE-CHECK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT = "10" OR "14" OR "46"
      *M**************************************************************
      *M  MESSAGE:  029/024
      *M  CORPORATE CODE NOT LINKED TO THIS LEVEL
      *M**************************************************************
               MOVE  29        TO CATREAD-MSG-SET
               MOVE  24        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2
             ELSE
               MOVE "READ    " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           IF HIER-KEY-KEY NOT = HIER-KEY-CHECK
               GO TO 62-DC-DBGET.

           IF CC-LINK-CHECK = CC-LINK
               DELETE CORP-CODE-LINK
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
                   END-DELETE
               IF FILE-STAT NOT = "00"
                   MOVE "DELETE  " TO DB-FUNC
                   MOVE "CORP-CODE-LINK" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO MESSAGE-BUFFER
                   MOVE 4          TO FIELD-NUMBER
                   PERFORM 65-ERROR
                   GO TO 61-SHOWFORM-2
               ELSE
               MOVE CC-BUF     TO DEL-CC
      *M**************************************************************
      *M  MESSAGE:  044/007
      *M  RECORD DELETED
      *M**************************************************************
               MOVE  44        TO CATREAD-MSG-SET
               MOVE   7        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT1-1
               MOVE CAT-READ-BUF-1 TO SCRN-MSG
               GO TO 62-DC-CONT
           ELSE
               GO TO 62-DC-DBGET.

       62-DC-CONT.
           MOVE CORP-CODE-DATA TO NOTEKEY OF CC-NOTE-MSTR.
           READ CC-NOTE-MSTR   INTO CC-NOTE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
               MOVE SPACES     TO DELETE-SELECT
               GO TO 61-SHOWFORM-2
             ELSE
               MOVE "READ    " TO DB-FUNC
               MOVE "CC-NOTE-MSTR" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           IF CORP-CODE-DATA NOT = NOTE-KEY
               GO TO 62-DC-DBGET.

           DELETE CC-NOTE-MSTR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-FUNC
               MOVE "CC-NOTE-MSTR" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 4          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           MOVE CC-BUF         TO DEL-CC.
      *M**************************************************************
      *M  MESSAGE:  044/007
      *M  RECORD DELETED
      *M**************************************************************
           MOVE  44            TO CATREAD-MSG-SET
           MOVE   7            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CAT-TEXT1-1.
           MOVE CAT-READ-BUF-1 TO SCRN-MSG
           MOVE SPACES         TO DELETE-SELECT.
           GO TO 61-SHOWFORM-2.

       62-DC-EXIT.             EXIT.

       62-DEL-SUBS.
           IF SS-BUF NOT = SS-NUM
      *M**************************************************************
      *M  MESSAGE:  045/046
      *M  SUBSYSTEM NOT VERIFIED - DELETE NOT PROCESSED
      *M**************************************************************
               MOVE  45        TO CATREAD-MSG-SET
               MOVE  46        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           MOVE KEY-HOLD       TO HIER-KEY-TYPE.
           MOVE SS-NUM         TO HIER-KEY-SUBS.
           MOVE CC-BUF         TO CC-LINK.
           MOVE HIER-KEY-CHECK TO HIER-KEY HIER-KEY-KEY
                                  HIERKEY OF CORP-CODE-LINK.
           START CORP-CODE-LINK KEY = HIERKEY OF CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *M**************************************************************
      *M  MESSAGE:  046/004
      *M  TYPE/SUBSYSTEM NOT FOUND
      *M**************************************************************
               MOVE  46        TO CATREAD-MSG-SET
               MOVE   4        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2
             ELSE
               MOVE "START   " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

       62-DS-DBGET.
           READ CORP-CODE-LINK NEXT INTO CORP-CODE-CHECK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT = "10" OR "14" OR "46"
               MOVE SS-BUF     TO DEL-SS
      *M**************************************************************
      *M  MESSAGE:  027/059
      *M  ALL RECORDS OF SUBSYSTEM
      *M**************************************************************
               MOVE  27        TO CATREAD-MSG-SET
               MOVE  59        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT2-1
      *M**************************************************************
      *M  MESSAGE:  027/060
      *M  DELETED
      *M**************************************************************
               MOVE  27        TO CATREAD-MSG-SET
               MOVE  60        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT2-2
      *M**************************************************************
      *M  MESSAGE:  042/071
      *M  PRESS 'ENTER' TO CONTINUE
      *M**************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  71        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT2-3
               MOVE SPACES         TO CMDMSG
               MOVE CAT-READ-BUF-2 TO CMDMSG
               MOVE "00"           TO SCREEN-STATUS
               MOVE SCREEN-DATA    TO DISPLAY-REC
               WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
                   INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                            SCREEN-STATUS
                   GO TO END-OF-JOB
               ELSE
               READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
                   INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                            SCREEN-STATUS
                   GO TO END-OF-JOB
               ELSE
               MOVE ALL B"0"   TO SCREEN-INDICATORS
               MOVE 0          TO KEY-HIT FUNC-KEY-NUM
               GO TO 6-RESET
             ELSE
               MOVE "READ NXT" TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           IF HIER-KEY-KEY NOT = HIER-KEY-CHECK
               GO TO 62-DS-DBGET.

           MOVE CC-LINK-CHECK  TO CC-LINK.
           DELETE CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

       62-DS-CONT.
           MOVE CORP-CODE-DATA TO NOTEKEY OF CC-NOTE-MSTR.
           READ CC-NOTE-MSTR   INTO CC-NOTE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
                 GO TO 62-DS-DBGET
             ELSE
                 MOVE "READ    " TO DB-FUNC
                 MOVE "CC-NOTE-MSTR" TO DB-FILE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE DB-ERROR   TO MESSAGE-BUFFER
                 MOVE 5          TO FIELD-NUMBER
                 PERFORM 65-ERROR
                 GO TO 61-SHOWFORM-2.

           IF CORP-CODE-DATA NOT = NOTE-KEY
               GO TO 62-DS-DBGET.

           DELETE CC-NOTE-MSTR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-FUNC
               MOVE "CC-NOTE-MSTR" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 5          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           GO TO 62-DS-DBGET.

       62-DS-EXIT.             EXIT.

       62-DEL-TYPE.
           IF TP-BUF NOT = KEY-HOLD
      *M**************************************************************
      *M  MESSAGE:  046/007
      *M  TYPE NOT VERIFIED - DELETE NOT PROCESSED
      *M**************************************************************
               MOVE  46        TO CATREAD-MSG-SET
               MOVE   7        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           MOVE TP-BUF         TO TP-MSG.
      *M**************************************************************
      *M  MESSAGE:  049/019
      *M  *WARNING* ALL RECORDS OF TYPE
      *M**************************************************************
           MOVE  49            TO CATREAD-MSG-SET.
           MOVE  19            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CAT-TEXT4-1.
      *M**************************************************************
      *M  MESSAGE:  049/020
      *M  WILL BE DELETED.  PRESS F8 TO DELETE
      *M**************************************************************
           MOVE  49            TO CATREAD-MSG-SET.
           MOVE  20            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CAT-TEXT4-2.
           MOVE CAT-READ-BUF-4 TO SCRN-MSG

           MOVE "00"           TO SCREEN-STATUS.
           MOVE CMDLIN         TO CMDMSG.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 2 OR 3 OR 4 OR 5
               GO TO END-OF-JOB.

           IF KEY-HIT = 6 OR 7
               GO TO RESET-KEYS.

           IF KEY-HIT NOT = 8
               GO TO 62-DEL-TYPE.

       62-DT-START.
           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           MOVE KEY-HOLD       TO HIER-KEY-TYPE.
           MOVE SS-NUM         TO HIER-KEY-SUBS.
           MOVE CC-BUF         TO CC-LINK.
           MOVE HIER-KEY-CHECK TO HIER-KEY HIER-KEY-KEY
                                  HIERKEY OF CORP-CODE-LINK.
           START CORP-CODE-LINK KEY NOT < HIERKEY OF CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      *M**************************************************************
      *M  MESSAGE:  046/004
      *M  TYPE/SUBSYSTEM NOT FOUND
      *M**************************************************************
               MOVE  46        TO CATREAD-MSG-SET
               MOVE   4        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2
             ELSE
               MOVE "START   " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

       62-DT-DBGET.
           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           MOVE KEY-HOLD       TO HIER-KEY-TYPE.
           MOVE SS-NUM         TO HIER-KEY-SUBS.
           MOVE CC-BUF         TO CC-LINK.
           MOVE HIER-KEY-CHECK TO HIER-KEY HIER-KEY-KEY.
           READ CORP-CODE-LINK NEXT INTO CORP-CODE-CHECK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT = "10" OR "14" OR "46"
               MOVE TP-BUF     TO DEL-TP
      *M**************************************************************
      *M  MESSAGE:  027/061
      *M  ALL RECORDS OF TYPE
      *M**************************************************************
               MOVE  27        TO CATREAD-MSG-SET
               MOVE  61        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT3-1
      *M**************************************************************
      *M  MESSAGE:  027/060
      *M  DELETED
      *M**************************************************************
               MOVE  27        TO CATREAD-MSG-SET
               MOVE  60        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT3-2
      *M**************************************************************
      *M  MESSAGE:  042/071
      *M  PRESS 'ENTER' TO CONTINUE
      *M**************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  71        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT3-3
               MOVE SPACES         TO SCRN-MSG CMDMSG
               MOVE CAT-READ-BUF-3 TO CMDMSG
               MOVE "00"           TO SCREEN-STATUS
               MOVE SCREEN-DATA    TO DISPLAY-REC
               WRITE DISPLAY-REC FORMAT IS SCREEN-NAME
                   INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                            SCREEN-STATUS
                   GO TO END-OF-JOB
               ELSE
               READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
                   INDIC ARE SCREEN-INDICATORS
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                            SCREEN-STATUS
                   GO TO END-OF-JOB
               ELSE
               MOVE ALL B"0"   TO SCREEN-INDICATORS
               MOVE 0          TO KEY-HIT FUNC-KEY-NUM
               GO TO 6-RESET
             ELSE
               MOVE "READ NXT" TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           IF KEY-HOLD NOT = HIER-KEY-TYPE
               GO TO 62-DT-DBGET.

           MOVE CC-LINK-CHECK  TO CC-LINK.
           DELETE CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-FUNC
               MOVE "CORP-CODE-LINK" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

       62-DT-CONT.
           MOVE CORP-CODE-DATA TO NOTEKEY OF CC-NOTE-MSTR.
           READ CC-NOTE-MSTR   INTO CC-NOTE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
                 GO TO 62-DT-DBGET
             ELSE
                 MOVE "READ    " TO DB-FUNC
                 MOVE "CC-NOTE-MSTR" TO DB-FILE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE DB-ERROR   TO MESSAGE-BUFFER
                 MOVE 6          TO FIELD-NUMBER
                 PERFORM 65-ERROR
                 GO TO 61-SHOWFORM-2.

           IF CORP-CODE-DATA NOT = NOTE-KEY
               GO TO 62-DT-DBGET.

           DELETE CC-NOTE-MSTR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-FUNC
               MOVE "CC-NOTE-MSTR" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM-2.

           GO TO 62-DT-DBGET.

       62-DT-EXIT.             EXIT.

       65-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE B"1"           TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

