       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TCCINIT.
      *REMARKS.            *** MACHINE CATALOG FILE INITIATE PROGRAM
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CORP-CODE-LINK
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCCLINK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  CORP-CODE-LINK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS CCLFREC.
       01  CCLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  ERROR-SW            PIC 9     VALUE 0.
       77  FUNC-SW             PIC S9(4)  COMP VALUE 1.
       77  PLACE-SAVE          PIC 9(04).
       77  RET-CC              PIC X(08).
       77  RET-CODE            PIC X(02).
       77  SUB                 PIC 9(04) VALUE 0.
       77  BASE2               PIC X(24).
       77  HIER-KEY-KEY        PIC X(14).
       77  TRUE-VAL            PIC 1 VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TCCINIT ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "SPARE PARTS ".
                   15  FILLER      PIC X(12) VALUE "MAINTENANCE ".
                   15  FILLER      PIC X(16) VALUE "ADDITION MODULE ".
                   15  FILLER      PIC X(20) VALUE SPACES.
               10  PROG-DESC-B.
                   15  FILLER      PIC X(13) VALUE "ALLOWS SPARE ".
                   15  FILLER      PIC X(12) VALUE "PARTS TO BE ".
                   15  FILLER      PIC X(10) VALUE "LINKED TO ".
                   15  FILLER      PIC X(15) VALUE "CORPORATE TYPE ".
                   15  FILLER      PIC X(10) VALUE "NUMBERS ".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F5 ".
                   15  FILLER      PIC X(17) VALUE "KEY OF THE SPARE ".
                   15  FILLER      PIC X(06) VALUE "PARTS ".
                   15  FILLER      PIC X(12) VALUE "MAINTENANCE ".
                   15  FILLER      PIC X(08) VALUE "MENU ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  CAT-READ-BUFFER.
           05  CAT-TEXT-1      PIC X(28).
           05  DUP-SS          PIC X(04).
           05  CAT-TEXT-2      PIC X(24).

       01  CC-TABLE.
           05  CC-X            OCCURS 15 TIMES  PIC X(07).

       01  CC-HOLD.
           05  CC-H-2          PIC X(02).
           05  FILLER          PIC X(05).

       01  CORP-CODE-DATA.
           05  HIER-KEY        PIC X(14).
           05  CC-LINK         PIC X(08).

       01  CORP-CODE-CHECK.
           05  HIER-KEY-CHECK.
               10  CC-KEY      PIC X(08).
               10  CC-SS       PIC X(04).
               10  FILLER      PIC X(02).
           05  CC-LINK-CHECK   PIC X(08).

       01  RET-MFG-DATA.
           05  RET-MFG         PIC X(26).
           05  RET-PRT         PIC X(20).
           05  RET-KEYWD       PIC X(20).
           05  RET-ADJ         PIC X(30).

       01  SCREEN-DATA.
           05  EQUIP-DATA.
               10  E-NUM       PIC X(06).
               10  T-NUM       PIC X(08).
               10  SS-NUM      PIC X(04).
           05  CC-CODES.
               10  CC-1        PIC X(07).
               10  CC-2        PIC X(07).
               10  CC-3        PIC X(07).
               10  CC-4        PIC X(07).
               10  CC-5        PIC X(07).
               10  CC-6        PIC X(07).
               10  CC-7        PIC X(07).
               10  CC-8        PIC X(07).
               10  CC-9        PIC X(07).
               10  CC-10       PIC X(07).
               10  CC-11       PIC X(07).
               10  CC-12       PIC X(07).
               10  CC-13       PIC X(07).
               10  CC-14       PIC X(07).
               10  CC-15       PIC X(07).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       01  MESSAGE-DATA.       COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  IN COPYLIB.

       01  LINK-DATA.
           05  EQP-SUB-LINK.
               10  EQP-NUM-LINK  PIC X(06).
               10  FILLER        PIC X(02).
               10  ESUBSYS-LINK  PIC X(04).
           05  TYPE-SUB-LINK.
               10  TYPE-NUM-LINK PIC X(08).
               10  TSUBSYS-LINK  PIC X(04).

       PROCEDURE DIVISION      USING DBPARAMETERS
                               LINK-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           OPEN I-O            CORP-CODE-LINK.
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.

       6-MAIN.
           MOVE EQP-NUM-LINK   TO E-NUM.
           MOVE TYPE-NUM-LINK  TO T-NUM.
           MOVE ESUBSYS-LINK   TO SS-NUM.
           MOVE "FCCINITA"     TO SCREEN-NAME.
           MOVE 0              TO PLACE-SAVE KEY-HIT.
           IF IND(99) = TRUE-VAL
               MOVE MESSAGE-BUFFER TO ERRMSG.

      *M********************************************************************
      *M    MESSAGE 66225:
      *M  F1-EQP NO.  F2-TYPE-NO.  F3-EXIT  F4-SUBSYS  F5-MACH NOTES
      *M  F6-DISPLAY PARTS  F8-DELETE
      *M********************************************************************
           MOVE 66225          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.
           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE SPACES         TO CMDMSG ERRMSG.

           IF KEY-HIT = 3 GO TO END-OF-JOB.

           IF KEY-HIT = 6
               CALL "SCCERSPR" USING DBPARAMETERS
                               LINK-DATA
               GO TO 6-MAIN.

           IF KEY-HIT NOT = 0  GO TO END-OF-JOB.

           IF CC-CODES = SPACES
      **********************************************************************
      **    MESSAGE 66120:
      **  NO DATA ENTERED - HIT 'RESET' KEY AND TRY AGAIN
      **********************************************************************
               MOVE 66120      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 6-MAIN.

       61-EDIT-DATA.
           MOVE CC-CODES       TO CC-TABLE.
           MOVE PLACE-SAVE     TO SUB.
           MOVE 0              TO PLACE-SAVE.
           PERFORM 61-EDIT-LOOP THRU 61-EL-EXIT UNTIL SUB = 15.

           IF PLACE-SAVE > 0
               SUBTRACT 1      FROM PLACE-SAVE
               GO TO 6-MAIN
           ELSE
           GO TO 63-WRITE-FILE.

       61-EDIT-LOOP.
           ADD 1               TO SUB.
           IF CC-X(SUB) = SPACES
               IF SUB < 15
                   GO TO 61-EDIT-LOOP
               ELSE
                   GO TO 61-EL-EXIT.

           ADD 3               TO SUB GIVING FIELD-NUMBER.
           MOVE CC-X(SUB)      TO CC-HOLD.

           IF CC-X(SUB) = "0000000"
      **********************************************************************
      **    MESSAGE 35021:
      **  INVALID CORPORATE CODE
      **********************************************************************
               MOVE 35021      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(FIELD-NUMBER) IND(99)
               MOVE SUB        TO PLACE-SAVE
               MOVE 15         TO SUB
               GO TO 61-EL-EXIT.

           MOVE CC-X(SUB)      TO RET-CC.
           CALL "TMNPARCD"     USING RET-CODE FUNC-SW BASE2
                               STATUS-AREA RET-CC RET-MFG-DATA
                               LANGUAGE-PARMS.

           IF RET-CODE = "NF"
      **********************************************************************
      **    MESSAGE 35021:
      **  INVALID CORPORATE CODE
      **********************************************************************
               MOVE 35021      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(FIELD-NUMBER) IND(99)
               MOVE SUB        TO PLACE-SAVE
               MOVE 15         TO SUB
               GO TO 61-EL-EXIT.

       61-EL-EXIT.    EXIT.

       63-WRITE-FILE.
           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           MOVE EQP-NUM-LINK   TO CC-KEY.
           IF EQP-NUM-LINK = SPACES
               MOVE TYPE-NUM-LINK TO CC-KEY.
           MOVE ESUBSYS-LINK   TO CC-SS.
           MOVE HIER-KEY-CHECK TO HIER-KEY HIER-KEY-KEY.
           MOVE 0              TO SUB ERROR-SW.
           PERFORM 63-WRITE-LOOP THRU 63-WL-EXIT
                    UNTIL SUB = 15.
           MOVE SPACES         TO SCREEN-DATA.
           GO TO 6-MAIN.

       63-WRITE-LOOP.
           ADD 1               TO SUB.
           IF CC-X(SUB) = SPACES
               GO TO 63-WL-EXIT.

           ADD 3               TO SUB GIVING FIELD-NUMBER.
           MOVE CC-X(SUB)      TO CC-LINK.
           MOVE HIER-KEY-KEY   TO HIERKEY OF CORP-CODE-LINK.
           START CORP-CODE-LINK KEY = HIERKEY OF CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 63-WL-CONT.

       63-WL-DBGET.
           READ CORP-CODE-LINK NEXT INTO CORP-CODE-CHECK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 63-WL-CONT.

           IF HIER-KEY-CHECK NOT = HIER-KEY-KEY
               GO TO 63-WL-CONT.

           IF CC-LINK-CHECK = CC-LINK
               GO TO 63-WL-EXIT
           ELSE
               GO TO 63-WL-DBGET.

       63-WL-CONT.
           WRITE CCLFREC       FROM CORP-CODE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 1          TO ERROR-SW
               MOVE 15         TO SUB
               GO TO 63-WL-EXIT.

       63-WL-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               CORP-CODE-LINK.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

