       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TCCMACH.
      *REMARKS.            *** MACHINE CATALOG FILE
      *                        MACHINE NOTE MAINTENANCE PROGRAM
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CC-NOTE-MSTR
                  ASSIGN       TO DATABASE-MCFLMM2201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT CORP-CODE-LINK
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCCLINK-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  CC-NOTE-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS CNMFREC.
       01  CNMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2201.

       FD  CORP-CODE-LINK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS CCLFREC.
       01  CCLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TRUE-VAL            PIC 1 VALUE B"1".
       77  HIER-KEY-KEY        PIC X(14).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TCCMACH ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(13) VALUE "MACHINE NOTE ".
                   15  FILLER      PIC X(14) VALUE "MODULE OF THE ".
                   15  FILLER      PIC X(17) VALUE "MMIS SPARE PARTS ".
                   15  FILLER      PIC X(16) VALUE "MAINTENANCE PGM ".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(16) VALUE "ALLOWS ADDITION ".
                   15  FILLER      PIC X(16) VALUE "OF MACHINE NOTE ".
                   15  FILLER      PIC X(17) VALUE "TO A LINKED SPARE".
                   15  FILLER      PIC X(11) VALUE " PARTS CODE".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F4 ".
                   15  FILLER      PIC X(17) VALUE "KEY OF THE SPARE ".
                   15  FILLER      PIC X(06) VALUE "PARTS ".
                   15  FILLER      PIC X(12) VALUE "MAINTENANCE ".
                   15  FILLER      PIC X(08) VALUE "MENU ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  EQUIP-DATA.
               10  E-NUM       PIC X(06).
               10  T-NUM       PIC X(08).
               10  SS-NUM      PIC X(04).
           05  CC-MN-BUF.
               10  CC-NUM.
                   15  CC-1-2  PIC X(02).
                   15  CC-3-7  PIC X(05).
               10  MN-BUF      PIC X(76).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  CAT-READ-BUFFER.
           05  CAT-TEXT-1      PIC X(70).

       01  CC-NOTE-DATA.
           05  NOTE-KEY        PIC X(22).
           05  MACH-NOTE       PIC X(76).

       01  CORP-CODE-CHECK.
           05  HIER-KEY-CHECK  PIC X(14).
           05  CC-LINK-CHECK   PIC X(08).

       01  CORP-CODE-DATA.
           05  HIER-KEY        PIC X(14).
           05  CC-LINK         PIC X(08).

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  MESSAGE-DATA.       COPY ERRORLIN OF COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS  OF COPYLIB.

       01  LINK-DATA.
           05  EQP-SUB-LINK.
               10  EQP-NUM-LINK  PIC X(06).
               10  FILLER        PIC X(02).
               10  ESUBSYS-LINK  PIC X(04).
           05  TYPE-SUB-LINK.
               10  TYPE-NUM-LINK PIC X(08).
               10  TSUBSYS-LINK  PIC X(04).

       PROCEDURE DIVISION      USING DBPARAMETERS
                               LINK-DATA.

       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 64-NEXT-ENTRY
               UNTIL KEY-HIT = 3.

       END-OF-JOB.
           CLOSE               CC-NOTE-MSTR.
           CLOSE               CORP-CODE-LINK.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       1-HSK.
           OPEN I-O            CC-NOTE-MSTR.
           OPEN INPUT          CORP-CODE-LINK.
           OPEN I-O            DISPLAY-FILE.
           MOVE "FCCMACHNO"    TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE TYPE-NUM-LINK  TO T-NUM.
           MOVE EQP-NUM-LINK   TO E-NUM.
           MOVE ESUBSYS-LINK   TO SS-NUM.
           MOVE 0              TO KEY-HIT.

       6-MAIN.
           IF IND(99) = TRUE-VAL
               MOVE MESSAGE-BUFFER TO ERRMSG.
      *M**************************************************************
      *M  MESSAGE:  066/224
      *M  F1-EQP NO.  F2-EQP TYPE  F3-EXIT  F4-SUBSYSTEM  F6-ADD
      *M  F8-DELETE
      *M**************************************************************
           MOVE 66224          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.
           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE SPACES         TO CMDMSG ERRMSG.

           IF KEY-HIT NOT = 0  GO TO END-OF-JOB.

           IF CC-NUM = SPACES  GO TO 6-MAIN.

       63-CHECK-FILE.
           MOVE SPACES         TO CORP-CODE-DATA HIER-KEY-KEY.
           IF EQP-NUM-LINK NOT = SPACES
               MOVE EQP-SUB-LINK TO HIER-KEY HIER-KEY-KEY
           ELSE
               MOVE TYPE-SUB-LINK TO HIER-KEY HIER-KEY-KEY.
           MOVE CC-NUM         TO CC-LINK.
           MOVE HIER-KEY-KEY   TO HIERKEY OF CORP-CODE-LINK.
           START CORP-CODE-LINK KEY = HIERKEY OF CORP-CODE-LINK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      *M**************************************************************
      *M  MESSAGE:  035/021
      *M  INVALID CORPORATE CODE
      *M**************************************************************
               MOVE 35021      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO 6-MAIN.

       63-CF-DBGET.
           READ CORP-CODE-LINK NEXT INTO CORP-CODE-CHECK
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      *M**************************************************************
      *M  MESSAGE:  035/021
      *M  INVALID CORPORATE CODE
      *M**************************************************************
               MOVE 35021      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO 6-MAIN.

           IF CC-LINK-CHECK = CC-LINK
               MOVE CORP-CODE-CHECK TO NOTE-KEY
               GO TO 63-CF-CONT
           ELSE
               GO TO 63-CF-DBGET.

       63-CF-CONT.
           MOVE NOTE-KEY       TO NOTEKEY OF CC-NOTE-MSTR.
           START CC-NOTE-MSTR  KEY = NOTEKEY OF CC-NOTE-MSTR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF MN-BUF NOT = SPACES
                   MOVE CORP-CODE-DATA TO NOTE-KEY
                   MOVE MN-BUF TO MACH-NOTE
                   PERFORM 65-PUT
      *M**************************************************************
      *M  MESSAGE:  044/006
      *M  RECORD ADDED
      *M**************************************************************
                   MOVE 44006  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO CAT-TEXT-1
                   MOVE CAT-READ-BUFFER TO CMDMSG
                   MOVE TRUE-VAL TO IND(98)
                   GO TO 64-NEXT-ENTRY
               ELSE
               GO TO 6-MAIN.

           IF MN-BUF = SPACES
               PERFORM 65-DELETE
      *M**************************************************************
      *M  MESSAGE:  044/007
      *M  RECORD DELETED
      *M**************************************************************
               MOVE 44007      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG
               MOVE TRUE-VAL   TO IND(98)
               GO TO 64-NEXT-ENTRY.

           MOVE MN-BUF         TO MACH-NOTE.
           PERFORM 65-DELETE.
           PERFORM 65-PUT.
      *M**************************************************************
      *M  MESSAGE:  044/008
      *M  RECORD CHANGED
      *M**************************************************************
           MOVE 44008          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO CAT-TEXT-1
           MOVE CAT-READ-BUFFER TO CMDMSG
           MOVE TRUE-VAL       TO IND(98).

       64-NEXT-ENTRY.
           MOVE SPACES         TO CC-MN-BUF.
           GO TO 6-MAIN.

       65-PUT.
           WRITE CNMFREC       FROM CC-NOTE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO 6-MAIN.

       65-DELETE.
           DELETE              CC-NOTE-MSTR RECORD
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO 6-MAIN.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

