       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TCFTREQM.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZCFTREQM-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       01  SCREEN-DATA.
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

           COPY SCREENIO       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            DISPLAY-FILE.
       MAIN.
           MOVE "VCFTREQM"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

      ****************************************************************
           IF KEY-HIT = 1
               CALL "TEXECUTV"
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 2
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 4
               CALL "TEAREQ"
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 5
               CALL "TREQRLSE"
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 6
               CALL "TREQINQ"
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 7
               CALL "TRPTJ052"
               GO TO MAIN
           ELSE
      ****************************************************************
           IF KEY-HIT = 8
               GO TO MAIN
           ELSE
      ****************************************************************
               GO TO MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.

