       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCHATQTY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.

      **************************************************************
      *  TCHATQTY
      *     THIS PROGRAM WILL GET A VALID CORPORATE CODE FROM THE
      *     USER AND PASS IT TO SUB-PROGRAM SCHATREF, WHICH WILL
      *     LIST ANY CHAT NUMBERS AND THEIR ASSOCIATED QUANTITIES
      *     THAT ARE LINKED TO THE DESIGNATED CORPORATE CODE.
      *
      **************************************************************
      *C 06/12/96   JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      **************************************************************

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPURORD-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS FILE-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT DCHATNO
               ASSIGN TO DATABASE-MCFLCS5501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       FD  DCHATNO
           LABEL RECORDS ARE STANDARD.
       01  DCHATNO-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5501.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       WORKING-STORAGE SECTION.

       77  BASE                       PIC X(10).
       77  SCREEN-SUB                 PIC 9(2).

       01  TEST-CORP-CODE             PIC X(08).

       COPY VCOMAREA IN COPYLIB.
       COPY CATREAD  OF COPYLIB.
       COPY DCHATNO IN COPYLIB.
       COPY MSTORERM IN COPYLIB.
       COPY CPYIND OF COPYLIB.
       COPY IOFEEDBACK OF COPYLIB.
       COPY WSCONTROL OF COPYLIB.
       COPY TBLOWUP OF COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X     VALUE "0".
           05  FILE-STATUS-2             PIC X     VALUE "0".

       01  SWITCHES.
           05  EOF-SW                    PIC X     VALUE "N".

       01  WS-DISPLAY-AREA.
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-MSG            PIC X(27).
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-STAT           PIC S9(4).
           05    FILLER                  PIC XX.
           05  WS-DISPLAY-FLD            PIC X(14).
           05    FILLER                  PIC XX.

       01  DEFAULT-MESSAGE.
           05  FILLER                  PIC X(79)  VALUE
                 "ERROR WITH CORPCODE/CHAT NO - PLEASE RETRY".

       01  MESSAGE-BUFFER.
           05  FILLER                  PIC X(80).

       01  WS-SCREEN.
           05  DISP-CORP-CODE            PIC X(7).
           05  DISP-COMMAND-LINE         PIC X(79).
           05  DISP-MESSAGE-LINE         PIC X(79).

       01  PASS-CORP-CODE        PIC X(07).

       PROCEDURE DIVISION.

       START-PROGRAM.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           PERFORM 6-MAIN         THRU 6-EXIT
           PERFORM 2-END-OF-JOB   THRU 2-EXIT.

       1-HOUSEKEEPING.
           PERFORM 10-INIT-FIELDS THRU 10-EXIT.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DCHATNO MSTORERM.
       1-EXIT.
           EXIT.

       10-INIT-FIELDS.
           MOVE "CHATINT" TO VIEW-NFNAME.
           MOVE SPACES    TO BUF-DCHATNO.
           MOVE ZEROS     TO STATUS-AREA.
           MOVE ZEROS     TO FILE-STATUS.
           MOVE "N"       TO   EOF-SW.
           MOVE SPACES    TO BU-DISPLAY-MSG.

       10-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE DCHATNO MSTORERM.
           CLOSE DISPLAY-FILE.
           GOBACK.
       2-EXIT.
           EXIT.

       2-BLOWUP.
           MOVE "TCHATQTY" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG, BU-DISPLAY-AREA.

       30-READ-FORWARD.
           READ DCHATNO NEXT
             INTO BUF-DCHATNO
               AT END
                 MOVE "Y" TO EOF-SW.
           IF FILE-STATUS = "10" OR "14" OR "46"
               MOVE "Y" TO EOF-SW.
       30-EXIT.
           EXIT.

       6-MAIN.
           MOVE SPACES TO WS-SCREEN.

       6-PUT-BUFFER.
           MOVE WS-SCREEN TO DSPLY-REC.

       6-SHOW.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.

       6-READ.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.

       6-PROCESS.
           IF VIEW-LASTKEY = 3
             GO TO 6-EXIT.

           MOVE DSPLY-REC TO WS-SCREEN.
           MOVE SPACES TO DISP-MESSAGE-LINE.

           IF DISP-CORP-CODE EQUAL SPACES
      *M****************************************************************
      *M   Message Set: 66   Number: 170
      *M   YOU MUST ENTER A CORPORATE CODE
      *M****************************************************************
              MOVE  66        TO CATREAD-MSG-SET
              MOVE 170        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 6-PUT-BUFFER.

           PERFORM 60-CHECK-CORPCDE THRU 60-EXIT.
           IF INDS (99) = B"1"
              GO TO 6-PUT-BUFFER.
           PERFORM 61-CHECK-CHATNO THRU 61-EXIT.
           IF INDS (99) = B"1"
              GO TO 6-PUT-BUFFER.

           MOVE DISP-CORP-CODE TO PASS-CORP-CODE.
           CALL "SCHATQTY" USING PASS-CORP-CODE
                                 VIEW-COMAREA.
           MOVE SPACES TO VIEW-LASTKEY.
           PERFORM 10-INIT-FIELDS THRU 10-EXIT.
           GO TO 6-MAIN.

       6-EXIT.
           EXIT.

       60-CHECK-CORPCDE.
           MOVE DISP-CORP-CODE TO CORPCDE OF MSTORERM-REC.
           START MSTORERM KEY NOT < CORPCDE OF MSTORERM-REC
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
              MOVE "START ERR MSTORERM 60-CC" TO BU-DISPLAY-MSG
              MOVE  DISP-CORP-CODE             TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           READ MSTORERM NEXT INTO BUF-MSTORERM
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ NXT ERR MSTORERM 60-CC" TO BU-DISPLAY-MSG
              MOVE DISP-CORP-CODE                TO BU-DISPLAY-FLD (1)
              PERFORM 2-BLOWUP.

           IF CORP-CODE = DISP-CORP-CODE
              GO TO 60-EXIT
           ELSE
      *M****************************************************************
      *M   Message Set: 03   Number: 097
      *M   CORPORATE CODE DOES NOT EXIST IN THIS STOREROOM
      *M****************************************************************
              MOVE   3        TO CATREAD-MSG-SET
              MOVE  97        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.

       60-EXIT.
           EXIT.

       61-CHECK-CHATNO.
           MOVE DISP-CORP-CODE TO CORPCDE OF DCHATNO-REC.
           START DCHATNO
               KEY NOT < CORPCDE OF DCHATNO-REC
                 INVALID KEY
                   MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
      *M****************************************************************
      *M   Message Set: 14   Number: 126
      *M   NO CHATNO RECORDS EXIST FOR THIS CORPORATE CODE
      *M****************************************************************
              MOVE  14        TO CATREAD-MSG-SET
              MOVE 126        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.

           PERFORM 30-READ-FORWARD THRU 30-EXIT.

           IF EOF-SW = "N" AND
            CHAT-CORP-CODE = DISP-CORP-CODE
             GO TO 61-EXIT
           ELSE
      *M****************************************************************
      *M   Message Set: 14   Number: 126
      *M   NO CHATNO RECORDS EXIST FOR THIS CORPORATE CODE
      *M****************************************************************
              MOVE  14        TO CATREAD-MSG-SET
              MOVE 126        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT.
       61-EXIT.
           EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDICATORS ARE INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF FILE-STATUS NOT = "00"
             MOVE 3 TO VIEW-LASTKEY
           ELSE
             MOVE FUNCTION-NUM TO VIEW-LASTKEY.
       98-EXIT.
           EXIT.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-NFNAME
               INDICATORS ARE INDICS.
       99-EXIT.
           EXIT.

       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.

       9999-MOVE-CATREAD-MSG.
            MOVE B"1" TO INDS (99).
            IF CATREAD-MSG-TEXT = SPACES
               MOVE DEFAULT-MESSAGE TO DISP-MESSAGE-LINE
            ELSE
               MOVE MESSAGE-BUFFER  TO DISP-MESSAGE-LINE
            END-IF.
            MOVE SPACES TO MESSAGE-BUFFER.

       9999-EXIT.
            EXIT.
