000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TCHBYBC2.
000400 AUTHOR.               A. TREUDLER.
000500 DATE-WRITTEN.         APRIL 24, 1989.
000600 DATE-COMPILED.
000700*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000800
000900*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
001000*                      DETAIL TRANSACTION DATA SET
001100*                      AND FIND ALL ISS, ADJ, RET, RETV AND
001200*                      DCHG TRANSACTIONS AND SORT AND PRINT THEM
001300*                      IN REPORT CODE, LEDGER CODE, DEPT, CLASS,
001400*                      AND DEPT/ACCOUNT ORDER.
001500
      * 14JUN90 DAP - EXPANDED BLOWUP MESSAGE FOR 510-GET-LEDGER
      *               TO PROVIDE MORE DATA.  ALSO CHANGED ALL
      *               REFERENCES TO "TCHGBYBC" TO "TCHBYBC2" TO
      *               HELP AVOID CONFUSION BETWEEN THE 2 PGMS.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09/03/96     CA YODER
      *C     RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.      HP-3000.
001900 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002200
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-PO-I
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREPORT-RC-I
               ASSIGN TO DATABASE-MCFLCA0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MLEDGER-LD-I
               ASSIGN TO DATABASE-MCFLCA0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

002700
002800 DATA DIVISION.
002900
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  DPODATAITM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-PO-REC-I.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MREPORT-RC-I
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-RC-REC-I.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.

       FD  MLEDGER-LD-I
           LABEL RECORDS ARE STANDARD.
       01  MLEDGER-LD-REC-I.
           COPY DDS-MCRPCA0500  OF MCFLCA0501.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*

003100
003200 FD  ONLINE-PRT
003300     DATA RECORD IS PRT-REC
003400     RECORD CONTAINS 133 CHARACTERS
003500     LABEL RECORDS ARE OMITTED.
003600
003700 01  PRT-REC                       PIC X(133).
003800
003900 SD  SORT-FILE
004000     DATA RECORD IS SORT-REC
004100     RECORD CONTAINS 145 CHARACTERS.
004200
004300 01  SORT-REC.
004400     05  SORT-BC                   PIC X(4).
004500     05  SORT-REPORT-CODE          PIC X(2).
004600     05  SORT-LEDG-CODE.
004700         10  SORT-LEDG             PIC XX.
004800         10  SORT-DIV              PIC XX.
004900     05  SORT-DEPT-ACCT.
005000         10  SORT-DEPT-CHGD        PIC X(6).
005100         10  SORT-ACCT-CHGD        PIC X(6).
005200     05  SORT-CLASS                PIC X(3).
005300     05  SORT-CODE-OR-PO           PIC X(7).
005400     05  SORT-UNIT-MEAS            PIC XX.
005500     05  SORT-TRANS-TYPE           PIC X(4).
005600     05  SORT-DESCR                PIC X(60).
005700     05  SORT-QTY-CHGD             PIC S9(10).
005800     05  SORT-VALUE                PIC S9(12)V99.
005900     05  SORT-STD-VALUE            PIC S9(12)V99.
006000     05  SORT-PO-RLS               PIC X(3).
006100     05  SORT-PO-ITEM              PIC X(4).
006200     05  SORT-DEPT-TYPE.
006300         10  SORT-DEPT-TYPE1       PIC X.
006400         10  SORT-DEPT-TYPE2       PIC X.
006500
006600 WORKING-STORAGE SECTION.
006700
006800 77  ENTRIES-READ                  PIC 9(6)   VALUE 0.
006900 77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
007000 77  LINE-CNT                      PIC 99     VALUE 0.
007100 77  PAGE-CNT                      PIC 9(4)    VALUE 0.
007200*********************************************************
007300 77  GRAND-ACTUAL                  PIC S9(12)V99  VALUE 0.
007400 77  GRAND-STANDARD                PIC S9(12)V99  VALUE 0.
007500 77  GRAND-VARIANCE                PIC S9(12)V99  VALUE 0.
007600 77  GRAND-QTY                     PIC S9(10)     VALUE 0.
007700*********************************************************
007800 77  BC-ACTUAL                     PIC S9(12)V99  VALUE 0.
007900 77  BC-STANDARD                   PIC S9(12)V99  VALUE 0.
008000 77  BC-VARIANCE                   PIC S9(12)V99  VALUE 0.
008100 77  BC-QTY                        PIC S9(10)     VALUE 0.
008200*********************************************************
008300 77  VOUCHER-ACTUAL                PIC S9(12)V99  VALUE 0.
008400 77  VOUCHER-STANDARD              PIC S9(12)V99  VALUE 0.
008500 77  VOUCHER-VARIANCE              PIC S9(12)V99  VALUE 0.
008600 77  VOUCHER-QTY                   PIC S9(10)     VALUE 0.
008700*********************************************************
008800 77  LEDGER-ACTUAL                 PIC S9(12)V99  VALUE 0.
008900 77  LEDGER-STANDARD               PIC S9(12)V99  VALUE 0.
009000 77  LEDGER-VARIANCE               PIC S9(12)V99  VALUE 0.
009100 77  LEDGER-QTY                    PIC S9(10)     VALUE 0.
009200*********************************************************
009300 77  DEPT-ACTUAL                   PIC S9(12)V99  VALUE 0.
009400 77  DEPT-STANDARD                 PIC S9(12)V99  VALUE 0.
009500 77  DEPT-VARIANCE                 PIC S9(12)V99  VALUE 0.
009600 77  DEPT-QTY                      PIC S9(10)     VALUE 0.
009700*********************************************************
009800 77  CLASS-ACTUAL                  PIC S9(12)V99  VALUE 0.
009900 77  CLASS-STANDARD                PIC S9(12)V99  VALUE 0.
010000 77  CLASS-VARIANCE                PIC S9(12)V99  VALUE 0.
010100 77  CLASS-QTY                     PIC S9(10)      VALUE 0.
010200*********************************************************
010300 77  NWO-ACTUAL                    PIC S9(12)V99  VALUE 0.
010400 77  NWO-STANDARD                  PIC S9(12)V99  VALUE 0.
010500 77  NWO-VARIANCE                  PIC S9(12)V99  VALUE 0.
010600 77  NWO-QTY                       PIC S9(10)      VALUE 0.
010700*********************************************************
010800 77  ACT-ACTUAL                    PIC S9(12)V99  VALUE 0.
010900 77  ACT-STANDARD                  PIC S9(12)V99  VALUE 0.
011000 77  ACT-VARIANCE                  PIC S9(12)V99  VALUE 0.
011100 77  ACT-QTY                       PIC S9(10)      VALUE 0.
011200*********************************************************
011300 77  PREV-BC                       PIC X(4)       VALUE SPACES.
011400 77  PREV-REPORT-CODE              PIC XX         VALUE SPACES.
011500 77  PREV-LEDGER                   PIC X(2)       VALUE SPACES.
011600 77  PREV-DEPT                     PIC X(6)       VALUE SPACES.
011700 77  PREV-CLASS                    PIC X(4)       VALUE SPACES.
011800 77  PREV-ACT                      PIC X(6)       VALUE SPACES.
011900 77  HOLD-VAR                      PIC S9(12)V99   VALUE 0.
012000 77  PREV-NWO                      PIC X(6)      VALUE SPACES.
012100 77  ITEM-FOUND                    PIC 9         VALUE 0.
012200 77  NO-ACTUAL-VALUE-SW            PIC X(1)      VALUE SPACES.
       77  MCXCBLERR-SCOPE               PIC X(1)      VALUE "C".
012300
012500 01  TIME-DIV.
012600     05  HH-DIV                    PIC XX   VALUE SPACES.
012700     05  MM-DIV                    PIC XX   VALUE SPACES.
012800     05  SS-DIV                    PIC XX   VALUE SPACES.
012900
013000 01  DATE-DIVIDED.
013100     05  MONTH-DIV                PIC XX   VALUE SPACES.
013200     05  FILLER                   PIC X    VALUE SPACES.
013300     05  DAY-DIV                  PIC XX   VALUE SPACES.
013400     05  FILLER                   PIC X    VALUE SPACES.
013500     05  YEAR-DIV                 PIC XX   VALUE SPACES.
013600
013700 01  MONTH-TABLE.
013800     05  FILLER                   PIC X(9)  VALUE "JANUARY".
013900     05  FILLER                   PIC X(9)  VALUE "FEBRUARY".
014000     05  FILLER                   PIC X(9)  VALUE "MARCH".
014100     05  FILLER                   PIC X(9)  VALUE "APRIL".
014200     05  FILLER                   PIC X(9)  VALUE "MAY".
014300     05  FILLER                   PIC X(9)  VALUE "JUNE".
014400     05  FILLER                   PIC X(9)  VALUE "JULY".
014500     05  FILLER                   PIC X(9)  VALUE "AUGUST".
014600     05  FILLER                   PIC X(9)  VALUE "SEPTEMBER".
014700     05  FILLER                   PIC X(9)  VALUE "OCTOBER".
014800     05  FILLER                   PIC X(9)  VALUE "NOVEMBER".
014900     05  FILLER                   PIC X(9)  VALUE "DECEMBER".
015000
015100 01  MONTH-TAB REDEFINES MONTH-TABLE.
015200     05  MONTH-T OCCURS 12 TIMES  PIC X(9).
015300
015400 01  MONTH-YEAR.
015500     05  MONTH-PARM               PIC 99.
015600     05  YEAR-PARM                PIC 99.
015700
015800
015900************************************************************
016000**     REPORT PRINT LINES                                 **
016100************************************************************
016200
016300 01  HEADER1.
016400     05  FILLER                     PIC X      VALUE SPACES.
016500     05  FILLER                     PIC X(49)
016600         VALUE "TCHBYBC2".
016700     05  FILLER                     PIC X(69)
016800         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
016900     05  FILLER                     PIC X(5)   VALUE "DATE ".
017000     05  DATE-H1                    PIC X(8)   VALUE SPACES.
017100
017200 01  HEADER2.
017300     05  FILLER                     PIC X      VALUE SPACES.
017400     05  FILLER                     PIC X(6)   VALUE "PAGE".
017500     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
017600     05  FILLER                     PIC X(34)  VALUE SPACES.
017700     05  FILLER                     PIC X(74)
017800         VALUE "STORES DETAIL OF CHARGES BY BUSINESS CENTER".
017900     05  FILLER                     PIC X(5)   VALUE "TIME ".
018000     05  TIME-H2.
018100         10  HH-H2                  PIC XX     VALUE SPACES.
018200         10  FILLER                 PIC X      VALUE ":".
018300         10  MM-H2                  PIC XX     VALUE SPACES.
018400         10  FILLER                 PIC X      VALUE ":".
018500         10  SS-H2                  PIC XX     VALUE SPACES.
018600
018700 01  HEADER3.
018800     05  FILLER                     PIC X(57)  VALUE SPACES.
018900     05  MONTH-H3                   PIC X(9)   VALUE SPACES.
019000     05  FILLER                     PIC X(3)   VALUE SPACES.
019100     05  YEAR-H3A                   PIC X(2)   VALUE "20".
019200     05  YEAR-H3B                   PIC X(2)   VALUE SPACES.
019300
019400
019500 01  HEADER4.
019600     05  FILLER                     PIC X      VALUE SPACES.
019700     05  FILLER                     PIC X(30)
019800              VALUE "LC DEPT   ACCOUNT CODE OR PO".
019900     05  FILLER                     PIC X(42)
020000              VALUE "RLS ITM  TRANS DESCR".
020100     05  FILLER                    PIC X(10)  VALUE "UM".
020200     05  FILLER                     PIC X(25)
020300              VALUE "QTY         ACTUAL".
020400     05  FILLER                     PIC X(23)
020500              VALUE "STANDARD       VARIANCE".
020600
020700
020800 01  BC-HDG.
020900     05  FILLER                    PIC X(16)
021000             VALUE "BUSINESS CENTER ".
021100     05  BC-OUT                    PIC X(4).
021200
021300 01  REPORT-HDG.
021400     05  FILLER                     PIC X(13)
021500          VALUE "REPORT CODE".
021600     05  REPORT-DESCR-HDG           PIC X(60).
021700
021800
021900 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
022000
022100 01  DETAIL-LINE.
022200     05  FILLER                     PIC X      VALUE SPACES.
022300     05  PRT-LEDGER                 PIC X(2)   VALUE SPACES.
022400     05  FILLER                     PIC X      VALUE SPACES.
022500     05  PRT-DEPT                   PIC X(6)   VALUE SPACES.
022600     05  PRT-HYPHEN                 PIC X      VALUE SPACES.
022700     05  PRT-ACCOUNT                PIC X(6)   VALUE SPACES.
022800     05  FILLER                     PIC X(2)   VALUE SPACES.
022900     05  PRT-CLASS                  PIC X(3).
023000     05  PRT-HYPHEN2                PIC X      VALUE SPACES.
023100     05  PRT-CODE-OR-PO             PIC X(7).
023200     05  FILLER                     PIC X      VALUE SPACES.
023300     05  PRT-RLS                    PIC XXX    VALUE SPACES.
023400     05  FILLER                     PIC X      VALUE SPACES.
023500     05  PRT-ITEM                   PIC X(4)   VALUE SPACES.
023600     05  FILLER                     PIC X      VALUE SPACES.
023700     05  PRT-TRANS-CODE             PIC X(4)   VALUE SPACES.
023800     05  FILLER                     PIC X      VALUE SPACES.
023900     05  PRT-DESCR                  PIC X(27)  VALUE SPACES.
024000     05  FILLER                     PIC X      VALUE SPACES.
024100     05  PRT-UM                     PIC XX     VALUE SPACES.
024200     05  FILLER                     PIC X      VALUE SPACES.
024300     05  PRT-QTY                    PIC Z(10)-.
024400     05  FILLER                     PIC X      VALUE SPACES.
024500     05  PRT-ACTUAL                 PIC Z(10).ZZ-.
024600     05  FILLER                     PIC X      VALUE SPACES.
024700     05  PRT-STD                    PIC Z(10).ZZ-.
024800     05  FILLER                     PIC X      VALUE SPACES.
024900     05  PRT-VAR                    PIC Z(10).ZZ-.
025000
025100 01  BC-LINE.
025200     05  FILLER                     PIC X(11) VALUE "BC TOTAL".
025300     05  BC-TRLR                    PIC X(4)   VALUE SPACES.
025400     05  FILLER                     PIC XX     VALUE SPACES.
025500     05  BC-TRAILER                 PIC X(59)  VALUE SPACES.
025600     05  BC-QTY-PRT                 PIC Z(10)-.
025700     05  FILLER                     PIC X      VALUE SPACES.
025800     05  BC-ACTUAL-PRT              PIC Z(10).ZZ-.
025900     05  FILLER                     PIC X      VALUE SPACES.
026000     05  BC-STANDARD-PRT            PIC Z(10).ZZ-.
026100     05  FILLER                     PIC X      VALUE SPACES.
026200     05  BC-VARIANCE-PRT            PIC Z(10).ZZ-.
026300
026400 01  VOUCHER-LINE.
026500     05  FILLER                     PIC X(13) VALUE "VCHR TOTAL".
026600     05  REPORT-CODE-TRLR            PIC XX     VALUE SPACES.
026700     05  FILLER                     PIC XX     VALUE SPACES.
026800     05  REPORT-TRAILER             PIC X(59)  VALUE SPACES.
026900     05  VOUCHER-QTY-PRT            PIC Z(10)-.
027000     05  FILLER                     PIC X      VALUE SPACES.
027100     05  VOUCHER-ACTUAL-PRT         PIC Z(10).ZZ-.
027200     05  FILLER                     PIC X      VALUE SPACES.
027300     05  VOUCHER-STANDARD-PRT       PIC Z(10).ZZ-.
027400     05  FILLER                     PIC X      VALUE SPACES.
027500     05  VOUCHER-VARIANCE-PRT       PIC Z(10).ZZ-.
027600
027700 01  LEDGER-LINE.
027800     05  FILLER                     PIC X(13)  VALUE "LEDG TOTAL".
027900     05  LEDG-CODE-TRLR             PIC XX     VALUE SPACES.
028000     05  FILLER                     PIC XX     VALUE SPACES.
028100     05  LEDGER-TRAILER             PIC X(59)  VALUE SPACES.
028200     05  LEDGER-QTY-PRT             PIC Z(10)-.
028300     05  FILLER                     PIC X       VALUE SPACES.
028400     05  LEDGER-ACTUAL-PRT          PIC Z(10).ZZ-.
028500     05  FILLER                     PIC X      VALUE SPACES.
028600     05  LEDGER-STANDARD-PRT        PIC Z(10).ZZ-.
028700     05  FILLER                     PIC X      VALUE SPACES.
028800     05  LEDGER-VARIANCE-PRT        PIC Z(10).ZZ-.
028900
029000 01  DEPT-LINE.
029100     05  FILLER                     PIC X(11)  VALUE "DEPT TOTAL".
029200     05  DEPT-CODE-TRLR             PIC X(4)   VALUE SPACES.
029300     05  FILLER                     PIC XX     VALUE SPACES.
029400     05  DEPT-TRAILER               PIC X(59)  VALUE SPACES.
029500     05  DEPT-QTY-PRT               PIC Z(10)-.
029600     05  FILLER                     PIC X      VALUE SPACES.
029700     05  DEPT-ACT-PRT               PIC Z(10).ZZ-.
029800     05  FILLER                     PIC X      VALUE SPACES.
029900     05  DEPT-STD-PRT               PIC Z(10).ZZ-.
030000     05  FILLER                     PIC X      VALUE SPACES.
030100     05  DEPT-VAR-PRT               PIC Z(10).ZZ-.
030200
030300 01  CLASS-LINE.
030400     05  FILLER                     PIC X(12)
030500          VALUE "CLASS TOTAL".
030600     05  CLASS-CODE-TRLR            PIC X(3)   VALUE SPACES.
030700     05  FILLER                     PIC XX     VALUE SPACES.
030800     05  CLASS-TRAILER              PIC X(59)  VALUE SPACES.
030900     05  CLASS-QTY-PRT              PIC Z(10)-.
031000     05  FILLER                     PIC X       VALUE SPACES.
031100     05  CLASS-ACT-PRT              PIC Z(10).ZZ-.
031200     05  FILLER                     PIC X      VALUE SPACES.
031300     05  CLASS-STD-PRT              PIC Z(10).ZZ-.
031400     05  FILLER                     PIC X      VALUE SPACES.
031500     05  CLASS-VAR-PRT              PIC Z(10).ZZ-.
031600
031700 01  NWO-LINE.
031800     05  FILLER                     PIC X(12)
031900          VALUE "NWO TOTAL".
032000     05  NWO-TRLR                   PIC X(6)   VALUE SPACES.
032100     05  FILLER                     PIC X(58)  VALUE SPACES.
032200     05  NWO-QTY-PRT                PIC Z(10)-.
032300     05  FILLER                     PIC X       VALUE SPACES.
032400     05  NWO-ACT-PRT                PIC Z(10).ZZ-.
032500     05  FILLER                     PIC X      VALUE SPACES.
032600     05  NWO-STD-PRT                PIC Z(10).ZZ-.
032700     05  FILLER                     PIC X      VALUE SPACES.
032800     05  NWO-VAR-PRT                PIC Z(10).ZZ-.
032900
033000 01  ACT-LINE.
033100     05  FILLER                     PIC X(12)
033200          VALUE "ACCT TOTAL".
033300     05  ACT-TRLR                   PIC X(6)   VALUE SPACES.
033400     05  FILLER                     PIC X(58)  VALUE SPACES.
033500     05  ACT-QTY-PRT                PIC Z(10)-.
033600     05  FILLER                     PIC X       VALUE SPACES.
033700     05  ACT-ACT-PRT                PIC Z(10).ZZ-.
033800     05  FILLER                     PIC X      VALUE SPACES.
033900     05  ACT-STD-PRT                PIC Z(10).ZZ-.
034000     05  FILLER                     PIC X      VALUE SPACES.
034100     05  ACT-VAR-PRT                PIC Z(10).ZZ-.
034200
034300 01  GRAND-LINE.
034400     05  FILLER                     PIC X(76)
034500          VALUE "TOTAL STORES CHARGES".
034600     05  GRAND-QTY-PRT              PIC Z(10)-.
034700     05  FILLER                     PIC X        VALUE SPACES.
034800     05  GRAND-ACTUAL-PRT           PIC Z(10).ZZ-.
034900     05  FILLER                     PIC X       VALUE SPACES.
035000     05  GRAND-STANDARD-PRT         PIC Z(10).ZZ-.
035100     05  FILLER                     PIC X       VALUE SPACES.
035200     05  GRAND-VARIANCE-PRT         PIC Z(10).ZZ-.
035300
035400 01  NO-ACTUAL-ERROR-LINE.
035500     05  FILLER  PIC X(5)  VALUE SPACES.
035600     05  FILLER  PIC X(7)  VALUE "*****  ".
035700     05  FILLER  PIC X(11) VALUE "WARNING || ".
035800     05  FILLER  PIC X(13) VALUE "TRANSACTIONS ".
035900     05  FILLER  PIC X(13) VALUE "ACTUAL VALUE ".
036000     05  FILLER  PIC X(9)  VALUE "IS ZERO  ".
036100     05  FILLER  PIC X(5)  VALUE "*****".
036200
036300 01  ASTERICK-LINE.
036400     05  FILLER  PIC X(80) VALUE ALL "*".
036500
036600 01  ERROR-MSG-LINE1.
036700     05  FILLER  PIC X(6)  VALUE "**    ".
036800     05  FILLER  PIC X(11) VALUE "WARNING||||".
036900     05  FILLER  PIC X(61) VALUE SPACES.
037000     05  FILLER  PIC X(2)  VALUE "**".
037100
037200 01  ERROR-MSG-LINE2.
037300     05  FILLER  PIC X(6)  VALUE "**    ".
037400     05  FILLER  PIC X(25) VALUE "ONE OR MORE TRANSACTIONS ".
037500     05  FILLER  PIC X(24) VALUE "CONTAIN AN ACTUAL VALUE ".
037600     05  FILLER  PIC X(9)  VALUE "OF ZEROS.".
037700     05  FILLER  PIC X(14) VALUE SPACES.
037800     05  FILLER  PIC X(2)  VALUE "**".
037900
038000 01  ERROR-MSG-LINE3.
038100     05  FILLER  PIC X(6)  VALUE "**    ".
038200     05  FILLER  PIC X(28) VALUE "THE INDIVIDUAL TRANSACTIONS ".
038300     05  FILLER  PIC X(24) VALUE "HAVE BEEN FLAGED WITH A ".
038400     05  FILLER  PIC X(16) VALUE "WARNING MESSAGE.".
038500     05  FILLER  PIC X(4)  VALUE SPACES.
038600     05  FILLER  PIC X(2)  VALUE "**".
038700
038800 01  ERROR-MSG-LINE4.
038900     05  FILLER  PIC X(6)  VALUE "**    ".
039000     05  FILLER  PIC X(20) VALUE "PLEASE REVIEW THESE ".
039100     05  FILLER  PIC X(26) VALUE "TRANSACTIONS TO MAKE SURE ".
039200     05  FILLER  PIC X(22) VALUE "THESE TRANSACTIONS ARE".
039300     05  FILLER  PIC X(4) VALUE SPACES.
039400     05  FILLER  PIC X(2)  VALUE "**".
039500
039600 01  ERROR-MSG-LINE5.
039700     05  FILLER  PIC X(6)  VALUE "**    ".
039800     05  FILLER  PIC X(28) VALUE "CORRECT.  ALL RAW MATERIALS ".
039900     05  FILLER  PIC X(26) VALUE "MUST HAVE AN ACTUAL VALUE ".
040000     05  FILLER  PIC X(11) VALUE "IN ORDER TO".
040100     05  FILLER  PIC X(7)  VALUE SPACES.
040200     05  FILLER  PIC X(2)  VALUE "**".
040300
040400 01  ERROR-MSG-LINE6.
040500     05  FILLER  PIC X(6)  VALUE "**    ".
040600     05  FILLER  PIC X(23) VALUE "COMPUTE A RAW MATERIAL ".
040700     05  FILLER  PIC X(9)  VALUE "VARIANCE.".
040800     05  FILLER  PIC X(40) VALUE SPACES.
040900     05  FILLER  PIC X(2)  VALUE "**".
041000
041100
041200************************************************************
041300**                                                        **
041400**           D A T A B A S E   B U F F E R S              **
041500**                                                        **
041600************************************************************
041700
041800*********************
041900**  MMATL-ACCUM    **
042000*********************
042100
042200 COPY MATLACUM IN COPYLIB.
042300
042400******************
042500**    DTRANS    **
042600******************
042700 COPY DTRANS IN COPYLIB.
042800
042900*****************
043000*  MCHT-ACCTS   *
043100*****************
043200 COPY MCHTACCT IN COPYLIB.
043300
043400*****************
043500*   MCLASS      *
043600*****************
043700 COPY MCLASS IN COPYLIB.
043800
043900*****************
044000*   MREPORT     *
044100*****************
044200 COPY MREPORT IN COPYLIB.
044300
044400*****************
044500*   MLEDGER     *
044600*****************
044700 COPY MLEDGER IN COPYLIB.
044800
044900*****************
045000*   PODATAITM   *
045100*****************
045200 COPY DPODATA IN COPYLIB.
045300
045400*****************
045500*   MSTORERM    *
045600*****************
045700
045800 COPY MSTORERM IN COPYLIB.
045900
046000****************************
046100**    MACCOUNT-INFO       **
046200****************************
046300
046400 COPY MACTINFO IN COPYLIB.
046500
046600**********************************************************
046700*              D A T A    B A S E                        *
046800**********************************************************
046900
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

047000 COPY DBCSACCT IN COPYLIB.
047100
047200 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
047300 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
047400
047500 COPY DBMODES IN COPYLIB.
047600
047700 COPY DBSTAT IN COPYLIB.
047800
047900 01  DATASET-NAMES.
048000     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
048100     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
048200     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
048300     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
048400     05  DSET-MREPORT     PIC X(16)  VALUE "MREPORT;".
048500     05  DSET-MCHT-ACCTS  PIC X(16)  VALUE "MCHT-ACCTS;".
048600     05  DSET-DPODATA     PIC X(16)  VALUE "DPODATAITM;".
048700     05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
048800     05  DSET-MLEDG       PIC X(16)  VALUE "MLEDGER;".
048900
049000 01  ITEMS-LISTING.
049100     05  ALL-ITEMS         PIC X(2)   VALUE "@;".
049200     05  PO-KEY            PIC X(10)  VALUE "PO-RCV-NO;".
049300
049400 01  IMAGE-ARGS.
049500     05  MACCT-KEY         PIC X(4)   VALUE SPACES.
049600     05  MMATL-CODE-ARG.
049700         10  MMATL-FST4    PIC XXXX  VALUE SPACES.
049800         10  MMATL-LST4    PIC XXXX  VALUE SPACES.
049900     05  DEPT-KEY          PIC X(6)   VALUE SPACES.
050000     05  PO-KEY-ARG.
050100         10  KEY-REC-ID    PIC X    VALUE SPACES.
050200         10  KEY-PO-NO     PIC X(7) VALUE SPACES.
050300         10  KEY-PO-REL    PIC XXX  VALUE SPACES.
050400         10  KEY-PO-REC    PIC XXX  VALUE SPACES.
050500     05  REPORT-CODE-ARG   PIC XX   VALUE SPACES.
050600     05  CLASS-ARG         PIC X(4)  VALUE SPACES.
050700     05  LEDG-ARG          PIC X(4)  VALUE SPACES.
050800
050900
051000*******************************************************
051100*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
051200*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
051300*   READ ERRORS).                                     *
051400*******************************************************
051500
051600 COPY TBLOWUP IN COPYLIB.
051700
051800******************************************
051900**   PARAMETERS FOR CALLING 'CBLOWSRT'
052000******************************************
052100
052200 COPY CBLOWSRT IN COPYLIB.
052300
052400********************************************************
052500**      C D E S C   P A R A M E T E R S               **
052600********************************************************
052700
052800 COPY CDESC IN COPYLIB.
052900
052400********************************************************
052500**    T D A T E C H K    P A R A M E T E R S          **
052600********************************************************
052700
       COPY TDATECHK IN COPYLIB.

053000********************************************************
053100**    T E R M I N A L    I / O   D A T A   A R E A    **
053200********************************************************
053300
053400 COPY THDPRT     IN COPYLIB.
053500
053600********************************************************
053700**     E S C A P E    S E Q U E N C E   A R E A       **
053800********************************************************
053900
054000 COPY ESCNAM2   IN COPYLIB.
054100 01  ESC-INFO.
054200     05  COMPRESS-PRINT            PIC X(8).
054300     05  NORMAL-PRINT              PIC X(8).
054400
       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

054600 PROCEDURE DIVISION.
054700
054800 001-BEGIN SECTION.
054900
055000 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

      ****** INITIALIZE THE VARIOUS DATABASE BUFFER AREAS IN
      ****** WORKING STORAGE.  ---01NOV91 D A PLUM
           MOVE SPACES TO BUF-MATLACUM.
           MOVE 0      TO MATL-BEG-BAL-DOLLARS
                          MATL-BEG-BAL-UNITS
                          MATL-INV-DOLLARS
                          MATL-RCPT-UNITS
                          MATL-ISSUE-UNITS
                          MATL-RTN-UNITS
                          MATL-ADJ-UNITS
                          MATL-RTN-DOLLARS
                          MATL-RCPT-DOLLARS
                          MATL-UNITS-RCVD-NOT-INV
                          MATL-INV-DOL-NOT-RCVD
                          MATL-UNITS-INV-NOT-RCVD
                          MATL-INTRANSIT-DOLLARS
                          MATL-ACCTG-UNIT-CORR
                          MATL-ACCTG-DOLLAR-CORR
                          MATL-INTRANSIT-UNITS
                          MATL-WDOWN-PERC
                          MATL-TOT-ISS-DOLLARS
                          MATL-TOT-ADJ-DOLLARS
                          MATL-RTNVAL-UNITS
                          MATL-RTNVAL-DOLLARS.
           MOVE SPACES TO BUF-DTRANS.
           MOVE 0      TO TRANS-QTY
                          TRANS-VALUE
                          TRANS-BALANCE-QTY.
           MOVE SPACES TO BUF-MCHTACCTS.
           MOVE SPACES TO BUF-MCLASS.
           MOVE SPACES TO BUF-MREPORT.
           MOVE SPACES TO BUF-MLEDGER.
           MOVE SPACES TO BUF-DPODATAITM.
           MOVE SPACES TO BUF-MSTORERM.
           MOVE 0      TO STR-EOQ
                          STR-REORDER
                          STR-MAX
                          STR-EXPEDITE
                          STR-STD-COST
                          STR-AVG-COST
                          STR-PREV-AVG
                          STR-UM1-CF
                          STR-UM2-CF
                          STR-EST-LT
                          STR-LAST-DLVTIMES (1)
                          STR-LAST-DLVTIMES (2)
                          STR-LAST-DLVTIMES (3)
                          STR-MKT-COST
                          STR-OUT-REPAIR-COST
                          STR-MAINT-REPAIR-COST
                          STR-MTH-FCST
                          STR-ONHAND
                          STR-ONORDER
                          STR-RESERVED
                          STR-RSRV-ONORD
                          STR-LOC-ONHAND (1)
                          STR-LOC-ONHAND (2)
                          STR-LOC-ONHAND (3)
                          STR-LOC-ONHAND (4)
                          STR-LOC-ONHAND (5)
                          STR-LOC-ONHAND (6)
                          STR-TAX-PERCENT
                          STR-SOQ
                          STR-RAW-LOT.
           MOVE SPACES TO BUF-MACCT-INFO.

055400     ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
055500
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.

           OPEN OUTPUT ONLINE-PRT.

           PERFORM 9999-GETFNUM.
056100     MOVE "DHDRPT86.PUB" TO HD-FILE-NAME.
056200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
056300         HD-ROUTE-DATA, ESC-NAME.
056400     IF HD-RET-CODE NOT = 0
056500         MOVE "THDPRT2 ERROR * CHGBYBC" TO BU-DISPLAY-MSG
056600         MOVE "HD-RET-CODE = "     TO BU-DISPLAY-FLD (1)
056700         MOVE HD-RET-CODE          TO BU-DISPLAY-FLD9 (1)
056800         PERFORM 990-BLOWUP.
056900
055600     CALL "TESCSEQ" USING ESC-NAME.
055700     MOVE CHAR-1636PI              TO COMPRESS-PRINT.
055800     MOVE CHAR-10PI                TO NORMAL-PRINT.
055900
057000     IF PAPER-IS-132-COLS
057100       NEXT SENTENCE
057200     ELSE
057300       WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
057400
057500*******************************************************
057600**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
057700**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
057800**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
057900**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
058000**   OCCURS
058100*******************************************************
058200
058300     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
058400                           ACCTG-BASE,
058500                           BU-PGM-NAME,
058600                           STATUS-AREA,
058700                           DUMMY-VIEW-AREA,
058800                           FILE-STATUS,
058900                           BU-DISPLAY-MSG,
059000                           BU-DISPLAY-FLDS.
059100
059200     SORT SORT-FILE ON ASCENDING KEY SORT-BC
059300                                     SORT-REPORT-CODE
059400*                                    SORT-LEDG-CODE
059500                                     SORT-CLASS
059600                                     SORT-ACCT-CHGD
059700                                     SORT-DEPT-CHGD
059800                                     SORT-CODE-OR-PO
059900         INPUT PROCEDURE IS 050-PROCESS-TRANS
060000         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
060100     PERFORM 1000-CLOSE-FILES.
060200     GOBACK.
060300
060400
060500 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
060600     PERFORM 100-BEGIN.
060700     PERFORM 200-PROCESS-DETAIL
060800         UNTIL END-OF-FILE.
060900
061000**********************************************************
061100*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
061200*  FOR SORTING OF RECORDS.                               *
061300**********************************************************
061400
061500     GO TO 699-PROCESS-EXIT.
061600
061700 100-BEGIN.
061800     MOVE SPACES TO BU-DISPLAY-AREA.
           PERFORM 9999-OPEN-STUFF.
063800     MOVE SPACES TO SORT-REC.
063900     MOVE 0 TO SORT-VALUE
064000               SORT-STD-VALUE
064100               SORT-QTY-CHGD.
064200     PERFORM 620-GET-STR-DEPT.
           PERFORM 9999-INIT-DTRANS-MC-I.
064300     PERFORM 400-GET-DTRANS.
064400
064500
064600 200-PROCESS-DETAIL.
064700     IF TRANS-DOCUMENT-NUM = "PROC"
064800         NEXT SENTENCE
064900     ELSE
065000         IF TRANS-CODE-TRANS = "ISS"
065200             PERFORM 500-GET-MMATL-ACCUM
065300             PERFORM 510-GET-LEDGER
065400             PERFORM 520-GET-DESCR
065500             PERFORM 550-GET-MSTORERM
065600             PERFORM 600-BUILD-SORT-REC
065700         ELSE
065000         IF TRANS-CODE = "RET " OR "SADJ" OR "AADJ" OR "RETV"
065200             PERFORM 500-GET-MMATL-ACCUM
065300             PERFORM 510-GET-LEDGER
065400             PERFORM 520-GET-DESCR
065500             PERFORM 550-GET-MSTORERM
065600             PERFORM 600-BUILD-SORT-REC
065700         ELSE
065800             IF TRANS-CODE = "INV" OR "FRT"
065900                 IF TRANS-STORES-CODE = "NON-STR"
066000                     PERFORM 500-GET-MMATL-ACCUM
066100                     PERFORM 510-GET-LEDGER
066200                     PERFORM 520-GET-DESCR
066300                     PERFORM 550-GET-MSTORERM
066400                     PERFORM 600-BUILD-SORT-REC
066500                 ELSE
066600                 IF TRANS-DEPT NOT = MACCT-STR-DEPT
066700                     PERFORM 500-GET-MMATL-ACCUM
066800                     PERFORM 510-GET-LEDGER
066900                     PERFORM 520-GET-DESCR
067000                     PERFORM 550-GET-MSTORERM
067100                     PERFORM 600-BUILD-SORT-REC
067200                 ELSE
067300                     NEXT SENTENCE
067400             ELSE
067500                 NEXT SENTENCE.
067600     PERFORM 400-GET-DTRANS.
067700
067800
067900 400-GET-DTRANS.
068000     ADD 1 TO ENTRIES-READ.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
068800     IF GOOD-CALL
068900         NEXT SENTENCE
069000     ELSE
069100         IF END-OF-FILE
069200             NEXT SENTENCE
069300         ELSE
069400             MOVE "DBGET DTRANS * 400-GET" TO
069500                  BU-DISPLAY-MSG
069600             PERFORM 990-BLOWUP.
069700     MOVE TRANS-STORES-CODE TO MMATL-CODE-ARG.
069800
069900
070000
070100
070200 500-GET-MMATL-ACCUM.
070300     IF MMATL-CODE-ARG = "NON-STR"
070400         PERFORM 505-SET-REPORT-CODE
070500     ELSE
               PERFORM 9999-DBGET7-MMATL-ACCUM-MC-I
071300         IF GOOD-CALL
071400             IF TRANS-ACCT > "009999"
071500                 IF TRANS-CODE = "INV"
071600                     MOVE 06 TO SORT-REPORT-CODE
071700                 ELSE
071800                     MOVE 04 TO SORT-REPORT-CODE
071900             ELSE
072000                 MOVE MATL-REPORT-CODE TO SORT-REPORT-CODE
072100         ELSE
072200             MOVE "DBGET MMATL-ACCUM * 500-GMA" TO BU-DISPLAY-MSG
072300             MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
072400             PERFORM 990-BLOWUP.
072500
072600**********************************************************
072700**  THIS SECTION SETS THE REPORT CODE FOR DIRECT        **
072800**  DELIVERIES THAT ARE NOT CODED.  ALL CODED ITEMS     **
072900**  HAVE A REPORT CODE ATTACHED.                        **
073000**********************************************************
073100
073200 505-SET-REPORT-CODE.
073300*    IF TRANS-CLASS < 200
073400*        MOVE 02 TO SORT-REPORT-CODE
073500*    ELSE
073600*        IF TRANS-CLASS < 344
073700*            MOVE 05 TO SORT-REPORT-CODE
073800*        ELSE
073900*            IF TRANS-CLASS < 400
074000*                MOVE 01 TO SORT-REPORT-CODE
074100*            ELSE
074200*                IF TRANS-CLASS < 500
074300*                    MOVE 02 TO SORT-REPORT-CODE
074400*                ELSE
074500*                    MOVE 01 TO SORT-REPORT-CODE.
      ******************************************************
      *    THE ABOVE LOGIC WAS CHANGED 7/30/97 DUE TO      *
      *    VALLEYFIELD USING CLASS 080 FOR MAJOR SPARE     *
      *    PARTS.....JIM C.                                *
      ******************************************************
068100     IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
068200        (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
068300         MOVE "02"                TO SORT-REPORT-CODE
068400     ELSE
068500     IF (TRANS-CLASS > 199 AND TRANS-CLASS < 344)
068600         MOVE "05"                TO SORT-REPORT-CODE
068700     ELSE
068800     IF (TRANS-CLASS > 343 AND TRANS-CLASS < 400)  OR
068900        (TRANS-CLASS > 499) OR (TRANS-CLASS < 100)
069000         MOVE "01"                TO SORT-REPORT-CODE.
074600     IF TRANS-ACCT = "000000" OR TRANS-ACCT = SPACES
074700         NEXT SENTENCE
074800     ELSE
074900*        IF TRANS-CLASS < 200 OR TRANS-CLASS > 399
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200)
                   OR (TRANS-CLASS > 399)
075000             NEXT SENTENCE
075100         ELSE
075200             IF TRANS-ACCT > "009999"
075300                 MOVE 06 TO SORT-REPORT-CODE
075400             ELSE
075500                 IF TRANS-ACCT = "000951"
075600                     MOVE 02 TO SORT-REPORT-CODE
075700                 ELSE
075800                     IF TRANS-ACCT < "000100"
075900                         OR TRANS-ACCT = "000251" OR
076000                            "000252" OR "000253" OR "000250"
                                  OR TRANS-ACCT = "000254"
076100                               OR "000891" OR "000892"
076200                             MOVE 05 TO SORT-REPORT-CODE
076300                     ELSE
076400                         MOVE 01 TO SORT-REPORT-CODE.
076500
076600
076700 510-GET-LEDGER.
076800     MOVE TRANS-DEPT TO DEPT-KEY.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
077600     IF GOOD-CALL
077700         NEXT SENTENCE
077800     ELSE
077900         MOVE "DBGET MCHT-ACCTS * 510-GL" TO BU-DISPLAY-MSG
078000         MOVE DEPT-KEY TO BU-DISPLAY-FLD (1)
               MOVE TRANS-STORES-CODE TO BU-DISPLAY-FLD (2)
               MOVE TRANS-DATE        TO BU-DISPLAY-FLD (3)
               MOVE TRANS-TIME        TO BU-DISPLAY-FLD (4)
               MOVE TRANS-CODE        TO BU-DISPLAY-FLD (5)
078100         PERFORM 990-BLOWUP.
078200
078300     MOVE MCHT-BC      TO SORT-BC.
078400     MOVE MCHT-LEDGERT TO SORT-LEDG-CODE.
078500
078600 520-GET-DESCR.
078700     IF TRANS-STORES-CODE = "NON-STR"
078800         PERFORM 530-GET-PO-DESCR
078900     ELSE
079000         IF MMATL-FST4 = "ACCR"
079100             MOVE "WRITEDOWN" TO SORT-DESCR
079200         ELSE
079300             MOVE "01"            TO CDESC-LINES-TO-GET
079400             MOVE "N"             TO CDESC-LOCAL-DESC-OPTION
079500             CALL "CDESC" USING CDESC-RET-CODE
079600                                STORES-BASE
079700                                STATUS-AREA
079800                                BU-DISPLAY-MSG
079900                                TRANS-STORES-CODE
080000                                CDESC-DATA
080100             MOVE CDESC (1)       TO SORT-DESCR.
080200
080300 530-GET-PO-DESCR.
080400     MOVE "P" TO KEY-REC-ID.
080500     MOVE TRANS-ORDER-NUM TO KEY-PO-NO.
080600     MOVE TRANS-RELEASE TO KEY-PO-REL.
080700     MOVE "000" TO KEY-PO-REC.
           PERFORM 9999-DBFIND-DPODATAITM-PO-I.
081400     IF GOOD-CALL
081500         PERFORM 540-CONT-DESCR UNTIL ITEM-FOUND = 1
081600                    OR END-OF-CHAIN
081700         MOVE 0 TO ITEM-FOUND
081800     ELSE
081900         IF NO-ENTRY
082000              DISPLAY "NO FIND FOR PO NUM " PO-KEY-ARG
082100         ELSE
082200              MOVE "DBFIND PODATAITM * 530-GPD"
082300                   TO BU-DISPLAY-MSG
082400              PERFORM 990-BLOWUP.
082500
082600 540-CONT-DESCR.
           PERFORM 9999-DBGET5-DPODATAITM-PO-I.
083400     IF GOOD-CALL
083500         IF TRANS-ITEM-NUM = DATAITM-ITEM-NO
083600             IF DATAITM-LINE-NO = "01"
083700                 MOVE DATAITM-INFO TO SORT-DESCR
083800                 MOVE 1 TO ITEM-FOUND
083900             ELSE
084000                 NEXT SENTENCE
084100         ELSE
084200             NEXT SENTENCE
084300     ELSE
084400         IF END-OF-CHAIN
084500             MOVE SPACES TO SORT-DESCR
084600         ELSE
084700             MOVE "DBGET PODATAITM * 540-CD" TO BU-DISPLAY-MSG
084800             PERFORM 990-BLOWUP.
084900
085000 550-GET-MSTORERM.
085100     IF MMATL-CODE-ARG = "NON-STR" OR MMATL-FST4 = "ACCR"
085200         NEXT SENTENCE
085300     ELSE
               PERFORM 9999-DBGET7-MSTORERM-CD-I
086100         IF GOOD-CALL
086200             NEXT SENTENCE
086300         ELSE
086400             IF NO-ENTRY
086500                  MOVE 0 TO STR-STD-COST
086600             ELSE
086700                 MOVE "DBGET MSTORE * 550-GM" TO BU-DISPLAY-MSG
086800                 MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
086900                 PERFORM 990-BLOWUP.
087000
087100 600-BUILD-SORT-REC.
087200     MOVE TRANS-DEPT              TO SORT-DEPT-CHGD.
087300     MOVE TRANS-ACCT              TO SORT-ACCT-CHGD.
087400     MOVE TRANS-CLASS             TO SORT-CLASS.
087500     IF TRANS-STORES-CODE = "NON-STR"
087600         MOVE TRANS-ORDER-NUM     TO SORT-CODE-OR-PO
087700         MOVE TRANS-RELEASE       TO SORT-PO-RLS
087800         MOVE TRANS-ITEM-NUM      TO SORT-PO-ITEM
087900     ELSE
088000         MOVE TRANS-STORES-CODE   TO SORT-CODE-OR-PO
088100         MOVE SPACES              TO SORT-PO-RLS
088200                                     SORT-PO-ITEM.
088300     MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEAS.
088400     IF TRANS-STORES-CODE = "2641544" AND
088500          TRANS-ACCT = "000042"
088600             MOVE 05              TO SORT-REPORT-CODE.
088700     MOVE MCHT-DEPT-TYPE          TO SORT-DEPT-TYPE.
088800     IF MCHT-DEPT-TYPE = "MS" OR "MU" OR "MW"
088900*        IF TRANS-CLASS > 199 AND TRANS-CLASS < 400
               IF (TRANS-CLASS > 199 AND TRANS-CLASS < 400)
089000             MOVE 01              TO SORT-REPORT-CODE
089100         ELSE
089200             NEXT SENTENCE
089300     ELSE
089400         NEXT SENTENCE.
089500     IF TRANS-CODE = "INV"
089600         MOVE "DCHG"              TO SORT-TRANS-TYPE
089700     ELSE
089800         MOVE TRANS-CODE          TO SORT-TRANS-TYPE.
089900     IF TRANS-CODE = "RET" OR "RETV" OR "SADJ" OR "AADJ"
090000         COMPUTE SORT-QTY-CHGD = TRANS-QTY * -1
090100         COMPUTE SORT-VALUE = TRANS-VALUE * -1
090200     ELSE
090300         MOVE TRANS-QTY           TO SORT-QTY-CHGD
090400         MOVE TRANS-VALUE         TO SORT-VALUE.
090500     IF MCHT-DEPT-TYPE = "PR"
090600*        IF (TRANS-CLASS < 200) OR (TRANS-CLASS > 399
090700*          AND TRANS-CLASS < 500)
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200)
                   OR (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
090800               IF TRANS-STORES-CODE = "NON-STR"
090900                   MOVE SORT-VALUE TO SORT-STD-VALUE
091000               ELSE
091100                   IF STR-STD-COST = 0
091200                       MOVE 0      TO SORT-STD-VALUE
091300                   ELSE
091400                       MOVE SORT-VALUE TO SORT-STD-VALUE
091500                       COMPUTE SORT-VALUE =
091600                           SORT-QTY-CHGD * STR-AVG-COST
091700         ELSE
091800             MOVE 0                TO SORT-STD-VALUE
091900     ELSE
092000         MOVE 0                    TO SORT-STD-VALUE.
092100     IF TRANS-VALUE = 0
092200         MOVE 0                    TO SORT-STD-VALUE.
092300     IF SORT-REPORT-CODE = 02
092400         IF STR-STD-COST = 0
092500             IF SORT-LEDG < 07
092600                 MOVE 0            TO SORT-STD-VALUE
092700             ELSE
092800                 MOVE SORT-VALUE   TO SORT-STD-VALUE.
092900
093000     RELEASE SORT-REC.
093100     MOVE SPACES                   TO SORT-REC.
093200     MOVE 0                        TO SORT-QTY-CHGD
093300                                      SORT-VALUE
093400                                      SORT-STD-VALUE.
093500
093600
093700 620-GET-STR-DEPT.
093800     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
094600     IF GOOD-CALL
094700         NEXT SENTENCE
094800     ELSE
094900         MOVE "DBGET MACCOUNT-INFO * 620-GSD" TO BU-DISPLAY-MSG
095000         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
095100         PERFORM 990-BLOWUP.
095200
095300
095400 699-PROCESS-EXIT.
095500     EXIT.
095600
095700 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
095800     DISPLAY "BEGIN REPORT".
095900     PERFORM 710-BEGIN-REPORT.
096000     PERFORM 705-PROCESS-BC
096100        UNTIL NO-MORE-SORT = "YES".
096200     PERFORM 711-END-REPORT.
096300
096400**************************************************
096500**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
096600**  TO COMPLETE PROCESSING OF REPORT            **
096700**************************************************
096800
096900     GO TO 799-CREATE-EXIT.
097000
097100 710-BEGIN-REPORT.
097200     RETURN SORT-FILE
097300        AT END
097400            MOVE "YES" TO NO-MORE-SORT.
097500
097600 711-END-REPORT.
097700     MOVE GRAND-ACTUAL TO GRAND-ACTUAL-PRT.
097800     MOVE GRAND-STANDARD TO GRAND-STANDARD-PRT.
097900     MOVE GRAND-VARIANCE TO GRAND-VARIANCE-PRT.
098000     MOVE GRAND-QTY TO GRAND-QTY-PRT.
098100     WRITE PRT-REC FROM GRAND-LINE AFTER ADVANCING 2.
098200     IF NO-ACTUAL-VALUE-SW = "Y"
098300         WRITE PRT-REC FROM ASTERICK-LINE AFTER ADVANCING 3
098400         WRITE PRT-REC FROM ERROR-MSG-LINE1 AFTER ADVANCING 1
098500         WRITE PRT-REC FROM ERROR-MSG-LINE2 AFTER ADVANCING 1
098600         WRITE PRT-REC FROM ERROR-MSG-LINE3 AFTER ADVANCING 1
098700         WRITE PRT-REC FROM ERROR-MSG-LINE4 AFTER ADVANCING 1
098800         WRITE PRT-REC FROM ERROR-MSG-LINE5 AFTER ADVANCING 1
098900         WRITE PRT-REC FROM ERROR-MSG-LINE6 AFTER ADVANCING 1
099000         WRITE PRT-REC FROM ASTERICK-LINE AFTER ADVANCING 1.
099100
099200 705-PROCESS-BC.
099300     PERFORM 706-BEGIN-BC.
099400     PERFORM 720-PROCESS-VOUCHER
099500         UNTIL SORT-BC NOT = PREV-BC
099600             OR NO-MORE-SORT = "YES".
099700     PERFORM 708-BC-END.
099800
099900 706-BEGIN-BC.
100000     MOVE 0  TO BC-ACTUAL
100100                BC-QTY
100200                BC-STANDARD
100300                BC-VARIANCE.
100400     MOVE SORT-BC TO PREV-BC, BC-OUT.
100500
100600 708-BC-END.
100700     MOVE PREV-BC                  TO BC-TRLR.
100800     MOVE BC-ACTUAL                TO BC-ACTUAL-PRT.
100900     MOVE BC-STANDARD              TO BC-STANDARD-PRT.
101000     MOVE BC-VARIANCE              TO BC-VARIANCE-PRT.
101100     MOVE BC-QTY                   TO BC-QTY-PRT.
101200     ADD  BC-ACTUAL                TO GRAND-ACTUAL.
101300     ADD  BC-STANDARD              TO GRAND-STANDARD.
101400     ADD  BC-VARIANCE              TO GRAND-VARIANCE.
101500     ADD  BC-QTY                   TO GRAND-QTY.
101600     WRITE PRT-REC FROM BC-LINE AFTER ADVANCING 2 LINES.
101700
101800 720-PROCESS-VOUCHER.
101900     PERFORM 721-BEGIN-VOUCHER.
102000     PERFORM 722-PROCESS-LEDGER
102100         UNTIL SORT-BC NOT = PREV-BC
102200           OR  SORT-REPORT-CODE NOT = PREV-REPORT-CODE
102300             OR NO-MORE-SORT = "YES".
102400     PERFORM 723-VOUCHER-END.
102500
102600 721-BEGIN-VOUCHER.
102700     MOVE 0 TO VOUCHER-ACTUAL
102800               VOUCHER-QTY
102900               VOUCHER-STANDARD
103000               VOUCHER-VARIANCE.
103100     MOVE SORT-REPORT-CODE TO PREV-REPORT-CODE.
103200     MOVE SORT-REPORT-CODE TO REPORT-CODE-ARG.
           PERFORM 9999-DBGET7-MREPORT-RC-I.
104000     IF GOOD-CALL
104100         MOVE MREPORT-DESC        TO REPORT-DESCR-HDG
104200     ELSE
104300         IF NO-ENTRY
104400             DISPLAY "NO ENTRY IN REPORT CODE MASTER FOR "
104500                          SORT-REPORT-CODE
104600             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
104700             MOVE SPACES          TO REPORT-DESCR-HDG
104800         ELSE
104900             MOVE "DBGET MREPORT * 706-BBC" TO BU-DISPLAY-MSG
105000             PERFORM 990-BLOWUP.
105100
105200     IF SORT-BC = PREV-BC
105300         PERFORM 750-PRINT-HEADINGS.
105400
105500 722-PROCESS-LEDGER.
105600*    PERFORM 724-LEDGER-BEGIN.
105700     PERFORM 728-CLASS-PROCESS
105800         UNTIL SORT-BC NOT = PREV-BC
105900*          OR  SORT-LEDG NOT = PREV-LEDGER
106000             OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
106100                  OR NO-MORE-SORT = "YES".
106200*    PERFORM 726-LEDGER-END.
106300
106400 723-VOUCHER-END.
106500     MOVE PREV-REPORT-CODE TO REPORT-CODE-TRLR.
106600     MOVE MREPORT-DESC     TO REPORT-TRAILER.
106700     MOVE VOUCHER-ACTUAL   TO VOUCHER-ACTUAL-PRT.
106800     MOVE VOUCHER-STANDARD TO VOUCHER-STANDARD-PRT.
106900     MOVE VOUCHER-VARIANCE TO VOUCHER-VARIANCE-PRT.
107000     MOVE VOUCHER-QTY TO VOUCHER-QTY-PRT.
107100     ADD  VOUCHER-ACTUAL   TO BC-ACTUAL.
107200     ADD  VOUCHER-STANDARD TO BC-STANDARD.
107300     ADD  VOUCHER-VARIANCE TO BC-VARIANCE.
107400     ADD  VOUCHER-QTY      TO BC-QTY.
107500     WRITE PRT-REC FROM VOUCHER-LINE AFTER ADVANCING 2 LINES.
107600
107700 724-LEDGER-BEGIN.
107800     MOVE 0 TO LEDGER-ACTUAL
107900               LEDGER-QTY
108000               LEDGER-STANDARD
108100               LEDGER-VARIANCE.
108200     MOVE SORT-LEDG TO PREV-LEDGER.
108300
108400 725-PROCESS-DEPT.
108500     PERFORM 727-DEPT-BEGIN.
108600     PERFORM 728-CLASS-PROCESS
108700         UNTIL SORT-DEPT-CHGD NOT = PREV-DEPT
108800            OR SORT-LEDG NOT = PREV-LEDGER
108900              OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
109000                 OR SORT-BC NOT = PREV-BC
109100                  OR NO-MORE-SORT = "YES".
109200     PERFORM 729-DEPT-END.
109300
109400 726-LEDGER-END.
109500     MOVE PREV-LEDGER TO LEDG-ARG
109600                        LEDG-CODE-TRLR.
           PERFORM 9999-DBGET7-MLEDGER-LD-I.
110400     IF GOOD-CALL
110500         NEXT SENTENCE
110600     ELSE
110700         IF NO-ENTRY
110800             DISPLAY "NO ENTRY IN LEDGER MASTER FOR "
110900                    PREV-LEDGER
111000             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
111100             MOVE "NO LEDGER ENTRY IN LEDGER MASTER"
111200                 TO MLEDGER-DESCR
111300         ELSE
111400             MOVE "DBGET MLEDGER * 726-LE" TO BU-DISPLAY-MSG
111500             PERFORM 990-BLOWUP.

111600     MOVE MLEDGER-DESCR TO LEDGER-TRAILER.
111700     MOVE LEDGER-ACTUAL TO LEDGER-ACTUAL-PRT.
111800     MOVE LEDGER-STANDARD TO LEDGER-STANDARD-PRT.
111900     MOVE LEDGER-VARIANCE TO LEDGER-VARIANCE-PRT.
112000     MOVE LEDGER-QTY TO LEDGER-QTY-PRT.
112100     ADD LEDGER-QTY TO VOUCHER-QTY.
112200     ADD LEDGER-ACTUAL TO VOUCHER-ACTUAL.
112300     ADD LEDGER-STANDARD TO VOUCHER-STANDARD.
112400     ADD LEDGER-VARIANCE TO VOUCHER-VARIANCE.
112500     WRITE PRT-REC FROM LEDGER-LINE AFTER ADVANCING 2.
112600     IF SORT-BC = PREV-BC AND
112700         SORT-REPORT-CODE = PREV-REPORT-CODE
112800         PERFORM 750-PRINT-HEADINGS
112900     ELSE
113000         ADD 2 TO LINE-CNT.
113100
113200 727-DEPT-BEGIN.
113300     MOVE 0 TO DEPT-ACTUAL
113400               DEPT-QTY
113500               DEPT-STANDARD
113600               DEPT-VARIANCE.
113700     MOVE SORT-DEPT-CHGD TO PREV-DEPT.
113800
113900 728-CLASS-PROCESS.
114000     IF SORT-REPORT-CODE = 04
114100         PERFORM 730-NWO-BEGIN
114200         PERFORM 731-DEPT-ACCT-PROCESS
114300            UNTIL SORT-ACCT-CHGD NOT = PREV-NWO
114400*               OR SORT-DEPT-CHGD NOT = PREV-DEPT
114500*                  OR SORT-LEDG NOT = PREV-LEDGER
114600                       OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
114700                        OR SORT-BC NOT = PREV-BC
114800                         OR NO-MORE-SORT = "YES"
114900         PERFORM 732-NWO-END
115000     ELSE
115100         PERFORM 730-CLASS-BEGIN
115200         PERFORM 731-DEPT-ACCT-PROCESS
115300             UNTIL SORT-CLASS NOT = PREV-CLASS
115400*               OR SORT-DEPT-CHGD NOT = PREV-DEPT
115500*                    OR SORT-LEDG NOT = PREV-LEDGER
115600                      OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
115700                         OR NO-MORE-SORT = "YES"
115800         PERFORM 733-EXPENSE-CLASS
115900         PERFORM 732-CLASS-END.

116000 729-DEPT-END.
116100     MOVE PREV-DEPT TO DEPT-KEY
116200                        DEPT-CODE-TRLR.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
117000     IF GOOD-CALL
117100         NEXT SENTENCE
117200     ELSE
117300         IF NO-ENTRY
117400             DISPLAY "NO ENTRY IN MCHT-ACCTS FOR "
117500                    PREV-DEPT
117600             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
117700             MOVE "NO DEPT ENTRY IN MCHG-ACCTS"
117800                 TO MCHT-DESC
117900         ELSE
118000             MOVE "DBGET MDEPT * 729-DE" TO BU-DISPLAY-MSG
118100             PERFORM 990-BLOWUP.
118200
118300     MOVE MCHT-DESC TO DEPT-TRAILER.
118400     MOVE DEPT-ACTUAL TO DEPT-ACT-PRT.
118500     MOVE DEPT-STANDARD TO DEPT-STD-PRT.
118600     MOVE DEPT-VARIANCE TO DEPT-VAR-PRT.
118700     MOVE DEPT-QTY TO DEPT-QTY-PRT.
118800     ADD DEPT-QTY TO LEDGER-QTY.
118900     ADD DEPT-ACTUAL TO LEDGER-ACTUAL.
119000     ADD DEPT-STANDARD TO LEDGER-STANDARD.
119100     ADD DEPT-VARIANCE TO LEDGER-VARIANCE.
119200     WRITE PRT-REC FROM DEPT-LINE AFTER ADVANCING 2.
119300     IF SORT-BC = PREV-BC AND
119400         SORT-LEDG = PREV-LEDGER AND
119500         SORT-REPORT-CODE = PREV-REPORT-CODE
119600         PERFORM 750-PRINT-HEADINGS
119700     ELSE
119800         ADD 2 TO LINE-CNT.
119900
120000 730-CLASS-BEGIN.
120100     MOVE 0 TO CLASS-ACTUAL, ACT-ACTUAL
120200               CLASS-QTY, ACT-QTY
120300               CLASS-STANDARD, ACT-STANDARD
120400               CLASS-VARIANCE, ACT-VARIANCE.
120500     MOVE SORT-CLASS TO PREV-CLASS.
120600     MOVE SORT-ACCT-CHGD TO PREV-ACT.
120700
120800 730-NWO-BEGIN.
120900     MOVE 0                       TO NWO-ACTUAL
121000                                     NWO-QTY
121100                                     NWO-STANDARD
121200                                     NWO-VARIANCE.
121300     MOVE SORT-ACCT-CHGD          TO PREV-NWO.
121400
121500
121600 731-DEPT-ACCT-PROCESS.
121700     IF SORT-REPORT-CODE NOT = 4
121800         IF SORT-ACCT-CHGD NOT = PREV-ACT
121900             PERFORM 733-EXPENSE-CLASS.
122000
122100*    MOVE SORT-LEDG               TO PRT-LEDGER.
122200*    MOVE SORT-DEPT-CHGD          TO PRT-DEPT.
122300*    MOVE "-"                     TO PRT-HYPHEN.
122400*    MOVE SORT-ACCT-CHGD          TO PRT-ACCOUNT.
122500*    MOVE SORT-CLASS              TO PRT-CLASS.
122600*    MOVE "-"                     TO PRT-HYPHEN2.
122700*    MOVE SORT-CODE-OR-PO         TO PRT-CODE-OR-PO.
122800*    MOVE SORT-PO-RLS             TO PRT-RLS.
122900*    MOVE SORT-PO-ITEM            TO PRT-ITEM.
123000*    MOVE SORT-TRANS-TYPE         TO PRT-TRANS-CODE.
123100*    MOVE SORT-DESCR              TO PRT-DESCR.
123200*    MOVE SORT-QTY-CHGD           TO PRT-QTY.
123300*    IF SORT-DEPT-TYPE1 = "V"
123400*        MOVE SORT-VALUE          TO HOLD-VAR
123500*        MOVE 0                   TO SORT-STD-VALUE
123600*    ELSE
123700*        IF SORT-STD-VALUE NOT = 0
123800*            COMPUTE HOLD-VAR = SORT-VALUE - SORT-STD-VALUE
123900*        ELSE
124000*            MOVE 0               TO HOLD-VAR.
124100*    MOVE SORT-VALUE              TO PRT-ACTUAL.
124200*    MOVE SORT-STD-VALUE          TO PRT-STD.
124300*    MOVE SORT-UNIT-MEAS          TO PRT-UM.
124400*    MOVE HOLD-VAR                TO PRT-VAR.

124500     IF SORT-REPORT-CODE = 04
124600         ADD SORT-VALUE           TO NWO-ACTUAL,
124700                                     VOUCHER-ACTUAL
124800         ADD SORT-STD-VALUE       TO NWO-STANDARD,
124900                                     VOUCHER-STANDARD
125000         ADD HOLD-VAR             TO NWO-VARIANCE,
125100                                     VOUCHER-VARIANCE
125200         ADD SORT-QTY-CHGD        TO NWO-QTY,
125300                                     VOUCHER-QTY
125400     ELSE
125500         ADD SORT-VALUE           TO CLASS-ACTUAL, ACT-ACTUAL,
125600                                     VOUCHER-ACTUAL
125700         ADD SORT-STD-VALUE       TO CLASS-STANDARD, ACT-STANDARD,
125800                                     VOUCHER-STANDARD
125900         ADD SORT-QTY-CHGD        TO CLASS-QTY, ACT-QTY,
126000                                     VOUCHER-QTY
126100         ADD HOLD-VAR             TO CLASS-VARIANCE, ACT-VARIANCE,
126200                                     VOUCHER-VARIANCE.

126300**   WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
126400**   ADD 1                        TO LINE-CNT.
126500**
126600**   IF SORT-VALUE = ZEROS
126700**       MOVE "Y"                 TO NO-ACTUAL-VALUE-SW
126800**       ADD 1                    TO LINE-CNT
126900**       WRITE PRT-REC FROM NO-ACTUAL-ERROR-LINE
127000**           AFTER ADVANCING 1.
127100**
127200**   IF LINE-CNT > 55
127300**       PERFORM 750-PRINT-HEADINGS.
127400**   MOVE SPACES                  TO PRT-REC
127500**                                   DETAIL-LINE.
127600     RETURN SORT-FILE
127700        AT END
127800            MOVE "YES"            TO NO-MORE-SORT.
127900
128000 732-CLASS-END.
128100     MOVE PREV-CLASS TO CLASS-ARG
128200                        CLASS-CODE-TRLR.
           PERFORM 9999-DBGET7-MCLASS-CL-I.
129000     IF GOOD-CALL
129100         NEXT SENTENCE
129200     ELSE
129300         IF NO-ENTRY
129400             MOVE SPACES TO CLASS-TRAILER
129500         ELSE
129600             MOVE "DBGET MCLASS * 732-CE" TO BU-DISPLAY-MSG
129700             MOVE CLASS-ARG       TO BU-DISPLAY-FLD (1)
129800             PERFORM 990-BLOWUP.

129900     MOVE MCLASS-CLASS-DESCR TO CLASS-TRAILER.
130000     MOVE CLASS-ACTUAL TO CLASS-ACT-PRT.
130100     MOVE CLASS-STANDARD TO CLASS-STD-PRT.
130200     MOVE CLASS-VARIANCE TO CLASS-VAR-PRT.
130300     MOVE CLASS-QTY TO CLASS-QTY-PRT.
130400*    ADD CLASS-QTY TO DEPT-QTY.
130500*    ADD CLASS-ACTUAL TO DEPT-ACTUAL.
130600*    ADD CLASS-STANDARD TO DEPT-STANDARD.
130700*    ADD CLASS-VARIANCE TO DEPT-VARIANCE.
130800*    IF SORT-DEPT-CHGD NOT = PREV-DEPT
130900*        WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2
131000*        ADD 2 TO LINE-CNT
131100*    ELSE
131200     WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2.
131300     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
131400     ADD 4 TO LINE-CNT.
131500
131600 732-NWO-END.
131700     MOVE PREV-NWO TO NWO-TRLR.
131800     MOVE NWO-ACTUAL TO NWO-ACT-PRT.
131900     MOVE NWO-STANDARD TO NWO-STD-PRT.
132000     MOVE NWO-VARIANCE TO NWO-VAR-PRT.
132100     MOVE NWO-QTY TO NWO-QTY-PRT.
132200*    ADD NWO-QTY TO DEPT-QTY.
132300*    ADD NWO-ACTUAL TO DEPT-ACTUAL.
132400*    ADD NWO-STANDARD TO DEPT-STANDARD.
132500*    ADD NWO-VARIANCE TO DEPT-VARIANCE.
132600     WRITE PRT-REC FROM NWO-LINE AFTER ADVANCING 2.
132700     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
132800     ADD 4 TO LINE-CNT.
132900
133000 733-EXPENSE-CLASS.
133100     MOVE PREV-ACT TO ACT-TRLR.
133200     MOVE ACT-ACTUAL TO ACT-ACT-PRT.
133300     MOVE ACT-STANDARD TO ACT-STD-PRT.
133400     MOVE ACT-VARIANCE TO ACT-VAR-PRT.
133500     MOVE ACT-QTY TO ACT-QTY-PRT.
133600*    ADD NWO-QTY TO DEPT-QTY.
133700*    ADD NWO-ACTUAL TO DEPT-ACTUAL.
133800*    ADD NWO-STANDARD TO DEPT-STANDARD.
133900*    ADD NWO-VARIANCE TO DEPT-VARIANCE.
134000     WRITE PRT-REC FROM ACT-LINE AFTER ADVANCING 2.
134100     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
134200     ADD 4 TO LINE-CNT.
134300     MOVE 0 TO ACT-ACTUAL, ACT-QTY, ACT-STANDARD,
134400                       ACT-VARIANCE.
134500     MOVE SORT-ACCT-CHGD TO PREV-ACT.
134600
134700 750-PRINT-HEADINGS.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
134800*****MOVE CURRENT-DATE TO DATE-H1.
           MOVE DATE-SLASH-OUT TO DATE-H1.
134900*****MOVE TIME-OF-DAY TO TIME-DIV.
           MOVE DATE-UNFORMATTED-TIME-OUT TO TIME-DIV.
135000     MOVE HH-DIV TO HH-H2.
135100     MOVE MM-DIV TO MM-H2.
135200     MOVE SS-DIV TO SS-H2.
135300     MOVE "MY" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
136100     IF GOOD-CALL
136200         NEXT SENTENCE
136300     ELSE
136400         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO BU-DISPLAY-MSG
136500         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
136600         PERFORM 990-BLOWUP.

136700     MOVE MACCT-MONTH TO MONTH-PARM.
136800     MOVE MACCT-YEAR TO YEAR-PARM.
136900     MOVE MONTH-T (MONTH-PARM) TO MONTH-H3.
137000     MOVE YEAR-PARM TO YEAR-H3B.
137100     ADD 1 TO PAGE-CNT.
137200     MOVE PAGE-CNT TO PAGE-H2.
137300     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
137400     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
137500     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
137600     WRITE PRT-REC FROM BC-HDG  AFTER ADVANCING 2.
137700     WRITE PRT-REC FROM REPORT-HDG AFTER ADVANCING 1.
137800     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
137900     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
138000     MOVE 8 TO LINE-CNT.
138100
138200
138300 799-CREATE-EXIT.
138400     EXIT.
138500
138600 900-ERROR SECTION.
138700
138800 990-BLOWUP.
138900     MOVE "TCHBYBC2"              TO  BU-PGM-NAME.
139000
139100***************************************************************
139200**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
139300**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
139400**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
139500**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
139600**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
139700**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
139800**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
139900**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
140000**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
140100**   PROBLEM IS AVOIDED.                                     **
140200***************************************************************
140300
140400     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
140500                           ACCTG-BASE,
140600                           BU-PGM-NAME,
140700                           STATUS-AREA,
140800                           DUMMY-VIEW-AREA,
140900                           FILE-STATUS,
141000                           BU-DISPLAY-MSG,
141100                           BU-DISPLAY-FLDS.
141200
141300
141400 1000-CLOSE-FILES.
141500     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
141600     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-ROUTINES SECTION.
       COPY OVRPFCALL IN COPYLIB.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           READ MMATL-ACCUM-MC-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-KEY TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-KEY-ARG TO PORCVNO OF DPODATAITM-PO-REC-I.
           START DPODATAITM-PO-I KEY = PORCVNO OF DPODATAITM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-PO-I NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPODATAITM-PO-REC-I NOT = PO-KEY-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MREPORT-RC-I.
           MOVE 0 TO COND-WORD.
           MOVE REPORT-CODE-ARG TO RPTCODE OF MREPORT-RC-REC-I.
           READ MREPORT-RC-I INTO BUF-MREPORT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MLEDGER-LD-I.
           MOVE 0 TO COND-WORD.
           MOVE LEDG-ARG TO LEDGER OF MLEDGER-LD-REC-I.
           READ MLEDGER-LD-I INTO BUF-MLEDGER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-GETFNUM.
      *------ IBM OVERRIDES THE PRINT FILE *SHR BEFORE THE OPEN,
      *------ THUS DOES NOT USE THIS CALL WHICH OCCURS AFTER THE
      *------ OPEN.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN INPUT DPODATAITM-PO-I      .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT MREPORT-RC-I         .
           OPEN INPUT MLEDGER-LD-I         .
           OPEN INPUT MCLASS-CL-I          .

       9999-CLOSE-STUFF.
           CLOSE      DTRANS-MC-I          .
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      DPODATAITM-PO-I      .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      MREPORT-RC-I         .
           CLOSE      MLEDGER-LD-I         .
           CLOSE      MCLASS-CL-I          .
