000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TCHGBYBC.
000400 AUTHOR.               A. TREUDLER.
000500 DATE-WRITTEN.         MAY 2, 1988.
000600 DATE-COMPILED.
000700*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000800
000900*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
001000*                      DETAIL TRANSACTION DATA SET
001100*                      AND FIND ALL ISS, ADJ, RET, RETV AND
001200*                      DCHG TRANSACTIONS AND SORT AND PRINT THEM
001300*                      IN REPORT CODE, LEDGER CODE, DEPT, CLASS,
001400*                      AND DEPT/ACCOUNT ORDER.
001500
      * 14JUN90 DAP - EXPANDED BLOWUP MESSAGE IN 510-GET-LEDGER
      *               TO GIVE MORE INFORMATION.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   11SEP1995    DAVE PLUM
      *C     ADDED LOGIC TO MOVE ZERO TO FIELD "STR-STD-COST" WHEN
      *C     PROCESSING A TRANSACTION FOR CODE "NON-STR".  THIS
      *C     CHANGE SHOULD PREVENT A DATA DECIMAL ERROR WHICH HAS
      *C     OCCURRED IN PARAGRAPH "600-BUILD-SORT-REC", STATEMENT
      *C     "IF STR-STD-COST = 0".
      *C
      *C    09/03/96    CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.

001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.      HP-3000.
001900 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002200
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-PO-I
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREPORT-RC-I
               ASSIGN TO DATABASE-MCFLCA0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MLEDGER-LD-I
               ASSIGN TO DATABASE-MCFLCA0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

002700
002800 DATA DIVISION.
002900
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  DPODATAITM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-PO-REC-I.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MREPORT-RC-I
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-RC-REC-I.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.

       FD  MLEDGER-LD-I
           LABEL RECORDS ARE STANDARD.
       01  MLEDGER-LD-REC-I.
           COPY DDS-MCRPCA0500  OF MCFLCA0501.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
003100
003200 FD  ONLINE-PRT
003300     DATA RECORD IS PRT-REC
003400     RECORD CONTAINS 133 CHARACTERS
003500     LABEL RECORDS ARE OMITTED.
003600
003700 01  PRT-REC                       PIC X(133).
003800
003900 SD  SORT-FILE
004000     DATA RECORD IS SORT-REC
004100     RECORD CONTAINS 145 CHARACTERS.
004200
004300 01  SORT-REC.
004400     05  SORT-BC                   PIC X(4).
004500     05  SORT-REPORT-CODE          PIC X(2).
004600     05  SORT-LEDG-CODE.
004700         10  SORT-LEDG             PIC XX.
004800         10  SORT-DIV              PIC XX.
004900     05  SORT-DEPT-ACCT.
005000         10  SORT-DEPT-CHGD        PIC X(6).
005100         10  SORT-ACCT-CHGD        PIC X(6).
005200     05  SORT-CLASS                PIC X(3).
005300     05  SORT-CODE-OR-PO           PIC X(7).
005400     05  SORT-UNIT-MEAS            PIC XX.
005500     05  SORT-TRANS-TYPE           PIC X(4).
005600     05  SORT-DESCR                PIC X(60).
005700     05  SORT-QTY-CHGD             PIC S9(10).
005800     05  SORT-VALUE                PIC S9(12)V99.
005900     05  SORT-STD-VALUE            PIC S9(12)V99.
006000     05  SORT-PO-RLS               PIC X(3).
006100     05  SORT-PO-ITEM              PIC X(4).
006200     05  SORT-DEPT-TYPE.
006300         10  SORT-DEPT-TYPE1       PIC X.
006400         10  SORT-DEPT-TYPE2       PIC X.
006500
006600 WORKING-STORAGE SECTION.
006700
006800 77  ENTRIES-READ                  PIC 9(6)   VALUE 0.
006900 77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
007000 77  LINE-CNT                      PIC 99     VALUE 0.
007100 77  PAGE-CNT                      PIC 9(4)    VALUE 0.
       77  PRINT-FILE-CTR                PIC 9(4)    VALUE 0.
007200*********************************************************
007300 77  GRAND-ACTUAL                  PIC S9(12)V99  VALUE 0.
007400 77  GRAND-STANDARD                PIC S9(12)V99  VALUE 0.
007500 77  GRAND-VARIANCE                PIC S9(12)V99  VALUE 0.
007600 77  GRAND-QTY                     PIC S9(10)     VALUE 0.
007700*********************************************************
007800 77  BC-ACTUAL                     PIC S9(12)V99  VALUE 0.
007900 77  BC-STANDARD                   PIC S9(12)V99  VALUE 0.
008000 77  BC-VARIANCE                   PIC S9(12)V99  VALUE 0.
008100 77  BC-QTY                        PIC S9(10)     VALUE 0.
008200*********************************************************
008300 77  VOUCHER-ACTUAL                PIC S9(12)V99  VALUE 0.
008400 77  VOUCHER-STANDARD              PIC S9(12)V99  VALUE 0.
008500 77  VOUCHER-VARIANCE              PIC S9(12)V99  VALUE 0.
008600 77  VOUCHER-QTY                   PIC S9(10)     VALUE 0.
008700*********************************************************
008800 77  LEDGER-ACTUAL                 PIC S9(12)V99  VALUE 0.
008900 77  LEDGER-STANDARD               PIC S9(12)V99  VALUE 0.
009000 77  LEDGER-VARIANCE               PIC S9(12)V99  VALUE 0.
009100 77  LEDGER-QTY                    PIC S9(10)     VALUE 0.
009200*********************************************************
009300 77  DEPT-ACTUAL                   PIC S9(12)V99  VALUE 0.
009400 77  DEPT-STANDARD                 PIC S9(12)V99  VALUE 0.
009500 77  DEPT-VARIANCE                 PIC S9(12)V99  VALUE 0.
009600 77  DEPT-QTY                      PIC S9(10)     VALUE 0.
009700*********************************************************
009800 77  CLASS-ACTUAL                  PIC S9(12)V99  VALUE 0.
009900 77  CLASS-STANDARD                PIC S9(12)V99  VALUE 0.
010000 77  CLASS-VARIANCE                PIC S9(12)V99  VALUE 0.
010100 77  CLASS-QTY                     PIC S9(10)      VALUE 0.
010200*********************************************************
010300 77  NWO-ACTUAL                    PIC S9(12)V99  VALUE 0.
010400 77  NWO-STANDARD                  PIC S9(12)V99  VALUE 0.
010500 77  NWO-VARIANCE                  PIC S9(12)V99  VALUE 0.
010600 77  NWO-QTY                       PIC S9(10)      VALUE 0.
010700*********************************************************
010800 77  PREV-BC                       PIC X(4)       VALUE SPACES.
010900 77  PREV-REPORT-CODE              PIC XX         VALUE SPACES.
011000 77  PREV-LEDGER                   PIC X(2)       VALUE SPACES.
011100 77  PREV-DEPT                     PIC X(6)       VALUE SPACES.
011200 77  PREV-CLASS                    PIC X(4)       VALUE SPACES.
011300 77  HOLD-VAR                      PIC S9(12)V99   VALUE 0.
011400 77  PREV-NWO                      PIC X(6)      VALUE SPACES.
011500 77  ITEM-FOUND                    PIC 9         VALUE 0.
011600 77  NO-ACTUAL-VALUE-SW            PIC X(1)      VALUE SPACES.
       77  MCXCBLERR-SCOPE               PIC X(1)      VALUE "C".
011700
011900 01  TIME-DIV.
012000     05  HH-DIV                    PIC XX   VALUE SPACES.
012100     05  MM-DIV                    PIC XX   VALUE SPACES.
012200     05  SS-DIV                    PIC XX   VALUE SPACES.
012300
012400 01  DATE-DIVIDED.
012500     05  MONTH-DIV                PIC XX   VALUE SPACES.
012600     05  FILLER                   PIC X    VALUE SPACES.
012700     05  DAY-DIV                  PIC XX   VALUE SPACES.
012800     05  FILLER                   PIC X    VALUE SPACES.
012900     05  YEAR-DIV                 PIC XX   VALUE SPACES.
013000
013100 01  MONTH-TABLE.
013200     05  FILLER                   PIC X(9)  VALUE "JANUARY".
013300     05  FILLER                   PIC X(9)  VALUE "FEBRUARY".
013400     05  FILLER                   PIC X(9)  VALUE "MARCH".
013500     05  FILLER                   PIC X(9)  VALUE "APRIL".
013600     05  FILLER                   PIC X(9)  VALUE "MAY".
013700     05  FILLER                   PIC X(9)  VALUE "JUNE".
013800     05  FILLER                   PIC X(9)  VALUE "JULY".
013900     05  FILLER                   PIC X(9)  VALUE "AUGUST".
014000     05  FILLER                   PIC X(9)  VALUE "SEPTEMBER".
014100     05  FILLER                   PIC X(9)  VALUE "OCTOBER".
014200     05  FILLER                   PIC X(9)  VALUE "NOVEMBER".
014300     05  FILLER                   PIC X(9)  VALUE "DECEMBER".
014400
014500 01  MONTH-TAB REDEFINES MONTH-TABLE.
014600     05  MONTH-T OCCURS 12 TIMES  PIC X(9).
014700
014800 01  MONTH-YEAR.
014900     05  MONTH-PARM               PIC 99.
015000     05  YEAR-PARM                PIC 99.
015100
015200
015300************************************************************
015400**     REPORT PRINT LINES                                 **
015500************************************************************
015600
015700 01  HEADER1.
015800     05  FILLER                     PIC X      VALUE SPACES.
015900     05  FILLER                     PIC X(49)
016000         VALUE "TCHGBYBC".
016100     05  FILLER                     PIC X(69)
016200         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
016300     05  FILLER                     PIC X(5)   VALUE "DATE ".
016400     05  DATE-H1                    PIC X(8)   VALUE SPACES.
016500
016600 01  HEADER2.
016700     05  FILLER                     PIC X      VALUE SPACES.
016800     05  FILLER                     PIC X(6)   VALUE "PAGE".
016900     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
017000     05  FILLER                     PIC X(34)  VALUE SPACES.
017100     05  FILLER                     PIC X(74)
017200         VALUE "STORES DETAIL OF CHARGES BY BUSINESS CENTER".
017300     05  FILLER                     PIC X(5)   VALUE "TIME ".
017400     05  TIME-H2.
017500         10  HH-H2                  PIC XX     VALUE SPACES.
017600         10  FILLER                 PIC X      VALUE ":".
017700         10  MM-H2                  PIC XX     VALUE SPACES.
017800         10  FILLER                 PIC X      VALUE ":".
017900         10  SS-H2                  PIC XX     VALUE SPACES.
018000
018100 01  HEADER3.
018200     05  FILLER                     PIC X(57)  VALUE SPACES.
018300     05  MONTH-H3                   PIC X(9)   VALUE SPACES.
018400     05  FILLER                     PIC X(3)   VALUE SPACES.
018500     05  YEAR-H3A                   PIC X(2)   VALUE "20".
018600     05  YEAR-H3B                   PIC X(2)   VALUE SPACES.
018700
018800
018900 01  HEADER4.
019000     05  FILLER                     PIC X      VALUE SPACES.
019100     05  FILLER                     PIC X(30)
019200              VALUE "LC DEPT   ACCOUNT CODE OR PO".
019300     05  FILLER                     PIC X(42)
019400              VALUE "RLS ITM  TRANS DESCR".
019500     05  FILLER                    PIC X(10)  VALUE "UM".
019600     05  FILLER                     PIC X(25)
019700              VALUE "QTY         ACTUAL".
019800     05  FILLER                     PIC X(23)
019900              VALUE "STANDARD       VARIANCE".
020000
020100
020200 01  BC-HDG.
020300     05  FILLER                    PIC X(16)
020400             VALUE "BUSINESS CENTER ".
020500     05  BC-OUT                    PIC X(4).
020600
020700 01  REPORT-HDG.
020800     05  FILLER                     PIC X(13)
020900          VALUE "REPORT CODE".
021000     05  REPORT-DESCR-HDG           PIC X(60).
021100
021200
021300 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
021400
021500 01  DETAIL-LINE.
021600     05  FILLER                     PIC X      VALUE SPACES.
021700     05  PRT-LEDGER                 PIC X(2)   VALUE SPACES.
021800     05  FILLER                     PIC X      VALUE SPACES.
021900     05  PRT-DEPT                   PIC X(6)   VALUE SPACES.
022000     05  PRT-HYPHEN                 PIC X      VALUE SPACES.
022100     05  PRT-ACCOUNT                PIC X(6)   VALUE SPACES.
022200     05  FILLER                     PIC X(2)   VALUE SPACES.
022300     05  PRT-CLASS                  PIC X(3).
022400     05  PRT-HYPHEN2                PIC X      VALUE SPACES.
022500     05  PRT-CODE-OR-PO             PIC X(7).
022600     05  FILLER                     PIC X      VALUE SPACES.
022700     05  PRT-RLS                    PIC XXX    VALUE SPACES.
022800     05  FILLER                     PIC X      VALUE SPACES.
022900     05  PRT-ITEM                   PIC X(4)   VALUE SPACES.
023000     05  FILLER                     PIC X      VALUE SPACES.
023100     05  PRT-TRANS-CODE             PIC X(4)   VALUE SPACES.
023200     05  FILLER                     PIC X      VALUE SPACES.
023300     05  PRT-DESCR                  PIC X(27)  VALUE SPACES.
023400     05  FILLER                     PIC X      VALUE SPACES.
023500     05  PRT-UM                     PIC XX     VALUE SPACES.
023600     05  FILLER                     PIC X      VALUE SPACES.
023700     05  PRT-QTY                    PIC Z(10)-.
023800     05  FILLER                     PIC X      VALUE SPACES.
023900     05  PRT-ACTUAL                 PIC Z(10).ZZ-.
024000     05  FILLER                     PIC X      VALUE SPACES.
024100     05  PRT-STD                    PIC Z(10).ZZ-.
024200     05  FILLER                     PIC X      VALUE SPACES.
024300     05  PRT-VAR                    PIC Z(10).ZZ-.
024400
024500 01  BC-LINE.
024600     05  FILLER                     PIC X(11) VALUE "BC TOTAL".
024700     05  BC-TRLR                    PIC X(4)   VALUE SPACES.
024800     05  FILLER                     PIC XX     VALUE SPACES.
024900     05  BC-TRAILER                 PIC X(59)  VALUE SPACES.
025000     05  BC-QTY-PRT                 PIC Z(10)-.
025100     05  FILLER                     PIC X      VALUE SPACES.
025200     05  BC-ACTUAL-PRT              PIC Z(10).ZZ-.
025300     05  FILLER                     PIC X      VALUE SPACES.
025400     05  BC-STANDARD-PRT            PIC Z(10).ZZ-.
025500     05  FILLER                     PIC X      VALUE SPACES.
025600     05  BC-VARIANCE-PRT            PIC Z(10).ZZ-.
025700
025800 01  VOUCHER-LINE.
025900     05  FILLER                     PIC X(13) VALUE "VCHR TOTAL".
026000     05  REPORT-CODE-TRLR            PIC XX     VALUE SPACES.
026100     05  FILLER                     PIC XX     VALUE SPACES.
026200     05  REPORT-TRAILER             PIC X(59)  VALUE SPACES.
026300     05  VOUCHER-QTY-PRT            PIC Z(10)-.
026400     05  FILLER                     PIC X      VALUE SPACES.
026500     05  VOUCHER-ACTUAL-PRT         PIC Z(10).ZZ-.
026600     05  FILLER                     PIC X      VALUE SPACES.
026700     05  VOUCHER-STANDARD-PRT       PIC Z(10).ZZ-.
026800     05  FILLER                     PIC X      VALUE SPACES.
026900     05  VOUCHER-VARIANCE-PRT       PIC Z(10).ZZ-.
027000
027100 01  LEDGER-LINE.
027200     05  FILLER                     PIC X(13)  VALUE "LEDG TOTAL".
027300     05  LEDG-CODE-TRLR             PIC XX     VALUE SPACES.
027400     05  FILLER                     PIC XX     VALUE SPACES.
027500     05  LEDGER-TRAILER             PIC X(59)  VALUE SPACES.
027600     05  LEDGER-QTY-PRT             PIC Z(10)-.
027700     05  FILLER                     PIC X       VALUE SPACES.
027800     05  LEDGER-ACTUAL-PRT          PIC Z(10).ZZ-.
027900     05  FILLER                     PIC X      VALUE SPACES.
028000     05  LEDGER-STANDARD-PRT        PIC Z(10).ZZ-.
028100     05  FILLER                     PIC X      VALUE SPACES.
028200     05  LEDGER-VARIANCE-PRT        PIC Z(10).ZZ-.
028300
028400 01  DEPT-LINE.
028500     05  FILLER                     PIC X(11)  VALUE "DEPT TOTAL".
028600     05  DEPT-CODE-TRLR             PIC X(4)   VALUE SPACES.
028700     05  FILLER                     PIC XX     VALUE SPACES.
028800     05  DEPT-TRAILER               PIC X(59)  VALUE SPACES.
028900     05  DEPT-QTY-PRT               PIC Z(10)-.
029000     05  FILLER                     PIC X      VALUE SPACES.
029100     05  DEPT-ACT-PRT               PIC Z(10).ZZ-.
029200     05  FILLER                     PIC X      VALUE SPACES.
029300     05  DEPT-STD-PRT               PIC Z(10).ZZ-.
029400     05  FILLER                     PIC X      VALUE SPACES.
029500     05  DEPT-VAR-PRT               PIC Z(10).ZZ-.
029600
029700 01  CLASS-LINE.
029800     05  FILLER                     PIC X(12)
029900          VALUE "CLASS TOTAL".
030000     05  CLASS-CODE-TRLR            PIC X(3)   VALUE SPACES.
030100     05  FILLER                     PIC XX     VALUE SPACES.
030200     05  CLASS-TRAILER              PIC X(59)  VALUE SPACES.
030300     05  CLASS-QTY-PRT              PIC Z(10)-.
030400     05  FILLER                     PIC X       VALUE SPACES.
030500     05  CLASS-ACT-PRT              PIC Z(10).ZZ-.
030600     05  FILLER                     PIC X      VALUE SPACES.
030700     05  CLASS-STD-PRT              PIC Z(10).ZZ-.
030800     05  FILLER                     PIC X      VALUE SPACES.
030900     05  CLASS-VAR-PRT              PIC Z(10).ZZ-.
031000
031100 01  NWO-LINE.
031200     05  FILLER                     PIC X(12)
031300          VALUE "NWO TOTAL".
031400     05  NWO-TRLR                   PIC X(6)   VALUE SPACES.
031500     05  FILLER                     PIC X(58)  VALUE SPACES.
031600     05  NWO-QTY-PRT                PIC Z(10)-.
031700     05  FILLER                     PIC X       VALUE SPACES.
031800     05  NWO-ACT-PRT                PIC Z(10).ZZ-.
031900     05  FILLER                     PIC X      VALUE SPACES.
032000     05  NWO-STD-PRT                PIC Z(10).ZZ-.
032100     05  FILLER                     PIC X      VALUE SPACES.
032200     05  NWO-VAR-PRT                PIC Z(10).ZZ-.
032300
032400 01  GRAND-LINE.
032500     05  FILLER                     PIC X(76)
032600          VALUE "TOTAL STORES CHARGES".
032700     05  GRAND-QTY-PRT              PIC Z(10)-.
032800     05  FILLER                     PIC X        VALUE SPACES.
032900     05  GRAND-ACTUAL-PRT           PIC Z(10).ZZ-.
033000     05  FILLER                     PIC X       VALUE SPACES.
033100     05  GRAND-STANDARD-PRT         PIC Z(10).ZZ-.
033200     05  FILLER                     PIC X       VALUE SPACES.
033300     05  GRAND-VARIANCE-PRT         PIC Z(10).ZZ-.
033400
033500 01  NO-ACTUAL-ERROR-LINE.
033600     05  FILLER  PIC X(5)  VALUE SPACES.
033700     05  FILLER  PIC X(7)  VALUE "*****  ".
033800     05  FILLER  PIC X(11) VALUE "WARNING || ".
033900     05  FILLER  PIC X(13) VALUE "TRANSACTIONS ".
034000     05  FILLER  PIC X(13) VALUE "ACTUAL VALUE ".
034100     05  FILLER  PIC X(9)  VALUE "IS ZERO  ".
034200     05  FILLER  PIC X(5)  VALUE "*****".
034300
034400 01  ASTERICK-LINE.
034500     05  FILLER  PIC X(80) VALUE ALL "*".
034600
034700 01  ERROR-MSG-LINE1.
034800     05  FILLER  PIC X(6)  VALUE "**    ".
034900     05  FILLER  PIC X(11) VALUE "WARNING||||".
035000     05  FILLER  PIC X(61) VALUE SPACES.
035100     05  FILLER  PIC X(2)  VALUE "**".
035200
035300 01  ERROR-MSG-LINE2.
035400     05  FILLER  PIC X(6)  VALUE "**    ".
035500     05  FILLER  PIC X(25) VALUE "ONE OR MORE TRANSACTIONS ".
035600     05  FILLER  PIC X(24) VALUE "CONTAIN AN ACTUAL VALUE ".
035700     05  FILLER  PIC X(9)  VALUE "OF ZEROS.".
035800     05  FILLER  PIC X(14) VALUE SPACES.
035900     05  FILLER  PIC X(2)  VALUE "**".
036000
036100 01  ERROR-MSG-LINE3.
036200     05  FILLER  PIC X(6)  VALUE "**    ".
036300     05  FILLER  PIC X(28) VALUE "THE INDIVIDUAL TRANSACTIONS ".
036400     05  FILLER  PIC X(24) VALUE "HAVE BEEN FLAGED WITH A ".
036500     05  FILLER  PIC X(16) VALUE "WARNING MESSAGE.".
036600     05  FILLER  PIC X(4)  VALUE SPACES.
036700     05  FILLER  PIC X(2)  VALUE "**".
036800
036900 01  ERROR-MSG-LINE4.
037000     05  FILLER  PIC X(6)  VALUE "**    ".
037100     05  FILLER  PIC X(20) VALUE "PLEASE REVIEW THESE ".
037200     05  FILLER  PIC X(26) VALUE "TRANSACTIONS TO MAKE SURE ".
037300     05  FILLER  PIC X(22) VALUE "THESE TRANSACTIONS ARE".
037400     05  FILLER  PIC X(4) VALUE SPACES.
037500     05  FILLER  PIC X(2)  VALUE "**".
037600
037700 01  ERROR-MSG-LINE5.
037800     05  FILLER  PIC X(6)  VALUE "**    ".
037900     05  FILLER  PIC X(28) VALUE "CORRECT.  ALL RAW MATERIALS ".
038000     05  FILLER  PIC X(26) VALUE "MUST HAVE AN ACTUAL VALUE ".
038100     05  FILLER  PIC X(11) VALUE "IN ORDER TO".
038200     05  FILLER  PIC X(7)  VALUE SPACES.
038300     05  FILLER  PIC X(2)  VALUE "**".
038400
038500 01  ERROR-MSG-LINE6.
038600     05  FILLER  PIC X(6)  VALUE "**    ".
038700     05  FILLER  PIC X(23) VALUE "COMPUTE A RAW MATERIAL ".
038800     05  FILLER  PIC X(9)  VALUE "VARIANCE.".
038900     05  FILLER  PIC X(40) VALUE SPACES.
039000     05  FILLER  PIC X(2)  VALUE "**".
039100
039200
039300************************************************************
039400**                                                        **
039500**           D A T A B A S E   B U F F E R S              **
039600**                                                        **
039700************************************************************
039800
039900*********************
040000**  MMATL-ACCUM    **
040100*********************
040200
040300 COPY MATLACUM IN COPYLIB.
040400
040500******************
040600**    DTRANS    **
040700******************
040800 COPY DTRANS IN COPYLIB.
040900
041000*****************
041100*  MCHT-ACCTS   *
041200*****************
041300 COPY MCHTACCT IN COPYLIB.
041400
041500*****************
041600*   MCLASS      *
041700*****************
041800 COPY MCLASS IN COPYLIB.
041900
042000*****************
042100*   MREPORT     *
042200*****************
042300 COPY MREPORT IN COPYLIB.
042400
042500*****************
042600*   MLEDGER     *
042700*****************
042800 COPY MLEDGER IN COPYLIB.
042900
043000*****************
043100*   PODATAITM   *
043200*****************
043300 COPY DPODATA IN COPYLIB.
043400
043500*****************
043600*   MSTORERM    *
043700*****************
043800
043900 COPY MSTORERM IN COPYLIB.
044000
044100****************************
044200**    MACCOUNT-INFO       **
044300****************************
044400
044500 COPY MACTINFO IN COPYLIB.
044600
044700**********************************************************
044800*              D A T A    B A S E                        *
044900**********************************************************
045000
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

045100 COPY DBCSACCT IN COPYLIB.
045200
045300 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
045400 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
045500
045600 COPY DBMODES IN COPYLIB.
045700
045800 COPY DBSTAT IN COPYLIB.
045900
046000 01  DATASET-NAMES.
046100     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
046200     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
046300     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
046400     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
046500     05  DSET-MREPORT     PIC X(16)  VALUE "MREPORT;".
046600     05  DSET-MCHT-ACCTS  PIC X(16)  VALUE "MCHT-ACCTS;".
046700     05  DSET-DPODATA     PIC X(16)  VALUE "DPODATAITM;".
046800     05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
046900     05  DSET-MLEDG       PIC X(16)  VALUE "MLEDGER;".
047000
047100 01  ITEMS-LISTING.
047200     05  ALL-ITEMS         PIC X(2)   VALUE "@;".
047300     05  PO-KEY            PIC X(10)  VALUE "PO-RCV-NO;".
047400
047500 01  IMAGE-ARGS.
047600     05  MACCT-KEY         PIC X(4)   VALUE SPACES.
047700     05  MMATL-CODE-ARG.
047800         10  MMATL-FST4    PIC XXXX  VALUE SPACES.
047900         10  MMATL-LST4    PIC XXXX  VALUE SPACES.
048000     05  DEPT-KEY          PIC X(6)   VALUE SPACES.
048100     05  PO-KEY-ARG.
048200         10  KEY-REC-ID    PIC X    VALUE SPACES.
048300         10  KEY-PO-NO     PIC X(7) VALUE SPACES.
048400         10  KEY-PO-REL    PIC XXX  VALUE SPACES.
048500         10  KEY-PO-REC    PIC XXX  VALUE SPACES.
048600     05  REPORT-CODE-ARG   PIC XX   VALUE SPACES.
048700     05  CLASS-ARG         PIC X(4)  VALUE SPACES.
048800     05  LEDG-ARG          PIC X(4)  VALUE SPACES.
048900
049000
049100*******************************************************
049200*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
049300*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
049400*   READ ERRORS).                                     *
049500*******************************************************
049600
049700 COPY TBLOWUP IN COPYLIB.
049800
049900******************************************
050000**   PARAMETERS FOR CALLING 'CBLOWSRT'
050100******************************************
050200
050300 COPY CBLOWSRT IN COPYLIB.
050400
050500********************************************************
050600**      C D E S C   P A R A M E T E R S               **
050700********************************************************
050800
050900 COPY CDESC IN COPYLIB.
051000
050500********************************************************
050600**    T D A T E C H K   P A R A M E T E R S           **
050700********************************************************
050800
050900 COPY TDATECHK IN COPYLIB.
051000
051100********************************************************
051200**    T E R M I N A L    I / O   D A T A   A R E A    **
051300********************************************************
051400
051500 COPY THDPRT     IN COPYLIB.
051600
051700********************************************************
051800**     E S C A P E    S E Q U E N C E   A R E A       **
051900********************************************************
052000
052100 COPY ESCNAM2   IN COPYLIB.

052200 01  ESC-INFO.
052300     05  COMPRESS-PRINT            PIC X(8).
052400     05  NORMAL-PRINT              PIC X(8).
052500
       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

052600
052700 PROCEDURE DIVISION.
052800
052900 001-BEGIN SECTION.
053000
053100 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
053200
053400*------ GET PARMS FOR REPORT
053500     ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
053600
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.

053300     OPEN OUTPUT ONLINE-PRT.

      *------ 14APR90 REPLACED CALL TO GETFNUM WITH MACHINE
      *------ DEPENDENT ROUTINE.
054100*****CALL "GETFNUM" USING ONLINE-PRT, FNUM.

           PERFORM 9999-GETFNUM.
054200     MOVE "DHDRPT86.PUB" TO HD-FILE-NAME.
054300     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
054400         HD-ROUTE-DATA, ESC-NAME.
054500     IF HD-RET-CODE NOT = 0
054600         MOVE "THDPRT2 ERROR * CHGBYBC" TO BU-DISPLAY-MSG
054700         MOVE "HD-RET-CODE = "     TO BU-DISPLAY-FLD (1)
054800         MOVE HD-RET-CODE          TO BU-DISPLAY-FLD9 (1)
054900         PERFORM 990-BLOWUP.
055000
053700     CALL "TESCSEQ" USING ESC-NAME.
053800     MOVE CHAR-1636PI              TO COMPRESS-PRINT.
053900     MOVE CHAR-10PI                TO NORMAL-PRINT.
054000
055100     IF PAPER-IS-132-COLS
055200       NEXT SENTENCE
055300     ELSE
055400       WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
055500
055600*******************************************************
055700**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
055800**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
055900**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
056000**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
056100**   OCCURS
056200*******************************************************
056300
056400     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
056500                           ACCTG-BASE,
056600                           BU-PGM-NAME,
056700                           STATUS-AREA,
056800                           DUMMY-VIEW-AREA,
056900                           FILE-STATUS,
057000                           BU-DISPLAY-MSG,
057100                           BU-DISPLAY-FLDS.
057200
057300     SORT SORT-FILE ON ASCENDING KEY SORT-BC
057400                                     SORT-REPORT-CODE
057500                                     SORT-LEDG-CODE
057600                                     SORT-DEPT-CHGD
057700                                     SORT-CLASS
057800                                     SORT-DEPT-ACCT
057900                                     SORT-CODE-OR-PO
058000         INPUT PROCEDURE IS 050-PROCESS-TRANS
058100         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
058200     PERFORM 1000-CLOSE-FILES.
058300     GOBACK.
058400
058500
058600 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
058700     PERFORM 100-BEGIN.
058800     PERFORM 200-PROCESS-DETAIL
058900         UNTIL END-OF-FILE.
059000
059100**********************************************************
059200*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
059300*  FOR SORTING OF RECORDS.                               *
059400**********************************************************
059500
059600     GO TO 699-PROCESS-EXIT.
059700
059800 100-BEGIN.
059900     MOVE SPACES TO BU-DISPLAY-AREA.
           PERFORM 9999-OPEN-STUFF.
061900     MOVE SPACES TO SORT-REC.
062000     MOVE 0 TO SORT-VALUE
062100               SORT-STD-VALUE
062200               SORT-QTY-CHGD.
062300     PERFORM 620-GET-STR-DEPT.
           PERFORM 9999-INIT-DTRANS-MC-I.
062400     PERFORM 400-GET-DTRANS.
062500
062600
062700 200-PROCESS-DETAIL.
062800     IF TRANS-DOCUMENT-NUM = "PROC"
062900         NEXT SENTENCE
063000     ELSE
063100         IF TRANS-CODE-TRANS = "ISS"
063300             PERFORM 500-GET-MMATL-ACCUM
063400             PERFORM 510-GET-LEDGER
063500             PERFORM 520-GET-DESCR
063600             PERFORM 550-GET-MSTORERM
063700             PERFORM 600-BUILD-SORT-REC
063800         ELSE
063100         IF TRANS-CODE = "RET " OR "SADJ" OR "AADJ" OR "RETV"
063300             PERFORM 500-GET-MMATL-ACCUM
063400             PERFORM 510-GET-LEDGER
063500             PERFORM 520-GET-DESCR
063600             PERFORM 550-GET-MSTORERM
063700             PERFORM 600-BUILD-SORT-REC
063800         ELSE
063900             IF TRANS-CODE = "INV" OR "FRT"
064000                 IF TRANS-STORES-CODE = "NON-STR"
064100                     PERFORM 500-GET-MMATL-ACCUM
064200                     PERFORM 510-GET-LEDGER
064300                     PERFORM 520-GET-DESCR
064400                     PERFORM 550-GET-MSTORERM
064500                     PERFORM 600-BUILD-SORT-REC
064600                 ELSE
064700                 IF TRANS-DEPT NOT = MACCT-STR-DEPT
064800                     PERFORM 500-GET-MMATL-ACCUM
064900                     PERFORM 510-GET-LEDGER
065000                     PERFORM 520-GET-DESCR
065100                     PERFORM 550-GET-MSTORERM
065200                     PERFORM 600-BUILD-SORT-REC
065300                 ELSE
065400                     NEXT SENTENCE
065500             ELSE
065600                 NEXT SENTENCE.
065700     PERFORM 400-GET-DTRANS.
065800
065900
066000 400-GET-DTRANS.
066100     ADD 1 TO ENTRIES-READ.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
066900     IF GOOD-CALL
067000         NEXT SENTENCE
067100     ELSE
067200         IF END-OF-FILE
067300             NEXT SENTENCE
067400         ELSE
067500             MOVE "DBGET DTRANS * 400-GET" TO
067600                  BU-DISPLAY-MSG
067700             PERFORM 990-BLOWUP.

067800     MOVE TRANS-STORES-CODE TO MMATL-CODE-ARG.
067900
068000
068100
068200
068300 500-GET-MMATL-ACCUM.
068400     IF MMATL-CODE-ARG = "NON-STR"
068500         PERFORM 505-SET-REPORT-CODE
068600     ELSE
               PERFORM 9999-DBGET7-MMATL-ACCUM-MC-I
069400         IF GOOD-CALL
069500             IF TRANS-ACCT > "009999"
069600                 IF TRANS-CODE = "INV"
069700                     MOVE 06 TO SORT-REPORT-CODE
069800                 ELSE
069900                     MOVE 04 TO SORT-REPORT-CODE
070000             ELSE
070100                 MOVE MATL-REPORT-CODE TO SORT-REPORT-CODE
070200         ELSE
070300             MOVE "DBGET MMATL-ACCUM * 500-GMA" TO BU-DISPLAY-MSG
070400             MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
070500             PERFORM 990-BLOWUP.
070600
070700**********************************************************
070800**  THIS SECTION SETS THE REPORT CODE FOR DIRECT        **
070900**  DELIVERIES THAT ARE NOT CODED.  ALL CODED ITEMS     **
071000**  HAVE A REPORT CODE ATTACHED.                        **
071100**********************************************************
071200
071300 505-SET-REPORT-CODE.
071400*    IF TRANS-CLASS < 200
071500*        MOVE 02 TO SORT-REPORT-CODE
071600*    ELSE
071700*        IF TRANS-CLASS < 344
071800*            MOVE 05 TO SORT-REPORT-CODE
071900*        ELSE
072000*            IF TRANS-CLASS < 400
072100*                MOVE 01 TO SORT-REPORT-CODE
072200*            ELSE
072300*                IF TRANS-CLASS < 500
072400*                    MOVE 02 TO SORT-REPORT-CODE
072500*                ELSE
072600*                    MOVE 01 TO SORT-REPORT-CODE.
      ******************************************************
      *    THE ABOVE LOGIC WAS CHANGED 7/30/97 DUE TO      *
      *    VALLEYFIELD USING CLASS 080 FOR MAJOR SPARE     *
      *    PARTS.....JIM C.                                *
      ******************************************************
068100     IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
068200        (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
068300         MOVE "02"                TO SORT-REPORT-CODE
068400     ELSE
068500     IF (TRANS-CLASS > 199 AND TRANS-CLASS < 344)
068600         MOVE "05"                TO SORT-REPORT-CODE
068700     ELSE
068800     IF (TRANS-CLASS > 343 AND TRANS-CLASS < 400)  OR
068900        (TRANS-CLASS > 499) OR (TRANS-CLASS < 100)
069000         MOVE "01"                TO SORT-REPORT-CODE.
072700     IF TRANS-ACCT = "000000" OR TRANS-ACCT = SPACES
072800         NEXT SENTENCE
072900     ELSE
073000*        IF TRANS-CLASS < 200 OR TRANS-CLASS > 399
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
                  (TRANS-CLASS > 399)
073100             NEXT SENTENCE
073200         ELSE
073300             IF TRANS-ACCT > "009999"
073400                 MOVE 06 TO SORT-REPORT-CODE
073500             ELSE
073600                 IF TRANS-ACCT = "000951"
073700                     MOVE 02 TO SORT-REPORT-CODE
073800                 ELSE
073900                     IF TRANS-ACCT < "000100"
074000                         OR TRANS-ACCT = "000251" OR
074100                            "000252" OR "000253" OR "000250"
                                  OR "000254"
074200                               OR "000891" OR "000892"
074300                             MOVE 05 TO SORT-REPORT-CODE
074400                     ELSE
074500                         MOVE 01 TO SORT-REPORT-CODE.
074600
074700
074800 510-GET-LEDGER.
074900     MOVE TRANS-DEPT TO DEPT-KEY.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
075700     IF GOOD-CALL
075800         NEXT SENTENCE
075900     ELSE
076000         MOVE "DBGET MCHT-ACCTS * 510-GL" TO BU-DISPLAY-MSG
076100         MOVE DEPT-KEY TO BU-DISPLAY-FLD (1)
               MOVE TRANS-STORES-CODE TO BU-DISPLAY-FLD (2)
               MOVE TRANS-DATE        TO BU-DISPLAY-FLD (3)
               MOVE TRANS-TIME        TO BU-DISPLAY-FLD (4)
               MOVE TRANS-CODE        TO BU-DISPLAY-FLD (5)
076200         PERFORM 990-BLOWUP.
076300
076400     MOVE MCHT-BC      TO SORT-BC.
076500     MOVE MCHT-LEDGERT TO SORT-LEDG-CODE.
076600
076700 520-GET-DESCR.
076800     IF TRANS-STORES-CODE = "NON-STR"
076900         PERFORM 530-GET-PO-DESCR
077000     ELSE
077100         IF MMATL-FST4 = "ACCR"
077200             MOVE "WRITEDOWN" TO SORT-DESCR
077300         ELSE
077400             MOVE "01"            TO CDESC-LINES-TO-GET
077500             MOVE "N"             TO CDESC-LOCAL-DESC-OPTION
077600             CALL "CDESC" USING CDESC-RET-CODE
077700                                STORES-BASE
077800                                STATUS-AREA
077900                                BU-DISPLAY-MSG
078000                                TRANS-STORES-CODE
078100                                CDESC-DATA
078200             MOVE CDESC (1)       TO SORT-DESCR.
078300
078400 530-GET-PO-DESCR.
078500     MOVE "P" TO KEY-REC-ID.
078600     MOVE TRANS-ORDER-NUM TO KEY-PO-NO.
078700     MOVE TRANS-RELEASE TO KEY-PO-REL.
078800     MOVE "000" TO KEY-PO-REC.
           PERFORM 9999-DBFIND-DPODATAITM-PO-I.
079500     IF GOOD-CALL
079600         PERFORM 540-CONT-DESCR UNTIL ITEM-FOUND = 1
079700                    OR END-OF-CHAIN
079800         MOVE 0 TO ITEM-FOUND
079900     ELSE
080000         IF NO-ENTRY
080100              DISPLAY "NO FIND FOR PO NUM " PO-KEY-ARG
080200         ELSE
080300              MOVE "DBFIND PODATAITM * 530-GPD"
080400                   TO BU-DISPLAY-MSG
080500              PERFORM 990-BLOWUP.
080600
080700 540-CONT-DESCR.
           PERFORM 9999-DBGET5-DPODATAITM-PO-I.
081500     IF GOOD-CALL
081600         IF TRANS-ITEM-NUM = DATAITM-ITEM-NO
081700             IF DATAITM-LINE-NO = "01"
081800                 MOVE DATAITM-INFO TO SORT-DESCR
081900                 MOVE 1 TO ITEM-FOUND
082000             ELSE
082100                 NEXT SENTENCE
082200         ELSE
082300             NEXT SENTENCE
082400     ELSE
082500         IF END-OF-CHAIN
082600             MOVE SPACES TO SORT-DESCR
082700         ELSE
082800             MOVE "DBGET PODATAITM * 540-CD" TO BU-DISPLAY-MSG
082900             PERFORM 990-BLOWUP.
083000
083100 550-GET-MSTORERM.
083200     IF MMATL-CODE-ARG = "NON-STR" OR MMATL-FST4 = "ACCR"
083300*********NEXT SENTENCE  *REPLACED 11SEP1995
               MOVE +0 TO STR-STD-COST
083400     ELSE
               PERFORM 9999-DBGET7-MSTORERM-CD-I
084200         IF GOOD-CALL
084300             NEXT SENTENCE
084400         ELSE
084500             IF NO-ENTRY
084600                  MOVE 0 TO STR-STD-COST
084700             ELSE
084800                 MOVE "DBGET MSTORE * 550-GM" TO BU-DISPLAY-MSG
084900                 MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
085000                 PERFORM 990-BLOWUP.
085100
085200 600-BUILD-SORT-REC.
085300     MOVE TRANS-DEPT              TO SORT-DEPT-CHGD.
085400     MOVE TRANS-ACCT              TO SORT-ACCT-CHGD.
085500     MOVE TRANS-CLASS             TO SORT-CLASS.
085600     IF TRANS-STORES-CODE = "NON-STR"
085700         MOVE TRANS-ORDER-NUM     TO SORT-CODE-OR-PO
085800         MOVE TRANS-RELEASE       TO SORT-PO-RLS
085900         MOVE TRANS-ITEM-NUM      TO SORT-PO-ITEM
086000     ELSE
086100         MOVE TRANS-STORES-CODE   TO SORT-CODE-OR-PO
086200         MOVE SPACES              TO SORT-PO-RLS
086300                                     SORT-PO-ITEM.
086400     MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEAS.
086500     IF TRANS-STORES-CODE = "2641544" AND
086600          TRANS-ACCT = "000042"
086700             MOVE 05              TO SORT-REPORT-CODE.
086800     MOVE MCHT-DEPT-TYPE          TO SORT-DEPT-TYPE.
086900     IF MCHT-DEPT-TYPE = "MS" OR "MU" OR "MW"
087000*        IF TRANS-CLASS > 199 AND TRANS-CLASS < 400
               IF (TRANS-CLASS > 199 AND TRANS-CLASS < 400)
087100             MOVE 01              TO SORT-REPORT-CODE
087200         ELSE
087300             NEXT SENTENCE
087400     ELSE
087500         NEXT SENTENCE.
087600     IF TRANS-CODE = "INV"
087700         MOVE "DCHG"              TO SORT-TRANS-TYPE
087800     ELSE
087900         MOVE TRANS-CODE          TO SORT-TRANS-TYPE.
088000     IF TRANS-CODE = "RET" OR "RETV" OR "SADJ" OR "AADJ"
088100         COMPUTE SORT-QTY-CHGD = TRANS-QTY * -1
088200         COMPUTE SORT-VALUE = TRANS-VALUE * -1
088300     ELSE
088400         MOVE TRANS-QTY           TO SORT-QTY-CHGD
088500         MOVE TRANS-VALUE         TO SORT-VALUE.
088600     IF MCHT-DEPT-TYPE = "PR"
088700*        IF (TRANS-CLASS < 200) OR (TRANS-CLASS > 399
088800*          AND TRANS-CLASS < 500)
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
                  (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
088900               IF TRANS-STORES-CODE = "NON-STR"
089000                   MOVE SORT-VALUE TO SORT-STD-VALUE
089100               ELSE
089200                   IF STR-STD-COST = 0
089300                       MOVE 0      TO SORT-STD-VALUE
089400                   ELSE
089500                       MOVE SORT-VALUE TO SORT-STD-VALUE
089600                       COMPUTE SORT-VALUE =
089700                           SORT-QTY-CHGD * STR-AVG-COST
089800         ELSE
089900             MOVE 0                TO SORT-STD-VALUE
090000     ELSE
090100         MOVE 0                    TO SORT-STD-VALUE.
090200     IF TRANS-VALUE = 0
090300         MOVE 0                    TO SORT-STD-VALUE.
090400     IF SORT-REPORT-CODE = 02
090500         IF STR-STD-COST = 0
090600             IF SORT-LEDG < 07
090700                 MOVE 0            TO SORT-STD-VALUE
090800             ELSE
090900                 MOVE SORT-VALUE   TO SORT-STD-VALUE.
091000
091100     RELEASE SORT-REC.
091200     MOVE SPACES                   TO SORT-REC.
091300     MOVE 0                        TO SORT-QTY-CHGD
091400                                      SORT-VALUE
091500                                      SORT-STD-VALUE.
091600
091700
091800 620-GET-STR-DEPT.
091900     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
092700     IF GOOD-CALL
092800         NEXT SENTENCE
092900     ELSE
093000         MOVE "DBGET MACCOUNT-INFO * 620-GSD" TO BU-DISPLAY-MSG
093100         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
093200         PERFORM 990-BLOWUP.
093300
093400
093500 699-PROCESS-EXIT.
093600     EXIT.
093700
093800 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
093900     DISPLAY "BEGIN REPORT".
094000     PERFORM 710-BEGIN-REPORT.
094100     PERFORM 705-PROCESS-BC
094200        UNTIL NO-MORE-SORT = "YES".
094300     PERFORM 711-END-REPORT.
094400
094500**************************************************
094600**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
094700**  TO COMPLETE PROCESSING OF REPORT            **
094800**************************************************
094900
095000     GO TO 799-CREATE-EXIT.
095100
095200 710-BEGIN-REPORT.
095300     RETURN SORT-FILE
095400        AT END
095500            MOVE "YES" TO NO-MORE-SORT.
095600
095700 711-END-REPORT.
095800     MOVE GRAND-ACTUAL TO GRAND-ACTUAL-PRT.
095900     MOVE GRAND-STANDARD TO GRAND-STANDARD-PRT.
096000     MOVE GRAND-VARIANCE TO GRAND-VARIANCE-PRT.
096100     MOVE GRAND-QTY TO GRAND-QTY-PRT.
096200     WRITE PRT-REC FROM GRAND-LINE AFTER ADVANCING 2.
096300     IF NO-ACTUAL-VALUE-SW = "Y"
096400         WRITE PRT-REC FROM ASTERICK-LINE AFTER ADVANCING 3
096500         WRITE PRT-REC FROM ERROR-MSG-LINE1 AFTER ADVANCING 1
096600         WRITE PRT-REC FROM ERROR-MSG-LINE2 AFTER ADVANCING 1
096700         WRITE PRT-REC FROM ERROR-MSG-LINE3 AFTER ADVANCING 1
096800         WRITE PRT-REC FROM ERROR-MSG-LINE4 AFTER ADVANCING 1
096900         WRITE PRT-REC FROM ERROR-MSG-LINE5 AFTER ADVANCING 1
097000         WRITE PRT-REC FROM ERROR-MSG-LINE6 AFTER ADVANCING 1
097100         WRITE PRT-REC FROM ASTERICK-LINE AFTER ADVANCING 1.
097200
097300 705-PROCESS-BC.
097400     PERFORM 706-BEGIN-BC.
097500     PERFORM 720-PROCESS-VOUCHER
097600         UNTIL SORT-BC NOT = PREV-BC
097700             OR NO-MORE-SORT = "YES".
097800     PERFORM 708-BC-END.
097900
098000 706-BEGIN-BC.
098100     MOVE 0  TO BC-ACTUAL
098200                BC-QTY
098300                BC-STANDARD
098400                BC-VARIANCE.
098500     MOVE SORT-BC TO PREV-BC, BC-OUT.
098600
098700 708-BC-END.
098800     MOVE PREV-BC                  TO BC-TRLR.
098900     MOVE BC-ACTUAL                TO BC-ACTUAL-PRT.
099000     MOVE BC-STANDARD              TO BC-STANDARD-PRT.
099100     MOVE BC-VARIANCE              TO BC-VARIANCE-PRT.
099200     MOVE BC-QTY                   TO BC-QTY-PRT.
099300     ADD  BC-ACTUAL                TO GRAND-ACTUAL.
099400     ADD  BC-STANDARD              TO GRAND-STANDARD.
099500     ADD  BC-VARIANCE              TO GRAND-VARIANCE.
099600     ADD  BC-QTY                   TO GRAND-QTY.
099700     WRITE PRT-REC FROM BC-LINE AFTER ADVANCING 2 LINES.
099800
099900 720-PROCESS-VOUCHER.
100000     PERFORM 721-BEGIN-VOUCHER.
100100     PERFORM 722-PROCESS-LEDGER
100200         UNTIL SORT-BC NOT = PREV-BC
100300           OR  SORT-REPORT-CODE NOT = PREV-REPORT-CODE
100400             OR NO-MORE-SORT = "YES".
100500     PERFORM 723-VOUCHER-END.
100600
100700 721-BEGIN-VOUCHER.
100800     MOVE 0 TO VOUCHER-ACTUAL
100900               VOUCHER-QTY
101000               VOUCHER-STANDARD
101100               VOUCHER-VARIANCE.
101200     MOVE SORT-REPORT-CODE TO PREV-REPORT-CODE.
101300     MOVE SORT-REPORT-CODE TO REPORT-CODE-ARG.
           PERFORM 9999-DBGET7-MREPORT-RC-I.
102100     IF GOOD-CALL
102200         MOVE MREPORT-DESC        TO REPORT-DESCR-HDG
102300     ELSE
102400         IF NO-ENTRY
102500             DISPLAY "NO ENTRY IN REPORT CODE MASTER FOR "
102600                          SORT-REPORT-CODE
102700             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
102800             MOVE SPACES          TO REPORT-DESCR-HDG
102900         ELSE
103000             MOVE "DBGET MREPORT * 706-BBC" TO BU-DISPLAY-MSG
103100             PERFORM 990-BLOWUP.
103200
103300     IF SORT-BC = PREV-BC
103400         PERFORM 750-PRINT-HEADINGS.
103500
103600 722-PROCESS-LEDGER.
103700     PERFORM 724-LEDGER-BEGIN.
103800     PERFORM 725-PROCESS-DEPT
103900         UNTIL SORT-BC NOT = PREV-BC
104000           OR  SORT-LEDG NOT = PREV-LEDGER
104100             OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
104200                  OR NO-MORE-SORT = "YES".
104300     PERFORM 726-LEDGER-END.
104400
104500 723-VOUCHER-END.
104600     MOVE PREV-REPORT-CODE TO REPORT-CODE-TRLR.
104700     MOVE MREPORT-DESC     TO REPORT-TRAILER.
104800     MOVE VOUCHER-ACTUAL   TO VOUCHER-ACTUAL-PRT.
104900     MOVE VOUCHER-STANDARD TO VOUCHER-STANDARD-PRT.
105000     MOVE VOUCHER-VARIANCE TO VOUCHER-VARIANCE-PRT.
105100     MOVE VOUCHER-QTY TO VOUCHER-QTY-PRT.
105200     ADD  VOUCHER-ACTUAL   TO BC-ACTUAL.
105300     ADD  VOUCHER-STANDARD TO BC-STANDARD.
105400     ADD  VOUCHER-VARIANCE TO BC-VARIANCE.
105500     ADD  VOUCHER-QTY      TO BC-QTY.
105600     WRITE PRT-REC FROM VOUCHER-LINE AFTER ADVANCING 2 LINES.
105700
105800 724-LEDGER-BEGIN.
105900     MOVE 0 TO LEDGER-ACTUAL
106000               LEDGER-QTY
106100               LEDGER-STANDARD
106200               LEDGER-VARIANCE.
106300     MOVE SORT-LEDG TO PREV-LEDGER.
106400
106500 725-PROCESS-DEPT.
106600     PERFORM 727-DEPT-BEGIN.
106700     PERFORM 728-CLASS-PROCESS
106800         UNTIL SORT-DEPT-CHGD NOT = PREV-DEPT
106900            OR SORT-LEDG NOT = PREV-LEDGER
107000              OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
107100                 OR SORT-BC NOT = PREV-BC
107200                  OR NO-MORE-SORT = "YES".
107300     PERFORM 729-DEPT-END.
107400
107500 726-LEDGER-END.
107600     MOVE PREV-LEDGER TO LEDG-ARG
107700                        LEDG-CODE-TRLR.
           PERFORM 9999-DBGET7-MLEDGER-LD-I.
108500     IF GOOD-CALL
108600         NEXT SENTENCE
108700     ELSE
108800         IF NO-ENTRY
108900             DISPLAY "NO ENTRY IN LEDGER MASTER FOR "
109000                    PREV-LEDGER
109100             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
109200             MOVE "NO LEDGER ENTRY IN LEDGER MASTER"
109300                 TO MLEDGER-DESCR
109400         ELSE
109500             MOVE "DBGET MLEDGER * 726-LE" TO BU-DISPLAY-MSG
109600             PERFORM 990-BLOWUP.
109700     MOVE MLEDGER-DESCR TO LEDGER-TRAILER.
109800     MOVE LEDGER-ACTUAL TO LEDGER-ACTUAL-PRT.
109900     MOVE LEDGER-STANDARD TO LEDGER-STANDARD-PRT.
110000     MOVE LEDGER-VARIANCE TO LEDGER-VARIANCE-PRT.
110100     MOVE LEDGER-QTY TO LEDGER-QTY-PRT.
110200     ADD LEDGER-QTY TO VOUCHER-QTY.
110300     ADD LEDGER-ACTUAL TO VOUCHER-ACTUAL.
110400     ADD LEDGER-STANDARD TO VOUCHER-STANDARD.
110500     ADD LEDGER-VARIANCE TO VOUCHER-VARIANCE.
110600     WRITE PRT-REC FROM LEDGER-LINE AFTER ADVANCING 2.
110700     IF SORT-BC = PREV-BC AND
110800         SORT-REPORT-CODE = PREV-REPORT-CODE
110900         PERFORM 750-PRINT-HEADINGS
111000     ELSE
111100         ADD 2 TO LINE-CNT.
111200
111300 727-DEPT-BEGIN.
111400     MOVE 0 TO DEPT-ACTUAL
111500               DEPT-QTY
111600               DEPT-STANDARD
111700               DEPT-VARIANCE.
111800     MOVE SORT-DEPT-CHGD TO PREV-DEPT.
111900
112000 728-CLASS-PROCESS.
112100     IF SORT-REPORT-CODE = 04
112200         PERFORM 730-NWO-BEGIN
112300         PERFORM 731-DEPT-ACCT-PROCESS
112400            UNTIL SORT-ACCT-CHGD NOT = PREV-NWO
112500                OR SORT-DEPT-CHGD NOT = PREV-DEPT
112600                   OR SORT-LEDG NOT = PREV-LEDGER
112700                       OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
112800                        OR SORT-BC NOT = PREV-BC
112900                         OR NO-MORE-SORT = "YES"
113000         PERFORM 732-NWO-END
113100     ELSE
113200         PERFORM 730-CLASS-BEGIN
113300         PERFORM 731-DEPT-ACCT-PROCESS
113400             UNTIL SORT-CLASS NOT = PREV-CLASS
113500                OR SORT-DEPT-CHGD NOT = PREV-DEPT
113600                     OR SORT-LEDG NOT = PREV-LEDGER
113700                      OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
113800                         OR NO-MORE-SORT = "YES"
113900
114000         PERFORM 732-CLASS-END.
114100
114200 729-DEPT-END.
114300     MOVE PREV-DEPT TO DEPT-KEY
114400                        DEPT-CODE-TRLR.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
115200     IF GOOD-CALL
115300         NEXT SENTENCE
115400     ELSE
115500         IF NO-ENTRY
115600             DISPLAY "NO ENTRY IN MCHT-ACCTS FOR "
115700                    PREV-DEPT
115800             DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
115900             MOVE "NO DEPT ENTRY IN MCHG-ACCTS"
116000                 TO MCHT-DESC
116100         ELSE
116200             MOVE "DBGET MDEPT * 729-DE" TO BU-DISPLAY-MSG
116300             PERFORM 990-BLOWUP.
116400
116500     MOVE MCHT-DESC TO DEPT-TRAILER.
116600     MOVE DEPT-ACTUAL TO DEPT-ACT-PRT.
116700     MOVE DEPT-STANDARD TO DEPT-STD-PRT.
116800     MOVE DEPT-VARIANCE TO DEPT-VAR-PRT.
116900     MOVE DEPT-QTY TO DEPT-QTY-PRT.
117000     ADD DEPT-QTY TO LEDGER-QTY.
117100     ADD DEPT-ACTUAL TO LEDGER-ACTUAL.
117200     ADD DEPT-STANDARD TO LEDGER-STANDARD.
117300     ADD DEPT-VARIANCE TO LEDGER-VARIANCE.
117400     WRITE PRT-REC FROM DEPT-LINE AFTER ADVANCING 2.
117500     IF SORT-BC = PREV-BC AND
117600         SORT-LEDG = PREV-LEDGER AND
117700         SORT-REPORT-CODE = PREV-REPORT-CODE
117800         PERFORM 750-PRINT-HEADINGS
117900     ELSE
118000         ADD 2 TO LINE-CNT.
118100
118200 730-CLASS-BEGIN.
118300     MOVE 0 TO CLASS-ACTUAL
118400               CLASS-QTY
118500               CLASS-STANDARD
118600               CLASS-VARIANCE.
118700     MOVE SORT-CLASS TO PREV-CLASS.
118800
118900 730-NWO-BEGIN.
119000     MOVE 0                       TO NWO-ACTUAL
119100                                     NWO-QTY
119200                                     NWO-STANDARD
119300                                     NWO-VARIANCE.
119400     MOVE SORT-ACCT-CHGD          TO PREV-NWO.
119500
119600
119700 731-DEPT-ACCT-PROCESS.
119800     MOVE SORT-LEDG               TO PRT-LEDGER.
119900     MOVE SORT-DEPT-CHGD          TO PRT-DEPT.
120000     MOVE "-"                     TO PRT-HYPHEN.
120100     MOVE SORT-ACCT-CHGD          TO PRT-ACCOUNT.
120200     MOVE SORT-CLASS              TO PRT-CLASS.
120300     MOVE "-"                     TO PRT-HYPHEN2.
120400     MOVE SORT-CODE-OR-PO         TO PRT-CODE-OR-PO.
120500     MOVE SORT-PO-RLS             TO PRT-RLS.
120600     MOVE SORT-PO-ITEM            TO PRT-ITEM.
120700     MOVE SORT-TRANS-TYPE         TO PRT-TRANS-CODE.
120800     MOVE SORT-DESCR              TO PRT-DESCR.
120900     MOVE SORT-QTY-CHGD           TO PRT-QTY.
121000     IF SORT-DEPT-TYPE1 = "V"
121100         MOVE SORT-VALUE          TO HOLD-VAR
121200         MOVE 0                   TO SORT-STD-VALUE
121300     ELSE
121400         IF SORT-STD-VALUE NOT = 0
121500             COMPUTE HOLD-VAR = SORT-VALUE - SORT-STD-VALUE
121600         ELSE
121700             MOVE 0               TO HOLD-VAR.
121800     MOVE SORT-VALUE              TO PRT-ACTUAL.
121900     MOVE SORT-STD-VALUE          TO PRT-STD.
122000     MOVE SORT-UNIT-MEAS          TO PRT-UM.
122100     MOVE HOLD-VAR                TO PRT-VAR.
122200     IF SORT-REPORT-CODE = 04
122300         ADD SORT-VALUE           TO NWO-ACTUAL
122400         ADD SORT-STD-VALUE       TO NWO-STANDARD
122500         ADD HOLD-VAR             TO NWO-VARIANCE
122600         ADD SORT-QTY-CHGD        TO NWO-QTY
122700     ELSE
122800         ADD SORT-VALUE           TO CLASS-ACTUAL
122900         ADD SORT-STD-VALUE       TO CLASS-STANDARD
123000         ADD SORT-QTY-CHGD        TO CLASS-QTY
123100         ADD HOLD-VAR             TO CLASS-VARIANCE.
123200     WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
123300     ADD 1                        TO LINE-CNT.
123400
123500     IF SORT-VALUE = ZEROS
123600         MOVE "Y"                 TO NO-ACTUAL-VALUE-SW
123700         ADD 1                    TO LINE-CNT
123800         WRITE PRT-REC FROM NO-ACTUAL-ERROR-LINE
123900             AFTER ADVANCING 1.
124000
124100     IF LINE-CNT > 55
124200         PERFORM 750-PRINT-HEADINGS.
124300     MOVE SPACES                  TO PRT-REC
124400                                     DETAIL-LINE.
124500     RETURN SORT-FILE
124600        AT END
124700            MOVE "YES"            TO NO-MORE-SORT.
124800
124900 732-CLASS-END.
125000     MOVE PREV-CLASS TO CLASS-ARG
125100                        CLASS-CODE-TRLR.
           PERFORM 9999-DBGET7-MCLASS-CL-I.
125900     IF GOOD-CALL
126000         NEXT SENTENCE
126100     ELSE
126200         IF NO-ENTRY
126300             MOVE SPACES TO CLASS-TRAILER
126400         ELSE
126500             MOVE "DBGET MCLASS * 732-CE" TO BU-DISPLAY-MSG
126600             MOVE CLASS-ARG       TO BU-DISPLAY-FLD (1)
126700             PERFORM 990-BLOWUP.

126800     MOVE MCLASS-CLASS-DESCR TO CLASS-TRAILER.
126900     MOVE CLASS-ACTUAL TO CLASS-ACT-PRT.
127000     MOVE CLASS-STANDARD TO CLASS-STD-PRT.
127100     MOVE CLASS-VARIANCE TO CLASS-VAR-PRT.
127200     MOVE CLASS-QTY TO CLASS-QTY-PRT.
127300     ADD CLASS-QTY TO DEPT-QTY.
127400     ADD CLASS-ACTUAL TO DEPT-ACTUAL.
127500     ADD CLASS-STANDARD TO DEPT-STANDARD.
127600     ADD CLASS-VARIANCE TO DEPT-VARIANCE.
127700     IF SORT-DEPT-CHGD NOT = PREV-DEPT
127800         WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2
127900         ADD 2 TO LINE-CNT
128000     ELSE
128100         WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2
128200         WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2
128300         ADD 4 TO LINE-CNT.
128400
128500 732-NWO-END.
128600     MOVE PREV-NWO TO NWO-TRLR.
128700     MOVE NWO-ACTUAL TO NWO-ACT-PRT.
128800     MOVE NWO-STANDARD TO NWO-STD-PRT.
128900     MOVE NWO-VARIANCE TO NWO-VAR-PRT.
129000     MOVE NWO-QTY TO NWO-QTY-PRT.
129100     ADD NWO-QTY TO DEPT-QTY.
129200     ADD NWO-ACTUAL TO DEPT-ACTUAL.
129300     ADD NWO-STANDARD TO DEPT-STANDARD.
129400     ADD NWO-VARIANCE TO DEPT-VARIANCE.
129500     WRITE PRT-REC FROM NWO-LINE AFTER ADVANCING 2.
129600     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
129700     ADD 4 TO LINE-CNT.
129800
129900 750-PRINT-HEADINGS.
      *************************************************************
      * IF PRINT-FILE-CTR IS GREATER THAN 100 THEN CLOSE AND REOPEN
      * THE PRINT FILE, SO THAT WE DON'T GET INTO SPOOLFILE SIZE
      * PROBLEMS.
      *************************************************************
           ADD 1 TO PRINT-FILE-CTR.
           IF PRINT-FILE-CTR IS GREATER THAN 100
               MOVE 1 TO PRINT-FILE-CTR
               CLOSE ONLINE-PRT
               OPEN OUTPUT ONLINE-PRT.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
130000*****MOVE CURRENT-DATE TO DATE-H1.
           MOVE DATE-SLASH-OUT TO DATE-H1.
130100*****MOVE TIME-OF-DAY TO TIME-DIV.
           MOVE DATE-UNFORMATTED-TIME-OUT TO TIME-DIV.
130200     MOVE HH-DIV TO HH-H2.
130300     MOVE MM-DIV TO MM-H2.
130400     MOVE SS-DIV TO SS-H2.
130500     MOVE "MY" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
131300     IF GOOD-CALL
131400         NEXT SENTENCE
131500     ELSE
131600         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO BU-DISPLAY-MSG
131700         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
131800         PERFORM 990-BLOWUP.
131900     MOVE MACCT-MONTH TO MONTH-PARM.
132000     MOVE MACCT-YEAR TO YEAR-PARM.
132100     MOVE MONTH-T (MONTH-PARM) TO MONTH-H3.
132200     MOVE YEAR-PARM TO YEAR-H3B.
132300     ADD 1 TO PAGE-CNT.
132400     MOVE PAGE-CNT TO PAGE-H2.
132500     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
132600     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
132700     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
132800     WRITE PRT-REC FROM BC-HDG  AFTER ADVANCING 2.
132900     WRITE PRT-REC FROM REPORT-HDG AFTER ADVANCING 1.
133000     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
133100     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
133200     MOVE 8 TO LINE-CNT.
133300
133400
133500 799-CREATE-EXIT.
133600     EXIT.
133700
133800 900-ERROR SECTION.
133900
134000 990-BLOWUP.
134100     MOVE "TCHGBYBC"              TO  BU-PGM-NAME.
134200
134300***************************************************************
134400**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
134500**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
134600**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
134700**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
134800**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
134900**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
135000**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
135100**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
135200**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
135300**   PROBLEM IS AVOIDED.                                     **
135400***************************************************************
135500
135600     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
135700                           ACCTG-BASE,
135800                           BU-PGM-NAME,
135900                           STATUS-AREA,
136000                           DUMMY-VIEW-AREA,
136100                           FILE-STATUS,
136200                           BU-DISPLAY-MSG,
136300                           BU-DISPLAY-FLDS.
136400
136500
136600 1000-CLOSE-FILES.
136700     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
136800     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

        9999-ROUTINES SECTION.
        COPY OVRPFCALL IN COPYLIB.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           READ MMATL-ACCUM-MC-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-KEY TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-KEY-ARG TO PORCVNO OF DPODATAITM-PO-REC-I.
           START DPODATAITM-PO-I KEY = PORCVNO OF DPODATAITM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-PO-I NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPODATAITM-PO-REC-I NOT = PO-KEY-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MREPORT-RC-I.
           MOVE 0 TO COND-WORD.
           MOVE REPORT-CODE-ARG TO RPTCODE OF MREPORT-RC-REC-I.
           READ MREPORT-RC-I INTO BUF-MREPORT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MLEDGER-LD-I.
           MOVE 0 TO COND-WORD.
           MOVE LEDG-ARG TO LEDGER OF MLEDGER-LD-REC-I.
           READ MLEDGER-LD-I INTO BUF-MLEDGER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-GETFNUM.
      *------ IBM OVERRIDES THE PRINT FILE *SHR BEFORE THE OPEN,
      *------ THUS DOES NOT USE THIS CALL WHICH OCCURS AFTER THE
      *------ OPEN.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN INPUT DPODATAITM-PO-I      .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT MREPORT-RC-I         .
           OPEN INPUT MLEDGER-LD-I         .
           OPEN INPUT MCLASS-CL-I          .

       9999-CLOSE-STUFF.
           CLOSE      DTRANS-MC-I          .
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      DPODATAITM-PO-I      .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      MREPORT-RC-I         .
           CLOSE      MLEDGER-LD-I         .
           CLOSE      MCLASS-CL-I          .
