       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TCHGSEQ.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZOFFLINE-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.
       WORKING-STORAGE SECTION.
       77  RECS-CHGD                        PIC 9(4).
       01  ARG-NO                           PIC 9(9).
       01  BLOWUP-BASE                      PIC X(16).
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
       01  ERROR-BUFFER.
           05  FILLER                       PIC X(28).
           05  ERR-STATUS                   PIC XX.
           05  FILLER                       PIC X(50).
       01  FILE-STATUSES.
           05  DSPLY-STATUS                 PIC XX.
           05  WLNU-STATUS                  PIC XX.
           05  WPF-STATUS                   PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
       01  LAST-WO-USED-DATA.              COPY MLASTWO OF COPYLIB.
       01  SCREEN1.
           05  HSEQ                         PIC XXXX.
           05  HSEQ-9 REDEFINES HSEQ        PIC 9999.
           05  ERRMSG                       PIC X(79).
       COPY DBSTAT  OF COPYLIB.
       COPY TBLOWUP OF COPYLIB.
       01  TRUE-VAL                         PIC 1 VALUE B"1".
       COPY VCOMAREA OF COPYLIB.
       01  WO-ARG                           PIC XX.
       01  WO-PLANNED-DATA.                COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL OF COPYLIB.
       PROCEDURE DIVISION.
       OPEN-PAR.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   WO-LAST-NUM-USED.
           OPEN I-O   WO-PLANNED-FILE.
           MOVE 0 TO RECS-CHGD.
           MOVE SPACES TO SCREEN1.
           PERFORM SHOW-SCREEN.

       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           GOBACK.

       SHOW-SCREEN.
           MOVE "FCHGSEQ" TO VIEW-CFNAME.
           MOVE  SCREEN1  TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN1.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           IF HSEQ NUMERIC
               NEXT SENTENCE
           ELSE
           MOVE 66093 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO ERRMSG
           MOVE TRUE-VAL TO INDS (99)
           GO TO SHOW-SCREEN.
           PERFORM 69-START-WO-PLANNED-FILE.
           IF COND-WORD = 17
               MOVE 66139 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE "FF" TO ERR-STATUS
               MOVE ERROR-BUFFER TO ERRMSG
               MOVE TRUE-VAL TO INDS (99)
               GO TO SHOW-SCREEN.
           PERFORM 60-LOOP-READ-AND-CHG THRU 60-LRAC-EXIT
               UNTIL COND-WORD = 15.
           PERFORM 61-UPDATE-HISTORY-SEQ.
           MOVE SPACES TO SCREEN1.

       60-LOOP-READ-AND-CHG.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-STATUS-P NOT = WO-ARG MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 60-LRAC-EXIT.
           IF PLANNED-SEQNUM = HSEQ-9
               NEXT SENTENCE
           ELSE
           GO TO 60-LOOP-READ-AND-CHG.
           ADD 1 TO PLANNED-SEQNUM.
           REWRITE WPFREC FROM WO-PLANNED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 PERFORM 998-BLOWUP.
           ADD 1 TO RECS-CHGD.
           IF RECS-CHGD = 300 MOVE 15 TO COND-WORD.
       60-LRAC-EXIT.    EXIT.

       61-UPDATE-HISTORY-SEQ.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           MOVE PLANNED-SEQNUM TO LAST-HISTORY-SEQ
           REWRITE WLNUREC FROM LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE "FF" TO WO-ARG.
           MOVE WO-ARG TO WOSTATUS OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TCHGSEQ" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
