000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  TCHKABRT.
000400 AUTHOR.  KURT MOVSESIAN.
000500*REMARKS.
000600**************************************************************
000700*                                                            *
000800*    T C H K A B R T                                         *
000900*                                                            *
001000*      THIS PROGRAM CHECKS THE JCW 'ABORTED'    TO SEE IF    *
001100*      THE ACCOUNTING PROGRAM THAT PROCESSES CSIS DAILY      *
001200*      TRANSACTIONS (TDLYTRNS) HAS ABORTED.  IF IT HAS       *
001300*      ABORTED (ABORTED=1) THEN THE FILE SEQ. COUNTER FOR    *
001400*      LAST ABSTFILE FILE PROCESSED IS MOVED TO A SAVE       *
001500*      AREA SO NO MORE ABSTFILES CAN BE PROCESSED UNTIL      *
001600*      THE ABEND IS RESOLVED.
001700*                                                            *
001800**************************************************************
      *C
      *C   08FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.  IBM-AS400.
002600 OBJECT-COMPUTER.  IBM-AS400.
002700 SPECIAL-NAMES.    LOCAL-DATA IS LOCAL-DATA-AREA.
002600 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MACTINFO-O
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
002700
002800 DATA DIVISION.
002900 FILE SECTION.
       FD  MACTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.
003000
003100 WORKING-STORAGE SECTION.
003200 77  PGM-ABORTED-SW          PIC X       VALUE "N".
       77  MCXCBLERR-SCOPE         PIC X(1)    VALUE "C".
003300
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X       VALUE SPACES.
           05  FILE-STATUS-2       PIC X       VALUE SPACES.

003400**********************************************
003500*                                            *
003600*   JCW PARAMETERS                           *
003700*                                            *
003800**********************************************
003900 COPY JCWAREA IN COPYLIB.
004000*01  JCW-PARMS.
004100*    05  JCW-NAME            PIC X(12)  VALUE SPACES.
004200*    05  JCW-VALUE           PIC S9(4)  COMP  VALUE ZEROS.
004300*    05  JCW-STATUS          PIC S9(4)  COMP  VALUE ZEROS.
004400
004600**************************************************************
004700**************************************************************
004800**                                                          **
004900**                DATABASE I/O BUFFER AREA                  **
005000**                                                          **
005100**************************************************************
005200**************************************************************
005300
005400 COPY MACTINFO IN COPYLIB.

005700 COPY DBCSACCT IN COPYLIB.
005800
005900 COPY DBMODES  IN COPYLIB.
006000
006100 COPY DBSTAT   IN COPYLIB.
006200
006300*********************
006400*                   *
006500*   DATA SET NAMES  *
006600*                   *
006700*********************
006800
006900 01  DSET-NAMES.
007000     05  DSET-NAME         PIC X(16)  VALUE SPACES.
007100     05  DSET-MACCT        PIC X(16)  VALUE "MACCOUNT-INFO;".
007200
007300 01 ITEMS-LISTING.
007400     05  ALL-ITEMS              PIC XX    VALUE "@;".
007500
007600 01  ARG-VALUES.
007700     05  MACCT-KEY              PIC X(4)  VALUE SPACES.
008100
008200 COPY TBLOWUP IN COPYLIB.
008300
008400 COPY VIEWDUM IN COPYLIB.
008500
008700 PROCEDURE DIVISION.
008800
008900 BEGIN-HERE.
009000     PERFORM 1-HSK THRU 1-H-X.
009100
009200     PERFORM 6-MAIN THRU 6-M-X.
009300
009400     PERFORM 2-EOJ  THRU 2-EOJ-X.
009500
009600     GOBACK.
009700
009800 1-HSK.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
009900
010000*****************************************************
010100*                                                   *
010200*    GET THE JCW  'ABORTED'.                        *
010300*                                                   *
010400*****************************************************
010500
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           IF JCW-ABORTED-300 = "1"
011900             MOVE "1"        TO  PGM-ABORTED-SW
012000     ELSE
012100     IF JCW-ABORTED-300 = "2"
012200             MOVE "2"        TO  PGM-ABORTED-SW
012300     ELSE
012400             MOVE "N"        TO  PGM-ABORTED-SW.
012500
012600     DISPLAY "ABORTED-SW = ", PGM-ABORTED-SW.
012700
012800     IF PGM-ABORTED-SW = "N"
012900         NEXT SENTENCE
013000     ELSE
               OPEN I-O MACTINFO-O.
013700
013800 1-H-X.
013900     EXIT.
014000
014100 2-EOJ.
014200     IF PGM-ABORTED-SW = "N"
014300         NEXT SENTENCE
014400     ELSE
               CLOSE MACTINFO-O.
015000
015100 2-EOJ-X.
015200     EXIT.
015300
015500*********************************************
015600*                                           *
015700*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
015800*  FATAL ERROR OCCURS                       *
015900*                                           *
016000*********************************************
016100
016200 2-BLOWUP.
016300     MOVE "TCHKABRT"              TO  BU-PGM-NAME.
016400     CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
016500         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
016600                 BU-DISPLAY-FLDS.
016700
016900**************************************************
017000*                                                *
017100*     6 - M A I N                                *
017200*                                                *
017300**************************************************
017400
017600 6-MAIN.
017700     IF PGM-ABORTED-SW = "N"
017800         GO TO 6-M-X.
018800
018900     MOVE "SEQ "  TO  MACCT-KEY.
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-O.
           READ MACTINFO-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
019300         MOVE "GET MACCOUNT 6-M"     TO  BU-DISPLAY-MSG
019400         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
019500         GO TO 2-BLOWUP.
019600
019700     IF PGM-ABORTED-SW = "1"
019800         IF MACCT-ABST-SEQ = ZEROS
019900             NEXT SENTENCE
020000         ELSE
020100             MOVE MACCT-ABST-SEQ  TO  MACCT-ABST-SAVE
020200             MOVE ZEROS           TO  MACCT-ABST-SEQ
020300     ELSE
020400     IF PGM-ABORTED-SW = "2"
020500         IF MACCT-MNFST-SEQ = ZEROS
020600             NEXT SENTENCE
020700         ELSE
020800             MOVE MACCT-MNFST-SEQ  TO  MACCT-MNFST-SAVE
020900             MOVE ZEROS            TO  MACCT-MNFST-SEQ.

           REWRITE MACTINFO-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
021400         MOVE "UPDATE MACCOUNT 6M" TO BU-DISPLAY-MSG
021500         MOVE MACCT-KEY            TO BU-DISPLAY-FLD (1)
021600         GO TO 2-BLOWUP.
022300
022400 6-M-X.
022500     EXIT.
