000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  TCHTUPDT.
000500
000600*AUTHOR.
000700*
000800*REMARKS.  THIS IS THE AKRON CHAT NUMBER UPDATE PROGRAM.
      *          THIS PROGRAM WILL ADD THE DATA SENT FROM THE
      *          AKRON CHESS SYSTEM TO THE CHESS/CC XREF FILE
      *          MCFPCS5500.  BEFORE CALLING THIS PROGRAM THE
      *          AN OVRDBF SHOULD BE GIVEN FOR FILE(CHATNO)
      *          FOR THE CORRECT MEMBER
      *          IN FILE(CHATNO), WHICH IS NORMALLY MBR(CHATNO01).
      *          BEFORE ANY RECORDS ARE ADDED, THEY WILL BE
      *          SEQUENTIALLY READ AND DELETED.
      *
      *C 06/12/96   JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.

028200 ENVIRONMENT DIVISION.
028300 CONFIGURATION SECTION.
028600 SPECIAL-NAMES. C01 IS NEW-PAGE.
028800
028900 INPUT-OUTPUT SECTION.
029000 FILE-CONTROL.
029100     SELECT  CHAT-FILE  ASSIGN TO DISK-CHATNO
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DCHATNO
                  ASSIGN TO DATABASE-MCFLCS5501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  CHAT-FILE
           LABEL RECORD IS OMITTED.
       01  CHAT-REC             PIC X(133).

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DCHATNO
           LABEL RECORDS ARE STANDARD.
       01  DCHATNO-REC.
           COPY DDS-MCRPCS5500  OF MCFLCS5501.

       WORKING-STORAGE SECTION.
       77  BASE                          PIC X(10)   VALUE "  STORES;".
       77  PASSWORD                      PIC X(8)    VALUE "JADE;   ".
       77  DSET-NAME                     PIC X(16).
       77  CODE-ARG                      PIC X(8)  VALUE ZEROS.
       77  ALL-ITEMS                     PIC XX    VALUE "@;".
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
       77  FIRST-WRITE                   PIC X(1)  VALUE "Y".

       01  CHAT-WS-RCD.
           03  HASP-CONTROL-BYTE         PIC X.
           03  CHAT-DATA.
               05  WS-CC.
                   10  WS-CC-1           PIC X(1).
                   10  FILLER            PIC X(7).
               05  WS-CHATNO             PIC X(6).
               05  WS-MFR                PIC X(26).
               05  WS-TRADE-NAME         PIC X(79).

       COPY TBLOWUP    IN COPYLIB.

      **************************************************************
      **                                                          **
      **       D A T A B A S E   W O R K                          **
      **                                                          **
      **************************************************************
       01  MODE1                       PIC S9(4) COMP-4 VALUE 1.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  STATUS-AREA.
           05  COND-WORD               PIC S9(4)   COMP-4.
           05  DATA-LENG               PIC S9(4)   COMP-4.
           05  REC-NO                  PIC S9(9)   COMP-4.
           05  CHAIN-LENG              PIC S9(9)   COMP-4.
           05  BKWD-ADDR               PIC S9(9)   COMP-4.
           05  FRWD-ADDR               PIC S9(9)   COMP-4.

       01  DSET-NAMES.
           05  DSET-DCHATNO            PIC X(16)  VALUE "DCHATNO;".
           05  DSET-MSTORERM           PIC X(16)  VALUE "MSTORERM;".

       01  CODE-SEARCH                   PIC X(16) VALUE "CORP-CODE;".

      **************************************************************
      **                                                          **
      **       D A T A B A S E   B U F F E R S                    **
      **                                                          **
      **************************************************************
       COPY MSTORERM   IN COPYLIB.
       COPY DCHATNO    IN COPYLIB.

       PROCEDURE DIVISION.
       LOAD-PROCEDURE.
           MOVE "Y" TO FIRST-WRITE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
           OPEN INPUT MSTORERM.
           OPEN I-O DCHATNO.
           OPEN INPUT CHAT-FILE.
           IF FILE-STATUS NOT = "00"
               MOVE "OPEN FAIL OF CHAT-FILE" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           CLOSE MSTORERM, CHAT-FILE, DCHATNO.
           GOBACK.

       2-BLOWUP.
           MOVE "CHATUPDT"               TO  BU-PGM-NAME.
           MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       6-MAIN.
           READ CHAT-FILE
               AT END GO TO 6-MAIN-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERROR OF CHAT FILE" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           MOVE CHAT-REC  TO  CHAT-WS-RCD.
           IF WS-CC  = SPACES  OR WS-CC-1 = "*"
               GO TO 6-MAIN.

           MOVE WS-CC TO CORPCDE OF MSTORERM.
           READ MSTORERM INTO BUF-MSTORERM
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               GO TO 6-MAIN.

           IF FIRST-WRITE = "Y"
               MOVE "N" TO FIRST-WRITE
               PERFORM 61-CLEAR-DCHATNO THRU 61-EXIT.

           MOVE CHAT-DATA TO BUF-DCHATNO.
           WRITE DCHATNO-REC FROM BUF-DCHATNO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-WRITE.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DCHATNO ERROR" TO BU-DISPLAY-MSG
               MOVE WS-CC TO BU-DISPLAY-FLD (1)
               MOVE WS-CHATNO TO BU-DISPLAY-FLD (2)
               PERFORM 2-BLOWUP.

           GO TO 6-MAIN.

       6-MAIN-X.
           EXIT.

       61-CLEAR-DCHATNO.
           MOVE SPACES TO CORPCDE OF DCHATNO-REC.
           START DCHATNO KEY NOT < CORPCDE OF DCHATNO-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-START.
           IF FILE-STATUS NOT = "00"
              GO TO 61-EXIT
           END-IF.
       61-LOOP-DCHATNO.
           READ DCHATNO NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
               GO TO 61-EXIT.
           DELETE DCHATNO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-DELETE.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE ERROR DCHATNO" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP
           END-IF.
           GO TO 61-LOOP-DCHATNO.
       61-EXIT.
           EXIT.
