001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID. TCKM1000.
      *REMARKS. THIS PROGRAM READS MCFPMM1000 (WO-BASIC) AND VERIFIES
      *C          THAT THERE IS A CORRESPONDING MCFPMM0100 (WO-NUMBER)
      *C          ENTRY PRESENT. IF NOT, THE USER HAS THE OPTION OF
      *C          ADDING THE MISSING ENTRY.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER. AS400.
001600 OBJECT-COMPUTER. AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT WO-NUMBER-FILE
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
001700 DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINTF.
       01  PRINTF                PIC X(132).
       FD  WO-NUMBER-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WNFREC.
       01  WNFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
001800 WORKING-STORAGE SECTION.
       77  LINE-CTR                        PIC 99   VALUE 60.
001900 77  NO-MATCH-CTR                    PIC 9(4) VALUE 0.
       77  SUB1                            PIC 9(4) VALUE 0.
002000 77  WO-CTR                          PIC 9(5) VALUE 0.
       01  ANSWER-ME                       PIC X.
002100 01  DBPARAMETERS.        COPY DBPARMS IN COPYLIB.
       01  DETAIL-LINE.
           05  D-WO                        PIC X(10).
           05  D-LIT                       PIC X(70).
       01  FILE-STATUS                     PIC XX.
       01  HEADER-0.
           05  FILLER                      PIC X(32)
             VALUE "THE FOLLOWING BASIC WORK ORDERS ".
           05  FILLER                      PIC X(48)
             VALUE "HAVE NO CORRESPONDING WO-NUMBER RECORD".
       01  HEADER-1.
           05  FILLER                      PIC X(80) VALUE ALL "-".
       COPY OVRPFDATA IN COPYLIB.
002300 COPY DBSTAT    IN COPYLIB.
002700 01  TABLE-WO-NUMS.
002800     05  TAB-WO OCCURS 2500 TIMES    PIC X(10).
       01  TIME-OF-DAY                     PIC X(8).
002900 01  WO-BASIC-DATA.       COPY DWOBASIC IN COPYLIB.
003200 PROCEDURE DIVISION.
003300 START-PGM.
003400     PERFORM 1-HSK.
003500     PERFORM 6-MAIN.
003600 2-EOJ.
           CLOSE PRINT-FILE.
           CLOSE WO-NUMBER-FILE.
           CLOSE WO-BASIC-FILE.
003800     GOBACK.
003900 1-HSK.
004000     MOVE LOW-VALUES TO STATUS-AREA.
004100     MOVE SPACES TO TABLE-WO-NUMS.
           OPEN OUTPUT PRINT-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN I-O    WO-NUMBER-FILE.
           OPEN INPUT  WO-BASIC-FILE.
005600 6-MAIN.
           MOVE 0 TO COND-WORD.
005700     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
005800         AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
005900     IF COND-WORD = 11
006000         DISPLAY "TOTAL WO NUMBERS READ = " WO-CTR
006100         DISPLAY "TOTAL W/O'S NO MATCH  = " NO-MATCH-CTR
               MOVE "N" TO ANSWER-ME
               DISPLAY "DO YOU WANT TO ADD NON-MATCHES (Y/N)?"
               ACCEPT ANSWER-ME
               IF ANSWER-ME = "N"
                   GO TO 2-EOJ
               ELSE
006200         PERFORM 60-ADD-WO-NUMBERS THRU 60-AWN-X
                   VARYING SUB1 FROM 1 BY 1
                   UNTIL (SUB1 > 2500) OR (TAB-WO (SUB1) = SPACES)
006400         GO TO 2-EOJ.
007100     IF WO-NUM = "999999M   " OR "          "
               MOVE WO-NUM TO D-WO
               MOVE " EXISTS IN WO-BASIC" TO D-LIT
               ADD 1 TO LINE-CTR
               PERFORM 6-WRITE-LINE
               GO TO 6-MAIN.
           ACCEPT TIME-OF-DAY FROM TIME.
007200     ADD 1 TO WO-CTR.
007300     IF WO-CTR = 1000
007400         DISPLAY "1000 RECORDS HAVE BEEN READ  " TIME-OF-DAY
007500     ELSE
007600     IF WO-CTR = 5000
007700         DISPLAY "5000 RECORDS HAVE BEEN READ  " TIME-OF-DAY
007800     ELSE
007900     IF WO-CTR = 10000
008000         DISPLAY "10000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008100     ELSE
008200     IF WO-CTR = 15000
008300         DISPLAY "15000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008400     ELSE
008500     IF WO-CTR = 20000
008600         DISPLAY "20000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008700     ELSE
008800     IF WO-CTR = 25000
008900         DISPLAY "25000 RECORDS HAVE BEEN READ " TIME-OF-DAY
009000     ELSE
009100     IF WO-CTR = 30000
009200         DISPLAY "30000 RECORDS HAVE BEEN READ " TIME-OF-DAY.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM TO WONUM OF WNFREC.
           START WO-NUMBER-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
O09700     IF COND-WORD = 0 GO TO 6-MAIN.
011400     ADD 1 TO NO-MATCH-CTR.
011500     IF NO-MATCH-CTR > 2500
011600         DISPLAY "THERE ARE MORE THAN 2500  MISMATCHES"
011700         DISPLAY "ONLY THE FIRST 2500  WILL BE ADDED"
               DISPLAY "PLEASE RE-EXECUTE THE PROGRAM TO"
               DISPLAY "HANDLE THE REST"
012000         DISPLAY "TOTAL WO NUMBERS READ = " WO-CTR
012100         DISPLAY "TOTAL W/O'S NO MATCH  = " NO-MATCH-CTR
               MOVE "N" TO ANSWER-ME
               DISPLAY "DO YOU WANT TO ADD NON-MATCHES (Y/N)?"
               ACCEPT ANSWER-ME
               IF ANSWER-ME = "N"
                   GO TO 2-EOJ
               ELSE
012200         PERFORM 60-ADD-WO-NUMBERS  THRU 60-AWN-X
                   VARYING SUB1 FROM 1 BY 1
                   UNTIL (SUB1 > 2500) OR (TAB-WO (SUB1) = SPACES)
012400         GO TO 2-EOJ
012500     ELSE
           MOVE SPACES TO DETAIL-LINE
012600     MOVE WO-NUM TO TAB-WO (NO-MATCH-CTR), D-WO
           ADD 1 TO LINE-CTR
           PERFORM 6-WRITE-LINE
012700     GO TO 6-MAIN.

       6-WRITE-LINE.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               WRITE PRINTF FROM HEADER-0 AFTER NEW-PAGE
               WRITE PRINTF FROM HEADER-1 AFTER 1
               WRITE PRINTF FROM DETAIL-LINE AFTER 1
               MOVE 3 TO LINE-CTR
           ELSE
           WRITE PRINTF FROM DETAIL-LINE AFTER 1.

       60-ADD-WO-NUMBERS.
           MOVE 0 TO COND-WORD.
           MOVE TAB-WO (SUB1) TO WONUM OF WNFREC.
           WRITE WNFREC INVALID KEY    MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE TAB-WO (SUB1) TO D-WO
               MOVE " WAS NOT ADDED TO WO-NUMBER FILE" TO D-LIT
               ADD 1 TO LINE-CTR
               PERFORM 6-WRITE-LINE
               GO TO 60-AWN-X
           ELSE
           MOVE TAB-WO (SUB1) TO D-WO
           MOVE " WAS SUCCESSFULLY ADDED TO WO-NUMBER " TO D-LIT
           ADD 1 TO LINE-CTR
           PERFORM 6-WRITE-LINE.

       60-AWN-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.
