001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID. TCLNMMIS.
      *REMARKS. THIS PROGRAM CLEANS UP THE WO-NUMBER FILE BY READING
      *C          IT SEQUENTIALLY AND THEN CHECKING TO SEE IF THE
      *C          WORK ORDER NUMBER EXISTS IN EITHER MCFPMM1000 (WO-BASIC)
      *C          OR MCFPMM1100 (WO-PLANNED). IF NOT, IT IS DELETED.
      *C
      *C        SEPTEMBER 1996  JE COFFMAN  REQ# 6619
      *C          RE-COMPILED THE PROGRMA TO PICK UP FILE CHANGES
      *C          TO DATE FIELDS FOR YEAR 2000 COMPLIANCE.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER. AS400.
001600 OBJECT-COMPUTER. AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT WO-NUMBER-FILE
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
001700 DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINTF.
       01  PRINTF                PIC X(132).
       FD  WO-NUMBER-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WNFREC.
       01  WNFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
001800 WORKING-STORAGE SECTION.
       77  LINE-CTR                        PIC 99   VALUE 60.
001900 77  NO-MATCH-CTR                    PIC 9(4) VALUE 0.
002000 77  WO-CTR                          PIC 9(5) VALUE 0.
       01  ANSWER-ME                       PIC X.
002100 01  DBPARAMETERS.        COPY DBPARMS IN COPYLIB.
       01  DETAIL-LINE.
           05  D-WO                        PIC X(10).
           05  D-LIT                       PIC X(70).
       01  FILE-STATUS                     PIC XX.
       01  HEADER-0.
           05  FILLER                      PIC X(34)
             VALUE "THE FOLLOWING WORK ORDERS HAVE NO ".
           05  FILLER                      PIC X(46)
             VALUE "CORRESPONDING BASIC OR PLANNED RECORD ".
       01  HEADER-1.
           05  FILLER                      PIC X(80) VALUE ALL "-".
       COPY OVRPFDATA IN COPYLIB.
002300 COPY DBSTAT  IN COPYLIB.
002700 01  TABLE-WO-NUMS.
002800     05  TAB-WO OCCURS 2500 TIMES    PIC X(10).
       01  TIME-OF-DAY                     PIC X(8).
002900 01  WO-BASIC-DATA.       COPY DWOBASIC IN COPYLIB.
003000 01  WO-NUMBER-BUF                   PIC X(10).
003100 01  WO-PLANNED-DATA.     COPY DWOPLAN  IN COPYLIB.
003200 PROCEDURE DIVISION.
003300 START-PGM.
003400     PERFORM 1-HSK.
003500     PERFORM 6-MAIN.
003600 2-EOJ.
           CLOSE PRINT-FILE.
           CLOSE WO-NUMBER-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-PLANNED-FILE.
003800     GOBACK.
003900 1-HSK.
004000     MOVE LOW-VALUES TO STATUS-AREA.
004100     MOVE SPACES TO TABLE-WO-NUMS.
           OPEN INPUT  WO-NUMBER-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
           OPEN OUTPUT PRINT-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
005600 6-MAIN.
           MOVE 0 TO COND-WORD.
005700     READ WO-NUMBER-FILE INTO WO-NUMBER-BUF
005800         AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
005900     IF COND-WORD = 11
006000         DISPLAY "TOTAL WO NUMBERS READ = " WO-CTR
006100         DISPLAY "TOTAL W/O'S NO MATCH  = " NO-MATCH-CTR
               MOVE "N" TO ANSWER-ME
               DISPLAY "DO YOU WANT TO DELETE NON-MATCHES (Y/N)?"
               ACCEPT ANSWER-ME
               IF ANSWER-ME = "N"
                   GO TO 2-EOJ
               ELSE
006200         CALL "TDELMMIS" USING DBPARAMETERS STATUS-AREA
006300                           TABLE-WO-NUMS
006400         GO TO 2-EOJ.
007100     IF WO-NUMBER-BUF = "999999M   " OR "          "
               MOVE WO-NUMBER-BUF TO D-WO
               MOVE " EXISTS IN WO-NUMBER" TO D-LIT
               ADD 1 TO LINE-CTR
               PERFORM 6-WRITE-LINE
               GO TO 6-MAIN.
           ACCEPT TIME-OF-DAY FROM TIME.
007200     ADD 1 TO WO-CTR.
007300     IF WO-CTR = 1000
007400         DISPLAY "1000 RECORDS HAVE BEEN READ  " TIME-OF-DAY
007500     ELSE
007600     IF WO-CTR = 5000
007700         DISPLAY "5000 RECORDS HAVE BEEN READ  " TIME-OF-DAY
007800     ELSE
007900     IF WO-CTR = 10000
008000         DISPLAY "10000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008100     ELSE
008200     IF WO-CTR = 15000
008300         DISPLAY "15000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008400     ELSE
008500     IF WO-CTR = 20000
008600         DISPLAY "20000 RECORDS HAVE BEEN READ " TIME-OF-DAY
008700     ELSE
008800     IF WO-CTR = 25000
008900         DISPLAY "25000 RECORDS HAVE BEEN READ " TIME-OF-DAY
009000     ELSE
009100     IF WO-CTR = 30000
009200         DISPLAY "30000 RECORDS HAVE BEEN READ " TIME-OF-DAY.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER-BUF TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
O09700     IF COND-WORD = 0
               PERFORM 69-READ-WO-BASIC-FILE
010000         IF COND-WORD NOT = 0
010100             NEXT SENTENCE
010200         ELSE
010300         GO TO 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER-BUF TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
010700     IF COND-WORD = 0
               PERFORM 69-READ-WO-PLANNED-FILE
011000         IF COND-WORD NOT = 0
011100             NEXT SENTENCE
011200         ELSE
011300         GO TO 6-MAIN.
011400     ADD 1 TO NO-MATCH-CTR.
011500     IF NO-MATCH-CTR > 2500
011600         DISPLAY "THERE ARE MORE THAN 2500  MISMATCHES"
011700         DISPLAY "ONLY THE FIRST 2500  WILL BE DELETED"
011800         DISPLAY "PLEASE RE-EXECUTE THE PROGRAM TO CLEAN"
011900         DISPLAY "OUT THE REST@@@"
012000         DISPLAY "TOTAL WO NUMBERS READ = " WO-CTR
012100         DISPLAY "TOTAL W/O'S NO MATCH  = " NO-MATCH-CTR
               MOVE "N" TO ANSWER-ME
               DISPLAY "DO YOU WANT TO DELETE NON-MATCHES (Y/N)?"
               ACCEPT ANSWER-ME
               IF ANSWER-ME = "N"
                   GO TO 2-EOJ
               ELSE
012200         CALL "TDELMMIS" USING DBPARAMETERS STATUS-AREA
012300                           TABLE-WO-NUMS
012400         GO TO 2-EOJ
012500     ELSE
012600     MOVE WO-NUMBER-BUF TO TAB-WO (NO-MATCH-CTR), D-WO
           MOVE " IS DELETEABLE" TO D-LIT
           ADD 1 TO LINE-CTR
           PERFORM 6-WRITE-LINE.
012700     GO TO 6-MAIN.

       6-WRITE-LINE.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               WRITE PRINTF FROM HEADER-0 AFTER NEW-PAGE
               WRITE PRINTF FROM HEADER-1 AFTER 1
               WRITE PRINTF FROM DETAIL-LINE AFTER 1
               MOVE 3 TO LINE-CTR
           ELSE
           WRITE PRINTF FROM DETAIL-LINE AFTER 1.

       69-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
009800     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
009900         AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
009800     READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
009900         AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       COPY OVRPFCALL IN COPYLIB.
