000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TCLRMEMP.
000400 AUTHOR.              JIM COFFMAN.
000500 DATE-WRITTEN.        05/21/94.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS PROGRAM RUNS OUT OF SLEEPER AND IS USED TO CLEAR THE
001100*D   BUCKETS IN MEMPL THAT ARE MAINTAINED FOR APPROVER DAILY,
001200*D   WEEKLY AND MONTHLY AMOUNTS.
001700 ENVIRONMENT DIVISION.
001800 CONFIGURATION SECTION.
001900 SOURCE-COMPUTER.  AS400.
002000 OBJECT-COMPUTER.  AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL
                  ASSIGN TO DATABASE-MCFLCS4201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
002100
002200 DATA DIVISION.
       FILE SECTION.
       FD  MEMPL
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
002300 WORKING-STORAGE SECTION.
       77  SAVE-COMPANY                  PIC XXX   VALUE SPACES.

004900 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
005000
008200 01  BLOWUP-BASE                   PIC X(10).

       01  BUILD-YEAR.
           05  BUILD-CC                  PIC 9(2).
           05  BUILD-YY                  PIC 9(2).

       01  CUR-DATE.
           05  CUR-DATE-YY               PIC XX.
           05  CUR-DATE-MM               PIC XX.
           05  CUR-DATE-DD               PIC XX.

008500 COPY DBSTAT     IN COPYLIB.

003500 01  DSET-NAMES.
003600     05  DSET-NAME                 PIC X(16) VALUE SPACES.
           05  DSET-MEMPL                PIC X(16) VALUE "MEMPL;".
003900
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".
003400
       01  JULIAN-DDD                    PIC 9(3).

       COPY MEMPL      IN COPYLIB.
007400
004000 01  MODE-AREA.
004100     05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
004200     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
004300     05  MODE2                     PIC S9(4)   COMP       VALUE 2.
004400     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
004500     05  MODE4                     PIC S9(4)   COMP       VALUE 4.
004600     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
004700     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
004800
       COPY MPLTINFO   IN COPYLIB.
       COPY MPLTRQGB   IN COPYLIB.

003700 01  PASSED-YEAR                   PIC 9(4).
001900 01  PASSED-DDD                    PIC 9(3).
003700 01  RETURN-DOW                    PIC X(2).

       01  PLT-ARG                       PIC X(4).

008800 COPY REQGLOBS   IN COPYLIB.

       COPY TBLOWUP    IN COPYLIB.

       COPY VCOMLINK   IN COPYLIB.

009400 PROCEDURE DIVISION.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.

       2-EOJ.
           CLOSE MEMPL, MPLTINFO.
018900     GOBACK.
019000
076200 2-BLOWUP.
076300     MOVE "TCLRMEMP" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       1-HSK.
           OPEN I-O MEMPL, MPLTINFO.
056400     MOVE "RQGB"               TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD
           END-READ
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
           END-IF
056700     IF GOOD-CALL
056800         MOVE MPLTINFO-RQGB    TO   REQ-GLOBALS
056900     ELSE
057000     IF NO-ENTRY
057100         MOVE "Y"              TO   MPLT-PRINT-WO-REQPK
057200         MOVE "N"              TO   MPLT-WOAP-TO-CUT-REQ
057300         MOVE "N"              TO   MPLT-WOAP-TO-APP-REQ
               MOVE "N"              TO   MPLT-DISPLAY-APP-AMTS
057400     ELSE
057500     MOVE "DBGET ERR MPLT RQGB 1-HSK" TO BU-DISPLAY-MSG
057600     PERFORM 2-BLOWUP.

           DISPLAY "MPLTINFO APP-AMTS-SW = " MPLT-DISPLAY-APP-AMTS.

           IF MPLT-DISPLAY-APP-AMTS = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 2-EOJ.

           MOVE "P 01" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD
           END-READ
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
           END-IF
056700     IF GOOD-CALL
056800         MOVE MPLTINFO-COMPANY TO   SAVE-COMPANY
056900     ELSE
057500     MOVE "READ ERR MPLT P 01 1-HSK" TO BU-DISPLAY-MSG
057600     PERFORM 2-BLOWUP.

           ACCEPT CUR-DATE FROM DATE.
           DISPLAY "CURRENT DATE           = " CUR-DATE.
           IF CUR-DATE-YY < 80
               MOVE 20      TO BUILD-CC
           ELSE
           MOVE 19          TO BUILD-CC.

           MOVE CUR-DATE-YY  TO BUILD-YY.
           MOVE BUILD-YEAR   TO PASSED-YEAR.

           MOVE ZEROS   TO JULIAN-DDD.
           DISPLAY "PASSED YEAR TO CJULIAN = " PASSED-YEAR.
           DISPLAY "PASSED MTH  TO CJULIAN = " CUR-DATE-MM.
           DISPLAY "PASSED DAY  TO CJULIAN = " CUR-DATE-DD.
           CALL "CJULIAN"  USING PASSED-YEAR, CUR-DATE-MM, CUR-DATE-DD,
                             JULIAN-DDD.
           DISPLAY "PASSED YEAR  TO CDAYOFWK = " PASSED-YEAR.
           DISPLAY "PASSED JUL   TO CDAYOFWK = " JULIAN-DDD.
           CALL "CDAYOFWK"  USING PASSED-YEAR, JULIAN-DDD, RETURN-DOW.
           DISPLAY "RETURN DOW FROM CDAYOFWK = " RETURN-DOW.

       6-MAIN.
           MOVE 0 TO COND-WORD.
           READ MEMPL NEXT INTO BUF-MEMPL
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
           IF COND-WORD = 11 GO TO 6-MAIN-X.
           MOVE ZEROES TO MEMPL-TODAY-BUCKET.
      *    IF RETURN-DOW = "SU" AND SAVE-COMPANY = "153" OR "631"
           IF RETURN-DOW = "SU"
               MOVE ZEROES TO MEMPL-WEEKS-BUCKET.
           IF CUR-DATE-DD = "01"
               MOVE ZEROES TO MEMPL-TOTAL-BUCKET.
           REWRITE MEMPL-REC FROM BUF-MEMPL
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "MEMPL REWRITE ERROR *TCLRMEMP*"
                   TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           GO TO 6-MAIN.
       6-MAIN-X.    EXIT.
