       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCNOTICE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT AUTH-FILE
               ASSIGN TO DATABASE-MCFLCSAUTH
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZCNOTICE-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  AUTH-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS AF-REC.
       01  AF-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCSAUTH.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC             PIC X(2000).

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0701.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE        PIC X(80).

       WORKING-STORAGE SECTION.
       77  LINE-CTR              PIC 99   VALUE 59.
       77  OK-PRT                PIC X.
       77  SUB                   PIC S9(4) COMP.

       01  AUTH-BUF.
           05  AUTH-USERNAME     PIC X(10).
           05  AUTH-PRICE-SW     PIC X.
           05  FILLER            PIC X(09).

       01  BUILD-PO-ARG.
           05  FILLER            PIC X    VALUE "P".
           05  BUILD-PO-7        PIC X(7) VALUE SPACES.
           05  BUILD-PO-REL      PIC X(3) VALUE SPACES.
           05  FILLER            PIC X(3) VALUE "000".

       COPY CPYIND     IN COPYLIB.

       01  CURRENT-DATE-WA.
           05  CD-Y              PIC 99.
           05  CD-M              PIC 99.
           05  CD-D              PIC 99.

       01  CURRENT-TIME.
           05  CUR-TIME          PIC X(4).
           05  FILLER            PIC 99.

       COPY DBSTAT     IN COPYLIB.

       COPY DPOITEM    IN COPYLIB.

       COPY DPORECD    IN COPYLIB.

       COPY DVENDOR    IN COPYLIB.

       01  DSPLY-STATUS          PIC XX.

       01  DTL1.
           05  FILLER  PIC X(7)  VALUE "DATE   ".
           05  D1-DATE PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "----REASON ".
           05  FILLER  PIC X(28)
               VALUE "(USE X OR TYPE IN OTHER)----".
           05  FILLER  PIC X(23) VALUE SPACES.

       01  DTL2.
           05  FILLER  PIC X(7)  VALUE "REQ #  ".
           05  D2-REQ  PIC X(12) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "CHANGE PRICE".
           05  D2-CHP  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "CHANGE QTY ".
           05  D2-CHQ  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "ADD TO ORDER ".
           05  D2-ATO  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE SPACES.

       01  DTL3.
           05  FILLER  PIC X(7)  VALUE "PO #   ".
           05  D3-PO   PIC X(12) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "CANCEL ITEM  ".
           05  D3-CI   PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "CANCEL PO# ".
           05  D3-CPO  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "NEW ITEM     ".
           05  D3-NI   PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.

       01  DTL4.
           05  FILLER  PIC X(7)  VALUE "BUYER  ".
           05  D4-BUY  PIC X(12) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "OBSOLETE IT  ".
           05  D4-OBS  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "SCRAP      ".
           05  D4-SCR  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "ERROR        ".
           05  D4-ERR  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE SPACES.

       01  DTL5.
           05  FILLER  PIC X(11) VALUE SPACES.
           05  FILLER  PIC X(7)  VALUE "OTHER:".
           05  D5-OTH  PIC X(40) VALUE SPACES.
           05  FILLER  PIC X(22) VALUE SPACES.

       01  DTL6.
           05  FILLER  PIC X(17) VALUE SPACES.
           05  D6-VEN  PIC X(44) VALUE SPACES.
           05  FILLER  PIC X(19) VALUE SPACES.

       01  DTL7.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  D7-ITM  PIC Z(4).
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  D7-QTY  PIC Z(8).
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  D7-CDE  PIC X(30) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  D7-PRI  PIC Z(10).
           05  FILLER  PIC X(9)  VALUE SPACES.

       01  DTL8.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "REMARKS:  ".
           05  D8-RM1  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X(29)
               VALUE "ESTIMATED PRICE:  INCREASE $".
           05  D8-PRI  PIC Z(10).

       01  DTL9.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  D9-RM2  PIC X(30) VALUE SPACES.
           05  FILLER  PIC X(41) VALUE SPACES.

       01  DTL10.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "RECORDS ONLY ".
           05  D10-RO  PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X     VALUE SPACE.
           05  FILLER  PIC X(14) VALUE "CPY TO VENDOR ".
           05  D10-CP  PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X(18) VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "DECREASE $ ".
           05  D10-PRI PIC Z(10).

       01  DTL11.
           05  FILLER  PIC X(39) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "AUTHORITY ".
           05  D11-AU  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X     VALUE SPACE.
           05  FILLER  PIC X(5)  VALUE "DEPT ".
           05  D11-DP  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X     VALUE SPACE.

       01  FILE-STATUS           PIC XX.

       01  HDR0.
           05  FILLER  PIC X(37) VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE "STORES".
           05  FILLER  PIC X(37) VALUE SPACES.

       01  HDR1.
           05  FILLER  PIC X(27) VALUE SPACES.
           05  FILLER  PIC X(12) VALUE "REQUEST FOR ".
           05  FILLER  PIC X(13) VALUE "CHANGE NOTICE".
           05  FILLER  PIC X(28) VALUE SPACES.

       01  HDR3.
           05  FILLER  PIC X(27) VALUE SPACES.
           05  FILLER  PIC X(25) VALUE ALL "_".
           05  FILLER  PIC X(28) VALUE SPACES.

       01  HDR4.
           05  FILLER  PIC X(17) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "((((((((((   ".
           05  FILLER  PIC X(18) VALUE "VENDOR INFORMATION".
           05  FILLER  PIC X(13) VALUE "   ))))))))))".
           05  FILLER  PIC X(19) VALUE SPACES.

       01  HDR5.
           05  FILLER  PIC X(33) VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "DESCRIPTION".
           05  FILLER  PIC X(17) VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE "PRICE ".
           05  FILLER  PIC X(13) VALUE SPACES.

       01  HDR6.
           05  FILLER  PIC X(80) VALUE ALL "_".

       01  HDR7.
           05  FILLER  PIC X(26) VALUE SPACES.
           05  FILLER  PIC X(23)
               VALUE "----ORDER NOW READS----".
           05  FILLER  PIC X(31) VALUE SPACES.

       01  HDR8.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE "ITM#".
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE "QUANTITY".
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(32)
               VALUE "STORES CODE OR OTHER DESCRIPTION".
           05  FILLER  PIC X(21) VALUE SPACES.

       01  HDR9.
           05  FILLER  PIC X(26) VALUE SPACES.
           05  FILLER  PIC X(23)
               VALUE "----CHANGE TO READ----".
           05  FILLER  PIC X(31) VALUE SPACES.

       01  INPUT-POBUF.
           05  INPUT-PO7         PIC X(7).
           05  INPUT-POREL.
               10  IPO-REL1      PIC X.
               10  IPO-REL2      PIC X.
               10  IPO-REL3      PIC X.
           05  INPUT-CN-ITEMS.
               10  INPUT-CNIT1   PIC X(4).
               10  INPUT-CNIT2   PIC X(4).
               10  INPUT-CNIT3   PIC X(4).
               10  INPUT-CNIT4   PIC X(4).
               10  INPUT-CNIT5   PIC X(4).
               10  INPUT-CNIT6   PIC X(4).
               10  INPUT-CNIT7   PIC X(4).
               10  INPUT-CNIT8   PIC X(4).
           05  INPUT-CMD-LINE0   PIC X(79).
           05  INPUT-ERR-LINE0   PIC X(79).

       01  INPUT-BUFFER.
           05  IB1.
               10  INPUT-DATE    PIC X(8).
               10  INPUT-REQNO   PIC X(12).
               10  INPUT-CHGPRI  PIC X(4).
               10  INPUT-CHGQTY  PIC X(4).
               10  INPUT-ADDORD  PIC X(4).
               10  INPUT-PO      PIC X(12).
               10  INPUT-CANITM  PIC X(4).
               10  INPUT-CANPO   PIC X(4).
               10  INPUT-NEWITM  PIC X(4).
               10  INPUT-BUYER   PIC X(12).
               10  INPUT-OBSITM  PIC X(4).
               10  INPUT-SCRAP   PIC X(4).
               10  INPUT-ERROR   PIC X(4).
               10  INPUT-OTHER   PIC X(40).
               10  INPUT-VENDOR  PIC X(44).
               10  INPUT-VENDO2  PIC X(44).
               10  INPUT-VENDO3  PIC X(44).
           05  IB1-BYTES REDEFINES IB1.
               10  IB1-BYTE OCCURS 252 TIMES  PIC X.
           05  INPUT-CMD-LINE    PIC X(79).
           05  INPUT-ERR-LINE    PIC X(79).

       01  INPUT-BUFFER-SAVE.
           05  IB1S-BYTE OCCURS 252  PIC X.

       01  INPUT-BUFFER2.
           05  IB2.
               10  INPUT-ITM1    PIC X(4).
               10  INPUT-ITM1-Z REDEFINES INPUT-ITM1
                                 PIC Z(4).
               10  INPUT-QTY1    PIC X(8).
               10  INPUT-QTY1-Z REDEFINES INPUT-QTY1
                                 PIC Z(8).
               10  INPUT-CODE1   PIC X(30).
               10  INPUT-PRICE1  PIC X(10).
               10  INPUT-PRICE1-Z REDEFINES INPUT-PRICE1
                                 PIC Z(10).
               10  INPUT-ITM2    PIC X(4).
               10  INPUT-ITM2-Z REDEFINES INPUT-ITM2
                                 PIC Z(4).
               10  INPUT-QTY2    PIC X(8).
               10  INPUT-QTY2-Z REDEFINES INPUT-QTY2
                                 PIC Z(8).
               10  INPUT-CODE2   PIC X(30).
               10  INPUT-PRICE2  PIC X(10).
               10  INPUT-PRICE2-Z REDEFINES INPUT-PRICE2
                                 PIC Z(10).
               10  INPUT-ITM3    PIC X(4).
               10  INPUT-ITM3-Z REDEFINES INPUT-ITM3
                                 PIC Z(4).
               10  INPUT-QTY3    PIC X(8).
               10  INPUT-QTY3-Z REDEFINES INPUT-QTY3
                                 PIC Z(8).
               10  INPUT-CODE3   PIC X(30).
               10  INPUT-PRICE3  PIC X(10).
               10  INPUT-PRICE3-Z REDEFINES INPUT-PRICE3
                                 PIC Z(10).
               10  INPUT-ITM4    PIC X(4).
               10  INPUT-ITM4-Z REDEFINES INPUT-ITM4
                                 PIC Z(4).
               10  INPUT-QTY4    PIC X(8).
               10  INPUT-QTY4-Z REDEFINES INPUT-QTY4
                                 PIC Z(8).
               10  INPUT-CODE4   PIC X(30).
               10  INPUT-PRICE4  PIC X(10).
               10  INPUT-PRICE4-Z REDEFINES INPUT-PRICE4
                                 PIC Z(10).
               10  INPUT-ITM5    PIC X(4).
               10  INPUT-ITM5-Z REDEFINES INPUT-ITM5
                                 PIC Z(4).
               10  INPUT-QTY5    PIC X(8).
               10  INPUT-QTY5-Z REDEFINES INPUT-QTY5
                                 PIC Z(8).
               10  INPUT-CODE5   PIC X(30).
               10  INPUT-PRICE5  PIC X(10).
               10  INPUT-PRICE5-Z REDEFINES INPUT-PRICE5
                                 PIC Z(10).
               10  INPUT-ITM6    PIC X(4).
               10  INPUT-ITM6-Z REDEFINES INPUT-ITM6
                                 PIC Z(4).
               10  INPUT-QTY6    PIC X(8).
               10  INPUT-QTY6-Z REDEFINES INPUT-QTY6
                                 PIC Z(8).
               10  INPUT-CODE6   PIC X(30).
               10  INPUT-PRICE6  PIC X(10).
               10  INPUT-PRICE6-Z REDEFINES INPUT-PRICE6
                                 PIC Z(10).
               10  INPUT-ITM7    PIC X(4).
               10  INPUT-ITM7-Z REDEFINES INPUT-ITM7
                                 PIC Z(4).
               10  INPUT-QTY7    PIC X(8).
               10  INPUT-QTY7-Z REDEFINES INPUT-QTY7
                                 PIC Z(8).
               10  INPUT-CODE7   PIC X(30).
               10  INPUT-PRICE7  PIC X(10).
               10  INPUT-PRICE7-Z REDEFINES INPUT-PRICE7
                                 PIC Z(10).
               10  INPUT-ITM8    PIC X(4).
               10  INPUT-ITM8-Z REDEFINES INPUT-ITM8
                                 PIC Z(4).
               10  INPUT-QTY8    PIC X(8).
               10  INPUT-QTY8-Z REDEFINES INPUT-QTY8
                                 PIC Z(8).
               10  INPUT-CODE8   PIC X(30).
               10  INPUT-PRICE8  PIC X(10).
               10  INPUT-PRICE8-Z REDEFINES INPUT-PRICE8
                                 PIC Z(10).
               10  INPUT-ITM1-2  PIC 9(4).
               10  INPUT-QTY1-2  PIC 9(8).
               10  INPUT-CODE1-2 PIC X(30).
               10  INPUT-PRICE1-2X.
                   15  INPUT-PRICE1-2    PIC 9(10).
                   15  INPUT-PRICE1-2Z REDEFINES INPUT-PRICE1-2
                                         PIC Z(10).
               10  INPUT-ITM2-2  PIC 9(4).
               10  INPUT-QTY2-2  PIC 9(8).
               10  INPUT-CODE2-2 PIC X(30).
               10  INPUT-PRICE2-2X.
                   15  INPUT-PRICE2-2    PIC 9(10).
                   15  INPUT-PRICE2-2Z REDEFINES INPUT-PRICE2-2
                                         PIC Z(10).
               10  INPUT-ITM3-2  PIC 9(4).
               10  INPUT-QTY3-2  PIC 9(8).
               10  INPUT-CODE3-2 PIC X(30).
               10  INPUT-PRICE3-2X.
                   15  INPUT-PRICE3-2    PIC 9(10).
                   15  INPUT-PRICE3-2Z REDEFINES INPUT-PRICE3-2
                                         PIC Z(10).
               10  INPUT-ITM4-2  PIC 9(4).
               10  INPUT-QTY4-2  PIC 9(8).
               10  INPUT-CODE4-2 PIC X(30).
               10  INPUT-PRICE4-2X.
                   15  INPUT-PRICE4-2    PIC 9(10).
                   15  INPUT-PRICE4-2Z REDEFINES INPUT-PRICE4-2
                                         PIC Z(10).
               10  INPUT-ITM5-2  PIC 9(4).
               10  INPUT-QTY5-2  PIC 9(8).
               10  INPUT-CODE5-2 PIC X(30).
               10  INPUT-PRICE5-2X.
                   15  INPUT-PRICE5-2    PIC 9(10).
                   15  INPUT-PRICE5-2Z REDEFINES INPUT-PRICE5-2
                                         PIC Z(10).
               10  INPUT-ITM6-2  PIC 9(4).
               10  INPUT-QTY6-2  PIC 9(8).
               10  INPUT-CODE6-2 PIC X(30).
               10  INPUT-PRICE6-2X.
                   15  INPUT-PRICE6-2    PIC 9(10).
                   15  INPUT-PRICE6-2Z REDEFINES INPUT-PRICE6-2
                                         PIC Z(10).
               10  INPUT-ITM7-2  PIC 9(4).
               10  INPUT-QTY7-2  PIC 9(8).
               10  INPUT-CODE7-2 PIC X(30).
               10  INPUT-PRICE7-2X.
                   15  INPUT-PRICE7-2    PIC 9(10).
                   15  INPUT-PRICE7-2Z REDEFINES INPUT-PRICE7-2
                                         PIC Z(10).
               10  INPUT-ITM8-2  PIC 9(4).
               10  INPUT-QTY8-2  PIC 9(8).
               10  INPUT-CODE8-2 PIC X(30).
               10  INPUT-PRICE8-2X.
                   15  INPUT-PRICE8-2    PIC 9(10).
                   15  INPUT-PRICE8-2Z REDEFINES INPUT-PRICE8-2
                                         PIC Z(10).
           05  IB2-BYTES REDEFINES IB2.
               10  IB2-BYTE OCCURS 832 TIMES  PIC X.
           05  INPUT-CMD-LIN2    PIC X(79).
           05  INPUT-ERR-LIN2    PIC X(79).

       01  INPUT-BUFFER2-SAVE.
           05  IB2S-BYTE OCCURS 832  PIC X.

       01  INPUT-BUFFER3.
           05  IB3.
               10  INPUT-REM1-3      PIC X(20).
               10  INPUT-PRIINC-3    PIC Z(10).
               10  INPUT-REM2-3      PIC X(30).
               10  INPUT-REM3-3      PIC X(30).
               10  INPUT-RECONL-3    PIC XX.
               10  INPUT-CPYVEN-3    PIC XX.
               10  INPUT-PRIDEC-3    PIC Z(10).
               10  INPUT-AUTHOR-3    PIC X(20).
               10  INPUT-DEPT-3      PIC X(4).
           05  IB3-BYTES REDEFINES IB3.
               10  IB3-BYTE OCCURS 128  PIC X.
           05  INPUT-CMD-LIN3    PIC X(79).
           05  INPUT-ERR-LIN3    PIC X(79).

       01  INPUT-BUFFER3-SAVE.
           05  IB3S-BYTE OCCURS 128  PIC X.

       COPY IOFEEDBACK IN COPYLIB.

       01  ITEM-WA.
           05  ITM-WA OCCURS 4   PIC X.
       01  ITEM-WA-9 REDEFINES ITEM-WA
                                 PIC 9(4).

       COPY MPLT0      IN COPYLIB.

       COPY MPLTPOPT   IN COPYLIB.

       COPY OVRPFDATA  IN COPYLIB.

       COPY TDATECHK   IN COPYLIB.

       COPY VCOMLINK   IN COPYLIB.

       01  WHO-PARMS.
           05  USERNAME-W        PIC X(10).
           05  TERMNUM-W         PIC X(10).
           05  CURRLIB-W         PIC X(10).
           05  JOBLIBX-W         PIC X.

       COPY WSCONTROL  IN COPYLIB.
       PROCEDURE DIVISION.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-M-X.
       2-EOJ.
           CLOSE AUTH-FILE.
           CLOSE DISPLAY-FILE.
           CLOSE DPOITEM.
           CLOSE DPORECD.
           CLOSE DVENDOR.
           CLOSE ONLINE-PRT.
           CLOSE MPLTINFO.
           GOBACK.
       1-HSK.
           OPEN INPUT  AUTH-FILE.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  DPOITEM.
           OPEN INPUT  DPORECD.
           OPEN INPUT  DVENDOR.
           OPEN INPUT  MPLTINFO.
           MOVE "MCPRT"             TO OVRPRTF-FILE.
      *    MOVE "P "                TO OVRPRTF-TOFILE-NUM-X.
           MOVE "POPT"  TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99              TO OVRPRTF-TOFILE-NUM
           ELSE
           MOVE MPLTINFO-REQ-PRT-NO TO OVRPRTF-TOFILE-NUM.
           PERFORM 996-OVERRIDE-PRINT-FILE
           OPEN OUTPUT ONLINE-PRT.
           MOVE "N"                 TO AUTH-PRICE-SW.
           CALL "CLWHO" USING USERNAME-W TERMNUM-W CURRLIB-W JOBLIBX-W.
           MOVE USERNAME-W          TO USERNOTIFY OF AF-REC.
           READ AUTH-FILE INTO AUTH-BUF
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" MOVE "N" TO AUTH-PRICE-SW.
           MOVE 0                   TO SUB.
           ACCEPT CURRENT-TIME FROM TIME.
           ACCEPT CURRENT-DATE-WA FROM DATE.
           MOVE SPACES              TO INPUT-POBUF,
                                       INPUT-BUFFER,
                                       INPUT-BUFFER2.
           MOVE ZEROES              TO INPUT-CN-ITEMS.
           MOVE 59                  TO LINE-CTR.
           MOVE "N"                 TO OK-PRT.
           MOVE SPACES              TO INPUT-BUFFER
                                       INPUT-BUFFER2
                                       INPUT-BUFFER3.
       6-MAIN.
           MOVE "FCNPURNO"          TO VIEW-CFNAME.
           MOVE INPUT-POBUF         TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           IF VIEW-LASTKEY NOT = 0 GO TO 6-MAIN.
           MOVE DSPLY-REC           TO INPUT-POBUF.
           IF INPUT-ERR-LINE0 NOT = SPACES
               MOVE SPACES          TO INPUT-ERR-LINE0.
           MOVE INPUT-PO7           TO BUILD-PO-7.
           IF INPUT-POREL = "   "
               MOVE "000"           TO INPUT-POREL
           ELSE
           IF IPO-REL3 = " "
               IF IPO-REL2 = " "
                   MOVE IPO-REL1    TO IPO-REL3
                   MOVE "0"         TO IPO-REL2
                                       IPO-REL1
               ELSE
               MOVE IPO-REL2        TO IPO-REL3
               IF IPO-REL1 = " "
                   MOVE "0"         TO IPO-REL2
                                       IPO-REL1
               ELSE
               MOVE IPO-REL1        TO IPO-REL2
               MOVE "0"             TO IPO-REL1
           ELSE
           IF IPO-REL2 = " "
               IF IPO-REL1 = " "
                   MOVE "0"         TO IPO-REL2
                                       IPO-REL1
               ELSE
               MOVE IPO-REL1        TO IPO-REL2
               MOVE "0"             TO IPO-REL1
           ELSE
           IF IPO-REL1 = " "
               MOVE "0"             TO IPO-REL1.
           MOVE INPUT-POREL         TO BUILD-PO-REL.
           MOVE SPACES              TO INPUT-BUFFER
                                       DSPLY-REC.
           MOVE ZEROES              TO INPUT-ITM1-2
                                       INPUT-ITM2-2
                                       INPUT-ITM3-2
                                       INPUT-ITM4-2
                                       INPUT-ITM5-2
                                       INPUT-ITM6-2
                                       INPUT-ITM7-2
                                       INPUT-ITM8-2
                                       INPUT-QTY1-2
                                       INPUT-QTY2-2
                                       INPUT-QTY3-2
                                       INPUT-QTY4-2
                                       INPUT-QTY5-2
                                       INPUT-QTY6-2
                                       INPUT-QTY7-2
                                       INPUT-QTY8-2
                                       INPUT-PRICE1-2
                                       INPUT-PRICE2-2
                                       INPUT-PRICE3-2
                                       INPUT-PRICE4-2
                                       INPUT-PRICE5-2
                                       INPUT-PRICE6-2
                                       INPUT-PRICE7-2
                                       INPUT-PRICE8-2.
           MOVE SPACES              TO INPUT-CODE1 INPUT-CODE2
                                       INPUT-CODE3 INPUT-CODE4
                                       INPUT-CODE5 INPUT-CODE6
                                       INPUT-CODE7 INPUT-CODE8
                                       INPUT-CODE1-2 INPUT-CODE2-2
                                       INPUT-CODE3-2 INPUT-CODE4-2
                                       INPUT-CODE5-2 INPUT-CODE6-2
                                       INPUT-CODE7-2 INPUT-CODE8-2
                                       INPUT-ITM1 INPUT-ITM2
                                       INPUT-ITM3 INPUT-ITM4
                                       INPUT-ITM5 INPUT-ITM6
                                       INPUT-ITM7 INPUT-ITM8
                                       INPUT-QTY1 INPUT-QTY2
                                       INPUT-QTY3 INPUT-QTY4
                                       INPUT-QTY5 INPUT-QTY6
                                       INPUT-QTY7 INPUT-QTY8
                                       INPUT-PRICE1 INPUT-PRICE2
                                       INPUT-PRICE3 INPUT-PRICE4
                                       INPUT-PRICE5 INPUT-PRICE6
                                       INPUT-PRICE7 INPUT-PRICE8
                                       INPUT-CMD-LIN2 INPUT-ERR-LIN2.
           MOVE BUILD-PO-ARG        TO PORCVNO OF DPORECD-REC.
           READ DPORECD INTO BUF-DPORECD
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "PURCHASE ORDER DOES NOT EXIST"  TO INPUT-ERR-LINE0
               MOVE B"1" TO INDS (99)
               GO TO 6-MAIN
           ELSE
               MOVE PO-BUYER-CODE   TO INPUT-BUYER
               MOVE PO-VEN-CODE     TO VENCDE OF DVENDOR-REC
               MOVE "00"            TO VENITMNO OF DVENDOR-REC
               READ DVENDOR INTO BUF-DVENDOR
               MOVE VEN-ITM-DATA    TO INPUT-VENDOR
                                       D6-VEN
               READ DVENDOR NEXT INTO BUF-DVENDOR
               IF VEN-VEN-CODE NOT = PO-VEN-CODE
                   NEXT SENTENCE
               ELSE
               IF VEN-ITM-NO = "01" OR "07"
                   MOVE VEN-ITM-DATA TO INPUT-VENDO2
                   READ DVENDOR NEXT INTO BUF-DVENDOR
                   IF VEN-VEN-CODE NOT = PO-VEN-CODE
                       NEXT SENTENCE
                   ELSE
                   IF VEN-ITM-NO = "07"
                       MOVE VEN-ITM-DATA TO INPUT-VENDO3.
           PERFORM 60-RETRIEVE-ITEMS THRU 60-RI-X.
           STRING INPUT-PO7, "-", INPUT-POREL
               DELIMITED BY SIZE INTO INPUT-PO.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT       TO INPUT-DATE.
           MOVE "FCNOTICE"           TO VIEW-CFNAME.
           MOVE INPUT-BUFFER         TO DSPLY-REC
                                        INPUT-BUFFER-SAVE
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC            TO INPUT-BUFFER.
           PERFORM 601-CHECK-CHANGES
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 252.
           IF VIEW-LASTKEY = 0
               MOVE "FCNOTIC2"       TO VIEW-CFNAME
               IF AUTH-PRICE-SW = "N"
                   MOVE "FCNOTIC2A"  TO VIEW-CFNAME
               END-IF
               MOVE INPUT-BUFFER2    TO DSPLY-REC
                                        INPUT-BUFFER2-SAVE
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE DSPLY-REC        TO INPUT-BUFFER2
               IF OK-PRT NOT = "Y"
                   PERFORM 601-CHECK-CHANGES2
                       VARYING SUB FROM 1 BY 1 UNTIL SUB > 832
               END-IF
               IF VIEW-LASTKEY = 3
                   GO TO 2-EOJ
               ELSE
               MOVE ZEROES           TO INPUT-BUFFER3
               MOVE SPACES           TO INPUT-REM1-3 INPUT-REM2-3
                                        INPUT-REM3-3 INPUT-RECONL-3
                                        INPUT-CPYVEN-3 INPUT-AUTHOR-3
                                        INPUT-DEPT-3 INPUT-CMD-LIN3
                                        INPUT-ERR-LIN3
               MOVE INPUT-BUFFER3    TO DSPLY-REC
                                        INPUT-BUFFER3-SAVE
               MOVE "FCNOTIC3"       TO VIEW-CFNAME
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE DSPLY-REC        TO INPUT-BUFFER3
               IF OK-PRT NOT = "Y"
                   PERFORM 601-CHECK-CHANGES3
                       VARYING SUB FROM 1 BY 1 UNTIL SUB > 128
               END-IF
               IF VIEW-LASTKEY = 3
                   GO TO 2-EOJ
               ELSE
               IF OK-PRT = "Y"
                   PERFORM 69-WRITE-PURCH-CN
                   GO TO 2-EOJ
               ELSE
               GO TO 2-EOJ
           ELSE
           GO TO 2-EOJ.
           GO TO 6-MAIN.
       6-M-X.    EXIT.

       60-RETRIEVE-ITEMS.
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO INPUT-PRICE1-2Z
                                  INPUT-PRICE2-2Z
                                  INPUT-PRICE3-2Z
                                  INPUT-PRICE4-2Z
                                  INPUT-PRICE5-2Z
                                  INPUT-PRICE6-2Z
                                  INPUT-PRICE7-2Z
                                  INPUT-PRICE8-2Z.
           MOVE BUILD-PO-ARG TO PORCVNO OF DPOITEM-REC.
           IF INPUT-CNIT1 = "    " OR ZEROES
               PERFORM 601-RETRIEVE-FIRST-EIGHT THRU 601-RFE-X
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT1 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM1-Z
                                  INPUT-ITM1-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE1
                                  INPUT-CODE1-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY1-Z
                                  INPUT-QTY1-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE1-Z
                                  INPUT-PRICE1-2Z.
           IF INPUT-CNIT2 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT2 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM2-Z
                                  INPUT-ITM2-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE2
                                  INPUT-CODE2-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY2-Z
                                  INPUT-QTY2-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE2-Z
                                  INPUT-PRICE2-2Z.
           IF INPUT-CNIT3 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT3 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM3-Z
                                  INPUT-ITM3-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE3
                                  INPUT-CODE3-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY3-Z
                                  INPUT-QTY3-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE3-Z
                                  INPUT-PRICE3-2Z.
           IF INPUT-CNIT4 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT4 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM4-Z
                                  INPUT-ITM4-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE4
                                  INPUT-CODE4-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY4-Z
                                  INPUT-QTY4-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE4-Z
                                  INPUT-PRICE4-2Z.
           IF INPUT-CNIT5 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT5 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM5-Z
                                  INPUT-ITM5-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE5
                                  INPUT-CODE5-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY5-Z
                                  INPUT-QTY5-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE5-Z
                                  INPUT-PRICE5-2Z.
           IF INPUT-CNIT6 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT6 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM6-Z
                                  INPUT-ITM6-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE6
                                  INPUT-CODE6-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY6-Z
                                  INPUT-QTY6-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE6-Z
                                  INPUT-PRICE6-2Z.
           IF INPUT-CNIT7 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT7 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM7-Z
                                  INPUT-ITM7-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE7
                                  INPUT-CODE7-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY7-Z
                                  INPUT-QTY7-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE7-Z
                                  INPUT-PRICE7-2Z.
           IF INPUT-CNIT8 = "    "
               GO TO 60-RI-X
           ELSE
           MOVE INPUT-CNIT8 TO ITEMNO OF DPOITEM-REC
           READ DPOITEM INTO BUF-DPOITEM
           IF FILE-STATUS NOT = "00"
               GO TO 60-RI-X
           ELSE
           MOVE ITM-NUMBER     TO INPUT-ITM8-Z
                                  INPUT-ITM8-2
           MOVE ITM-CORP-CODE  TO INPUT-CODE8
                                  INPUT-CODE8-2
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY8-Z
                                  INPUT-QTY8-2
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE8-Z
                                  INPUT-PRICE8-2Z.
       60-RI-X.    EXIT.

       601-RETRIEVE-FIRST-EIGHT.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM1-Z
                                  INPUT-ITM1-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE1,
                                  INPUT-CODE1-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY1-Z
                                  INPUT-QTY1-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE1-Z
                                  INPUT-PRICE1-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM2-Z
                                  INPUT-ITM2-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE2
                                  INPUT-CODE2-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY2-Z
                                  INPUT-QTY2-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE2-Z
                                  INPUT-PRICE2-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM3-Z
                                  INPUT-ITM3-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE3
                                  INPUT-CODE3-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY3-Z
                                  INPUT-QTY3-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE3-Z
                                  INPUT-PRICE3-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM4-Z
                                  INPUT-ITM4-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE4
                                  INPUT-CODE4-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY4-Z
                                  INPUT-QTY4-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE4-Z
                                  INPUT-PRICE4-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM5-Z
                                  INPUT-ITM5-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE5
                                  INPUT-CODE5-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY5-Z
                                  INPUT-QTY5-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE5-Z
                                  INPUT-PRICE5-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM6-Z
                                  INPUT-ITM6-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE6
                                  INPUT-CODE6-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY6-Z
                                  INPUT-QTY6-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE6-Z
                                  INPUT-PRICE6-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM7-Z
                                  INPUT-ITM7-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE7
                                  INPUT-CODE7-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY7-Z
                                  INPUT-QTY7-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE7-Z
                                  INPUT-PRICE7-2Z.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    GO TO 601-RFE-X.
           IF FILE-STATUS NOT = "00" GO TO 601-RFE-X.
           IF ITM-PO-RCV-NO NOT = BUILD-PO-ARG
               GO TO 601-RFE-X.
           MOVE ITM-NUMBER     TO INPUT-ITM8-Z
                                  INPUT-ITM8-2.
           MOVE ITM-CORP-CODE  TO INPUT-CODE8
                                  INPUT-CODE8-2.
           IF ITM-QTY-ORD-X = "            "
               MOVE ZEROES     TO ITM-QTY-ORD-X
           END-IF
           MOVE ITM-QTY-ORD    TO INPUT-QTY8-Z
                                  INPUT-QTY8-2.
           IF ITM-UNIT-PRICE-X = "        "
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           IF AUTH-PRICE-SW = "N"
               MOVE ZEROES     TO ITM-UNIT-PRICE
           END-IF
           MOVE ITM-UNIT-PRICE TO INPUT-PRICE8-Z
                                  INPUT-PRICE8-2Z.
       601-RFE-X.    EXIT.

       601-CHECK-CHANGES.
           IF IB1-BYTE (SUB) NOT = IB1S-BYTE (SUB)
               MOVE "Y" TO OK-PRT.

       601-CHECK-CHANGES2.
           IF IB2-BYTE (SUB) NOT = IB2S-BYTE (SUB)
               MOVE "Y" TO OK-PRT.

       601-CHECK-CHANGES3.
           IF IB3-BYTE (SUB) NOT = IB3S-BYTE (SUB)
               MOVE "Y" TO OK-PRT.

       69-WRITE-PURCH-CN.
           ADD 3 TO LINE-CTR.
           IF LINE-CTR > 60
              WRITE PRINT-RCD FROM HDR0 AFTER ADVANCING 0 LINE
              WRITE PRINT-RCD FROM HDR1 AFTER ADVANCING 1
              WRITE PRINT-RCD FROM HDR3 AFTER ADVANCING 1
              MOVE 3              TO  LINE-CTR.
           MOVE INPUT-DATE        TO  D1-DATE.
           WRITE PRINT-RCD FROM DTL1 AFTER ADVANCING 2.
           MOVE INPUT-REQNO       TO  D2-REQ.
           MOVE INPUT-CHGPRI      TO  D2-CHP.
           MOVE INPUT-CHGQTY      TO  D2-CHQ.
           MOVE INPUT-ADDORD      TO  D2-ATO.
           WRITE PRINT-RCD FROM DTL2 AFTER ADVANCING 1.
           MOVE INPUT-PO          TO  D3-PO.
           MOVE INPUT-CANITM      TO  D3-CI.
           MOVE INPUT-CANPO       TO  D3-CPO.
           MOVE INPUT-NEWITM      TO  D3-NI.
           WRITE PRINT-RCD FROM DTL3 AFTER ADVANCING 1.
           MOVE INPUT-BUYER       TO  D4-BUY.
           MOVE INPUT-OBSITM      TO  D4-OBS.
           MOVE INPUT-SCRAP       TO  D4-SCR.
           MOVE INPUT-ERROR       TO  D4-ERR.
           WRITE PRINT-RCD FROM DTL4 AFTER ADVANCING 1.
           MOVE INPUT-OTHER       TO  D5-OTH.
           WRITE PRINT-RCD FROM DTL5 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR4 AFTER ADVANCING 2.
           MOVE INPUT-VENDOR TO D6-VEN.
           WRITE PRINT-RCD FROM DTL6 AFTER ADVANCING 2.
           MOVE INPUT-VENDO2 TO D6-VEN.
           WRITE PRINT-RCD FROM DTL6 AFTER ADVANCING 1.
           MOVE INPUT-VENDO3 TO D6-VEN.
           WRITE PRINT-RCD FROM DTL6 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR6 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR5 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR6 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR7 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR8 AFTER ADVANCING 1.
           IF INPUT-ITM1 NOT = "    "
               MOVE INPUT-ITM1-Z   TO  D7-ITM
               MOVE INPUT-QTY1-Z   TO  D7-QTY
               MOVE INPUT-CODE1    TO  D7-CDE
               MOVE INPUT-PRICE1-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM2 NOT = "    "
               MOVE INPUT-ITM2-Z   TO  D7-ITM
               MOVE INPUT-QTY2-Z   TO  D7-QTY
               MOVE INPUT-CODE2    TO  D7-CDE
               MOVE INPUT-PRICE2-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM3 NOT = "    "
               MOVE INPUT-ITM3-Z   TO  D7-ITM
               MOVE INPUT-QTY3-Z   TO  D7-QTY
               MOVE INPUT-CODE3    TO  D7-CDE
               MOVE INPUT-PRICE3-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM4 NOT = "    "
               MOVE INPUT-ITM4-Z   TO  D7-ITM
               MOVE INPUT-QTY4-Z   TO  D7-QTY
               MOVE INPUT-CODE4    TO  D7-CDE
               MOVE INPUT-PRICE4-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM5 NOT = "    "
               MOVE INPUT-ITM5-Z   TO  D7-ITM
               MOVE INPUT-QTY5-Z   TO  D7-QTY
               MOVE INPUT-CODE5    TO  D7-CDE
               MOVE INPUT-PRICE5-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM6 NOT = "    "
               MOVE INPUT-ITM6-Z   TO  D7-ITM
               MOVE INPUT-QTY6-Z   TO  D7-QTY
               MOVE INPUT-CODE5    TO  D7-CDE
               MOVE INPUT-PRICE6-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM7 NOT = "    "
               MOVE INPUT-ITM7-Z   TO  D7-ITM
               MOVE INPUT-QTY7-Z   TO  D7-QTY
               MOVE INPUT-CODE5    TO  D7-CDE
               MOVE INPUT-PRICE7-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM8 NOT = "    "
               MOVE INPUT-ITM8-Z   TO  D7-ITM
               MOVE INPUT-QTY8-Z   TO  D7-QTY
               MOVE INPUT-CODE8    TO  D7-CDE
               MOVE INPUT-PRICE8-Z TO  D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR6 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR9 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR8 AFTER ADVANCING 1.
           IF INPUT-ITM1-2 NUMERIC
               MOVE INPUT-ITM1-2  TO  D7-ITM
               MOVE INPUT-QTY1-2  TO  D7-QTY
               MOVE INPUT-CODE1-2 TO  D7-CDE
               IF INPUT-PRICE1-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE1-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM2-2 NUMERIC
               MOVE INPUT-ITM2-2  TO  D7-ITM
               MOVE INPUT-QTY2-2  TO  D7-QTY
               MOVE INPUT-CODE2-2 TO  D7-CDE
               IF INPUT-PRICE2-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE2-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM3-2 NUMERIC
               MOVE INPUT-ITM3-2  TO  D7-ITM
               MOVE INPUT-QTY3-2  TO  D7-QTY
               MOVE INPUT-CODE3-2 TO  D7-CDE
               IF INPUT-PRICE3-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE3-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM4-2 NUMERIC
               MOVE INPUT-ITM4-2  TO  D7-ITM
               MOVE INPUT-QTY4-2  TO  D7-QTY
               MOVE INPUT-CODE4-2 TO  D7-CDE
               IF INPUT-PRICE4-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE4-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM5-2 NUMERIC
               MOVE INPUT-ITM5-2  TO  D7-ITM
               MOVE INPUT-QTY5-2  TO  D7-QTY
               MOVE INPUT-CODE5-2 TO  D7-CDE
               IF INPUT-PRICE5-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE5-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM6-2 NUMERIC
               MOVE INPUT-ITM6-2  TO  D7-ITM
               MOVE INPUT-QTY6-2  TO  D7-QTY
               MOVE INPUT-CODE6-2 TO  D7-CDE
               IF INPUT-PRICE6-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE6-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM7-2 NUMERIC
               MOVE INPUT-ITM7-2  TO  D7-ITM
               MOVE INPUT-QTY7-2  TO  D7-QTY
               MOVE INPUT-CODE7-2 TO  D7-CDE
               IF INPUT-PRICE7-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE7-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           IF INPUT-ITM8-2 NUMERIC
               MOVE INPUT-ITM8-2  TO  D7-ITM
               MOVE INPUT-QTY8-2  TO  D7-QTY
               MOVE INPUT-CODE8-2 TO  D7-CDE
               IF INPUT-PRICE8-2X = "          "
                   MOVE 0          TO D7-PRI
                   WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1
               ELSE
               MOVE INPUT-PRICE8-2 TO D7-PRI
               WRITE PRINT-RCD FROM DTL7 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HDR6 AFTER ADVANCING 1.
           MOVE INPUT-REM1-3       TO  D8-RM1.
           MOVE INPUT-PRIINC-3     TO  D8-PRI.
           WRITE PRINT-RCD FROM DTL8 AFTER ADVANCING 2.
           MOVE INPUT-REM2-3       TO  D9-RM2.
           WRITE PRINT-RCD FROM DTL9 AFTER ADVANCING 1.
           MOVE INPUT-REM3-3       TO  D9-RM2.
           WRITE PRINT-RCD FROM DTL9 AFTER ADVANCING 1.
           MOVE INPUT-RECONL-3     TO  D10-RO.
           MOVE INPUT-CPYVEN-3     TO  D10-CP.
           MOVE INPUT-PRIDEC-3     TO  D10-PRI.
           WRITE PRINT-RCD FROM DTL10 AFTER ADVANCING 2.
           MOVE INPUT-AUTHOR-3     TO  D11-AU.
           MOVE INPUT-DEPT-3       TO  D11-DP.
           WRITE PRINT-RCD FROM DTL11 AFTER ADVANCING 2.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       COPY OVRPFCALL IN COPYLIB.
