000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TCOBAPND.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        8/30/89.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     COBOL DB CALLS/FD AND SELECT GENERATOR
001000*
001100*    THIS PROGRAM WILL CREATE A COPYLIB MEMBER WITH THE REQUIRED
001200*    DB CALLS.  THE PROGRAM CAN THEN USE STANDARD PERFORMS
001300*    FOR EACH DATASET AND THUS BE PORTABLE BACK AND FORTH FROM
001400*    THE HP AND IBM SYSTEMS.  THIS WILL AVOID DOUBLE MAINTENANCE
      *    ON PROGRAMS THAT USE THESE STANDARDS.
      *    EACH PROGRAM USING THIS METHOD WILL HAVE A COPYLIB MEMBER
      *    BEGINNING WITH 'H': IE 'TLOADPO' WILL HAVE A COPYLIB MEMBER
      *    'HLOADPO' WHICH WILL CONTAIN A PERFORM PARA FOR EACH DB
      *    CALL REQUIRED.  THE IBM 'HLOADPO' WILL CONTAIN THE COBOL
      *    READS/WRITES TO THE DATABASE, WHILE THE HP 'HLOADPO' WILL
      *    CONTAIN THE IMAGE CALLS.
      *    THERE ARE 7 TYPES OF CALLS SUPPORTED:
      *       1.  DBGET MODE 2      DBGET2
      *       2.  DBGET MODE 5- AUTOMATICALLY ADDED FROM DBFIND
      *       3.  DBGET MODE 7      DBGET7
      *       4.  DBFIND            DBFIND
      *       5.  DBPUT             DBPUT
      *       6.  DBUPDATE          DBUPDATE
      *       7.  DBDELETE          DBDELETE
      *    NAMING CONVENTIONS FOR THE PERFORMS WILL BE AS FOLLOWS:
      *      9999-CCCCCC-DDDDDD-SS
      *               CCCCCCC = THE DB CALL ABBREVIATION
      *               DDDDDDD = THE DATASET NAME ABBREVIATION
      *               SS      = THE SEARCH PATH ABBREVIATION
      *        SO AN EXAMPLE PERFORM WOULD BE:
      *          99992-DBGET5-DPOITEM-CD
      *

009400 ENVIRONMENT DIVISION.
009500 CONFIGURATION SECTION.
009600 SOURCE-COMPUTER.  HP-3000.
009700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT COPYLIB-FILE
                  ASSIGN TO DISK-HPROGRAM
                  ORGANIZATION IS SEQUENTIAL
                    ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT SELECT-FILE
                  ASSIGN TO DISK-LPROGRAM
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT FD-FILE
                  ASSIGN TO DISK-FPROGRAM
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZCOBAPND-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DSET-FILE ASSIGN TO DATABASE-DSET.

010200 DATA DIVISION.
010300 FILE SECTION.
010400
       FD  COPYLIB-FILE
           RECORD CONTAINS 92 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       01  COPYLIB-REC.
           05  COPYLIB-SEQ-NUMBER-1             PIC X(4).
           05  COPYLIB-SEQ-NUMBER-2             PIC X(2).
           05  COPYLIB-DATE                     PIC X(6).
           05  FILLER                           PIC X(6).
           05  COPYLIB-COMMENT                  PIC X(1).
           05  COPYLIB-AREA-A.
               10  FILLER                       PIC X(4).
               10  COPYLIB-AREA-B.
                   15  FILLER                   PIC X(4).
                   15  COPYLIB-INDENT-1.
                       20  FILLER               PIC X(2).
                       20  COPYLIB-INDENT-1B.
                           25  FILLER           PIC X(2).
                           25  COPYLIB-INDENT-2.
                               30  FILLER           PIC X(4).
                               30  COPYLIB-INDENT-3 PIC X(57).

       FD  SELECT-FILE
           RECORD CONTAINS 92 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       01  SELECT-REC.
           05  SELECT-SEQ-NUMBER-1              PIC X(4).
           05  SELECT-SEQ-NUMBER-2              PIC X(2).
           05  SELECT-DATE                      PIC X(6).
           05  FILLER                           PIC X(6).
           05  SELECT-COMMENT                   PIC X(1).
           05  SELECT-AREA-A.
               10  FILLER                       PIC X(4).
               10  SELECT-AREA-B.
                   15  FILLER                   PIC X(4).
                   15  SELECT-INDENT-1.
                       20  FILLER               PIC X(4).
                       20  SELECT-INDENT-2.
                           25  FILLER           PIC X(4).
                           25  SELECT-INDENT-3  PIC X(57).

       FD  FD-FILE
           RECORD CONTAINS 92 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       01  FD-REC.
           05  FD-SEQ-NUMBER-1                  PIC X(4).
           05  FD-SEQ-NUMBER-2                  PIC X(2).
           05  FD-DATE                          PIC X(6).
           05  FILLER                           PIC X(6).
           05  FD-COMMENT                       PIC X(1).
           05  FD-AREA-A.
               10  FILLER                       PIC X(4).
               10  FD-AREA-B.
                   15  FILLER                   PIC X(4).
                   15  FD-INDENT-1.
                       20  FILLER               PIC X(4).
                       20  FD-INDENT-2.
                           25  FILLER           PIC X(4).
                           25  FD-INDENT-3      PIC X(57).

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).

       FD  DSET-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  DSET-REC.
           05  DR-DSET-NAME    PIC X(15).
           05  DR-DSET-NUM     PIC X(2).
           05  DR-KEY          PIC X(16).
           05  DR-KEY-NUM      PIC X(2).
           05  DR-KEY-ABBREV   PIC X(2).
           05  DR-KEY-IBM-NAME PIC X(10).
           05  DR-ARG-NAME     PIC X(14).
           05  DR-BASE         PIC X(2).
           05  DR-BUFFNAME     PIC X(17).
           05  DR-DSET-ABBR    PIC X(3).
           05  DR-SEARCH       PIC X(15).
           05  FILLER          PIC X(34).

011200 WORKING-STORAGE SECTION.
011300
       01  FIRST-READ-FLAG              PIC X(1).
       01  SAVE-DATE                    PIC X(6).
       01  COPYLIB-CNT                  PIC 9(4)  VALUE ZERO.
       01  SELECT-CNT                   PIC 9(4)  VALUE ZERO.
       01  FD-CNT                       PIC 9(4)  VALUE ZERO.
       01  SUB                          PIC 9(3)  VALUE ZERO.
       01  SUB2                         PIC 9(3)  VALUE ZERO.
       01  CUR-DSET                     PIC 9(3).
       01  OPEN-SUB                     PIC 9(3)  VALUE ZERO.
       01  FCNT                         PIC 9(2)  VALUE ZERO.
       01  NUM-INPUT-FILES              PIC 9(2)  VALUE ZERO.
       01  NUM-OUTPUT-FILES             PIC 9(2)  VALUE ZERO.
       01  NUM-OPEN-LINES               PIC 9(2)  VALUE ZERO.
       01  OPEN-LINE-NUM                PIC 9(2)  VALUE ZERO.
       01  WORK-LINE                    PIC X(80) VALUE SPACES.
       01  HOLD-FILE                    PIC X(21) VALUE SPACES.
       01  HOLD-REC                     PIC X(25) VALUE SPACES.
       01  HOLD-DSET-NAME.
           05  HOLD-DSET-NAME-1         PIC X(1).
           05  FILLER                   PIC X(15).
       01  HOLD-DSET-NUM                PIC X(2).
       01  HOLD-KEY                     PIC X(16).
       01  HOLD-KEY-NUM                 PIC X(2).
       01  HOLD-KEY-ABBREV              PIC X(2).
       01  HOLD-KEY-IBM-NAME            PIC X(10).
       01  HOLD-ARG-NAME                PIC X(16).
       01  HOLD-BASE                    PIC X(2).
       01  HOLD-BUFFNAME                PIC X(17).
       01  NUM-CALL-TYPES               PIC 9(3)  VALUE 6.
       01  NUM-DSETS                    PIC 9(3)  VALUE 46.
       01  NUM-SEARCH-ITEMS             PIC 9(3)  VALUE 21.
       01  CCALL                        PIC 9(3).
       01  SAVE-FILE-NUM                PIC 9(3).
       01  FOUND-IT-FLAG                PIC X(1).
       01  QUOTE-CHAR                   PIC X(1) VALUE QUOTES.
       01  I-O-FLAG                     PIC X(1).
       01  WORK-DSET-NUM                PIC X(2).
       01  WORK-DSET-NUM2               PIC X(2).
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
       01  INPUT-OUTPUT-FLAG            PIC X(1).
       01  OPEN-FILE-AREA.
           05  OPEN-STATEMENT            PIC X(11).
           05  OPEN-FILE-1               PIC X(21).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  OPEN-FILE-2               PIC X(21).
           05  OPEN-PERIOD               PIC X(1).
       01  WORK-STRING                   PIC X(80).
       01  EOF-FLAG                      PIC X(1).

      *****************************************************************
      **                                                             **
      **       T A B L E S   A N D   S T U F F                       **
      **                                                             **
      *****************************************************************
       01  DATASET-INFO-TABLE.
           05  DATASET-INFO-LINE OCCURS 150 TIMES.
               10  DIT-DSET-NAME       PIC X(16).
               10  DIT-DSET-NUM        PIC X(2).
               10  DIT-KEY             PIC X(16).
               10  DIT-KEY-NUM         PIC X(2).
               10  DIT-KEY-ABBREV      PIC X(2).
               10  DIT-KEY-IBM-NAME    PIC X(10).
               10  DIT-ARG-NAME        PIC X(16).
               10  DIT-BASE            PIC X(2).
               10  DIT-BUFFNAME        PIC X(17).
               10  DIT-FD-I-FLAG       PIC X(1).
               10  DIT-FD-O-FLAG       PIC X(1).

       01  CALL-TYPE-AREA.
           05  FILLER          PIC X(8)  VALUE "DBGET2  ".
           05  FILLER          PIC X(1)  VALUE "1".
           05  FILLER          PIC X(8)  VALUE "DBGET7  ".
           05  FILLER          PIC X(1)  VALUE "3".
           05  FILLER          PIC X(8)  VALUE "DBFIND  ".
           05  FILLER          PIC X(1)  VALUE "4".
           05  FILLER          PIC X(8)  VALUE "DBPUT   ".
           05  FILLER          PIC X(1)  VALUE "5".
           05  FILLER          PIC X(8)  VALUE "DBUPDATE".
           05  FILLER          PIC X(1)  VALUE "6".
           05  FILLER          PIC X(8)  VALUE "DBDELETE".
           05  FILLER          PIC X(1)  VALUE "7".
       01  CALL-TYPE-TABLE REDEFINES CALL-TYPE-AREA.
           05  CALL-TYPE-LINE OCCURS 6 TIMES.
               10  CIT-CALL-ABBREV   PIC X(8).
               10  CIT-CALL-NUMBER   PIC X(1).

       01  SAVE-OPEN-TABLE.
           05  SAVE-OPEN-LINE OCCURS 50 TIMES.
               10  SAVE-ACCESS-MODE     PIC X(1).
               10  SAVE-OPEN.
                   15  SAVE-OPEN-OPEN   PIC X(11).
                   15  SAVE-OPEN-FILE   PIC X(21).
                   15  SAVE-OPEN-PERIOD PIC X(1).

      *****************************************************************
      **                                                             **
      **         S U B P R O G R A M   A R E A S                     **
      **                                                             **
      *****************************************************************
       COPY COMMAND    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY FUNCTDEF   IN COPYLIB.

013700 01  MESSAGE-BUFFER.
013800     05  MSG-TEXT.
013900         10  MESSAGE-BUFFER-1      PIC X(1).
014000         10  FILLER                PIC X(67).
014100     05  MSG-FLD                   PIC X(8)   VALUE SPACES.
014200     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
014300
      *****************************************************************
      **                                                             **
      **           V I E W   W O R K                                 **
      **                                                             **
      *****************************************************************
       01  FIELD-NUMBER             PIC S9(4) COMP-4.
       COPY VCOMAREA IN COPYLIB.
       COPY LANGUAGE IN COPYLIB.

      *****************************************************************
      **                                                             **
      **     D A T A   E N T R Y   A R E A S                         **
      **                                                             **
      *****************************************************************
       01  DE-FIELDS.
           05  DE-DSET-NAME          PIC X(16).
           05  DE-CALL-TYPE          PIC X(8).
           05  DE-ACCESS-MODE        PIC X(1).
           05  DE-SEARCH-ITEM        PIC X(16).
           05  DE-USE-SCREENS        PIC X(1).
           05  DE-BASE               PIC X(2).
           05  DE-BLOWUP             PIC X(1).
           05  DE-COMMAND-LINE       PIC X(79).
           05  DE-MESSAGE-LINE       PIC X(79).

032400 PROCEDURE DIVISION.
033000
033100 1000-HOUSEKEEP.
           MOVE SPACES TO WORK-STRING.
           STRING "ADDPFM FILE(MCTST/COPYLIB) MBR(HPROGRAM) ",
             "TEXT('DB calls for xxxxxxxx')" DELIMITED BY SIZE
             INTO WORK-STRING.
           MOVE WORK-STRING TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-STRING.
           STRING "ADDPFM FILE(MCTST/COPYLIB) MBR(LPROGRAM) ",
             "TEXT('SELECT statements for xxxxxxxx')" DELIMITED BY SIZE
             INTO WORK-STRING.
           MOVE WORK-STRING TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-STRING.
           STRING "ADDPFM FILE(MCTST/COPYLIB) MBR(FPROGRAM) ",
             "TEXT('FD statements for xxxxxxxx')" DELIMITED BY SIZE
             INTO WORK-STRING.
           MOVE WORK-STRING TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE ZERO TO OPEN-SUB.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DSET-FILE.
           MOVE "N" TO EOF-FLAG.
           MOVE ZERO TO SUB.
           PERFORM UNTIL EOF-FLAG = "Y"
               READ DSET-FILE AT END
                  MOVE "Y" TO EOF-FLAG
               END-READ
               IF EOF-FLAG = "N"
                   ADD 1 TO SUB
                   MOVE DR-DSET-NAME    TO DIT-DSET-NAME (SUB)
                   MOVE DR-DSET-NUM     TO DIT-DSET-NUM (SUB)
                   MOVE DR-KEY          TO DIT-KEY (SUB)
                   MOVE DR-KEY-NUM      TO DIT-KEY-NUM (SUB)
                   MOVE DR-KEY-ABBREV   TO DIT-KEY-ABBREV (SUB)
                   MOVE DR-KEY-IBM-NAME TO DIT-KEY-IBM-NAME (SUB)
                   MOVE DR-ARG-NAME     TO DIT-ARG-NAME (SUB)
                   MOVE DR-BASE         TO DIT-BASE (SUB)
                   MOVE DR-BUFFNAME     TO DIT-BUFFNAME (SUB)
               END-IF
           END-PERFORM.
           MOVE SUB TO NUM-DSETS.
           CLOSE DSET-FILE.

           MOVE "Y" TO FIRST-READ-FLAG.
           MOVE
           "OVRDBF FILE(HPROGRAM) TOFILE(COPYLIB) MBR(HPROGRAM)"
             TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE
           "OVRDBF FILE(LPROGRAM) TOFILE(COPYLIB) MBR(LPROGRAM)"
             TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE
           "OVRDBF FILE(FPROGRAM) TOFILE(COPYLIB) MBR(FPROGRAM)"
             TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           OPEN OUTPUT COPYLIB-FILE, SELECT-FILE, FD-FILE.
           ACCEPT SAVE-DATE FROM DATE.

           MOVE SPACES TO COPYLIB-REC.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE "9930-LOCK.             " TO COPYLIB-AREA-A.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE "9940-UNLOCK.           " TO COPYLIB-AREA-A.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE
           "------ FD STATEMENT AREA FOR IBM ONLY ------*"
             TO FD-AREA-A.
           MOVE "*" TO FD-COMMENT.
           PERFORM 9220-WRITE-FD-REC.


      *****************************************************************
      **                                                             **
      **   P E R F O R M   M A I N   R O U T I N E                   **
      **                                                             **
      *****************************************************************
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           IF DE-USE-SCREENS = "Y"
               MOVE SPACES TO SELECT-REC
               MOVE "SELECT DISPLAY-FILE" TO SELECT-AREA-B
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO SELECT-REC
               MOVE "ASSIGN TO WORKSTATION-ZXXXXXXX-SI"
                 TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO SELECT-REC
               MOVE "ORGANIZATION IS TRANSACTION" TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC
               MOVE "ACCESS IS SEQUENTIAL" TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO SELECT-REC
               MOVE "FILE STATUS IS DISPLAY-STATUS" TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO SELECT-REC
               MOVE "CONTROL-AREA IS WS-CONTROL." TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO SELECT-REC
               PERFORM 9210-WRITE-SELECT-REC
               MOVE SPACES TO FD-REC
               MOVE "FD  DISPLAY-FILE" TO FD-AREA-A
               PERFORM 9220-WRITE-FD-REC
               MOVE SPACES TO FD-REC
               MOVE "LABEL RECORDS ARE OMITTED." TO FD-AREA-B
               PERFORM 9220-WRITE-FD-REC
               MOVE "01  DISPLAY-REC        PIC X(1500)." TO FD-AREA-A
               PERFORM 9220-WRITE-FD-REC.
               MOVE SPACES TO FD-REC
               PERFORM 9220-WRITE-FD-REC.

           MOVE
           "------ FD STATEMENT AREA FOR IBM ONLY ------*"
             TO FD-AREA-A.
           MOVE "*" TO FD-COMMENT.
           PERFORM 9220-WRITE-FD-REC.

      *------ CREATE THE OPEN STATEMENTS AT END OF HPROGRAM FILE
           MOVE SPACES TO COPYLIB-REC.
           MOVE "9999-OPEN-STUFF." TO COPYLIB-AREA-A.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE ZERO TO SUB
           PERFORM OPEN-SUB TIMES
               ADD 1 TO SUB
               MOVE SPACES TO COPYLIB-REC
               MOVE SAVE-OPEN (SUB) TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
           END-PERFORM.
           IF DE-USE-SCREENS = "Y"
               MOVE SPACES TO COPYLIB-REC
               MOVE "OPEN I-O   DISPLAY-FILE." TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC.

      *------ CREATE THE CLOSE STATEMENTS
           MOVE SPACES TO COPYLIB-REC.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE "9999-CLOSE-STUFF." TO COPYLIB-AREA-A.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE ZERO TO SUB.
           PERFORM OPEN-SUB TIMES
               ADD 1 TO SUB
               MOVE SPACES TO COPYLIB-REC
               MOVE "CLOSE" TO SAVE-OPEN-OPEN (SUB)
               MOVE SAVE-OPEN (SUB) TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
           END-PERFORM.
           IF DE-USE-SCREENS = "Y"
               MOVE SPACES TO COPYLIB-REC
               MOVE "CLOSE DISPLAY-FILE." TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC.


       2000-EOJ.
           CLOSE COPYLIB-FILE, DISPLAY-FILE, SELECT-FILE, FD-FILE.
           GOBACK.

       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       6000-MAIN.
           MOVE "CS" TO DE-BASE.
           MOVE "N" TO DE-BLOWUP.
           MOVE "N" TO DE-USE-SCREENS.
           MOVE "I" TO DE-ACCESS-MODE.
       6010-SHOWFORM.
           MOVE "FCOBAPND" TO VIEW-NFNAME.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

           IF VIEW-LASTKEY = EXIT-PROGRAM
               GO TO 6990-MAIN-X.

           IF DE-USE-SCREENS = "Y" AND FIRST-READ-FLAG = "Y"
               MOVE "N" TO FIRST-READ-FLAG
               MOVE "9951-GETNEXTFORM.      "  TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9952-GETBUFFER.        "  TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE DISPLAY-REC TO DE-FIELDS." TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9953-PUTBUFFER.         " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "MOVE DE-FIELDS TO DISPLAY-REC." TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9954-SETERROR.          " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               STRING "MOVE B" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "1" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " TO IND (99)." DELIMITED BY SIZE
                    INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               STRING "MOVE B" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "1" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " TO IND (FIELD-NUMBER)." DELIMITED BY SIZE
                    INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE."
                 TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9955-CLEAR-FORM.        " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               MOVE "MOVE SPACES TO DE-FIELDS, MESSAGE-BUFFER."
                 TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9956-PUTWINDOW.         " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9957-FIELDEDITS.        " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9958-INITFORM.          " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9959-SHOWFORM.          " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9960-SETKEYLABEL.       " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9962-OPENFORM.          " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9963-CLOSEFORM.         " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE "9964-FINISHFORM.        " TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 7000-GET-DSET THRU 7090-GD-X.
           IF FOUND-IT-FLAG = "N"
               MOVE "NONEXISTANT DATASET/SEARCHKEY COMBINATION"
                  TO MESSAGE-BUFFER
               MOVE 1 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM

           PERFORM 7100-GET-CALL-TYPE THRU 7190-GCT-X.
           IF FOUND-IT-FLAG = "N"
               MOVE "NONEXISTANT CALL TYPE" TO MESSAGE-BUFFER
               MOVE 2 TO FIELD-NUMBER
               PERFORM 4030-SETERROR
               GO TO 6010-SHOWFORM.

           MOVE SPACES TO HOLD-FILE, HOLD-REC.
           STRING DE-DSET-NAME DELIMITED BY SPACES,
                  "-" DELIMITED BY SIZE,
                  HOLD-KEY-ABBREV DELIMITED BY SIZE,
                  "-" DELIMITED BY SIZE,
                  DE-ACCESS-MODE DELIMITED BY SIZE
              INTO HOLD-FILE.
           STRING DE-DSET-NAME DELIMITED BY SPACES,
                  "-" DELIMITED BY SIZE,
                  HOLD-KEY-ABBREV DELIMITED BY SIZE,
                  "-REC-" DELIMITED BY SIZE,
                  DE-ACCESS-MODE DELIMITED BY SIZE
              INTO HOLD-REC.

           IF DE-CALL-TYPE = "DBGET2"
               PERFORM 8100-DBGET2 THRU 8190-D2-X
           ELSE
           IF DE-CALL-TYPE = "DBGET7"
               PERFORM 8300-DBGET7 THRU 8390-D7-X
           ELSE
           IF DE-CALL-TYPE = "DBFIND"
               PERFORM 8400-DBFIND THRU 8490-DF-X
               MOVE "DBGET5" TO DE-CALL-TYPE
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               PERFORM 8200-DBGET5 THRU 8290-D5-X
               MOVE "DBFIND" TO DE-CALL-TYPE
           ELSE
           IF DE-CALL-TYPE = "DBPUT"
               PERFORM 8500-DBPUT THRU 8590-DP-X
           ELSE
           IF DE-CALL-TYPE = "DBUPDATE"
               PERFORM 8600-DBUPDATE THRU 8690-DU-X
           ELSE
           IF DE-CALL-TYPE = "DBDELETE"
               PERFORM 8700-DBDELETE THRU 8790-DD-X.

           MOVE SPACES TO COPYLIB-REC.
           PERFORM 9200-WRITE-COPYLIB-REC.

           IF DE-ACCESS-MODE = "I" AND DIT-FD-I-FLAG (CUR-DSET) = "Y"
               NEXT SENTENCE
           ELSE
           IF DE-ACCESS-MODE = "O" AND DIT-FD-O-FLAG (CUR-DSET) = "Y"
               NEXT SENTENCE
           ELSE
               PERFORM 8800-SELECT THRU 8890-S-X
               PERFORM 8900-FD THRU 8990-F-X
               IF DE-ACCESS-MODE = "I"
                   MOVE "Y" TO DIT-FD-I-FLAG (CUR-DSET)
               END-IF
               IF DE-ACCESS-MODE = "O"
                   MOVE "Y" TO DIT-FD-O-FLAG (CUR-DSET)
               END-IF
               ADD 1 TO OPEN-SUB
               MOVE HOLD-FILE TO SAVE-OPEN-FILE (OPEN-SUB)
               MOVE "." TO SAVE-OPEN-PERIOD (OPEN-SUB)
               MOVE DE-ACCESS-MODE TO SAVE-ACCESS-MODE (OPEN-SUB)
               IF DE-ACCESS-MODE = "I"
                   MOVE "OPEN INPUT " TO SAVE-OPEN-OPEN (OPEN-SUB)
               ELSE
                   MOVE "OPEN I-O   " TO SAVE-OPEN-OPEN (OPEN-SUB).

           GO TO 6010-SHOWFORM.

       6990-MAIN-X.
           EXIT.

       7000-GET-DSET.
           MOVE "N" TO FOUND-IT-FLAG.
           MOVE 0 TO SUB.
       7010-GET-DSET-LOOP.
           ADD 1 TO SUB.
           IF SUB > NUM-DSETS
               GO TO 7090-GD-X.

           IF DIT-DSET-NAME (SUB) = SPACES
               GO TO 7010-GET-DSET-LOOP.
           IF DE-DSET-NAME = DIT-DSET-NAME (SUB)
           AND DE-SEARCH-ITEM = DIT-KEY (SUB)
           AND DE-BASE = DIT-BASE (SUB)
               MOVE "Y" TO FOUND-IT-FLAG
               MOVE DIT-DSET-NAME (SUB)       TO HOLD-DSET-NAME
               MOVE DIT-DSET-NUM (SUB)        TO HOLD-DSET-NUM
               MOVE DIT-KEY (SUB)             TO HOLD-KEY
               MOVE DIT-KEY-NUM (SUB)         TO HOLD-KEY-NUM
               MOVE DIT-KEY-ABBREV (SUB)      TO HOLD-KEY-ABBREV
               MOVE DIT-KEY-IBM-NAME (SUB)    TO HOLD-KEY-IBM-NAME
               MOVE DIT-ARG-NAME (SUB)        TO HOLD-ARG-NAME
               MOVE DIT-BASE (SUB)            TO HOLD-BASE
               MOVE DIT-BUFFNAME (SUB)        TO HOLD-BUFFNAME
               MOVE SUB                       TO CUR-DSET
               GO TO 7090-GD-X.
           GO TO 7010-GET-DSET-LOOP.

       7090-GD-X.
           EXIT.

       7100-GET-CALL-TYPE.
           MOVE "N" TO FOUND-IT-FLAG.
           MOVE ZERO TO CCALL.
       7110-GET-CALL-TYPE-LOOP.
            ADD 1 TO CCALL.
            IF CCALL > NUM-CALL-TYPES
                GO TO 7190-GCT-X.
            IF CIT-CALL-ABBREV (CCALL) = SPACES
                GO TO 7110-GET-CALL-TYPE-LOOP.
            IF DE-CALL-TYPE = CIT-CALL-ABBREV (CCALL)
                MOVE "Y" TO FOUND-IT-FLAG
                GO TO 7190-GCT-X.
            GO TO 7110-GET-CALL-TYPE-LOOP.
       7190-GCT-X.
           EXIT.

       8100-DBGET2.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "READ " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES,
                  " NEXT INTO " DELIMITED BY SIZE,
                  HOLD-BUFFNAME DELIMITED BY SPACES,
               INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "AT END MOVE FILE-STATUS TO FILE-STATUS."
               TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "IF FILE-STATUS-1 = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "1" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE
                  " OR FILE-STATUS = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "46" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE
             INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "MOVE 11 TO COND-WORD" TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9000-ELSE-B.

           PERFORM 9010-IF-FILE-STATUS-NOT.

           PERFORM 9030-BU-MESSAGE.

      *------ NOW ADD THE 'INIT' CALL SO THE PROGRAM CAN RESET
      *------ THE FILE POINTER TO BEGINNING FOR SERIAL READ
           MOVE SPACES TO COPYLIB-REC.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE "INIT" TO DE-CALL-TYPE.
           PERFORM 9060-PARA-NAME.
           MOVE SPACES TO WORK-LINE, COPYLIB-REC.
           STRING "MOVE SPACES TO " DELIMITED BY SIZE,
                  HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                  " OF " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  "." DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "START " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES,
                  " KEY >= " DELIMITED BY SIZE,
                  HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                  " OF " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.
           MOVE "DBGET2" TO DE-CALL-TYPE.

           PERFORM 9050-INVALID-KEY.

       8190-D2-X.
           EXIT.

       8200-DBGET5.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "READ " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES
                  " NEXT INTO " DELIMITED BY SIZE,
                  HOLD-BUFFNAME DELIMITED BY SPACES
               INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "AT END MOVE FILE-STATUS TO FILE-STATUS."
               TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9010-IF-FILE-STATUS-NOT.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "IF FILE-STATUS = " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "10" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " OR " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "14" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                  INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
           ELSE
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "IF FILE-STATUS = " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "10" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " OR " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "14" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " OR " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "46" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                  INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "PERFORM 9999-RESET-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "MOVE 15 TO COND-WORD" TO COPYLIB-INDENT-2.
           PERFORM 9200-WRITE-COPYLIB-REC.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO WORK-LINE, COPYLIB-REC
               MOVE "ELSE" TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO WORK-LINE, COPYLIB-REC
               STRING "IF FILE-STATUS = " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "46" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO WORK-LINE, COPYLIB-REC
               MOVE "MOVE 15 TO COND-WORD" TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "ELSE" TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           IF DE-BLOWUP = "Y"
               STRING "MOVE " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      DE-CALL-TYPE DELIMITED BY SPACES,
                      " ERR 9999" DELIMITED BY SIZE,
                      "-" DELIMITED BY SIZE,
                      DE-CALL-TYPE DELIMITED BY SPACES,
                      "-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      QUOTE-CHAR DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "TO BU-MSG-AREA" TO COPYLIB-INDENT-3
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD" TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "PERFORM 2100-BLOWUP" TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC
           ELSE
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD" TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "ELSE" TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "IF " DELIMITED BY SIZE,
                  HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                  " OF " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  " NOT = " DELIMITED BY SIZE,
                  HOLD-ARG-NAME DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO WORK-LINE, COPYLIB-REC
               STRING "PERFORM 9999-RESET-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                  INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "MOVE 15 TO COND-WORD." TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "9999-RESET-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      "." DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "MOVE HIGH-VALUES TO " DELIMITED BY SIZE,
                      HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                      " OF " DELIMITED BY SIZE,
                      HOLD-REC DELIMITED BY SPACES,
                      "." DELIMITED BY SIZE
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "START " DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      " KEY > " DELIMITED BY SIZE,
                      HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                      " OF " DELIMITED BY SIZE,
                      HOLD-REC DELIMITED BY SPACES
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "INVALID KEY MOVE " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "00" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " TO FILE-STATUS." DELIMITED BY SIZE
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC.

       8290-D5-X.
           EXIT.

       8300-DBGET7.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           PERFORM 9040-MOVE-ARG.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "READ " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES,
                  " INTO " DELIMITED BY SIZE,
                  HOLD-BUFFNAME DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9050-INVALID-KEY.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "IF FILE-STATUS = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "23" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           MOVE SPACES TO COPYLIB-REC.
           MOVE "MOVE 17 TO COND-WORD" TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9000-ELSE-B.
           PERFORM 9010-IF-FILE-STATUS-NOT.
           PERFORM 9030-BU-MESSAGE.

           IF DE-ACCESS-MODE = "O"
               MOVE SPACES TO COPYLIB-REC
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "9999-RESET-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      "." DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-A
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "MOVE HIGH-VALUES TO " DELIMITED BY SIZE,
                      HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                      " OF " DELIMITED BY SIZE,
                      HOLD-REC DELIMITED BY SPACES,
                      "." DELIMITED BY SIZE
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "START " DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      " KEY > " DELIMITED BY SIZE,
                      HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                      " OF " DELIMITED BY SIZE,
                      HOLD-REC DELIMITED BY SPACES
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-AREA-B
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC, WORK-LINE
               STRING "INVALID KEY MOVE " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      "00" DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      " TO FILE-STATUS." DELIMITED BY SIZE
               INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC.

       8390-D7-X.
           EXIT.

       8400-DBFIND.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           PERFORM 9040-MOVE-ARG.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "START " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES,
                  " KEY = ", DELIMITED BY SIZE,
                  HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                  " OF " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9050-INVALID-KEY.

           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "IF (FILE-STATUS NOT = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "00" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  ") AND (FILE-STATUS-1 NOT = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "2" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  ")" DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.
           PERFORM 9030-BU-MESSAGE.

       8490-DF-X.
           EXIT.

       8500-DBPUT.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "WRITE " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  " FROM " DELIMITED BY SIZE,
                  HOLD-BUFFNAME DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.
           PERFORM 9050-INVALID-KEY.

           PERFORM 9010-IF-FILE-STATUS-NOT.
           PERFORM 9030-BU-MESSAGE.
       8590-DP-X.
           EXIT.

       8600-DBUPDATE.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "REWRITE " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  " FROM " DELIMITED BY SIZE,
                  HOLD-BUFFNAME DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9050-INVALID-KEY.
           PERFORM 9010-IF-FILE-STATUS-NOT.
           PERFORM 9030-BU-MESSAGE.
       8690-DU-X.
           EXIT.

       8700-DBDELETE.
           PERFORM 9060-PARA-NAME.
           PERFORM 9070-ZERO-COND-WORD.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "DELETE " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

           PERFORM 9050-INVALID-KEY.
           PERFORM 9010-IF-FILE-STATUS-NOT.
           PERFORM 9030-BU-MESSAGE.
       8790-DD-X.
           EXIT.

       8800-SELECT.
           MOVE SPACES TO SELECT-REC, WORK-LINE.
           STRING "SELECT " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO SELECT-AREA-B.
           PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC, WORK-LINE.
           STRING "ASSIGN TO DATABASE-MCFL" DELIMITED BY SIZE,
                  HOLD-BASE DELIMITED BY SIZE,
                  HOLD-DSET-NUM DELIMITED BY SIZE,
                  HOLD-KEY-NUM DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO SELECT-INDENT-1.
           PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC.
           MOVE "ORGANIZATION IS INDEXED" TO SELECT-INDENT-1.
           PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC.
           MOVE "  ACCESS MODE IS DYNAMIC" TO SELECT-INDENT-1.
           PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC.
           MOVE "RECORD KEY IS EXTERNALLY-DESCRIBED-KEY"
             TO SELECT-INDENT-1.
           PERFORM 9210-WRITE-SELECT-REC.

           IF HOLD-DSET-NAME-1 = "D"
               MOVE SPACES TO SELECT-REC
               MOVE "  WITH DUPLICATES" TO SELECT-INDENT-1
               PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC.
           MOVE "FILE STATUS IS FILE-STATUS." TO SELECT-INDENT-1.
           PERFORM 9210-WRITE-SELECT-REC.

           MOVE SPACES TO SELECT-REC.
           PERFORM 9210-WRITE-SELECT-REC.

       8890-S-X.
           EXIT.

       8900-FD.
           MOVE SPACES TO FD-REC, WORK-LINE.
           STRING "FD  " DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES
              INTO WORK-LINE.
           MOVE WORK-LINE TO FD-AREA-A.
           PERFORM 9220-WRITE-FD-REC.

           MOVE SPACES TO FD-REC.
           MOVE "LABEL RECORDS ARE STANDARD." TO FD-AREA-B.
           PERFORM 9220-WRITE-FD-REC.

           MOVE SPACES TO FD-REC, WORK-LINE.
           STRING "01  " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  "." DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO FD-AREA-A.
           PERFORM 9220-WRITE-FD-REC.

           MOVE SPACES TO FD-REC, WORK-LINE.
           STRING "COPY DDS-MCRP" DELIMITED BY SIZE,
              HOLD-BASE DELIMITED BY SIZE,
              HOLD-DSET-NUM DELIMITED BY SIZE,
              "00  OF MCFL" DELIMITED BY SIZE,
              HOLD-BASE DELIMITED BY SIZE,
              HOLD-DSET-NUM DELIMITED BY SIZE,
              HOLD-KEY-NUM DELIMITED BY SIZE,
              "." DELIMITED BY SIZE,
                INTO WORK-LINE.
            MOVE WORK-LINE TO FD-AREA-B.
            PERFORM 9220-WRITE-FD-REC.

           MOVE SPACES TO FD-REC.
           PERFORM 9220-WRITE-FD-REC.

       8990-F-X.
           EXIT.

       9000-ELSE-B.
           MOVE SPACES TO COPYLIB-REC.
           MOVE "ELSE" TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9010-IF-FILE-STATUS-NOT.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "IF FILE-STATUS NOT = " DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
                  "00" DELIMITED BY SIZE,
                  QUOTE-CHAR DELIMITED BY SIZE,
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9020-MOVE-99.
           IF DE-BLOWUP = "Y"
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD" TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "PERFORM 2100-BLOWUP." TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
           ELSE
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD." TO COPYLIB-INDENT-1.

       9030-BU-MESSAGE.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           IF DE-BLOWUP = "Y"
               STRING "MOVE " DELIMITED BY SIZE,
                      QUOTE-CHAR DELIMITED BY SIZE,
                      DE-CALL-TYPE DELIMITED BY SPACES,
                      " ERR 9999" DELIMITED BY SIZE,
                      "-" DELIMITED BY SIZE,
                      DE-CALL-TYPE DELIMITED BY SPACES,
                      "-" DELIMITED BY SIZE,
                      HOLD-FILE DELIMITED BY SPACES,
                      QUOTE-CHAR DELIMITED BY SIZE
                 INTO WORK-LINE
               MOVE WORK-LINE TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "TO BU-MSG-AREA" TO COPYLIB-INDENT-2
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD" TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
               MOVE SPACES TO COPYLIB-REC
               MOVE "PERFORM 2100-BLOWUP." TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC
           ELSE
               MOVE SPACES TO COPYLIB-REC
               MOVE "MOVE 99 TO COND-WORD." TO COPYLIB-INDENT-1
               PERFORM 9200-WRITE-COPYLIB-REC.

       9040-MOVE-ARG.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "MOVE " DELIMITED BY SIZE,
                  HOLD-ARG-NAME DELIMITED BY SPACES,
                  " TO " DELIMITED BY SIZE,
                  HOLD-KEY-IBM-NAME DELIMITED BY SPACES,
                  " OF " DELIMITED BY SIZE,
                  HOLD-REC DELIMITED BY SPACES,
                  "." DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9050-INVALID-KEY.
           MOVE SPACES TO COPYLIB-REC.
           MOVE "INVALID KEY MOVE FILE-STATUS TO FILE-STATUS."
             TO COPYLIB-INDENT-1.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9060-PARA-NAME.
           MOVE SPACES TO COPYLIB-REC, WORK-LINE.
           STRING "9999" DELIMITED BY SIZE,
                  "-" DELIMITED BY SIZE,
                  DE-CALL-TYPE DELIMITED BY SPACES,
                  "-" DELIMITED BY SIZE,
                  HOLD-FILE DELIMITED BY SPACES
                  "." DELIMITED BY SIZE
              INTO WORK-LINE.
           MOVE WORK-LINE TO COPYLIB-AREA-A.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9070-ZERO-COND-WORD.
           MOVE SPACES TO COPYLIB-REC.
           MOVE "MOVE 0 TO COND-WORD." TO COPYLIB-AREA-B.
           PERFORM 9200-WRITE-COPYLIB-REC.

       9200-WRITE-COPYLIB-REC.
           ADD 1 TO COPYLIB-CNT.
           MOVE COPYLIB-CNT TO COPYLIB-SEQ-NUMBER-1.
           MOVE "00" TO COPYLIB-SEQ-NUMBER-2.
           MOVE SAVE-DATE TO COPYLIB-DATE.
           WRITE COPYLIB-REC.

       9210-WRITE-SELECT-REC.
           ADD 1 TO SELECT-CNT.
           MOVE SELECT-CNT TO SELECT-SEQ-NUMBER-1.
           MOVE "00" TO SELECT-SEQ-NUMBER-2.
           MOVE SAVE-DATE TO SELECT-DATE.
           WRITE SELECT-REC.

       9220-WRITE-FD-REC.
           ADD 1 TO FD-CNT.
           MOVE FD-CNT TO FD-SEQ-NUMBER-1.
           MOVE "00" TO FD-SEQ-NUMBER-2.
           MOVE SAVE-DATE TO FD-DATE.
           WRITE FD-REC.

       COPY HCATREAD IN COPYLIB.
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
