000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  TCODINFO.
000400 AUTHOR.        C HILLES.
000500 INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
000600 DATE-WRITTEN.  FEBRUARY, 1983.
000700 DATE-COMPILED.
000800*REMARKS.   THIS SUBPROGRAM PASSES INFORMATION ABOUT CORPORATE
000900*    ON JANUARY 28, 1985, CHANGED THIS SUBPROGRAM TO RETURN
001000*    A CODE OF "NS" TO THE CALLING MMIS PROGRAM IF THE CORORATE
001100*    CODE INQUIRED UPON IS "CODED NONSTOREROOM" - DETERMINED
001200*    BY ONHAND = REORDER = MAX = 0.  CIH.
001300*
      *C 06/12/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.    HP-3000.
001700 OBJECT-COMPUTER.    HP-3000.
           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

002000 DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

002100 WORKING-STORAGE SECTION.
002200
002300 01  BU-DISPLAY-MSG.
002400     05  BU-DISPLAY-MSG-1          PIC X(1)  VALUE SPACES.
002500     05  FILLER                    PIC X(59).
002600
002700 COPY CDESC      IN COPYLIB.
002800**************************************************************
002900**                                                          **
003000**            D A T A B A S E   W O R K                     **
003100**                                                          **
003200**************************************************************
003300
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

003400 COPY DBSTAT     IN COPYLIB.
003500
003600 01  DSET-NAMES.
003700     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
003800     05  DSET-DUMMY             PIC X(16)  VALUE SPACES.
003900
004000 01  MODE-AREA.
004100     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
004200     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
004300     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
004400
004500 01  ITEM-LISTINGS.
004600     05  ALL-ITEM-LIST       PIC XX     VALUE "@;".
004700     05  CODE-SEARCH         PIC X(10)  VALUE "CORP-CODE;".
004800
004900 01  DUMMY-ARG               PIC X  VALUE SPACES.
005000
005100 01  CODE-ARG                PIC X(8)  VALUE SPACES.
005200
005300 01  PASSWORD                PIC X(5)  VALUE "JADE;".
005400
005500**************************************************************
005600**                                                          **
005700**           D A T A B A S E   B U F F E R S                **
005800**                                                          **
005900**************************************************************
006000 COPY MSTORERM   IN COPYLIB.
006100
006200 LINKAGE SECTION.
006300
006400 01  STORES-DATA.
006500     05  PASSED-CORP-CODE     PIC X(8).
006600     05  RETURN-CODE          PIC X(2).
006700     05  UNIT-COST            PIC S9(11)V9(4).
006800     05  UM                   PIC X(2).
006900     05  DESC-1               PIC X(80).
007000     05  DESC-2               PIC X(80).
007100     05  DESC-3               PIC X(80).
007200     05  EST-LT               PIC 9(4).
007300 01  DBPARAMETERS-STORES.
007400     05  BASE2              PIC X(24).
007500     05  DSET-NAME-S        PIC X(16).
007600     05  PASSWORD-S         PIC X(8).
007700
007800 PROCEDURE DIVISION USING STORES-DATA DBPARAMETERS-STORES.
007900 1-HOUSEKEEP SECTION.
008000
           OPEN INPUT MSTORERM.
008100     PERFORM 6-MAIN THRU 6-MAIN-X.
           CLOSE MSTORERM.
008200
008300 2-EOJ.
008400     GOBACK.
008500
008600 6-MAIN.
008700
008800     MOVE SPACES TO RETURN-CODE
008900                    UM
009000                    DESC-1
009100                    DESC-2
009200                    DESC-3.
009300     MOVE 0      TO UNIT-COST.
009400
009500     MOVE PASSED-CORP-CODE TO CODE-ARG.
009600*    CALL "DBGET" USING BASE2, DSET-MSTORERM MODE7 STATUS-AREA
009700*        ALL-ITEM-LIST BUF-MSTORERM CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC.
           READ MSTORERM INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
009800     IF COND-WORD = 17
009900         MOVE "NF" TO RETURN-CODE
010000         GO TO 6-MAIN-X
010100     ELSE
010200     IF COND-WORD NOT = 0
010300         MOVE "BU"                 TO   RETURN-CODE
010400         GO TO 6-MAIN-X.
010500
010600     MOVE "00" TO RETURN-CODE.
010700
010800     MOVE STR-MKT-COST             TO   UNIT-COST
010900
011000     MOVE STR-UM                   TO   UM.
011100     MOVE STR-EST-LT               TO   EST-LT.
011200
011300*---------- IF THE CORORATE CODE IS "CODED NONSTORERM"
011400*---------- (ONHAND = REORDER = MAX = 0), RETURN A CODE OF "NS"
011500     IF STR-ONHAND = 0
011600       IF STR-REORDER = 0
011700         IF STR-MAX = 0
011800           MOVE "NS"               TO  RETURN-CODE.
011900
012000     MOVE 3                        TO   CDESC-LINES-TO-GET.
012100     CALL "CDESC" USING CDESC-RET-CODE, BASE2, STATUS-AREA,
012200       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
012300     IF BU-DISPLAY-MSG-1 NOT = SPACES
012400         MOVE "BU"                 TO   RETURN-CODE
012500         GO TO 6-MAIN-X.
012600     MOVE CDESC (1)                TO   DESC-1.
012700     MOVE CDESC (2)                TO   DESC-2.
012800     MOVE CDESC (3)                TO   DESC-3.
012900
013000 6-MAIN-X.
013100     EXIT.
