       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCOMPPO.
       AUTHOR. KURT MOVSESIAN.
      *REMARKS.
      *
      **************************************************************
      *                     T C O M P P O
      **************************************************************
      *   THIS IS AN ONLINE PROGRAM FOR CANCELLING REMAINING ORDER
      *   QUANTITY FOR ALL ITEMS ON A GIVEN PO
      **************************************************************


      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C   07/22/1996    CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      ***------------------------------------------------------------***
      *C  04/03/2003    DCR  DAN RAUCH
      *C  DCR01 - ADDED LOGIC FOR PO LOGGING
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.
          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZCOMPPO-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC               PIC X(1000).
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       WORKING-STORAGE SECTION.

      **********************
      *                    *
      *  S W I T C H E S   *
      *                    *
      **********************

       01  SWITCH-PARAMETERS.
           05  FATAL-ERR-SW             PIC X(1)  VALUE "N".
           05  COMPANY-SAVE             PIC X(3)  VALUE SPACES.

       01  BUILD-PO-NUM.
           05  FILLER                  PIC X    VALUE "P".
           05  PO-NUM                  PIC X(7) VALUE SPACES.
           05  PO-RLSE                 PIC X(3) VALUE "000".
           05  PO-RCV                  PIC X(3) VALUE "000".


       COPY VCOMAREA IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(7)  VALUE "FCOMPPO".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(64)    VALUE SPACE.
           05  MSG-FLD               PIC X(12)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.

       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.

       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO  COMP-4.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.

DCR01 *==============================================================
DCR01  01  WS-Z000-EXTRA-FLDS.
DCR01      03  WS-Z000-PGM         PIC X(10)   VALUE "TCOMPPO".
DCR01      COPY POLOGSUBWS  IN COPYLIB.
DCR01 *==============================================================

       01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS COMP-4.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL             PIC S9(4)    VALUE ZERO  COMP-4.
           05  PAGECNTL              PIC S9(4)    VALUE 49    COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".


      *************************************************************
      **    PARAMETER AREA FOR 'TSHWRDFM'                        **
      *************************************************************
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      **************************************************************
      **************************************************************
      **                                                          **
      **             TERMINAL I/O DATA AREA                       **
      **                                                          **
      **************************************************************
      **************************************************************

       01  SCREEN-1.
           05  DISP-COMPANY                PIC X(3).
           05  DE-PO-NUM                   PIC X(7).
           05  DE-PO-REL                   PIC X(3).
           05  DE-COMMAND-LINE             PIC X(79).
           05  DE-MESSAGE-LINE             PIC X(79).


      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MPLT0     IN COPYLIB.

       COPY MPLTP01   IN COPYLIB.

       COPY DPORECD   IN COPYLIB.


      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".

       COPY DATAB IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".

       01 ARG-VALUES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  PO-ARG                 PIC X(14) VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X     VALUE SPACES.
           05  FILE-STATUS-2          PIC X     VALUE SPACES.

       01  COMMAND-AREA.
           05  OVERRIDE-ZCOMPPO       PIC X(34) VALUE
               "OVRDSPF FILE(ZCOMPPO) SHARE(*YES)".
           05  OVERRIDE-PARM2         PIC S9(10)V9(5) COMP-3 VALUE 34.

       COPY TBLOWUP  IN COPYLIB.
       COPY LANGUAGE IN COPYLIB.
       COPY CATREAD  IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
           CALL "QCMDEXC" USING OVERRIDE-ZCOMPPO, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.

           OPEN INPUT MPLTINFO-I, DPORECD-I.

      **************************************************
      *                                                *
      *   GET CO. AND PRIME FROM MPLTINFO              *
      *   USING 'P 01' AS THE ARGUMENT                 *
      *                                                *
      **************************************************

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG               TO  BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY        TO  COMPANY-SAVE.

DCR01      MOVE MPLTINFO-COMPANY        TO  WS-Z000-PLANT-CODE.
DCR01 *---------------------------------------------------------
DCR01      PERFORM Z000-PGM-SETUP       THRU Z000-PS-EXIT.
DCR01 *---------------------------------------------------------

       1-H-X.
           EXIT.

DCR01  Z000-PGM-SETUP.
DCR01
DCR01 *****************************************************
DCR01 *   MAKE SURE PO LOGGING IS ACTIVE FOR THIS PLANT
DCR01 *****************************************************
DCR01      SET  Z000-POLG-ACTIVE-NO TO TRUE.
DCR01
DCR01      MOVE WS-Z000-POLG-KEY         TO  PLTINFOKEY.
DCR01      READ MPLTINFO-I INTO BUF-MPLTINFO.
DCR01      IF FILE-STATUS = "00"
DCR01         IF  PLTINFODTA(1:1) = "Y"
DCR01             SET  Z000-POLG-ACTIVE-YES TO TRUE
DCR01         END-IF
DCR01      END-IF.
DCR01
DCR01 *---------------------------------------------------------
DCR01      IF  Z000-POLG-ACTIVE-NO
DCR01          GO TO Z000-PS-EXIT
DCR01      END-IF.
DCR01
DCR01      PERFORM Z001-SETUP-PO-LOGGING  THRU Z001-EXIT.
DCR01 *---------------------------------------------------------
DCR01
DCR01  Z000-PS-EXIT.
DCR01      EXIT.


       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-I, DPORECD-I.

       2-EOJ-X.
            EXIT.

      ******************************************************
      **                                                  **
      **   BLOWUP ROUTINE                                 **
      **                                                  **
      ******************************************************

       2-BLOWUP.
           MOVE "TCOMPPO"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.

       4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       4-PGM-ERROR-X.
           EXIT.

      **************************************************
      *                                                *
      *     6 - M A I N                                *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "COMPPO1"  TO  VIEW-NFNAME.
           MOVE SPACES     TO  SCREEN-1.

       6-PUT-BUFFER-1.
           MOVE ZEROS                   TO  DE-PO-REL.
           MOVE COMPANY-SAVE            TO  DISP-COMPANY.

       6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  SCREEN-1.

           IF VIEW-LASTKEY = 3
               GO TO 6-M-X
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        *** INVALID FUNCTION KEY ENTERED ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

      *****************************************************
      *                                                   *
      *    EDIT PURCHASE ORDER NUMBER                     *
      *                                                   *
      *****************************************************

       6-EDIT-PO-ENTRY.
           MOVE DE-PO-NUM               TO  PO-NUM.
           MOVE DE-PO-REL               TO  PO-RLSE.
           MOVE BUILD-PO-NUM            TO  PO-ARG,
                                            BU-DISPLAY-FLD (1).
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            *** PURCHASE ORDER DOES NOT EXIST ***
                   MOVE  16 TO LANG-SETNUM
                   MOVE  45 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 2  TO  FIELD-NUMBER
                   PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                   GO TO 6-SHOWFORM-SCREEN-1
               ELSE
                   MOVE "START DPORECD 6-EPE" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READN DPORECD 6-EPE" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

      ***********************************************************
      **   COMPLETE THE ORDER BY CALLING 'SCOMPPO'.  COMPLETING
      **   THE ORDER INVOLVES MODIFYING QUANTITY ORDERED TO
      **   MATCH QUANTITY RECEIVED FOR ALL ITEMS ON THE PO
      ***********************************************************

       6-CALL-SCOMPPO.
      *    ***  NOW PROCESSING  ***
           MOVE  14 TO LANG-SETNUM.
           MOVE   2 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO   DE-COMMAND-LINE.
           MOVE B"1"           TO   IND (98).
           MOVE SCREEN-1       TO   DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-AUTO-READ-SCREEN.

           CALL "SCOMPPO" USING BASE,
                                BUILD-PO-NUM,
                                BUF-DPORECD,
                                SWITCH-PARAMETERS,
                                LANGUAGE-PARMS.

DCR01 **--------------------------------------------------------------
DCR01      PERFORM Z100-PROCESS-PO-LOGGING  THRU Z100-EXIT.
DCR01 **--------------------------------------------------------------

           MOVE SPACES  TO SCREEN-1.
      *  PROCESS COMPLETE; ENTER NEXT ORDERS OR 'F3' TO EXIT
068800     MOVE  16 TO LANG-SETNUM.
068900     MOVE  86 TO LANG-MSGNUM.
069000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE.
           MOVE B"1" TO IND (98).
           GO TO 6-PUT-BUFFER-1.

       6-M-X.
           EXIT.

       COPY DISPCALL   IN COPYLIB.
       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

DCR01       COPY POLOGSUBR  IN COPYLIB.
