       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TCOMMIT.
       AUTHOR.         ANNETTE M. KRAUSS.
       DATE-WRITTEN.   SEPT 1987.
       DATE-COMPILED.
      *REMARKS.
      **************************************************************
      *                                                            *
      *D   TCOMMIT                                                 *
      *                                                            *
      *D    THIS REPORT SHOWS TOTAL VENDOR COMMITMENT BY PO UNITS/ *
      *D    PRICES OR INVOICE UNITS/PRICES.                        *
      *                                                            *
      **************************************************************
      *C  02/21/94  JEFF BUNGO  REQ #6449
      *C    ADDED NEW FIELDS TO HISTORY DATABASES TO MATCH LIVE
      *C    DATABASES.  CHANGED PROGRAM TO USE THESE NEW FIELDS
      *C    IN HISTORY.
      *C  09/12/96  W L  MCINTYRE
      *C    MADE REVISIONS FOR END-OF-CENTURY COMPATABILITY
      *C
      *C  04/19/99  CA YODER
      *C    ADDED OPTION FOR NAPANEE TO SELECT INVOICELESS POS ONLY
      *C    FOR THE REPORT.
      *C
      *C  04/18/01  CA YODER
      *C    ADDED OPTION FOR NAPANEE TO PRINT EITHER DETAIL OR SUMMARY
      *C    REPORT.
      *C
      *C  06/15/04  CA YODER    NAPANEE REQUEST
      *C    ADDED OPTION TO INCLUDE ITEMS BY INVOICE DATE INSTEAD OF
      *C    PO DATE.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.    C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE        ASSIGN TO PRINTER-MCPRT.
           SELECT SVENDOR-FILE      ASSIGN TO DISK-SORT.
           SELECT SPO-FILE          ASSIGN TO DISK-SORT.
           SELECT PO-MST-FILE       ASSIGN TO DISK-POSORT.
           SELECT VENDOR-MST-FILE   ASSIGN TO DISK-VENDSORT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT VENDCODE-I
                  ASSIGN TO DATABASE-MCFLCSVEN2
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0902
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECDH-I
                  ASSIGN TO DATABASE-MCFLST0302
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEMH-I
                  ASSIGN TO DATABASE-MCFLST0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I
                  ASSIGN TO DATABASE-MCFLST0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.

       SD  SPO-FILE
           RECORD CONTAINS 46 CHARACTERS.
       01  SPO-REC.
           05  SPO-VENDOR-CODE        PIC X(10).
           05  SPO-PO-NUMBER          PIC X(13).
           05  SPO-PO-DATE            PIC X(6).
           05  SPO-AMOUNT             PIC S9(13)V9(4).

       SD  SVENDOR-FILE
           RECORD CONTAINS 27 CHARACTERS.
       01  SVENDOR-REC.
           05  SVENDOR-CODE           PIC X(10).
           05  SVENDOR-AMOUNT         PIC S9(13)V9(4).

       FD  PO-MST-FILE
           RECORD CONTAINS 46 CHARACTERS.
       01  PO-REC.
           05  PO-VENDOR-CODE         PIC X(10).
           05  PO-PO-NUMBER           PIC X(13).
           05  PO-PO-DATE             PIC X(6).
           05  PO-AMOUNT              PIC S9(13)V9(4).

       FD  VENDOR-MST-FILE
           RECORD CONTAINS 27 CHARACTERS.
       01  VENDOR-REC.
           05  VENDOR-CODE             PIC X(10).
           05  VENDOR-AMOUNT          PIC S9(13)V9(4).

       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC                  PIC X(132).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500   OF MCFLCS0501.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700   OF MCFLCS0701.

       FD  VENDCODE-I
           LABEL RECORDS ARE STANDARD.
       01  VENDCODE-REC-I.
           COPY DDS-MCRPCSVEND   OF MCFLCSVEN2.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-MCRPCS0900   OF MCFLCS0902.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-MCRPCS1000   OF MCFLCS1002.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC-I.
           COPY DDS-MCRPCS2500   OF MCFLCS2502.

       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-MCRPST0300   OF MCFLST0302.

       FD  DPOITEMH-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEMH-REC-I.
           COPY DDS-MCRPST0400   OF MCFLST0401.

       FD  DINVRCDH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-REC-I.
           COPY DDS-MCRPST0800   OF MCFLST0802.

       WORKING-STORAGE SECTION.
       COPY FUNCTDEF IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  SAVE-VENDOR-CODE           PIC X(10)  VALUE SPACES.
       01  SAVE-VENDOR-NAME           PIC X(44)  VALUE SPACES.
       01  PASSED-SPOOL-PRT           PIC S9(2) COMP-4 VALUE 0.
       01  INDX                       PIC 9(2)   VALUE 1.
       01  INDX2                      PIC 9(2)   VALUE 1.
       01  INDX3                      PIC 9(2)   VALUE 1.
       01  PLANT-NUMBER               PIC X(3).

       01  ACCUMULATORS.
           05  VENDOR-CTR             PIC 9(3)   VALUE 0.
           05  PAGE-NUM               PIC 9(3)   VALUE 0.
           05  LINE-CTR               PIC 9(3)   VALUE 0.
           05  TOTAL-PO-COMMIT        PIC S9(13)V9(4) VALUE 0.
           05  TOTAL-VEN-COMMIT       PIC S9(13)V9(4) VALUE 0.
           05  COMMITTED              PIC S9(13)V9(4) VALUE 0.

       01  EOF-SWITCHES.
           05  EOF-VEN                PIC X(1)   VALUE "N".
               88  ALL-VENDOR-RECORDS-PROCESSED  VALUE "Y".
           05  EOF-PO                 PIC X(1)   VALUE "N".
               88  ALL-PO-RECORDS-PROCESSED      VALUE "Y".

       01  PROCESS-INDICATORS.
           05  INVOICE-IND            PIC X(1)   VALUE "N".
               88  INVOICE-ON                    VALUE "Y".
           05  VENDOR-IND             PIC X(1)   VALUE "N".
               88 VENDOR-WRITTEN                 VALUE "Y".
           05  POSTAL-IND             PIC X(1)   VALUE "N".
               88  POSTAL-WRITTEN                VALUE "Y".
           05  SAME-VEN-IND           PIC X(1)   VALUE "N".
               88  SAME-VENDOR                   VALUE "Y".

       01  USER-MESSAGES.
           05  NO-VENDORS              PIC X(132) VALUE
               "*** ALL VENDOR CODES CHOSEN ARE INVALID ***".
           05  NO-INVOICE              PIC X(132) VALUE
               "*** NO INVOICE INFORMATION AVAILABLE ***".
           05  NO-POSTAL-CODES         PIC X(132) VALUE
               "*** NO VENDORS MATCH POSTAL CODES CHOSEN ***".
           05  NO-DATA                 PIC X(132) VALUE
               "*** NO DATA QUALIFIED FOR THE REPORT ***".

       01  CHECK-DATE.
           05  CURR-DATE-YY           PIC X(2).
           05  CURR-DATE-MM           PIC X(2).
           05  CURR-DATE-DD           PIC X(2).

       01  POH-REALIGN-DATE-CN        PIC 9(8).
       01  POH-COMPARE-DATE-CN REDEFINES POH-REALIGN-DATE-CN.
           05  POH-DATE-CC            PIC X(2).
           05  POH-COMPARE-DATE-YMD.
               10  POH-DATE-YY            PIC X(2).
               10  POH-DATE-MM            PIC X(2).
               10  POH-DATE-DD            PIC X(2).

       01  INVH-REALIGN-DATE-CN        PIC 9(8).
       01  INVH-COMPARE-DATE-CN REDEFINES INVH-REALIGN-DATE-CN.
           05  INVH-DATE-CC            PIC X(2).
           05  INVH-COMPARE-DATE-YMD.
               10  INVH-DATE-YY            PIC X(2).
               10  INVH-DATE-MM            PIC X(2).
               10  INVH-DATE-DD            PIC X(2).

       01  RSHIFT-PARMS.
           05  RET-CODE               PIC X(2).
           05  SHIFT-FIELD.
               10  FILLER             PIC X(5).
               10  SHIFT-FIELD-L3     PIC X(3).

      *************************************************************
      *************************************************************
      **                                                         **
      **              D A T A    B A S E    A R E A              **
      **                                                         **
      *************************************************************
      *************************************************************

       01  BASE                       PIC X(10)  VALUE "  STORES;".
       01  BASE-STHIST                PIC X(10)  VALUE "  STHIST;".
       01  PASSWORD                   PIC X(5)   VALUE "JADE;".
       01  DSET-NAME                  PIC X(16)  VALUE SPACES.

       COPY DBMODES IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

      ***************************************************************
      ***************************************************************
      **                                                           **
      **         C A L L E D   S U B R O U T I N E S               **
      **                                                           **
      ***************************************************************
      ***************************************************************
       COPY TDATECHK IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

      ***************************************************************
      ***************************************************************
      **                                                           **
      **             P R I N T    A R E A S                        **
      **                                                           **
      ***************************************************************
      ***************************************************************
       01  PRINT-LINE                 PIC X(132)  VALUE SPACES.

       01  HEAD1 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(29).
           05  HEAD1-TITLE1           PIC X(39).
           05  HEAD1-TITLE2           PIC X(37).
           05  FILLER                 PIC X(15).
           05  HEAD1-PLANT            PIC X(6).
           05  HEAD1-PLANT-OUT        PIC X(3).
           05  FILLER                 PIC X(3).

       01  HEAD2 REDEFINES PRINT-LINE.
           05  FILLER                 PIC X(1).
           05  HEAD2-DATE             PIC X(8).
           05  FILLER                 PIC X(5).
           05  HEAD2-TIME             PIC X(8).
           05  FILLER                 PIC X(10).
           05  HEAD2-TITLE1           PIC X(30).
           05  HEAD2-TITLE2           PIC X(42).
           05  FILLER                 PIC X(14).
           05  HEAD2-PAGE             PIC X(6).
           05  HEAD2-PAGE-NO          PIC Z,ZZ9.
           05  FILLER                 PIC X(3).

       01  HEAD4 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(2).
           05  HEAD4-CODE              PIC X(11).
           05  FILLER                  PIC X(1).
           05  HEAD4-NAME              PIC X(11).
           05  FILLER                  PIC X(34).
           05  HEAD4-PO                PIC X(14).
           05  FILLER                  PIC X(5).
           05  HEAD4-DATE              PIC X(6).
           05  FILLER                  PIC X(12).
           05  HEAD4-AMOUNT            PIC X(6).
           05  FILLER                  PIC X(30).


       01  LINE1 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(2).
           05  LINE1-VENDOR-CODE       PIC X(10).
           05  FILLER                  PIC X(2).
           05  LINE1-VENDOR-NAME       PIC X(44).
           05  FILLER                  PIC X(3).
           05  LINE1-PO-NUMBER         PIC X(14).
           05  FILLER                  PIC X(1).
           05  LINE1-DATE              PIC X(8).
           05  FILLER                  PIC X(1).
           05  LINE1-AMOUNT            PIC Z,ZZZ,ZZZ,ZZZ,ZZZ.9(4).
           05  FILLER                  PIC X(25).

       01  LINE2 REDEFINES PRINT-LINE.
           05  FILLER                  PIC X(5).
           05  LINE2-TOTAL-VERBAGE     PIC X(22).
           05  LINE2-VENDOR-CODE       PIC X(10).
           05  FILLER                  PIC X(6).
           05  LINE2-VENDOR-NAME       PIC X(44).
           05  FILLER                  PIC X(23).
           05  LINE2-AMOUNT            PIC Z,ZZZ,ZZZ,ZZZ,ZZZ.9(4).

       01  DOT-LINE.
           05  FILLER                  PIC X(132)  VALUE ALL "-".

       01  SCREEN-EDITS.
           05  PO-STRIP.
               10  FILLER              PIC X(1).
               10  PO-OUT              PIC X(13).
           05  DATE-EDIT.
               10  DE-YY               PIC X(2).
               10  DE-MM               PIC X(2).
               10  DE-DD               PIC X(2).
           05  DATE-FORMATTED.
               10  DO-MM               PIC X(2).
               10  FILLER              PIC X(1)  VALUE "/".
               10  DO-DD               PIC X(2).
               10  FILLER              PIC X(1)  VALUE "/".
               10  DO-YY               PIC X(2).

       01  CY-FROM-DATE.
           05  FROM-CENT               PIC X(2)  VALUE SPACES.
           05  FROM-YMD.
               10  FROM-YEAR           PIC X(2)  VALUE SPACES.
               10  FILLER              PIC X(4)  VALUE SPACES.
       01  CY-TO-DATE.
           05  TO-CENT                 PIC X(2)  VALUE SPACES.
           05  TO-YMD.
               10  TO-YEAR             PIC X(2)  VALUE SPACES.
               10  FILLER              PIC X(4)  VALUE SPACES.

       01  REPORT1.
           05  FILLER                  PIC X(30) VALUE
               " REPORT PARAMETERS CHOSEN :  ".
           05  R1-TOP.
               10  FILLER              PIC X(4)  VALUE "TOP ".
               10  R1-TOP-OUT          PIC X(3).
               10  FILLER              PIC X(9)  VALUE " VENDORS".
           05  R1-OPT REDEFINES R1-TOP PIC X(16).
           05  R1-CODES.
               10  R1-CODES-CHOOSEN OCCURS 7 TIMES.
                   15  R1-CODE-OUT     PIC X(10).
                   15  R1-SPACE        PIC X(1).
           05  FILLER                  PIC X(9)  VALUE SPACES.

       01  REPORT2.
           05  FILLER                  PIC X(46) VALUE SPACES.
           05  R2-CODES.
               10  R2-CODES-CHOOSEN OCCURS 5 TIMES.
                   15  R2-CODE-OUT     PIC X(10).
                   15  R2-SPACE        PIC X(1).
           05  FILLER                  PIC X(31) VALUE SPACES.

       01  REPORT3.
           05  FILLER                   PIC X(14) VALUE
               " DATE RANGE : ".
           05  R3-DATE-OPTION.
               10  R3-FROM-DATE         PIC X(8).
               10  FILLER               PIC X(4)  VALUE " TO ".
               10  R3-TO-DATE           PIC X(8).
           05  FILLER                   PIC X(7)  VALUE " USING ".
           05  R3-DOC-OUT               PIC X(30).
           05  FILLER                   PIC X(3)  VALUE SPACES.
           05  R3-INVLESS-ONLY          PIC X(18).
           05  FILLER                   PIC X(3)  VALUE SPACES.
           05  R3-RPT-TYPE              PIC X(11).
           05  FILLER                   PIC X(27) VALUE SPACES.

      ***************************************************************
      ***************************************************************
      **                                                           **
      **       D A T A    B A S E    B U F F E R    A R E A S      **
      **                                                           **
      ***************************************************************
      ***************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY DVENDOR  IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY DPOITEM  IN COPYLIB.

       COPY DINVRCD  IN COPYLIB.

       COPY DINVRCDH IN COPYLIB.

       COPY DPORECDH IN COPYLIB.

       COPY DPOITEMH IN COPYLIB.

       COPY AVENCODE IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-MPLTINFO         PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-DVENDOR          PIC X(16)  VALUE "DVENDOR;".
           05  DSET-DPORECD          PIC X(16)  VALUE "DPORECD;".
           05  DSET-DPOITEM          PIC X(16)  VALUE "DPOITEM;".
           05  DSET-DINVRCD          PIC X(16)  VALUE "DINVRCD;".
           05  DSET-AVENDCODE        PIC X(16)  VALUE "AVENDCODE;".

       01  ARG-VALUES.
           05  MPLTINFO-ARG          PIC X(4) VALUE "P 01".
           05  PO-ARG                PIC X(14).
           05  VENDOR-ARG            PIC X(10).
           05  DUMMY-ARG             PIC X(4).

       01  SEARCH-ITEMS.
           05  ALL-ITEMS             PIC X(2)  VALUE "@;".
           05  VEN-SEARCH            PIC X(10) VALUE "VEN-CODE;".
           05  PO-SEARCH             PIC X(10) VALUE "PO-RCV-NO;".

       COPY MULTLOCK IN COPYLIB.

      *************************************************************
      *************************************************************
      **                                                         **
      **                 TERMINAL I/O DATA AREA                  **
      **                                                         **
      *************************************************************
      *************************************************************

      *---------- PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       01  HD-RET-CODE                 PIC S9(4) COMP VALUE 0.
       01  HD-FILE-NAME                PIC X(17) VALUE "DHDR73.PUB".
       01  FNUM                        PIC S9(4) COMP VALUE 0.

      ***************************************************************
      ***************************************************************
      **                                                           **
      **             E S C A P E   S E Q U E N C E S               **
      **                                                           **
      ***************************************************************
      ***************************************************************
       COPY ESCNAM2 IN COPYLIB.

       01  ESC-INFO.
           05  COMPRESS-PRINT         PIC X(8).
           05  NORMAL-PRINT           PIC X(8).
           05  EXPAND-PRINT           PIC X(8).
       COPY CCHKOBJ   IN COPYLIB.
       COPY CCRTFILE  IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.

       COPY THDPRTB IN COPYLIB.

       01  DATA-LINE                     PIC X(320).
       01  DATA-LINE-X REDEFINES DATA-LINE.
           05  DATA-BUFFER OCCURS 4 TIMES
                                         PIC X(80).
       01  DATA-SCREEN REDEFINES DATA-LINE.
           05  HIDDEN-1                  PIC X(1).
           05  VENDOR-CODE-OPTION        PIC X(120).
           05  VCO-REDEFINED REDEFINES VENDOR-CODE-OPTION.
               10  VENDOR-CHOICE OCCURS 12 TIMES.
                   20  VENDOR-CODE-IN    PIC X(7).
                   20  VENDOR-PAYTO      PIC X(3).
           05  HIDDEN-2                  PIC X(1).
           05  POSTAL-CODE-OPTION        PIC X(108).
           05  PCO-REDEFINED REDEFINES POSTAL-CODE-OPTION.
               10  POSTAL-CHOICE OCCURS 12 TIMES
                                         PIC X(9).
           05  HIDDEN-3                  PIC X(1).
           05  TOP-VENDOR-OPTION         PIC X(3).
           05  DATE-RANGE.
               10  FROM-DATE             PIC X(6).
               10  TO-DATE               PIC X(6).
           05  YEAR-TO-DATE              PIC X(1).
           05  PO-CHOICE                 PIC X(1).
           05  INV-CHOICE                PIC X(1).
           05  HIDDEN-4                  PIC X(1).
           05  INVLESS-PO-ONLY           PIC X(1).
           05  INV-DATE-OPT              PIC X(1).
           05  DETAIL-RPT                PIC X(1).
           05  SUMMARY-RPT               PIC X(1).
           05  FILLER                    PIC X(72).

      *************************************************************
      **#########################################################**
      *************************************************************
      **                                                         **
      **          P R O C E D U R E    D I V I S I O N           **
      **                                                         **
      *************************************************************
      **#########################################################**
      *************************************************************

       PROCEDURE DIVISION.

       MAIN-PGM SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK            THRU 1-HSK-X.
           PERFORM 3-GET-PARAMETERS THRU 3-GP-X.
           PERFORM 4-RPT-OPTIONS    THRU 4-RO-X.
           PERFORM 6-MAIN           THRU 6-MAIN-X.
           PERFORM 2-EOJ            THRU 2-EOJ-X.
           GOBACK.

       1-HSK.
           MOVE "TCOMMIT" TO BU-PGM-NAME.

           OPEN INPUT MPLTINFO-I, DVENDOR-I, VENDCODE-I,
                      DPORECD-I, DPOITEM-I, DINVRCD-I,
                      DPORECDH-I, DPOITEMH-I, DINVRCDH-I.

       1-HSK-X.
           EXIT.

      ******************************************************
      **                 BLOWUP ROUTINE                   **
      ******************************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

       2-EOJ.
           CLOSE PRINT-FILE.

           CLOSE MPLTINFO-I, DVENDOR-I, VENDCODE-I,
                 DPORECD-I, DPOITEM-I, DINVRCD-I,
                 DPORECDH-I, DPOITEMH-I, DINVRCDH-I.

       2-EOJ-X.
           EXIT.

       3-GET-PARAMETERS.
           ACCEPT  HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           ACCEPT  DATA-BUFFER (1).
           ACCEPT  DATA-BUFFER (2).
           ACCEPT  DATA-BUFFER (3).
           ACCEPT  DATA-BUFFER (4).
           DISPLAY DATA-BUFFER (1).
           DISPLAY DATA-BUFFER (2).
           DISPLAY DATA-BUFFER (3).
           DISPLAY DATA-BUFFER (4).

           IF FROM-DATE NOT = SPACES
               IF TO-DATE = SPACES
                   MOVE FROM-DATE TO TO-DATE.

      *-----  FORMAT DATES WITH CENTURY

           MOVE FROM-DATE TO FROM-YMD.
           MOVE TO-DATE   TO TO-YMD.
           IF FROM-YMD NUMERIC
              IF FROM-YEAR > "70"
                 MOVE "19" TO FROM-CENT
              ELSE
                 MOVE "20" TO FROM-CENT
              END-IF
           END-IF.
           IF TO-YMD NUMERIC
              IF TO-YEAR > "70"
                 MOVE "19" TO TO-CENT
              ELSE
                 MOVE "20" TO TO-CENT
              END-IF
           END-IF.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.

           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * COMMIT" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "         TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE              TO BU-DISPLAY-FLD9 (1)
               GO TO 2-BLOWUP.

           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.
           MOVE CHAR-5PI        TO EXPAND-PRINT.

           ACCEPT CHECK-DATE FROM DATE.

      *------------- GET RECORD FOR PLANT NUMBER
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET ERROR IN 1-HSK"
                   TO BU-DISPLAY-MSG
               MOVE "P 01" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-COMPANY TO PLANT-NUMBER.

      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE FOR SORTING
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "POSORT"      TO CCRTFILE-FILE.
           MOVE "0046"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "90000"       TO CCRTFILE-NO-RECORDS.
           MOVE "02000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "10"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'POSORT' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "VENDSORT"    TO CCRTFILE-FILE.
           MOVE "0027"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "90000"       TO CCRTFILE-NO-RECORDS.
           MOVE "02000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "10"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'VENDSORT' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
       3-GP-X.
           EXIT.

      *-------------  DETERMINE REPORT PARAMETERS
       4-RPT-OPTIONS.
           IF VENDOR-CODE-OPTION NOT = SPACES
               MOVE "VENDOR CODES "   TO R1-OPT
           ELSE
           IF POSTAL-CODE-OPTION NOT = SPACES
               MOVE "POSTAL CODES "   TO R1-OPT
           ELSE
               MOVE TOP-VENDOR-OPTION TO R1-TOP-OUT.

           MOVE SPACES TO R1-CODES, R2-CODES.

           IF TOP-VENDOR-OPTION = SPACES
               MOVE 1      TO INDX, INDX2, INDX3
               PERFORM 41-LOAD-RPT-OPT UNTIL INDX > 12.

           IF FROM-DATE = SPACES OR TO-DATE = SPACES
               MOVE "X"             TO YEAR-TO-DATE.
           IF YEAR-TO-DATE NOT = "X"
               MOVE FROM-DATE       TO DATE-EDIT
               MOVE DE-YY           TO DO-YY
               MOVE DE-MM           TO DO-MM
               MOVE DE-DD           TO DO-DD
               MOVE DATE-FORMATTED  TO R3-FROM-DATE
               MOVE TO-DATE         TO DATE-EDIT
               MOVE DE-YY           TO DO-YY
               MOVE DE-MM           TO DO-MM
               MOVE DE-DD           TO DO-DD
               MOVE DATE-FORMATTED  TO R3-TO-DATE
           ELSE
               MOVE "YEAR TO DATE FIGURES"
                                    TO R3-DATE-OPTION.

           IF INV-CHOICE = SPACES
               MOVE "X"                    TO PO-CHOICE.
           IF PO-CHOICE = "X"
               MOVE "PO UNITS/PRICES"      TO R3-DOC-OUT
           ELSE
               IF INV-DATE-OPT = "X"
                   MOVE "INVOICE UNITS/PRICES; INV DATE"
                                           TO R3-DOC-OUT
               ELSE
               MOVE "INVOICE UNITS/PRICES" TO R3-DOC-OUT.

      *--------- IF INVOICELESS OPTION CHOSEN, MAKE SURE IT'S AN
      *--------- "X" AND NOT ANOTHER CHARACTER.
           IF INVLESS-PO-ONLY > " "
               MOVE "X"                    TO INVLESS-PO-ONLY
               MOVE "*INVOICELESS ONLY*"   TO R3-INVLESS-ONLY
           ELSE
               MOVE SPACES                 TO R3-INVLESS-ONLY.

      *----------- SUMMARY OR DETAIL RPT?
           IF SUMMARY-RPT > " "
               MOVE SPACES TO DETAIL-RPT
               MOVE "SUMMARY RPT"          TO R3-RPT-TYPE
           ELSE
               MOVE "X"    TO DETAIL-RPT
               MOVE "DETAIL RPT "          TO R3-RPT-TYPE.

       4-RO-X.
           EXIT.

       41-LOAD-RPT-OPT.
           IF VENDOR-CODE-OPTION NOT = SPACES
               IF VENDOR-CHOICE (INDX) NOT = SPACES
                  MOVE VENDOR-PAYTO (INDX)    TO SHIFT-FIELD
                  CALL "TRSHIFT" USING RET-CODE, SHIFT-FIELD
                  MOVE SHIFT-FIELD-L3         TO VENDOR-PAYTO (INDX)
                  IF INDX2 > 7
                    MOVE VENDOR-CHOICE (INDX) TO R2-CODE-OUT (INDX3)
                    ADD  1                    TO INDX3
                  ELSE
                    MOVE VENDOR-CHOICE (INDX) TO R1-CODE-OUT (INDX2)
                    ADD  1                    TO INDX2
               ELSE
                   NEXT SENTENCE
           ELSE
               IF POSTAL-CHOICE (INDX) NOT = SPACES
                   IF INDX2 > 7
                     MOVE POSTAL-CHOICE (INDX) TO R2-CODE-OUT (INDX3)
                     ADD  1                    TO INDX3
                   ELSE
                     MOVE POSTAL-CHOICE (INDX) TO R1-CODE-OUT (INDX2)
                     ADD 1                     TO INDX2.

           ADD 1 TO INDX.

      ***************************************************************
      **                                                           **
      **                       6 - M A I N                         **
      **                                                           **
      ***************************************************************

       6-MAIN.
           MOVE "PODL" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MPLTINFO-INVOICE-IND = "Y"
                   MOVE "Y" TO INVOICE-IND
               ELSE
                   NEXT SENTENCE

           ELSE
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "GET MPLTINFO ERROR IN 6-GET-BUFFER"
                   TO BU-DISPLAY-MSG
                   MOVE "PODL" TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

      *--------------  IF INVOICE UNITS/PRICES ARE TO BE USED, CHECK
      *--------------  WHETHER INVOICING IS BEING USED.
           IF INV-CHOICE = "X" AND NOT INVOICE-ON THEN
               PERFORM 94-NEW-PAGE
               WRITE PRINT-REC FROM NO-INVOICE AFTER ADVANCING 2 LINES
               GO TO 6-MAIN-X.

      *--------------  IF INVOICELESS OPTION SELECTED, CHECK
      *--------------  WHETHER INVOICING IS BEING USED.
           IF INVLESS-PO-ONLY = "X" AND NOT INVOICE-ON THEN
               PERFORM 94-NEW-PAGE
               WRITE PRINT-REC FROM NO-INVOICE AFTER ADVANCING 2 LINES
               GO TO 6-MAIN-X.

      *---------------  BUILD THE VENDOR FILE
           SORT SVENDOR-FILE
               ON ASCENDING KEY SVENDOR-CODE
           INPUT PROCEDURE IS 7-BUILD-SVENDOR
           GIVING VENDOR-MST-FILE.

           IF VENDOR-CODE-OPTION NOT = SPACES
               IF NOT VENDOR-WRITTEN
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM NO-VENDORS
                        AFTER ADVANCING 2 LINES
                   GO TO 6-MAIN-X.

           IF POSTAL-CODE-OPTION NOT = SPACES
               IF NOT POSTAL-WRITTEN
                   PERFORM 94-NEW-PAGE
                   WRITE PRINT-REC FROM NO-POSTAL-CODES
                        AFTER ADVANCING 2 LINES
                   GO TO 6-MAIN-X.

      *-------------  BUILD THE PURCHASING FILE
           SORT SPO-FILE
               ON ASCENDING KEY SPO-VENDOR-CODE
                                SPO-PO-NUMBER
           INPUT PROCEDURE  IS 8-INPUT-PROC
           GIVING PO-MST-FILE.

           IF TOP-VENDOR-OPTION NOT = SPACES
               SORT SVENDOR-FILE
                   ON DESCENDING KEY SVENDOR-AMOUNT
               USING  VENDOR-MST-FILE
               GIVING VENDOR-MST-FILE.


      *-----------  OUTPUT PROCEDURE
           PERFORM 9-OUTPUT-PROC THRU 99-EXIT.

       6-MAIN-X.
           EXIT.

       COPY OVRPFCALL IN COPYLIB.

       7-BUILD-SVENDOR SECTION.
           IF VENDOR-CODE-OPTION NOT = SPACES
               PERFORM 710-BUILD-SVENDOR-VENDOR THRU 710-BSV-X
           ELSE
           IF POSTAL-CODE-OPTION NOT = SPACES
               PERFORM 711-BUILD-SVENDOR-POSTAL THRU 711-BSP-X
           ELSE
               PERFORM 712-BUILD-SVENDOR THRU 712-BS-X.

           GO TO 7-BD-X.

       710-BUILD-SVENDOR-VENDOR.
           MOVE 1   TO INDX.

       7101-READ-VENDOR-CHOICE.
           IF VENDOR-CHOICE (INDX) = SPACES
               GO TO 710-BSV-X
           ELSE
               MOVE VENDOR-CHOICE (INDX) TO VENDOR-ARG.
           MOVE VENDOR-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   IF INDX < 12
                       ADD 1 TO INDX
                       GO TO 7101-READ-VENDOR-CHOICE
                   ELSE
                       GO TO 710-BSV-X
               ELSE
                   MOVE "DBFIND DVENDOR ERROR IN 7101"
                       TO BU-DISPLAY-MSG
                   MOVE VENDOR-ARG    TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

           MOVE VENDOR-CHOICE (INDX) TO SVENDOR-CODE.
           MOVE "Y"                  TO VENDOR-IND.
           RELEASE SVENDOR-REC.
           IF INDX < 12
               ADD 1 TO INDX
               GO TO 7101-READ-VENDOR-CHOICE
           ELSE
               GO TO 710-BSV-X.


       710-BSV-X.
           EXIT.

       711-BUILD-SVENDOR-POSTAL.
           READ DVENDOR-I FIRST RECORD INTO BUF-DVENDOR.
           IF FILE-STATUS NOT = "00"
               GO TO 711-BSP-X.

       7110-READ-POSTAL-CHOICE.
           IF VEN-ITM-NO = "07"
               IF VEN-ZIP NOT = SPACES
                   IF VEN-ZIP = POSTAL-CHOICE (1) OR
                              = POSTAL-CHOICE (2) OR
                              = POSTAL-CHOICE (3) OR
                              = POSTAL-CHOICE (4) OR
                              = POSTAL-CHOICE (5) OR
                              = POSTAL-CHOICE (6) OR
                              = POSTAL-CHOICE (7) OR
                              = POSTAL-CHOICE (8) OR
                              = POSTAL-CHOICE (9) OR
                              = POSTAL-CHOICE (10) OR
                              = POSTAL-CHOICE (11) OR
                              = POSTAL-CHOICE (12)
                       MOVE VEN-VEN-CODE TO SVENDOR-CODE
                       MOVE "Y"          TO POSTAL-IND
                       RELEASE SVENDOR-REC.

           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 711-BSP-X
               ELSE
                   MOVE "DBGET DVENDOR ERROR IN 7110"
                       TO BU-DISPLAY-MSG
                    PERFORM 2-BLOWUP.

           GO TO 7110-READ-POSTAL-CHOICE.

       711-BSP-X.
           EXIT.

       712-BUILD-SVENDOR.
           READ VENDCODE-I FIRST RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO 712-BS-X.

       7120-READ-VENDCODE.
           MOVE KVENCDE       TO SVENDOR-CODE.
           RELEASE SVENDOR-REC.

           READ VENDCODE-I NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 712-BS-X
               ELSE
                   MOVE "DBGET VENCODE ERROR IN 7120"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

           GO TO 7120-READ-VENDCODE.
       712-BS-X.
           EXIT.

       7-BD-X.
           EXIT.

       8-INPUT-PROC SECTION.

       81-OPEN-VENDOR-MST-FILE.
           OPEN I-O VENDOR-MST-FILE.
           READ VENDOR-MST-FILE AT END
               GO TO 89-EXIT.

           IF PO-CHOICE = "X"
               PERFORM 82-BUILD-BY-PO UNTIL
                       ALL-VENDOR-RECORDS-PROCESSED
           ELSE
               PERFORM 82-BUILD-BY-INVOICE UNTIL
                       ALL-VENDOR-RECORDS-PROCESSED.

           CLOSE VENDOR-MST-FILE.
           GO TO 89-EXIT.

       82-BUILD-BY-PO.
           PERFORM 83-FIND-DPORECD      THRU 83-FD-X
           PERFORM 84-FIND-HIST-DPORECD THRU 84-FHD-X.
           PERFORM 8X-READ-VENDOR.

       82-BUILD-BY-INVOICE.
           PERFORM 85-FIND-DINVRCD      THRU 85-FD-X.
           PERFORM 86-FIND-HIST-DINVRCD THRU 86-FHD-X.
           PERFORM 8X-READ-VENDOR.

       8X-READ-VENDOR.
           IF TOP-VENDOR-OPTION NOT = SPACES
               MOVE TOTAL-VEN-COMMIT TO VENDOR-AMOUNT
               REWRITE VENDOR-REC
               MOVE  0               TO TOTAL-VEN-COMMIT.

           READ VENDOR-MST-FILE AT END
               MOVE "Y" TO EOF-VEN.

       83-FIND-DPORECD.
           MOVE VENDOR-CODE TO VENDOR-ARG.
           MOVE VENDOR-ARG  TO VENCDE OF DPORECD-REC-I.
           START DPORECD-I KEY = VENCDE OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 83-FD-X
               ELSE
                   MOVE "DBFIND DPORECD ERROR IN 83-FD"
                       TO BU-DISPLAY-MSG
                   MOVE VENDOR-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       831-READ-DPORECD.
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 83-FD-X
               ELSE
                   MOVE "DBGET DPORECD ERROR IN 831-RD"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF VENCDE OF DPORECD-REC-I NOT = VENDOR-ARG
               GO TO 83-FD-X.

           IF PO-RLS-NO = "999"
               GO TO 831-READ-DPORECD.

           IF INVLESS-PO-ONLY = "X"
               IF PO-INVOICELESS-IND = " " OR PO-INVOICELESS-IND = "N"
                   GO TO 831-READ-DPORECD.

           IF YEAR-TO-DATE = "X"
               IF PO-DATE-YY = CURR-DATE-YY
                   GO TO 833-CHECK-ITEMS
               ELSE
               GO TO 831-READ-DPORECD.

           IF  (PO-DATE-CN < CY-TO-DATE OR PO-DATE-CN = CY-TO-DATE)
           AND (PO-DATE-CN > CY-FROM-DATE OR PO-DATE-CN = CY-FROM-DATE)
               GO TO 833-CHECK-ITEMS.

           GO TO 831-READ-DPORECD.


       833-CHECK-ITEMS.
           MOVE PO-RCV-NO TO PO-ARG.
           MOVE PO-ARG    TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 831-READ-DPORECD
               ELSE
                   MOVE "DBFIND DPOITEM ERROR IN 833-CI"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       834-READ-ITEMS.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE VENDOR-CODE     TO SPO-VENDOR-CODE
                   MOVE PO-RCV-NO       TO PO-STRIP
                   MOVE PO-OUT          TO SPO-PO-NUMBER
                   MOVE PO-DATE         TO SPO-PO-DATE
                   MOVE TOTAL-PO-COMMIT TO SPO-AMOUNT
                   RELEASE SPO-REC
                   ADD TOTAL-PO-COMMIT  TO TOTAL-VEN-COMMIT
                   MOVE 0               TO TOTAL-PO-COMMIT
                   GO TO 831-READ-DPORECD
               ELSE
                   MOVE "DBGET DPOITEM ERROR IN 834-RI"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE VENDOR-CODE     TO SPO-VENDOR-CODE
               MOVE PO-RCV-NO       TO PO-STRIP
               MOVE PO-OUT          TO SPO-PO-NUMBER
               MOVE PO-DATE         TO SPO-PO-DATE
               MOVE TOTAL-PO-COMMIT TO SPO-AMOUNT
               RELEASE SPO-REC
               ADD TOTAL-PO-COMMIT  TO TOTAL-VEN-COMMIT
               MOVE 0               TO TOTAL-PO-COMMIT
               GO TO 831-READ-DPORECD.

           COMPUTE COMMITTED = ITM-QTY-ORD * ITM-UNIT-PRICE.
           ADD COMMITTED TO TOTAL-PO-COMMIT.

           GO TO 834-READ-ITEMS.

       83-FD-X.
           EXIT.

       84-FIND-HIST-DPORECD.
           MOVE VENDOR-CODE TO VENDOR-ARG.
           MOVE VENDOR-ARG  TO VENCDE OF DPORECDH-REC-I.
           START DPORECDH-I KEY = VENCDE OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 84-FHD-X
               ELSE
                   MOVE "DBFIND DPORECD-H ERROR IN 84-FHD"
                       TO BU-DISPLAY-MSG
                   MOVE VENDOR-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       841-READ-DPORECD.
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 84-FHD-X
               ELSE
                   MOVE "DBGET DPORECD-H ERROR IN 841-RD"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF VENCDE OF DPORECDH-REC-I NOT = VENDOR-ARG
               GO TO 84-FHD-X.

           IF POH-RLS-NO = "999"
               GO TO 841-READ-DPORECD.

           IF INVLESS-PO-ONLY = "X"
               IF POH-INVOICELESS-INDIC = " " OR
                  POH-INVOICELESS-INDIC = "N"
                   GO TO 841-READ-DPORECD.

           MOVE POH-DATE TO POH-REALIGN-DATE-CN.

           IF YEAR-TO-DATE = "X"
               IF POH-DATE-YY = CURR-DATE-YY
                   GO TO 843-CHECK-ITEMS
               ELSE
               GO TO 841-READ-DPORECD.

      *    IF (POH-COMPARE-DATE-CN < CY-TO-DATE OR
      *        POH-COMPARE-DATE-CN = CY-TO-DATE) AND
      *       (POH-COMPARE-DATE-CN > CY-FROM-DATE OR
      *        POH-COMPARE-DATE-CN = CY-FROM-DATE)
           IF POH-COMPARE-DATE-CN NOT LESS THAN CY-FROM-DATE
               IF POH-COMPARE-DATE-CN NOT GREATER THAN CY-TO-DATE
                   GO TO 843-CHECK-ITEMS.

           GO TO 841-READ-DPORECD.

       843-CHECK-ITEMS.
           MOVE POH-RCV-NO TO PO-ARG.
           MOVE PO-ARG     TO PORCVNO OF DPOITEMH-REC-I.
           START DPOITEMH-I KEY = PORCVNO OF DPOITEMH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 841-READ-DPORECD
               ELSE
                   MOVE "DBFIND DPOITEM-H ERROR IN 843-CI"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       844-READ-ITEMS.
           READ DPOITEMH-I NEXT INTO BUF-DPOITEM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE VENDOR-CODE          TO SPO-VENDOR-CODE
                   MOVE POH-RCV-NO           TO SPO-PO-NUMBER
                   MOVE POH-COMPARE-DATE-YMD TO SPO-PO-DATE
                   MOVE TOTAL-PO-COMMIT      TO SPO-AMOUNT
                   RELEASE SPO-REC
                   ADD TOTAL-PO-COMMIT       TO TOTAL-VEN-COMMIT
                   MOVE 0                    TO TOTAL-PO-COMMIT
                   GO TO 841-READ-DPORECD
               ELSE
                   MOVE "DBGET DPOITEM-H ERROR IN 844-RI"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF PORCVNO OF DPOITEMH-REC-I NOT = PO-ARG
               MOVE VENDOR-CODE              TO SPO-VENDOR-CODE
               MOVE POH-RCV-NO               TO SPO-PO-NUMBER
               MOVE POH-COMPARE-DATE-YMD     TO SPO-PO-DATE
               MOVE TOTAL-PO-COMMIT          TO SPO-AMOUNT
               RELEASE SPO-REC
               ADD TOTAL-PO-COMMIT           TO TOTAL-VEN-COMMIT
               MOVE 0                        TO TOTAL-PO-COMMIT
               GO TO 841-READ-DPORECD.

           COMPUTE COMMITTED = ITMH-QTY-ORD * ITMH-UNIT-PRICE.
           ADD COMMITTED TO TOTAL-PO-COMMIT.

           GO TO 844-READ-ITEMS.

       84-FHD-X.
           EXIT.

       85-FIND-DINVRCD.
           MOVE VENDOR-CODE TO VENDOR-ARG.
           MOVE VENDOR-ARG  TO VENCDE OF DPORECD-REC-I.
           START DPORECD-I KEY = VENCDE OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 85-FD-X
               ELSE
                   MOVE "DBFIND DPORECD ERROR IN 85-FD"
                       TO BU-DISPLAY-MSG
                   MOVE VENDOR-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       851-READ-DPORECD.
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 85-FD-X
               ELSE
                   MOVE "DBGET DPORECD ERROR IN 851-RD"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF VENCDE OF DPORECD-REC-I NOT = VENDOR-ARG
               GO TO 85-FD-X.

           IF PO-RLS-NO = "999"
               GO TO 851-READ-DPORECD.

           IF INVLESS-PO-ONLY = "X"
               IF PO-INVOICELESS-IND = " " OR PO-INVOICELESS-IND = "N"
                   GO TO 851-READ-DPORECD.

      *-------- SKIP CHECK ON PO DATE IF CHOOSING INVOICE DATE OPTION.
           IF INV-DATE-OPT = "X"
               GO TO 853-CHECK-ITEMS.

           IF YEAR-TO-DATE = "X"
               IF PO-DATE-YY = CURR-DATE-YY
                   GO TO 853-CHECK-ITEMS
               ELSE
               GO TO 851-READ-DPORECD.

           IF  (PO-DATE-CN < CY-TO-DATE OR PO-DATE-CN = CY-TO-DATE)
           AND (PO-DATE-CN > CY-FROM-DATE OR PO-DATE-CN = CY-FROM-DATE)
               GO TO 853-CHECK-ITEMS.

           GO TO 851-READ-DPORECD.

       853-CHECK-ITEMS.
           MOVE PO-RCV-NO TO PO-ARG.
           MOVE PO-ARG    TO PORCVNO OF DINVRCD-REC-I.
           START DINVRCD-I KEY = PORCVNO OF DINVRCD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 851-READ-DPORECD
               ELSE
                   MOVE "DBFIND DINVRCD ERROR IN 853-CI"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       854-READ-ITEMS.
           READ DINVRCD-I NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE VENDOR-CODE     TO SPO-VENDOR-CODE
                   MOVE PO-RCV-NO       TO PO-STRIP
                   MOVE PO-OUT          TO SPO-PO-NUMBER
                   MOVE PO-DATE         TO SPO-PO-DATE
                   MOVE TOTAL-PO-COMMIT TO SPO-AMOUNT
                   IF TOTAL-PO-COMMIT NOT = 0
                       RELEASE SPO-REC
                   END-IF
                   ADD TOTAL-PO-COMMIT  TO TOTAL-VEN-COMMIT
                   MOVE 0               TO TOTAL-PO-COMMIT
                   GO TO 851-READ-DPORECD
               ELSE
                   MOVE "DBGET DINVRCD ERROR IN 854-RI"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF PORCVNO OF DINVRCD-REC-I NOT = PO-ARG
               MOVE VENDOR-CODE     TO SPO-VENDOR-CODE
               MOVE PO-RCV-NO       TO PO-STRIP
               MOVE PO-OUT          TO SPO-PO-NUMBER
               MOVE PO-DATE         TO SPO-PO-DATE
               MOVE TOTAL-PO-COMMIT TO SPO-AMOUNT
               IF TOTAL-PO-COMMIT NOT = 0
                   RELEASE SPO-REC
               END-IF
               ADD TOTAL-PO-COMMIT  TO TOTAL-VEN-COMMIT
               MOVE 0               TO TOTAL-PO-COMMIT
               GO TO 851-READ-DPORECD.

      *------ IF SELECTING ON INVOICE DATE, CHECK INVOICE DATE.
           IF INV-DATE-OPT = "X"
               IF YEAR-TO-DATE = "X"
                 IF INV-DATE-YY = CURR-DATE-YY
                     NEXT SENTENCE
                 ELSE
                     GO TO 854-READ-ITEMS
                 END-IF
               ELSE
                   IF  (INV-DATE-CN < CY-TO-DATE OR
                        INV-DATE-CN = CY-TO-DATE)
                   AND (INV-DATE-CN > CY-FROM-DATE OR
                        INV-DATE-CN = CY-FROM-DATE)
                       NEXT SENTENCE
                   ELSE
                       GO TO 854-READ-ITEMS.

           ADD INV-NET-DUE-VENDOR TO TOTAL-PO-COMMIT.

           GO TO 854-READ-ITEMS.

       85-FD-X.
           EXIT.

       86-FIND-HIST-DINVRCD.
           MOVE VENDOR-CODE TO VENDOR-ARG.
           MOVE VENDOR-ARG  TO VENCDE OF DPORECDH-REC-I.
           START DPORECDH-I KEY = VENCDE OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 86-FHD-X
               ELSE
                   MOVE "DBFIND DPORECD-H ERROR IN 86-FHD"
                       TO BU-DISPLAY-MSG
                   MOVE VENDOR-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       861-READ-DPORECD.
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 86-FHD-X
               ELSE
                   MOVE "DBGET DPORECD-H ERROR IN 861-RD"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF VENCDE OF DPORECDH-REC-I NOT = VENDOR-ARG
               GO TO 86-FHD-X.

           IF POH-RLS-NO = "999"
               GO TO 861-READ-DPORECD.

           IF INVLESS-PO-ONLY = "X"
               IF POH-INVOICELESS-INDIC = " " OR
                  POH-INVOICELESS-INDIC = "N"
                   GO TO 861-READ-DPORECD.

           MOVE POH-DATE TO POH-REALIGN-DATE-CN.

           IF INV-DATE-OPT = "X"
               GO TO 863-CHECK-ITEMS.

           IF YEAR-TO-DATE = "X"
               IF POH-DATE-YY = CURR-DATE-YY
                   GO TO 863-CHECK-ITEMS
               ELSE
               GO TO 861-READ-DPORECD.

      *    IF (POH-COMPARE-DATE-CN < CY-TO-DATE OR
      *        POH-COMPARE-DATE-CN = CY-TO-DATE) AND
      *       (POH-COMPARE-DATE-CN > CY-FROM-DATE OR
      *        POH-COMPARE-DATE-CN = CY-FROM-DATE)
           IF POH-COMPARE-DATE-CN NOT LESS THAN CY-FROM-DATE
               IF POH-COMPARE-DATE-CN NOT GREATER THAN CY-TO-DATE
                   GO TO 863-CHECK-ITEMS.

           GO TO 861-READ-DPORECD.


       863-CHECK-ITEMS.
           MOVE POH-RCV-NO TO PO-ARG.
           MOVE PO-ARG    TO PORCVNO OF DINVRCDH-REC-I.
           START DINVRCDH-I KEY = PORCVNO OF DINVRCDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 861-READ-DPORECD
               ELSE
                   MOVE "DBFIND DINVRCD-H ERROR IN 863-CI"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       864-READ-ITEMS.
           READ DINVRCDH-I NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE VENDOR-CODE          TO SPO-VENDOR-CODE
                   MOVE POH-RCV-NO           TO SPO-PO-NUMBER
                   MOVE POH-COMPARE-DATE-YMD TO SPO-PO-DATE
                   MOVE TOTAL-PO-COMMIT      TO SPO-AMOUNT
                   IF TOTAL-PO-COMMIT NOT = 0
                       RELEASE SPO-REC
                   END-IF
                   ADD TOTAL-PO-COMMIT       TO TOTAL-VEN-COMMIT
                   MOVE 0                    TO TOTAL-PO-COMMIT
                   GO TO 861-READ-DPORECD
               ELSE
                   MOVE "DBGET DINVRCD-H ERROR IN 864-RI"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.
           IF PORCVNO OF DINVRCDH-REC-I NOT = PO-ARG
               MOVE VENDOR-CODE              TO SPO-VENDOR-CODE
               MOVE POH-RCV-NO               TO SPO-PO-NUMBER
               MOVE POH-COMPARE-DATE-YMD     TO SPO-PO-DATE
               MOVE TOTAL-PO-COMMIT          TO SPO-AMOUNT
               IF TOTAL-PO-COMMIT NOT = 0
                   RELEASE SPO-REC
               END-IF
               ADD TOTAL-PO-COMMIT           TO TOTAL-VEN-COMMIT
               MOVE 0                        TO TOTAL-PO-COMMIT
               GO TO 861-READ-DPORECD.


           IF INV-DATE-OPT = "X"
               MOVE INVH-DATE TO INVH-REALIGN-DATE-CN
               IF YEAR-TO-DATE = "X"
                   IF INVH-DATE-YY = CURR-DATE-YY
                       NEXT SENTENCE
                   ELSE
                       GO TO 864-READ-ITEMS
                   END-IF
               ELSE
                   IF INVH-COMPARE-DATE-CN NOT LESS THAN
                                              CY-FROM-DATE
                   AND INVH-COMPARE-DATE-CN NOT GREATER THAN
                                              CY-TO-DATE
                       NEXT SENTENCE
                   ELSE
                       GO TO 864-READ-ITEMS
                   END-IF
               END-IF.

           ADD INVH-NET-DUE-VENDOR TO TOTAL-PO-COMMIT.

           GO TO 864-READ-ITEMS.

       86-FHD-X.
           EXIT.


       89-EXIT.
           EXIT.

       9-OUTPUT SECTION.

       9-OUTPUT-PROC.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
           PERFORM 94-NEW-PAGE.
           MOVE 0 TO TOTAL-VEN-COMMIT.

           OPEN INPUT PO-MST-FILE.

           READ PO-MST-FILE AT END
               MOVE "Y"               TO EOF-PO
               WRITE PRINT-REC FROM NO-DATA AFTER ADVANCING 2 LINES
               GO TO 99-EXIT.

           IF TOP-VENDOR-OPTION NOT = SPACES
               MOVE "N" TO EOF-VEN
               PERFORM 92-PROCESS-VENDOR-RECORDS THRU 92-PVR-EXIT
               GO TO 99-EXIT.

           MOVE PO-VENDOR-CODE TO SAVE-VENDOR-CODE.

           PERFORM 91-PROCESS-SORTED-RECORDS
               UNTIL ALL-PO-RECORDS-PROCESSED.
           GO TO 99-EXIT.

       91-PROCESS-SORTED-RECORDS.
           MOVE SPACES                TO LINE1.
           IF NOT SAME-VENDOR
               PERFORM 911-FIND-VENDOR-NAME  THRU 911-FVN-X
               MOVE PO-VENDOR-CODE    TO LINE1-VENDOR-CODE.
           MOVE PO-PO-NUMBER          TO LINE1-PO-NUMBER.
           MOVE PO-PO-DATE            TO DATE-EDIT.
           MOVE DE-YY                 TO DO-YY.
           MOVE DE-MM                 TO DO-MM.
           MOVE DE-DD                 TO DO-DD.
           MOVE DATE-FORMATTED        TO LINE1-DATE.
           MOVE PO-AMOUNT             TO LINE1-AMOUNT.
           ADD  PO-AMOUNT             TO TOTAL-VEN-COMMIT.
           IF DETAIL-RPT > " "
               WRITE PRINT-REC FROM LINE1 AFTER ADVANCING 1 LINES
               ADD   1  TO LINE-CTR.
           READ PO-MST-FILE AT END
               MOVE HIGH-VALUES       TO PO-VENDOR-CODE
               MOVE "Y"               TO EOF-PO.
           IF PO-VENDOR-CODE = SAVE-VENDOR-CODE
               MOVE "Y"               TO SAME-VEN-IND
           ELSE
               MOVE "N"               TO SAME-VEN-IND
               MOVE SPACES            TO LINE2
               MOVE "TOTAL FOR VENDOR : "
                                      TO LINE2-TOTAL-VERBAGE
               MOVE SAVE-VENDOR-CODE  TO LINE2-VENDOR-CODE
               MOVE SAVE-VENDOR-NAME  TO LINE2-VENDOR-NAME
               MOVE TOTAL-VEN-COMMIT  TO LINE2-AMOUNT
               MOVE 0                 TO TOTAL-VEN-COMMIT
               MOVE PO-VENDOR-CODE    TO SAVE-VENDOR-CODE
               WRITE PRINT-REC FROM LINE2 AFTER ADVANCING 2 LINES
               MOVE SPACES            TO LINE2
               WRITE PRINT-REC FROM LINE2 AFTER ADVANCING 1 LINES
               ADD   3  TO LINE-CTR.

           IF LINE-CTR > 50 AND NOT ALL-PO-RECORDS-PROCESSED
               PERFORM 94-NEW-PAGE.

       911-FIND-VENDOR-NAME.
           MOVE PO-VENDOR-CODE TO VENCDE   OF DVENDOR-REC-I.
           MOVE "00"           TO VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE "**NO VENDOR NAME ON FILE**"
                               TO SAVE-VENDOR-NAME,
                                  LINE1-VENDOR-NAME
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ DVENDOR ERROR IN 911-FVN"
                       TO BU-DISPLAY-MSG
               MOVE VENDOR-ARG    TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE VEN-NAME                TO SAVE-VENDOR-NAME,
                                           LINE1-VENDOR-NAME.

       911-FVN-X.
           EXIT.

       92-PROCESS-VENDOR-RECORDS.
           OPEN INPUT VENDOR-MST-FILE.
           READ VENDOR-MST-FILE AT END
               MOVE "Y" TO EOF-VEN.
           MOVE VENDOR-CODE TO SAVE-VENDOR-CODE.
           IF ALL-VENDOR-RECORDS-PROCESSED
               GO TO 92-PVR-EXIT
           ELSE
               GO TO 92-SEQ-READ.


       92-READ-VEN-MST-FILE.
           READ VENDOR-MST-FILE AT END
               MOVE "Y" TO EOF-VEN.
           MOVE VENDOR-CODE TO SAVE-VENDOR-CODE.

       92-SEQ-READ.
           IF PO-VENDOR-CODE = VENDOR-CODE AND LINE-CTR > 50
                PERFORM 94-NEW-PAGE.
           IF PO-VENDOR-CODE = VENDOR-CODE
                ADD 1 TO VENDOR-CTR
                PERFORM 91-PROCESS-SORTED-RECORDS UNTIL
                    VENDOR-CODE NOT = PO-VENDOR-CODE
                IF TOP-VENDOR-OPTION = "999"
                    PERFORM 92-READ-VEN-MST-FILE
                    IF ALL-VENDOR-RECORDS-PROCESSED
                        GO TO 92-PVR-EXIT
                    ELSE
                        CLOSE PO-MST-FILE
                        OPEN INPUT PO-MST-FILE
                ELSE
                    IF VENDOR-CTR < TOP-VENDOR-OPTION
                        PERFORM 92-READ-VEN-MST-FILE
                        IF ALL-VENDOR-RECORDS-PROCESSED
                            GO TO 92-PVR-EXIT
                        ELSE
                            CLOSE PO-MST-FILE
                            OPEN INPUT PO-MST-FILE
                    ELSE
                        GO TO 92-PVR-EXIT.


           READ PO-MST-FILE AT END
               GO TO 921-RESET-PO-MST-FILE.

           IF PO-VENDOR-CODE > VENDOR-CODE
               PERFORM 92-READ-VEN-MST-FILE
                IF ALL-VENDOR-RECORDS-PROCESSED
                    GO TO 92-PVR-EXIT.

           GO TO 92-SEQ-READ.

       921-RESET-PO-MST-FILE.
           CLOSE PO-MST-FILE.
           OPEN INPUT PO-MST-FILE.
           READ PO-MST-FILE AT END
               GO TO 92-PVR-EXIT.
           PERFORM 92-READ-VEN-MST-FILE.
           IF ALL-VENDOR-RECORDS-PROCESSED
               GO TO 92-PVR-EXIT
           ELSE
               GO TO 92-SEQ-READ.

       92-PVR-EXIT.
           EXIT.


       94-NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           ADD 1                      TO PAGE-NUM.
           MOVE "G O O D Y E A R   C O R P O R A T E   "
                                      TO HEAD1-TITLE1.
           MOVE " I N F O R M A T I O N   S Y S T E M"
                                      TO HEAD1-TITLE2.
           MOVE "PLANT "              TO HEAD1-PLANT.
           MOVE PLANT-NUMBER          TO HEAD1-PLANT-OUT.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING NEW-PAGE.
           MOVE SPACES                TO PRINT-LINE.
           MOVE 1                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO HEAD2-TIME.
           MOVE DATE-SLASH-OUT        TO HEAD2-DATE.
           MOVE "PAGE: "              TO HEAD2-PAGE.
           MOVE PAGE-NUM              TO HEAD2-PAGE-NO.
           MOVE "          T O T A L   V E N D "  TO HEAD2-TITLE1.
           MOVE "O R   C O M M I T M E N T                "
                                                 TO HEAD2-TITLE2.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM REPORT1    AFTER ADVANCING 1 LINES.
           IF R2-CODES NOT = SPACES
               WRITE PRINT-REC FROM REPORT2 AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM REPORT3    AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES                 TO PRINT-LINE.
           MOVE "VENDOR CODE"          TO HEAD4-CODE.
           MOVE "VENDOR NAME"          TO HEAD4-NAME.
           MOVE "PURCHASE ORDER"       TO HEAD4-PO.
           MOVE "DATE"                 TO HEAD4-DATE.
           MOVE "AMOUNT"               TO HEAD4-AMOUNT.
           IF DETAIL-RPT > " "
               WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 2 LINES.
           MOVE SPACES                 TO PRINT-LINE.
           WRITE PRINT-REC FROM PRINT-LINE AFTER ADVANCING 1 LINES.

           MOVE  11                    TO LINE-CTR.

       99-EXIT.
           EXIT.
