000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TCOMPRCV.
000400 AUTHOR.               K MOVSESIAN.
000500 DATE-WRITTEN.         SEPT. 28, 1987.
000600 INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
001000**************************************************************
001100*                                                            *
001200*   T C O M P R C V   THIS IS AN INITIAL LOAD AND            *
001300*    DIAGNOSTIC PROGRAM FOR THE CORPORATE STORES ACCOUNTING  *
001400*    SYSTEM.  THIS PROGRAM COMPARES OPEN RECEIVERS IN THE    *
001500*    STORES DATA BASE WITH OPEN RECEIVERS IN THE CSAS DATA   *
001600*    BASE AND PRODUCES A REPORT.  THIS PROGRAM WILL ALSO     *
001700*    LOAD THE CSAS DATA BASE TO MATCH THE OPEN RECEIVERS     *
001800*    IN THE CSIS DATA BASE.  IT CAN BE RUN IN REPORT MODE    *
001900*    OR UPDATE MODE AS WELL AS INITIAL LOAD MODE. IF THE     *
002000*    PROGRAM IS RUN IN INITIAL LOAD MODE, NO ACCOUNTING      *
002100*    ADJUSTMENTS ARE MADE.                                   *
002200*                                                            *
002300**************************************************************
002400*C   09/16/1992       DAVE PLUM      REQUEST #6256
002500*C   CHANGED ALL REFERENCES TO THE MCLASS DATASET FROM THE
002600*C   CSACCT DB TO THE STORES DB.
002700*C
002800*C   05OCT1994        DAVE PLUM      REQUEST #6533
002900*C   RECOMPILED TO PICK UP A NEW FIELD IN MCLASS.
003000*C
003000*C   12MAY1995        CATHY ZUBEK
003000*C   MODIFIED THIS HP PROGRAM FOR THE AS/400 FOR CARTERSVILLE.
003000*C
      *C   13SEP1996        DAVE PLUM
      *C     REVISED FOR CENTURY DATABASE CHANGES.
      *C
003100*C*************************************************************
003200 ENVIRONMENT DIVISION.
003300 CONFIGURATION SECTION.
003400 SOURCE-COMPUTER.      HP-3000.
003500 OBJECT-COMPUTER.      HP-3000.
003600 SPECIAL-NAMES.        C01 IS NEW-PAGE.
003700
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
           SELECT DTRANS-O
              ASSIGN TO DATABASE-MCFLCA0703
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
              ASSIGN TO DATABASE-MCFLCS0201
              ORGANIZATION IS INDEXED
                ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
               ASSIGN TO DATABASE-MCFLCS1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MACTINFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

            SELECT MATLACUM-O
                   ASSIGN TO DATABASE-MCFLCA0601
                   ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

           SELECT MCHTACCTS-I
                  ASSIGN TO DATABASE-MCFLCA0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

004000     SELECT ONLINE-PRT   ASSIGN TO PRINTER-MCPRT.
004100     SELECT SORT-FILE    ASSIGN TO DISK-SORT.
004200
004300 DATA DIVISION.
004400
004500 FILE SECTION.

       FD  DTRANS-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-O.
           COPY DDS-MCRPCA0700  OF MCFLCA0703.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1001.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MACTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       FD  MATLACUM-O
           LABEL RECORDS ARE STANDARD.
       01  MATLACUM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0601.

       FD  MCHTACCTS-I
           LABEL RECORDS ARE STANDARD.
       01  MCHTACCTS-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

004700 FD  ONLINE-PRT
004800     DATA RECORD IS PRT-REC
004900     RECORD CONTAINS 133 CHARACTERS
005000     LABEL RECORDS ARE OMITTED.
005100 01  PRT-REC                       PIC X(133).
005200
005300 SD  SORT-FILE
005400     DATA RECORD IS SORT-REC
005500     RECORD CONTAINS 75  CHARACTERS.
005600 01  SORT-REC.
005700     05  SORT-STORES-CODE         PIC X(8).
005800     05  SORT-PO-NUM              PIC X(10).
005900     05  SORT-ITEM-NUM            PIC X(4).
006000     05  SORT-RCVR-NUM            PIC X(4).
006100     05  SORT-BALANCE-QTY         PIC S9(10).
006200     05  SORT-UNIT-PRICE          PIC S9(12)V9(4).
006300     05  SORT-UM                  PIC X(2).
006400     05  SORT-TYPE                PIC X(4).
006500     05  SORT-DATA-BASE-INDIC     PIC X(4).
006600     05  SORT-CLASS               PIC X(3).
006700     05  SORT-DEPT                PIC X(4).
006800     05  SORT-ACCOUNT             PIC X(6).
006900
007000 WORKING-STORAGE SECTION.
007100 77  NO-MORE-SORT                 PIC XXX       VALUE SPACES.
007200 77  LINE-CNT                     PIC 99        VALUE 0.
007300 77  PAGE-CNT                     PIC 9(4)      VALUE 0.
007400 77  SAVE-STR-DEPT                PIC X(4)      VALUE SPACES.
007500 77  SAVE-PO-NUM                  PIC X(10)  VALUE SPACES.
007600 77  SAVE-ITEM-NUM                PIC X(4)   VALUE SPACES.
007700 77  SAVE-CORP-CODE               PIC X(8)   VALUE SPACES.
007800 77  SAVE-CLASS                   PIC X(3)   VALUE SPACES.
007900 77  SAVE-DEPT                    PIC X(4)   VALUE SPACES.
008000 77  SAVE-TRANS-VALUE          PIC S9(12)V99 COMP VALUE ZEROS.
008100 77  SAVE-ACCOUNT                 PIC X(6)   VALUE SPACES.
008200 77  SAVE-UM                      PIC X(2)   VALUE SPACES.
008300 77  SAVE-UNIT-PRICE           PIC S9(12)V9(4) COMP VALUE ZEROS.
008400 77  CSIS-RECORD-FOUND            PIC X      VALUE SPACES.
008500 77  CSAS-RECORD-FOUND            PIC X      VALUE SPACES.
008600 77  CSIS-STR-OPEN-RCVR           PIC S9(10) COMP VALUE ZEROS.
008700 77  CSIS-DIR-OPEN-RCVR           PIC S9(10) COMP VALUE ZEROS.
008800 77  CSIS-STR-OPEN-INV            PIC S9(10) COMP VALUE ZEROS.
008900 77  CSIS-DIR-OPEN-INV            PIC S9(10) COMP VALUE ZEROS.
009000 77  CSIS-STR-OPEN-RCVR-VALUE     PIC S9(12)V99 COMP VALUE ZEROS.
009100 77  CSIS-STR-OPEN-INV-VALUE      PIC S9(12)V99 COMP VALUE ZEROS.
009200 77  CSAS-STR-OPEN-RCVR           PIC S9(10) COMP VALUE ZEROS.
009300 77  CSAS-DIR-OPEN-RCVR           PIC S9(10) COMP VALUE ZEROS.
009400 77  CSAS-STR-OPEN-INV            PIC S9(10) COMP VALUE ZEROS.
009500 77  CSAS-DIR-OPEN-INV            PIC S9(10) COMP VALUE ZEROS.
009600 77  CSAS-STR-OPEN-RCVR-VALUE     PIC S9(12)V99 COMP VALUE ZEROS.
009700 77  CSAS-STR-OPEN-INV-VALUE      PIC S9(12)V99 COMP VALUE ZEROS.
009800 77  CSAS-SAVE-CLASS              PIC X(3)  VALUE SPACES.
009900 77  CSIS-SAVE-CLASS              PIC X(3)  VALUE SPACES.
010000 77  CLASS-ERR-SW                 PIC X(1)  VALUE SPACES.
010100 77  DEPT-ERR-SW                  PIC X(1)  VALUE SPACES.
010200 77  UPDATE-RESPONSE              PIC X(3)  VALUE SPACES.
010300 77  INIT-LOAD-SW                 PIC X(3)  VALUE SPACES.
010400 77  RCD-CTR                      PIC S9(5) VALUE ZEROS.
010500 77  ADJUSTMENT-QTY               PIC S9(10) COMP VALUE ZEROS.
010600 77  ADJUSTMENT-VALUE             PIC S9(12)V99 COMP VALUE ZEROS.
010700
010800 01  SAVE-PO-NO.
010900     05  SAVE-PO-NO1-4            PIC X(4) VALUE SPACES.
011000     05  FILLER                   PIC X(3) VALUE SPACES.
011100
011200 01  SAVE-OV-PO-PREFIX.
011300     05  FILLER                   PIC X(1) VALUE SPACES.
011400     05  SAVE-OV-PO-PREFIX2-5     PIC X(4) VALUE SPACES.
011500
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X    VALUE "0".
           05  FILE-STATUS-2            PIC X    VALUE "0".

       01  EOF-SWITCHES.
           05  DPOITEM-EOF-SW           PIC X    VALUE "N".
           05  DTRANS-EOF-SW            PIC X    VALUE "N".

011600************************************************************
011700**     REPORT PRINT LINES                                 **
011800************************************************************
011900
012000 01  HEADER1.
012100     05  FILLER                     PIC X      VALUE SPACES.
012200     05  FILLER                     PIC X(19)
012300         VALUE "TCOMPRCV".
012400     05  FILLER                     PIC X(42)
012500         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
012600     05  FILLER                     PIC X(15)  VALUE SPACES.
012700     05  FILLER                     PIC X(5)   VALUE "DATE ".
012800     05  DATE-H1                    PIC X(8)   VALUE SPACES.
012900     05  FILLER                     PIC X(6)   VALUE SPACES.
013000
013100 01  HEADER2.
013200     05  FILLER                     PIC X      VALUE SPACES.
013300     05  FILLER                     PIC X(6)   VALUE "PAGE".
013400     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
013500     05  FILLER                     PIC X(06)  VALUE SPACES.
013600     05  FILLER                     PIC X(45)
013700         VALUE "CSIS/CSAS OPEN RECEIVER AND INVOICE COMPARE".
013800     05  FILLER                     PIC X(15)  VALUE SPACES.
013900     05  FILLER                     PIC X(5)   VALUE "TIME ".
014000     05  TIME-H2                    PIC X(8)   VALUE SPACES.
014100
014200
014300 01  HEADER4.
014400     05  FILLER                     PIC X(30)
014500         VALUE "CODE      PO NUMBER     ITEM  ".
014600     05  FILLER                     PIC X(38)
014700         VALUE "CLASS DEPT ACCOUNT  UM      CSIS UNITS".
014800     05  FILLER                     PIC X(10) VALUE SPACES.
014900     05  FILLER                     PIC X(28)
015000         VALUE "CSIS VALUE        CSAS UNITS".
015100     05  FILLER  PIC X(11) VALUE SPACES.
015200     05  FILLER  PIC X(10) VALUE "CSAS VALUE".
015300
015400
015500 01  DETAIL-LINE1.
015600     05  PRT-MATLCODE             PIC X(7)   VALUE SPACES.
015700     05  FILLER                   PIC X(3)  VALUE SPACES.
015800     05  PRT-PO-NUM               PIC X(10) VALUE SPACES.
015900     05  FILLER                   PIC X(4)  VALUE SPACES.
016000     05  PRT-ITEM-NUM             PIC ZZZ9  VALUE ZEROS.
016100     05  FILLER                   PIC X(3)  VALUE SPACES.
016200     05  PRT-CLASS                PIC X(3)  VALUE SPACES.
016300     05  FILLER                   PIC X(2)  VALUE SPACES.
016400     05  PRT-DEPT                 PIC X(4)  VALUE SPACES.
016500     05  FILLER                   PIC X(2)  VALUE SPACES.
016600     05  PRT-ACCOUNT              PIC X(6)  VALUE SPACES.
016700     05  FILLER                   PIC X(2)  VALUE SPACES.
016800     05  PRT-UM                   PIC XX     VALUE SPACES.
016900
017000 01  DETAIL-LINE2.
017100     05  FILLER  PIC X(10) VALUE SPACES.
017200     05  PRT-DETAIL-HEADER PIC X(40) VALUE SPACES.
017300     05  FILLER  PIC X(5)  VALUE SPACES.
017400     05  PRT-CSIS-QTY   PIC -,---,---,--9.
017500     05  FILLER                     PIC X(1)   VALUE SPACES.
017600     05  PRT-CSIS-VALUE PIC ---,---,---,--9.99.
017700     05  FILLER  PIC X(6)  VALUE SPACES.
017800     05  PRT-CSAS-QTY   PIC -,---,---,--9.
017900     05  FILLER                     PIC X(1)   VALUE SPACES.
018000     05  PRT-CSAS-VALUE PIC ---,---,---,--9.99.
018100
018200 01  INVALID-DEPT-MSG.
018300     05  FILLER  PIC X(10) VALUE SPACES.
018400     05  FILLER  PIC X(33)
018500             VALUE "*****  INVALID DEPARTMENT  ******".
018600
018700 01  INVALID-CLASS-MSG.
018800     05  FILLER  PIC X(10) VALUE SPACES.
018900     05  FILLER  PIC X(33)
019000             VALUE "*****  INVALID CLASS  *****".
019100
019200 01  LAST-LINE.
019300     05  FILLER  PIC X(10)  VALUE SPACES.
019400     05  RCD-CTR-OUT  PIC ZZZZ9  VALUE ZEROS.
019500     05  FILLER  PIC X(45)
019600         VALUE "  PO ITEM(S) FOUND IN ERROR FOR THIS REPORT".
019700
019800 COPY TDATECHK IN COPYLIB.
019900
020100************************************************************
020200**                                                        **
020300**           D A T A B A S E   B U F F E R S              **
020400**                                                        **
020500************************************************************
020600 COPY MPLT0 IN COPYLIB.
020700
020800 COPY MACTINFO IN COPYLIB.
020900
021000 COPY MATLACUM IN COPYLIB.
021100
021200 COPY DTRANS IN COPYLIB.
021300
021400 COPY DPOITEM IN COPYLIB.
021500
021600 COPY MSTORERM IN COPYLIB.
021700
021800 COPY MCLASS IN COPYLIB.
021900
022000 COPY MCHTACCT IN COPYLIB.
022100
022200 COPY DPORECD IN COPYLIB.
022300
022400**********************************************************
022500*              D A T A    B A S E                        *
022600**********************************************************
022700
022800 COPY DBCSACCT IN COPYLIB.
022900
023000 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
023100 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
023200
023300 COPY DBMODES IN COPYLIB.
023400
023500 COPY DBSTAT IN COPYLIB.
023600
023800 01  DATASET-NAMES.
023900     05  DSET-MPLTINFO        PIC X(16)  VALUE "MPLTINFO;".
024000     05  DSET-MACCT           PIC X(16)  VALUE "MACCOUNT-INFO;".
024100     05  DSET-MMATL-ACCUM     PIC X(16)  VALUE "MMATL-ACCUM;".
024200     05  DSET-DTRANS          PIC X(16)  VALUE "DTRANS;".
024300     05  DSET-DPOITEM         PIC X(16)  VALUE "DPOITEM;".
024400     05  DSET-MSTORERM        PIC X(16)  VALUE "MSTORERM;".
024500     05  DSET-MCLASS          PIC X(16)  VALUE "MCLASS;".
024600     05  DSET-MCHT-ACCTS      PIC X(16)  VALUE "MCHT-ACCTS;".
024700     05  DSET-DPORECD         PIC X(16)  VALUE "DPORECD;".
024800
024900 01  ITEMS-LISTING.
025000     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
025100     05  MATL-KEY         PIC X(10)  VALUE "MATL-CODE;".
025200     05  PO-KEY           PIC X(10)  VALUE "PO-NUMBER;".
025300     05  PO-SEARCH        PIC X(10)  VALUE "PO-RCV-NO;".
025400
025500 01  IMAGE-ARGS.
025600     05  MPLTINFO-ARG             PIC X(4)   VALUE SPACES.
025700     05  MACCT-KEY                PIC X(4)   VALUE SPACES.
025800     05  MMATL-CODE-ARG           PIC X(8)   VALUE SPACES.
025900     05  DUMMY-ARG                PIC X(10)  VALUE SPACES.
026000     05  PO-ARG                   PIC X(10)  VALUE SPACES.
026100     05  CODE-ARG                 PIC X(8)   VALUE SPACES.
026200     05  DEPT-ARG                 PIC X(6)   VALUE SPACES.
026300     05  CLASS-ARG                PIC X(4)   VALUE SPACES.
026400     05  PO-ARG-STORES            PIC X(14)  VALUE SPACES.
026500
026800 COPY MULTLOCK IN COPYLIB.
026900
027000 COPY SCURCONV IN COPYLIB.
027100
027200 COPY TBLOWUP IN COPYLIB.
027600

027700 PROCEDURE DIVISION.
027800
027900 001-BEGIN SECTION.
028000
028100 010-MAINLINE.
           PERFORM 1000-OPEN-FILES.
028200     SORT SORT-FILE ON ASCENDING KEY SORT-STORES-CODE
028300                                     SORT-PO-NUM
028400                                     SORT-ITEM-NUM
028500                                     SORT-DATA-BASE-INDIC
028600     INPUT PROCEDURE IS 050-PROCESS-TRANS
028700     OUTPUT PROCEDURE IS 700-CREATE-REPORT.
028800     PERFORM 1000-CLOSE-FILES.
028900     GOBACK.
029100
029200 050-PROCESS-TRANS SECTION.
       050-BEGIN.
029300     PERFORM 100-BEGIN.
029400     PERFORM 200-PROCESS-DTRANS
029500         UNTIL DTRANS-EOF-SW = "Y".
029600
      *    MOVE DUMMY-ARG TO CORPCDE OF DPOITEM-REC-I.
      *    START DPOITEM-I KEY > CORPCDE OF DPOITEM-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS-1 = "2"
      *            GO TO 699-PROCESS-EXIT
      *        ELSE
      *            MOVE "START DPOITEM * 050-PTS" TO BU-DISPLAY-MSG
      *            PERFORM 990-BLOWUP.

           PERFORM 400-GET-FIRST-DPOITEM.
029800     PERFORM 300-PROCESS-DPOITEM
029900         UNTIL DPOITEM-EOF-SW = "Y".
030000
030100**********************************************************
030200*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
030300*  FOR SORTING OF RECORDS.                               *
030400**********************************************************
030500
030600     GO TO 699-PROCESS-EXIT.
030700
030800 100-BEGIN.
030900     DISPLAY "UPDATE CODES OUT OF BALANCE? (YES OR NO)".
031000     ACCEPT UPDATE-RESPONSE.
031100     DISPLAY UPDATE-RESPONSE.
031200     IF UPDATE-RESPONSE = "YES" OR "NO"
031300         NEXT SENTENCE
031400     ELSE
031500         MOVE "INVALID RESPONSE TO UPDATE QUESTION"
031600             TO BU-DISPLAY-MSG
031700         MOVE UPDATE-RESPONSE  TO BU-DISPLAY-FLD (1)
031800         PERFORM 990-BLOWUP.
031900
032000     DISPLAY "IS THIS AN INITIAL LOAD? (YES OR NO)".
032100     ACCEPT INIT-LOAD-SW.
032200     DISPLAY INIT-LOAD-SW.
032300     IF INIT-LOAD-SW = "YES" OR "NO"
032400         NEXT SENTENCE
032500     ELSE
032600         MOVE "INVALID RESPONSE TO INITIAL LOAD QUESTION"
032700             TO BU-DISPLAY-MSG
032800         MOVE INIT-LOAD-SW  TO BU-DISPLAY-FLD (1)
032900         PERFORM 990-BLOWUP.
035200
035300****************************************************
035400**   GET OVERAGE PO PREFIX FROM MPLTINFO          **
035500**   KEY IS EQUAL TO 'ITOV'.  IF IT DOES NOT      **
035600**   EXIST THEN 'PITOV' IS THE OVERAGE PO PREFIX. **
035700****************************************************
035800
035900     MOVE "ITOV" TO MPLTINFO-ARG.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
036200     IF FILE-STATUS = "00"
036300         MOVE MPLTINFO-DATA TO SAVE-OV-PO-PREFIX
036400     ELSE
036500         MOVE "PITOV"       TO SAVE-OV-PO-PREFIX.
036600     DISPLAY "SAVE-OV-PO-PREFIX= ", SAVE-OV-PO-PREFIX.
036700
036800****************************************************
036900**   GET STOREROOM DEPT FROM MACCOUNT-INFO        **
037000**   KEY IS EQUAL TO 'SDPT'.  THE STOREROOM DEPT. **
037100****************************************************
037200
037300     MOVE "SDPT" TO MACCT-KEY.
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-I.
           READ MACTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
038100     IF FILE-STATUS = "00"
038200         MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
038300     ELSE
038400         MOVE "GET MACCOUNT-INFO 'SDPT'* 100"
038500               TO BU-DISPLAY-MSG
038600         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
038700         PERFORM 990-BLOWUP.
038800
038900     DISPLAY "SAVE-STR-DEPT=", SAVE-STR-DEPT.
039000
      *    MOVE DUMMY-ARG TO PONUM OF DTRANS-REC-O.
      *    START DTRANS-O KEY > PONUM OF DTRANS-REC-O
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS-1 NOT = "2"
      *            MOVE "START DTRANS * 100-B" TO
      *                 BU-DISPLAY-MSG
      *            PERFORM 990-BLOWUP.

           PERFORM 400-GET-FIRST-DTRANS.
039200
039400 200-PROCESS-DTRANS.
039500     IF TRANS-CODE = "INV" OR "DCHG" OR "REC"
039600         IF TRANS-BALANCE-QTY > 0
039700             MOVE TRANS-STORES-CODE  TO SORT-STORES-CODE
039800             MOVE TRANS-PO-NUM       TO SORT-PO-NUM
039900             MOVE TRANS-ITEM-NUM     TO SORT-ITEM-NUM
040000             MOVE TRANS-RCVR-NUM     TO SORT-RCVR-NUM
040100             MOVE TRANS-BALANCE-QTY  TO SORT-BALANCE-QTY
040200             COMPUTE SORT-UNIT-PRICE ROUNDED =
040300                 TRANS-VALUE / TRANS-QTY
040400             MOVE TRANS-CODE         TO SORT-TYPE
040500             MOVE TRANS-CLASS        TO SORT-CLASS
040600             MOVE TRANS-DEPT         TO SORT-DEPT
040700             MOVE TRANS-ACCT         TO SORT-ACCOUNT
040800             MOVE TRANS-UNIT-MEASURE TO SORT-UM
040900             MOVE "CSAS"             TO SORT-DATA-BASE-INDIC
041000             RELEASE SORT-REC.
041100
041200     PERFORM 400-GET-DTRANS.
041300
041400 300-PROCESS-DPOITEM.
041500     MOVE ITM-PO-NO TO SAVE-PO-NO.
041600     IF SAVE-PO-NO1-4 = SAVE-OV-PO-PREFIX2-5
041700         NEXT SENTENCE
041800     ELSE
041900         IF ITM-CORP-CODE = "NON-STR"
042000             PERFORM 310-CHECK-DCHG-ITEM
042100         ELSE
042200             IF ITM-SUB-DETL = SAVE-STR-DEPT
042300                 PERFORM 320-CHECK-STR-ITEM
042400             ELSE
042500                 PERFORM 310-CHECK-DCHG-ITEM.
042600
042700     PERFORM 400-GET-DPOITEM.
042800
042900 310-CHECK-DCHG-ITEM.
043000     PERFORM 600-GET-PO-HEADER.
043100     IF PO-NON-RCV-INDIC NOT = SPACES
043200       NEXT SENTENCE
043300     ELSE
043400       IF ITM-QTY-DLVR NOT = ITM-QTY-PAID
043500         PERFORM 350-LOAD-SORT-REC
043600         IF ITM-QTY-DLVR > ITM-QTY-PAID
043700             COMPUTE SORT-BALANCE-QTY ROUNDED = ITM-QTY-DLVR -
043800                                                ITM-QTY-PAID
043900             PERFORM 325-CONVERT-STR-UM
044000             MOVE "DCHG"          TO SORT-TYPE
044100             RELEASE SORT-REC
044200         ELSE
044300             COMPUTE SORT-BALANCE-QTY ROUNDED = ITM-QTY-PAID -
044400                                                ITM-QTY-DLVR
044500             PERFORM 325-CONVERT-STR-UM
044600             MOVE "INV"           TO SORT-TYPE
044700             RELEASE SORT-REC.
044800
044900 320-CHECK-STR-ITEM.
045000     IF ITM-QTY-STORED NOT = ITM-QTY-PAID
045100         PERFORM 350-LOAD-SORT-REC
045200         IF ITM-QTY-STORED > ITM-QTY-PAID
045300             COMPUTE SORT-BALANCE-QTY ROUNDED = ITM-QTY-STORED -
045400                                                ITM-QTY-PAID
045500             PERFORM 325-CONVERT-STR-UM
045600             MOVE "REC"          TO SORT-TYPE
045700             RELEASE SORT-REC
045800         ELSE
045900             COMPUTE SORT-BALANCE-QTY ROUNDED = ITM-QTY-PAID -
046000                                                ITM-QTY-STORED
046100             PERFORM 325-CONVERT-STR-UM
046200             MOVE "INV"          TO SORT-TYPE
046300             RELEASE SORT-REC.
046400
046500 325-CONVERT-STR-UM.
046600     IF ITM-CORP-CODE = "NON-STR"
046700         MOVE ITM-UM              TO SORT-UM
046800     ELSE
046900         MOVE STR-UM              TO SORT-UM
047000         IF ITM-UM = STR-UM
047100             NEXT SENTENCE
047200         ELSE
047300         IF ITM-UM = STR-UM1
047400             COMPUTE SORT-BALANCE-QTY ROUNDED =
047500                 SORT-BALANCE-QTY * STR-UM1-CF
047600         ELSE
047700         IF ITM-UM = STR-UM2
047800             COMPUTE SORT-BALANCE-QTY ROUNDED =
047900                 SORT-BALANCE-QTY * STR-UM2-CF
048000         ELSE
048100             MOVE "QTY UM CF ERROR" TO BU-DISPLAY-MSG
048200             MOVE ITM-CORP-CODE     TO BU-DISPLAY-FLD (1)
048300             MOVE ITM-PO-RCV-NO     TO BU-DISPLAY-FLD (2)
048400             PERFORM 990-BLOWUP.
048500
048600 350-LOAD-SORT-REC.
048700     MOVE ITM-CORP-CODE           TO SORT-STORES-CODE.
048800     MOVE ITM-PO-NO-AND-REL       TO SORT-PO-NUM.
048900     MOVE ITM-NUMBER              TO SORT-ITEM-NUM.
049000     MOVE ITM-PO-RCVR             TO SORT-RCVR-NUM.
049100     MOVE ITM-CLASS               TO SORT-CLASS.
049200     MOVE ITM-SUB-DETL            TO SORT-DEPT.
049300     MOVE ITM-ADDL-DATA           TO SORT-ACCOUNT.
049400     MOVE "CSIS"                  TO SORT-DATA-BASE-INDIC.
049500     IF ITM-CORP-CODE = "NON-STR"
049600         MOVE ITM-UNIT-PRICE      TO SORT-UNIT-PRICE
049700     ELSE
049800         PERFORM 400-GET-MSTORERM
049900         IF ITM-PRICE-UM = STR-UM
050000             COMPUTE SORT-UNIT-PRICE ROUNDED =
050100                 ITM-UNIT-PRICE * 1
050200         ELSE
050300         IF ITM-PRICE-UM = STR-UM1
050400             COMPUTE SORT-UNIT-PRICE ROUNDED =
050500                 ITM-UNIT-PRICE / STR-UM1-CF
050600         ELSE
050700         IF ITM-PRICE-UM = STR-UM2
050800             COMPUTE SORT-UNIT-PRICE ROUNDED =
050900                 ITM-UNIT-PRICE / STR-UM2-CF
051000         ELSE
051100             MOVE "PRICE UM CF ERROR" TO BU-DISPLAY-MSG
051200             MOVE ITM-CORP-CODE   TO BU-DISPLAY-FLD (1)
051300             MOVE ITM-PO-RCV-NO   TO BU-DISPLAY-FLD (2)
051400             PERFORM 990-BLOWUP.
051500
051600     PERFORM 500-CONVERT-TO-LOCAL-CURRENCY.
051700
051800     IF SORT-UNIT-PRICE = ZEROS
051900         IF ITM-CORP-CODE NOT = "NON-STR"
052000             COMPUTE SORT-UNIT-PRICE ROUNDED =
052100                 STR-AVG-COST * 1.
052200
052300     IF SORT-CLASS = SPACES
052400         IF ITM-CORP-CODE NOT = "NON-STR"
052500             MOVE STR-CLASS       TO SORT-CLASS.
052600
052800 400-GET-DTRANS.
           READ DTRANS-O NEXT INTO BUF-DTRANS
               AT END MOVE "Y" TO DTRANS-EOF-SW.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DTRANS * 400-GD" TO
                        BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

052800 400-GET-FIRST-DTRANS.
           READ DTRANS-O FIRST INTO BUF-DTRANS
               AT END MOVE "Y" TO DTRANS-EOF-SW.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ FIRST DTRANS * 400-GFD" TO
                        BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

       400-GET-DPOITEM.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE "Y" TO DPOITEM-EOF-SW.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DPOITEM * 400-GD" TO
                        BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

       400-GET-FIRST-DPOITEM.
           READ DPOITEM-I FIRST INTO BUF-DPOITEM
               AT END MOVE "Y" TO DPOITEM-EOF-SW.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ FIRST DPOITEM * 400-GFD" TO
                        BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

056400 400-GET-MSTORERM.
056500     MOVE ITM-CORP-CODE           TO CODE-ARG.
           MOVE CODE-ARG                TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
057600         MOVE "READ MSTORERM * 400-GM" TO BU-DISPLAY-MSG
               MOVE ITM-CORP-CODE       TO BU-DISPLAY-FLD (2)
057700         PERFORM 990-BLOWUP.
057800
057900 500-CONVERT-TO-LOCAL-CURRENCY.
058000     PERFORM 600-GET-PO-HEADER.
058100
058200     IF PO-CURRENCY-CODE = SPACES
058300         NEXT SENTENCE
058400     ELSE
058500         MOVE PO-CURRENCY-CODE    TO SCURCONV-CUR-CODE
058600         MOVE SORT-UNIT-PRICE     TO SCURCONV-PRICE-DEC
058700         MOVE ZEROS               TO SCURCONV-PRICE-WHL
058800         CALL "SCURCONV" USING STORES-BASE,
058900                               SCURCONV-PARMS,
059000                               STATUS-AREA,
059100                               BU-DISPLAY-AREA,
059200                               BU-DISPLAY-FLDS
059300         IF BU-DISPLAY-MSG-1 = SPACES
059400             MOVE SCURCONV-PRICE-DEC  TO SORT-UNIT-PRICE
059500         ELSE
059600             MOVE "SCURCONV"      TO BU-DISPLAY-FLD (5)
059700             PERFORM 990-BLOWUP.
059800
059900 600-GET-PO-HEADER.
060000     MOVE ITM-PO-RCV-NO           TO PO-ARG-STORES.
           MOVE PO-ARG-STORES           TO PORCVNO OF DPORECD-REC-I.
           READ DPORECD-I INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
060700     IF FILE-STATUS = "00"
060800         NEXT SENTENCE
060900     ELSE
061000         MOVE "READ DPORECD * 600-GPH" TO BU-DISPLAY-MSG
061100         MOVE PO-ARG-STORES TO BU-DISPLAY-FLD (2)
061200         PERFORM 990-BLOWUP.
062700
062800 699-PROCESS-EXIT.
062900     EXIT.
063000
063100 700-CREATE-REPORT SECTION.
       700-BEGIN.
063200     DISPLAY "BEGIN REPORT".
063300     PERFORM 710-BEGIN-REPORT.
063400     PERFORM 720-MOVE-DATA
063500        UNTIL NO-MORE-SORT = "YES".
063600
063700     MOVE RCD-CTR                 TO RCD-CTR-OUT.
063800     WRITE PRT-REC FROM LAST-LINE AFTER 3.
063900
064000**************************************************
064100**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
064200**  TO COMPLETE PROCESSING OF REPORT            **
064300**************************************************
064400
064500     GO TO 799-CREATE-EXIT.
064600
064700 710-BEGIN-REPORT.
064800     OPEN OUTPUT ONLINE-PRT.
064900     PERFORM 750-PRINT-HEADINGS.
065000     RETURN SORT-FILE
065100        AT END
065200            MOVE "YES" TO NO-MORE-SORT.
065300
065400 720-MOVE-DATA.
065500     MOVE ZEROS                   TO CSIS-STR-OPEN-RCVR,
065600                                     CSIS-DIR-OPEN-RCVR,
065700                                     CSIS-STR-OPEN-INV,
065800                                     CSIS-DIR-OPEN-INV,
065900                                     CSIS-STR-OPEN-RCVR-VALUE,
066000                                     CSIS-STR-OPEN-INV-VALUE,
066100                                     CSAS-STR-OPEN-RCVR,
066200                                     CSAS-DIR-OPEN-RCVR,
066300                                     CSAS-STR-OPEN-INV,
066400                                     CSAS-DIR-OPEN-INV,
066500                                     CSAS-STR-OPEN-INV-VALUE,
066600                                     CSAS-STR-OPEN-RCVR-VALUE.
066700     MOVE SPACES                  TO CSIS-RECORD-FOUND,
066800                                     CSAS-RECORD-FOUND,
066900                                     CSIS-SAVE-CLASS,
067000                                     CSAS-SAVE-CLASS.
067100     MOVE SORT-PO-NUM             TO SAVE-PO-NUM.
067200     MOVE SORT-ITEM-NUM           TO SAVE-ITEM-NUM.
067300     MOVE SORT-STORES-CODE        TO SAVE-CORP-CODE.
067400
067500     PERFORM 730-PROCESS-RECORD
067600         UNTIL   SORT-PO-NUM NOT = SAVE-PO-NUM  OR
067700               SORT-ITEM-NUM NOT = SAVE-ITEM-NUM  OR
067800                NO-MORE-SORT = "YES".
067900
068000     PERFORM 740-COMPARE-ORDER.
068100
068300 730-PROCESS-RECORD.
068400     COMPUTE SAVE-TRANS-VALUE ROUNDED =
068500         SORT-BALANCE-QTY * SORT-UNIT-PRICE.
068600     IF SORT-DATA-BASE-INDIC = "CSIS"
068700         MOVE "Y"                 TO CSIS-RECORD-FOUND
068800         MOVE SORT-CLASS          TO CSIS-SAVE-CLASS
068900         IF SORT-TYPE = "REC"
069000             ADD SORT-BALANCE-QTY TO CSIS-STR-OPEN-RCVR
069100             ADD SAVE-TRANS-VALUE TO CSIS-STR-OPEN-RCVR-VALUE
069200         ELSE
069300         IF SORT-TYPE = "DCHG"
069400             ADD SORT-BALANCE-QTY TO CSIS-DIR-OPEN-RCVR
069500         ELSE
069600         IF SORT-TYPE = "INV"
069700             IF SORT-DEPT = SAVE-STR-DEPT
069800                 IF SORT-STORES-CODE = "NON-STR"
069900                     ADD SORT-BALANCE-QTY TO
070000                         CSIS-DIR-OPEN-INV
070100                 ELSE
070200                     ADD SORT-BALANCE-QTY  TO CSIS-STR-OPEN-INV
070300                     ADD SAVE-TRANS-VALUE  TO
070400                         CSIS-STR-OPEN-INV-VALUE
070500             ELSE
070600                 ADD SORT-BALANCE-QTY  TO CSIS-DIR-OPEN-INV
070700         ELSE
070800             NEXT SENTENCE
070900     ELSE
071000     IF SORT-DATA-BASE-INDIC = "CSAS"
071100         MOVE "Y"                 TO CSAS-RECORD-FOUND
071200         MOVE SORT-CLASS          TO CSAS-SAVE-CLASS
071300         IF SORT-TYPE = "REC"
071400             ADD SORT-BALANCE-QTY TO CSAS-STR-OPEN-RCVR
071500             ADD SAVE-TRANS-VALUE TO CSAS-STR-OPEN-RCVR-VALUE
071600         ELSE
071700         IF SORT-TYPE = "DCHG"
071800             ADD SORT-BALANCE-QTY TO CSAS-DIR-OPEN-RCVR
071900         ELSE
072000         IF SORT-TYPE = "INV"
072100             IF SORT-DEPT = SAVE-STR-DEPT
072200                 IF SORT-STORES-CODE = "NON-STR"
072300                     ADD SORT-BALANCE-QTY TO
072400                         CSAS-DIR-OPEN-INV
072500                 ELSE
072600                     ADD SORT-BALANCE-QTY TO
072700                         CSAS-STR-OPEN-INV
072800                     ADD SAVE-TRANS-VALUE TO
072900                         CSAS-STR-OPEN-INV-VALUE
073000             ELSE
073100                 ADD SORT-BALANCE-QTY TO CSAS-DIR-OPEN-INV.
073200
073300     MOVE SORT-UNIT-PRICE         TO SAVE-UNIT-PRICE.
073400     MOVE SORT-DEPT               TO SAVE-DEPT.
073500     MOVE SORT-ACCOUNT            TO SAVE-ACCOUNT.
073600     MOVE SORT-CLASS              TO SAVE-CLASS.
073700     MOVE SORT-UM                 TO SAVE-UM.
073800
073900     RETURN SORT-FILE
074000        AT END
074100            MOVE "YES" TO NO-MORE-SORT.
074200
074300  740-COMPARE-ORDER.
074400     MOVE SAVE-CORP-CODE          TO MMATL-CODE-ARG,
074500                                     BU-DISPLAY-FLD (1).
074600     MOVE SAVE-PO-NUM             TO PO-ARG,
074700                                     BU-DISPLAY-FLD (2).
074800     MOVE SAVE-ITEM-NUM           TO BU-DISPLAY-FLD (3).
074900     MOVE SPACES                  TO CLASS-ERR-SW,
075000                                     DEPT-ERR-SW.
075100
075200     IF CSIS-STR-OPEN-INV  NOT = CSAS-STR-OPEN-INV
075300         PERFORM 850-CANCEL-DTRANS-STR-INV
075400         PERFORM 820-CREATE-DTRANS-STR-INV
075500         PERFORM 855-UPDATE-MSTR-OPEN-INV.
075600
075700     IF CSIS-DIR-OPEN-INV  NOT = CSAS-DIR-OPEN-INV
075800         PERFORM 860-CANCEL-DTRANS-DIR-INV
075900         PERFORM 830-CREATE-DTRANS-DIR-INV.
076000
076100     IF CSIS-STR-OPEN-RCVR NOT = CSAS-STR-OPEN-RCVR
076200         PERFORM 865-CANCEL-DTRANS-STR-RCVR
076300         PERFORM 835-CREATE-DTRANS-STR-RCVR
076400         PERFORM 870-UPDATE-MSTR-OPEN-RCVR.
076500
076600     IF CSIS-DIR-OPEN-RCVR NOT = CSAS-DIR-OPEN-RCVR
076700         PERFORM 875-CANCEL-DTRANS-DIR-RCVR
076800         PERFORM 845-CREATE-DTRANS-DIR-RCVR.
076900
077000     IF CSIS-STR-OPEN-INV = CSAS-STR-OPEN-INV AND
077100        CSIS-DIR-OPEN-INV = CSAS-DIR-OPEN-INV AND
077200        CSIS-STR-OPEN-RCVR = CSAS-STR-OPEN-RCVR AND
077300        CSIS-DIR-OPEN-RCVR = CSAS-DIR-OPEN-RCVR
077400         NEXT SENTENCE
077500     ELSE
077600         PERFORM 745-PRINT-REPORT-DETAIL.
077700
077900 745-PRINT-REPORT-DETAIL.
078000     ADD 1                        TO RCD-CTR.
078100     MOVE SAVE-CORP-CODE          TO PRT-MATLCODE.
078200     MOVE SAVE-PO-NUM             TO PRT-PO-NUM.
078300     MOVE SAVE-ITEM-NUM           TO PRT-ITEM-NUM.
078400     MOVE SAVE-CLASS              TO PRT-CLASS.
078500     MOVE SAVE-DEPT               TO PRT-DEPT.
078600     MOVE SAVE-ACCOUNT            TO PRT-ACCOUNT.
078700     MOVE SAVE-UM                 TO PRT-UM.
078800     WRITE PRT-REC FROM DETAIL-LINE1 AFTER 2.
078900     ADD 2                        TO LINE-CNT.
079000
079100     IF CLASS-ERR-SW = "Y"
079200         WRITE PRT-REC FROM INVALID-CLASS-MSG AFTER 1
079300         ADD 1 TO LINE-CNT.
079400
079500     IF DEPT-ERR-SW = "Y"
079600         WRITE PRT-REC FROM INVALID-DEPT-MSG AFTER 1
079700         ADD 1 TO LINE-CNT.
079800
079900     IF CSIS-STR-OPEN-INV NOT = CSAS-STR-OPEN-INV
080000         MOVE CSIS-STR-OPEN-INV   TO PRT-CSIS-QTY
080100         MOVE CSIS-STR-OPEN-INV-VALUE TO PRT-CSIS-VALUE
080200         MOVE CSAS-STR-OPEN-INV   TO PRT-CSAS-QTY
080300         MOVE CSAS-STR-OPEN-INV-VALUE TO PRT-CSAS-VALUE
080400         MOVE "STOREROOM OPEN INVOICE DIFFERENCE"
080500             TO PRT-DETAIL-HEADER
080600         PERFORM 750-PRINT-DETAIL.
080700
080800     IF CSIS-STR-OPEN-RCVR NOT = CSAS-STR-OPEN-RCVR
080900         MOVE CSIS-STR-OPEN-RCVR  TO PRT-CSIS-QTY
081000         MOVE CSIS-STR-OPEN-RCVR-VALUE TO PRT-CSIS-VALUE
081100         MOVE CSAS-STR-OPEN-RCVR  TO PRT-CSAS-QTY
081200         MOVE CSAS-STR-OPEN-RCVR-VALUE TO PRT-CSAS-VALUE
081300         MOVE "STOREROOM OPEN RECEIVER DIFFERENCE"
081400             TO PRT-DETAIL-HEADER
081500         PERFORM 750-PRINT-DETAIL.
081600
081700     IF CSIS-DIR-OPEN-INV NOT = CSAS-DIR-OPEN-INV
081800         MOVE CSIS-DIR-OPEN-INV   TO PRT-CSIS-QTY
081900         MOVE ZEROS               TO PRT-CSIS-VALUE
082000         MOVE CSAS-DIR-OPEN-INV   TO PRT-CSAS-QTY
082100         MOVE ZEROS               TO PRT-CSAS-VALUE
082200         MOVE "DIRECT CHARGE OPEN INVOICE DIFFERENCE"
082300             TO PRT-DETAIL-HEADER
082400         PERFORM 750-PRINT-DETAIL.
082500
082600     IF CSIS-DIR-OPEN-RCVR NOT = CSAS-DIR-OPEN-RCVR
082700         MOVE CSIS-DIR-OPEN-RCVR  TO PRT-CSIS-QTY
082800         MOVE ZEROS               TO PRT-CSIS-VALUE
082900         MOVE CSAS-DIR-OPEN-RCVR  TO PRT-CSAS-QTY
083000         MOVE ZEROS               TO PRT-CSAS-VALUE
083100         MOVE "DIRECT CHARGE OPEN RECEIVER DIFFERENCE"
083200             TO PRT-DETAIL-HEADER
083300         PERFORM 750-PRINT-DETAIL.
083400
083500     IF LINE-CNT > 55
083600         PERFORM 750-PRINT-HEADINGS.
083700
083900 750-PRINT-DETAIL.
084000     WRITE PRT-REC FROM DETAIL-LINE2 AFTER 2.
084100     ADD 2   TO LINE-CNT.
084200
084400 750-PRINT-HEADINGS.
084500     MOVE 1                       TO DATE-MODE.
084600     CALL "TDATECHK" USING DATE-CHECK-AREA.
084700     MOVE DATE-SLASH-OUT          TO DATE-H1.
084800     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
084900     ADD 1                        TO PAGE-CNT.
085000     MOVE PAGE-CNT                TO PAGE-H2.
085100     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
085200     WRITE PRT-REC FROM HEADER2 AFTER 1.
085300     WRITE PRT-REC FROM HEADER4 AFTER 2.
085400     MOVE SPACES                  TO PRT-REC.
085500     WRITE PRT-REC  AFTER 1.
085600     MOVE 6 TO LINE-CNT.
085700
085900 820-CREATE-DTRANS-STR-INV.
086000     IF CSIS-STR-OPEN-INV = ZEROS
086100         NEXT SENTENCE
086200     ELSE
086300         PERFORM 910-GET-MATL-ACCUM
086400         MOVE SPACES              TO BUF-DTRANS
086500         MOVE MMATL-CODE-ARG      TO TRANS-STORES-CODE
086600         MOVE SAVE-ITEM-NUM       TO TRANS-ITEM-NUM
086700         PERFORM 920-CHECK-ACCOUNT
086800         MOVE SAVE-ACCOUNT        TO TRANS-ACCT
086900         PERFORM 920-CHECK-CLASS
087000         PERFORM 920-CHECK-DEPT
087100         MOVE "INV"               TO TRANS-CODE
087200         MOVE 1                   TO DATE-MODE
087300         CALL "TDATECHK" USING DATE-CHECK-AREA
087400         MOVE DATE-YMD-OUT        TO TRANS-DATE
               IF TRANS-YY > "70"
                   MOVE "19"            TO TRANS-DATE-CC
               ELSE
                   MOVE "20"            TO TRANS-DATE-CC
               END-IF
087500         MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME
087600         MOVE CSIS-STR-OPEN-INV   TO TRANS-QTY,
087700                                     TRANS-BALANCE-QTY
087800         MOVE CSIS-STR-OPEN-INV-VALUE TO TRANS-VALUE
087900         MOVE MATL-UNIT-MEASURE   TO TRANS-UNIT-MEASURE
088000         MOVE PO-ARG              TO TRANS-PO-NUM
088100         MOVE "PROC"              TO TRANS-DOCUMENT-NUM
088300         PERFORM 910-PUT-DTRANS.
088500
088600 830-CREATE-DTRANS-DIR-INV.
088700     IF CSIS-DIR-OPEN-INV = ZEROS
088800         NEXT SENTENCE
088900     ELSE
089000         MOVE SPACES              TO BUF-DTRANS
089100         MOVE MMATL-CODE-ARG      TO TRANS-STORES-CODE
089200         MOVE SAVE-ITEM-NUM       TO TRANS-ITEM-NUM
089300         PERFORM 920-CHECK-ACCOUNT
089400         MOVE SAVE-ACCOUNT        TO TRANS-ACCT
089500         PERFORM 920-CHECK-CLASS
089600         PERFORM 920-CHECK-DEPT
089700         MOVE "INV"               TO TRANS-CODE
089800         MOVE 1                   TO DATE-MODE
089900         CALL "TDATECHK" USING DATE-CHECK-AREA
090000         MOVE DATE-YMD-OUT        TO TRANS-DATE
               IF TRANS-YY > "70"
                   MOVE "19"            TO TRANS-DATE-CC
               ELSE
                   MOVE "20"            TO TRANS-DATE-CC
               END-IF
090100         MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME
090200         MOVE CSIS-DIR-OPEN-INV   TO TRANS-QTY,
090300                                     TRANS-BALANCE-QTY
090400         COMPUTE TRANS-VALUE ROUNDED = TRANS-QTY *
090500                                       SAVE-UNIT-PRICE
090600         MOVE SAVE-UM             TO TRANS-UNIT-MEASURE
090700         MOVE PO-ARG              TO TRANS-PO-NUM
090800         MOVE "PROC"              TO TRANS-DOCUMENT-NUM
091000         PERFORM 910-PUT-DTRANS.
091200
091300 835-CREATE-DTRANS-STR-RCVR.
091400     IF CSIS-STR-OPEN-RCVR = ZEROS
091500         NEXT SENTENCE
091600     ELSE
091700         PERFORM 910-GET-MATL-ACCUM
091800         MOVE SPACES              TO BUF-DTRANS
091900         MOVE MMATL-CODE-ARG      TO TRANS-STORES-CODE
092000         MOVE SAVE-ITEM-NUM       TO TRANS-ITEM-NUM
092100         MOVE MATL-CLASS          TO TRANS-CLASS
092200         MOVE SAVE-STR-DEPT       TO TRANS-DEPT
092300         MOVE "000000"            TO TRANS-ACCT
092400         MOVE "REC"               TO TRANS-CODE
092500         MOVE 1                   TO DATE-MODE
092600         CALL "TDATECHK" USING DATE-CHECK-AREA
092700         MOVE DATE-YMD-OUT        TO TRANS-DATE
               IF TRANS-YY > "70"
                   MOVE "19"            TO TRANS-DATE-CC
               ELSE
                   MOVE "20"            TO TRANS-DATE-CC
               END-IF
092800         MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME
092900         MOVE CSIS-STR-OPEN-RCVR  TO TRANS-QTY,
093000                                     TRANS-BALANCE-QTY
093100         MOVE CSIS-STR-OPEN-RCVR-VALUE TO TRANS-VALUE
093200         MOVE MATL-UNIT-MEASURE   TO TRANS-UNIT-MEASURE
093300         MOVE PO-ARG              TO TRANS-PO-NUM
093400         MOVE "PROC"              TO TRANS-DOCUMENT-NUM
093600         PERFORM 910-PUT-DTRANS.
093800
093900 845-CREATE-DTRANS-DIR-RCVR.
094000     IF CSIS-DIR-OPEN-RCVR = ZEROS
094100         NEXT SENTENCE
094200     ELSE
094300         MOVE SPACES              TO BUF-DTRANS
094400         MOVE MMATL-CODE-ARG      TO TRANS-STORES-CODE
094500         MOVE SAVE-ITEM-NUM       TO TRANS-ITEM-NUM
094600         PERFORM 920-CHECK-ACCOUNT
094700         MOVE SAVE-ACCOUNT        TO TRANS-ACCT
094800         PERFORM 920-CHECK-CLASS
094900         PERFORM 920-CHECK-DEPT
095000         MOVE "DCHG"              TO TRANS-CODE
095100         MOVE 1                   TO DATE-MODE
095200         CALL "TDATECHK" USING DATE-CHECK-AREA
095300         MOVE DATE-YMD-OUT        TO TRANS-DATE
               IF TRANS-YY > "70"
                   MOVE "19"            TO TRANS-DATE-CC
               ELSE
                   MOVE "20"            TO TRANS-DATE-CC
               END-IF
095400         MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME
095500         MOVE CSIS-DIR-OPEN-RCVR  TO TRANS-QTY,
095600                                     TRANS-BALANCE-QTY
095700         COMPUTE TRANS-VALUE ROUNDED = TRANS-QTY *
095800                                       SAVE-UNIT-PRICE
095900         MOVE SAVE-UM             TO TRANS-UNIT-MEASURE
096000         MOVE PO-ARG              TO TRANS-PO-NUM
096100         MOVE "PROC"              TO TRANS-DOCUMENT-NUM
096300         PERFORM 910-PUT-DTRANS.
096500
096600 850-CANCEL-DTRANS-STR-INV.
096800     PERFORM 910-FIND-DTRANS.
           IF FILE-STATUS = "00"
097000         PERFORM 851-GET-DTRANS
097100             UNTIL TRANS-PO-NUM NOT = SAVE-PO-NUM OR
                         FILE-STATUS  NOT = "00".
097300
097400 851-GET-DTRANS.
           READ DTRANS-O NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
097700     IF FILE-STATUS = "00"
097800         IF TRANS-ITEM-NUM = SAVE-ITEM-NUM AND
097900            TRANS-CODE = "INV"  AND
098000            TRANS-DEPT = SAVE-STR-DEPT AND
098100            TRANS-BALANCE-QTY > 0
098200             MOVE ZEROS           TO TRANS-BALANCE-QTY
098300             PERFORM 910-UPDATE-DTRANS
098400         ELSE
098500             NEXT SENTENCE
098600     ELSE
098700         IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
098800                 NEXT SENTENCE
098900             ELSE
099000                 MOVE "GET DTRANS *851-GD" TO BU-DISPLAY-MSG
099100                 PERFORM 990-BLOWUP.
099200
099300 855-UPDATE-MSTR-OPEN-INV.
099500     PERFORM 910-GET-MATL-ACCUM.
099600     SUBTRACT CSAS-STR-OPEN-INV       FROM MATL-UNITS-INV-NOT-RCVD.
099700     IF CSAS-SAVE-CLASS = "206"
099800         NEXT SENTENCE
099900     ELSE
100000         IF MATL-UNITS-INV-NOT-RCVD = ZEROS
100100             MOVE ZEROS           TO MATL-INV-DOL-NOT-RCVD
100200         ELSE
100300             SUBTRACT CSAS-STR-OPEN-INV-VALUE FROM
100400                                     MATL-INV-DOL-NOT-RCVD.
100500     ADD CSIS-STR-OPEN-INV        TO MATL-UNITS-INV-NOT-RCVD.
100600     IF CSIS-SAVE-CLASS = "206"
100700         NEXT SENTENCE
100800     ELSE
100900         ADD CSIS-STR-OPEN-INV-VALUE  TO MATL-INV-DOL-NOT-RCVD.
101000     PERFORM 910-UPDATE-MATL-ACCUM.
101200
101300 860-CANCEL-DTRANS-DIR-INV.
101500     PERFORM 910-FIND-DTRANS.
           IF FILE-STATUS = "00"
097000         PERFORM 861-GET-DTRANS
097100             UNTIL TRANS-PO-NUM NOT = SAVE-PO-NUM OR
                         FILE-STATUS  NOT = "00".
102000
102100 861-GET-DTRANS.
           READ DTRANS-O NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
102400     IF FILE-STATUS = "00"
102500         IF TRANS-ITEM-NUM = SAVE-ITEM-NUM AND
102600            TRANS-CODE = "INV"  AND
102700            TRANS-BALANCE-QTY > 0
102800             IF TRANS-DEPT NOT = SAVE-STR-DEPT
102900                 MOVE ZEROS       TO TRANS-BALANCE-QTY
103000                 PERFORM 910-UPDATE-DTRANS
103100             ELSE
103200                 IF TRANS-STORES-CODE = "NON-STR"
103300                     MOVE ZEROS   TO TRANS-BALANCE-QTY
103400                     PERFORM 910-UPDATE-DTRANS
103500                 ELSE
103600                     NEXT SENTENCE
                       END-IF
                   END-IF
103700         ELSE
103800             NEXT SENTENCE
               END-IF
103900     ELSE
104000         IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
104100                 NEXT SENTENCE
104200             ELSE
104300                 MOVE "GET DTRANS *851-GD" TO BU-DISPLAY-MSG
104400                 PERFORM 990-BLOWUP
                   END-IF.
104500
104600 865-CANCEL-DTRANS-STR-RCVR.
104800     PERFORM 910-FIND-DTRANS.
           IF FILE-STATUS = "00"
               PERFORM 866-GET-DTRANS
                   UNTIL TRANS-PO-NUM NOT = SAVE-PO-NUM OR
                         FILE-STATUS  NOT = "00".
105300
105400 866-GET-DTRANS.
           READ DTRANS-O NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
105800         IF TRANS-ITEM-NUM = SAVE-ITEM-NUM AND
105900            TRANS-CODE = "REC"  AND
106000            TRANS-BALANCE-QTY > 0
106100             MOVE ZEROS           TO TRANS-BALANCE-QTY
106200             PERFORM 910-UPDATE-DTRANS
106300         ELSE
106400             NEXT SENTENCE
106500     ELSE
106600         IF FILE-STATUS = "10" OR "14" OR "46"
106700             NEXT SENTENCE
106800         ELSE
106900             MOVE "GET DTRANS *866-GD" TO BU-DISPLAY-MSG
107000             PERFORM 990-BLOWUP.
107100
107200 870-UPDATE-MSTR-OPEN-RCVR.
108600     PERFORM 910-GET-MATL-ACCUM.
108700     SUBTRACT CSAS-STR-OPEN-RCVR   FROM MATL-UNITS-RCVD-NOT-INV.
108800     IF CSAS-SAVE-CLASS = "206"
108900         NEXT SENTENCE
109000     ELSE
109100         IF MATL-UNITS-RCVD-NOT-INV  =  ZEROS
109200             MOVE ZEROS           TO MATL-RCPT-DOLLARS
109300         ELSE
109400             SUBTRACT CSAS-STR-OPEN-RCVR-VALUE
109500                                  FROM MATL-RCPT-DOLLARS.
109600
109700**************************************************************
109800*    IF THIS IS AN INITIAL LOAD DONT CUT THE ACCOUNTING
109900*    ADJUSTMENT SINCE THE INITIAL LOAD OF THE CODES
110000*    HAS ALLOWED FOR OPEN RECEIVER QUANTITY IN ORDER
110100*    TO BALANCE TO CSIS ONHAND
110200**************************************************************
110300     IF INIT-LOAD-SW = "YES"
110400         NEXT SENTENCE
110500     ELSE
110600         ADD CSAS-STR-OPEN-RCVR   TO MATL-ACCTG-UNIT-CORR
110700         MOVE CSAS-STR-OPEN-RCVR  TO ADJUSTMENT-QTY
110800         IF CSAS-SAVE-CLASS = "206"
110900             MOVE ZEROS           TO ADJUSTMENT-VALUE
111000         ELSE
111100             ADD CSAS-STR-OPEN-RCVR-VALUE TO
111200                 MATL-ACCTG-DOLLAR-CORR
111300             MOVE CSAS-STR-OPEN-RCVR-VALUE TO ADJUSTMENT-VALUE
111400             PERFORM 871-CREATE-AADJ.
111500
111600     ADD CSIS-STR-OPEN-RCVR       TO MATL-UNITS-RCVD-NOT-INV.
111700     IF CSIS-SAVE-CLASS = "206"
111800         NEXT SENTENCE
111900     ELSE
112000         ADD CSIS-STR-OPEN-RCVR-VALUE TO MATL-RCPT-DOLLARS.
112100
112200**************************************************************
112300*    IF THIS IS AN INITIAL LOAD DONT CUT THE ACCOUNTING
112400*    ADJUSTMENT SINCE THE INITIAL LOAD OF THE CODES
112500*    HAS ALLOWED FOR OPEN RECEIVER QUANTITY IN ORDER
112600*    TO BALANCE TO CSIS ONHAND
112700**************************************************************
112800     IF INIT-LOAD-SW = "YES"
112900         NEXT SENTENCE
113000     ELSE
113100         SUBTRACT CSIS-STR-OPEN-RCVR  FROM MATL-ACCTG-UNIT-CORR
113200         COMPUTE ADJUSTMENT-QTY  =  CSIS-STR-OPEN-RCVR * -1
113300         IF CSIS-SAVE-CLASS = "206"
113400             MOVE ZEROS           TO ADJUSTMENT-VALUE
113500         ELSE
113600             SUBTRACT CSIS-STR-OPEN-RCVR-VALUE
113700                                  FROM MATL-ACCTG-DOLLAR-CORR
113800             COMPUTE ADJUSTMENT-VALUE =
113900                                  CSIS-STR-OPEN-RCVR-VALUE * -1
114000             PERFORM 871-CREATE-AADJ.
114100
114200     PERFORM 910-UPDATE-MATL-ACCUM.
114800
114900 871-CREATE-AADJ.
115000     MOVE SPACES                  TO BUF-DTRANS.
115100     MOVE MMATL-CODE-ARG          TO TRANS-STORES-CODE.
115200     MOVE SAVE-ITEM-NUM           TO TRANS-ITEM-NUM.
115300     MOVE MATL-CLASS              TO TRANS-CLASS.
115400************************************************************
115500**  DANVILLE   '1996' -> DEPT; '000010' -> ACCOUNT
115600**  LAWTON    STR-DEFAULT-DEPT -> DEPT; "000215" -> ACCOUNT
115700**  TOPEKA     '7274' -> DEPT; '000215' -> ACCOUNT
115800************************************************************
115900     MOVE MATL-DEPT               TO TRANS-DEPT.
116000     MOVE "000215"                TO TRANS-ACCT.
116100     MOVE "AADJ"                  TO TRANS-CODE.
116200     MOVE 1                       TO DATE-MODE.
116300     CALL "TDATECHK" USING DATE-CHECK-AREA.
116400     MOVE DATE-YMD-OUT            TO TRANS-DATE.

           IF TRANS-YY > "70"
               MOVE "19"            TO TRANS-DATE-CC
           ELSE
               MOVE "20"            TO TRANS-DATE-CC
           END-IF.

116500     MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME.
116600     MOVE ADJUSTMENT-QTY          TO TRANS-QTY.
116700     MOVE ADJUSTMENT-VALUE        TO TRANS-VALUE.
116800     MOVE MATL-UNIT-MEASURE       TO TRANS-UNIT-MEASURE.
116900     MOVE PO-ARG                  TO TRANS-PO-NUM.
117000     MOVE ZEROS                   TO TRANS-BALANCE-QTY.
117100     PERFORM 910-PUT-DTRANS.
117200
117300 875-CANCEL-DTRANS-DIR-RCVR.
117500     PERFORM 910-FIND-DTRANS.
           IF FILE-STATUS = "00"
               PERFORM 876-GET-DTRANS
                   UNTIL TRANS-PO-NUM NOT = SAVE-PO-NUM OR
                         FILE-STATUS  NOT = "00".
118000
118100 876-GET-DTRANS.
           READ DTRANS-O NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF TRANS-ITEM-NUM = SAVE-ITEM-NUM AND
                  TRANS-CODE = "DCHG"  AND
                  TRANS-BALANCE-QTY > 0
                   MOVE ZEROS           TO TRANS-BALANCE-QTY
                   PERFORM 910-UPDATE-DTRANS
               ELSE
                   NEXT SENTENCE
               END-IF
           ELSE
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DTRANS *876-GD" TO BU-DISPLAY-MSG.

123500 910-FIND-DTRANS.
           MOVE PO-ARG TO PONUM OF DTRANS-REC-O.
           START DTRANS-O KEY = PONUM OF DTRANS-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
123800     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
124400             MOVE "START DTRANS * 910-FD" TO BU-DISPLAY-MSG
124500             PERFORM 990-BLOWUP.
124600
124700 910-UPDATE-DTRANS.
124800     IF UPDATE-RESPONSE = "YES"
               REWRITE DTRANS-REC-O FROM BUF-DTRANS
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DTRANS * 910-UD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
125600
125700 910-GET-MATL-ACCUM.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MATLACUM-REC-O.
           READ MATLACUM-O INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ MMATL-ACCUM * 910-GMA" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
126500
126600 910-UPDATE-MATL-ACCUM.
126700     IF UPDATE-RESPONSE = "YES"
               REWRITE MATLACUM-REC-O FROM BUF-MATLACUM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE MATL-ACCUM * 910-UMA" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP
               END-IF.
127500
127600 910-PUT-DTRANS.
127700     IF UPDATE-RESPONSE = "YES"
               WRITE DTRANS-REC-O FROM BUF-DTRANS
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE DTRANS * 910-PD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP
               END-IF.
128500
128600 920-CHECK-ACCOUNT.
128700     IF SAVE-ACCOUNT > "009999"
128800         MOVE "0000"              TO SAVE-DEPT
128900     ELSE
129000         IF SAVE-CORP-CODE = "NON-STR"
129100             NEXT SENTENCE
129200         ELSE
129300         IF SAVE-DEPT = SAVE-STR-DEPT
129400             IF MATL-ACCOUNT = SPACES
129500                 NEXT SENTENCE
129600             ELSE
129700                 MOVE MATL-ACCOUNT  TO SAVE-ACCOUNT.
129800
129900 920-CHECK-CLASS.
130000     MOVE CSIS-SAVE-CLASS         TO CLASS-ARG.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-REC-I.
           READ MCLASS-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
130800     IF FILE-STATUS = "00"
130900         MOVE CSIS-SAVE-CLASS     TO TRANS-CLASS
131000     ELSE
131100*********IF FILE-STATUS = "10" OR "14" OR "46"   *REPLACED*
               IF FILE-STATUS = "23"
131200             MOVE "Y"             TO CLASS-ERR-SW
131300             MOVE "000"           TO TRANS-CLASS
131400         ELSE
131500             MOVE "READ MCLASS * 920-CC" TO BU-DISPLAY-MSG
131600             MOVE CLASS-ARG    TO BU-DISPLAY-FLD (4)
                   MOVE FILE-STATUS  TO BU-DISPLAY-FLD (5)
131700             PERFORM 990-BLOWUP.
131800
131900 920-CHECK-DEPT.
132000     MOVE SAVE-DEPT               TO DEPT-ARG.
           MOVE DEPT-ARG TO DEPT OF MCHTACCTS-REC-I.
           READ MCHTACCTS-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
132800     IF FILE-STATUS = "00"
132900         MOVE SAVE-DEPT           TO TRANS-DEPT
133000     ELSE
133200         MOVE "Y"                 TO DEPT-ERR-SW
133300         MOVE "0000"              TO TRANS-DEPT.
133900
134100 799-CREATE-EXIT.
134200     EXIT.
134300
134400
134500 900-ERROR SECTION.
134600
134700 990-BLOWUP.
134800     MOVE "TCOMPRCV"              TO  BU-PGM-NAME.
134900     CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
135000         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
135100             BU-DISPLAY-FLDS.
135200
       1000-OPEN-FILES.
           OPEN I-O    DTRANS-O
                       MATLACUM-O
                INPUT  DPOITEM-I
                       MSTORERM-I
                       DPORECD-I
                       MCLASS-I
                       MACTINFO-I
                       MPLTINFO-I
                       DPORECD-I
                       MCHTACCTS-I.
135300
135400 1000-CLOSE-FILES.
135500     CLOSE DTRANS-O
                 MATLACUM-O
                 DPOITEM-I
                 MSTORERM-I
                 DPORECD-I
                 MCLASS-I
                 MACTINFO-I
                 MPLTINFO-I
                 DPORECD-I
                 MCHTACCTS-I
                 ONLINE-PRT.
