000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TCOMPARE.
000400 AUTHOR.              ANDREW T LEPERA.
000500 DATE-WRITTEN.        FEB 1,1979.
000600 DATE-COMPILED.
000700 INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800 SECURITY.
000900*REMARKS.
001000*      THIS PROGRAM ABSTRACTS FIELDS OFF THE HP DATABASE
001100*        FOR COMPARISON TO THOSE ON THE IBM DATABASE.
001200*
001300*      ON APRIL 21, 1982
001400*          ADD A HEADER TRANSACTION (TC '003') MODIFIED RCD-CTR TO
001500*          INCLUDE BOTH THE HEADER AND TRAILER RECORDS IN THE COUNT
001600*              KURT MOVSESIAN.
001700*
001800*      ON JUNE 15,1983
001900*          ADD LOGIC TO HANDLE AKRON MIX CTR PLT INDICATOR OR "11M".
002000*          IBM SYSTEM DOES NOT RECOGNIZE THIS PLT,THUS "111" MUST
002100*          BE SUBSTITUTED.   ALSO, MIX CTR DATABASE CONTAINS CODES
002200*          FOR RECORDS ONLY. THE ONLY NECESSARY ONES ARE THE RAW
002300*          MATERIALS "26" & "27" - THUS THE ONLY CODES SENT TO
002400*          THE IBM ARE UNDER "28".   ATL.
002500*
002600*    ON DECEMBER 10, 1984, CHANGED PROGRAM TO DISPLAY ERROR MESSAGE
002700*    TO $STDLIST, RATHER THAN CONSOLE, IF A DBOPEN ERROR OCCURS.
002800*    ALSO CHANGED DATABASE MODE TO READ-ACCESS-ONLY (MODE 5).
002900*    THIS IS SO THE PROGRAM CAN BE RUN FROM "CUMBER.CME" (HOME GROUP
003000*    "KELLY" RATHER THAN "DB") - WITHOUT GETTING A SECURITY
003100*    VIOLATION.  THIS IS FOR SEND COMPARES TO THE KELLY PLANTS.
003200*    CIH.
003300*
003400*    ON JANUARY 12, 1987 - ADDED COPYLIB FOR ALL DATABASE BUFFERS
003500*    AND FOR THE OUTPUT RECORD FORMAT.      D.A. PLUM.
      *
      *    ON MAY 28, 1993 - CONVERTED THIS PROGRAM FROM THE HP3000 TO
      *    THE AS400.                             J.S. BUNGO.
      *C
      *C   28FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   SEPT 16, 1996    CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
003700 ENVIRONMENT DIVISION.
003800 CONFIGURATION SECTION.
003900 SOURCE-COMPUTER.  HP-3000.
004000 OBJECT-COMPUTER.  HP-3000.
004100 SPECIAL-NAMES.  C01 IS NEW-PAGE.
004300
004400 INPUT-OUTPUT SECTION.
004500 FILE-CONTROL.
004600      SELECT COMPARE-FILE
                   ASSIGN TO DATABASE-FCOMPARE
                   ORGANIZATION IS RELATIVE
                   ACCESS IS RANDOM
                   RELATIVE KEY IS ACT-KEY
                   FILE STATUS IS FILE-STATUS.
004700
            SELECT MPLTINFO
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

            SELECT MSTORERM
                   ASSIGN TO DATABASE-MCFLCS0201
                   ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

004800 DATA DIVISION.
004900 FILE SECTION.
005000
005100 FD  COMPARE-FILE
           LABEL RECORDS ARE OMITTED
005200     RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS COMPARE-RCD.
005300 01  COMPARE-RCD.
005400     05  FILLER                 PIC X(80).
005500
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

005600 WORKING-STORAGE SECTION.
005700
005800 77  TERM-NAME                  PIC X(16)  VALUE SPACES.
005900 77  EOF-SW                     PIC X(1)   VALUE "N".
006000 77  RCD-CTR                    PIC 9(6)   VALUE ZEROS.
       77  FILE-STATUS                PIC X(2).
       77  ACT-KEY                    PIC 9(9).
       77  MCXCBLERR-SCOPE            PIC X(1)  VALUE "C".
006100
006200*****************************************************************
006300**                                                             **
006400**           S U B P R O G R A M   A R E A S                   **
006500**                                                             **
006600*****************************************************************
       COPY CCRTFILE   IN COPYLIB.
006700 COPY TBLOWUP    IN COPYLIB.
006800 COPY SONORDER   IN COPYLIB.
006900
007000 01  DATE-WORKAREA.
007100     05  UNEDITED-DATE.
007200      07  YY       PIC X(2).
007300      07  MM       PIC X(2).
007400      07  DD       PIC X(2).
007500     05  EDITED-DATE.
007600      07  ED-MM    PIC X(2).
007700      07  FILLER   PIC X(1).
007800      07  ED-DD    PIC X(2).
007900      07  FILLER   PIC X(1).
008000      07  ED-YY    PIC X(2).
008100
008200 01  RCD-COUNT-TC.
008300     05  R-C-DATE               PIC X(6)  VALUE SPACES.
008400     05  R-C-TIME               PIC X(6)  VALUE SPACES.
008500     05  R-C-TC                 PIC X(3)  VALUE SPACES.
008600     05  R-C-PLT                PIC X(3)  VALUE SPACES.
008700     05  R-C-900.
008800         10  R-C-CNTR           PIC 9(6)  VALUE ZEROS.
008900
009000 COPY DATAB    IN COPYLIB.
009100
009200 01  ARG-VALUES.
009300     05  CODE-ARG               PIC X(8)   VALUE SPACES.
009400     05  PLT-ARG                PIC X(4)   VALUE "P 01".
009500
009600 01  ITEM-LISTINGS.
009700     05  ALL-ITEM-LIST          PIC X(2)   VALUE "@;".
009800     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
009900
010000 01  DSET-NAMES.
010100     05  DSET-NAME              PIC X(16)  VALUE SPACES.
010200     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
010300     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
010400
010500 COPY MPLTINFO IN COPYLIB.
010800 COPY MSTORERM IN COPYLIB.
010900
011000 COPY DDAILYTC IN COPYLIB.
011100 COPY TC300    IN COPYLIB.
011200 COPY TC301    IN COPYLIB.
       COPY VCOMAREA IN COPYLIB.
011300
011400 PROCEDURE DIVISION.
011600 HOUSEKEEPING.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN INPUT  MPLTINFO
                       MSTORERM.
012200
           MOVE ZEROS TO ACT-KEY.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO ERROR" TO BU-DISPLAY-MSG
               MOVE PLT-ARG TO BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.
012800
012900     IF MPLTINFO-COMPANY = "11M"
013000         MOVE "111"                  TO   DDAILYTC-PLT
013100     ELSE
013200         MOVE MPLTINFO-COMPANY       TO   DDAILYTC-PLT.

      *--- CREATE FCOMPARE OUTPUT FILE.
           MOVE "*LIBL"    TO CCRTFILE-LIBRARY.
           MOVE "FCOMPARE" TO CCRTFILE-FILE.
           MOVE "0080"     TO CCRTFILE-RECORD-LENGTH.
           MOVE "20000"    TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"       TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                 CCRTFILE-FILE
                                 CCRTFILE-RECORD-LENGTH
                                 CCRTFILE-NO-RECORDS
                                 CCRTFILE-INCREMENT-AMT
                                 CCRTFILE-NO-INCREMENTS
                                 CCRTFILE-STATUS.
013400     OPEN OUTPUT COMPARE-FILE.
013300
           OPEN INPUT  MPLTINFO
                       MSTORERM.
013500
013600*****************************************
013700**  WRITE HEADER REC (TC '003')
013800*****************************************
013900
014000     ACCEPT UNEDITED-DATE FROM DATE.
014400     MOVE UNEDITED-DATE   TO  R-C-DATE.
014500     ACCEPT R-C-TIME FROM TIME.
014600     MOVE MPLTINFO-COMPANY   TO  R-C-PLT.
014700     MOVE "003"           TO  R-C-TC.
014800     MOVE SPACES          TO  R-C-900.
           ADD 1 TO ACT-KEY.
014900     WRITE COMPARE-RCD FROM RCD-COUNT-TC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "FCOMPARE WRITE ERROR1" TO BU-DISPLAY-MSG
               MOVE ACT-KEY TO BU-DISPLAY-FLD (1)
               PERFORM 999-BLOWUP.
015000     ADD 1                TO  RCD-CTR.
015100
015200     PERFORM 6-MAIN    THRU    6-MAIN-X.
015300
015700 2-STOP-RUN.
015800     CLOSE COMPARE-FILE
                 MPLTINFO
                 MSTORERM.
015900     GOBACK.
016000
016100 6-MAIN.
016200
016300*** SERIAL GET THRU MSTORERM FOR CODES
016400
           READ MSTORERM NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
017100         IF FILE-STATUS = "10" OR "14" OR "46"
017200             MOVE "900"         TO R-C-TC
017300             ADD  1             TO RCD-CTR
017400             MOVE RCD-CTR       TO R-C-CNTR
                   ADD 1 TO ACT-KEY
017500             WRITE COMPARE-RCD FROM RCD-COUNT-TC
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-WRITE
                   IF FILE-STATUS NOT = "00"
                     MOVE "FCOMPARE WRITE ERROR2" TO BU-DISPLAY-MSG
                     MOVE ACT-KEY TO BU-DISPLAY-FLD (1)
                     PERFORM 999-BLOWUP
                   END-IF
017600             GO TO 6-MAIN-X
017700         ELSE
                   MOVE "READ MSTORERM ERROR" TO BU-DISPLAY-MSG
017800             PERFORM 999-BLOWUP.
017900
018000     IF MPLTINFO-COMPANY = "11M"
018100       IF CORP-CODE > "28      "
018200         GO TO 6-MAIN
018300       ELSE
018400         IF CORP-CODE < "26      "
018500           GO TO 6-MAIN.
018600
018700*------- CODE 'NON-STR' IS A DUMMY CODE FOR NON-CODED PO DETAIL
018800*------- SEGMENTS.  DON'T SEND A COMPARE RECORD FOR IT.
018900     IF CORP-CODE = "NON-STR"
019000         GO TO 6-MAIN.
019100
019200     ACCEPT UNEDITED-DATE FROM DATE.
019600     MOVE UNEDITED-DATE      TO  DDAILYTC-DATE.
019700
           ACCEPT DDAILYTC-TIME FROM TIME.
019900
020000     MOVE "300"              TO  DDAILYTC-TC.
020100     MOVE SPACES             TO  BUF-TC300.
020200     MOVE CORP-CODE          TO  TC300-CORP-CODE.
020300     MOVE STR-PREV-CODE      TO  TC300-LOCAL-CODE.
020400     MOVE STR-UM             TO  TC300-UM.
020500     MOVE STR-ONHAND         TO  TC300-ONHAND.
020600*------- ONORDER IS NO LONGER STORED IN MSTORERM, MUST
020700*------- BE CALCUATED USING THIS SUBPROGRAM
020800     CALL "SONORDER" USING BASE, CORP-CODE, SONORDER-PARMS,
020900       MPLTINFO-COMPANY, STATUS-AREA, BU-DISPLAY-MSG,
021000       BU-DISPLAY-FLDS.
021100     IF BU-DISPLAY-MSG-1 NOT = SPACES
021200         DISPLAY "******** SONORDER ERROR FOR CODE ", CORP-CODE
021300         DISPLAY BU-DISPLAY-MSG
021400         MOVE SPACES               TO   BU-DISPLAY-MSG.
021500     MOVE SONORDER-TOTAL-ONORDER TO TC300-ONORDER.
021600
021700     IF STR-AVG-COST IS GREATER THAN +999999.9999
021800         MOVE +999999.9999   TO  TC300-AVG-COST
021900     ELSE
022000         MOVE STR-AVG-COST   TO  TC300-AVG-COST.
022100
022200     MOVE ST-CLASS           TO  TC300-CLASS.
022300     MOVE STR-STATUS-AREA    TO  TC300-STATUS-AREA.
022400
           ADD 1 TO ACT-KEY.
022500     WRITE COMPARE-RCD      FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "FCOMPARE WRITE ERROR3" TO BU-DISPLAY-MSG
              MOVE ACT-KEY TO BU-DISPLAY-FLD (1)
              PERFORM 999-BLOWUP
           END-IF.
022600     ADD 1 TO RCD-CTR.
022700
022800     MOVE "301"              TO  DDAILYTC-TC.
022900     MOVE SPACES             TO  BUF-TC301.
023000     MOVE CORP-CODE          TO  TC301-CORP-CODE.
023100     MOVE STR-DFLT-DEPT      TO  TC301-DFLT-DEPT.
023200     MOVE STR-EXPEDITE       TO  TC301-EXPEDITE.
023300     MOVE STR-MAX            TO  TC301-MAX.
023400     MOVE STR-REORDER        TO  TC301-REORDER.
023500     MOVE STR-UM1            TO  TC301-UM1.
023600     MOVE STR-UM1-CF         TO  TC301-UM1-CF.
023700     MOVE STR-UM2            TO  TC301-UM2.
023800     MOVE STR-UM2-CF         TO  TC301-UM2-CF.
023900
           ADD 1 TO ACT-KEY.
024000     WRITE COMPARE-RCD      FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "FCOMPARE WRITE ERROR4" TO BU-DISPLAY-MSG
              MOVE ACT-KEY TO BU-DISPLAY-FLD (1)
              PERFORM 999-BLOWUP
           END-IF.
024100     ADD 1 TO RCD-CTR.
024200
024300     GO TO 6-MAIN.
024400
024500 6-MAIN-X.
024600     EXIT.
024700
024800 999-BLOWUP.
           MOVE "TCOMPARE" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
                                VIEW-COMAREA FILE-STATUS
                                BU-DISPLAY-MSG BU-DISPLAY-FLDS.
