       IDENTIFICATION DIVISION.
       PROGRAM-ID. TCONTUPD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                         PIC X(2000).
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       77  YEAR-DSP                       PIC X.
       01  BLOWUP-BASE                    PIC X(16).
       01  BUFFER.
           05  BUFFERA.
               10  WO-NUMBER.
                   15  WO-NUMBER6.
                       20  WO-NUMBER-1    PIC X.
                       20  FILLER         PIC X(5).
                   15  WO-NUMBER7         PIC X.
                   15  WO-NUM-SUFFIX      PIC XXX.
           05  BUFFER-CMD-ERR.
               10  BUFFER-CMD-LINE        PIC X(79).
               10  BUFFER-MSG-LINE        PIC X(79).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
       01  DATE-WORK-AREA.
           05  FILLER                     PIC X.
           05  DWY-2                      PIC X.
           05  FILLER                     PIC X(4).
       01  EDIT-ERROR                     PIC X(80).
       01  ERROR-BUFFER.
           05  ERROR-LITERAL.
               10  FILLER                 PIC X(30).
               10  WO-1-10                PIC X(10).
               10  FILLER                 PIC X(40).
       01  FILE-STATUSES.
           05  DSPLY-STATUS               PIC XX.
           05  PF-STATUS                  PIC XX.
           05  WPF-STATUS                 PIC XX.
       01  INPUT-SCREEN1.
           05  INPUT-IDENTITY             PIC X(4).
           05  INPUT-CMD-LINE             PIC X(79).
           05  INPUT-MSG-LINE             PIC X(79).
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA OF COPYLIB.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TCONTUPD".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
                   " CONTINUOUS W/O UPDATE EXECUTIVE PROGRAM  "        .
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.
       01  PER-PERSONNEL-DATA. COPY MPERSONL OF COPYLIB.
       01  RETURN-CODE                    PIC X.
       COPY DBSTAT  IN COPYLIB.
       01  TRUE-VAL                       PIC 1 VALUE B"1".
       COPY TBLOWUP IN COPYLIB.
       01  WO-NUMBER-BUF                  PIC X(10).
       01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       01  ERROR-SWITCH.
           05  ERR-SW                     PIC S9(4) COMP.
       COPY VCOMLINK OF COPYLIB.
       PROCEDURE DIVISION USING DBPARAMETERS ERROR-SWITCH
                            VIEW-COMAREA.
       BEGIN-PROCESSING.
           PERFORM 1-HSK THRU 11-GWAP-EXIT.
      **************************************************************
      *     THE PARAGRAPHS 1-HSK THRU 11-GET-WO-ASKED4 ARE THE     *
      *        HOUSECLEANING AND SCREEN INITIATION ROUTINE THAT    *
      *        ASKS THE USER FOR THE WORK ORDER THAT REQUIRES      *
      *        MODIFICATION.                                       *
      *        THE WORK ORDER MAY BE ENTERED IN ITS ENTIRETY OR    *
      *        IT MAY BE ENTERED LEFT JUSTIFIED IN THE SPACES      *
      *        PROVIDED AND THE PROGRAM "ALWONO" WILL SHIFT IT     *
      *        INTO THE PROPER POSITIONS.                          *
      **************************************************************
           PERFORM 6-MAIN.
      **************************************************************
      *     THE PARAGRAPH 6-MAIN IS EXECUTED CONTINUOUSLY UNTIL    *
      *        THE USER WISHES TO EITHER CHANGE THE WORK ORDER     *
      *        NUMBER (PRESSES THE F7 FUNCTION KEY) OR TO EXIT     *
      *        THE PROGRAM (PRESSES THE F8 FUNCTION KEY).          *
      **************************************************************
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PERSONNEL-FILE.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PERSONNEL-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
      ***************************************************************
      *    JCWVALUE = 1 PERMITS ACCESS TO ENGINEER/VERBAL W/O'S     *
      *    JCWVALUE = 2 PERMITS ACCESS TO PLANNER/VERBAL  W/O'S     *
      *    JCWVALUE = 3 PERMITS ACCESS TO ALL TYPE        W/O'S     *
      *    JCWVALUE = 4 PERMITS ACCESS TO ONLY VERBAL     W/O'S     *
      ***************************************************************
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           ACCEPT DATE-WORK-AREA FROM DATE.
           IF DWY-2 = "0" MOVE "A" TO YEAR-DSP
           ELSE
           IF DWY-2 = "1" MOVE "B" TO YEAR-DSP
           ELSE
           IF DWY-2 = "2" MOVE "C" TO YEAR-DSP
           ELSE
           IF DWY-2 = "3" MOVE "D" TO YEAR-DSP
           ELSE
           IF DWY-2 = "4" MOVE "E" TO YEAR-DSP
           ELSE
           IF DWY-2 = "5" MOVE "F" TO YEAR-DSP
           ELSE
           IF DWY-2 = "6" MOVE "G" TO YEAR-DSP
           ELSE
           IF DWY-2 = "7" MOVE "H" TO YEAR-DSP
           ELSE
           IF DWY-2 = "8" MOVE "J" TO YEAR-DSP
           ELSE
           IF DWY-2 = "9" MOVE "K" TO YEAR-DSP
           ELSE
           GO TO 2-EOJ.
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR.
       10-SET-IDENTIFIER.
           IF JCW-MJCW-260 = 1 OR 2
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO ENG-PL-SCHD-ID
           GO TO 11-GET-WO-ASKED4-PARA.
           IF ENG-PL-SCHD-ID NOT = SPACES GO TO 11-GET-WO-ASKED4-PARA.
           IF EDIT-ERROR = SPACES
               MOVE "FMODIFID" TO VIEW-CFNAME
               MOVE 52011 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO INPUT-CMD-LINE
               MOVE INPUT-SCREEN1 TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
               MOVE DSPLY-REC TO INPUT-SCREEN1
           ELSE
           MOVE "FMODIFID" TO VIEW-CFNAME
           MOVE 52011 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO INPUT-CMD-LINE
           MOVE EDIT-ERROR TO INPUT-MSG-LINE
           MOVE INPUT-SCREEN1 TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           PERFORM 98-SCREEN-READ
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
           MOVE DSPLY-REC TO INPUT-SCREEN1.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
           IF INPUT-IDENTITY = "    "
               MOVE 40073 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
               GO TO 10-SET-IDENTIFIER.
           MOVE 0 TO COND-WORD.
           MOVE INPUT-IDENTITY TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 42122 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
               GO TO 10-SET-IDENTIFIER.
       11-GET-WO-ASKED4-PARA.
           MOVE "FCONTUPD" TO VIEW-CFNAME.
           MOVE SPACES TO BUFFER.
           MOVE YEAR-DSP TO WO-NUMBER7.
           MOVE EDIT-ERROR TO BUFFER-MSG-LINE.
           MOVE 52011 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO BUFFER-CMD-LINE.
           MOVE BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
           MOVE DSPLY-REC TO BUFFER.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
           CALL "TALWONO" USING WO-NUMBER RETURN-CODE.
           IF RETURN-CODE = "1"
               MOVE "0" TO RETURN-CODE
               MOVE 47004 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WO-NUMBER TO WO-1-10
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 11-GET-WO-ASKED4-PARA.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 47004 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WO-NUMBER TO WO-1-10
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 11-GET-WO-ASKED4-PARA.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 47004 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WO-NUMBER TO WO-1-10
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 11-GET-WO-ASKED4-PARA.
           IF WO-CURRENT-TYPE = "E"
               IF JCW-MJCW-260 = 2
                    MOVE "FEAUTMSG" TO VIEW-CFNAME
                    PERFORM 99-SCREEN-WRITE
                    PERFORM 98-SCREEN-READ
                    MOVE 0 TO VIEW-LASTKEY
                    GO TO 11-GET-WO-ASKED4-PARA.
           IF WO-CURRENT-TYPE = "P"
               IF JCW-MJCW-260 = 1
                    MOVE "FPAUTMSG" TO VIEW-CFNAME
                    PERFORM 99-SCREEN-WRITE
                    PERFORM 98-SCREEN-READ
                    MOVE 0 TO VIEW-LASTKEY
                    GO TO 11-GET-WO-ASKED4-PARA.
           IF WO-STATUS-P = "DW" OR "FF"
               MOVE 49047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 11-GET-WO-ASKED4-PARA.
      *************************************************************************
      *    LOGIC BELOW WAS ASTERISKED OUT 5-14-87 UNTIL SUCH TIME AS WE CAN   *
      *    OR WANT TO RESTRICT USERS FROM ACCESSING W/O'S THAT THEY ARE NOT   *
      *    ASSIGNED TO IN ACCORD WITH THE PLANNER OR ENGINEER FIELD ON W/O    *
      *************************************************************************
      *    IF JCW-MJCW-260 = 1
      *        IF INPUT-IDENTITY = ENGINEER
      *            NEXT SENTENCE
      *        ELSE
      *        MOVE 51002 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE ERROR-BUFFER TO EDIT-ERROR
      *        MOVE TRUE-VAL TO INDS (99)
      *        GO TO 11-GET-WO-ASKED4-PARA.
      *    ELSE
      *    IF JCW-MJCW-260 = 2
      *        IF INPUT-IDENTITY = PLANNER
      *            NEXT SENTENCE
      *        ELSE
      *        MOVE 51003 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE ERROR-BUFFER TO EDIT-ERROR
      *        MOVE TRUE-VAL TO INDS (99)
      *        GO TO 11-GET-WO-ASKED4-PARA.
       11-GWAP-EXIT.    EXIT.
       6-MAIN.
           CALL "TMODWORK" USING DBPARAMETERS WO-NUMBER
                             VIEW-COMAREA
           IF VIEW-LASTKEY = 0
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 1 OR 3
               GO TO 2-EOJ
           ELSE
           IF VIEW-LASTKEY = 2
               PERFORM 11-GET-WO-ASKED4-PARA THRU 11-GWAP-EXIT
               GO TO 6-MAIN
           ELSE
           IF VIEW-LASTKEY = 5
               MOVE INPUT-IDENTITY TO ENG-PL-SCHD-ID
               CALL "TMODMATL" USING DBPARAMETERS WO-NUMBER
                                 VIEW-COMAREA
               IF VIEW-LASTKEY = 1
                   GO TO 2-EOJ
               ELSE
               GO TO 6-MAIN
           ELSE
           IF VIEW-LASTKEY = 7
               CALL "TMODLABR" USING DBPARAMETERS WO-NUMBER
                                 VIEW-COMAREA
               MOVE 0 TO VIEW-LASTKEY
               GO TO 6-MAIN
           ELSE
           IF VIEW-LASTKEY = 8
               CALL "TJOBPLAN" USING DBPARAMETERS WO-NUMBER
                                 VIEW-COMAREA
               IF VIEW-LASTKEY = 1
                   GO TO 2-EOJ
               ELSE
               GO TO 6-MAIN
           ELSE
           GO TO 6-MAIN.
           MOVE 0 TO VIEW-LASTKEY.
           IF WO-NUM-SUFF-P = "000"
               GO TO 2-EOJ.
           IF WO-START-STATUS = "AA" OR "AR"
               NEXT SENTENCE
           ELSE
           CALL "TJOBPLAN" USING DBPARAMETERS WO-NUMBER
                             VIEW-COMAREA
               IF VIEW-LASTKEY = 1
                   GO TO 2-EOJ
               ELSE
               MOVE 0 TO VIEW-LASTKEY.
           MOVE INPUT-IDENTITY TO ENG-PL-SCHD-ID.
           CALL "TMODMATL" USING DBPARAMETERS WO-NUMBER
                             VIEW-COMAREA.
           IF VIEW-LASTKEY = 1 GO TO 2-EOJ.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           MOVE SPACES TO BUFFER-CMD-ERR.
           MOVE BUFFER-CMD-ERR TO DSPLY-REC.
           MOVE "FCONTDEC" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY NOT = 1
               NEXT SENTENCE
           ELSE
           MOVE "88" TO ERROR-SWITCH
           CALL "TPRINTWS" USING DBPARAMETERS WO-PLANNED-DATA
                             ERROR-SWITCH VIEW-COMAREA
           MOVE 0 TO ERR-SW.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       998-BLOWUP.
           MOVE "TCONTUPD" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
