000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TCORITM.
000400 AUTHOR.              ANDREW T LEPERA.
000500 DATE-WRITTEN.        DEC 12,1978.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*    PROCESSING OUTLINE.
001100*    1.  THE SCREEN REQUESTS ALL THE DATA NEEDED TO MODIFY THE
001200*        RECEIPT INTO STOREROOM.
001300*    2.  ALL THE DATA IS VERIFIED.
001400*    3.  A PRINTOUT OF THE RECEIPTS INTO STOREROOM IS WRITTEN.
001500*    4.  DATABASE UPDATED AS FOLLOWS:
001600*        -DPOITEM (RECEIVER ENTRY)-QTY STORED, DATE (IF BLANK).
001700*        -DPOITEM (ACCUMULATOR)   -QTY STORED.
001800*        -MSTORERM  --  ONHAND, INDIVIDUAL ONHAND, ACTIVITY DATE.
001900*        -DDAILYTC  --  A 325 RECORD FOR EACH ITEM.
002000*
002100*   THE FOLLOWING CHANGES WERE MADE ON NOVEMBER 2, 1981.
002200*        1.  STR-PADDING WAS DIVIDED INTO TWO ITEMS, AND
002300*            A FILLER OF PIC X(100) WAS ADDED AFTER BUF-
002400*            MSTORERM.
002500*        2.  A PROMPT FOR PRINTER LOCATION WAS ADDED TO
002600*            THE SCREEN FOR DATA-ENTRY. (MPLTINFO WAS ADDED).
002700*        3.  CHANGED AN INCORRECT MESSAGE CONCERNING
002800*            ADJUSTED QUANTITY BEING BELOW ZERO.
002900*            LYNN M. BUNN
003000*
003100*   ON DECEMBER 8, 1981, THE FOLLOWING PRINT LOCATIONS
003200*   WERE ADDED;
003300*            PRT-LOC                 PRINTER-NUM
003400*              IP (INTERPLANT)           14
003500*              01                        13
003600*
003700*
003800*   ON JANUARY 5, 1982, A PRINT LOCATION WAS ADDED FOR UNION CITY.
003900*     STORES01 FOR U.C. WILL GO TO PRINTER-NUMBER 3.  LMB
004000*
004100*
004200*   ON FEBRUARY 2, 1982, THE STORES01 PRINT LOCATION FOR UNION CITY
004300*     WAS CHANGED TO MATCONT (TO GO TO PRINTER-NUM 10) LMB
004400*
004500*   ON JULY 7, 1982, SEVERAL CHANGES WERE MADE.  THE SCREEN WAS
004600*     TAKEN OUT OF DEL AND PUT INTO THE PROGRAM LOGIC.  THE
004700*     DATABASE BUFFERS WERE UPDATED.  ADDED PRINT LOCATIONS FOR
004800*     THE ADDITIONAL AKRON PLANTS.  ADDED INSTRUCTIONS TO THE
004900*     SCREEN.  LMB.
005000*
005100*   ON AUGUST 30, 1982, ADDED PLANTS 112 AND 113 TO THE "IF STATE-
005200*     MENTS" FOR THE PRINT LOCATIONS.   LMB.
005300*
005400*    ON JANUARY 24, 1983, MADE A FIX TO ACCOMODATE FAYETTE-
005500*      VILLE'S 5 BTYE RECEIVING SLIP.  ALSO ADDED AN ERROR
005600*      MESSAGE IF THE QUANTITY STORED IS GREATER THAN THE
005700*      QUANTITY DELIVERED.  LMB.
005800*
005900*    IN FEBRUARY, 1983, CHANGED PRT-LOC STUFF.  INSTEAD OF ENTERING
006000*    A MNEMONIC PRT-LOC SUCH AS "IP" OR "M4", THE USER WILL SIMPLY
006100*    ENTER THE SPOOLER NUMBRER.  IF LEFT BLANK, WILL DEFAULT TO
006200*    STOREROOM (08).  THIS WILL END THE NEED TO CHANGE PRT-LOCS
006300*    WHICH ARE HARD-CODED INTO THE PROGRAM. CIH.
006400*
006500*    ON FEBRUARY 4, 1983, ADDED A CHECK TO MAKE SURE THE REC-
006600*    EIVING SLIP NUMBER IS ENTERED. (AKRON EXECUTED THIS PRO-
006700*    GRAM WITH THE PURCHASE ORDER NUMBER).  LMB.
006800*
006900*    ON MARCH 10, 1983, CHANGED THE MPORCV STATUS TO FOUR BYTES.
007000*    LMB.
007100*
007200*    ON AUGUST 22, 1984, ADDED INPUT CHECK.  IF ITEM IS A
007300*    DIRECT DELIVERY, MODIFICATION WILL NOT BE ALLOWED.  -VWD
007400*
007500*    ON JANUARY 4, 1985, MADE THE FOLLOWING CHANGES:
007600*      1. CONVERTED TO "VIEW"
007700*      2. ADDED CALLS TO "TTERMTYP" TO DETERMINE TERMINAL
007800*         TYPE, "TSHWRDFM" TO HANDLE FUNTION KEYS, "TUMCF"
007900*         TO DO UNIT OF MEASURE CONVERSIONS, AND "TBLOWUP"
008000*         TO HANDLE FATAL ERROR CONDITIONS.
008100*      3. FIXED SOME ERRORS IN HANDLING OF UNIT OF
008200*         MEASURE CONVERSIONS (OLD VERSION ENDED UP WITH
008300*         A NEGATIVE QUANTITY STORED IF CERTAIN DATA WAS
008400*         ENTERED).
008500*      4. ADDED THE RECEIVING SLIP INQUIRY (f1) AND MATERIAL
008600*         STATUS INQUIRY (f2) TO THE PROGRAM.  THESE ARE CALLS
008700*         TO "TMTLSTAT" AND "SINQRSI".
008800*     CIH.
008900*
009000*    ON JANUARY 7, 1985, MADE THE FOLLOWING CHANGES:
009100*      1. ADDED ROUTINE TO GET THE PO PRICE, AND PUT IT IN THE
009200*         325 TRANSACTION, IN ORDER TO BE CONSISTENT WITH THE
009300*         RECEIPT INTO STOREROOM PROGRAM.
009400*      2. ADDED A "CORRECTION INDICATOR" FIELD TO THE 325
009500*         TRANSACTION.  IF THIS FIELD IS A 'C', THAT IDENTIFIES
009600*         THE TRANSACTION AS A CORRECTION, RATHER THAN A NORMAL
009700*         RECEIPT INTO THE STOREROOM.
009800*
009900*
010000*    ON JANUARY 21, 1985, ADDED A DUMMY PARAMETER TO THE CALL
010100*    OF THE SUBPROGRAM "TMTLSTAT" - MATERIAL STATUS INQUIRY.
010200*    THIS IS A DUMMY CORPORATE CODE PARAMETER - USED BY PROGRAMS
010300*    THAT MAY PASS THE CORP CODE TO THE INQUIRY, THUS BYPASSING
010400*    THE CORPORATE CODE ENTRY SCREEN.  IF THE PASSED CODE IS SPACES,
010500*    THE CODE ENTRY SCREEN IS BROUGHT, AND THE CODE PARAMETER IS
010600*    IGNORED.  CIH.
010700*
010800*    ON APRIL 24, 1985; ADDED TDATECHK ROUTINE TO GET CORRECT
010900*                 US/EUROPEAN DATE FORMATS.  -B. WINTER.
011000*
011100*    ON JULY 28, 1985, TCORITM WAS MODIFIED TO DISALLOW A
011200*    MODIFIED RECEIPT IF AN ITEM ON THAT RECIEPT IS FROZEN FOR
011300*    INVENTORY.
011400*
011500*    ON OCTOBER 7, 1985 - UPDATED THE RECEIVING SLIP INQUIRY IN
011600*    THIS PROGRAM TO CALL THE CURRENT VERSION AND TO USE THE
011700*    FORMFILE FROM THE INQUIRY INSTEAD OF AN OLD VERSION THAT
011800*    WAS COMPILED WITH THIS PROGRAM.  - BARBARA WINTER.
011900*
012000*   10/ 7/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND *
012100*             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE     *
012200*             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND *
012300*             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.    *
012400*             CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,*
012500*             TDATECHK TO TDATECK2.                          *
012600*             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE    *
012700*             SUPPORT VERSIONS OF THESE SUBROUTINES.         *
012800*                                    PD RAGLOW               *
012900**************************************************************
      *C 09/19/94  JEFF BUNGO
      *C   WRITE TRANSACTION 341 IF AN ITEM HAD A CHAT NUMBER
      *C   ASSIGNED TO IT.  THE TC 341 WILL BE PASSED TO THE
      *C   CHESS CORPORATE SYSTEM.
      *C
      *C 08/16/95  JEFF BUNGO
      *C   ALLOW KELLY ONLY USERS TO ENTER A PRAPS NUMBER INSTEAD
      *C   OF A CSIS RECEIVING SLIP NUMBER.  IF BOTH ARE ENTERED,
      *C   THE PRAPS NUMBER TAKES PRECEDENCE.  INDICATOR 88 CONTROLS
      *C   WHETHER OR NOT THE LITERALS AND PRAPS VALUE ARE DISPLAYED
      *C   ON THE SCREEN TO THE USER (SET TO ON FOR KELLY).
      *C
      *C 06/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR STOREROOM ACTIVITY DATE
      *C   AND RECEIVING SLIP ITEM STORED DATE.
      *C
      *C SEPTEMBER 3, 1997  JEFF BUNGO
      *C      IF STORES RECEIPTS INTERFACE WITH AN EXTERNAL
      *C      SYSTEM (APPLICATION) AND ALL MATERIAL IS TO BE
      *C      AUTOSTORED (BASED ON MPLTINFO KEY SRX), THEN
      *C      MARK CODE AS AUTO STORE AND DO NOT ALLOW BACK OFF
      *C      OF STORES RECEIPT WITH THIS PROGRAM.  ALSO CALL THE EXTERNAL
      *C      INTERFACE PROGRAM TO PASS THE DATA (RECEIVER,
      *C      ITEM NUMBER, CODE, QTY, UM, DATE, AND TIME).
      *C
      *C
      *C MARCH 30, 1998  JEFF BUNGO
      *C      IF CODE IS FRANCHISED OWNED AND VENDOR IS A FRANCHISE
      *C      VENDOR, THEN ONLY ALLOW ADJUSTMENT TO A FRANCHISE BIN
      *C      AND PLACE FRANCHISE ID IN THE 325 TC.


013200
013300 ENVIRONMENT DIVISION.
013400 CONFIGURATION SECTION.
013500 SOURCE-COMPUTER.  HP-3000.
013600 OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.
014000 INPUT-OUTPUT SECTION.
014100 FILE-CONTROL.
           SELECT MPORCV-PO-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-I
               ASSIGN TO DATABASE-MCFLCS0102
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-PO-O
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-PO-O
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-PO-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DT-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZCORITM-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.
014300
014400 DATA DIVISION.
014500 FILE SECTION.
014600
014700 FD  PRINT-FILE
014800     LABEL RECORDS ARE OMITTED
014900     RECORD CONTAINS 132 CHARACTERS
015000     DATA RECORD IS PRINT-REC.
015100 01  PRINT-REC.
015200     05  PRINT-LINE           PIC X(132).
015300
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPORCV-PO-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-O.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0102.

       FD  DRCVITEM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-PO-REC-O.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DPOITEM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-O.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  MSTORERM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-O.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPORECD-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DDAILYTC-DT-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-DT-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
015400 WORKING-STORAGE SECTION.
015500
015600 77  ADJUSTMENT-QTY-STR-UM      PIC S9(8)  VALUE ZEROS.
015700 77  ADJUSTMENT-QTY-RECEIPT-UM  PIC S9(11)V9(4) VALUE ZEROS.
015800 77  NEW-QTY-STORED             PIC S9(11)V9(4) VALUE 0.
015900 77  LINE-ADV                   PIC 99     VALUE ZEROS.
016000 77  SAVE-VIEW-LASTKEY          PIC S9(4) BINARY VALUE 0.
       77  HANDLE-BLOWUP-FLAG         PIC X  VALUE "Y".

       01  SAVE-EXTSYS                PIC X  VALUE "N".
       01  SAVE-EXTAUTO               PIC X  VALUE "N".

       01  AUTOSTORE-ITEM             PIC X    VALUE "N".
       01  ITEM-MAJOR-GROUP           PIC XX   VALUE SPACES.
       01  AUTOSTORE-TABLE.
           05  AUTOSTORE-AREA  OCCURS 4 TIMES INDEXED BY I.
               10  AUTOSTORE-MAJOR-GROUP  PIC XX.
               10  AUTOSTORE-INDICATOR    PIC X.

       01  FRAN-TABLE.
           05  FRAN-ENTRY OCCURS 4 TIMES INDEXED BY FRAN-IDX.
               10  FRAN-ID             PIC X(1).
               10  FRAN-NAME           PIC X(4).
               10  FRAN-VEN-CODE       PIC X(10).
       01  FRAN-FOUND                  PIC X(1) VALUE "N".
       01  FRAN-SUB                    PIC 9(1).
       01  FRAN-PO-ID                  PIC X(1) VALUE SPACES.
       01  FRAN-NAME-ID                PIC X(1) VALUE SPACES.
016100
       COPY FUNCTDEF IN COPYLIB.

016200 01  PO-RLSE-RS-WORK.
016300     05  PO-RLSE-RS.
016400         10  PO-INDIC           PIC X      VALUE "P".
016500         10  WS-PO              PIC X(7)   VALUE SPACES.
016600         10  WS-RLSE            PIC X(3)   VALUE SPACES.
016700         10  WS-RS              PIC X(3)   VALUE SPACES.
016800     05  DISPLAY-PO-RLSE-RS.
016900         10  DISP-PO            PIC X(7)   VALUE SPACES.
017000         10  FILLER             PIC X      VALUE "-".
017100         10  DISP-RLSE          PIC X(3)   VALUE SPACES.
017200         10  FILLER             PIC X      VALUE "-".
017300         10  DISP-RS            PIC X(3)   VALUE SPACES.
017400
017500**************************************************************
017600**                                                          **
017700**             E S C A P E   S E Q U E N C E S              **
017800**                                                          **
017900**************************************************************
018000
018100**************************************************************
018200**                                                          **
018300**            D A T E / T I M E   A R E A S                 **
018400**                                                          **
018500**************************************************************
018600
018700 01  ACTIVITY-DATE              PIC X(6).
018800 01  TRANS-TIME.
018900     05  HH                     PIC XX.
019000     05  MIN                    PIC XX.
019100     05  SS                     PIC XX.
019200
019300 COPY TDATECHK IN COPYLIB.
019400*************************************************************
019500**                                                          **
019600**          C O M M U N I C A T I O N S   A R E A S         **
019700**                                                          **
019800**************************************************************
019900
020000 COPY TBLOWUP  IN COPYLIB.
020100 01  RET-CODE                  PIC X(2)  VALUE "00".
020200
020300***  PARAMETERS FOR CALL TO THE "SLEMMER" SPOOLER
020400
020500 01  SPOOLER-AREA.
020600     05  SPOOL-STAT           PIC S9     VALUE ZEROS BINARY.
020700     05  SPOOL-PRT            PIC S9(2)  BINARY VALUE 8.
020800     05  SPOOL-COPIES         PIC S9(2)  VALUE 1 BINARY.
020900     05  SPOOL-PRIOR          PIC S9     VALUE ZEROS BINARY.
021000     05  SPOOL-MSG            PIC X(75)  VALUE  SPACES.
021100
021200 COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
021300 COPY TUMCF      IN COPYLIB.
       COPY CSWITCHF   IN COPYLIB.
       COPY OVRPFDAT   IN COPYLIB.
       COPY CCHKOBJ    IN COPYLIB.
021400
021500*---------- PARMS FOR CALL TO "SINQRSI" - RCV SLIP INQUIRY
021600
021700 01  ARGUMENT-VALUES.
021900     05  RS-ARG.
022000         07  FILLER             PIC X       VALUE SPACE.
022100         07  RS-WS              PIC X(13)   VALUE SPACES.
022200
022300*----------  PARAMETERS FOR ALL INQUIRY SUBROUTINES (TINQRSA,
022400*            SINQRSI, SINQFRT)
022500 01  SUBROUTINE-PARMS.
022600     05  PASS-LAST-RECEIVER    PIC 999   VALUE ZEROES.
022700     05  PASS-START-RECEIVER   PIC 999   VALUE ZEROES.
022800     05  PASS-PO               PIC X(14) VALUE SPACES.
022900     05  PASS-SPOOL            PIC S9(2) VALUE ZEROES BINARY.
023000     05  PASS-PLT-NUMBER       PIC X(3)  VALUE SPACES.
023100     05  PASS-NO-LEFT-OFF-AT   PIC 9(3)  VALUE ZEROES.
023200     05  PASS-INQUIRY          PIC X     VALUE SPACE.
023300     05  PASS-SAVE-LASTKEY     PIC S9(4) VALUE ZEROES BINARY.
           05  PASS-HISTORY-FLAG     PIC X     VALUE SPACES.
           05  PASS-ITEM             PIC 9(4)  VALUE ZEROS.
023400
024300*---------- DUMMY PARM FOR CALL TO "TMTLSTAT"
024400 01  DUMMY-CODE-PARM         PIC X(7)  VALUE SPACES.
024500
024600**************************************************************
024700**                                                          **
024800**                V I E W   W O R K                         **
024900**                                                          **
025000**************************************************************
025100
       COPY VCOMAREA IN COPYLIB.
025200
029900 01  MESSAGE-BUFFER.
030000     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
030100     05  MSG-FLD                     PIC X(8)   VALUE SPACES.
030200     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
030300
030400 01  MSG-BUFFLEN          PIC S9(4)  BINARY VALUE 76.
030500 01  MSG-ACTUALEN         PIC S9(4)  BINARY VALUE 76.
030600
030700 01  FORMFILE.
030800     05  FORM-FNAME                PIC X(7)  VALUE "FCORITM".
030900     05  FILLER                    PIC X     VALUE ".".
031000     05  FORM-GNAME.
031100         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
031200         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
031300     05  FILLER                    PIC X(19) VALUE SPACES.
031400
031500 01  FORMFILE2.
031600     05  FORM-FNAME-A              PIC X(8)  VALUE "FCSISINQ".
031700     05  FILLER                    PIC X     VALUE ".".
031800     05  FORM-GNAME-A.
031900         10  FORM-GNAME1-A         PIC X(5)  VALUE "FLANG".
032000         10  FORM-GNAME2-A         PIC X(3)  VALUE SPACES.
032100     05  FILLER                    PIC X(19) VALUE SPACES.
032200
032400 01  TERMFILENAME         PIC X(11) VALUE "TERMLIST   ".
032500 01  FIELD-NUMBER         PIC S9(4) BINARY VALUE ZERO.
032600
032700**************************************************************
032800**                                                          **
032900**            D A T A B A S E   W O R K                     **
033000**                                                          **
033100**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
033200
       COPY DBSTAT IN COPYLIB.
033300 01  BASE             PIC X(9)  VALUE "  STORES;".
033400 01  PASSWORD         PIC X(5)  VALUE "JADE;".
034300 01  DSET-NAMES.
034400     05  DSET-NAME              PIC X(16)  VALUE SPACES.
034500     05  DSET-MPORCV            PIC X(16)  VALUE "MPORCV;".
034600     05  DSET-DDAILYTC          PIC X(16)  VALUE "DDAILYTC;".
034700     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
034800     05  DSET-DRCVITEM          PIC X(16)  VALUE "DRCVITEM;".
034900     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
035000     05  DSET-DDESC             PIC X(16)  VALUE "DDESC;".
035100     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
035100     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
035200
035300 01  MODE-AREA.
035400     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
035500     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
035600     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
035700     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
035800     05  MODE-INFO              PIC S9(4)   COMP       VALUE 0.
035900
036000 01  ALL-ITEMS              PIC X(2)  VALUE "@;".
036100
036200
036300 01  PO-ARG                     PIC X(14) VALUE SPACES.
036300 01  PLT-ARG                    PIC X(4)  VALUE "OVSH".
       01  PO-ARG-ALL                 PIC X(14).
036400 01  CODE-ARG                   PIC X(8).
036500 01  PO-SEARCH                  PIC X(10) VALUE "PO-RCV-NO;".
036600 01  CODE-SEARCH                PIC X(10) VALUE "CORP-CODE;".
036700
036800 01  ITEM-LOCK-MSTORERM.
036900     05  ONE-DSET-LOCKED        PIC S9(4) BINARY VALUE 1.
037000     05  LOCK-MSTORERM.
037100         10  LENGTH-4           PIC S9(4) BINARY VALUE 25.
037200         10  DSET-NAME-4        PIC X(16) VALUE "MSTORERM;".
037300         10  ITEM-LIST-4        PIC X(16) VALUE "CORP-CODE;".
037400         10  REL-OP-4           PIC X(2)  VALUE "= ".
037500         10  LOCK-VALUE-4       PIC X(14) VALUE SPACES.
037600
037700*************************************************************
037800**                                                         **
037900**             D A T A B A S E   B U F F E R S             **
038000**                                                         **
038100*************************************************************
038200
038300 COPY MPLT0    IN COPYLIB.
038300 COPY MPLTOVSH IN COPYLIB.
       COPY MPLTSRX  IN COPYLIB.
       COPY MPLTFRAN IN COPYLIB.
038300 COPY MPORCV   IN COPYLIB.
038400 COPY DPOITEM  IN COPYLIB.
038500 COPY DRCVITEM IN COPYLIB.
038600 COPY DDESC    IN COPYLIB.
038700 COPY DPORECD  IN COPYLIB.
038800 COPY MSTORERM IN COPYLIB.
038900 COPY DDAILYTC IN COPYLIB.
039000 COPY TC325    IN COPYLIB.
039100 COPY TC425    IN COPYLIB.
       COPY TC341    IN COPYLIB.
039200**************************************************************
039300**                                                          **
039400**                  S C R E E N   D A T A                   **
039500**                                                          **
039600**************************************************************
039700 01  DE-FIELDS-1.
039800     05  DE1-PO-RLSE-RS.
039900         10  DE1-PO.
040000             15  DE1-END         PIC XXX.
040100             15  FILLER         PIC X(4).
040200         10  DE1-RLSE            PIC XXX.
040300         10  DE1-RS              PIC XXX.
040400     05  DE1-ITM                PIC 9(4).
040500     05  DE-ITM-X REDEFINES DE1-ITM PIC X(4).
           05  DE1-PRAPS              PIC X(06).
           05  DE-COMMAND-LINE-1      PIC X(79).
           05  DE-MESSAGE-LINE-1      PIC X(79).
040600
040700 01  DE-FIELDS-2.
040800     05  DE-PO-RLSE-RS.
040900         10  DE-PO.
041000             15  DE-END         PIC XXX.
041100             15  FILLER         PIC X(4).
041200         10  DE-RLSE            PIC XXX.
041300         10  DE-RS              PIC XXX.
           05  DE-PRAPS               PIC X(06).
041400     05  DATA-ENTRY-LINE.
041500         10  DE-ITM             PIC 9(4).
041600         10  DE-CODE            PIC X(8).
041700         10  DE-CUR-QTY         PIC ZZZZZZZ9V9999.
041800         10  DE-QTY-X.
041900             15  DE-QTY-BDP-X   PIC X(8).
042000             15  DE-QTY-ADP-X   PIC X(4).
042100         10  DE-QTY REDEFINES DE-QTY-X PIC 9(8)V9(4).
042200         10  DE-UM              PIC XX.
042300         10  DE-CR              PIC X.
042400         10  DE-PRT-LOC         PIC X(2).
042500         10  DE-LOCX            PIC X.
042600         10  DE-LOC             PIC X(12).
               10  DE-FRAN            PIC X(4).
042700         10  DE-LOCX2           PIC X.
042800         10  DE-LOC2            PIC X(12).
               10  DE-FRAN2           PIC X(4).
042900         10  DE-LOCX3           PIC X.
043000         10  DE-LOC3            PIC X(12).
               10  DE-FRAN3           PIC X(4).
043100         10  DE-LOCX4           PIC X.
043200         10  DE-LOC4            PIC X(12).
               10  DE-FRAN4           PIC X(4).
043300         10  DE-LOCX5           PIC X.
043400         10  DE-LOC5            PIC X(12).
               10  DE-FRAN5           PIC X(4).
043500         10  DE-LOCX6           PIC X.
043600         10  DE-LOC6            PIC X(12).
               10  DE-FRAN6           PIC X(4).
           05  DE-COMMAND-LINE-2      PIC X(79).
           05  DE-MESSAGE-LINE-2      PIC X(79).
043700
043800**************************************************************
043900**                                                          **
044000**      H E A D E R   A N D   D E T A I L   L I N E S       **
044100**                                                          **
044200**************************************************************
044300
044400
044500 01  HDR-1.
044600     05  FILLER    PIC X(17)  VALUE SPACES.
044700     05  FILLER    PIC X(20)  VALUE "M A T E R I A L S   ".
044800     05  FILLER    PIC X(13)  VALUE "C O N T R O L".
044900     05  FILLER    PIC X(6)   VALUE SPACES.
045000     05  FILLER    PIC X(5)   VALUE "DATE ".
045100     05  PRT-DATE  PIC X(8) VALUE SPACES.
045200     05  FILLER    PIC XX     VALUE SPACES.
045300     05  PRT-TIME PIC X(8).
045900     05  FILLER    PIC X      VALUE SPACES.
046000
046100 01  HDR-2.
046200     05  FILLER    PIC X(17)  VALUE SPACES.
046300     05  FILLER    PIC X(15)  VALUE "RECEIVING SLIP ".
046400     05  FILLER    PIC X(16)  VALUE "ITEM CORRECTIONS".
046500     05  FILLER    PIC X(15)  VALUE " INTO STOREROOM".
046600     05  FILLER    PIC X(17)  VALUE SPACES.
046700
046800 01  HDR-3.
046900     05  FILLER    PIC XX     VALUE SPACES.
047000     05  FILLER    PIC X(14)  VALUE "RECEIVING SLIP".
047100     05  FILLER    PIC X(4)   VALUE SPACES.
047200     05  FILLER    PIC X(4)   VALUE "ITEM".
047300     05  FILLER    PIC X(5)   VALUE SPACES.
047400     05  FILLER    PIC X(9)   VALUE "CORP CODE".
047500     05  FILLER    PIC X(4)   VALUE SPACES.
047600     05  FILLER    PIC X(13)  VALUE " QUANTITY ADJ".
047700     05  FILLER    PIC XXX    VALUE SPACES.
047800     05  FILLER    PIC XX     VALUE "UM".
047900     05  FILLER    PIC XX     VALUE SPACES.
048000     05  FILLER    PIC XX     VALUE "CR".
048100     05  FILLER    PIC XX     VALUE SPACES.
048200     05  FILLER    PIC X(8)   VALUE "LOCATION".
048300     05  FILLER    PIC X(6)   VALUE SPACES.
048400
048500 01  PRT-ITM-HDR.
048600     05  FILLER          PIC XX     VALUE SPACES.
048700     05  PRT-RS          PIC X(15)  VALUE SPACES.
048800     05  FILLER          PIC X(3)   VALUE SPACES.
048900     05  PRT-ITM         PIC Z(4)   VALUE ZEROS.
049000     05  FILLER          PIC X(6)   VALUE SPACES.
049100     05  PRT-CODE        PIC X(7)   VALUE SPACES.
049200     05  FILLER          PIC X(5)   VALUE SPACES.
049300     05  PRT-QTY         PIC Z(7)9.9999 VALUE ZEROS.
049400     05  FILLER          PIC XXX    VALUE SPACES.
049500     05  PRT-UM          PIC XX     VALUE SPACES.
049600     05  FILLER          PIC XX     VALUE SPACES.
049700     05  PRT-CR-INDIC    PIC X      VALUE SPACE.
049800     05  FILLER          PIC XXX    VALUE SPACES.
049900     05  PRT-LOC         PIC X(12)  VALUE SPACES.
050000     05  FILLER          PIC XX     VALUE SPACES.
050100
050200******************************************
050300*    NATIVE LANGUAGE SUPPORT AREA        *
050400******************************************
050500
050600 COPY LANGUAGE IN COPYLIB.
050700
050800
050900 PROCEDURE DIVISION.
051000 1-HOUSEKEEP.
           MOVE "01" TO BU-DISPLAY-PARA.
           MOVE ZERO TO ADJUSTMENT-QTY-STR-UM,
                        ADJUSTMENT-QTY-RECEIPT-UM,
                        NEW-QTY-STORED,
                        LINE-ADV, SAVE-VIEW-LASTKEY.
           PERFORM 9999-OPEN-STUFF.
054000*----- SET THE FLAGS TO OPEN DATABASE AND GET PLANT CODE
054100*----- LATER DURING A CALL TO "TSWRDFM".  SET MODE TO
054200*----- DO SPECIAL SHIFTING ROUTINES
054300     MOVE 2               TO  SRF-MODE.
054400     MOVE "Y"             TO  SRF-MPLTINFO-FLAG, SRF-BASE-FLAG.
054500
           MOVE "P 01" TO PLT-ARG
           PERFORM 9999-GETKEY-MPLTINFO-PK-I
           MOVE BUF-MPLTINFO TO SRF-BUF-MPLTINFO.


      *----------  GET THE STORES RECEIPT EXTERNAL INTERFACE SWITCHES
      *----------  JSB, 9/3/97 FOR DES MOINES
           MOVE "SRX " TO PLT-ARG
           PERFORM 9999-GETKEY-MPLTINFO-PK-I
           IF COND-WORD NOT = 0
               MOVE "N" TO SAVE-EXTSYS
                           SAVE-EXTAUTO
           ELSE
               MOVE MPLTINFO-SRX-EXTSYS TO SAVE-EXTSYS
               MOVE MPLTINFO-SRX-AUTO   TO SAVE-EXTAUTO.

      *------GET FRACHISERS TABLE
           MOVE "FRAN" TO PLT-ARG
           PERFORM 9999-GETKEY-MPLTINFO-PK-I
           IF COND-WORD NOT = 0
               MOVE SPACES TO FRAN-TABLE
           ELSE
               MOVE MPLTINFO-FRANCHISES TO FRAN-TABLE.

           MOVE SPACES TO AUTOSTORE-TABLE.
054500
055100     PERFORM 6000-MAIN       THRU 6990-MAIN-X.
055200
055300 2000-EOJ.
           PERFORM 9999-CLOSE-STUFF.
055800     GOBACK.
055900
056000 2100-BLOWUP.
056100     MOVE PO-RLSE-RS-WORK          TO   BU-DISPLAY-FLD (1).
056200     MOVE "TCORITM"                TO   BU-PGM-NAME.
056300     MOVE FIELD-NUMBER             TO   BU-DISPLAY-FLD9 (1).
056400     MOVE DE-PO-RLSE-RS            TO   BU-DISPLAY-FLD (2).
056500     MOVE DE-ITM                   TO   BU-DISPLAY-FLD (3).
056600     MOVE DE-CODE                  TO   BU-DISPLAY-FLD (4).
056700
056800     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
056900       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
057000       BU-DISPLAY-FLDS.
057100
057200
057300**********************
057400*                    *
057500*       M A I N      *
057600*                    *
057700**********************
057800
057900 6000-MAIN.
058000*---------- KEEP TRACK OF CURRENT PARA IN CASE OF BLOWUP.
           MOVE "02" TO BU-DISPLAY-PARA.
058200     MOVE SPACES TO DE-FIELDS-1, DE-FIELDS-2.
058300
058400     MOVE "FCORITM_PO"  TO  VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
058900
           MOVE "000" TO DE1-RLSE, DE1-RS.
           MOVE "000000" TO DE1-PRAPS.
           MOVE ZERO TO DE1-ITM.

059000***********************************
059100*                                 *
059200*  THE RCV SLIP W/ITEM TO BE MOD  *
059300*    SCREEN IS FED TO THE TERM    *
059400*                                 *
059500***********************************
059600
059700
059800 6110-SHOWFORM.
059900     MOVE "03" TO BU-DISPLAY-PARA.
060000*---------- CALL SUBPROG WHICH WILL HANDLE THE SHOWFORM,
060100*---------- READFIELDS, SPECIAL KEY LOGIC (FLOP SCREEN, PRINT
060200*---------- SCREEN, REFRESH, ETC), AND VIEW EDITS.
           PERFORM 9999-RESET-MPORCV-PO-O.
           PERFORM 9999-RESET-MSTORERM-CD-O.
           PERFORM 9999-RESET-DPOITEM-PO-O.
           PERFORM 9999-RESET-DRCVITEM-PO-O.
060400     MOVE 5 TO SRF-KEYSET.
           IF SRF-MPLTINFO-COMPANY = "211" OR "281" OR "285"
               MOVE B"1" TO IND(88)
           ELSE
               MOVE B"0" TO IND(88).
           MOVE DE-FIELDS-1 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS-1.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6110-SHOWFORM.

      *------GET THE TABLE OF MAJOR GROUPS TO AUTOMATICALLY STORE
      *------UPON RECEIPT FROM THE MPLTINFO FILE.
           IF AUTOSTORE-TABLE = SPACES
               MOVE "OVSH" TO PLT-ARG
               PERFORM 9999-GETKEY-MPLTINFO-PK-I
               MOVE MPLTINFO-RM-STORED-TABLE TO AUTOSTORE-TABLE.

061100     IF VIEW-LASTKEY EQUAL EXIT-PROGRAM
061200         GO TO 6990-MAIN-X.
061300
061400*------- VIEW LASTKEY OF 1 MEANS AN INQUIRY, SO WE NEED TO AUTO-
061500*------- READ THE SCREEN.
061600     IF VIEW-LASTKEY = 1
061700         MOVE VIEW-LASTKEY  TO  SAVE-VIEW-LASTKEY
061800         PERFORM 9961-AUTOREAD
061900         PERFORM 9964-FINISHFORM
062000         MOVE SAVE-VIEW-LASTKEY  TO  VIEW-LASTKEY.
062100
062200*---------- 'f2' ALLOWS THE USER TO DO A MATERIAL STATUS INQUIRY
062300     IF VIEW-LASTKEY = 2
062400         PERFORM 9961-AUTOREAD
062500         PERFORM 9952-GETBUFFER
062600         PERFORM 9070-CALL-TMTLSTAT
               PERFORM 9953-PUTBUFFER
062900         GO TO 6110-SHOWFORM.
063000
           PERFORM 9952-GETBUFFER.

      *-------CONVERT PRAPS NUMBER TO CSIS RECEIVER
           IF DE1-PRAPS NOT = "000000" AND DE1-PRAPS NOT = SPACES
               MOVE DE1-PRAPS TO PORCVSEQ OF MPORCV-REC-I
               READ MPORCV-I INTO BUF-MPORCV
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                 MOVE  18 TO LANG-SETNUM
                 MOVE  65 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE DE1-PRAPS TO  MSG-FLD
                 MOVE 5 TO FIELD-NUMBER
                 PERFORM 9954-SETERROR
                 GO TO 6110-SHOWFORM
               ELSE
                 MOVE M-PO-RCV-NO-2-8 TO DE1-PO
                 MOVE M-PO-RCV-NO-9-11 TO DE1-RLSE
                 MOVE M-PO-RCV-NO-12-14 TO DE1-RS
               END-IF
           END-IF.
063600
063700*----------  CHECK IF THE PO EXISTS AND FIND LAST RECEIVER FOR
063800*            RECEIVING SLIP INQUIRY
063900     MOVE DE1-PO                TO WS-PO.
064000     MOVE "000"                 TO WS-RS.
064100     IF SRF-MPLTINFO-COMPANY = "211" OR "281" OR "284"
064200        MOVE "000"              TO WS-RLSE
064300     ELSE
064400        MOVE DE1-RLSE           TO WS-RLSE.
064500     MOVE PO-RLSE-RS            TO PO-ARG.
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBGET7-MPORCV-PO-O.
064800     IF COND-WORD = 17
064900        MOVE  16 TO LANG-SETNUM
065000        MOVE  45 TO LANG-MSGNUM
065100        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065200        MOVE PO-ARG              TO MSG-FLD
065300        MOVE 1                   TO FIELD-NUMBER
065400        PERFORM 9954-SETERROR
065500        GO TO 6110-SHOWFORM
065600     ELSE
065700        IF COND-WORD NOT = 0
065800           MOVE "DBGET MPORCV TCORITM 6110" TO BU-DISPLAY-MSG
065900           PERFORM 2100-BLOWUP.

      *-----GET DPORECD FOR THE VENDOR CODE
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DPORECD-PO-I.
           PERFORM 9999-DBGET5-DPORECD-PO-I.
      *-----CHECK VENDOR CODE FOR FRANCHISE VENDOR
      *--------05/15/97, SET FLAG FOR FRANCHISE PO BASED ON VENDOR CODE
           IF FRAN-TABLE NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                 AT END
                     MOVE SPACES TO FRAN-PO-ID
                 WHEN FRAN-VEN-CODE(FRAN-IDX) = PO-VEN-CODE
                     MOVE FRAN-ID(FRAN-IDX) TO FRAN-PO-ID
               END-SEARCH
           ELSE
               MOVE SPACES TO FRAN-PO-ID
           END-IF.
066000
066100
066200********************************
066300*                              *
066400*  A CHECK TO FIND OUT IF THE  *
066500*    THE P.O. EVEN EXISTS      *
066600*                              *
066700********************************
066800
066900 6200-CHECK-EXISTENCE.
067000     MOVE "04" TO BU-DISPLAY-PARA.
067100     MOVE DE1-PO              TO   WS-PO, DISP-PO.
067200     MOVE DE1-RLSE            TO   WS-RLSE, DISP-RLSE.
067300     MOVE DE1-RS              TO   WS-RS, DISP-RS.
           MOVE DE1-PO-RLSE-RS      TO   DE-PO-RLSE-RS.
067400     MOVE PO-RLSE-RS          TO   RS-ARG.
067500
           MOVE RS-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DRCVITEM-PO-O.
067900     IF COND-WORD NOT = 0
068000       IF COND-WORD = 17
068100         MOVE  18 TO LANG-SETNUM
068200         MOVE  65 TO LANG-MSGNUM
068300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
068400         MOVE PO-ARG                          TO  MSG-FLD
068500         MOVE 1                               TO  FIELD-NUMBER
068600         PERFORM 9954-SETERROR
068700         GO TO 6110-SHOWFORM
068800       ELSE
068900         MOVE "DBFIND ERR 6200-CE" TO BU-DISPLAY-MSG
069000         PERFORM 2100-BLOWUP.
069100
069200*------- USER CAN GET THE RCV SLIP INQUIRY USING 'f1'
069300     IF VIEW-LASTKEY = 1
069400         PERFORM 9080-CALL-SINQRSI THRU 9089-EXIT
069500         MOVE "FCORITM_PO"  TO  VIEW-NFNAME
               PERFORM 9951-GETNEXTFORM
               PERFORM 9953-PUTBUFFER
               PERFORM 9957-FIELDEDITS
070000         GO TO 6110-SHOWFORM.
070100
070200********************************
070300*                              *
070400*  DOES THIS ITEM EXIST??      *
070500*                              *
070600********************************
070700
070800 6220-ITM-MATCH.
070900     MOVE "05" TO BU-DISPLAY-PARA.
           PERFORM 9999-DBGET5-DRCVITEM-PO-O.
071300     IF COND-WORD NOT = 0
071400       IF COND-WORD = 15
071500         MOVE   9 TO LANG-SETNUM
071600         MOVE  25 TO LANG-MSGNUM
071700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
071800         MOVE DE-ITM-X           TO  MSG-FLD
071900         MOVE 4                  TO  FIELD-NUMBER
072000         PERFORM 9954-SETERROR
072100         GO TO 6110-SHOWFORM
072200       ELSE
072300         MOVE "DBGET ERROR 6220-ITM-MATCH" TO BU-DISPLAY-MSG
072400         PERFORM 2100-BLOWUP.
072500
072600     IF DE1-ITM NOT = RCV-ITEM-NUMBER
072700         GO TO 6220-ITM-MATCH.
072800
072900* IF AUTOSTORE ITEM DO NOT ALLOW CORRECTION.
           MOVE RCV-CORP-CODE TO ITEM-MAJOR-GROUP.
           PERFORM 8000-CHECK-IF-AUTOSTORE-ITEM THRU 8000-EXIT.
073000     IF AUTOSTORE-ITEM = "Y"
073100         MOVE   1 TO LANG-SETNUM
073200         MOVE  38 TO LANG-MSGNUM
073300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
073400         MOVE 4                  TO   FIELD-NUMBER
073500         PERFORM 9954-SETERROR
073600         GO TO 6110-SHOWFORM.
073700
072900* IF DIRECT DELIVERY DO NOT ALLOW CORRECTION.
073000     IF RCV-MM-STORED = "DD"
073100         MOVE   4 TO LANG-SETNUM
073200         MOVE  10 TO LANG-MSGNUM
073300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
073400         MOVE 4                  TO   FIELD-NUMBER
073500         PERFORM 9954-SETERROR
073600         GO TO 6110-SHOWFORM.
073700
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DPOITEM-PO-O.
074000     IF COND-WORD NOT = 0
074100         MOVE "DBFIND ERR 6220-IM" TO BU-DISPLAY-MSG
074200         PERFORM 2100-BLOWUP.
074300
074400 6230-FIND-ITEM-UM.
074500     MOVE "06" TO BU-DISPLAY-PARA.
           PERFORM 9999-DBGET5-DPOITEM-PO-O.
074800     IF COND-WORD NOT = 0
074900         MOVE "DBGET ERR 6230-FIU" TO BU-DISPLAY-MSG
075000         PERFORM 2100-BLOWUP.
075100
075200     IF DE1-ITM NOT = ITM-NUMBER
075300         GO TO 6230-FIND-ITEM-UM.
075400
075500********************************
075600*                              *
075700*  MSTORERM - GET CORP-CODE    *
075800*                              *
075900********************************
076000
076100*------ MASTER STOCK IS FOR THE TRUE CODE FOR AN EXPERIMENTAL RAW
076200*------ MATERIAL: THE EXPERIMENTAL IS ORDERED AND RECEIVED, BUT
076300*------ THE LIVE CODE IS UPDATED IN THE STOREROOM.
076400     IF ITM-MASTER-STOCK > SPACES
076500         MOVE ITM-MASTER-STOCK     TO   CODE-ARG, DE-CODE
076600     ELSE
076700         MOVE RCV-CORP-CODE        TO   CODE-ARG, DE-CODE.
           PERFORM 9999-DBGET7-MSTORERM-CD-O.
077000     IF COND-WORD NOT = 0
077100         MOVE "DBGET ERR MSTORE 6220-IM" TO BU-DISPLAY-MSG
077200         PERFORM 2100-BLOWUP.
077300
077400********************************
077500*                              *
077600*  CODE CANNOT BE FROZEN       *
077700*                              *
077800********************************
077900
078000     IF STR-STATE = "F"
078100         MOVE   3 TO LANG-SETNUM
078200         MOVE   8 TO LANG-MSGNUM
078300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
078400         MOVE    CORP-CODE TO                   MSG-FLD
078500         MOVE 4 TO          FIELD-NUMBER
078600         PERFORM 9954-SETERROR
078700         GO TO 6110-SHOWFORM.
078800
078900     MOVE RCV-QTY-STORED        TO DE-CUR-QTY.
079000     MOVE ITM-UM                TO DE-UM.
079100
079200     MOVE STR-LOC (1)           TO DE-LOC.
079300     MOVE STR-LOC (2)           TO DE-LOC2.
079400     MOVE STR-LOC (3)           TO DE-LOC3.
079500     MOVE STR-LOC (4)           TO DE-LOC4.
079600     MOVE STR-LOC (5)           TO DE-LOC5.
079700     MOVE STR-LOC (6)           TO DE-LOC6.

           IF STR-LOC(1) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(1)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN
           END-IF.
           IF STR-LOC(2) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN2
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(2)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN2
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN2
           END-IF.
           IF STR-LOC(3) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN3
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(3)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN3
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN3
           END-IF.
           IF STR-LOC(4) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN4
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(4)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN4
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN4
           END-IF.
           IF STR-LOC(5) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN5
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(5)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN5
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN5
           END-IF.
           IF STR-LOC(6) NOT = SPACES
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN6
                  WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER(6)
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN6
               END-SEARCH
           ELSE
               MOVE SPACES TO DE-FRAN6
           END-IF.
079800
079900     MOVE "08"                  TO DE-PRT-LOC.
080000
080100*---------- KEEP TRACK OF CURRENT PARA IN CASE OF BLOWUP.
080200     MOVE "6235-MAIN"              TO   BU-DISPLAY-FLD (5).
080300     MOVE DE1-PO-RLSE-RS TO DE-PO-RLSE-RS.
080400     MOVE DE1-ITM TO DE-ITM.
           IF DE1-PRAPS = "000000"
               MOVE RS-ARG TO PO-ARG-ALL
               PERFORM 9999-DBGET7-MPORCV-PO-O
               MOVE M-PO-RCV-SEQ     TO   DE-PRAPS
           ELSE
               MOVE DE1-PRAPS       TO   DE-PRAPS.
           MOVE ZERO TO DE-QTY.
080500     MOVE "SCREEN1"  TO  VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
           PERFORM 9953-PUTBUFFER.
081300
081400 6235-SHOWFORM.
081500     MOVE "08" TO BU-DISPLAY-PARA.
           PERFORM 9999-RESET-MPORCV-PO-O.
           PERFORM 9999-RESET-MSTORERM-CD-O.
           PERFORM 9999-RESET-DPOITEM-PO-O.
           PERFORM 9999-RESET-DRCVITEM-PO-O.
081600*---------- CALL SUBPROG WHICH WILL HANDLE THE SHOWFORM,
081700*---------- READFIELDS, SPECIAL KEY LOGIC (FLOP SCREEN, PRINT
081800*---------- SCREEN, REFRESH, ETC), AND VIEW EDITS.
081900
082000     MOVE 5 TO SRF-KEYSET.
           IF SRF-MPLTINFO-COMPANY = "211" OR "281" OR "285"
               MOVE B"1" TO IND(88)
           ELSE
               MOVE B"0" TO IND(88).
           MOVE DE-FIELDS-2 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS-2.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 6235-SHOWFORM.

082700     IF VIEW-LASTKEY EQUAL EXIT-PROGRAM
082800         GO TO 6990-MAIN-X.
082900
083000*------- VIEW LASTKEY OF 1 MEANS AN INQUIRY, SO WE NEED TO AUTO-
083100*------- READ THE SCREEN.
083200     IF VIEW-LASTKEY = 1
083300         MOVE VIEW-LASTKEY  TO  SAVE-VIEW-LASTKEY
083400         PERFORM 9961-AUTOREAD
083500         PERFORM 9964-FINISHFORM
               PERFORM 9080-CALL-SINQRSI THRU 9089-EXIT
083600         MOVE SAVE-VIEW-LASTKEY  TO  VIEW-LASTKEY
               GO TO 6235-SHOWFORM.
083700
083800*---------- 'f2' ALLOWS THE USER TO DO A MATERIAL STATUS INQUIRY
083900     IF VIEW-LASTKEY = 2
084000         PERFORM 9961-AUTOREAD
084100         PERFORM 9952-GETBUFFER
084200         PERFORM 9070-CALL-TMTLSTAT
               PERFORM 9953-PUTBUFFER
084500         GO TO 6235-SHOWFORM.
084600
084700     PERFORM 9952-GETBUFFER.

           IF  DE-LOCX  = " " AND DE-LOCX2 = " " AND DE-LOCX3 = " "
           AND DE-LOCX4 = " " AND DE-LOCX5 = " " AND DE-LOCX6 = " "
      *        "AT LEAST ONE LOCATION MUST BE SELECTED"
               MOVE 66 TO LANG-SETNUM
               MOVE 280 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 13 TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 6235-SHOWFORM.

      *------IF CODE OWNER AND VENDOR THE SAME FRANCHISE
      *------ THEN ONLY ALLOW ADJUSTMENT TO SAME BIN OWNER
           IF STR-CODE-OWNER = FRAN-PO-ID
               IF DE-LOCX NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 13 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX2 NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN2
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 14 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX3 NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN3
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 16 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX4 NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN4
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 18 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX5 NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN5
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 20 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX6 NOT = SPACES
                 IF FRAN-TABLE NOT = SPACES
                     SET FRAN-IDX TO 1
                     SEARCH FRAN-ENTRY
                        AT END  MOVE SPACES TO FRAN-NAME-ID
                        WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN6
                                MOVE FRAN-ID(FRAN-IDX) TO FRAN-NAME-ID
                     END-SEARCH
                 ELSE
                     MOVE SPACES TO FRAN-NAME-ID
                 END-IF
                 IF FRAN-NAME-ID NOT = STR-CODE-OWNER
                   IF STR-CODE-OWNER = SPACES
                     MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                       TO MESSAGE-BUFFER
                   ELSE
                     MOVE "MUST ADJUST A FRANCHISE OWNED BIN"
                       TO MESSAGE-BUFFER
                   END-IF
                   MOVE 22 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
           ELSE
      *------IF CODE OWNER AND VENDOR NOT THE SAME FRANCHISE
      *------ THEN ALLOW ADJUSTMENT TO ONLY GOODYEAR BINS.
               IF DE-LOCX NOT = SPACES
                 IF DE-FRAN NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 13 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX2 NOT = SPACES
                 IF DE-FRAN2 NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 14 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX3 NOT = SPACES
                 IF DE-FRAN3 NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 16 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX4 NOT = SPACES
                 IF DE-FRAN4 NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 18 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX5 NOT = SPACES
                 IF DE-FRAN5 NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 20 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               ELSE
               IF DE-LOCX6 NOT = SPACES
                 IF DE-FRAN6 NOT = SPACES
                   MOVE "MUST ADJUST A GOODYEAR OWNED BIN"
                     TO MESSAGE-BUFFER
                   MOVE 20 TO FIELD-NUMBER
                   PERFORM 9954-SETERROR
                   GO TO 6235-SHOWFORM
                 END-IF
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
               END-IF
           END-IF.

           IF DE-QTY = ZEROS
      *        "ZERO IS AN UNACCEPTABLE ENTRY - PLEASE CORRECT"
               MOVE 52 TO LANG-SETNUM
               MOVE  6 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  6 TO FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 6235-SHOWFORM.

084800*---------- CALL SUBPROG TO CONVERT ENTERED QUANTITY INTO
084900*---------- STOREROOM UNIT OF MEASURE.
085000*---------- NOTE: SPACES IS PASSED IN RET-CODE TO THE SUBPROG
085100*---------- TO INDICATE THAT QUANTITIES ARE BEING CONVERTED
085200
085300     MOVE SPACES        TO  RET-CODE.
085400     MOVE DE-QTY        TO  UMCF-SOURCE-QTY.
085500     MOVE DE-UM         TO  UMCF-SOURCE-UM.
085600     MOVE ITM-UM        TO  UMCF-DEST-UM.
085700     CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
085800                         UMCF-QUANTITY-AREA.
085900     MOVE UMCF-DEST-QTY TO  ADJUSTMENT-QTY-RECEIPT-UM.
086000     MOVE UMCF-QTY-STR-UM    TO  ADJUSTMENT-QTY-STR-UM.
086100
086200********************************
086300*                              *
086400*  THE ADJUSTED QUANTITY MAY   *
086500*   NOT REDUCE QTY PREVIOUSLY  *
086600*   STORED ON THIS REC SLIP    *
086700*                              *
086800********************************
086900
087000     IF DE-CR = "X"
087100         COMPUTE NEW-QTY-STORED =
087200           RCV-QTY-STORED - ADJUSTMENT-QTY-RECEIPT-UM
087300     ELSE
087400         COMPUTE NEW-QTY-STORED =
087500           RCV-QTY-STORED + ADJUSTMENT-QTY-RECEIPT-UM.
087600
087700     IF NEW-QTY-STORED < 0
087800         MOVE  17 TO LANG-SETNUM
087900         MOVE   6 TO LANG-MSGNUM
088000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
088100         MOVE 6                   TO    FIELD-NUMBER
088200         PERFORM 9954-SETERROR
088300         GO TO 6235-SHOWFORM.
088400
088500     IF NEW-QTY-STORED > RCV-QTY-DLVR
088600         MOVE   3 TO LANG-SETNUM
088700         MOVE  36 TO LANG-MSGNUM
088800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
088900         MOVE 6                   TO    FIELD-NUMBER
089000         PERFORM 9954-SETERROR
089100         GO TO 6235-SHOWFORM.
089200
089300********************************
089400*                              *
089500* VALIDATE QTY IN THE LOCATION *
089600*                              *
089700********************************
089800
089900     IF DE-CR = "X"
090000       IF DE-LOCX = "X"
090100         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (1)
090200           GO TO 6250-OVER-LOC-ONHAND-ERR
090300         ELSE
090400           NEXT SENTENCE
090500       ELSE
090600       IF DE-LOCX2 = "X"
090700         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (2)
090800           GO TO 6250-OVER-LOC-ONHAND-ERR
090900         ELSE
091000           NEXT SENTENCE
091100       ELSE
091200       IF DE-LOCX3 = "X"
091300         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (3)
091400           GO TO 6250-OVER-LOC-ONHAND-ERR
091500         ELSE
091600           NEXT SENTENCE
091700       ELSE
091800       IF DE-LOCX4 = "X"
091900         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (4)
092000           GO TO 6250-OVER-LOC-ONHAND-ERR
092100         ELSE
092200           NEXT SENTENCE
092300       ELSE
092400       IF DE-LOCX5 = "X"
092500         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (5)
092600           GO TO 6250-OVER-LOC-ONHAND-ERR
092700         ELSE
092800           NEXT SENTENCE
092900       ELSE
093000         IF ADJUSTMENT-QTY-STR-UM > STR-LOC-ONHAND (6)
093100           GO TO 6250-OVER-LOC-ONHAND-ERR.
093200
093300     GO TO 6260-DETERMINE-SPOOLER.
093400
093500 6250-OVER-LOC-ONHAND-ERR.
093600     MOVE "09" TO BU-DISPLAY-PARA.
093700     MOVE  17 TO LANG-SETNUM.
093800     MOVE   7 TO LANG-MSGNUM.
093900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
094000     MOVE 6                     TO  FIELD-NUMBER.
094100     PERFORM 9954-SETERROR
094200     GO TO 6235-SHOWFORM.
094300
094400
094500 6260-DETERMINE-SPOOLER.
094600     MOVE "10" TO BU-DISPLAY-PARA.
094700*---------- THE JSPOOLER WILL DEFAULT TO 08 IF LEFT BLANK
094800
094900     IF DE-PRT-LOC = SPACES
095000         MOVE 08  TO  SPOOL-PRT
095100     ELSE
095200         MOVE DE-PRT-LOC  TO  SPOOL-PRT.
095300
095400*********************************************************
095500*
095600*           MPORCV  -  UPDATE THE STATUS TO 'MM'
095700*
095800*********************************************************
095900
096000 6300-UPDATE-DATABASE.
096100     MOVE "11" TO BU-DISPLAY-PARA.
096200     IF DE-QTY = 0
096300         GO TO 6320-UPDATE-DATABASE.
096400
           MOVE "MPORCV;" TO DSET-NAME.
           PERFORM 9930-LOCK.
096900
           MOVE RS-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBGET7-MPORCV-PO-O.
097200     IF COND-WORD NOT = 0
097300         MOVE "DBGET ERR 6300-UD" TO BU-DISPLAY-MSG
097400         PERFORM 2100-BLOWUP.
097500
097600     MOVE "MM"  TO  PO-RCV-STAT-1-2.
           PERFORM 9999-DBUPDATE-MPORCV-PO-O.
098000     IF COND-WORD NOT = 0
098100         MOVE "DBUPDATE ERROR 6300-UD" TO BU-DISPLAY-MSG
098200         PERFORM 2100-BLOWUP.
098300
           PERFORM 9940-UNLOCK.
098800
098900*********************************************************
099000*
099100*      MSTORERM - UPDATE THE INDIVIDUAL LOCATION ONHAND,
099200*                  THE TOTAL ONHAND, AND ACTIVITY DATE.
099300*
099400*********************************************************
099500
099600 6320-UPDATE-DATABASE.
099700     MOVE "12" TO BU-DISPLAY-PARA.
099800     MOVE CODE-ARG                 TO   LOCK-VALUE-4.
           PERFORM 9931-LOCK-MSTORERM.
           PERFORM 9999-DBGET7-MSTORERM-CD-O.
101000
101100     IF DE-CR = "X"
101200         MULTIPLY ADJUSTMENT-QTY-STR-UM BY -1
101300           GIVING ADJUSTMENT-QTY-STR-UM.
101400
101500     IF DE-LOCX = "X"
101600         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (1)
101700       ELSE
101800     IF DE-LOCX2 = "X"
101900         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (2)
102000       ELSE
102100     IF DE-LOCX3 = "X"
102200         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (3)
102300       ELSE
102400     IF DE-LOCX4 = "X"
102500         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (4)
102600       ELSE
102700     IF DE-LOCX5 = "X"
102800         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (5)
102900       ELSE
103000     IF DE-LOCX6 = "X"
103100         ADD ADJUSTMENT-QTY-STR-UM     TO    STR-LOC-ONHAND (6).
103200
103300     ADD ADJUSTMENT-QTY-STR-UM         TO    STR-ONHAND.
103400
           MOVE 1 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT      TO    STR-ACT-DATE.
      *------SET CENTURY FOR STOREROOM ACTIVITY.
           IF STR-ACT-DATE-YY > "70"
               MOVE "19" TO STR-ACT-DATE-CC
           ELSE
               MOVE "20" TO STR-ACT-DATE-CC.
103600
           PERFORM 9999-DBUPDATE-MSTORERM-CD-O.
104200
           PERFORM 9940-UNLOCK.
104700
104800*********************************************************
104900*
105000*  DRCVITEM - UPDATE QUANTITY STORED AND DATE STORED IN
105100*     THE RECEIVING SLIP ENTRY.
105200*
105300*********************************************************
105400
           MOVE "DRCVITEM;" TO DSET-NAME.
           PERFORM 9930-LOCK.
           MOVE RS-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DRCVITEM-PO-O.
106600
106700 6330-GET-ITM-SEG.
106800     MOVE "13" TO BU-DISPLAY-PARA.
           PERFORM 9999-DBGET5-DRCVITEM-PO-O.
107500     IF DE-ITM NOT = RCV-ITEM-NUMBER
107600         GO TO 6330-GET-ITM-SEG.
107700
107800 6340-UPDATE-ITM-SEG.
107900     MOVE "14" TO BU-DISPLAY-PARA.
108000     IF DE-CR = "X"
108100         MULTIPLY ADJUSTMENT-QTY-RECEIPT-UM BY -1
108200           GIVING ADJUSTMENT-QTY-RECEIPT-UM.
108300
108400     IF RCV-DATE-STORED = SPACES
108500         IF ADJUSTMENT-QTY-RECEIPT-UM NOT = 0
108600             MOVE ACTIVITY-DATE TO RCV-DATE-STORED
                   IF RCV-YY-STORED > "70"
                       MOVE "19" TO RCV-CC-STORED
                   ELSE
                       MOVE "20" TO RCV-CC-STORED
                   END-IF.
108700
108800     ADD ADJUSTMENT-QTY-RECEIPT-UM      TO    RCV-QTY-STORED.
108900
           PERFORM 9999-DBUPDATE-DRCVITEM-PO-O.
109500
           PERFORM 9940-UNLOCK.

110100*********************************************************
110200*
110300*   DPOITEM - UPDATE QUANTITY STORED IN THE ACCUMULATOR.
110400*
110500*********************************************************
110600
           MOVE "DPOITEM;" TO DSET-NAME.
           PERFORM 9930-LOCK.
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DPOITEM-PO-O.
111800
111900 6350-UPDATE-ACCUM-ENTRY.
112000     MOVE "15" TO BU-DISPLAY-PARA.
           PERFORM 9999-DBGET5-DPOITEM-PO-O.
112600
112700     IF DE-ITM NOT = ITM-NUMBER
112800         GO TO 6350-UPDATE-ACCUM-ENTRY.
112900
113000     ADD ADJUSTMENT-QTY-RECEIPT-UM TO ITM-QTY-STORED.
113100
           PERFORM 9999-DBUPDATE-DPOITEM-PO-O.
113800
113900*  NOTE|||  IF PRICE IS TO BE PASSED, IT NEEDS TO BE STORED TO
114000*           EITHER THE 325 OR 425 TC.  ALSO, CURRENCY CODE WILL
114100*           NEED TO BE PASSED WHICH MEANS A CALL TO DPORECD.
114200*---------- CONVERT THE PO PRICE TO STOREROOM UNIT OF MEASURE,
114300*---------- AND MOVE TO THE 325 TRANSACTION.
114400*---------- NOTE: "PR" IS PASSED TO THE SUBPROG TO INDICATE THAT
114500*---------- PRICES ARE BEING CONVERTED.
114600*    MOVE "PR"                 TO  RET-CODE.
114700*    MOVE ITM-UNIT-PRICE       TO  SOURCE-QTY.
114800*    MOVE ITM-PRICE-UM         TO  SOURCE-UM.
114900*    CALL "TUMCF" USING RET-CODE, STR-UM-AREA, QTY-AREA.
115000*    DIVIDE QTY-STR-UM-DEC BY 1 GIVING TC-PO-PRICE ROUNDED.
115100
           PERFORM 9940-UNLOCK.
115700*********************************************************
115800*
115900*      DDAILYTC - TRANSACTION CODE 325 or 425
116000*
116100*********************************************************
116200
116300*----------  GET CURRENCY CODE
           MOVE PO-ARG TO PO-ARG-ALL.
           PERFORM 9999-DBFIND-DPORECD-PO-I.
           PERFORM 9999-DBGET5-DPORECD-PO-I.
117500
           MOVE "DDAILYTC;" TO DSET-NAME.
           PERFORM 9930-LOCK.

118100     MOVE SPACES            TO    BUF-DDAILYTC.
           MOVE DATE-YMD-OUT      TO    DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO DDAILYTC-TIME.
118400     MOVE SRF-MPLTINFO-COMPANY TO    DDAILYTC-PLT.
118500
118600     IF ITM-UNIT-PRICE > 9999999.99
118700        GO TO 6360-TC425.
118800
118900     MOVE "325"             TO    DDAILYTC-TC.
119000     MOVE CODE-ARG          TO    TC325-CORPCODE.
119100     MOVE RS-ARG            TO    TC325-RS.
119200     MOVE ITM-NUMBER        TO    TC325-ITEM.
119300     MOVE ADJUSTMENT-QTY-STR-UM   TO  TC325-STORED-QTY.
119400     MOVE ITM-UNIT-PRICE    TO    TC325-PO-UNIT-PRICE.
119500     MOVE STR-UM            TO    TC325-UM.
119600     MOVE PO-CURRENCY-CODE  TO    TC325-CURRENCY-CODE.
119700     MOVE "C"               TO    TC325-CORRECTION-FLAG.
           MOVE M-PO-RCV-SEQ      TO    TC325-KELLY-SEQ
           IF DE-LOCX NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX2 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN2
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX3 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN3
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX4 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN4
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX5 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN5
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX6 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC325-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN6
                            MOVE FRAN-ID(FRAN-IDX) TO TC325-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC325-FRAN-ID
             END-IF.
119800     GO TO 6370-PUT-TC.
119900
120000 6360-TC425.
120100     MOVE "425"             TO    DDAILYTC-TC.
120200     MOVE CODE-ARG          TO    TC425-CORPCODE.
120300     MOVE RS-WS             TO    TC425-RS.
120400     MOVE ITM-NUMBER        TO    TC425-ITEM.
120500     MOVE ADJUSTMENT-QTY-STR-UM   TO TC425-STORED-QTY.
120600     MOVE ITM-UNIT-PRICE    TO    TC425-PO-UNIT-PRICE.
120700     MOVE STR-UM            TO    TC425-UM.
120800     MOVE PO-CURRENCY-CODE  TO    TC425-CURRENCY-CODE.
120900     MOVE "C"               TO    TC425-CORRECTION-FLAG.
           MOVE M-PO-RCV-SEQ      TO    TC425-KELLY-SEQ.
           IF DE-LOCX NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX2 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN2
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX3 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN3
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX4 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN4
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX5 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN5
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF
           ELSE
           IF DE-LOCX6 NOT = SPACES
             IF FRAN-TABLE NOT = SPACES
                 SET FRAN-IDX TO 1
                 SEARCH FRAN-ENTRY
                    AT END  MOVE SPACES TO TC425-FRAN-ID
                    WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN6
                            MOVE FRAN-ID(FRAN-IDX) TO TC425-FRAN-ID
                 END-SEARCH
             ELSE
                 MOVE SPACES TO TC425-FRAN-ID
             END-IF.
121000
121100 6370-PUT-TC.
           PERFORM 9999-DBPUT-DDAILYTC-DT-O.

           IF RCV-CHATNO NOT = SPACES
               MOVE SPACES            TO    BUF-TC341
               MOVE "341"             TO    DDAILYTC-TC
               MOVE CODE-ARG          TO    TC341-CORPCODE
               MOVE RCV-CHATNO        TO    TC341-CHAT-NO
               MOVE ADJUSTMENT-QTY-STR-UM TO TC341-QTY-RCVD
               MOVE STR-UM            TO    TC341-UM-RCVD
      *-----TRY TO CONVERT QTY TO LB
               MOVE "00" TO UMCF-RET-CODE
               IF STR-UM = "LB"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-LB
               ELSE
                   MOVE "LB" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-LB
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-LB
                   END-IF
               END-IF
      *-----TRY TO CONVERT UM TO GL
               MOVE "00" TO UMCF-RET-CODE
               IF STR-UM = "GL"
                   MOVE TC341-QTY-RCVD TO TC341-QTY-UM-GAL
               ELSE
                   MOVE "GL" TO UMCF-DEST-UM
                   MOVE TC341-UM-RCVD TO UMCF-SOURCE-UM
                   MOVE TC341-QTY-RCVD TO UMCF-SOURCE-QTY
                   CALL "TUMCF" USING UMCF-RET-CODE STR-UM-AREA
                                  UMCF-QUANTITY-AREA
                   IF UMCF-RET-CODE = "00"
                       MOVE UMCF-DEST-QTY TO TC341-QTY-UM-GAL
                   ELSE
                       MOVE ZEROS TO TC341-QTY-UM-GAL
                   END-IF
               END-IF
               PERFORM 9999-DBPUT-DDAILYTC-DT-O
           END-IF.

      *------9/3/97, JSB - FOR DES MOINES
      *------IF STORES RECEIPTS INTERFACES WITH AN EXTERNAL SYSTEM
      *------  CALL THE EXTERNAL INTERFACE PROGRAM TO PASS THE DATA.
           IF SAVE-EXTSYS = "Y"
               CALL "BEXTSTRIFC" USING RS-WS
                                       ITM-NUMBER
                                       CODE-ARG
                                       ADJUSTMENT-QTY-STR-UM
                                       STR-UM
                                       DATE-YMD-OUT
                                       DATE-UNFORMATTED-TIME-OUT.

           PERFORM 9940-UNLOCK.
122200
122300*******************************************************
122400*                                                     *
122500*  HERE DATA ENTERED GOES TO PRINT AREA FOR HARDCOPY  *
122600*                                                     *
122700*******************************************************
122800
           PERFORM 9970-STARTSPOOL.
123500
123600     OPEN OUTPUT PRINT-FILE.
123700     MOVE SPACES          TO   PRINT-REC.
123800     MOVE 1 TO LINE-ADV.
123900     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
124000
           MOVE DATE-SLASH-OUT TO PRT-DATE.
124100     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
124500     MOVE  HDR-1          TO   PRINT-LINE.
124600     MOVE 2 TO LINE-ADV.
124700     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
124800     MOVE  HDR-2          TO   PRINT-LINE.
124900     MOVE 2 TO LINE-ADV.
125000     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
125100     MOVE  HDR-3          TO   PRINT-LINE.
125200     MOVE 2 TO LINE-ADV.
125300     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
125400
125500     MOVE DISPLAY-PO-RLSE-RS     TO      PRT-RS.
125600     MOVE DE-ITM                 TO      PRT-ITM.
125700     MOVE DE-CODE                TO      PRT-CODE.
125800     MOVE DE-QTY                 TO      PRT-QTY.
125900     MOVE DE-UM                  TO      PRT-UM.
126000     MOVE DE-CR                  TO      PRT-CR-INDIC.
126100     MOVE DE-LOC                 TO      PRT-LOC.
126200     MOVE PRT-ITM-HDR            TO      PRINT-LINE.
126300     MOVE 2 TO  LINE-ADV.
126400     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
126500
           PERFORM 9971-STOPSPOOL.
127600     CLOSE PRINT-FILE.
127700
127800     PERFORM 9955-CLEAR-FORM.
127900
128000     GO TO 6000-MAIN.
128100
128200*************************************************************
128300**                                                         **
128400**        P E R F O R M E D    R O U T I N E S             **
128500**                                                         **
128600*************************************************************
128100
128200*****************************
128300*                           *
128400*  CHECK IF AUTOSTORE ITEM  *
128500*                           *
128600*****************************
       8000-CHECK-IF-AUTOSTORE-ITEM.
      *------IF STORE RECEIPT INTERFACES WITH EXTERNAL SYSTEM AND
      *------   ALL MATERIALS TO BE AUTO STORED THEN SET SWITCH TO Y
      *------   JSB, 9/3/97 FOR DES MOINES
           IF SAVE-EXTSYS = "Y" AND SAVE-EXTAUTO = "Y"
               MOVE "Y"                  TO  AUTOSTORE-ITEM
               GO TO 8000-EXIT.

           SET I TO 1.
           SEARCH AUTOSTORE-AREA
                  AT END  MOVE "N" TO AUTOSTORE-ITEM
                      GO TO 8000-EXIT
                  WHEN AUTOSTORE-MAJOR-GROUP(I) = ITEM-MAJOR-GROUP
                      GO TO 8000-FOUND-GROUP.
       8000-FOUND-GROUP.
           MOVE AUTOSTORE-INDICATOR(I)   TO AUTOSTORE-ITEM.

       8000-EXIT.   EXIT.
128700
135800 9070-CALL-TMTLSTAT.
           MOVE "FCSISINQ" TO CSF-NEW-FORMFILE-NAME.
           MOVE "N" TO CSF-MODE.
           CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
             FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
137000
137100     CALL "TMTLSTAT" USING BASE, VIEW-COMAREA,
137200       SRF-MPLTINFO-COMPANY, SPOOL-PRT, DUMMY-CODE-PARM,
137300                                   LANGUAGE-PARMS.
137400
           MOVE "O" TO CSF-MODE.
           CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
             FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
139100
139200 9080-CALL-SINQRSI.
139300     MOVE SRF-SPOOL-NO (1) TO PASS-SPOOL.
139400     MOVE SRF-MPLTINFO-COMPANY TO PASS-PLT-NUMBER.
           IF M-PO-LAST-RCVR NUMERIC
               MOVE M-PO-LAST-RCVR    TO PASS-LAST-RECEIVER
           ELSE
               MOVE  18 TO LANG-SETNUM
               MOVE  65 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                               TO  FIELD-NUMBER
               PERFORM 9954-SETERROR
               GO TO 9089-EXIT.
139600     MOVE PO-ARG            TO PASS-PO.
139700     MOVE DE-RS             TO PASS-START-RECEIVER,
139800                               PASS-NO-LEFT-OFF-AT.
139900     MOVE "R"               TO PASS-INQUIRY.
           MOVE 1                 TO PASS-SAVE-LASTKEY.
           MOVE "N" TO CSF-MODE.
           MOVE "FCSISINQ" TO CSF-NEW-FORMFILE-NAME.
           CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
             FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
137000
       9080-RS-INQUIRY.
           IF PASS-SAVE-LASTKEY = 1
140800       CALL "SINQRSI" USING BASE, VIEW-COMAREA,
140900                      SUBROUTINE-PARMS, LANGUAGE-PARMS
           ELSE
             IF PASS-SAVE-LASTKEY = 2
               CALL "SINQFRT" USING BASE, VIEW-COMAREA,
                              SUBROUTINE-PARMS, LANGUAGE-PARMS
             ELSE
               IF PASS-SAVE-LASTKEY = 4
                 CALL "SINQRSIC" USING BASE, VIEW-COMAREA,
                              SUBROUTINE-PARMS, LANGUAGE-PARMS
               END-IF
             END-IF
           END-IF
           IF PASS-SAVE-LASTKEY = 1 OR 2 OR 4
             GO TO 9080-RS-INQUIRY.

           MOVE "O" TO CSF-MODE.
           CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
             FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
141800 9089-EXIT.  EXIT.
141900
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       COPY HCATREAD IN COPYLIB.

       9930-LOCK.
       9931-LOCK-MSTORERM.
       9940-UNLOCK.
       9951-GETNEXTFORM.
       9952-GETBUFFER.
       9953-PUTBUFFER.
       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE-1,
                                  DE-MESSAGE-LINE-2.
051300
       9955-CLEAR-FORM.
       9956-PUTWINDOW.
       9957-FIELDEDITS.
       9958-INITFORM.
       9959-SHOWFORM.
       9960-SETKEYLABEL.
       9961-AUTOREAD.
       9962-OPENFORM.
       9963-CLOSEFORM.
       9964-FINISHFORM.
       9970-STARTSPOOL.
      ********************************************************
      *    MAKE SURE THE PRINT FILE EXISTS BY CALLING THE CL
      *    PROGRAM 'CCHKOBJ'.  IF IT DOESNT CHANGE THE PRINT
      *    FILE OVERRIDE BACK TO 'MCPRT' DEFAULT.
      ********************************************************
           MOVE SPOOL-PRT TO OVRPRTF-TOFILE-NUM.
           MOVE OVRPRTF-TOFILE TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               MOVE "MCPRT" TO OVRPRTF-TOFILE.

      *------ MOVE THE OVERPRTF-TOFILE NAME TO THE SPOOLFILE NAME
      *------ SO 'MCPRDNN' SHOWUP ON THE OUTPUT QUEUE AS FILE NAME
      *------ INSTEAD OF 'MCPRD'
           MOVE OVRPRTF-TOFILE TO OVRPRTF-SPLFNAME.

      *------ OVERRIDE PRINTER FILE AND/OR COPIES
           STRING "OVRPRTF FILE(" OVRPRTF-FILE ") TOFILE(*LIBL/"
                  OVRPRTF-TOFILE ") COPIES(" OVRPRTF-COPIES ")"
                  " SHARE(" OVRPRTF-SHARED ")" " PAGESIZE("
                  OVRPRTF-PAGESIZE ")" " OVRFLW(" OVRPRTF-OVRFLW ")"
                  " LPI(" OVRPRTF-LPI ") SPLFNAME(" OVRPRTF-SPLFNAME
                  ")"
               DELIMITED BY SIZE  INTO OVRPRTF-PARM1.
           CALL "QCMDEXC" USING OVRPRTF-PARM1, OVRPRTF-PARM2.
           MOVE 0 TO OVRPRTF-TOFILE-NUM.

       9971-STOPSPOOL.
           MOVE "DLTOVR FILE(MCPRT)" TO OVRPRTF-PARM1.
           CALL "QCMDEXC" USING OVRPRTF-PARM1, OVRPRTF-PARM2.

       9999-DBGET7-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF MPORCV-PO-REC-O.
           READ MPORCV-PO-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF DRCVITEM-PO-REC-O.
           START DRCVITEM-PO-O KEY = PORCVNO OF DRCVITEM-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DRCVITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-PO-O NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DRCVITEM-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DRCVITEM-PO-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DRCVITEM-PO-REC-O NOT = PO-ARG-ALL
               PERFORM 9999-RESET-DRCVITEM-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DRCVITEM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DRCVITEM-PO-REC-O.
           START DRCVITEM-PO-O KEY > PORCVNO OF DRCVITEM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-DRCVITEM-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DRCVITEM-PO-REC-O FROM BUF-DRCVITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-DRCVITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBUPDATE-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPORCV-PO-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-MPORCV-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBUPDATE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           REWRITE MSTORERM-CD-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY = PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DPOITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-O NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPOITEM-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-O NOT = PO-ARG-ALL
               PERFORM 9999-RESET-DPOITEM-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPOITEM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY > PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPOITEM-PO-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE ERR 9999-DBUPDATE-DPOITEM-PO-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET7-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MSTORERM-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG-ALL TO PORCVNO OF DPORECD-PO-REC-I.
           START DPORECD-PO-I KEY = PORCVNO OF DPORECD-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DPORECD-PO-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DPORECD-PO-I"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-I NOT = PO-ARG-ALL
               MOVE 15 TO COND-WORD.

       9999-DBPUT-DDAILYTC-DT-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DT-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-DDAILYTC-DT-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-RESET-MPORCV-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF MPORCV-PO-REC-O.
           START MPORCV-PO-O KEY > PORCVNO OF MPORCV-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-RESET-MSTORERM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-CD-REC-O.
           START MSTORERM-CD-O KEY > CORPCDE OF MSTORERM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-OPEN-STUFF.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT DPORECD-PO-I          MPLTINFO-PK-I        .
           OPEN I-O   MPORCV-PO-O           DRCVITEM-PO-O
                      DPOITEM-PO-O          MSTORERM-CD-O
                      DDAILYTC-DT-O                              .
           OPEN INPUT MPORCV-I.

       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE
           CLOSE      MPORCV-PO-O           DRCVITEM-PO-O
                      DPOITEM-PO-O          MSTORERM-CD-O
                      DPORECD-PO-I          DDAILYTC-DT-O
                      MPLTINFO-PK-I         MPORCV-I             .
       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

143800
143900 6990-MAIN-X.
144000     EXIT.
