000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TCOROPEN.
000400 AUTHOR. KURT MOVSESIAN.
000500*REMARKS.
000700**************************************************************
000800*                                                            *
000900*   T C O R O P E N  (CSAS)  GIVES CAPABILITY TO MOVE OPEN   *
001000*    RECEIVER QUANTITIES TO PAID QUANTITIES AND CHANGE OPEN  *
001100*    RECEIVER DOLLARS.  EITHER THE CORPORATE CODE OR         *
001200*    PURCHASE ORDER AND ITEM NUMBER MUST BE ENTERED          *
001300*    TO CALL UP THE TRANSACTION TO MODIFY.                   *
001400*                                                            *
001500**************************************************************
      *C  13SEP1996      DAVE PLUM
      *C    REVISED FOR CENTURY DATABASE CHANGES.
      *C
001800 ENVIRONMENT DIVISION.
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER.  IBM-AS400.
002100 OBJECT-COMPUTER.  IBM-AS400.
002200
002300 SPECIAL-NAMES.    I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002500
002600 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZCOROPEN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MATLACUM-I
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-PHYSICAL
                  ASSIGN TO DATABASE-MCFPCA0700
                  ORGANIZATION IS RELATIVE
                    ACCESS MODE IS RANDOM
                  RELATIVE KEY IS PFKEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-I-CDE
                  ASSIGN TO DATABASE-MCFLCA0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-I-PO
                  ASSIGN TO DATABASE-MCFLCA0703
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-O-PO
                  ASSIGN TO DATABASE-MCFLCA0703
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
002700
002800 DATA DIVISION.
002900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC           PIC X(2000).

       FD  MATLACUM-I
           LABEL RECORDS ARE STANDARD.
       01  MATLACUM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0601.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS4901.

       FD  DTRANS-PHYSICAL
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-PHYSICAL.
           COPY DDS-ALL-FORMATS OF MCFPCA0700.

       FD  DTRANS-I-CDE
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-I-CDE.
           COPY DDS-ALL-FORMATS OF MCFLCA0701.

       FD  DTRANS-I-PO
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-I-PO.
           COPY DDS-ALL-FORMATS OF MCFLCA0703.

       FD  DTRANS-O-PO
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-O-PO.
           COPY DDS-ALL-FORMATS OF MCFLCA0703.

003200 WORKING-STORAGE SECTION.
003300 77  FATAL-ERR-SW                 PIC X(1)   VALUE SPACES.
003400 77  EOJ-SW                       PIC X(1)   VALUE SPACES.
003500 77  ERR-SW                       PIC X(1)   VALUE SPACES.
003600 77  AT-LEAST-ONE-FOUND-SW        PIC X(1)   VALUE SPACES.
003700 77  FOUND-ENTRY                  PIC X(1)   VALUE SPACES.
003800 77  OLD-RCVR-UNIT-VALUE          PIC S9(12)V9(2) VALUE ZEROS.
003900 77  NEW-RCVR-UNIT-VALUE          PIC S9(12)V9(2) VALUE ZEROS.
004000 77  RCVR-QTY-CHG                 PIC S9(10) VALUE ZEROS.
004100 77  SAVE-REC-ADDR                PIC S9(9) COMP VALUE ZEROS.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X      VALUE SPACES.
           05  FILE-STATUS-2            PIC X      VALUE SPACES.

       01  PFKEY                        PIC 9(9).
       01  SAVE-REC-NO                  PIC S9(9)  COMP-4.
004300
004400********************************
004500**   PARAMETERS FOR CALLING   **
004600**   'TDATECHK'               **
004700********************************
004800
004900 COPY TDATECHK IN COPYLIB.
005000
005100**********************************************************
005200**   VIEW PARAMETERS                                    **
005300**********************************************************
005400
005500 COPY VCOMAREA IN COPYLIB.
005600
006500 01  MESSAGE-BUFFER.
006600     05  MSG-TEXT              PIC X(64)    VALUE SPACE.
006700     05  MSG-FLD               PIC X(12)    VALUE SPACE.
006800     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.
006900
007000 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76   COMP-4.
007100
007200 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO COMP-4.
007300
007400 01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.
007500
007600 01  SAVE-VIEW-LASTKEY         PIC S9(4)    VALUE ZERO COMP-4.
007700
      *************************************************************
      **    PARAMETER AREA FOR DISPLAY FILE                      **
      *************************************************************
       COPY DISPDATA   IN COPYLIB.

       01  COMMAND-AREA.
           05  OVERRIDE-ZCOROPEN      PIC X(34) VALUE
               "OVRDSPF FILE(ZCOROPEN) SHARE(*YES)".
           05  OVERRIDE-PARM2         PIC S9(10)V9(5) COMP-3 VALUE 34.

       COPY IOFEEDBACK IN COPYLIB.

009900**************************************************************
009600**                                                          **
009700**             TERMINAL I/O DATA AREA                       **
009800**                                                          **
009900**************************************************************
010000
010100 01  SCREEN-1.
010200     05  DE1-CORP-CODE            PIC X(7).
010300     05  DE1-PO-NUMBER.
               10  DE1-PO-NUM           PIC X(7).
               10  DE1-PO-RLSE          PIC X(3).
010400     05  DE1-ITEM-NUMBER          PIC X(4).
010500     05  DE1-RCVR                 PIC X(3).
           05  DE1-CMDLINE              PIC X(79).
           05  DE1-MSGLINE              PIC X(79).
010600
010700 01  SCREEN-2.
010800     05  DE2-CORP-CODE            PIC X(7).
010900     05  DE2-PO-NUMBER            PIC X(10).
011000     05  DE2-PO-VALUE             PIC 9(12)V9(2).
011100     05  DE2-RCVR                 PIC X(3).
011200     05  DE2-ITEM-NUMBER          PIC X(4).
011300     05  DE2-OPEN-QUANTITY        PIC 9(10).
011400     05  DE2-TRANS-CODE           PIC X(4).
011500     05  DE2-TRANS-DATE           PIC X(8).
011600     05  DE2-QUANTITY             PIC Z(9)9.
011700     05  DE2-UM                   PIC X(2).
011800     05  DE2-CLASS                PIC X(3).
011900     05  DE2-DEPT                 PIC X(4).
012000     05  DE2-ACCOUNT              PIC X(6).
           05  DE2-CMDLINE              PIC X(79).
           05  DE2-MSGLINE              PIC X(79).
012200
012300**************************************************************
012400**************************************************************
012500**                                                          **
012600**                DATABASE I/O BUFFER AREA                  **
012700**                                                          **
012800**************************************************************
012900**************************************************************
013000
013100 COPY DTRANS   IN COPYLIB.

      *** 01  COMPARE-DTRANS PIC X(150).   *REPLACED 13SEP1996*
       01  COMPARE-DTRANS PIC X(112).
013200
013300 COPY MATLACUM IN COPYLIB.
013400
013500 COPY MCLASS   IN COPYLIB.
013600
014900 COPY DBCSACCT  IN COPYLIB.
015000
015100 COPY DATAB     IN COPYLIB.
015200
015800 01 ARG-VALUES.
015900     05  PO-ARG                   PIC X(10)  VALUE SPACES.
016000     05  MATL-ARG                 PIC X(8)   VALUE SPACES.
016100     05  CLASS-ARG                PIC X(4)   VALUE SPACES.
016200
016300 COPY TBLOWUP  IN COPYLIB.
016400
016500 COPY LANGUAGE IN COPYLIB.
016600
       COPY CATREAD  IN COPYLIB.
016700
016800 PROCEDURE DIVISION.
016900
017000 PROC-DIV SECTION 01.
017100
017200 BEGIN-HERE.
017300     PERFORM 1-HSK THRU 1-H-X.
017500     PERFORM 6-MAIN THRU 6-M-X.
017700     PERFORM 2-EOJ  THRU 2-EOJ-X.
017900     GOBACK.
018000
018100 1-HSK.
           CALL "QCMDEXC" USING OVERRIDE-ZCOROPEN, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.
021500
           OPEN INPUT MCLASS-I, MATLACUM-I,
                      DTRANS-I-CDE, DTRANS-I-PO.
           OPEN I-O   DTRANS-PHYSICAL, DTRANS-O-PO.
022100
022200 1-H-X.
022300     EXIT.
022400
022500 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE MCLASS-I, MATLACUM-I,
                 DTRANS-I-CDE, DTRANS-I-PO.
           CLOSE DTRANS-PHYSICAL.
024600
024700 2-EOJ-X.
024800      EXIT.
024900
025000******************************************************
025100**                                                  **
025200**   BLOWUP ROUTINE                                 **
025300**                                                  **
025400******************************************************
025500
025600 2-BLOWUP.
025700     MOVE "TCOROPEN"                TO  BU-PGM-NAME.
025800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
025900         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
026000                 BU-DISPLAY-FLDS.
026100
026200 2-BLOWUP-X.
026300     EXIT.
029100
029200 4-PGM-ERROR.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).
030000
030100 4-PGM-ERROR-X.
030200     EXIT.
033500
033700**************************************************
033800*                                                *
033900*     6 - M A I N                                *
034000*                                                *
034100**************************************************
034200
034300 6-MAIN.
034400     PERFORM 61-PROCESS-SCREEN-1  THRU  61-PS1-X.
034500     IF EOJ-SW = "Y"
034600         NEXT SENTENCE
034700     ELSE
034800         GO TO 6-MAIN.
034900
035000 6-M-X.
035100     EXIT.
035200
035300 61-PROCESS-SCREEN-1.
035400     MOVE "COROPEN1"              TO  VIEW-NFNAME.
036200
036300 61-PUT-BUFFER-1.
036400     MOVE SPACES                  TO  SCREEN-1.
           MOVE ZEROS                   TO  DE1-PO-RLSE.
037100
037200 61-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  SCREEN-1.
037900
038000     IF VIEW-LASTKEY = 3
038100         MOVE "Y"                 TO  EOJ-SW
038200         GO TO 61-PS1-X
038300     ELSE
038900     IF VIEW-LASTKEY = 1 OR
039000        VIEW-LASTKEY = 2 OR
039100        VIEW-LASTKEY = 4 OR
039200        VIEW-LASTKEY = 5 OR
039100        VIEW-LASTKEY = 6 OR
039300        VIEW-LASTKEY = 7 OR
039400        VIEW-LASTKEY = 8
039600*        "* INVALID FUNCTION KEY ENTERED *"
039700         MOVE   9 TO LANG-SETNUM
039800         MOVE  10 TO LANG-MSGNUM
039900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
040000         MOVE 11  TO  FIELD-NUMBER
040100         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
040200         GO TO 61-SHOWFORM-SCREEN-1.
040300
040400 61-FIELD-EDITS.
               IF DE1-CORP-CODE = SPACES AND DE1-PO-NUMBER = SPACES
039600**** YOU MUST ENTER EITHER MATERIAL CODE OR PO INFORMATION
039700         MOVE  66341 TO CATREAD-MSG-NUMBER
039900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
040000         MOVE 11  TO  FIELD-NUMBER
040100         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
040200         GO TO 61-SHOWFORM-SCREEN-1.

               IF DE1-PO-NUM NOT = SPACES
                IF DE1-ITEM-NUMBER = SPACES
039600**** ITEM NUMBER IS REQUIRED
039700            MOVE  66103 TO CATREAD-MSG-NUMBER
039900            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                  MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
040000            MOVE  2  TO  FIELD-NUMBER
040100            PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
040200            GO TO 61-SHOWFORM-SCREEN-1.
042200
042300 61-EDIT-DATA.
042400     MOVE "N"                     TO ERR-SW.
042500     IF DE1-CORP-CODE = SPACES
042600         PERFORM 611-EDIT-PO-NUMBER
042700     ELSE
042800         PERFORM 611-EDIT-MATL-CODE.
042900     IF ERR-SW = "Y"
043000         GO TO 61-SHOWFORM-SCREEN-1.
043100
043200 61-PROCESS-DATA.
043300     MOVE "N"                     TO AT-LEAST-ONE-FOUND-SW.
043400     IF DE1-CORP-CODE = SPACES
043500         PERFORM 612-GET-DTRANS-PO
043600             UNTIL VIEW-LASTKEY = 7 OR 3
043700                    OR END-OF-CHAIN
043800     ELSE
043900         PERFORM 612-GET-DTRANS-CODE
044000             UNTIL VIEW-LASTKEY = 7 OR 3
044100                    OR END-OF-CHAIN.
044200
044300     IF END-OF-CHAIN
044400         IF AT-LEAST-ONE-FOUND-SW = "N"
044500*            "NO ENTRIES WERE FOUND THAT MATCHED THIS CRITERIA"
044600             MOVE 14  TO LANG-SETNUM
044700             MOVE 116 TO LANG-MSGNUM
044800             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
                   IF DE1-CORP-CODE = SPACES
                       MOVE 6  TO FIELD-NUMBER
                   ELSE
                       MOVE 11 TO FIELD-NUMBER
                   END-IF
044900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
045000             GO TO 61-SHOWFORM-SCREEN-1.
045100
045200     IF VIEW-LASTKEY =  3
045300         NEXT SENTENCE
045400     ELSE
045500         GO TO 61-PROCESS-SCREEN-1.
045600
045700 61-PS1-X.
045800     EXIT.
045900
046000 611-EDIT-PO-NUMBER.
           IF DE1-PO-RLSE = "   "
               MOVE "000" TO DE1-PO-RLSE.
046100     MOVE DE1-PO-NUMBER           TO PO-ARG,
046200                                     BU-DISPLAY-FLD (1).
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PONUM OF DTRANS-REC-I-PO.
           START DTRANS-I-PO  KEY = PONUM OF DTRANS-REC-I-PO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

046900     IF GOOD-CALL
047000         NEXT SENTENCE
047100     ELSE
047200         IF NO-ENTRY
047300*            "PURCHASE ORDER DOES NOT EXIST"
047400             MOVE  16 TO LANG-SETNUM
047500             MOVE  45 TO LANG-MSGNUM
047600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
047700             MOVE MESSAGE-BUFFER TO MSG-TEXT
047800             MOVE PO-ARG         TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO  DE1-MSGLINE
047900             MOVE 6              TO  FIELD-NUMBER
048000             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
048100             MOVE "Y"            TO ERR-SW
048200         ELSE
048300             MOVE "DBFIND DTRANS * 611-EPN" TO BU-DISPLAY-MSG
048400             GO TO 2-BLOWUP.
048500
048600 611-EDIT-MATL-CODE.
048700     MOVE DE1-CORP-CODE           TO MATL-ARG,
048800                                     BU-DISPLAY-FLD (1).
           MOVE 0 TO COND-WORD.
           MOVE MATL-ARG TO MATLCODE OF DTRANS-REC-I-CDE,
           START DTRANS-I-CDE KEY = MATLCODE OF DTRANS-REC-I-CDE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
049500     IF GOOD-CALL
049600         NEXT SENTENCE
049700     ELSE
049800         IF NO-ENTRY
049900*            "MATERIAL CODE DOES NOT EXIST"
050000             MOVE 13  TO LANG-SETNUM
050100             MOVE 56  TO LANG-MSGNUM
050200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
050300             MOVE MESSAGE-BUFFER TO MSG-TEXT
050400             MOVE MATL-ARG       TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO  DE1-MSGLINE
050500             MOVE 11             TO  FIELD-NUMBER
050600             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
050700             MOVE "Y"            TO ERR-SW
050800         ELSE
050900             MOVE "DBFIND DTRANS * 611-EMC" TO BU-DISPLAY-MSG
051000             GO TO 2-BLOWUP.
051200
051300 612-GET-DTRANS-PO.
051400     MOVE "N"                     TO FOUND-ENTRY.
051500     MOVE 6                       TO FIELD-NUMBER.
           MOVE 0 TO COND-WORD.
           READ DTRANS-I-PO  NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PONUM OF DTRANS-REC-I-PO NOT = PO-ARG
               MOVE 15 TO COND-WORD.
052300     IF GOOD-CALL
052400         IF TRANS-CODE = "REC" OR "DCHG"
052500             IF TRANS-ITEM-NUM = DE1-ITEM-NUMBER
052600                 IF TRANS-BALANCE-QTY > 0
052700                     IF DE1-RCVR = SPACES
052800                        OR TRANS-RCVR-NUM = DE1-RCVR
052900                         MOVE REC-NO  TO SAVE-REC-ADDR
053000                         MOVE "Y"     TO FOUND-ENTRY,
053100                                         AT-LEAST-ONE-FOUND-SW
053200                     ELSE
053300                         NEXT SENTENCE
053400                 ELSE
053500                     NEXT SENTENCE
053600             ELSE
053700                 NEXT SENTENCE
053800         ELSE
053900             NEXT SENTENCE
054000     ELSE
054100         IF END-OF-CHAIN
054200             NEXT SENTENCE
054300         ELSE
054400             MOVE "DBGET DTRANS * 612-GDP" TO BU-DISPLAY-MSG
054500             GO TO 2-BLOWUP.
054600
054700     IF FOUND-ENTRY = "Y"
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO     TO   SAVE-REC-NO
054800         PERFORM 62-PROCESS-DTRANS-ENTRY  THRU 62-PDE-X.
054900
055000 612-GET-DTRANS-CODE.
055100     MOVE "N"                     TO FOUND-ENTRY.
055200     MOVE 11                      TO FIELD-NUMBER.
           MOVE 0 TO COND-WORD.
           READ DTRANS-I-CDE NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF MATLCODE OF DTRANS-REC-I-CDE NOT = MATL-ARG
               MOVE 15 TO COND-WORD.
056000     IF GOOD-CALL
056100         IF TRANS-CODE = "REC" OR "DCHG"
056200             IF TRANS-BALANCE-QTY > 0
056300                 MOVE REC-NO      TO SAVE-REC-ADDR
056400                 MOVE "Y"         TO FOUND-ENTRY,
056500                                     AT-LEAST-ONE-FOUND-SW
056600             ELSE
056700                 NEXT SENTENCE
056800         ELSE
056900             NEXT SENTENCE
057000     ELSE
057100         IF END-OF-CHAIN
057200             NEXT SENTENCE
057300         ELSE
057400             MOVE "DBGET DTRANS * 612-GDC" TO BU-DISPLAY-MSG
057500             GO TO 2-BLOWUP.
057600
057700     IF FOUND-ENTRY = "Y"
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
               MOVE IO-REL-NO     TO   SAVE-REC-NO
057800         PERFORM 62-PROCESS-DTRANS-ENTRY  THRU 62-PDE-X.
057900
058200 62-PROCESS-DTRANS-ENTRY.
058300     MOVE "COROPEN2"              TO  VIEW-NFNAME.
058800
058900     MOVE SPACES                  TO SCREEN-2.
059000     MOVE TRANS-STORES-CODE       TO DE2-CORP-CODE,
059100                                     MATL-ARG,
059200                                     BU-DISPLAY-FLD (1).
059300     MOVE TRANS-PO-NUM            TO DE2-PO-NUMBER,
059400                                     BU-DISPLAY-FLD (2).
059500     MOVE TRANS-VALUE             TO DE2-PO-VALUE.
059600     MOVE TRANS-RCVR-NUM          TO DE2-RCVR.
059700     MOVE TRANS-ITEM-NUM          TO DE2-ITEM-NUMBER.
059800     MOVE TRANS-BALANCE-QTY       TO DE2-OPEN-QUANTITY.
059900     MOVE TRANS-CODE              TO DE2-TRANS-CODE.
060000     MOVE 4                       TO DATE-MODE.
060100     MOVE TRANS-DATE              TO DATE-VALIDATE-IN.
060200     CALL "TDATECHK" USING DATE-CHECK-AREA.
060300     MOVE DATE-SLASH-OUT          TO DE2-TRANS-DATE.
060400     MOVE TRANS-QTY               TO DE2-QUANTITY.
060500     MOVE TRANS-UNIT-MEASURE      TO DE2-UM.
060600     MOVE TRANS-CLASS             TO DE2-CLASS.
060700     MOVE TRANS-DEPT              TO DE2-DEPT.
060800     MOVE TRANS-ACCT              TO DE2-ACCOUNT.
      *SAVE THE DTRANS BUFFER - ENSURE THAT NO CHANGES HAVE BEEN
      *MADE WHILE THE DATA IS ON THE SCREEN
           MOVE BUF-DTRANS              TO COMPARE-DTRANS.
060900
062600 62-SHOWFORM-SCREEN-2.
           MOVE SCREEN-2                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  SCREEN-2.
063300
063400     IF VIEW-LASTKEY = 3
063500         MOVE "Y"                 TO EOJ-SW
063600         GO TO 62-PDE-X
063700     ELSE
063800     IF VIEW-LASTKEY = 7
063900         GO TO 62-PDE-X
064500     ELSE
064600     IF VIEW-LASTKEY = 1 OR
064700        VIEW-LASTKEY = 2 OR
064800        VIEW-LASTKEY = 4 OR
064900        VIEW-LASTKEY = 5 OR
065000        VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 8
065200*        "* INVALID FUNCTION KEY ENTERED *"
065300         MOVE   9 TO LANG-SETNUM
065400         MOVE  10 TO LANG-MSGNUM
065500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE2-MSGLINE
065600         MOVE 15  TO  FIELD-NUMBER
065700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
065800         GO TO 62-SHOWFORM-SCREEN-2.
065900
066000 62-FIELD-EDITS.
           IF DE2-CLASS = SPACES
065200**** CLASS IS REQUIRED
065300         MOVE  45057 TO CATREAD-MSG-NUMBER
065500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE2-MSGLINE
065600         MOVE 22  TO  FIELD-NUMBER
065700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
065800         GO TO 62-SHOWFORM-SCREEN-2.
068300
068400 62-EDIT-DATA.
068500******************************************************
068600**   CHECK TO MAKE SURE OPEN RECEIVER UNITS ARE NOT
068700**   INCREASED.
068800******************************************************
068900
069000     IF DE2-OPEN-QUANTITY > TRANS-BALANCE-QTY
069100*        "CANNOT INCREASE OPEN RECEIVER UNITS CAN ONLY DECREASE"
069200         MOVE 3                   TO LANG-SETNUM
069300         MOVE 173                 TO LANG-MSGNUM
069400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER      TO DE2-MSGLINE
069500         MOVE 18                  TO FIELD-NUMBER
069600         PERFORM 4-PGM-ERROR  THRU 4-PGM-ERROR-X
069700         GO TO 62-SHOWFORM-SCREEN-2.
069800
069900*****************************************************
070000**   MAKE SURE CLASS IS ONLY MODIFIED ON 'DCHG'
070100**   TRANSACTIONS NOT 'REC' TRANSACTIONS.
070200*****************************************************
070300
070400     IF DE2-CLASS NOT = TRANS-CLASS
070500         IF TRANS-CODE = "DCHG"
070600             NEXT SENTENCE
070700         ELSE
070800* "CANNOT CHANGE CLASS ON RECEIVING TRANSACTIONS 'REC' ONLY 'DCHG'
070900             MOVE 3               TO LANG-SETNUM
071000             MOVE 185             TO LANG-MSGNUM
071100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER  TO DE2-MSGLINE
071200             MOVE 22              TO FIELD-NUMBER
071300             PERFORM 4-PGM-ERROR  THRU 4-PGM-ERROR-X
071400             GO TO 62-SHOWFORM-SCREEN-2.

071600*****************************************************
071700**   IF ACCOUNTING CLASS IS CHANGED MAKE SURE ITS
071800**   A VALID CLASS IN 'MCLASS'
071900*****************************************************
072000
072100     IF DE2-CLASS  NOT = TRANS-CLASS
072200         MOVE DE2-CLASS           TO CLASS-ARG
               MOVE CLASS-ARG  TO ACTGCLASS OF MCLASS-REC-I
               READ MCLASS-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS-1 = "2"
073400*                "INVALID ACCOUNTING CLASS "
073500             MOVE 9   TO LANG-SETNUM
073600             MOVE 64  TO LANG-MSGNUM
073700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER  TO DE2-MSGLINE
073800             MOVE 22              TO FIELD-NUMBER
073900             PERFORM 4-PGM-ERROR  THRU 4-PGM-ERROR-X
074000             GO TO 62-SHOWFORM-SCREEN-2.
074500
074600*******************************************************
074700**   EDIT MATERIAL CODE
074800*******************************************************
074900
           MOVE MATL-ARG TO MATLCODE OF MATLACUM-REC-I.
           READ MATLACUM-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
075800         NEXT SENTENCE
075900     ELSE
076000         IF FILE-STATUS-1 = "2"
076100*            "MATERIAL CODE DOES NOT EXIST"
076200             MOVE 13  TO LANG-SETNUM
076300             MOVE 56  TO LANG-MSGNUM
076400             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
076500             MOVE MESSAGE-BUFFER  TO MSG-TEXT
076600             MOVE MATL-ARG        TO MSG-FLD
                   MOVE MESSAGE-BUFFER  TO DE2-MSGLINE
076700             MOVE 15              TO FIELD-NUMBER
076800             PERFORM 4-PGM-ERROR  THRU 4-PGM-ERROR-X
076900             GO TO 62-SHOWFORM-SCREEN-2
077000         ELSE
077100             MOVE "DBGET MMATL-ACCUM* 62-ED" TO BU-DISPLAY-MSG
077200             MOVE MATL-ARG        TO BU-DISPLAY-FLD (1)
077300             GO TO 2-BLOWUP.
077400
077500 62-PROCESS-DATA.
077600     IF DE2-PO-VALUE = TRANS-VALUE  AND
077700        DE2-OPEN-QUANTITY = TRANS-BALANCE-QTY  AND
077800        DE2-CLASS = TRANS-CLASS
077900         NEXT SENTENCE
078000     ELSE
               MOVE SAVE-REC-NO TO PFKEY
               READ DTRANS-PHYSICAL INTO BUF-DTRANS
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                 OR BUF-DTRANS NOT = COMPARE-DTRANS
      *** TRANSACTION TO BE PROCESSED HAS BEEN CHANGED BY ANOTHER USER/
      ***     OR PROCESS -TRY AGAIN
                       MOVE  66334 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO  DE2-MSGLINE
                       MOVE 11              TO  FIELD-NUMBER
                       PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
                       GO TO 62-SHOWFORM-SCREEN-2
                   ELSE
078100                 PERFORM 621-UPDATE-RCVR-TRANS.
078200
078300 62-PDE-X.
078400     EXIT.
078500
078600 621-UPDATE-RCVR-TRANS.
078700     IF TRANS-CODE = "REC"
078800         PERFORM 6211-UPDATE-MMATL-ACCUM.
079100
079200     MOVE DE2-OPEN-QUANTITY       TO TRANS-BALANCE-QTY.
079300     MOVE DE2-PO-VALUE            TO TRANS-VALUE.
079400     MOVE DE2-CLASS               TO TRANS-CLASS.
           REWRITE DTRANS-REC-PHYSICAL FROM BUF-DTRANS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
080400         MOVE "DBUPDATE DTRANS * 621-URT" TO BU-DISPLAY-MSG
080500         GO TO 2-BLOWUP.
080600
080700     IF TRANS-CODE = "REC"
080800         IF RCVR-QTY-CHG = ZEROS
080900             NEXT SENTENCE
081000         ELSE
081100             PERFORM 6211-PUT-INV-TRANS.
081500
081600 6211-UPDATE-MMATL-ACCUM.
081700     COMPUTE OLD-RCVR-UNIT-VALUE ROUNDED = TRANS-VALUE /
081800                                           TRANS-QTY.
081900     COMPUTE NEW-RCVR-UNIT-VALUE ROUNDED = DE2-PO-VALUE /
082000                                           TRANS-QTY.
082100     COMPUTE RCVR-QTY-CHG = TRANS-BALANCE-QTY - DE2-OPEN-QUANTITY.
082200     COMPUTE MATL-RCPT-DOLLARS ROUNDED = MATL-RCPT-DOLLARS -
082300             (OLD-RCVR-UNIT-VALUE * TRANS-BALANCE-QTY).
082400     SUBTRACT TRANS-BALANCE-QTY FROM MATL-UNITS-RCVD-NOT-INV.
082500     COMPUTE MATL-RCPT-DOLLARS ROUNDED = MATL-RCPT-DOLLARS +
082600             (NEW-RCVR-UNIT-VALUE * DE2-OPEN-QUANTITY).
082700     ADD DE2-OPEN-QUANTITY        TO MATL-UNITS-RCVD-NOT-INV.
082800     IF MATL-UNITS-RCVD-NOT-INV = ZEROS
082900         MOVE ZEROS               TO MATL-RCPT-DOLLARS.
083000     COMPUTE MATL-INV-DOLLARS ROUNDED = MATL-INV-DOLLARS +
083100             (RCVR-QTY-CHG * NEW-RCVR-UNIT-VALUE).
083200     ADD RCVR-QTY-CHG             TO MATL-RCPT-UNITS.
           MOVE 1                       TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT            TO MATL-DATE-LAST-UPDATE.
           IF YY-LAST-UPDATE > "70"
               MOVE "19" TO CC-LAST-UPDATE
           ELSE
               MOVE "20" TO CC-LAST-UPDATE.
083300     CALL "SUPDMATL" USING ACCTG-BASE,
083400                           BUF-MATLACUM,
083500                           STATUS-AREA,
083600                           BU-DISPLAY-AREA,
083700                           BU-DISPLAY-FLDS.
083800     IF BU-DISPLAY-MSG NOT = SPACES
083900         GO TO 2-BLOWUP.
084000
084100 6211-PUT-INV-TRANS.
084200     MOVE "INV"                   TO TRANS-CODE.
084300     MOVE RCVR-QTY-CHG            TO TRANS-QTY.
084400     COMPUTE TRANS-VALUE ROUNDED = NEW-RCVR-UNIT-VALUE *
084500                                   RCVR-QTY-CHG.
084600     MOVE ZEROS                   TO TRANS-BALANCE-QTY.
084700     MOVE 1                       TO DATE-MODE.
084800     CALL "TDATECHK" USING DATE-CHECK-AREA.
084900     MOVE DATE-YMD-OUT            TO TRANS-DATE.

           IF TRANS-YY > "70"
               MOVE "19"                TO TRANS-DATE-CC
           ELSE
               MOVE "20"                TO TRANS-DATE-CC.

085000     MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME.
085100     MOVE "TCOROPEN"              TO TRANS-DOCUMENT-NUM.
           WRITE DTRANS-REC-O-PO FROM BUF-DTRANS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
085500         MOVE "PUT DTRANS * 6211-PIT" TO BU-DISPLAY-MSG
085600         GO TO 2-BLOWUP.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PONUM OF DTRANS-REC-O-PO.
           START DTRANS-O-PO KEY > PONUM OF DTRANS-REC-O-PO
               INVALID KEY MOVE "00" TO FILE-STATUS.
090200
       COPY DISPCALL IN COPYLIB.

090300 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

091900 999-CATREAD-EXIT.
092000     EXIT.
