001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID. TCORPRJE.
001300***********************************************************
001400*  THIS PROGRAM IS NEEDED TO REDUCE THE CORPORATE DATA    *
001500*  FOR REQUISITIONS FROM 250 BYTES TO 80 BYTES FOR RJE    *
001600*  TO THE MAINFRAME                                       *
001700***********************************************************
001800 ENVIRONMENT DIVISION.
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER. IBM-AS400.
002100 OBJECT-COMPUTER. IBM-AS400.
002200 INPUT-OUTPUT SECTION.
002300 FILE-CONTROL.
002400     SELECT CORPREQS
               ASSIGN TO DATABASE-CORPREQS
               ORGANIZATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
002500     SELECT CORPRJEF
               ASSIGN TO DATABASE-CORPRJEF
               ORGANIZATION IS SEQUENTIAL.
002600 DATA DIVISION.
002700 FILE SECTION.
002800 FD  CORPREQS
002900     RECORD CONTAINS 250 CHARACTERS
003000     LABEL RECORDS ARE STANDARD
003100     DATA RECORD IS CORPREQS-REC.
003200 01  CORPREQS-REC                      PIC X(250).
003300 FD  CORPRJEF
003400     RECORD CONTAINS 80 CHARACTERS
003500     LABEL RECORDS ARE STANDARD
003600     DATA RECORD IS CORPRJEF-REC.
003700 01  CORPRJEF-REC                      PIC X(80).
003800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1                 PIC X   VALUE "0".
           05  FILE-STATUS-2                 PIC X   VALUE "0".

       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.

003900 01  WORK-REC.
004000     05  WORK-REC-1-80                 PIC X(80).
004100     05  WORK-REC-81-160               PIC X(80).
004200     05  WORK-REC-161-240              PIC X(80).
004300     05  WORK-REC-241-320              PIC X(10).
004400 PROCEDURE DIVISION.
004500 START-PGM.
004600     PERFORM 1-HSK.
004700     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
004800 2-EOJ.
004900     CLOSE CORPREQS, CORPRJEF.
005000     GOBACK.
005100 1-HSK.
005200     OPEN INPUT  CORPREQS.
      **********************************************************
      **   DO A CLEAR PHYSICAL FILE MEMBER ON CORPRJEF        **
      **   TO CLEAR FOR RJE TRANSMISSION                      **
      **********************************************************
           MOVE "CLRPFM FILE(*LIBL/CORPRJEF)" TO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
005300     OPEN OUTPUT CORPRJEF.
005400 6-MAIN.
005500     MOVE SPACES TO WORK-REC.
005600     READ CORPREQS NEXT INTO WORK-REC
005700         AT END GO TO 6-MAIN-EXIT.
005800     WRITE CORPRJEF-REC FROM WORK-REC-1-80.
005900     WRITE CORPRJEF-REC FROM WORK-REC-81-160.
006000     WRITE CORPRJEF-REC FROM WORK-REC-161-240.
006100     WRITE CORPRJEF-REC FROM WORK-REC-241-320.
006200     GO TO 6-MAIN.
006300 6-MAIN-EXIT.    EXIT.
