000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TCOSTVAL.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         DEC 2, 1985.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      MATERIAL ACCUM DATA SET AND PRINT
001000*                      A REPORT SHOWING THE STATUS OF EACH
001100*                      MATERIAL CODE INCLUDING THE UNITS ON HAND
001200*                      THAT HAVE BEEN INVOICED AND THE UNITS THAT
001300*                      HAVE BEEN RECEIVED AND NOT INVOICED.
001400*                      A TOTAL WILL BE CALCULATED FOR EACH CLASS
001500*                      THAT WILL BE USED TO BALANCE AGAINST THE
001600*                      STOREROOM MOVEMENT REPORT.
      *C
      *C   07FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09/04/1996   CA YODER
      *C     RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
      *C
001800 ENVIRONMENT DIVISION.
001900 CONFIGURATION SECTION.
002000 SOURCE-COMPUTER.      HP-3000.
002100 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002300
002400 INPUT-OUTPUT SECTION.
002500 FILE-CONTROL.
           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

002900
003000 DATA DIVISION.
003200 FILE SECTION.
003300
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

003400 FD  ONLINE-PRT
003500     DATA RECORD IS PRT-REC
003600     RECORD CONTAINS 133 CHARACTERS
003700     LABEL RECORDS ARE OMITTED.
003800
003900 01  PRT-REC                      PIC X(133).
004000
004100 SD  SORT-FILE
004200     DATA RECORD IS SORT-REC
004300     RECORD CONTAINS 108 CHARACTERS.
004400
004500 01  SORT-REC.
004600     05  SORT-CLASS               PIC X(4).
004700     05  SORT-MATL-CODE           PIC X(8).
004800     05  SORT-DESCR               PIC X(30).
004900     05  SORT-UNIT-MEAS           PIC XX.
005000     05  SORT-RPT-CODE            PIC XX.
005100     05  SORT-ACCOUNT             PIC X(6).
005200     05  SORT-CUR-ACT-COST        PIC S9(6)V9(4).
005300     05  SORT-CUR-ON-HAND-PD      PIC S9(10).
005400     05  SORT-ON-HAND-VALUE       PIC S9(12)V99.
005500     05  SORT-STD-COST            PIC S9(6)V9(4).
005600     05  SORT-UNITS-RCVD-NOT-INV  PIC S9(10).
005700     05  SORT-WD-FLAG             PIC XX.
005800
006000 WORKING-STORAGE SECTION.
006100
006200 77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
006300 77  LINE-CNT                      PIC 99     VALUE 0.
006400 77  PAGE-CNT                      PIC 9(4)    VALUE 0.
006500 77  PREV-CLASS                    PIC X(4)       VALUE SPACES.
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
006600
006700 COPY SOPNRAV IN COPYLIB.
006800
006900 01  CLASS-TOTALS.
007000     05  CLASS-ONHAND-PD           PIC S9(10)  VALUE 0.
007100     05  CLASS-ONHAND-VALUE        PIC S9(12)V99  VALUE 0.
007200     05  CLASS-RCVD-NOT-PAID       PIC S9(10)  VALUE 0.
007300
007400 01  FINAL-TOTALS.
007500     05  TOT-ONHAND-PD             PIC S9(10)  VALUE 0.
007600     05  TOT-ONHAND-VALUE          PIC S9(12)V99  VALUE 0.
007700     05  TOT-RCVD-NOT-PAID         PIC S9(10)  VALUE 0.
007800
007900 COPY TDATECHK IN COPYLIB.
008000
008100************************************************************
008200**     REPORT PRINT LINES                                 **
008300************************************************************
008400
008500 01  HEADER1.
008600     05  FILLER                     PIC X      VALUE SPACES.
008700     05  FILLER                     PIC X(49)
008800         VALUE "TCOSTVAL".
008900     05  FILLER                     PIC X(67)
009000         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
009100     05  FILLER                     PIC X(5)   VALUE "DATE ".
009200     05  DATE-H1                    PIC X(8)   VALUE SPACES.
009300
009400 01  HEADER2.
009500     05  FILLER                     PIC X      VALUE SPACES.
009600     05  FILLER                     PIC X(6)   VALUE "PAGE".
009700     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
009800     05  FILLER                     PIC X(39)  VALUE SPACES.
009900     05  FILLER                     PIC X(67)
010000         VALUE "  MATERIAL COST VALUE REPORT   ".
010100     05  FILLER                     PIC X(5)   VALUE "TIME ".
010200     05  TIME-H2                    PIC X(8)   VALUE SPACES.
010300
010400 01  HEADER4.
010500     05  FILLER                     PIC X(64) VALUE SPACES.
010600     05  FILLER                     PIC X(14)  VALUE "CURRENT".
010700     05  FILLER                     PIC X(33)
010800         VALUE "ON HAND       CURRENT".
010900     05  FILLER                     PIC X(30)
011000         VALUE "CUR        UNITS RCVD".
011100
011200 01  HEADER5.
011300     05  FILLER                     PIC X  VALUE SPACES.
011400     05  FILLER                     PIC X(46)
011500         VALUE "MATL CODE    DESCRIPTION".
011600     05  FILLER                     PIC X(45)
011700         VALUE "UM RC ACCOUNT    ACT COST      QTY PD".
011800     05  FILLER                     PIC X(49)
011900         VALUE "VALUE            STD COST     NOT INV".
012000
012100 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
012200
012300 01  DETAIL-LINE.
012400     05  FILLER-TOT                 PIC X     VALUE SPACES.
012500     05  PRT-CLASS                  PIC X(3)  VALUE SPACES.
012600     05  FILLER                     PIC X     VALUE SPACES.
012700     05  PRT-MATL-CODE              PIC X(8)  VALUE SPACES.
012800     05  PRT-WRITEDOWN              PIC X     VALUE SPACES.
012900     05  FILLER                     PIC X     VALUE SPACES.
013000     05  PRT-DESCR                  PIC X(30)  VALUE SPACES.
013100     05  FILLER                     PIC XX    VALUE SPACES.
013200     05  PRT-UM                     PIC XX     VALUE SPACES.
013300     05  FILLER                     PIC X      VALUE SPACES.
013400     05  PRT-RC                     PIC XX     VALUE SPACES.
013500     05  FILLER                     PIC X      VALUE SPACES.
013600     05  PRT-ACCOUNT                PIC X(6)   VALUE SPACES.
013700     05  FILLER                     PIC X      VALUE SPACES.
013800     05  PRT-CUR-ACT-COST           PIC ZZZZZZ.ZZZZ-.
013900     05  FILLER                     PIC X(2)   VALUE SPACES.
014000     05  PRT-CUR-ONHAND-PD          PIC Z(10)-.
014100     05  FILLER                     PIC XX     VALUE SPACES.
014200     05  PRT-CUR-VALUE              PIC Z(12).99-.
014300     05  FILLER                     PIC X(2)   VALUE SPACES.
014400     05  PRT-STD-COST               PIC ZZZZZZ.ZZZZ-.
014500     05  FILLER                     PIC X(2)   VALUE SPACES.
014600     05  PRT-UNITS-RCVD-NOT-PD      PIC Z(10)-.
014700
014800 01  PRT-CLASS-LINE.
014900     05  PRT-TOT-DESCR.
015000         10  FILLER                 PIC X  VALUE SPACES.
015100         10  PRT-LITERAL            PIC X(12).
015200         10  PRT-TOT-CLASS          PIC X(3)  VALUE SPACES.
015300         10  FILLER                 PIC X  VALUE SPACES.
015400         10  PRT-CLASS-DESCR        PIC X(57)  VALUE SPACES.
015500     05  PRT-CLASS-CUR-ONHAND-PD    PIC Z(10)-.
015600     05  FILLER                     PIC XX     VALUE SPACES.
015700     05  PRT-CLASS-ONHAND-PD-VAL    PIC Z(12).99-.
015800     05  FILLER                     PIC X(16) VALUE SPACES.
015900     05  PRT-CLASS-RCVD-NOT-INV     PIC Z(10)-.
016000
016200************************************************************
016300**                                                        **
016400**           D A T A B A S E   B U F F E R S              **
016500**                                                        **
016600************************************************************
016700
016800 COPY MATLACUM IN COPYLIB.
016900
017000 COPY MCLASS IN COPYLIB.
017100
017200 COPY MSTORERM IN COPYLIB.
017300
017400**********************************************************
017500*              D A T A    B A S E                        *
017600**********************************************************
017700
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1) VALUE "0".
           05  FILE-STATUS-2    PIC X(1) VALUE "0".

017800 COPY DBCSACCT IN COPYLIB.
017900
018000 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
018100 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
018200
018300 COPY DBMODES IN COPYLIB.
018400
018500 COPY DBSTAT IN COPYLIB.
018600
018700 01  DATASET-NAMES.
018800     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
018900     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
019000     05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
019100
019200 01  ITEMS-LISTING.
019300     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
019400
019500 01  IMAGE-ARGS.
019600     05  MATL-CODE-ARG     PIC X(8)  VALUE SPACES.
019700     05  CLASS-ARG         PIC X(4)  VALUE SPACES.
019800     05  CODE-ARG          PIC X(8)  VALUE SPACES.
019900
020000******************************************************
020100**   PARAMETERS FOR CALLING 'CDESC'
020200******************************************************
020300
020400 COPY CDESC IN COPYLIB.
020500
020600 01  RET-CODE                     PIC X(2)   VALUE SPACES.
020700
020900******************************************
021000**   PARAMETERS FOR CALLING 'CBLOWSRT'
021100******************************************
021200
021300 COPY CBLOWSRT IN COPYLIB.
021400
021500 COPY TBLOWUP IN COPYLIB.
021600
021800 PROCEDURE DIVISION.
021900
022000 001-BEGIN SECTION.
022100
022200 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

022300*******************************************************
022400**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
022500**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
022600**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
022700**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
022800**   OCCURS
022900*******************************************************
023000
023100     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
023200                           ACCTG-BASE,
023300                           BU-PGM-NAME,
023400                           STATUS-AREA,
023500                           DUMMY-VIEW-AREA,
023600                           FILE-STATUS,
023700                           BU-DISPLAY-MSG,
023800                           BU-DISPLAY-FLDS.
023900
024000     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
024100                                     SORT-MATL-CODE
024200         INPUT PROCEDURE IS 050-PROCESS-TRANS
024300         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
024400     PERFORM 1000-CLOSE-FILES.
024500     GOBACK.
024600
024700
024800 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
024900     PERFORM 100-BEGIN.
025000     PERFORM 200-PROCESS-MASTER
025100         UNTIL END-OF-FILE.
025200
025300**********************************************************
025400*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
025500*  FOR SORTING OF RECORDS.                               *
025600**********************************************************
025700
025800     GO TO 699-PROCESS-EXIT.
025900
026000 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
027900
028000     MOVE SPACES                  TO SORT-REC.
028100     MOVE 0                       TO SORT-CUR-ACT-COST
028200                                     SORT-CUR-ON-HAND-PD
028300                                     SORT-ON-HAND-VALUE
028400                                     SORT-STD-COST
028500                                     SORT-UNITS-RCVD-NOT-INV.
      ******* INITIALIZE BUF-MSTORERM FIELDS - DA PLUM 10/24/91
           MOVE SPACES                  TO BUF-MSTORERM.
           MOVE 0                       TO STR-EOQ
                                           STR-REORDER
                                           STR-MAX
                                           STR-EXPEDITE
                                           STR-STD-COST
                                           STR-AVG-COST
                                           STR-PREV-AVG
                                           STR-UM1-CF
                                           STR-UM2-CF
                                           STR-EST-LT
                                           STR-LAST-DLVTIMES (1)
                                           STR-LAST-DLVTIMES (2)
                                           STR-LAST-DLVTIMES (3)
                                           STR-MKT-COST
                                           STR-OUT-REPAIR-COST
                                           STR-MAINT-REPAIR-COST
                                           STR-MTH-FCST
                                           STR-ONHAND
                                           STR-ONORDER
                                           STR-RESERVED
                                           STR-RSRV-ONORD
                                           STR-LOC-ONHAND (1)
                                           STR-LOC-ONHAND (2)
                                           STR-LOC-ONHAND (3)
                                           STR-LOC-ONHAND (4)
                                           STR-LOC-ONHAND (5)
                                           STR-LOC-ONHAND (6)
                                           STR-TAX-PERCENT
                                           STR-SOQ
                                           STR-RAW-LOT.
           PERFORM 9999-INIT-MMATL-ACCUM-MC-I.
028600     PERFORM 400-GET-MMATL-ACCUM.
028700
028900 200-PROCESS-MASTER.
029000     PERFORM 600-BUILD-SORT-REC.
029100     PERFORM 400-GET-MMATL-ACCUM.
029200
029300 400-GET-MMATL-ACCUM.
           PERFORM 9999-DBGET2-MMATL-ACCUM-MC-I.
030100     IF GOOD-CALL
030200         NEXT SENTENCE
030300     ELSE
030400         IF END-OF-FILE
030500             NEXT SENTENCE
030600         ELSE
030700             MOVE "DBGET MMATL-ACCUM * 400-GET" TO BU-DISPLAY-MSG
030800             PERFORM 990-BLOWUP.
030900
031100 600-BUILD-SORT-REC.
031200     MOVE MATL-STORES-CODE        TO SORT-MATL-CODE
031300                                     CODE-ARG.
031400********************************************************
031500**   CALL 'SOPNRAV' TO GET STOREROOM OPEN RECEIVERS
031600**   AND INVOICES
031700********************************************************
031800     MOVE CODE-ARG                TO SOPNRAV-MATL-CODE.
031900     CALL "SOPNRAV" USING ACCTG-BASE,
032000                          SOPNRAV-PARMS,
032100                          STATUS-AREA,
032200                          BU-DISPLAY-MSG,
032300                          BU-DISPLAY-FLDS.
032400     IF BU-DISPLAY-MSG NOT = SPACES
032500         PERFORM 990-BLOWUP.
032600
032700     IF MATL-STORES-CODE = "NON-STR"  OR
032800        MATL-STORES-CODE-1-4 = "OPNR"
032900         NEXT SENTENCE
033000     ELSE
033100         PERFORM 650-GET-MSTORERM
033200         IF NO-ENTRY
033300              IF MATL-STORES-CODE-1-4  IS ALPHABETIC
033400                  PERFORM 610-MOVE-DATA
033500              ELSE
033600                  MOVE "DELT"         TO MATL-STORES-CODE
033700                  PERFORM 610-MOVE-DATA
033800         ELSE
033900             PERFORM 610-MOVE-DATA.
034000
034100     MOVE SPACES                  TO SORT-REC.
034200     MOVE 0                       TO SORT-CUR-ACT-COST
034300                                     SORT-CUR-ON-HAND-PD
034400                                     SORT-ON-HAND-VALUE
034500                                     SORT-STD-COST
034600                                     SORT-UNITS-RCVD-NOT-INV.

034800 610-MOVE-DATA.
034900     MOVE MATL-CLASS              TO SORT-CLASS.
035000     IF MATL-STORES-CODE-1-4 = "INTR"
035100         MOVE "INTRANSIT ENTRY"   TO SORT-DESCR
035200     ELSE
035300     IF MATL-STORES-CODE-1-4 = "ACCR"
035400         MOVE "ACCRUAL ENTRY"     TO SORT-DESCR
035500     ELSE
035600     IF MATL-STORES-CODE-1-4 = "DELT"
035700         MOVE "CODE DELETED FROM CSIS" TO SORT-DESCR
035800         MOVE 0                   TO SORT-STD-COST
035900         MOVE MATL-UNIT-MEASURE   TO SORT-UNIT-MEAS
036000         MOVE MATL-REPORT-CODE    TO SORT-RPT-CODE
036100         MOVE MATL-ACCOUNT        TO SORT-ACCOUNT
036200         MOVE S-STR-OPEN-RCVR-UNITS   TO SORT-UNITS-RCVD-NOT-INV
036300         MOVE 0                   TO SORT-CUR-ACT-COST
036400     ELSE
036500         MOVE 1                   TO CDESC-LINES-TO-GET
036600         MOVE "N"                 TO CDESC-LOCAL-DESC-OPTION
036700         CALL "CDESC"  USING CDESC-RET-CODE, STORES-BASE,
036800             STATUS-AREA, BU-DISPLAY-MSG, MATL-STORES-CODE,
036900                 CDESC-DATA
037000         MOVE CDESC (1)           TO SORT-DESCR
037100         MOVE STR-STD-COST        TO SORT-STD-COST
037200         MOVE MATL-UNIT-MEASURE   TO SORT-UNIT-MEAS
037300         MOVE MATL-REPORT-CODE    TO SORT-RPT-CODE
037400         MOVE MATL-ACCOUNT        TO SORT-ACCOUNT
037500         MOVE S-STR-OPEN-RCVR-UNITS   TO SORT-UNITS-RCVD-NOT-INV
037600         MOVE STR-AVG-COST        TO SORT-CUR-ACT-COST.
037700
037800     COMPUTE SORT-CUR-ON-HAND-PD = MATL-BEG-BAL-UNITS +
037900                                   MATL-RCPT-UNITS +
038000                                   MATL-ADJ-UNITS +
038100                                   MATL-RTN-UNITS +
038200                                   MATL-RTNVAL-UNITS +
038300                                   MATL-ACCTG-UNIT-CORR -
038400                                   MATL-ISSUE-UNITS.
038500
038600     COMPUTE SORT-ON-HAND-VALUE =
038700          MATL-BEG-BAL-DOLLARS + MATL-INV-DOLLARS +
038800          MATL-TOT-ADJ-DOLLARS + MATL-RTN-DOLLARS +
038900          MATL-RTNVAL-DOLLARS + MATL-ACCTG-DOLLAR-CORR -
039000          MATL-TOT-ISS-DOLLARS.
039100
039200     IF MATL-WDOWN-FLAG = 1
039300         MOVE "*"                 TO SORT-WD-FLAG.
039400
039500     RELEASE SORT-REC.
039600
039700 650-GET-MSTORERM.
           PERFORM 9999-DBGET7-MSTORERM-CD-I.
040500     IF GOOD-CALL
040600         NEXT SENTENCE
040700     ELSE
040800         IF NO-ENTRY
040900             NEXT SENTENCE
041000         ELSE
041100             MOVE "DBGET MSTORERM * 650-GM" TO BU-DISPLAY-MSG
041200             MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
041300             PERFORM 990-BLOWUP.
041400
041600 699-PROCESS-EXIT.
041700     EXIT.
041800
041900 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
042000     DISPLAY "BEGIN REPORT".
042100     PERFORM 710-BEGIN-REPORT.
042200     PERFORM 720-PROCESS-CLASS
042300        UNTIL NO-MORE-SORT = "YES".
042400     PERFORM 725-END-REPORT.
042500
042600**************************************************
042700**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
042800**  TO COMPLETE PROCESSING OF REPORT            **
042900**************************************************
043000
043100     GO TO 799-CREATE-EXIT.
043200
043300 710-BEGIN-REPORT.
043400     OPEN OUTPUT ONLINE-PRT.
043500     RETURN SORT-FILE
043600        AT END
043700            MOVE "YES" TO NO-MORE-SORT.
043800
043900 720-PROCESS-CLASS.
044000     PERFORM 721-BEGIN-CLASS.
044100     PERFORM 722-PROCESS-TRANS
044200         UNTIL SORT-CLASS NOT = PREV-CLASS
044300              OR NO-MORE-SORT = "YES".
044400     PERFORM 723-END-CLASS.
044500
044600 721-BEGIN-CLASS.
044700     MOVE SORT-CLASS              TO PREV-CLASS.
044800     MOVE 0                       TO CLASS-ONHAND-PD
044900                                     CLASS-ONHAND-VALUE
045000                                     CLASS-RCVD-NOT-PAID.
045100     PERFORM 750-PRINT-HEADINGS.
045200
045400 722-PROCESS-TRANS.
045500     MOVE SORT-CLASS              TO PRT-CLASS.
045600     MOVE SORT-MATL-CODE          TO PRT-MATL-CODE.
045700     MOVE SORT-DESCR              TO PRT-DESCR.
045800     MOVE SORT-CUR-ACT-COST       TO PRT-CUR-ACT-COST.
045900     MOVE SORT-CUR-ON-HAND-PD     TO PRT-CUR-ONHAND-PD.
046000     MOVE SORT-ON-HAND-VALUE      TO PRT-CUR-VALUE.
046100     MOVE SORT-STD-COST           TO PRT-STD-COST.
046200     MOVE SORT-UNITS-RCVD-NOT-INV TO PRT-UNITS-RCVD-NOT-PD.
046300     MOVE SORT-WD-FLAG            TO PRT-WRITEDOWN.
046400     MOVE SORT-UNIT-MEAS          TO PRT-UM.
046500     MOVE SORT-RPT-CODE           TO PRT-RC.
046600     MOVE SORT-ACCOUNT            TO PRT-ACCOUNT.
046700     WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
046800     ADD 1 TO LINE-CNT.
046900     IF LINE-CNT > 55
047000         PERFORM 750-PRINT-HEADINGS.
047100     ADD SORT-CUR-ON-HAND-PD      TO CLASS-ONHAND-PD.
047200     ADD SORT-ON-HAND-VALUE       TO CLASS-ONHAND-VALUE.
047300     ADD SORT-UNITS-RCVD-NOT-INV  TO CLASS-RCVD-NOT-PAID.
047400     RETURN SORT-FILE
047500        AT END
047600             MOVE "YES" TO NO-MORE-SORT.
047700
047800 723-END-CLASS.
047900     MOVE PREV-CLASS              TO PRT-TOT-CLASS
048000                                     CLASS-ARG.
           PERFORM 9999-DBGET7-MCLASS-CL-I.
048800     IF GOOD-CALL
048900         MOVE MCLASS-CLASS-DESCR TO PRT-CLASS-DESCR
049000     ELSE
049100         IF NO-ENTRY
049200             MOVE SPACES         TO PRT-CLASS-DESCR
049300         ELSE
049400             MOVE "DBGET MCLASS * 723-EC" TO BU-DISPLAY-MSG
049500             MOVE CLASS-ARG      TO BU-DISPLAY-FLD (1)
049600             PERFORM 990-BLOWUP.
049700     MOVE CLASS-ONHAND-PD        TO PRT-CLASS-CUR-ONHAND-PD.
049800     MOVE CLASS-ONHAND-VALUE     TO PRT-CLASS-ONHAND-PD-VAL.
049900     MOVE CLASS-RCVD-NOT-PAID    TO PRT-CLASS-RCVD-NOT-INV.
050000     MOVE "TOTAL CLASS"          TO PRT-LITERAL.
050100     WRITE PRT-REC FROM PRT-CLASS-LINE AFTER ADVANCING 2.
050200     MOVE SPACES                 TO PRT-CLASS-LINE.
050300     ADD CLASS-ONHAND-PD         TO TOT-ONHAND-PD.
050400     ADD CLASS-ONHAND-VALUE      TO TOT-ONHAND-VALUE.
050500     ADD CLASS-RCVD-NOT-PAID     TO TOT-RCVD-NOT-PAID.
050600
050800 725-END-REPORT.
050900     MOVE TOT-ONHAND-PD          TO PRT-CLASS-CUR-ONHAND-PD.
051000     MOVE TOT-ONHAND-VALUE       TO PRT-CLASS-ONHAND-PD-VAL.
051100     MOVE TOT-RCVD-NOT-PAID      TO PRT-CLASS-RCVD-NOT-INV.
051200     MOVE "TOTAL VALUE"          TO PRT-TOT-DESCR.
051300     WRITE PRT-REC FROM PRT-CLASS-LINE AFTER ADVANCING 2.
051400     MOVE SPACES                 TO PRT-CLASS-LINE.
051500
051700 750-PRINT-HEADINGS.
051800     MOVE 1                       TO DATE-MODE.
051900     CALL "TDATECHK" USING DATE-CHECK-AREA.
052000     MOVE DATE-SLASH-OUT          TO DATE-H1.
052100     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
052200     ADD 1                        TO PAGE-CNT.
052300     MOVE PAGE-CNT                TO PAGE-H2.
052400     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
052500     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
052600     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
052700     WRITE PRT-REC FROM HEADER5 AFTER ADVANCING 1 LINES.
052800     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1 LINES.
052900     MOVE 6                       TO LINE-CNT.
053000
053200 799-CREATE-EXIT.
053300     EXIT.
053400
053500 900-ERROR SECTION.
053600
053700 990-BLOWUP.
053800
053900***************************************************************
054000**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
054100**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
054200**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
054300**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
054400**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
054500**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
054600**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
054700**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
054800**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
054900**   PROBLEM IS AVOIDED.                                     **
055000***************************************************************
055100
055200     MOVE "TCOSTVAL"              TO  BU-PGM-NAME.
055300     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
055400                           ACCTG-BASE,
055500                           BU-PGM-NAME,
055600                           STATUS-AREA,
055700                           DUMMY-VIEW-AREA,
055800                           FILE-STATUS,
055900                           BU-DISPLAY-MSG,
056000                           BU-DISPLAY-FLDS.
056100
056400 1000-CLOSE-FILES.
056500     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-DBGET2-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           READ MMATL-ACCUM-MC-I NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MMATL-ACCUM-MC-I.
           MOVE SPACES TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           START MMATL-ACCUM-MC-I KEY >= MATLCODE OF
              MMATL-ACCUM-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MCLASS-CL-I          .

       9999-CLOSE-STUFF.
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MCLASS-CL-I          .
