       IDENTIFICATION DIVISION.
       PROGRAM-ID.        TCRTE311.
       AUTHOR.            CA YODER.
       DATE-WRITTEN.      SEPTEMBER 1995.
       DATE-COMPILED.
      *INSTALLATION.      THE GOODYEAR TIRE & RUBBER COMPANY.
      *REMARKS.
      *
      ******************************************************************
      *D   T C R T E 3 1 1  --  CREATE TC 311 FOR FAYETTEVILLE         *
      *D     THIS PROGRAM CREATES 311 TRANSACTIONS FOR CORPORATE       *
      *D     CODES WHICH HAVE THE OUTSIDE REPAIR FLAG OR THE           *
      *D     MAINTENANCE REPAIR FLAG TURNED ON.                        *
      ******************************************************************
      *
      *C   06/10/1996      CA YODER
      *C     RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.     IBM-AS400.
       OBJECT-COMPUTER.     IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-IO
               ASSIGN        TO DATABASE-MCFLCS0201
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS   IS FILE-STATUS.

           SELECT DDAILYTC-O
               ASSIGN        TO DATABASE-MCFLCS1601
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS   IS FILE-STATUS.

            SELECT MPLTINFO-I
                   ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM-IO
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-IO.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-O-REC.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       WORKING-STORAGE SECTION.

      *----------------------------------------------------------------*
      *             D A T A B A S E   B U F F E R S                    *
      *----------------------------------------------------------------*

       COPY MSTORERM   IN COPYLIB.

       COPY DDAILYTC   IN COPYLIB.

       COPY TC311      IN COPYLIB.

       COPY MPLT0      IN COPYLIB.

       COPY MPLTP01    IN COPYLIB.

      *----------------------------------------------------------------*
      *                    H O L D   A R E A S                         *
      *----------------------------------------------------------------*

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X    VALUE "0".
           05  FILE-STATUS-2             PIC X    VALUE "0".

       01  MSTORERM-EOF-SW               PIC X    VALUE "N".

       01  CODE-ARG                      PIC X(8).

       01  CURRENT-DATE                    VALUE SPACES.
           05  CUR-YY             PIC X(2).
           05  CUR-MM             PIC X(2).
           05  CUR-DD             PIC X(2).

       01  CURRENT-TIME                    VALUE SPACES.
           05  CUR-HR             PIC X(2).
           05  CUR-MIN            PIC X(2).
           05  CUR-SEC            PIC X(2).

      *----------------------------------------------------------------*
      *               U T I L I T Y   A R E A                          *
      *----------------------------------------------------------------*

       COPY TBLOWUP    IN COPYLIB.

       COPY VCOMAREA   IN COPYLIB.

       COPY DATAB      IN COPYLIB.


      *--------- P R O C E D U R E   D I V I S I O N ------------------*

       PROCEDURE DIVISION.
       0-BEGIN.
           PERFORM 1-HSK.
           IF MSTORERM-EOF-SW NOT = "Y"
               PERFORM 6-MAIN THRU 6-MAIN-X UNTIL
                                            MSTORERM-EOF-SW = "Y".
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O    MSTORERM-IO
                       DDAILYTC-O
                INPUT  MPLTINFO-I.

           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERROR MPLTINFO * 100-HSK"
                   TO BU-DISPLAY-MSG
               PERFORM 9999-BLOWUP.

           ACCEPT CURRENT-DATE FROM DATE.
           ACCEPT CURRENT-TIME FROM TIME.

           MOVE CURRENT-DATE       TO  DDAILYTC-DATE.
           MOVE CURRENT-TIME       TO  DDAILYTC-TIME.
           MOVE MPLTINFO-COMPANY   TO  DDAILYTC-PLT.

           PERFORM 9999-READ-FIRST-MSTORERM.

       2-EOJ.
           CLOSE       MSTORERM-IO
                       DDAILYTC-O
                       MPLTINFO-I.

       6-MAIN.
           IF MSTORERM-EOF-SW = "Y"
               GO TO 6-MAIN-X.
           IF STR-OUT-REP = "X" OR STR-MAINT = "X"
               PERFORM 60-WRITE-TC311.
           PERFORM 9999-READ-NEXT-MSTORERM.

       6-MAIN-X.
           EXIT.

       60-WRITE-TC311.
           MOVE "311"                    TO  DDAILYTC-TC.
           MOVE SPACES                   TO  DDAILYTC-DATA.
           MOVE CORP-CODE                TO  TC311-CORP-CODE.
           MOVE "1"                      TO  TC311-ID-1.
           MOVE STR-PREV-CODE            TO  TC311-PREV-CODE.
           MOVE STR-AUTHOR               TO  TC311-AUTHOR.
           MOVE STR-CLASS                TO  TC311-CLASS.
           MOVE STR-DIR-CHRG-DEPT        TO  TC311-DIR-CHRG.
           MOVE STR-DFLT-DEPT            TO  TC311-DEPT-CHG.
           MOVE STR-WR-DOWN              TO  TC311-WR-DOWN.
           MOVE STR-STOCK-OT             TO  TC311-STOCK-OT.
           MOVE STR-IMPORT-IND           TO  TC311-IMPORT.
           MOVE STR-INS-ITM              TO  TC311-INS-ITM.
           MOVE STR-ORD-ENG              TO  TC311-ORD-ENG.
           MOVE STR-OUT-REP              TO  TC311-OUT-REP.
           MOVE STR-MAINT                TO  TC311-MAINT.
           MOVE STR-LOC (1)              TO  TC311-STOCK-LOC.
           PERFORM 9999-WRITE-DDAILYTC.

       9999-READ-FIRST-MSTORERM.
           READ MSTORERM-IO FIRST INTO BUF-MSTORERM
               AT END MOVE "Y" TO MSTORERM-EOF-SW.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST MSTORERM * 9999-RFM" TO BU-DISPLAY-MSG
               PERFORM 9999-BLOWUP.

       9999-READ-NEXT-MSTORERM.
           READ MSTORERM-IO NEXT INTO BUF-MSTORERM
               AT END MOVE "Y" TO MSTORERM-EOF-SW.

       9999-WRITE-DDAILYTC.
           WRITE DDAILYTC-O-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE ERR DDAILYTC" TO BU-DISPLAY-MSG
               PERFORM 9999-BLOWUP.

       9999-BLOWUP.
           MOVE "TCRTE311"        TO  BU-PGM-NAME.
           MOVE CODE-ARG          TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP"  USING  BASE, BU-PGM-NAME, STATUS-AREA,
                                  VIEW-COMAREA, FILE-STATUS,
                                  BU-DISPLAY-MSG, BU-DISPLAY-FLDS.

