       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TCSASTRN.
       AUTHOR.              C.I.HILLES.
       DATE-WRITTEN.        3/27/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *D   REMARKS.
      *D
      *D   FLEXIBLE REPORT OF DTRANS DATASET IN THE CSACCT DATABASE.   R
      *D   CAN HAVE MANY SELECT AND SORT OPTIONS.  REPLACES THE
      *D   INVOICE BY CLASS REPORT.
      *D
      *C   07/08/1992          DAVE PLUM            REQUEST #6067
      *C   ADDED THE FOLLOWING 2 ENHANCEMENTS WHICH HAD PREVIOUSLY
      *C   BEEN ADDED TO THE HP-3000 VERSION OF THIS PROGRAM:
      *C   1) REVERSE THE SIGN (MULTIPLY BE -1) OF VALUE FIELD FOR
      *C      REPORTING PURPOSES FOR THE FOLLOWING TRANSACTIONS:
      *C      RET, RETV, AADJ, AND SADJ
      *C   2) REPLACE THE EMPLOYEE/CARRIER VALUE OF "CANC" (CANCELLED)
      *C      WITH THE ORIGINAL CARRIER ON "FRT" RECORDS.  THIS IS
      *C      ATTEMPTED BY READING THE DATASET DAPPLFRT USING
      *C      PRO NUMBER (DOCUMENT NUMBER FIELD IN DTRANS).  THIS
      *C      CHANGE ASSISTS THOSE USERS WHICH ATTEMPT TO BALANCE THE
      *C      FREIGHT STATUS REPORT TO A CSAS TRANSACTIONS REPORT OF
      *C      ALL "FRT" ENTRIES SORTED BY CARRIER CODE.  THESE
      *C      "CANCELLED FREIGHT" ENTRIES ON THIS REPORT WILL ALSO BE
      *C      FLAGGED WITH AN "*" TO INDICATE THEIR CANCELLED STATUS.
      *C   COMPLETED THESE CHANGES ON 7/20/1992.
      *C
      *C   07/13/93            DAVE PLUM
      *C   REVISED THIS PROGRAM TO CONFORM TO THE CHANGES MADE IN THE
      *C   OVERHAUL OF THE FREIGHT ACCOUNTING APPLICATION INCLUDING:
      *C      - NEW DAPPLFRT DATASET FORMAT
      *C      - ELIMINATION OF DTRANS "FRT" ENTRIES WITH "CANC" AS THE
      *C        EMPLOYEE/CARRIER
      *C
      *C   07FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   FEB 28, 1994  CR KALMAN  REQUEST #6477
      *C   CHANGED SCREEN TO ALLOW USER TO TO REQUEST THAT KEYWORD
      *C   AND MODIFIER APPEAR ON REPORT. THE CODE FOR THIS ALREADY
      *C   EXISTED BUT THE USER HAD NO WAY TO REQUEST IT.
      *C
      *C   APR 24, 1995  CA ZUBEK   REQUEST #95-014
      *C   ADDED LOGIC AND FIELDS TO ALLOW PRINTING A REPORT THAT
      *C   INCLUDES TRANSACTIONS FROM THE CURRENT MONTH AND THE
      *C   PREVIOUS MONTH.  ALSO ADDED THE CAPABILITY TO SPECIFY
      *C   EIGHT MORE DEPARTMENTS FOR THE REPORT.
      *C
      *C   JUNE 6, 1995  CA YODER   REQUEST #95-014
      *C   MADE THE FOLLOWING CHANGES FOR PHASE 2 OF THIS REQUEST:
      *C     1.  COPIED THE SCREEN "FCSASTRN" IN "ZRSCREEN" TO A NEW
      *C         SCREEN CALLED "FCSASTRB" TO SHOW THE DEFAULTS REQUESTED
      *C         BY LAWTON.  ** N O T E:  IF A CHANGE IS MADE TO EITHER
      *C         ONE OF THESE SCREENS, MAKE SURE TO MAKE THE CHANGE TO
      *C         THE OTHER ONE ALSO.
      *C     2.  ADDED A TABLE AND FIELDS TO KEEP TRACK OF SUBTOTALS BY
      *C         ACCOUNT NUMBER FOR THE SUMMARY REPORT (ONLY FOR OPTION
      *C         10).  ADDED LOGIC TO PRINT THIS REPORT AFTER THE DETAIL
      *C         REPORT.
      *C     3.  ADDED HIDDEN FIELD TO "FCSASTRN" AND "FCSASTRB" TO PRINT
      *C         THE CHARACTER "Z" ON THE SECOND OUTPUT RECORD (INPUT FOR
      *C         THIS PROGRAM) SO THE RECORD WILL BE WRITTEN EVEN IF NO
      *C         DEPARTMENT IS ENTERED ON THE SCREEN.  (THE "Z" IS IN
      *C         THE FIRST POSITION OF THE FILLER.)
      *C
      *C   JULY 19, 1995  CA YODER
      *C   ADDED AN ADDITIONAL CHECK IN THE SUMMARY REPORT TABLE LOGIC TO
      *C   MAKE SURE A HOLD FIELD IS MOVED PROPERLY.  (LAWTON REPORTED A
      *C   A PROBLEM WITH THE CLASS 250 TOTALS.)
      *C
      *C   15AUG1995   DAVE PLUM
      *C     REVISED THE DTRANS2 LOGIC TO HANDLE THE CASE WHERE THERE ARE
      *C     EXACTLY ZERO RECORDS IN THE DTRANS2 FILE.
      *C
      *C   10APR1996   DAVE PLUM
      *C     REVISED THE WAY THE PROGRAM HANDLES THE INCLUDE-PREV-MTH
      *C     VARIABLE.  THIS FIELD WILL NOW BE SET TO "X" WHEN THE USER
      *C     HAS SPECIFIED A DATE RANGE, INSTEAD OF DEFAULTING TO SPACES.
      *C     BY SETTING THIS FIELD TO "X" WHEN A USER REQUESTS A
      *C     SPECIFIC DATE RANGE, THE USER WILL GET ALL OF THE RECORDS
      *C     WHICH FALL WITHIN THAT DATE RANGE.  BY SETTING THIS FIELD
      *C     TO SPACES; INV, REC, AND DCHG TRANSACTIONS WITH A DOCUMENT
      *C     NUMBER OF "PROC" WERE  BEING EXCLUDED FROM THE REPORT EVEN
      *C     IF THEY FELL WITHIN THE DATE RANGE SPECIFIED.
      *C
      *C   18APR1996   CA YODER   REQ #96-001
      *C     ADDED A SUBTOTAL FOR SR50 REPORT IN LAWTON TO SHOW
      *C     ENGINEERING EXPENSES FOR EACH DEPARTMENT.  ENGINEERING
      *C     EXPENSES HAVE EXPENSE CODES BETWEEN 000001 AND 000099
      *C     AND ALSO INCLUDE CODE 000250.  ALSO ADDED TOTAL LINE
      *C     SHOWING OPERATING EXPENSES (TOTAL VALUE - ENGINEERING
      *C     EXPENSES).
      *C
      *C   13JUN1996   CA YODER
      *C     ADDED CLASSES 254 AND 242 TO THE LIST OF ENGINEERING
      *C     EXPENSE CLASSES FOR LAWTON PER J. SHRADER REQUEST.
      *C     THEY ARE INCLUDED IN 250 FOR THE BODY OF THE REPORT
      *C     BUT NOT FOR THE SUMMARY.
      *C
      *C   03SEP1996   CA YODER
      *C     MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
      *C   30SEP1996   DAVE PLUM
      *C     REVISED PROGRAM TO CAUSE THE SPECIAL LAWTON ONLY LOGIC TO
      *C     APPLY TO UNION CITY ALSO.
      *C
      *C   17DEC1997   CA YODER    REQ #97-016
      *C     ADDED OPTION TO EXCLUDE TRANSACTIONS FOR THE STOREROOM
      *C     DEPARTMENT.
      *C
DP9802*C   23FEB1998   DAVE PLUM
DP9802*C     ADDED LOGIC TO ADVISE THE USER WHEN AN INVALID DATE IS
DP9802*C     INPUT FOR OPT-LOW-DATE AND/OR OPT-HIGH-DATE.
DP9802*C
JC9809*C   17SEP1998   JE COFFMAN
JC9809*C     ADDED LOGIC TO CALL CNDESC WHEN NON-STR ITEM EXISTS
JC9809*C     AND USER NEEDS TO SEE 1ST LINE OF PURCHASE ORDER
JC9809*C     DESCRIPTION INFORMATION. REQUESTED BY RONNIE RHODES
JC9809*C     IN TOPEKA.
JC9809*C
JC9910*C   12OCT1999   JE COFFMAN
JC9910*C     REPAIRED A PROBLEM FOR LAWTON WHERE THEY WERE LOOKING
JC9910*C     FOR RECORDS FOR A SPECIFIC CLOCK CARD BUT THE PROGRAM
JC9910*C     WAS PRODUCING A BOGUS REPORT AS IT WAS INCLUDING BLANK
JC9910*C     EMPLOYEE RECORDS AS WELL.
JC9910*C
DP0401*C  26JAN2004    DAVE PLUM
DP0401*C     EXPANDED THE TC-TOTAL-ARRAY FROM 75 TO 900 ROWS.
DP0401*C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS400.
       OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES.  C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE    ASSIGN TO DISK-SORT.

      *------ SELECT STATEMENTS FOR IBM ONLY ------*
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS2-MC-I
               ASSIGN TO DATABASE-MCFLCA1201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DAPPLFRT-FP-I
               ASSIGN TO DATABASE-MCFLCA1104
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

      *------ SELECT STATEMENTS FOR IBM ONLY ------*

       DATA DIVISION.
       FILE SECTION.

       FD  PRINT-FILE
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                PIC X(132).

       SD  SORT-FILE
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-STORES-CODE          PIC X(8).
           05  SORT-CLASS                PIC X(4).
           05  SORT-DEPT                 PIC X(6).
           05  SORT-ACCT                 PIC X(6).
           05  SORT-PO-NUM.
               10  SORT-ORDER-NUM        PIC X(7).
               10  SORT-RELEASE          PIC X(3).
           05  SORT-RCVR-NUM             PIC X(4).
           05  SORT-ITEM-NUM             PIC X(4).
           05  SORT-CODE                 PIC X(4).
           05  SORT-DATE-CN.
               10  SORT-CC               PIC XX.
               10  SORT-DATE.
                   15  SORT-YY           PIC XX.
                   15  SORT-MM           PIC XX.
                   15  SORT-DD           PIC XX.
           05  SORT-TIME.
               10  SORT-HOURS            PIC XX.
               10  SORT-MINUTES          PIC XX.
               10  SORT-SECONDS          PIC XX.
           05  SORT-EMP                  PIC X(4).
           05  SORT-QTY                  PIC S9(10).
           05  SORT-VALUE                PIC S9(12)V99.
           05  SORT-DOCUMENT-NUM.
               10  SORT-MANIFEST-NO      PIC X(3).
               10  SORT-REGISTER-NO      PIC X(9).
           05  SORT-UNIT-MEASURE         PIC XX.
           05  SORT-BALANCE-QTY          PIC S9(10).
           05  SORT-EXP-CAT              PIC X(1).
           05  SORT-CANCELLED-FLAG       PIC X(1).
           05  SORT-DLVR-CARR            PIC X(4).

      *------ FD STATEMENTS FOR IBM ONLY ------*
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  DTRANS2-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS2-MC-REC-I.
           COPY DDS-MCRPCA1200  OF MCFLCA1201.

       FD  DAPPLFRT-FP-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-FP-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1104.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MACCOUNT-INFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-I-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

      *------ FD STATEMENTS FOR IBM ONLY ------*

       WORKING-STORAGE SECTION.

       77  HOLD-DLVR-CARR                PIC X(4).
       77  HOLD-CARRIER                  PIC X(4).
       77  CANCELLED-FLAG                PIC X(1)   VALUE "N".
       77  HANDLE-BLOWUP-FLAG            PIC X(1)   VALUE "Y".
       77  FOUND-IT                      PIC X(1).
       77  EOF-SW                        PIC X(1)   VALUE "N".
       77  PAGE-COUNT                    PIC 9(4)   VALUE ZEROS.
       77  LINE-COUNT                    PIC S9(5) COMP-4 VALUE 0.
       77  SUB                           PIC S9(4)  COMP-4.
       77  SUB-2                         PIC S9(4)  COMP-4.
       77  COMP-ESC-SEQ                  PIC X(8)  VALUE SPACES.
       77  STAND-ESC-SEQ                 PIC X(8)  VALUE SPACES.
       77  END-OF-FILE-FLAG              PIC X(1).
       77  FOUND-DEPT-FLAG               PIC X(1).
       77  SAVE-TOTAL-COST               PIC S9(14)V9(4) VALUE 0.
       77  FIRST-TIME-FLAG               PIC X(1).
       77  SAVE-DEPT                     PIC X(4).
       77  RPT-TOTAL-FLAG                PIC X(1).
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
       77  SAVE-STR-DEPT                 PIC X(6)  VALUE SPACES.
       77  INVALID-DATE-FLAG             PIC X(1)  VALUE "N".

      *-------- ACCOUNT FOR CENTURY.
       01  SAVE-LOW-DATE-CN.
           05  SAVE-LOW-DATE-CC          PIC XX.
           05  SAVE-LOW-DATE.
               10  SAVE-LOW-DATE-YY      PIC XX.
               10  FILLER                PIC X(4).

       01  SAVE-HIGH-DATE-CN.
           05  SAVE-HIGH-DATE-CC         PIC XX.
           05  SAVE-HIGH-DATE.
               10  SAVE-HIGH-DATE-YY     PIC XX.
               10  FILLER                PIC X(4).

       01  JUST-1-TC                     PIC X(1).
       01  FOUND-TC                      PIC X(1).
DP0401 01  NUM-TCS-FOUND                 PIC 9(3)  VALUE 0.
       01  TC-TOTAL-ARRAY.
DP0401     05  TC-TOTAL-LINE OCCURS 900 TIMES.
               10  TC-TOTAL-TYPE         PIC X(4).
               10  TC-TOTAL              PIC S9(14)V9(4).
               10  TC-COUNT              PIC 9(5).
       01  CHECK-DTRANS2-SW              PIC X     VALUE "N".
       01  DTRANS-EOF-SW                 PIC X     VALUE "N".
       01  HOLD-ACCT                     PIC X(6).
      *--- THIS TABLE HOLDS THE VALUES TO BE ACCUMULATED FOR THE SUMMARY
      *--- REPORT.
       01  SUMMARY-TABLE.
           05  TBL-DATA OCCURS 400 TIMES.
               10  TBL-ACCT              PIC X(6).
               10  TBL-VALUE             PIC S9(12)V99.
       01  TEMP-ACCT                     PIC X(6).
       01  TEMP-VALUE                    PIC S9(12)V99.
       01  ADDR1                         PIC 9(3).
       01  ADDR2                         PIC 9(3).
       01  ADDR3                         PIC 9(3).
       01  ADDR4                         PIC 9(3).
       01  SUM-TOT-HOLD                  PIC S9(12)V99.
       01  HOLD-DEPT-VALUE               PIC S9(12)V99.
       01  HOLD-OPR-VALUE                PIC S9(12)V99.
       01  DEPT-TOTAL-TABLE.
           05  DEPT-TOTAL-LINE OCCURS 6 TIMES.
               10  DEPT-TRANS            PIC X(4).
               10  DEPT-TOTALS.
                   15  DEPT-ENG          PIC S9(12)V99.
                   15  DEPT-OPR          PIC S9(12)V99.

       01  BREAK-TOTALS-WORK.
           05  L1-COUNT                  PIC 9(8)  VALUE 0.
           05  L1-TOTAL-COST             PIC S9(14)V9(4) VALUE 0.
           05  L2-COUNT                  PIC 9(8)  VALUE 0.
           05  L2-TOTAL-COST             PIC S9(14)V9(4) VALUE 0.
           05  RPT-COUNT                 PIC 9(8)  VALUE 0.
           05  RPT-TOTAL-COST            PIC S9(14)V9(4) VALUE 0.
           05  BREAK-FLD-L1              PIC X(14).
           05  BREAK-FLD-L2              PIC X(14).
           05  TEST-BREAK-L1             PIC X(14).
           05  TEST-BREAK-L2             PIC X(14).
           05  BREAK-FLAG-L1             PIC X(1).
           05  BREAK-FLAG-L2             PIC X(1).

       01  LAWTON-ENG-ACCT               PIC X(6).
           88  ENG-ACCT      VALUE "000001" THRU "000099", "000242",
                                                 "000250", "000254".

      *-------- DON'T INCLUDE 242 & 254 IN 250 ON SUMMARY REPORT.
       01  LAWTON-ENG-ACCT-RPT           PIC X(6).
           88  ENG-ACCT-RPT  VALUE "000001" THRU "000099", "000250".

      **************************************************************
      **                                                          **
      **       S U B P R O G R A M   A R E A S                    **
      **                                                          **
      **************************************************************

       COPY TDATECHK IN COPYLIB.
       COPY TBLOWUP  IN COPYLIB.
       COPY OVRPFDAT IN COPYLIB.
       COPY CCHKOBJ  IN COPYLIB.
       COPY TRSHIFT  IN COPYLIB.
       COPY TUMCF    IN COPYLIB.
       COPY CDESC    IN COPYLIB.
       COPY CNDESC   IN COPYLIB.
       COPY TNRQDESC IN COPYLIB.
       COPY CEARQPH  IN COPYLIB.
       COPY CEARQPH2 IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.
       COPY MACTINFO IN COPYLIB.

      *------ PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       01  HD-RET-CODE                   PIC S9(4) COMP-4 VALUE 0.
       01  HD-FILE-NAME                  PIC X(17) VALUE "DHDR67.PUB".
       01  FNUM                          PIC S9(4) COMP-4 VALUE 0.

       COPY ESCMAIN   IN COPYLIB.

       01  RET-CODE                      PIC X(2)  VALUE SPACES.

      **************************************************************
      **                                                          **
      **           D A T A B A S E   W O R K                      **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       COPY DATAB IN COPYLIB.

       01  CSACCT                        PIC X(9)  VALUE "  CSACCT;".
       01  PASSWORD-CSACCT               PIC X(7)  VALUE "ACTION;".
       01  MMATL-CODE-ARG                PIC X(8).
       01  MATLCODE-SEARCH               PIC X(16) VALUE "MATL-CODE;".
       01  PO-ARG.
           05  FILLER                    PIC X     VALUE "P".
           05  PO-ARG1-7                 PIC X(7)  VALUE SPACES.
           05  PO-ARG8-10                PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE "000".
       01  PO-ITEM-ARG                   PIC X(4)  VALUE "0001".
       01  PRONO-SEARCH                  PIC X(16) VALUE "FRT-PRO-NO;".
       01  PRO-NO-ARG                    PIC X(16).
       01  CARRIER-ARG                   PIC X(4).
       01  MACCT-KEY                     PIC X(4)   VALUE SPACES.

       01  DSET-NAMES.
           05  DSET-NAME                 PIC X(16) VALUE SPACES.
           05  DSET-DTRANS               PIC X(16) VALUE "DTRANS;".
           05  DSET-DAPPLFRT             PIC X(16) VALUE "DAPPLFRT;".

       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************

       COPY DTRANS     IN COPYLIB.
       COPY DAPPLFRT   IN COPYLIB.

      **************************************************************
      **                                                          **
      **       H E A D E R   &   D E T A I L   L I N E S          **
      **                                                          **
      **************************************************************

       01  HDR-1.
           05  FILLER                    PIC X(6)   VALUE "PAGE ".
           05  PAGE-H1                   PIC ZZZ9.
           05  FILLER                    PIC X(5)   VALUE SPACES.
           05  FILLER                    PIC X(8)   VALUE "TCSASTRN".
           05  FILLER                    PIC X(30)  VALUE SPACES.
           05  FILLER                    PIC X(31)
               VALUE "MONTH-TO-DATE CSAS TRANSACTIONS".
           05  FILLER                    PIC X(20)  VALUE SPACES.
           05  FILLER                    PIC X(5)   VALUE "DATE ".
           05  DATE-H1                   PIC X(8)   VALUE SPACES.
           05  FILLER                    PIC X(2)   VALUE SPACES.
           05  FILLER                    PIC X(5)   VALUE "TIME ".
           05  TIME-H1                   PIC X(8)   VALUE SPACES.

       01  HDR-OPTIONS-1.
           05  FILLER                    PIC X(5)  VALUE "SORT ".
           05  PRT-OPT-SORT              PIC X(2).
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE "TRANS: ".
           05  PRT-OPT-TC-AREA.
               10  PRT-OPT-TC-LINE OCCURS 7 TIMES.
                   15  PRT-OPT-TC        PIC X(4).
                   15  FILLER            PIC X(1).
           05  FILLER               PIC X(13) VALUE " DATE RANGE: ".
           05  PRT-OPT-LOW-DATE          PIC X(8).
           05  FILLER                    PIC X(3)  VALUE " - ".
           05  PRT-OPT-HIGH-DATE         PIC X(8).
           05  FILLER               PIC X(12) VALUE " CARR/EMPL: ".
           05  PRT-OPT-CARR-AREA.
               10  PRT-OPT-CARR-LINE OCCURS 8 TIMES.
                   15  PRT-OPT-CARR      PIC X(4).
                   15  FILLER            PIC X(1).

       01  HDR-OPTIONS-2.
           05  FILLER                    PIC X(7)  VALUE "DEPTS: ".
           05  PRT-OPT-DEPT-AREA.
               10  PRT-OPT-DEPT-LINE OCCURS 8 TIMES.
                   15  PRT-OPT-DEPT      PIC X(4).
                   15  FILLER            PIC X(1).
           05  FILLER                    PIC X(10) VALUE " CLASSES: ".
           05  PRT-OPT-CLASS-AREA.
               10  PRT-OPT-CLASS-LINE OCCURS 8 TIMES.
                   15  PRT-OPT-CLASS     PIC X(4).
                   15  FILLER            PIC X(1).
           05  FILLER               PIC X(16) VALUE "EXPCLASS RANGE: ".
           05  PRT-OPT-LOW-EXP           PIC X(6).
           05  FILLER                    PIC X(3)  VALUE " - ".
           05  PRT-OPT-HIGH-EXP          PIC X(6).

      *--- HEADER LINE FOR EXTRA 8 DEPARTMENTS.
       01  HDR-OPTIONS-2B.
           05  FILLER                    PIC X(7)  VALUE SPACES.
           05  PRT-OPT-DEPT-AREA-2.
               10  PRT-OPT-DEPT-LINE-2 OCCURS 8 TIMES.
                   15  PRT-OPT-DEPT-2    PIC X(4).
                   15  FILLER            PIC X(1).
           05  PRT-EXCL-STR-LIT          PIC X(14) VALUE
                                                   " EXCLUDE DEPT ".
           05  PRT-EXCL-STR              PIC X(4).

       01  HDR-OPTIONS-3.
           05  FILLER                    PIC X(7)  VALUE "CODES: ".
           05  PRT-OPT-CODE-AREA.
               10  PRT-OPT-CODE-LINE OCCURS 3 TIMES.
                   15  PRT-OPT-CODE      PIC X(7).

       01  HDR-2.
           05  FILLER                    PIC X(9)  VALUE "MATL CODE".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "P.O.".
           05  FILLER                    PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE "RLS".
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE "RCV".
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "ITEM".
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "TRNS".
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "DEPT".
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "ACCT".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(8)  VALUE "DOCUMENT".
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "CARR".
           05  FILLER                    PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(5)  VALUE "UNITS".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE "UM".
           05  FILLER                    PIC X(11) VALUE SPACES.
           05  FILLER                    PIC X(5)  VALUE "VALUE".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "DATE".
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "TIME".
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER                    PIC X(11) VALUE "BALANCE QTY".

       01  DETAIL-LINE.
           05  PRT-CLASS                 PIC X(4)  VALUE SPACES.
           05  PRT-STORES-CODE           PIC X(7).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-ORDER-NUM             PIC X(7).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-RELEASE               PIC X(3).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-RCVR-NUM              PIC X(3).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-ITEM-NUM              PIC X(4).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-CODE                  PIC X(4).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-DEPT                  PIC X(4).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-ACCT                  PIC X(6).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-DOCUMENT-NUM          PIC X(12).
           05  PRT-CANCELLED-FLAG        PIC X(1).
           05  PRT-EMP                   PIC X(4).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-QTY                   PIC Z(10)-.
           05  PRT-QTY-X REDEFINES PRT-QTY PIC X(11).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-UNIT-MEASURE          PIC X(2).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-VALUE                 PIC Z(12).ZZ-.
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-TRANS-DATE            PIC X(8).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  PRT-TRANS-TIME            PIC X(8).
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  PRT-BALANCE-QTY           PIC Z(10)-.

       01  DESC-LINE.
           05  FILLER                    PIC X(5) VALUE SPACES.
           05  PRT-DESC                  PIC X(80).

       01  BREAK-TOTAL.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  T1-LEVEL-1-ITEM           PIC X(14).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  T1-LEVEL-2-ITEM           PIC X(14).
           05  FILLER                    PIC X(5)  VALUE " HAD ".
           05  T1-COUNT                  PIC ZZZZZZZ9.
           05  FILLER        PIC X(7)  VALUE " ITEMS ".
           05  FILLER                    PIC X(14) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL VALUE: ".
           05  T1-TOTAL-COST             PIC Z(13)9.9(2)-.

       01  ENG-EXP-TOTAL.
           05  FILLER                    PIC X(40) VALUE SPACES.
           05  FILLER                    PIC X(41) VALUE
                  "TOTAL ENGINEERING EXPENSE FOR THIS DEPT: ".
           05  ENG-TOTAL                 PIC Z(13)9.9(2)-.

       01  OPR-EXP-TOTAL.
           05  FILLER                    PIC X(40) VALUE SPACES.
           05  FILLER                    PIC X(41) VALUE
                  "TOTAL OPERATING   EXPENSE FOR THIS DEPT: ".
           05  OPR-TOTAL                 PIC Z(13)9.9(2)-.

       01  ENG-OPR-TC-TOTAL.
           05  FILLER                    PIC X(61) VALUE SPACES.
           05  ENG-OPR-TRANS             PIC X(4).
           05  FILLER                    PIC X(17) VALUE
                                            "   TOTAL VALUE:  ".
           05  ENG-OPR-TOTAL             PIC Z(12)9.9(2)-.

       01  TC-TOTALS.
           05  FILLER                    PIC X(20) VALUE SPACES.
           05  PRT-TC-TYPE               PIC X(4).
           05  FILLER                    PIC X(5)  VALUE " HAD ".
           05  PRT-TC-COUNT              PIC ZZZZ9.
           05  FILLER                    PIC X(6)  VALUE " ITEMS".
           05  FILLER                    PIC X(28) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL VALUE: ".
           05  PRT-TC-COST               PIC Z(13)9.9(2)-.

       01  RPT-TOTAL.
           05  FILLER                    PIC X(20) VALUE SPACES.
           05  FILLER                    PIC X(6)  VALUE "TOTAL ".
           05  FILLER        PIC X(21) VALUE "ITEMS FOR REPORT IS: ".
           05  T2-COUNT                  PIC ZZZZZZZ9.
           05  FILLER                    PIC X(13) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL VALUE: ".
           05  T2-TOTAL-COST             PIC Z(13)9.9(2)-.

       01  SUMMARY-HDR.
           05  FILLER                    PIC X(60)  VALUE SPACES.
           05  FILLER                    PIC X(17)
               VALUE "TOTALS BY ACCOUNT".
           05  FILLER                    PIC X(55)  VALUE SPACES.

      *--- THIS HEADING ONLY NEEDS TO BE PRINTED IN LAWTON (OR IN
      *--- THOSE PLANTS WHO WANT TO GROUP ACCOUNT NUMBERS 000001
      *--- THROUGH 000099 INTO ACCOUNT 000250).
       01  SUMMARY-HDR-LAWTON.
           05  FILLER                    PIC X(47)  VALUE SPACES.
           05  FILLER                    PIC X(43)
               VALUE "(ACCT 000250 INCLUDES ACCT 000001 - 000099)".
           05  FILLER                    PIC X(42)  VALUE SPACES.

       01  SUMMARY-HDR-2.
           05  FILLER                    PIC X(55)  VALUE SPACES.
           05  FILLER                    PIC X(28)
               VALUE "ACCT             TOTAL VALUE".
           05  FILLER                    PIC X(49)  VALUE SPACES.

       01  SUMMARY-DETAIL-LINE.
           05  FILLER                    PIC X(55)  VALUE SPACES.
           05  SUM-ACCT                  PIC X(6).
           05  FILLER                    PIC X(4)   VALUE SPACES.
           05  SUM-VALUE                 PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(49)  VALUE SPACES.

       01  SUMMARY-TOTAL-LINE.
           05  FILLER                    PIC X(49) VALUE SPACES.
           05  FILLER                    PIC X(12) VALUE "GRAND TOTAL:".
           05  FILLER                    PIC X(4)  VALUE SPACES.
           05  SUM-TOT-VALUE             PIC ZZZ,ZZZ,ZZZ,ZZ9.99-.
           05  FILLER                    PIC X(49) VALUE SPACES.

       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC-1.
           05  OPT-SORT                  PIC X(2).
           05  OPT-TC OCCURS 7 TIMES     PIC X(4).
           05  OPT-LOW-DATE              PIC X(8).
           05  OPT-HIGH-DATE             PIC X(8).
           05  OPT-SUMMARY-DETAIL        PIC X(1).
           05  OPT-CARR OCCURS 8 TIMES   PIC X(4).
9402CK     05  FILLER                    PIC X(1).

       01  OPTION-REC-2.
           05  OPT-DEPT OCCURS 16 TIMES  PIC X(4).
           05  FILLER                    PIC X(16).

       01  OPTION-REC-3.
           05  OPT-CLASS OCCURS 8 TIMES  PIC X(4).
           05  OPT-LOW-EXP               PIC X(6).
           05  OPT-HIGH-EXP              PIC X(6).
           05  OPT-CODE OCCURS 3 TIMES   PIC X(7).
           05  INCLUDE-PREV-MTH          PIC X(1).
9402CK     05  OPT-DESC                  PIC X(1).
           05  OPT-EXCL-STRM             PIC X(1).
           05  FILLER                    PIC X(12).

       PROCEDURE DIVISION.
       START-UP SECTION.
       HOUSEKEEPING.
           MOVE "C"                      TO  MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
           MOVE "N"                      TO  EOF-SW.
           MOVE ZERO TO PAGE-COUNT, LINE-COUNT, SAVE-TOTAL-COST,
             L1-COUNT, L1-TOTAL-COST, L2-COUNT, L2-TOTAL-COST,
             RPT-COUNT, RPT-TOTAL-COST, HOLD-DEPT-VALUE.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 15
               MOVE ZERO                 TO  TC-COUNT (SUB)
               MOVE ZERO                 TO  TC-TOTAL (SUB)
           END-PERFORM.
           PERFORM 9999-OPEN-STUFF.
           OPEN OUTPUT PRINT-FILE.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI              TO  COMP-ESC-SEQ.
           MOVE CHAR-10PI                TO  STAND-ESC-SEQ.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT OPTION-REC-1.
           ACCEPT OPTION-REC-2.
           ACCEPT OPTION-REC-3.
           DISPLAY "ROUTING INFORMATION ENTERED WAS:".
           DISPLAY HD-ROUTE-DATA.
           DISPLAY "OPTION REC 1 ENTERED IS:".
           DISPLAY OPTION-REC-1.
           DISPLAY "OPTION REC 2 ENTERED IS:".
           DISPLAY OPTION-REC-2.
           DISPLAY "OPTION REC 3 ENTERED IS:".
           DISPLAY OPTION-REC-3.

           MOVE OPT-SORT                 TO  RS-SHIFT-FLD.
           CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD.
           MOVE RS-SHIFT-FLD-7-8         TO  OPT-SORT.
           IF OPT-LOW-EXP NOT = "ALL"
               MOVE OPT-LOW-EXP          TO  RS-SHIFT-FLD
               CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD
               MOVE RS-SHIFT-FLD-3-8     TO  OPT-LOW-EXP
               MOVE OPT-HIGH-EXP         TO  RS-SHIFT-FLD
               CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD
               MOVE RS-SHIFT-FLD-3-8     TO  OPT-HIGH-EXP.

DP9802*------- MOVE THE DATE VALUES INPUT TO THE HDR-OPTIONS-1 RECORD,
DP9802*------- THEN REPLACE THEM BELOW IF TDATECHK IS CALLED.
DP9802     MOVE OPT-LOW-DATE             TO  PRT-OPT-LOW-DATE.
DP9802     MOVE OPT-HIGH-DATE            TO  PRT-OPT-HIGH-DATE.

           IF (OPT-LOW-DATE NOT = "ALL")
           AND (OPT-LOW-DATE NOT = SPACES)
               MOVE 3                    TO  DATE-MODE
               MOVE OPT-LOW-DATE         TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
DP9802         IF DATE-RET-CODE = 0
DP9802             MOVE DATE-SLASH-OUT   TO  PRT-OPT-LOW-DATE
DP9802         ELSE
DP9802             MOVE "Y"              TO  INVALID-DATE-FLAG
DP9802         END-IF
               MOVE DATE-YMD-OUT         TO  SAVE-LOW-DATE
               IF SAVE-LOW-DATE-YY > "70"
                   MOVE "19"             TO  SAVE-LOW-DATE-CC
               ELSE
                   MOVE "20"             TO  SAVE-LOW-DATE-CC
               END-IF
               MOVE OPT-HIGH-DATE        TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
DP9802         IF DATE-RET-CODE = 0
DP9802             MOVE DATE-SLASH-OUT   TO  PRT-OPT-HIGH-DATE
DP9802         ELSE
DP9802             MOVE "Y"              TO  INVALID-DATE-FLAG
DP9802         END-IF
               MOVE DATE-YMD-OUT         TO  SAVE-HIGH-DATE
               IF SAVE-HIGH-DATE-YY > "70"
                   MOVE "19"             TO  SAVE-HIGH-DATE-CC
               ELSE
                   MOVE "20"             TO  SAVE-HIGH-DATE-CC
               END-IF
      ************ 10APR1996 - REVISED THE NEXT STATEMENT TO MOVE
      ************    "X" TO INCLUDE-PREV-MTH FIELD INSTEAD OF A
      ************    SPACE.  THIS WILL ALLOW RECORDS WHICH MEET
      ************    THE DATE CRITERIA TO BE INCLUDED ON THE REPORT
      ************    EVEN IF THE DOCUMENT FIELD IS EQUAL TO "PROC".
               MOVE "X"                  TO  INCLUDE-PREV-MTH
               MOVE "Y"                  TO  CHECK-DTRANS2-SW.

           DISPLAY "SORT OPTION = ", OPT-SORT.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 7
               DISPLAY "OPT-TC (", SUB, ") = ", OPT-TC (SUB)
           END-PERFORM.
           DISPLAY "OPT-LOW-DATE = ", OPT-LOW-DATE.
           DISPLAY "OPT-HIGH-DATE = ", OPT-HIGH-DATE.
           DISPLAY "OPT-SUMMARY-DETAIL = ", OPT-SUMMARY-DETAIL.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
               DISPLAY "OPT-CARR (", SUB, ") = ", OPT-CARR (SUB)
           END-PERFORM.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 16
               DISPLAY "OPT-DEPT (", SUB, ") = ", OPT-DEPT (SUB)
           END-PERFORM.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
               DISPLAY "OPT-CLASS (", SUB, ") = ", OPT-CLASS (SUB)
           END-PERFORM.
           DISPLAY "OPT-LOW-EXP = ", OPT-LOW-EXP.
           DISPLAY "OPT-HIGH-EXP = ", OPT-HIGH-EXP.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 3
               DISPLAY "OPT-CODE (", SUB, ") = ", OPT-CODE (SUB)
           END-PERFORM.

      *------ MOVE SELECTED OPTIONS TO A HEADER PRINT LINE SO USER CAN
      *------ SEE WHAT HE SELECTED.
           MOVE OPT-SORT                 TO  PRT-OPT-SORT.
           MOVE SPACES                   TO  PRT-OPT-TC-AREA.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 7
               MOVE OPT-TC (SUB)         TO  PRT-OPT-TC (SUB)
           END-PERFORM.
DP9802*****MOVE OPT-LOW-DATE             TO  PRT-OPT-LOW-DATE.
DP9802*****MOVE OPT-HIGH-DATE            TO  PRT-OPT-HIGH-DATE.
           MOVE SPACES                   TO  PRT-OPT-CARR-AREA.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
               MOVE OPT-CARR (SUB)       TO  PRT-OPT-CARR (SUB)
           END-PERFORM.
           MOVE SPACES                   TO  PRT-OPT-DEPT-AREA.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
               MOVE OPT-DEPT (SUB)       TO  PRT-OPT-DEPT (SUB)
           END-PERFORM.
      *--- MOVE SECOND LINE OF DEPARTMENTS.
           MOVE SPACES                   TO  PRT-OPT-DEPT-AREA-2.
           MOVE 1                        TO  SUB-2
           PERFORM VARYING SUB FROM 9 BY 1 UNTIL SUB > 16
               MOVE OPT-DEPT (SUB)       TO  PRT-OPT-DEPT-2 (SUB-2)
               ADD 1                     TO  SUB-2
           END-PERFORM.
           MOVE SPACES                   TO  PRT-OPT-CLASS-AREA.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
               MOVE OPT-CLASS (SUB)      TO  PRT-OPT-CLASS (SUB)
           END-PERFORM.
           MOVE OPT-LOW-EXP              TO  PRT-OPT-LOW-EXP.
           MOVE OPT-HIGH-EXP             TO  PRT-OPT-HIGH-EXP.
           IF OPT-CODE (1) NOT = "ALL"
               PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 2
                   MOVE OPT-CODE (SUB)   TO  PRT-OPT-CODE (SUB)
               END-PERFORM.

      *------ IF ONLY 1 TC SPECIFIED, DON'T DO TOTALS ON EACH
      *------ TRANSACTION CODE
           IF OPT-TC (1) = "ALL" OR SPACES
               MOVE "N"                  TO  JUST-1-TC
           ELSE
               MOVE "Y"                  TO  JUST-1-TC
               PERFORM VARYING SUB FROM 2 BY 1 UNTIL SUB > 7
               OR JUST-1-TC = "N"
                   IF OPT-TC (SUB) > SPACES
                       MOVE "N"          TO  JUST-1-TC
                   END-IF
               END-PERFORM.

           PERFORM 9999-GETFNUM.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
             HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR IN HSK" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "     TO  BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE          TO  BU-DISPLAY-FLD9 (1)
               GO TO 2100-BLOWUP.

           IF NOT PAPER-IS-132-COLS
              MOVE COMP-ESC-SEQ          TO  PRINT-REC
              WRITE PRINT-REC BEFORE ADVANCING 0 LINES.

           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO  DATE-H1.
           MOVE DATE-FORMATTED-TIME-OUT  TO  TIME-H1.
      *--- FIND PLANT NUMBER.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO *HSK" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
           INITIALIZE SUMMARY-TABLE    DEPT-TOTAL-TABLE.
           MOVE "AADJ"               TO  DEPT-TRANS (1).
           MOVE "FRT "               TO  DEPT-TRANS (2).
           MOVE "ISS "               TO  DEPT-TRANS (3).
           MOVE "INV "               TO  DEPT-TRANS (4).
           MOVE "RET "               TO  DEPT-TRANS (5).
           MOVE "SADJ"               TO  DEPT-TRANS (6).

      ****************************************************
      **   GET STOREROOM DEPT FROM MACCOUNT-INFO.       **
      ****************************************************

           MOVE "SDPT" TO MACCT-KEY.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-I-REC.
           READ MACCOUNT-INFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
           ELSE
               MOVE "GET MACCOUNT-INFO 'SDPT'* HSK"
                     TO BU-DISPLAY-MSG
               MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
               GO TO 2100-BLOWUP.
           DISPLAY "STOREROOM DEPT:  " SAVE-STR-DEPT.

      *----- UNLOCK THE MACCOUNT-INFO RECORD USING A RESET
           MOVE HIGH-VALUES TO INFOKEY OF MACCOUNT-INFO-I-REC.
           START MACCOUNT-INFO-I KEY > INFOKEY OF
              MACCOUNT-INFO-I-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
           IF OPT-EXCL-STRM = "X"
               MOVE SAVE-STR-DEPT    TO PRT-EXCL-STR
           ELSE
               MOVE SPACES           TO PRT-EXCL-STR-LIT
                                        PRT-EXCL-STR.

       1100-CONTROL.
      *---------- ACCOUNT FOR CENTURY IN SORT STATEMENTS.
           IF OPT-SORT = "01"
               SORT SORT-FILE ON ASCENDING KEY     SORT-EMP,
                                                   SORT-DOCUMENT-NUM,
                                                   SORT-ITEM-NUM,
                                                   SORT-DATE-CN
                  INPUT  PROCEDURE IS  6000-INPUT-STUFF
                  OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "02"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DOCUMENT-NUM,
                                                   SORT-PO-NUM,
                                                   SORT-RCVR-NUM,
                                                   SORT-ITEM-NUM,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "03"
               SORT SORT-FILE ON ASCENDING KEY     SORT-CLASS,
                                                   SORT-DOCUMENT-NUM,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "04"
               SORT SORT-FILE ON ASCENDING KEY     SORT-CLASS,
                                                   SORT-CODE,
                                                   SORT-STORES-CODE,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "05"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-CODE,
                                                   SORT-PO-NUM,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "06"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-PO-NUM,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "07"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-EXP-CAT,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "08"
               SORT SORT-FILE ON ASCENDING KEY     SORT-EXP-CAT,
                                                   SORT-DATE-CN
                   INPUT  PROCEDURE IS  6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS  7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "09"
               SORT SORT-FILE ON ASCENDING KEY     SORT-ACCT,
                                                   SORT-DATE-CN
                   INPUT PROCEDURE IS 6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS 7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "10"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-ACCT,
                                                   SORT-DATE-CN
                   INPUT PROCEDURE IS 6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS 7000-OUTPUT-STUFF
               PERFORM 2500-PRINT-SUMMARY
           ELSE
           IF OPT-SORT = "11"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-EMP,
                                                   SORT-DATE-CN
                   INPUT PROCEDURE IS 6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS 7000-OUTPUT-STUFF
           ELSE
           IF OPT-SORT = "12"
               SORT SORT-FILE ON ASCENDING KEY     SORT-DEPT,
                                                   SORT-PO-NUM,
                                                   SORT-RCVR-NUM,
                                                   SORT-ITEM-NUM,
                                                   SORT-DATE-CN
                   INPUT PROCEDURE IS 6000-INPUT-STUFF
                   OUTPUT PROCEDURE IS 7000-OUTPUT-STUFF.

       2000-SHUTDOWN-DB.
DP9802     DISPLAY "INVALID-DATE-FLAG = ", INVALID-DATE-FLAG.
DP9802     IF INVALID-DATE-FLAG = "Y"
DP9802         MOVE "*** ERROR: INVALID DATE RANGE SPECIFIED ***"
DP9802             TO PRT-DESC
DP9802         WRITE PRINT-REC FROM DESC-LINE AFTER ADVANCING 2
DP9802     END-IF.
           CLOSE PRINT-FILE.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.

       2100-BLOWUP.
           MOVE "TCSASTRN"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

       2500-PRINT-SUMMARY.
           PERFORM 2501-SORT-TABLE THRU 2501-EXIT.
           PERFORM 2502-PRINT-REPORT.

      *------------------ BUBBLE SORT ROUTINE ------------------------*

      *---    ADDR1 = HOLDS POSITION OF TABLE ENTRIES AS THE PROGRAM IS
      *---               SCROLLING THROUGH IT TO FIND THE LOWEST NUMBER
      *---    ADDR2 = HOLDS POSITION TO BE SWAPPED
      *---    ADDR3 = HOLDS POSITION OF THE LOWEST NUMBER IN REMAINING
      *---               TABLE
      *---    ADDR4 = HOLDS NUMBER OF ENTRIES IN TABLE
      *---    TEMP-ACCT = HOLDS LOW NUMBER IN THE TABLE

       2501-SORT-TABLE.
      *--- FIND END OF TABLE (NUMBER OF ENTRIES).
           ADD 1 TO ADDR4.
           IF ADDR4 = 400 OR TBL-ACCT (ADDR4) = SPACES
               SUBTRACT 1 FROM ADDR4
               GO TO SORT-1.
           GO TO 2501-SORT-TABLE.

       SORT-1.
           MOVE 1 TO ADDR2.
           IF ADDR4 = 0 OR 1
               GO TO SORT-5.

       SORT-2.
           MOVE ADDR2 TO ADDR1.
           MOVE TBL-ACCT (ADDR1)  TO TEMP-ACCT.
           MOVE TBL-VALUE (ADDR1) TO TEMP-VALUE.
           MOVE ADDR1 TO ADDR3.

       SORT-3.
      *--- FIND LOWEST NUMBER IN REMAINING TABLE ENTRIES.
           ADD 1 TO ADDR1.
           IF TBL-ACCT (ADDR1) < TEMP-ACCT
               MOVE TBL-ACCT (ADDR1)  TO TEMP-ACCT
               MOVE TBL-VALUE (ADDR1) TO TEMP-VALUE
               MOVE ADDR1             TO ADDR3.
           IF ADDR1 < ADDR4
               GO TO SORT-3.

       SORT-4.
      *--- SWAP THE LOWEST NUMBER WITH THE CURRENT TABLE ENTRY.
           IF ADDR2 = ADDR3
               GO TO SORT-5.
           MOVE TBL-ACCT (ADDR2)  TO TBL-ACCT (ADDR3).
           MOVE TBL-VALUE (ADDR2) TO TBL-VALUE (ADDR3).
           MOVE TEMP-ACCT         TO TBL-ACCT (ADDR2).
           MOVE TEMP-VALUE        TO TBL-VALUE (ADDR2).

       SORT-5.
           ADD 1 TO ADDR2.
           IF ADDR2 < ADDR4
               GO TO SORT-2.

       2501-EXIT.
           EXIT.

      *------------------ END OF BUBBLE SORT ROUTINE -----------------*

       2502-PRINT-REPORT.
           PERFORM 2503-PRINT-SUMM-HEADERS.
           PERFORM 2504-PRINT-SUMMARY-LINES
               VARYING SUB FROM 1 BY 1 UNTIL
                   TBL-ACCT (SUB) = SPACES OR
                        SUB > 400.
      *--- PRINT GRAND TOTAL LINE.
           MOVE SUM-TOT-HOLD TO SUM-TOT-VALUE.
           WRITE PRINT-REC FROM SUMMARY-TOTAL-LINE AFTER ADVANCING 2.

       2503-PRINT-SUMM-HEADERS.
           PERFORM 7800-HEADERS.
           WRITE PRINT-REC FROM SUMMARY-HDR AFTER ADVANCING 2.
           ADD 2                         TO  LINE-COUNT.
      *--- IF LAWTON PLANT, ADD NOTE ABOUT CODES 1-99 BEING GROUPED INTO
      *--- CODE 250.
      *----- 30SEP1996 ADDED UNION CITY TO THE FOLLOWING IF STATEMENT
           IF MPLTINFO-COMPANY = "129" OR "153"
               WRITE PRINT-REC FROM SUMMARY-HDR-LAWTON
                   AFTER ADVANCING 1
               ADD 1                     TO  LINE-COUNT.
           WRITE PRINT-REC FROM SUMMARY-HDR-2 AFTER ADVANCING 2.
           ADD 2                         TO  LINE-COUNT.

       2504-PRINT-SUMMARY-LINES.
           MOVE TBL-ACCT (SUB)     TO SUM-ACCT.
           MOVE TBL-VALUE (SUB)    TO SUM-VALUE.
           WRITE PRINT-REC FROM SUMMARY-DETAIL-LINE AFTER ADVANCING 2.
           ADD 2                   TO LINE-COUNT.
           IF LINE-COUNT > 55
               PERFORM 2503-PRINT-SUMM-HEADERS.
           ADD TBL-VALUE (SUB)     TO SUM-TOT-HOLD.

      *******************************************
      *                                         *
      *    I N P U T    P R O C E D U R E       *
      *                                         *
      *******************************************

       6000-INPUT-STUFF SECTION.
       6005-START-INPUTTING-STUFF.

           PERFORM 9999-BEGFIL-DTRANS-MC-I.
               PERFORM 9999-BEGFIL-DTRANS2-MC-I.

       6010-SERIAL-LOOP.
           IF DTRANS-EOF-SW NOT = "Y"
               PERFORM 9999-GETSER-DTRANS-MC-I.

           IF CHECK-DTRANS2-SW = "Y"
      *------- DTRANS IS FINISHED, SO READ THE NEXT DTRANS2 RECORD.
               IF DTRANS-EOF-SW = "Y"
                   GO TO 6015-DTRANS2-SERIAL-LOOP
               ELSE
      *------- DTRANS IS NOT FINISHED, SO PROCESS THE RECORD.
                   GO TO 6020-SELECTIONS
               END-IF
           ELSE
      *------- DTRANS IS FINISHED, AND WE DON'T NEED TO READ DTRANS2.
               IF DTRANS-EOF-SW = "Y"
                   GO TO 6990-IS-X
               ELSE
      *------- DTRANS IS NOT FINISHED, SO PROCESS THE RECORD.
                   GO TO 6020-SELECTIONS
               END-IF
           END-IF.

       6015-DTRANS2-SERIAL-LOOP.
      *--- READ DTRANS2 RECORDS, IF NEEDED.        04/24/1995
           PERFORM 9999-GETSER-DTRANS2-MC-I.
           IF NOT GOOD-CALL
               GO TO 6990-IS-X.

       6020-SELECTIONS.
      ******************************************************************
      * 13JUL1993 - WITH THE REWORK OF THE FRT ACCTG SYSTEM, NO RECORDS
      *  WILL BE WRITTEN TO DTRANS WITH EMP = "CANC".  THEREFORE, THE
      *  FOLLOWING BLOCK OF LOGIC WAS COMMENTED OUT.  -DAVE PLUM
      ******************************************************************
      *------ ON 'CANCELLED' TRANSACTIONS, FIND THE MOST LIKELY ACTUAL
      *------ CARRIER FROM APPLIED FREIGHT DATASET.
           MOVE "N"                       TO  CANCELLED-FLAG.
           MOVE SPACES                    TO  HOLD-CARRIER.
      *    IF TRANS-EMP = "CANC"
      *        MOVE "Y"                   TO  CANCELLED-FLAG
      *        MOVE TRANS-DOCUMENT-NUM    TO  PRO-NO-ARG
      *        PERFORM 9999-CHAINHD-DAPPLFRT-FP-I
      *        PERFORM 9999-GETNEXT-DAPPLFRT-FP-I
      *        IF GOOD-CALL
      *            MOVE DAPPL-CARRIER     TO  HOLD-CARRIER
      *        END-IF
      *        PERFORM UNTIL (NOT GOOD-CALL)
      *        OR DAPPL-APPLIED-DATE = TRANS-DATE
      *            PERFORM 9999-GETNEXT-DAPPLFRT-FP-I
      *        END-PERFORM
      *        IF GOOD-CALL AND DAPPL-CARRIER > SPACES
      *            MOVE DAPPL-CARRIER     TO  TRANS-EMP
      *        ELSE
      *            MOVE HOLD-CARRIER      TO  TRANS-EMP.

      *------ FOR FREIGHT TRANSACTIONS, THE TRANSACTION DATASET CAN HOLD
      *------ EITHER THE DELIVERED OR PAID CARRIER CODE.  BUT IN DAPPLFRT,
      *------ THE RATED-CARRIER AND THE PAID-CARRIER ARE SEPERATE FIELDS.
      *------ IN ORDER TO ALLOW FOR BETTER RECONCILIATION TO THE FREIGHT
      *------ STATUS REPORT, WE WILL ALWAYS TRY TO USE THE PAID-CARRIER ON
      *------ THIS REPORT IF ONE IS AVAILABLE FROM THE DAPPLFRT DATASET.
      *------
      *------ IF WE ASSUME THAT THE DTRANS RECORD THAT WE ARE LOOKING AT
      *------ HAS THE RATED-CARRIER IN THE EMPLOYEE FIELD, AND THE FIRST
      *------ 12 CHARACTERS OF THE RATED PRO NUMBER IN THE DOCUMENT
      *------ FIELD, WE CAN READ DAPPLFRT BY RATED CARRIER AND PRO NUMBER
      *------ IN AN ATTEMPT TO FIND THE PAID CARRIER AND PRO NUMBER.
      *------
      *------ IN MANY CASES THE RATED AND PAID VALUES FOR CARRIER AND PRO
      *------ NUMBER WILL BE THE SAME.  IN THESE CASES WE ALREADY HAVE THE
      *------ "RIGHT" PRO NUMBER AND CARRIER.  IN OTHER CASES THE PAID
      *------ CARRIER AND PRO NUMBER WILL BE BLANK (FRT BILL NOT PAID YET),
      *------ IN THESE CASES WE WILL STICK WITH THE CARRIER AND PRO NUMBER
      *------ THAT WE ALREADY HAVE.

           MOVE SPACES                    TO  HOLD-DLVR-CARR.
           IF TRANS-CODE = "FRT"
               MOVE TRANS-EMP             TO  CARRIER-ARG
               MOVE TRANS-DOCUMENT-NUM    TO  PRO-NO-ARG
               PERFORM 9999-CHAINHD-DAPPLFRT-FP-I
               PERFORM 9999-GETNEXT-DAPPLFRT-FP-I

               PERFORM UNTIL (NOT GOOD-CALL)
                OR  (DAPPL-RATED-CARRIER   = TRANS-EMP
                 AND DAPPL-RATED-PRO-NO-12 = TRANS-DOCUMENT-NUM
                 AND DAPPL-PO-10           = TRANS-PO-NUM
                 AND DAPPL-PO-RCVR         = TRANS-RCVR-NUM)
                   PERFORM 9999-GETNEXT-DAPPLFRT-FP-I
               END-PERFORM

               IF GOOD-CALL
                AND (DAPPL-RATED-CARRIER NOT = DAPPL-PAID-CARRIER)
                AND (DAPPL-PAID-CARRIER  NOT = SPACES)
                   MOVE TRANS-EMP          TO  HOLD-DLVR-CARR
                   MOVE DAPPL-PAID-CARRIER TO  TRANS-EMP
                   MOVE DAPPL-PAID-PRO-NO  TO  TRANS-DOCUMENT-NUM.

           IF OPT-TC (1) = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           MOVE "N"                      TO  FOUND-IT
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 7
           OR FOUND-IT = "Y"
               IF OPT-TC (SUB) = "ISS "
                   IF TRANS-CODE-TRANS = "ISS"
                       MOVE "Y"          TO  FOUND-IT
                   END-IF
               END-IF
               IF OPT-TC (SUB) = TRANS-CODE
                   MOVE "Y"              TO  FOUND-IT
               END-IF
           END-PERFORM
           IF FOUND-IT = "N"
               GO TO 6010-SERIAL-LOOP.

           IF OPT-CARR (1) = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           MOVE "N"                      TO  FOUND-IT
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
           OR FOUND-IT = "Y" OR OPT-CARR (SUB) = SPACES
               IF OPT-CARR (SUB) = TRANS-EMP
                   MOVE "Y"              TO  FOUND-IT
               END-IF
           END-PERFORM
           IF FOUND-IT = "N"
               GO TO 6010-SERIAL-LOOP.

           IF OPT-DEPT (1) = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           MOVE "N"                      TO  FOUND-IT
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 16
           OR FOUND-IT = "Y"
               IF OPT-DEPT (SUB) = TRANS-DEPT
                   MOVE "Y"              TO  FOUND-IT
               END-IF
           END-PERFORM
           IF FOUND-IT = "N"
               GO TO 6010-SERIAL-LOOP.

      *----------- EXCLUDE STOREROOM DEPARTMENT TRANSACTIONS, IF
      *----------- REQUESTED.
           IF OPT-EXCL-STRM = "X"
               IF TRANS-DEPT = SAVE-STR-DEPT
                   GO TO 6010-SERIAL-LOOP.

           IF OPT-CLASS (1) = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           MOVE "N"                      TO  FOUND-IT
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 8
           OR FOUND-IT = "Y"
               IF OPT-CLASS (SUB) = TRANS-CLASS
                   MOVE "Y"              TO  FOUND-IT
               END-IF
           END-PERFORM
           IF FOUND-IT = "N"
               GO TO 6010-SERIAL-LOOP.

           IF OPT-CODE (1) = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           MOVE "N"                      TO  FOUND-IT
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 3
           OR FOUND-IT = "Y"
               IF OPT-CODE (SUB) = TRANS-STORES-CODE
                   MOVE "Y"              TO  FOUND-IT
               END-IF
           END-PERFORM
           IF FOUND-IT = "N"
               GO TO 6010-SERIAL-LOOP.

           IF OPT-LOW-DATE = "ALL" OR SPACES
               NEXT SENTENCE
           ELSE
      *----------- ACCOUNT FOR CENTURY.
           IF TRANS-DATE-CN < SAVE-LOW-DATE-CN
               GO TO 6010-SERIAL-LOOP
           ELSE
           IF TRANS-DATE-CN > SAVE-HIGH-DATE-CN
               GO TO 6010-SERIAL-LOOP.

           IF OPT-LOW-EXP = "ALL" OR "000ALL" OR SPACES
               NEXT SENTENCE
           ELSE
           IF TRANS-ACCT < OPT-LOW-EXP OR TRANS-ACCT > OPT-HIGH-EXP
               GO TO 6010-SERIAL-LOOP.

           IF INCLUDE-PREV-MTH NOT = "X"
               IF TRANS-DOCUMENT-NUM = "PROC"
                   GO TO 6010-SERIAL-LOOP.

           MOVE BUF-DTRANS               TO  SORT-REC.

           IF SORT-CODE IS EQUAL TO "RET" OR "RETV" OR "AADJ" OR "SADJ"
               COMPUTE SORT-VALUE = SORT-VALUE * -1.

      *------ DETERMINE EXPENSE TYPE OF THIS REQ.
           MOVE "E"                      TO  RQPH-PATH-TYPE.
           MOVE TRANS-CLASS              TO  RQPH-CLASS.
           MOVE TRANS-DEPT               TO  RQPH-REQ-DEPT.
           MOVE TRANS-DEPT               TO  RQPH-DEPARTMENT.
           MOVE TRANS-ACCT               TO  RQPH-EXPENSE-CLASS.
           MOVE SPACES                   TO  RQPH-BUDGET-NUMBER.
           MOVE TRANS-VALUE              TO  RQPH-VALUE.
           MOVE SPACES                   TO  RQPH-RET-CATEGORY.
           MOVE SPACES                   TO  RQPH-WO-APPROVED.
           CALL "CEARQPH2" USING BASE, STATUS-AREA, RQPH-AREA,
             RQPH-SAVE-TABLE, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

           MOVE RQPH-RET-CATEGORY        TO  SORT-EXP-CAT.

           IF CANCELLED-FLAG = "Y"
               MOVE "*"                  TO  SORT-CANCELLED-FLAG
           ELSE
               MOVE SPACES               TO  SORT-CANCELLED-FLAG.

           MOVE HOLD-DLVR-CARR           TO  SORT-DLVR-CARR.

           RELEASE SORT-REC.

           GO TO 6010-SERIAL-LOOP.

       6990-IS-X.
           EXIT.

      *******************************************
      *                                         *
      *    O U T P U T   P R O C E D U R E      *
      *                                         *
      *******************************************

       7000-OUTPUT-STUFF SECTION.
       7010-START-OUTPUT.
           PERFORM 7800-HEADERS   THRU 7800-EXIT.
           MOVE "Y"                      TO  FIRST-TIME-FLAG.

       7020-READ-LOOP.
           PERFORM 7810-RETURN-REC.
           IF END-OF-FILE-FLAG = "Y"
               GO TO 7500-REPORT-TOTALS.

           IF SORT-UNIT-MEASURE < SPACES
               MOVE SPACES               TO  SORT-UNIT-MEASURE.

           IF SORT-ITEM-NUM < SPACES
               MOVE SPACES               TO  SORT-ITEM-NUM.

           IF JUST-1-TC = "N"
               MOVE "N"                  TO  FOUND-TC
               PERFORM VARYING SUB FROM 1 BY 1
               UNTIL SUB > NUM-TCS-FOUND OR FOUND-TC = "Y"
                   IF TC-TOTAL-TYPE (SUB) = SORT-CODE
                       MOVE "Y"          TO  FOUND-TC
                       ADD SORT-VALUE    TO  TC-TOTAL (SUB)
                       ADD 1             TO  TC-COUNT (SUB)
                   END-IF
               END-PERFORM.
           IF FOUND-TC = "N"
               ADD 1                     TO  NUM-TCS-FOUND
               MOVE SORT-CODE TO TC-TOTAL-TYPE (NUM-TCS-FOUND)
               MOVE SORT-VALUE           TO  TC-TOTAL (SUB)
               MOVE 1                    TO  TC-COUNT (SUB).

           IF OPT-SORT = "01"
               MOVE SORT-EMP             TO  TEST-BREAK-L1
               MOVE SPACES               TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "02"
               MOVE SPACES               TO  TEST-BREAK-L1
               MOVE SORT-DOCUMENT-NUM    TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "03"
               MOVE SORT-CLASS           TO  TEST-BREAK-L1
               MOVE SORT-DOCUMENT-NUM    TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "04"
               MOVE SORT-CLASS           TO  TEST-BREAK-L1
               MOVE SORT-CODE            TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "05"
               MOVE SORT-DEPT            TO  TEST-BREAK-L1
               MOVE SORT-CODE            TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "06"
               MOVE SORT-DEPT            TO  TEST-BREAK-L1
               MOVE SORT-PO-NUM          TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "07"
               MOVE SORT-DEPT            TO  TEST-BREAK-L1
               MOVE SORT-EXP-CAT         TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "08"
               MOVE SORT-EXP-CAT         TO  TEST-BREAK-L1
               MOVE SPACES               TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "09"
               MOVE SORT-ACCT            TO  TEST-BREAK-L1
               MOVE SPACES               TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "10"
               MOVE SORT-DEPT            TO  TEST-BREAK-L1
               MOVE SORT-ACCT            TO  TEST-BREAK-L2
               PERFORM 7021-CHECK-FOR-SUMMARY
           ELSE
           IF OPT-SORT = "11"
               MOVE SORT-DEPT            TO  TEST-BREAK-L1
               MOVE SORT-EMP             TO  TEST-BREAK-L2
           ELSE
           IF OPT-SORT = "12"
               MOVE SORT-DOCUMENT-NUM    TO  TEST-BREAK-L1
               MOVE SORT-PO-NUM          TO  TEST-BREAK-L2.

           MOVE "N"                      TO  BREAK-FLAG-L1.
           MOVE "N"                      TO  BREAK-FLAG-L2.
           IF FIRST-TIME-FLAG = "Y"
               MOVE "N"                  TO  FIRST-TIME-FLAG
               MOVE TEST-BREAK-L1        TO  BREAK-FLD-L1
               MOVE TEST-BREAK-L2        TO  BREAK-FLD-L2
           ELSE
               IF TEST-BREAK-L1 NOT = BREAK-FLD-L1
                   MOVE "Y"              TO  BREAK-FLAG-L1
               END-IF
               IF TEST-BREAK-L2 NOT = BREAK-FLD-L2
                   MOVE "Y"              TO  BREAK-FLAG-L2.

           IF BREAK-FLAG-L1 = "Y"
               PERFORM 7850-CONTROL-BREAK-L1
           ELSE
           IF BREAK-FLAG-L2 = "Y"
               PERFORM 7860-CONTROL-BREAK-L2
               MOVE TEST-BREAK-L1        TO  BREAK-FLD-L1
               MOVE TEST-BREAK-L2        TO  BREAK-FLD-L2.

           MOVE 4                        TO  DATE-MODE.
           MOVE SORT-DATE                TO  DATE-VALIDATE-IN.
           MOVE SORT-TIME                TO  DATE-UNFORMATTED-TIME-OUT.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO  PRT-TRANS-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TRANS-TIME.

           MOVE SORT-VALUE               TO  SAVE-TOTAL-COST,
                                             PRT-VALUE.
           MOVE SORT-CLASS               TO  PRT-CLASS.
           MOVE SORT-DEPT                TO  PRT-DEPT.
           MOVE SORT-ACCT                TO  PRT-ACCT.
           MOVE SORT-STORES-CODE         TO  PRT-STORES-CODE.
           MOVE SORT-ORDER-NUM           TO  PRT-ORDER-NUM.
           MOVE SORT-RELEASE             TO  PRT-RELEASE.
           MOVE SORT-RCVR-NUM            TO  PRT-RCVR-NUM.
           MOVE SORT-ITEM-NUM            TO  PRT-ITEM-NUM.
           MOVE SORT-CODE                TO  PRT-CODE.
           MOVE SORT-DOCUMENT-NUM        TO  PRT-DOCUMENT-NUM.
           MOVE SORT-CANCELLED-FLAG      TO  PRT-CANCELLED-FLAG.
           MOVE SORT-EMP                 TO  PRT-EMP.
           MOVE SORT-QTY                 TO  PRT-QTY.
           MOVE SORT-UNIT-MEASURE        TO  PRT-UNIT-MEASURE.
           MOVE SORT-VALUE               TO  PRT-VALUE.
           MOVE SORT-BALANCE-QTY         TO  PRT-BALANCE-QTY.

      *-------- ADD ENGINEERING & OPERATING EXPENSES FOR DEPARTMENT
      *-------- TOTALS FOR LAWTON.
      *----- 30SEP1996 ADDED UNION CITY TO THE FOLLOWING IF STATEMENT
           IF MPLTINFO-COMPANY = "129" OR "153"
               IF OPT-SORT = "10"
                   MOVE "N"          TO  FOUND-TC
                   MOVE 1            TO  SUB
                   PERFORM UNTIL SUB > 6 OR FOUND-TC = "Y"
                       IF DEPT-TRANS (SUB) = SORT-CODE
                           MOVE "Y"  TO  FOUND-TC
                       ELSE
                           ADD 1     TO  SUB
                       END-IF
                   END-PERFORM
                   MOVE SORT-ACCT           TO  LAWTON-ENG-ACCT
                   IF ENG-ACCT
                       ADD SORT-VALUE       TO HOLD-DEPT-VALUE
      *-------------------- ADD TO ENGINEERING TOTALS.
                       IF FOUND-TC = "Y"
                           ADD SORT-VALUE   TO  DEPT-ENG (SUB)
                       END-IF
                   ELSE
      *-------------------- ADD TO OPERATING TOTALS.
                       IF FOUND-TC = "Y"
                           ADD SORT-VALUE   TO  DEPT-OPR (SUB)
                       END-IF
                   END-IF
               END-IF
           END-IF.

           IF SORT-DLVR-CARR > SPACES
               MOVE SPACES               TO  PRT-QTY-X
               STRING "(", SORT-DLVR-CARR, ")" DELIMITED BY SIZE
                  INTO PRT-QTY-X.

           ADD 1                         TO  L1-COUNT.
           ADD 1                         TO  L2-COUNT.
           ADD 1                         TO  RPT-COUNT.
           ADD SORT-VALUE                TO  L1-TOTAL-COST.
           ADD SORT-VALUE                TO  L2-TOTAL-COST.
           ADD SORT-VALUE                TO  RPT-TOTAL-COST.

           IF LINE-COUNT > 55
               PERFORM 7800-HEADERS  THRU 7800-EXIT.

           IF OPT-SUMMARY-DETAIL NOT = "S"
               WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 1
               ADD 1                         TO  LINE-COUNT.
9402CK     IF OPT-DESC = "X" AND (OPT-SUMMARY-DETAIL NOT = "S")
               ADD 1                     TO  LINE-COUNT

      *********IF TRANS-STORES-CODE NOT = "NON-STR"

               IF SORT-STORES-CODE NOT = "NON-STR"
                   CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                     BU-DISPLAY-MSG, SORT-STORES-CODE, CDESC-DATA
                   IF BU-DISPLAY-MSG-1 NOT = SPACES
                       PERFORM 2100-BLOWUP
                   ELSE
                      MOVE CDESC (1)    TO  PRT-DESC
                      WRITE PRINT-REC FROM DESC-LINE AFTER ADVANCING 1
               ELSE
               MOVE 1                   TO  CNDESC-LINES-TO-GET
               MOVE 0                   TO  CNDESC-LINES-GOT
               MOVE SPACES              TO  CNDESC-LINE
               MOVE SORT-ORDER-NUM      TO  PO-ARG1-7
               MOVE SORT-RELEASE        TO  PO-ARG8-10
               MOVE SORT-ITEM-NUM       TO  PO-ITEM-ARG
               CALL "CNDESC" USING BASE, PO-ARG, PO-ITEM-ARG,
                               CNDESC-DATA
               MOVE CNDESC-LINE (1)     TO  PRT-DESC
               WRITE PRINT-REC FROM DESC-LINE AFTER ADVANCING 1.

      *        ELSE
      *            MOVE 1                TO  RQD-NUM-LINES
      *            CALL "TNRQDESC" USING RQD-RET-CODE, BASE,
      *              STATUS-AREA, SORT-REQ-NUMBER, REQ-DESC-AREA,
      *              BU-DISPLAY-MSG
      *            IF BU-DISPLAY-MSG-1 NOT = SPACES
      *                PERFORM 2100-BLOWUP
      *            ELSE
      *                MOVE RQD-DESC (1) TO  PRT-DESC
      *                WRITE PRINT-REC FROM DESC-LINE AFTER ADVANCING 1.

           IF LINE-COUNT > 55
               PERFORM 7800-HEADERS  THRU 7800-EXIT.

           GO TO 7020-READ-LOOP.

      *------ THIS PARAGRAPH MOVES THE DATA FOR THE SUMMARY PAGE BY
      *----- EXPENSE CLASS.  IF THIS IS THE LAWTON PLANT AND THE
      *-----  EXPENSE CLASS IS BETWEEN 1 AND 99, IT IS GROUPED INTO THE
      *-----  250 EXPENSE CLASS AS SPECIFIED IN THE REQUEST.  06/02/1995
      *----- ADD THE VALUE TO A DEPARTMENT TOTAL SO THAT ENGINEERING
      *-----  EXPENSES CAN BE SHOWN FOR LAWTON.               04/17/1996
      *----- INCLUDE 242 & 254 IN 250 CLASS TOTAL.            06/13/1996
      *----- 30SEP1996 ADDED UNION CITY TO THE FOLLOWING IF STATEMENT
       7021-CHECK-FOR-SUMMARY.
           IF MPLTINFO-COMPANY = "129" OR "153"
               MOVE SORT-ACCT  TO LAWTON-ENG-ACCT-RPT
               IF ENG-ACCT-RPT
                   MOVE SORT-ACCT  TO HOLD-ACCT
                   MOVE "000250"   TO SORT-ACCT
               ELSE
                   MOVE SPACES     TO HOLD-ACCT
               END-IF
           ELSE
               MOVE SPACES     TO HOLD-ACCT.
      *--- FIND THE SUBSCRIPT OF THE CORRECT TABLE ENTRY.
           PERFORM 7022-DO-NOTHING VARYING SUB FROM 1 BY 1 UNTIL
                              SUB > 400 OR
                   TBL-ACCT (SUB) = SPACES OR
                   TBL-ACCT (SUB) = SORT-ACCT.
      *--- IF THE TABLE SIZE IS EXCEEDED, BLOW UP.
           IF SUB > 400
               MOVE "SUMMARY REPORT TABLE LIMIT EXCEEDED" TO
                                                   BU-DISPLAY-MSG
               GO TO 2100-BLOWUP
           ELSE
      *--- IF THE ACCOUNT NUMBER IS IN THE TABLE, ADD THE VALUE TO IT.
               IF TBL-ACCT (SUB) = SORT-ACCT
                   ADD SORT-VALUE TO TBL-VALUE (SUB)
      *--- IF THE ACCOUNT NUMBER IS NOT IN THE TABLE, CREATE A NEW ENTRY.
           ELSE
               IF TBL-ACCT (SUB) = SPACES
                   MOVE SORT-ACCT   TO TBL-ACCT (SUB)
                   MOVE SORT-VALUE  TO TBL-VALUE (SUB).

      *--- MOVE THE ORIGINAL ACCOUNT NUMBER BACK TO THE SORT RECORD
      *--- SO IT WILL PRINT CORRECTLY ON THE DETAIL REPORT.
      *----- 30SEP1996 ADDED UNION CITY TO THE FOLLOWING IF STATEMENT
           IF (MPLTINFO-COMPANY = "129" OR "153")
             AND HOLD-ACCT NOT = SPACES
               MOVE HOLD-ACCT TO SORT-ACCT.

      *--- THIS PARAGRAPH IS A DUMMY PARAGRAPH FOR THE LOOP THAT
      *--- SEARCHES THE TABLE.
       7022-DO-NOTHING.

       7500-REPORT-TOTALS.
           PERFORM 7850-CONTROL-BREAK-L1.

           IF JUST-1-TC = "N"
               PERFORM VARYING SUB FROM 1 BY 1
               UNTIL SUB > NUM-TCS-FOUND
                   MOVE TC-TOTAL-TYPE (SUB)  TO  PRT-TC-TYPE
                   MOVE TC-TOTAL (SUB)       TO  PRT-TC-COST
                   MOVE TC-COUNT (SUB)       TO  PRT-TC-COUNT
                   WRITE PRINT-REC FROM TC-TOTALS AFTER ADVANCING 1
               END-PERFORM.

           MOVE RPT-COUNT                TO  T2-COUNT.
           MOVE RPT-TOTAL-COST           TO  T2-TOTAL-COST.
           WRITE PRINT-REC FROM RPT-TOTAL AFTER ADVANCING 2.

           GO TO 7990-OS-X.


      ******************************************************************
      ** OUTPUT SECTION PERFORMED ROUTINES                            **
      ******************************************************************
       7800-HEADERS.
           ADD 1                         TO  PAGE-COUNT.
           MOVE PAGE-COUNT               TO  PAGE-H1.
           WRITE PRINT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE.
           WRITE PRINT-REC FROM HDR-OPTIONS-1 AFTER ADVANCING 2.
           WRITE PRINT-REC FROM HDR-OPTIONS-2 AFTER ADVANCING 1.
      *--- IF MORE THAN 8 DEPARTMENTS, WRITE THE 2ND DEPARTMENT
      *--- HEADING LINE.
           IF OPT-DEPT (9) NOT = SPACES  OR  OPT-DEPT (10) NOT = SPACES
                                         OR  OPT-DEPT (11) NOT = SPACES
                                         OR  OPT-DEPT (12) NOT = SPACES
                                         OR  OPT-DEPT (13) NOT = SPACES
                                         OR  OPT-DEPT (14) NOT = SPACES
                                         OR  OPT-DEPT (15) NOT = SPACES
                                         OR  OPT-DEPT (16) NOT = SPACES
                                         OR  OPT-EXCL-STRM = "X"
               WRITE PRINT-REC FROM HDR-OPTIONS-2B AFTER ADVANCING 1
               MOVE 4                    TO  LINE-COUNT
           ELSE
           MOVE 3                        TO  LINE-COUNT.
           IF (OPT-CODE (1) NOT = "ALL") AND OPT-CODE (1) NOT = SPACES
               ADD 1                     TO  LINE-COUNT
               WRITE PRINT-REC FROM HDR-OPTIONS-3 AFTER ADVANCING 1.

      *--- THIS WAS MADE INTO A SEPARATE PARAGRAPH SO THAT THE SUMMARY
      *--- REPORT COULD USE THE SAME LOGIC WITHOUT PRINTING THE DETAIL
      *--- HEADINGS.
       7800-HEADERS-CONTINUE.
           WRITE PRINT-REC FROM HDR-2 AFTER ADVANCING 2.
           ADD 2 TO LINE-COUNT.

       7800-EXIT.
           EXIT.

       7810-RETURN-REC.
           RETURN SORT-FILE AT END
               MOVE "Y"                  TO  END-OF-FILE-FLAG.

       7850-CONTROL-BREAK-L1.
           IF LINE-COUNT > 55
               PERFORM 7800-HEADERS  THRU 7800-EXIT.

           IF OPT-SORT = "03" OR "04" OR "05" OR "06" OR "07" OR "10"
                              OR "11" OR "12"
               PERFORM 7860-CONTROL-BREAK-L2.
           MOVE BREAK-FLD-L1             TO  T1-LEVEL-1-ITEM.
           MOVE SPACES                   TO  T1-LEVEL-2-ITEM.
           MOVE L1-COUNT                 TO  T1-COUNT.
           MOVE L1-TOTAL-COST            TO  T1-TOTAL-COST.
           WRITE PRINT-REC FROM BREAK-TOTAL AFTER ADVANCING 2.
           ADD 2                         TO  LINE-COUNT.
      *----- 30SEP1996 ADDED UNION CITY TO THE FOLLOWING IF STATEMENT
           IF (MPLTINFO-COMPANY = "129" OR "153")
             AND OPT-SORT = "10"
               PERFORM 7870-LAWTON-TOTALS.
           MOVE 0                        TO  L1-COUNT.
           MOVE 0                        TO  L1-TOTAL-COST.

           MOVE TEST-BREAK-L1            TO  BREAK-FLD-L1.
           MOVE TEST-BREAK-L2            TO  BREAK-FLD-L2.
      *    IF OPT-SUMMARY-DETAIL NOT = "S"
      *        PERFORM 7800-HEADERS
      *    ELSE
           IF LINE-COUNT > 55
               PERFORM 7800-HEADERS  THRU 7800-EXIT
           ELSE
               MOVE SPACES               TO  PRINT-REC
               ADD 3                     TO  LINE-COUNT
               WRITE PRINT-REC AFTER ADVANCING 3.

       7860-CONTROL-BREAK-L2.
           IF LINE-COUNT > 55
               PERFORM 7800-HEADERS  THRU 7800-EXIT.

           MOVE BREAK-FLD-L1             TO  T1-LEVEL-1-ITEM.
           MOVE BREAK-FLD-L2             TO  T1-LEVEL-2-ITEM.
           MOVE L2-COUNT                 TO  T1-COUNT.
           MOVE L2-TOTAL-COST            TO  T1-TOTAL-COST.
           WRITE PRINT-REC FROM BREAK-TOTAL AFTER ADVANCING 2.
           MOVE 0                        TO  L2-COUNT.
           MOVE 0                        TO  L2-TOTAL-COST.
      *------ WE DONT MOVE BREAK FLD HERE IN CASE THIS IS PERFORMED
      *------ FROM 7850-BREAK-L1.  IF PERFORMED ALONE, THE PERFORMER
      *------ ALSO PERFORMS 7820-MOVE.
           MOVE SPACES                   TO  PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           ADD 3                         TO  LINE-COUNT.

       7870-LAWTON-TOTALS.
      *--------- PRINT ENGINEERING EXPENSE TOTAL LINES FOR LAWTON.
           IF LINE-COUNT > 53
               PERFORM 7800-HEADERS  THRU 7800-EXIT.
           MOVE HOLD-DEPT-VALUE          TO  ENG-TOTAL.
           WRITE PRINT-REC FROM ENG-EXP-TOTAL AFTER ADVANCING 2.
           ADD 2                         TO  LINE-COUNT.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 6
               IF DEPT-ENG (SUB) NOT = 0
                   MOVE DEPT-TRANS (SUB) TO  ENG-OPR-TRANS
                   MOVE DEPT-ENG (SUB)   TO  ENG-OPR-TOTAL
                   WRITE PRINT-REC FROM ENG-OPR-TC-TOTAL
                                                  AFTER ADVANCING 1
                   ADD 1                 TO  LINE-COUNT
               END-IF
           END-PERFORM.

      *--------- PRINT OPERATING EXPENSE TOTAL LINES FOR LAWTON.
           IF LINE-COUNT > 53
               PERFORM 7800-HEADERS  THRU 7800-EXIT.
           COMPUTE HOLD-OPR-VALUE = L1-TOTAL-COST - HOLD-DEPT-VALUE.
           MOVE HOLD-OPR-VALUE           TO  OPR-TOTAL.
           WRITE PRINT-REC FROM OPR-EXP-TOTAL AFTER ADVANCING 2.
           ADD 2                         TO  LINE-COUNT.
           MOVE ZERO                     TO  HOLD-DEPT-VALUE.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 6
               IF DEPT-OPR (SUB) NOT = 0
                   MOVE DEPT-TRANS (SUB) TO  ENG-OPR-TRANS
                   MOVE DEPT-OPR (SUB)   TO  ENG-OPR-TOTAL
                   WRITE PRINT-REC FROM ENG-OPR-TC-TOTAL
                                                  AFTER ADVANCING 1
                   ADD 1                 TO  LINE-COUNT
               END-IF
           END-PERFORM.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 6
               INITIALIZE DEPT-TOTALS (SUB)
           END-PERFORM.

       7990-OS-X.
           EXIT.

      * SECTION IS NEEDED SO SORT DOESN'T FALL THROUGH
       9999-PARAGRAPHS SECTION.

      *------ "COPY OVRPFCALL ..." ONLY APPEARED IN THE IBM VERSION OF
      *------ THIS PROGRAM PRIOR TO ITS BEING COMMENTED OUT.
      *COPY OVRPFCALL IN COPYLIB.     *REMOVED 20JUL92*

      *------ NOTE:  H P  VERSUS  I B M  DIFFERENCE
      *------ "COPY GETFNUM2 IN COPYLIB" IS USED IN THE HP VERSION
      *------ OF THIS PROGRAM INSTEAD OF "GETFNUM".
       COPY GETFNUM   IN COPYLIB.


      *------ THE FOLLOWING PARAGRAPHS ARE HIGHLY MACHINE DEPENDENT
       9999-BEGFIL-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-BEGFIL-DTRANS2-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS2-MC-REC-I.
           START DTRANS2-MC-I KEY >= MATLCODE OF DTRANS2-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETSER-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
      *----- ADDED THE 'OR FILE-STATUS = "46"' PHRASE -15AUG1995
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
               MOVE "Y" TO DTRANS-EOF-SW
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DTRANS-MC-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETSER-DTRANS2-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS2-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
      *----- ADDED THE 'OR FILE-STATUS = "46"' PHRASE -15AUG1995
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DTRANS2-MC-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DAPPLFRT-FP-I.
           MOVE 0 TO COND-WORD.
           MOVE CARRIER-ARG TO RTCARRIER OF DAPPLFRT-FP-REC-I.
           MOVE PRO-NO-ARG  TO RTPRONO   OF DAPPLFRT-FP-REC-I.
           START DAPPLFRT-FP-I KEY >= EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DAPPLFRT-FP-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DAPPLFRT-FP-I.
           MOVE 0 TO COND-WORD.
           READ DAPPLFRT-FP-I NEXT INTO BUF-DAPPLFRT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DAPPLFRT-FP-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
               IF RTCARRIER OF DAPPLFRT-FP-REC-I NOT = CARRIER-ARG
                   MOVE 15 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I.
           OPEN INPUT DTRANS2-MC-I.
           OPEN INPUT DAPPLFRT-FP-I.
           OPEN INPUT MPLTINFO-I.
           OPEN INPUT MACCOUNT-INFO-I.

       9999-CLOSE-STUFF.
           CLOSE DTRANS-MC-I.
           CLOSE DTRANS2-MC-I.
           CLOSE DAPPLFRT-FP-I.
           CLOSE MPLTINFO-I.
           CLOSE MACCOUNT-INFO-I.
