       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TCSISSTT.
       AUTHOR.              F HAYNES.
       DATE-WRITTEN.        7/16/90.
       DATE-COMPILED.
       INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
       SECURITY.
      *D REMARKS.
      *D REPORT #1:
      *D    STATISTICS REPORT FOR REQUISITION STATUS AND ITEM
      *D    TYPE.  STATUS TYPES ARE UNAPPROVED, IN PURCHASING AND ON PO.
      *D    ITEM TYPES ARE CODED STORES, CODED NON-STORES AND NON-CODED.
      *D
      *D REPORT #2:
      *D    STATISTICS ON CORPORATE CODES.  TOTAL # OF CODES, THOSE WITH
      *D    ONHAND > 0, ONORDER >0, STR ONORDER > 0 AND DIRECT DELIVERY
      *D    ONORDER > 0.
      *C
      *C CR KALMAN        4/26/94            REQUEST 6490
      *C REMOVED PORTABLILITY COPYLIBS.
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C CA YODER        09/04/1996
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MREQ-RQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MREQ-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-I.
           COPY DDS-MCRPCS2000 OF MCFLCS2001.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200 OF MCFLCS0201.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  ONLINE-PRT
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS REPORT-REC.
       01  REPORT-REC                    PIC X(133).

       WORKING-STORAGE SECTION.

       77  STATUS-SUB                    PIC S9 COMP-3.
       77  ITEM-TYPE-SUB                 PIC S9 COMP-3.
       77  HANDLE-BLOWUP-FLAG            PIC X VALUE "Y".

9406CK 01  SCOPE   PIC X.

       01  MISC.
           05 TIME-M.
              10 HOURS-M                 PIC XX.
              10 MINUTES-M               PIC XX.
              10 SECONDS-M               PIC XX.
           05 COMPRESS-PRINT             PIC X(08).
           05 NORMAL-PRINT               PIC X(08).

       01  COUNTERS-K                            COMP-3.
      *
      * PROGRAM WIDE COUNTERS
      *
           05 PAGE-NO-K VALUE +0         PIC S9(5).
      *
      * COUNTERS FOR REPORT #1 ( R1 )
      *
           05 TABLE-K     OCCURS 3 TIMES.
              10 COLUMN-TOTAL-K          PIC S9(11) VALUE +0.
              10 NO-REQ-K OCCURS 3 TIMES PIC S9(9)  VALUE +0.
           05 LINE-TOTAL-K VALUE +0      PIC S9(11).
           05 TOTAL-REQ-K VALUE +0       PIC S9(13).
      *

      *
      * COUNTERS FOR REPORT #2 ( R2 )
      *
           05 TOTAL-CORP-CODES-K         PIC S9(13) VALUE +0.
           05 UNINIT-CODES-K             PIC S9(13) VALUE +0.
           05 ONHAND-GT0-K               PIC S9(13) VALUE +0.
           05 OVERAGE-CODES-K            PIC S9(13) VALUE +0.
           05 OVERAGE-COST-K             PIC S9(13) VALUE +0.
           05 ONORDER-GT0-K              PIC S9(13) VALUE +0.
           05 STR-ONORDER-GT0-K          PIC S9(13) VALUE +0.
           05 DIR-ONORDER-GT0-K          PIC S9(13) VALUE +0.
      *

       01  MAIN-HEAD-1-MH.
           05   FILLER VALUE SPACE       PIC X(01).
           05   FILLER VALUE "DATE: "    PIC X(06).
           05 CUR-DATE-1-MH              PIC X(08).
           05   FILLER VALUE SPACES      PIC X(30).
           05   FILLER                   PIC X(34)
                VALUE "THE GOODYEAR TIRE & RUBBER COMPANY".
           05   FILLER VALUE SPACES      PIC X(28).
           05   FILLER VALUE "PRGNAME: " PIC X(09).
           05   FILLER VALUE "TCSISSTT"  PIC X(08).

       01  MAIN-HEAD-2-MH.
           05   FILLER VALUE SPACE       PIC X(01).
           05   FILLER VALUE "TIME: "    PIC X(06).
           05 CUR-TIME-2-MH              PIC X(08).
           05   FILLER VALUE SPACES      PIC X(30).
           05   FILLER                   PIC X(34)
                VALUE "     CSIS STATISTICS REPORT       ".
           05   FILLER VALUE SPACES      PIC X(31).
           05   FILLER VALUE "PAGE: "    PIC X(06).
           05 PAGE-NO-2-MH               PIC ZZZZZZZ9.

      *
      * REPORT #1 SPECIFIC
      *
       01  LINE-DESC-DEF.
           05 LINE-DESC-DATA.
              10   FILLER  VALUE "UNAPPROVED"    PIC X(10).
              10   FILLER  VALUE "IN PURCH  "    PIC X(10).
              10   FILLER  VALUE "ON P.O.   "    PIC X(10).
           05 LINE-DESC-T REDEFINES LINE-DESC-DATA
                          OCCURS 3 TIMES PIC X(10).

       01  R1-REPORT-HEAD-1-RH.
           05   FILLER VALUE SPACE       PIC X(45).
           05   FILLER                   PIC X(34)
                VALUE "   REQUISITION STATUS REPORT      ".

       01  R1-REPORT-HEAD-2-RH.
           05   FILLER VALUE SPACE       PIC X(01).
           05   FILLER VALUE SPACES      PIC X(18).
           05   FILLER VALUE "CODED"     PIC X(05).
           05   FILLER VALUE SPACES      PIC X(09).
           05   FILLER VALUE "CODED"     PIC X(05).

       01  R1-REPORT-HEAD-3-RH.
           05   FILLER VALUE SPACE       PIC X(01).
           05   FILLER VALUE SPACES      PIC X(17).
           05   FILLER VALUE "STORES"    PIC X(06).
           05   FILLER VALUE SPACES      PIC X(04).
           05   FILLER VALUE "NON-STORES"        PIC X(10).
           05   FILLER VALUE SPACES      PIC X(05).
           05   FILLER VALUE "NON-CODED" PIC X(09).
           05   FILLER VALUE SPACES      PIC X(10).
           05   FILLER VALUE "TOTALS"    PIC X(06).

       01  R1-DETAIL-LINE-60-W.
           05 LINE-DESC-60-W             PIC X(10).
           05   FILLER  VALUE SPACES     PIC X(05).
           05 COUNT-ENTRIES-60-W OCCURS 3 TIMES.
              10 NO-REQ-60-W             PIC ZZZZZZZZ9.
              10   FILLER VALUE SPACES   PIC X(05).
           05 LINE-TOTAL-60-W            PIC ZZZZZZZZZZ9.

       01  R1-TOTAL-LINE-61-W.
           05   FILLER VALUE "TOTALS"    PIC X(10).
           05   FILLER VALUE SPACES      PIC X(03).
           05 COUNT-ENTRIES-61-W OCCURS 3 TIMES.
              10 COLUMN-TOTAL-61-W       PIC ZZZZZZZZZZ9.
              10   FILLER VALUE SPACES   PIC X(03).
           05 TOTAL-REQ-61-W             PIC ZZZZZZZZZZZZ9.
      *

      *
      * REPORT #2 SPECIFIC
      *
       01  R2-REPORT-HEAD-1-RH.
           05   FILLER VALUE SPACES      PIC X(45).
           05   FILLER                   PIC X(34)
                VALUE "  CORPORATE CODES STATUS REPORT   ".

       01  R2-DETAIL-LINE-62-W.
           05   FILLER VALUE SPACE       PIC X(01).
           05 COUNTER-LABEL-62-W         PIC X(45).
           05   FILLER VALUE SPACES      PIC X(02).
           05 COUNT-62-W                 PIC Z(17)9.
           05 DOLLAR-62-W REDEFINES COUNT-62-W
                                         PIC $Z,ZZZ,ZZZ,ZZZ,ZZ9.
      *

      **************************************************************
      **                                                          **
      **                S U B P R O G R A M   A R E A S           **
      **                                                          **
      **************************************************************
       COPY DATAB      IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY SONORDER   IN COPYLIB.
       COPY THDPRT     IN COPYLIB.
       COPY ESCNAM2    IN COPYLIB.
       01  PLT-ARG                       PIC X(4).

      ******************************************************************
      **                                                              **
      **             D A T A B A S E   W O R K                        **
      **                                                              **
      ******************************************************************
       01  MPLTINFO-ARG                  PIC X(4)  VALUE "P 01".
       01  DSET-MPLTINFO                 PIC X(16) VALUE "MPLTINFO;".
       01  DSET-MSTORERM                 PIC X(16) VALUE "MSTORERM;".
       01  DSET-MREQ                     PIC X(16) VALUE "MREQ;".
       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
       01  DSET-NAME                     PIC X(16) VALUE SPACES.
       01  REQ-ARG                       PIC X(12) VALUE SPACES.
       01  CODE-ARG                      PIC X(8)  VALUE SPACES.
       01  FILE-STATUS.
           05 FILE-STATUS-1              PIC X     VALUE "0".
           05 FILE-STATUS-2              PIC X     VALUE "0".

      ******************************************************************
      **                                                              **
      **       D A T A B A S E   B U F F E R S                        **
      **                                                              **
      ******************************************************************
       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.
       COPY MREQ       IN COPYLIB.
       COPY MSTORERM   IN COPYLIB.


       PROCEDURE DIVISION.

       BEGIN-HERE.
           PERFORM 1-INIT THRU 1-INIT-X.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-END-OF-JOB THRU 2-END-OF-JOB-X.
           GOBACK.

       1-INIT.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

      *
      * READ ROUTE INFORMATION
      *
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.

           OPEN OUTPUT ONLINE-PRT.
      *
      * WRITE HEADER PAGE AND ROUTING INFORMATION
      *
           PERFORM 9999-GETFNUM.
           MOVE "DHDR65.PUB" TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
                                HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT EQUAL ZERO
             PERFORM 2100-BLOWUP.
      *

      *
      * GET ESCAPE SEQUENCES & CHECK FOR COMPRESS PRINT USAGE
      *
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI TO COMPRESS-PRINT.
           MOVE CHAR-10PI TO NORMAL-PRINT.
           IF NOT PAPER-IS-132-COLS
             WRITE REPORT-REC FROM COMPRESS-PRINT
               AFTER ADVANCING 0 LINES.
      *

           PERFORM 9999-DBOPEN-STORES.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO CUR-DATE-1-MH.
           MOVE DATE-FORMATTED-TIME-OUT TO CUR-TIME-2-MH.

       1-INIT-X.
           EXIT.

       10-MAIN-HEADINGS.
           ADD 1 TO PAGE-NO-K.
           MOVE PAGE-NO-K TO PAGE-NO-2-MH.
           WRITE REPORT-REC FROM MAIN-HEAD-1-MH
             AFTER ADVANCING PAGE.
           WRITE REPORT-REC FROM MAIN-HEAD-2-MH
             AFTER ADVANCING 1 LINE.

       10-MAIN-HEADINGS-X.
           EXIT.

       10-R1-HEADINGS.
           PERFORM 10-MAIN-HEADINGS THRU 10-MAIN-HEADINGS-X.
           WRITE REPORT-REC FROM R1-REPORT-HEAD-1-RH
             AFTER ADVANCING 2 LINES.
           WRITE REPORT-REC FROM R1-REPORT-HEAD-2-RH
             AFTER ADVANCING 2 LINES.
           WRITE REPORT-REC FROM R1-REPORT-HEAD-3-RH
             AFTER ADVANCING 1 LINE.

       10-R1-HEADINGS-X.
           EXIT.

       10-R2-HEADINGS.
           PERFORM 10-MAIN-HEADINGS THRU 10-MAIN-HEADINGS-X.
           WRITE REPORT-REC FROM R2-REPORT-HEAD-1-RH
             AFTER ADVANCING 2 LINES.

       10-R2-HEADINGS-X.
           EXIT.


       2-END-OF-JOB.
      *
      * RESET PRINTER TO NORMAL PRINT IF NEEDED
      *
           IF NOT PAPER-IS-132-COLS
             WRITE REPORT-REC FROM NORMAL-PRINT
               AFTER ADVANCING 0 LINES.
      *
           CLOSE ONLINE-PRT.
           PERFORM 9999-DBCLOSE-STORES.

       2-END-OF-JOB-X.
           EXIT.

       6-MAIN.
      *
      * PRODUCE REPORT #1 - REQUISITION STATUS REPORT
      *
           PERFORM 60-R1-BLD-REQ-CNT-TBL THRU 60-R1-BLD-REQ-CNT-TBL-X.
           PERFORM 61-R1-PROD-REQ-CNT-RPT THRU 61-R1-PROD-REQ-CNT-RPT-X.
      *
      * PRODUCE REPORT #2 - CORPORATE CODE STATUS REPORT
      *
           PERFORM 63-R2-COLLECT-DATA THRU 63-R2-COLLECT-DATA-X.
           PERFORM 64-R2-PROD-CC-RPT THRU 64-R2-PROD-CC-RPT-X.

       6-MAIN-X.
           EXIT.

       60-R1-BLD-REQ-CNT-TBL.
           PERFORM 9999-BEGFIL-MREQ-RQ-I.
           PERFORM 9999-GETSER-MREQ-RQ-I.
           PERFORM UNTIL END-OF-FILE

             EVALUATE REQ-RELEASE-STAT
               WHEN SPACES MOVE 1 TO STATUS-SUB
               WHEN "X "   MOVE 2 TO STATUS-SUB
               WHEN "XX"   MOVE 3 TO STATUS-SUB
             END-EVALUATE
             EVALUATE REQ-STATUS
               WHEN "SS"   MOVE 1 TO ITEM-TYPE-SUB
               WHEN "SN"   MOVE 2 TO ITEM-TYPE-SUB
               WHEN OTHER  MOVE 3 TO ITEM-TYPE-SUB
             END-EVALUATE
             ADD 1 TO NO-REQ-K(STATUS-SUB, ITEM-TYPE-SUB)
             PERFORM 9999-GETSER-MREQ-RQ-I

           END-PERFORM.

       60-R1-BLD-REQ-CNT-TBL-X.
           EXIT.

       61-R1-PROD-REQ-CNT-RPT.
           PERFORM 10-R1-HEADINGS THRU 10-R1-HEADINGS-X.
           PERFORM VARYING STATUS-SUB FROM 1 BY 1
                   UNTIL STATUS-SUB GREATER THAN 3

             MOVE 0 TO LINE-TOTAL-K
             PERFORM VARYING ITEM-TYPE-SUB FROM 1 BY 1
                     UNTIL ITEM-TYPE-SUB GREATER THAN 3

               ADD NO-REQ-K(STATUS-SUB, ITEM-TYPE-SUB) TO LINE-TOTAL-K
                   COLUMN-TOTAL-K(ITEM-TYPE-SUB)
               MOVE NO-REQ-K(STATUS-SUB, ITEM-TYPE-SUB) TO
                    NO-REQ-60-W(ITEM-TYPE-SUB)

             END-PERFORM
             MOVE LINE-TOTAL-K TO LINE-TOTAL-60-W
             MOVE LINE-DESC-T(STATUS-SUB) TO LINE-DESC-60-W
             WRITE REPORT-REC FROM R1-DETAIL-LINE-60-W
               AFTER ADVANCING 1 LINE

           END-PERFORM.
           PERFORM 62-R1-PROD-TOTAL-LINE THRU 62-R1-PROD-TOTAL-LINE-X.

       61-R1-PROD-REQ-CNT-RPT-X.
           EXIT.

       62-R1-PROD-TOTAL-LINE.
           PERFORM VARYING ITEM-TYPE-SUB FROM 1 BY 1
                   UNTIL ITEM-TYPE-SUB GREATER THAN 3

             ADD COLUMN-TOTAL-K(ITEM-TYPE-SUB) TO TOTAL-REQ-K
             MOVE COLUMN-TOTAL-K(ITEM-TYPE-SUB) TO
                  COLUMN-TOTAL-61-W(ITEM-TYPE-SUB)

           END-PERFORM
           MOVE TOTAL-REQ-K TO TOTAL-REQ-61-W.
           WRITE REPORT-REC FROM R1-TOTAL-LINE-61-W
             AFTER ADVANCING 1 LINE.

       62-R1-PROD-TOTAL-LINE-X.
           EXIT.

       63-R2-COLLECT-DATA.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE "Y" TO SONORDER-CALC-DIR-ORD-SW.
           PERFORM 9999-BEGFIL-MSTORERM-CD-I.
           PERFORM 9999-GETSER-MSTORERM-CD-I.
           PERFORM UNTIL END-OF-FILE

             IF CORP-CODE NOT EQUAL "NON-STR"

               ADD 1 TO TOTAL-CORP-CODES-K
               IF STR-ONHAND GREATER THAN ZERO
                 ADD 1 TO ONHAND-GT0-K
               END-IF
               IF ( STR-UM1 EQUAL SPACES ) AND
                  ( STR-DFLT-DEPT EQUAL SPACES )
                 ADD 1 TO UNINIT-CODES-K
               END-IF
               IF STR-ONHAND > STR-MAX
                 ADD 1 TO OVERAGE-CODES-K
                 COMPUTE OVERAGE-COST-K = OVERAGE-COST-K +
                   ((STR-ONHAND - STR-MAX) * STR-AVG-COST)
               END-IF
               CALL "SONORDER" USING BASE, CORP-CODE, SONORDER-PARMS,
                                     MPLTINFO-COMPANY, STATUS-AREA,
                                     BU-DISPLAY-MSG, BU-DISPLAY-FLDS
               IF BU-DISPLAY-MSG-1 NOT = SPACE
                 DISPLAY "SONORDER ERROR FOR CODE ", CORP-CODE
                 DISPLAY BU-DISPLAY-MSG
                 MOVE SPACES TO BU-DISPLAY-MSG
               END-IF
               IF SONORDER-TOTAL-ONORDER GREATER THAN ZERO
                 ADD 1 TO ONORDER-GT0-K
               END-IF
               IF SONORDER-STR-ONORDER GREATER THAN ZERO
                 ADD 1 TO STR-ONORDER-GT0-K
               END-IF
               IF SONORDER-DIR-ONORDER GREATER THAN ZERO
                 ADD 1 TO DIR-ONORDER-GT0-K
               END-IF

             END-IF
             PERFORM 9999-GETSER-MSTORERM-CD-I

           END-PERFORM.

       63-R2-COLLECT-DATA-X.
           EXIT.

       64-R2-PROD-CC-RPT.
           PERFORM 10-R2-HEADINGS THRU 10-R2-HEADINGS-X.

           MOVE "TOTAL CORP CODES" TO COUNTER-LABEL-62-W.
           MOVE TOTAL-CORP-CODES-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "UNINITIALIZED CORP CODES" TO
             COUNTER-LABEL-62-W.
           MOVE UNINIT-CODES-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "CORP CODES ONHAND > 0" TO COUNTER-LABEL-62-W.
           MOVE ONHAND-GT0-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "OVERAGE CORP CODES" TO
             COUNTER-LABEL-62-W.
           MOVE OVERAGE-CODES-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "OVERAGE COST" TO
             COUNTER-LABEL-62-W.
           MOVE OVERAGE-COST-K TO DOLLAR-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "CORP CODES ONORDER > 0" TO COUNTER-LABEL-62-W.
           MOVE ONORDER-GT0-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "CORP CODES WITH STOREROOM ONORDER > 0" TO
             COUNTER-LABEL-62-W.
           MOVE STR-ONORDER-GT0-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

           MOVE "CORP CODES WITH DIRECT DELIVERY ONORDER > 0" TO
             COUNTER-LABEL-62-W.
           MOVE DIR-ONORDER-GT0-K TO COUNT-62-W.
           WRITE REPORT-REC FROM R2-DETAIL-LINE-62-W
             AFTER ADVANCING 2 LINES.

       64-R2-PROD-CC-RPT-X.
           EXIT.

       2100-BLOWUP.
           MOVE "TCSISSTT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
             DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
             BU-DISPLAY-FLDS.

       9999-GETFNUM.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-DBOPEN-STORES.
           OPEN INPUT MREQ-RQ-I            .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MPLTINFO-PK-I        .

       9999-DBCLOSE-STORES.
           CLOSE      MREQ-RQ-I            .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MPLTINFO-PK-I        .

       9999-GETSER-MREQ-RQ-I.
           MOVE 0 TO COND-WORD.
           READ MREQ-RQ-I NEXT INTO BUF-MREQ
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MREQ-RQ-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MREQ-RQ-I.
           MOVE SPACES TO REQNO OF MREQ-RQ-REC-I.
           START MREQ-RQ-I KEY >= REQNO OF MREQ-RQ-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETSER-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           READ MSTORERM-CD-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MSTORERM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MSTORERM-CD-I.
           MOVE SPACES TO CORPCDE OF MSTORERM-CD-REC-I.
           START MSTORERM-CD-I KEY >= CORPCDE OF MSTORERM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

