       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TCSMMRECS.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        01/07/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *D   A LISTING OF ALL CSIS/MMIS DATABASE RECORD COUNTS.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  CSACCT   PIC X(10) VALUE "MCFPCA*".
       01  DRWFIL   PIC X(10) VALUE "MCFPDF*".
       01  EQPREF   PIC X(10) VALUE "MCFPER*".
       01  MMISA    PIC X(10) VALUE "MCFPMM*".
       01  PWORD    PIC X(10) VALUE "MCFPPW*".
       01  STHIST   PIC X(10) VALUE "MCFPST*".
       01  STORES   PIC X(10) VALUE "MCFPCS*".
       01  ZONPRT   PIC X(10) VALUE "MCFPZP*".
       01  LIB-NAME PIC X(10) VALUE "*CURLIB".

       PROCEDURE DIVISION.
       6000-MAIN.
           CALL "TNUMRECS" USING CSACCT, LIB-NAME.
           CALL "TNUMRECS" USING DRWFIL, LIB-NAME.
           CALL "TNUMRECS" USING EQPREF, LIB-NAME.
           CALL "TNUMRECS" USING MMISA, LIB-NAME.
           CALL "TNUMRECS" USING PWORD, LIB-NAME.
           CALL "TNUMRECS" USING STHIST, LIB-NAME.
           CALL "TNUMRECS" USING STORES, LIB-NAME.
           CALL "TNUMRECS" USING ZONPRT, LIB-NAME.
           GOBACK.
