       IDENTIFICATION DIVISION.
       PROGRAM-ID. TDANVCTS.
      *REMARKS.
      *D    THIS PROGRAM GRABS THE CURRENT DATE AND SETS A MONTH RANGE
      *D    FOR THE PREVIOUS MONTH SO THAT COUNTS FOR REQUISITIONS,
      *D    PURCHASE ORDERS AND QUOTES THAT WERE ISSUED FOR THE MONTH
      *D    CAN BE OBTAINED FOR THE PURCHASING MANAGER.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DATRANGE
                  ASSIGN TO DATABASE-MCDATRANGE
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

            SELECT DPORECD
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  DATRANGE
           LABEL RECORDS ARE STANDARD.
       01  DATRANGE-REC.
           05  DATE-START        PIC X(8).
           05  DATE-STOP         PIC X(8).

       FD  DPORECD
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DPORECD-REC.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DREQD
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DREQD-REC.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MPLTINFO-REC.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINTF.
       01  PRINTF                PIC X(132).

       WORKING-STORAGE SECTION.
       77  DAY-ACC-CTR           PIC 9(10).
       77  REQ-REL-ACC           PIC 9(10).
       77  DAYS-TO-PO            PIC 9(5)V99.
       77  DAYS-TO-REL           PIC 9(5)V99.
       77  REL-TO-PO             PIC 9(5)V99.
       77  LINE-CTR              PIC 99.
       77  POS-ISS-CTR           PIC 9(5).
       77  QTS-ISS-CTR           PIC 9(5).
       77  PO-ISS-CTR            PIC 9(5).
       77  REL-ISS-CTR           PIC 9(5).
       77  REL-PO-ACC            PIC 9(10).
       77  REQ-NMS-CTR           PIC 9(5).
       77  REQ-SSS-CTR           PIC 9(5).
       77  REQ-RLS-CTR           PIC 9(5).
       77  WORK-DAYS             PIC 9(2).

       01  CUR-DATE.
           05  CUR-DATE-YY       PIC 99.
           05  CUR-DATE-MM       PIC 99.
           05  CUR-DATE-CC       PIC 99.

       01  DATE-RANGE.
           05  DATE-LOW.
               10  DATE-LOW-CC   PIC 99.
               10  DATE-LOW-YY   PIC 99.
               10  DATE-LOW-MM   PIC 99.
               10  DATE-LOW-DD   PIC 99.
           05  DATE-HIGH.
               10  DATE-HIGH-CC  PIC 99.
               10  DATE-HIGH-YY  PIC 99.
               10  DATE-HIGH-MM  PIC 99.
               10  DATE-HIGH-DD  PIC 99.

       01  DETAIL-LINE.
           05  FILLER            PIC X(19) VALUE SPACES.
           05  D-LIT             PIC X(27) VALUE SPACES.
           05  D-CTR             PIC Z(4)9.
           05  FILLER            PIC X(31) VALUE SPACES.

       01  DETAIL-LINE-2.
           05  FILLER            PIC X(19) VALUE SPACES.
           05  D-LIT-2           PIC X(27) VALUE SPACES.
           05  D-CTR-2           PIC Z(4)9.99.
           05  FILLER            PIC X(28) VALUE SPACES.

       COPY DPORECD   IN COPYLIB.

       COPY DREQD     IN COPYLIB.

       01  FILE-STATUS           PIC XX.

       01  HEADER-0.
           05  FILLER            PIC X(80) VALUE ALL "*".

       01  HEADER-00.
           05  FILLER            PIC X(19) VALUE SPACES.
           05  FILLER            PIC X(12) VALUE "PLEASE GIVE ".
           05  FILLER            PIC X(12) VALUE "THIS OUTPUT ".
           05  FILLER            PIC X(15) VALUE "TO PURCHASING ".
           05  FILLER            PIC X(07) VALUE "MANAGER".
           05  FILLER            PIC X(15) VALUE SPACES.

       01  HEADER-1.
           05  FILLER            PIC X(19) VALUE SPACES.
           05  FILLER            PIC X(14) VALUE "COUNTS FOR THE".
           05  FILLER            PIC X(10) VALUE " PERIOD - ".
           05  H-DATE-LOW        PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(6)  VALUE " THRU ".
           05  H-DATE-HIGH       PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(15) VALUE SPACES.

       01  HEADER-2.
           05  FILLER            PIC X(80) VALUE ALL "-".

       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.

       COPY OVRPFDATA IN COPYLIB.

       COPY MPLTINFO  IN COPYLIB.

       COPY MREQ      IN COPYLIB.

       COPY MSTORERM  IN COPYLIB.

       COPY DREQITM   IN COPYLIB.

       COPY DATAB     IN COPYLIB.

       01 ARG-VALUES.
           05  REQ-ARG                PIC X(12) VALUE SPACES.

       01  WORK-DATE.
           05  WORK-DATE-CC           PIC XX.
           05  WORK-DATE-YMD.
               10  WORK-DATE-YY       PIC XX.
               10  WORK-DATE-MM       PIC XX.
               10  WORK-DATE-DD       PIC XX.

       COPY TBLOWUP   IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.
           PERFORM 6-MAIN  THRU 6-M-X.

       2-EOJ.
           CLOSE DATRANGE.
           MOVE "CLRPFM FILE(*LIBL/MCDATRANGE)" TO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
           CLOSE MREQ, DPORECD, DREQD, MPLTINFO.
           CLOSE PRINT-FILE.
           GOBACK.

       1-HSK.
           OPEN I-O    DATRANGE.
           OPEN I-O    MPLTINFO.
           OPEN INPUT  MREQ, DPORECD, DREQD.
           READ DATRANGE.
           IF FILE-STATUS NOT = "00"
               ACCEPT CUR-DATE FROM DATE
           ELSE
           IF DATRANGE-REC = SPACES
               ACCEPT CUR-DATE FROM DATE
           ELSE
           MOVE DATE-START     TO  DATE-LOW
           MOVE DATE-STOP      TO  DATE-HIGH
           GO TO 1-HSK-CONT.
           MOVE CUR-DATE-YY    TO  DATE-LOW-YY,
                                   DATE-HIGH-YY.
           MOVE CUR-DATE-MM    TO  DATE-LOW-MM,
                                   DATE-HIGH-MM.
           IF CUR-DATE-MM = 01
               MOVE 12         TO  DATE-LOW-MM
                                   DATE-HIGH-MM
               IF CUR-DATE-YY = 00
                   MOVE 99     TO  DATE-LOW-YY
                                   DATE-HIGH-YY
               ELSE
               SUBTRACT 1 FROM DATE-LOW-YY
               SUBTRACT 1 FROM DATE-HIGH-YY
           ELSE
           SUBTRACT 1 FROM CUR-DATE-MM GIVING DATE-LOW-MM
           MOVE DATE-LOW-MM    TO  DATE-HIGH-MM.
           MOVE 01             TO  DATE-LOW-DD.
           IF DATE-LOW-MM = 01 OR 03 OR 05 OR 07 OR 08
               OR 10 OR 12
               MOVE 31         TO  DATE-HIGH-DD
           ELSE
           MOVE 30             TO  DATE-HIGH-DD.
           IF DATE-LOW-YY > 70
               MOVE 19         TO  DATE-LOW-CC,
                                   DATE-HIGH-CC
           ELSE
           MOVE 20             TO  DATE-LOW-CC,
                                   DATE-HIGH-CC.
           MOVE DATE-LOW       TO  H-DATE-LOW.
           MOVE DATE-HIGH      TO  H-DATE-HIGH.
       1-HSK-CONT.
           MOVE 60 TO LINE-CTR.
           MOVE "MCPRT"        TO  OVRPRTF-FILE.
           MOVE "P 01"         TO  PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99         TO  OVRPRTF-TOFILE-NUM.
           IF MPLTINFO-COMPANY = "126"
               MOVE 14         TO  OVRPRTF-TOFILE-NUM
           ELSE
           IF MPLTINFO-COMPANY = "131"
               MOVE 01         TO  OVRPRTF-TOFILE-NUM.
           MOVE HIGH-VALUES    TO  PLTINFOKEY OF MPLTINFO-REC.
           START MPLTINFO KEY > PLTINFOKEY OF MPLTINFO-REC.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
       1-H-X.
           EXIT.

      *********************************************
      *                                           *
      *  BLOWUP ROUTINE EXECUTES WHENEVER A       *
      *  FATAL ERROR OCCURS                       *
      *                                           *
      *********************************************

       2-BLOWUP.
           MOVE "TDANVCTS"     TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       6-MAIN.
           MOVE 0 TO POS-ISS-CTR, QTS-ISS-CTR, REL-ISS-CTR,
               REQ-NMS-CTR, REQ-SSS-CTR, DAY-ACC-CTR, REQ-RLS-CTR,
               REQ-REL-ACC, PO-ISS-CTR, REL-PO-ACC.
           PERFORM 60-READ-MREQ THRU 60-RM-X.
           CLOSE DPORECD.
           OPEN INPUT DPORECD.
           PERFORM 61-READ-DPORECD THRU 61-RD-X.
           PERFORM 62-READ-MPLTINFO THRU 62-M-X.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING NEW-PAGE.
           PERFORM 20 TIMES
               WRITE PRINTF FROM HEADER-0 AFTER ADVANCING 1 LINES
           END-PERFORM.
           WRITE PRINTF FROM HEADER-00 AFTER ADVANCING 2 LINES.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING 2 LINES.
           PERFORM 20 TIMES
               WRITE PRINTF FROM HEADER-0 AFTER ADVANCING 1 LINES
           END-PERFORM.
           MOVE SPACES TO DETAIL-LINE.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               WRITE PRINTF FROM HEADER-1 AFTER ADVANCING NEW-PAGE
               WRITE PRINTF FROM HEADER-2 AFTER ADVANCING 2 LINES.
           MOVE "PURCHASE ORDERS ISSUED     = " TO D-LIT.
           MOVE POS-ISS-CTR TO D-CTR.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           MOVE "REQUIREMENT ORDER RELEASES = " TO D-LIT.
           MOVE REL-ISS-CTR TO D-CTR.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           MOVE "DIRECT PURCHASE REQS       = " TO D-LIT.
           MOVE REQ-NMS-CTR TO D-CTR.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           MOVE "STORES PURCH REQS          = " TO D-LIT.
           MOVE REQ-SSS-CTR TO D-CTR.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           MOVE "QUOTES ISSUED              = " TO D-LIT.
           MOVE QTS-ISS-CTR TO D-CTR.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           MOVE "AVERAGE DAYS - REQ TO REL  = " TO D-LIT-2.
           DIVIDE REQ-REL-ACC BY REQ-RLS-CTR GIVING DAYS-TO-REL.
           MOVE DAYS-TO-REL TO D-CTR-2.
           WRITE PRINTF FROM DETAIL-LINE-2 AFTER ADVANCING 1 LINES.
           MOVE "AVERAGE DAYS - REL TO PO   = " TO D-LIT-2.
           DIVIDE REL-PO-ACC BY PO-ISS-CTR GIVING REL-TO-PO.
           MOVE REL-TO-PO TO D-CTR-2.
           WRITE PRINTF FROM DETAIL-LINE-2 AFTER ADVANCING 1 LINES.
           MOVE "AVERAGE DAYS - REQ TO PO   = " TO D-LIT-2.
           DIVIDE DAY-ACC-CTR BY REQ-RLS-CTR GIVING DAYS-TO-PO.
           MOVE DAYS-TO-PO TO D-CTR-2.
           WRITE PRINTF FROM DETAIL-LINE-2 AFTER ADVANCING 1 LINES.
       6-M-X.    EXIT.

       60-READ-MREQ.
           READ MREQ NEXT INTO BUF-MREQ
               AT END     GO TO 60-RM-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERROR IN MREQ" TO BU-DISPLAY-MSG
               MOVE FILE-STATUS          TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE REQ-DATE       TO  WORK-DATE-YMD.
           IF WORK-DATE-YY > "70"
               MOVE "19"       TO  WORK-DATE-CC
           ELSE
           MOVE "20"           TO  WORK-DATE-CC.
           IF WORK-DATE NOT LESS THAN DATE-LOW
               AND WORK-DATE NOT GREATER THAN DATE-HIGH
                   NEXT SENTENCE
           ELSE
           GO TO 60-READ-MREQ.
           IF REQ-STATUS = "SN" OR "SS" ADD 1 TO REQ-SSS-CTR.
           IF REQ-STATUS = "NM" ADD 1 TO REQ-NMS-CTR.
           IF REQ-RELEASE-STAT = "X "
               ADD 1 TO REQ-RLS-CTR
               PERFORM 600-ACCUM-NO-PO-DAYS THRU 600-ANPD-X
           ELSE
           IF REQ-RELEASE-STAT = "XX"
               PERFORM 601-ACCUM-DAYS-TO-PO THRU 601-ADTP-X.
           GO TO 60-READ-MREQ.
       60-RM-X.    EXIT.

       600-ACCUM-NO-PO-DAYS.
           IF REQ-REL-MC-DATE = "      "
               SUBTRACT REQ-DATE-DD-9 FROM DATE-HIGH-DD
                   GIVING WORK-DAYS
               ADD WORK-DAYS TO DAY-ACC-CTR
               ADD WORK-DAYS TO REQ-REL-ACC
           ELSE
           SUBTRACT REQ-REL-MC-DATE-DD-9 FROM DATE-HIGH-DD
               GIVING WORK-DAYS
           ADD WORK-DAYS TO REL-PO-ACC
           SUBTRACT REQ-DATE-DD-9 FROM REQ-REL-MC-DATE-DD-9
               GIVING WORK-DAYS
           ADD WORK-DAYS TO REQ-REL-ACC
           SUBTRACT REQ-DATE-DD-9 FROM DATE-HIGH-DD
               GIVING WORK-DAYS
           ADD WORK-DAYS TO DAY-ACC-CTR.
       600-ANPD-X.    EXIT.

       601-ACCUM-DAYS-TO-PO.
           MOVE MREQ-NUMBER TO REQNO OF DREQD-REC.
           READ DREQD INTO BUF-DREQD
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               DISPLAY "FILE STATUS ON DREQD READ = " FILE-STATUS
               GO TO 601-ADTP-X.
           MOVE DREQD-PO-RCV-NO TO PORCVNO OF DPORECD-REC.
           READ DPORECD INTO BUF-DPORECD
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 601-ADTP-X.
           MOVE PO-DATE        TO  WORK-DATE-YMD.
           IF WORK-DATE-YY > "70"
               MOVE "19"       TO  WORK-DATE-CC
           ELSE
           MOVE "20"           TO  WORK-DATE-CC.
           IF WORK-DATE NOT LESS THAN DATE-LOW
               AND WORK-DATE NOT GREATER THAN DATE-HIGH
                   NEXT SENTENCE
           ELSE
           GO TO 601-ADTP-X.
           ADD 1               TO  REQ-RLS-CTR.
           ADD 1               TO  PO-ISS-CTR.
           IF REQ-REL-MC-DATE = "      "
               SUBTRACT REQ-DATE-DD-9 FROM DATE-HIGH-DD
                   GIVING WORK-DAYS
               ADD WORK-DAYS   TO  REQ-REL-ACC
               ADD WORK-DAYS   TO  REL-PO-ACC
               ADD WORK-DAYS   TO  DAY-ACC-CTR
           ELSE
           SUBTRACT REQ-DATE-DD-9 FROM REQ-REL-MC-DATE-DD-9
               GIVING WORK-DAYS
           ADD WORK-DAYS       TO  REQ-REL-ACC
           SUBTRACT REQ-REL-MC-DATE-DD-9 FROM PO-DATE-DD-9
               GIVING WORK-DAYS
           ADD WORK-DAYS       TO  REL-PO-ACC
           SUBTRACT REQ-DATE-DD-9 FROM PO-DATE-DD-9
               GIVING WORK-DAYS
           ADD WORK-DAYS       TO  DAY-ACC-CTR.

       601-ADTP-X.    EXIT.

       61-READ-DPORECD.
           READ DPORECD NEXT INTO BUF-DPORECD AT END GO TO 61-RD-X.
           MOVE PO-DATE        TO  WORK-DATE-YMD.
           IF WORK-DATE-YY > "70"
               MOVE "19"       TO  WORK-DATE-CC
           ELSE
           MOVE "20"           TO  WORK-DATE-CC.
           IF WORK-DATE NOT LESS THAN DATE-LOW
               AND WORK-DATE NOT GREATER THAN DATE-HIGH
                   ADD 1 TO POS-ISS-CTR
           ELSE
           GO TO 61-READ-DPORECD.
           IF PO-RLS-NO > "000" ADD 1 TO REL-ISS-CTR.
           GO TO 61-READ-DPORECD.
       61-RD-X.    EXIT.

       62-READ-MPLTINFO.
           MOVE "PQNO"           TO  PLTINFOKEY.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY GO TO 62-M-X.
           IF FILE-STATUS NOT = "00" GO TO 62-M-X.
           DISPLAY "START QUOTE NO = " MPLTINFO-MO-START-QUOTE-NO.
           DISPLAY "FILE NO        = " MPLTINFO-FILE-NO.
           IF MPLTINFO-MO-START-QUOTE-NO-X = "      "
               MOVE ZEROES TO MPLTINFO-MO-START-QUOTE-NO.
           SUBTRACT MPLTINFO-MO-START-QUOTE-NO FROM MPLTINFO-FILE-NO
               GIVING QTS-ISS-CTR.
           DISPLAY "QUOTES ISSUED  = " QTS-ISS-CTR.
           MOVE MPLTINFO-FILE-NO TO MPLTINFO-MO-START-QUOTE-NO.
           REWRITE MPLTINFO-REC FROM BUF-MPLTINFO.
       62-M-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.
