000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.   TDATECHK.
000400*REMARKS.
000500*D   THIS IS A DATE UTILITY PROGRAM THAT WILL AID CALLING PROGRAMS
000600*D   IN FORMATTING DATES IN EITHER AMERICAN OR EUROPEAN STYLE.
000700*
000800*    HOW TO USE THIS SUBPROGRAM:
000900*        IN MODE 0, FIRST DETERMINE THE DATE CODE (EITHER 1 OR 3).
001000*        THEN ADD 3 IF GOING BETWEEN DISPLAY AND DATABASE DATES,
001100*        ADD 6 IF BETWEEN SYSTEM AND DATABASE DATES, OR LEAVE ALONE
001200*        IF GOING BETWEEN SYSTEM AND DISPLAY DATES.  THEN THE
001300*        SUBPROGRAM WILL SIMPLY FLIP MONTH AND DAY IF ITS A
001400*        EUROPEAN PLANT AND IF YOU ADDED 0 OR 3 TO THE DATE CODE.
001500*
001600*        MODE 1 IS USED TO OBTAIN THE CURRENT DATE AND TIME IN THE
001700*        CORRECT STYLE FOR OUTPUT ON DOCUMENTS, SCREENS, REPORTS,
001800*        AND FOR UPDATING THE DATABASE.  (DATABASE FORMAT IS THE
001900*        SAME - YYMMDD - FOR EUROPEAN OR AMERICAN PLANTS).
002000*        IN MODE 1, JUST CALL THE PROGRAM AND THE CURRENT DATE
002100*        AND TIME WILL BE RETURNED IN VARIOUS FORMATS.  THEN
002200*        USE THE FORMAT YOU NEED.  IF ITS A EUROPEAN PLANT,
002300*        THE FORMATTED DATES WILL REFLECT THIS.
002400*
002500*        MODE 2 IS USED TO CONVERT A GIVEN SYSTEM DATE INTO
002600*        VARIOUS FORMATS IN THE CORRECT STYLE.
002700*        IN MODE 2, PASS THE SYSTEM DATE ("CURRENT-DATE").
002800*        IT WILL BE CONVERTED TO VARIOUS FORMATS IN THE
002900*        CORRECT DATE STYLE (AMERICAN OR EUROPEAN).  THEN
003000*        USE THE FORMAT YOU NEED.
003100*
003200*        MODE 3 IS USED TO VALIDATE A DATE INPUTTED FROM A SCREEN,
003300*        AND CONVERT IT TO DATABASE FORMAT.
003400*        IN MODE 3, PASS A DISPLAY DATE INPUTTED FROM A SCREEN.
003500*        IN A EUROPEAN PLANT, THE USER WILL INPUT THE DATE AS
003600*        DAY, THEN MONTH, THEN YEAR.  IN AN AMERICAN PLANT, THE
003700*        USER WILL INPUT THE DATE AS MONTH, THEN DAY, THEN YEAR.
003800*        THE DATE CAN BE PASSED IN ANY FORMAT (IE. FOR AMERICAN,
003900*        THE DATE COULD BE 3/23/85 OR MARCH 3 85 OR MAR 23/85,
004000*        ETC).  THIS DATE WILL THEN BE VALIDATED.  IF THE DATE IS
004100*        INVALID, A RETURN CODE OF 1 WILL BE RETURNED, AND THE
004200*        MESSAGE (I.E. The field must be a valid date...) WILL
004300*        WILL BE RETURNED.  IF THE DATE IS VALID, IT WILL BE
004400*        CONVERTED INTO VARIOUS FORMATS OF THE CORRECT STYLE.
004500*        THEN USE ANY OF THESE CONVERTED DATES THAT YOU NEED.
004600*
004700*        MODE 4 IS USED TO TAKE A DATE FROM THE DATABASE AND
004800*        TRANSFORM IT INTO FORMATS READABLE BY THE USER.
004900*        SIMPLY PASS A DATABASE DATE IN YYMMDD FORMAT, AND IT
005000*        WILL BE RETURNED IN USER FORMATS OF THE CORRECT STYLE.
005100*
005200*    THE PARAMETERS HAVE THE FOLLOWING MEANINGS:
005300*
005400*    DATE-CODE     -  CAN BE EITHER 1, 3, OR 0.
005500*
005600*      1  DATE STYLE IS AMERICAN (MMDDYY)
005700*
005800*      3  DATE STYLE IS EUROPEAN (DDMMYY)
005900*
006000*      0  NO DATE CODE IS PASSED.  IN THIS CASE THE SUBPROGRAM
006100*         WILL DETERMINE THE DATE CODE FROM THE FILE "DDATECOD",
006200*         AND RETURN IT TO THE CALLING PROGRAM. IN THIS CASE ON
006300*         THE SECOND AND ALL FOLLOWING CALLS TO THE SUBPROGRAM,
006400*         THE DATE CODE WILL NOT HAVE TO BE DETERMINED.
006500*         IF THE FILE "DDATECOD" DOES NOT EXIST, THE DEFAULT CODE
006600*         WILL BE 1.
006700*
006800*    THE SUBPROGRAM CAN BE CALLED IN VARIOUS MODES, AS
006900*    FOLLOWS:
007000*
007100*    0  EITHER SYSTEM DATE OR DISPLAY DATE IS PASSED IN X(6) FORMAT
007200*       EITHER DISPLAY DATE OR DATABASE DATE IS RETURNED IN X(6)
007300*       AND ONE OF THE FOLLOWING NUMBERS IS ADDED TO "DATE-CODE"
007400*       TO SPECIFY:
007500*         0  SYSTEM DATE PASSED, DISPLAY DATE RETURNED
007600*            -  SYSTEM DATE PASSED MMDDYY
007700*            -  DISPLAY DATE RETURNED MMDDYY IF AMERICAN
007800*            -  DISPLAY DATE RETURNED DDMMYY IF EUROPEAN
007900*
008000*         3  DISPLAY DATE PASSED, DATABASE DATE RETURNED
008100*            -  DISPLAY DATE PASSED MMDDYYY IF AMERICAN
008200*            -  DISPLAY DATE PASSED DDMMYY IF EUROPEAN
008300*            -  DATABASE DATE RETURNED MMDDYY
008400*
008500*        6  SYSTEM DATE PASSED, DATABASE DATE RETURNED
008600*           -  SYSTEM DATE PASSED MMDDYY
008700*           -  DATABASE DATE RETURNED MMDDYY
008800*
008900*    1  NO DATE IS PASSED
009000*       a. FORMATTED DISPLAY DATE IS RETURNED IN "DATE-SLASH-OUT"
009100*            -  MM/DD/YY IF AMERICAN STYLE PLANT
009200*            -  DD/MM/YY IF EUROPEAN STYLE PLANT
009300*       b. UNFORMATTED DISPLAY DATE IS RETURNED IN "DATE-OUT"
009400*            -  MMDDYY IF AMERICAN STYLE PLANT
009500*            -  DDMMYY IF EUROPEAN STYLE PLANT
009600*       c. DATABASE DATE IS RETURNED AS YYMMDD IN "DATE-YMD-OUT".
009700*       d. FORMATTED TIME IS RETURNED IN "FORMATTED-TIME-OUT"
009800*            -  HH:MN:SS FORMAT
009900*       e. UNFORMATTED TIME IS RETURNED IN "UNFORMATTED-TIME-OUT"
010000*            -  HHMNSS FORMAT
010100*
010200*    2  SYSTEM DATE IS PASSED (MM/DD/YY) IN "DATE-VALIDATE-IN"
010300*       a. FORMATTED DISPLAY DATE IS RETURNED IN "DATE-SLASH-OUT"
010400*            -  MM/DD/YY IF AMERICAN STYLE PLANT
010500*            -  DD/MM/YY IF EUROPEAN STYLE PLANT
010600*       b. UNFORMATTED DISPLAY DATE IS RETURNED IN "DATE-OUT"
010700*            -  MMDDYY IF AMERICAN STYLE PLANT
010800*            -  DDMMYY IF EUROPEAN STYLE PLANT
010900*       c. DATABASE DATE IS RETURNED AS YYMMDD IN "DATE-YMD-OUT".
011000*
011100*    3  DISPLAY DATE FROM SCREEN IS PASSED IN "DATE-VALIDATE-IN".
011200*         -  MONTH, DAY, YEAR IF AMERICAN STYLE
011300*         -  DAY, MONTH, YEAR IF EUROPEAN STYLE PLANT
011400*         -  THE DATE CAN BE IN ANY FORMAT (I.E. FOR EUROPEAN,
011500*            5 JAN 85, 05 JANUARY 85, OR 050185 WOULD BE VALID).
011600*       a. FORMATTED DISPLAY DATE IS RETURNED IN "DATE-SLASH-OUT"
011700*            -  MM/DD/YY IF AMERICAN STYLE PLANT
011800*            -  DD/MM/YY IF EUROPEAN STYLE PLANT
011900*       b. UNFORMATTED DISPLAY DATE IS RETURNED IN "DATE-OUT"
012000*            -  MMDDYY IF AMERICAN STYLE PLANT
012100*            -  DDMMYY IF EUROPEAN STYLE PLANT
012200*       c. DATABASE DATE IS RETURNED AS YYMMDD IN "DATE-YMD-OUT".
012300*       d. A 1 IS RETURNED IN "DATE-RET-CODE" IF THE DATE IS
012400*          INVALID.
012500*       e. AN ERROR MESSAGE IS RETURNED IN "DATE-MSG" IF THE DATE
012600*          IS INVALID.
012700*
012800*    4  DATABASE DATE IS PASSED AS YYMMDD IN "DATE-VALIDATE-IN"
012900*       a. FORMATTED DISPLAY DATE IS RETURNED IN "DATE-SLASH-OUT"
013000*            -  MM/DD/YY IF AMERICAN STYLE PLANT
013100*            -  DD/MM/YY IF EUROPEAN STYLE PLANT
013200*       b. UNFORMATTED DISPLAY DATE IS RETURNED IN "DATE-OUT"
013300*            -  MMDDYY IF AMERICAN STYLE PLANT
013400*            -  DDMMYY IF EUROPEAN STYLE PLANT
013500*       c.  DATABASE DATE IS RETURNED AS YYMMDD IN "DATE-YMD-OUT".
013600*           (THIS DUPLICATES WHAT WAS INPUT IN "DATE-VALIDATE-IN").
013700*
013800*****************
013900** CHANGES     **
014000*****************
014100*
014200*    03/04/86.
014300*        CHANGED THE WAY THIS SUBPROGRAM HANDLES THE SITUATION
014400*        IN MODE 3 (USER DATE) IF A DATE OF SPACES IS PASSED.
014500*        PREVIOUSLY, THE DATE WOULD BE FLAGGED AS INVALID.
014600*        NOW, WILL GIVE A GOOD RETURN CODE, BUT WILL RETURN
014700*        SPACES IN THE VARIOUS DATE FIELDS.  THIS IS TO AVOID
014800*        THE FOLLOWING TYPE OF LOGIC IN THE CALLING PROGRAMS:
014900*          IF DATA-ENTRY-DATE = SPACES
015000*              MOVE SPACES         TO  DATABASE-DATE
015100*          ELSE
015200*              MOVE DATA-ENTRY-DATE TO DATE-VALIDATE-IN
015300*              CALL "TDATECHK"............
015400*        CIH.
015500*
015600*    03/07/86
015700*      CHANGED PROGRAM FOR MODE 4 - IF THE DATABASE DATE
015800*      IS SPACES, RETURNS SPACES IN "DATE-SLASH-OUT"
015900*      INSTEAD OF "  /  /  ".  CIH.
016000*
016000*    11/23/93      BK DISMUKES
016000*      ADDED LOGIC TO RECOGNIZE EUROPEAN DATE FORMAT.
016000*
016100 ENVIRONMENT DIVISION.
016200 CONFIGURATION SECTION.
016300 SOURCE-COMPUTER. AS-400.
016400 OBJECT-COMPUTER. AS-400.
016500*SPECIAL-NAMES.
016600*    CONDITION-CODE IS C-C.
016700 DATA DIVISION.
016800 WORKING-STORAGE SECTION.
016900 01  SAVE-AREA                     PIC X(2).
017000 01  DATE-WORK.
017100     05  DATE-WORK-MD              PIC 9(2).
017200     05  DATE-WORK-DM              PIC 9(2).
017300     05  DATE-WORK-YY              PIC 9(2).
017400 01  LEAP-YEAR-FLAG                PIC X(1)  VALUE "N".
017500 01  LEAP-TEST                     PIC 9(4)V9(4).
017600 01  LEAP-REDEF REDEFINES LEAP-TEST.
017700     05  FILLER                    PIC 9(4).
017800     05  LEAP-TEST-DEC             PIC 9(4).
017900
       01  IBM-DATE-WORK.
           05  IBM-DATE-WORK-YY PIC X(2).
           05  IBM-DATE-WORK-MM PIC X(2).
           05  IBM-DATE-WORK-DD PIC X(2).
018000
018100 01  DDATECOD-FILE  PIC X(22) VALUE "DDATECOD/DONTPURG.PUB".
018200 01  DDATECOD-FNUM  PIC S9(4) COMP-4 VALUE 0.
018300
018300 COPY CCHKOBJ   IN  COPYLIB.
018300
018400 LINKAGE SECTION.
018500 01  DATE-CHECK-AREA.
018600     05  DATE-CODE                 PIC S9(4) COMP-4.
018700     05  DATE-MODE                 PIC S9(4) COMP-4.
018800     05  DATE-IN.
018900         10  DATE-IN-MD            PIC X(2).
019000         10  DATE-IN-DM            PIC X(2).
019100         10  DATE-IN-YY            PIC X(2).
019200     05  DATE-OUT.
019300         10  DATE-OUT-MD           PIC X(2).
019400         10  DATE-OUT-DM           PIC X(2).
019500         10  DATE-OUT-YY           PIC X(2).
019600     05  DATE-RET-CODE             PIC S9(4) COMP-4.
019700     05  DATE-VALIDATE-IN          PIC X(20).
019800*----- DATE TYPE EXAMPLES
019900*----- DATE-TYPE-0             030585
020000*----- DATE-TYPE-1             03/05/85
020100*----- DATE-TYPE-2             03/5/85
020200*----- DATE-TYPE-3             3/05/85
020300*----- DATE-TYPE-4             3/5/85
020400     05  DATE-TYPE-0 REDEFINES DATE-VALIDATE-IN.
020500         10  DATE-NUMERIC          PIC X(6).
020600         10  FILLER                PIC X(14).
020700     05  DATE-TYPE-1 REDEFINES DATE-VALIDATE-IN.
020800         10  DT1-MD                PIC X(2).
020900         10  DT1-S1                PIC X(1).
021000         10  DT1-DM                PIC X(2).
021100         10  DT1-S2                PIC X(1).
021200         10  DT1-YY                PIC X(2).
021300         10  FILLER                PIC X(12).
021400     05  DATE-TYPE-2 REDEFINES DATE-VALIDATE-IN.
021500         10  DT2-MD                PIC X(2).
021600         10  DT2-S1                PIC X(1).
021700         10  DT2-DM                PIC X(1).
021800         10  DT2-S2                PIC X(1).
021900         10  DT2-YY                PIC X(2).
022000         10  FILLER                PIC X(13).
022100     05  DATE-TYPE-3 REDEFINES DATE-VALIDATE-IN.
022200         10  DT3-MD                PIC X(1).
022300         10  DT3-S1                PIC X(1).
022400         10  DT3-DM                PIC X(2).
022500         10  DT3-S2                PIC X(1).
022600         10  DT3-YY                PIC X(2).
022700         10  FILLER                PIC X(13).
022800     05  DATE-TYPE-4 REDEFINES DATE-VALIDATE-IN.
022900         10  DT4-MD                PIC X(1).
023000         10  DT4-S1                PIC X(1).
023100         10  DT4-DM                PIC X(1).
023200         10  DT4-S2                PIC X(1).
023300         10  DT4-YY                PIC X(2).
023400         10  FILLER                PIC X(14).
023500     05  DATE-YMD-OUT.
023600         10  DATE-YMD-OUT-YY       PIC X(2).
023700         10  DATE-YMD-OUT-MM       PIC X(2).
023800         10  DATE-YMD-OUT-DD       PIC X(2).
023900     05  DATE-SLASH-OUT.
024000         10  DATE-SLASH-OUT-MD     PIC X(2).
024100         10  DATE-SLASH-OUT-S1     PIC X(1).
024200         10  DATE-SLASH-OUT-DM     PIC X(2).
024300         10  DATE-SLASH-OUT-S2     PIC X(1).
024400         10  DATE-SLASH-OUT-YY     PIC X(2).
024500     05  FORMATTED-TIME-OUT.
024600         10  FORMATTED-TIME-HH     PIC X(2).
024700         10  FORMATTED-TIME-C1     PIC X(1).
024800         10  FORMATTED-TIME-MN     PIC X(2).
024900         10  FORMATTED-TIME-C2     PIC X(1).
025000         10  FORMATTED-TIME-SS     PIC X(2).
025100     05  UNFORMATTED-TIME-OUT.
025200         10  UNFORMATTED-TIME-HH   PIC 9(2).
025300         10  UNFORMATTED-TIME-MN   PIC 9(2).
025400         10  UNFORMATTED-TIME-SS   PIC 9(2).
025500     05  VIEW-OPEN-FLAG            PIC X(1).
025600     05  SAVE-VIEW-COMAREALEN      PIC X(2).
025700     05  SAVE-VIEW-WINDOWENH       PIC X(2).
025800     05  SAVE-V5                   PIC S9(4) COMP-4.
025900     05  DATE-MSG                  PIC X(45).
026000
026100 PROCEDURE DIVISION USING DATE-CHECK-AREA.
026200 START-PROCESSING.
026300 6000-MAIN.
026400     IF DATE-MODE = 0
026500         PERFORM 6100-FLIP-DATES THRU 6100-FD-X
026600         GOBACK.
026700
026800     IF DATE-CODE = 0
026900         PERFORM 7000-GET-DATE-CODE THRU 7090-GDC-X.
027000
027100     MOVE SPACES                   TO  FORMATTED-TIME-OUT.
027200     MOVE SPACES                   TO  UNFORMATTED-TIME-OUT.
027300     MOVE "/"                      TO  DATE-SLASH-OUT-S1.
027400     MOVE "/"                      TO  DATE-SLASH-OUT-S2.
027500     MOVE 0                        TO  DATE-RET-CODE.
027600
027700     IF DATE-MODE = 1
               ACCEPT IBM-DATE-WORK      FROM DATE
               MOVE IBM-DATE-WORK-MM TO DATE-SLASH-OUT-MD
               MOVE IBM-DATE-WORK-DD TO DATE-SLASH-OUT-DM
               MOVE IBM-DATE-WORK-YY TO DATE-SLASH-OUT-YY
027900         PERFORM 6200-CURRENT-DATE THRU 6290-CD-X.
028000     IF DATE-MODE = 2
028100         MOVE DATE-VALIDATE-IN     TO  DATE-SLASH-OUT
028200         PERFORM 6200-CURRENT-DATE THRU 6290-CD-X.
028300     IF DATE-MODE = 3
028400         PERFORM 6300-DISPLAY-DATE THRU 6390-DD-X
028500         IF DATE-RET-CODE = 1
028600             IF DATE-CODE = 3
028700                 MOVE
028800                 "The field must be a valid date, in DMY order."
028900                 TO  DATE-MSG
029000             ELSE
029100                 MOVE
029200                 "The field must be a valid date, in MDY order."
029300                 TO DATE-MSG.
029400     IF DATE-MODE = 4
029500         PERFORM 6400-DATABASE-DATE THRU 6490-DD-X.
029600
029700     GOBACK.
029800
029900 6100-FLIP-DATES.
030000     MOVE DATE-IN TO DATE-OUT.
030100     IF DATE-CODE = 3 OR 5 OR 6 OR 8
030200         MOVE DATE-IN-MD TO DATE-OUT-DM
030300         MOVE DATE-IN-DM TO DATE-OUT-MD.
030400
030500 6100-FD-X.
030600     EXIT.
030700
030800 6200-CURRENT-DATE.
030900     MOVE ":"                      TO  FORMATTED-TIME-C1.
031000     MOVE ":"                      TO  FORMATTED-TIME-C2.
031100     MOVE DATE-SLASH-OUT-MD        TO  DATE-YMD-OUT-MM.
031200     MOVE DATE-SLASH-OUT-DM        TO  DATE-YMD-OUT-DD.
031300     MOVE DATE-SLASH-OUT-YY        TO  DATE-YMD-OUT-YY.
031400
031500     MOVE DATE-SLASH-OUT-MD        TO  DATE-OUT-MD.
031600     MOVE DATE-SLASH-OUT-DM        TO  DATE-OUT-DM.
031700     MOVE DATE-SLASH-OUT-YY        TO  DATE-OUT-YY.
031800
031900     IF DATE-CODE = 3
032000         PERFORM 7100-FLIP-DATE-SLASH-OUT
032100         PERFORM 7200-FLIP-DATE-OUT.
032200
032300     ACCEPT UNFORMATTED-TIME-OUT   FROM TIME.
032400     MOVE UNFORMATTED-TIME-HH      TO  FORMATTED-TIME-HH.
032500     MOVE UNFORMATTED-TIME-MN      TO  FORMATTED-TIME-MN.
032600     MOVE UNFORMATTED-TIME-SS      TO  FORMATTED-TIME-SS.
032700
032800 6290-CD-X.
032900     EXIT.
033000
033100 6300-DISPLAY-DATE.
033200
033300     IF DATE-NUMERIC = SPACES
033400         MOVE SPACES               TO  DATE-YMD-OUT
033500         MOVE SPACES               TO  DATE-SLASH-OUT
033600         GO TO 6390-DD-X.
033700
033800*---------- THE DATE SEPERATOR (I.E. 3/5/85) COULD BE ANY ASCII
033900*---------- CHARACTER LESS THAN "0" - THAT IS "/", ".", "-",
034000*---------- SPACE, ETC.
034100     IF DATE-NUMERIC NUMERIC
034200         MOVE DATE-NUMERIC         TO  DATE-WORK
034300     ELSE
034400     IF DT1-S2 < "0"
034500       IF DT1-MD NUMERIC AND DT1-DM NUMERIC AND DT1-YY NUMERIC
034600         MOVE DT1-MD               TO  DATE-WORK-MD
034700         MOVE DT1-DM               TO  DATE-WORK-DM
034800         MOVE DT1-YY               TO  DATE-WORK-YY
034900       ELSE
035000         MOVE 1                    TO  DATE-RET-CODE
035100         GO TO 6390-DD-X
035200     ELSE
035300     IF DT2-S1 < "0"
035400       IF DT2-MD NUMERIC AND DT2-DM NUMERIC AND DT2-YY NUMERIC
035500         MOVE DT2-MD               TO  DATE-WORK-MD
035600         MOVE DT2-DM               TO  DATE-WORK-DM
035700         MOVE DT2-YY               TO  DATE-WORK-YY
035800       ELSE
035900         MOVE 1                    TO  DATE-RET-CODE
036000         GO TO 6390-DD-X
036100     ELSE
036200     IF DT3-S2 < "0"
036300       IF DT3-MD NUMERIC AND DT3-DM NUMERIC AND DT3-YY NUMERIC
036400         MOVE DT3-MD               TO  DATE-WORK-MD
036500         MOVE DT3-DM               TO  DATE-WORK-DM
036600         MOVE DT3-YY               TO  DATE-WORK-YY
036700       ELSE
036800         MOVE 1                    TO  DATE-RET-CODE
036900         GO TO 6390-DD-X
037000     ELSE
037100     IF DT4-S2 < "0"
037200       IF DT4-MD NUMERIC AND DT4-DM NUMERIC AND DT4-YY NUMERIC
037300         MOVE DT4-MD               TO  DATE-WORK-MD
037400         MOVE DT4-DM               TO  DATE-WORK-DM
037500         MOVE DT4-YY               TO  DATE-WORK-YY
037600       ELSE
037700         MOVE 1                    TO  DATE-RET-CODE
037800         GO TO 6390-DD-X
037900     ELSE
038000         MOVE 1                    TO  DATE-RET-CODE
038100         GO TO 6390-DD-X.
038200
038300     MOVE DATE-WORK-MD             TO  DATE-SLASH-OUT-MD.
038400     MOVE DATE-WORK-DM             TO  DATE-SLASH-OUT-DM.
038500     MOVE DATE-WORK-YY             TO  DATE-SLASH-OUT-YY.
038600     MOVE DATE-WORK-MD             TO  DATE-OUT-MD.
038700     MOVE DATE-WORK-DM             TO  DATE-OUT-DM.
038800     MOVE DATE-WORK-YY             TO  DATE-OUT-YY.
038900
039000     IF DATE-CODE = 3
039100         MOVE DATE-WORK-MD         TO  DATE-YMD-OUT-DD
039200         MOVE DATE-WORK-DM         TO  DATE-YMD-OUT-MM
039300         MOVE DATE-WORK-YY         TO  DATE-YMD-OUT-YY
039400     ELSE
039500         MOVE DATE-WORK-MD         TO  DATE-YMD-OUT-MM
039600         MOVE DATE-WORK-DM         TO  DATE-YMD-OUT-DD
039700         MOVE DATE-WORK-YY         TO  DATE-YMD-OUT-YY.
039800
039900     IF DATE-YMD-OUT-MM = "02"
040000         IF DATE-WORK-YY > 00
040100             DIVIDE DATE-WORK-YY BY 4 GIVING LEAP-TEST
040200             IF LEAP-TEST-DEC > 0
040300                 MOVE "N"          TO  LEAP-YEAR-FLAG
040400             ELSE
040500                 MOVE "Y"          TO  LEAP-YEAR-FLAG
040600         ELSE
040700             MOVE "Y"              TO  LEAP-YEAR-FLAG.
040800
040900     IF DATE-YMD-OUT-MM = "02"
041000         IF LEAP-YEAR-FLAG = "Y"
041100             IF DATE-YMD-OUT-DD < "01" OR > "29"
041200                 MOVE 1            TO  DATE-RET-CODE
041300                 GO TO 6390-DD-X
041400             ELSE
041500                 NEXT SENTENCE
041600         ELSE
041700         IF DATE-YMD-OUT-DD < "01" OR > "28"
041800             MOVE 1                TO  DATE-RET-CODE
041900             GO TO 6390-DD-X
042000         ELSE
042100             NEXT SENTENCE
042200     ELSE
042300     IF DATE-YMD-OUT-MM = "04" OR "06" OR "09" OR "11"
042400         IF DATE-YMD-OUT-DD < "01" OR > "30"
042500             MOVE 1                TO  DATE-RET-CODE
042600             GO TO 6390-DD-X
042700         ELSE
042800             NEXT SENTENCE
042900     ELSE
043000     IF DATE-YMD-OUT-MM = "01" OR "03" OR "05" OR "07" OR
043100                          "08" OR "10" OR "12"
043200         IF DATE-YMD-OUT-DD < "01" OR > "31"
043300             MOVE 1                TO  DATE-RET-CODE
043400             GO TO 6390-DD-X
043500         ELSE
043600             NEXT SENTENCE
043700     ELSE
043800         MOVE 1                    TO  DATE-RET-CODE
043900         GO TO 6390-DD-X.
044000
044100 6390-DD-X.
044200     EXIT.
044300
044400 6400-DATABASE-DATE.
044500     MOVE DATE-VALIDATE-IN         TO  DATE-YMD-OUT.
044600     MOVE DATE-YMD-OUT-YY          TO  DATE-SLASH-OUT-YY.
044700     MOVE DATE-YMD-OUT-MM          TO  DATE-SLASH-OUT-MD.
044800     MOVE DATE-YMD-OUT-DD          TO  DATE-SLASH-OUT-DM.
044900
045000     MOVE DATE-YMD-OUT-YY          TO  DATE-OUT-YY.
045100     MOVE DATE-YMD-OUT-MM          TO  DATE-OUT-MD.
045200     MOVE DATE-YMD-OUT-DD          TO  DATE-OUT-DM.
045300
045400     IF DATE-CODE = 3
045500         PERFORM 7100-FLIP-DATE-SLASH-OUT
045600        PERFORM 7200-FLIP-DATE-OUT.
045700
045800     IF DATE-SLASH-OUT = "  /  /  "
045900         MOVE SPACES               TO  DATE-SLASH-OUT.
046000
      *------ THEY CAN ALSO PASS AN UNFORMATTED TIME FROM THE
      *------ DATABASE AND GET A FORMATTED TIME BACK.
           IF UNFORMATTED-TIME-OUT > SPACES
               MOVE UNFORMATTED-TIME-HH  TO  FORMATTED-TIME-HH
               MOVE ":"                  TO  FORMATTED-TIME-C1
               MOVE UNFORMATTED-TIME-MN  TO  FORMATTED-TIME-MN
               MOVE ":"                  TO  FORMATTED-TIME-C2
               MOVE UNFORMATTED-TIME-SS  TO  FORMATTED-TIME-SS.

046100 6490-DD-X.
046200     EXIT.
046300
046400 7000-GET-DATE-CODE.
           MOVE "DATECODE"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE 3                    TO  DATE-CODE
           ELSE
               MOVE 1                    TO  DATE-CODE
           END-IF.

046500*    CALL INTRINSIC "FOPEN" USING DDATECOD-FILE, %7, %0,
046600*      \\,\\,\\,\\,\\,\\,\\,\\,\\,\\
046700*        GIVING DDATECOD-FNUM.
046800*    IF C-C = 0
046900*        MOVE 3                    TO  DATE-CODE
047000*    ELSE
047100*        MOVE 1                    TO  DATE-CODE.
047200*
047300*    CALL INTRINSIC "FCLOSE" USING DDATECOD-FNUM, 0, 0.
047400*
047500 7090-GDC-X.
047600     EXIT.
047700
047800 7100-FLIP-DATE-SLASH-OUT.
047900     MOVE DATE-SLASH-OUT-MD        TO  SAVE-AREA.
048000     MOVE DATE-SLASH-OUT-DM        TO  DATE-SLASH-OUT-MD.
048100     MOVE SAVE-AREA                TO  DATE-SLASH-OUT-DM.
048200
048300 7200-FLIP-DATE-OUT.
048400     MOVE DATE-OUT-MD              TO  SAVE-AREA.
048500     MOVE DATE-OUT-DM              TO  DATE-OUT-MD.
048600     MOVE SAVE-AREA                TO  DATE-OUT-DM.
