000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TDCRRESP.
000400 INSTALLATION.  GOODYEAR TIRE & RUBBER COMPANY.
000700*REMARKS.       THIS PROGRAM SHOWS THE NUMBER OF WORK ORDERS
000800*               THAT HAVE BEEN INITIATED, STARTED, AND COM -
000900*               LETED BY SHIFT WITHIN CRAFT WITHIN ZONE.
001000*
001100*               DEFAULTS TO LAST 24 HOURS.   USER CAN SUPPLY
001200*               REPORT OPTIONS WHEN SUBMITTED BY 'XRSCREEN'.
001300*
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.   AS400.
001700 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
002000 INPUT-OUTPUT SECTION.
002100 FILE-CONTROL.
002300     SELECT R4FILE
002400         ASSIGN TO DATABASE-MCFPMR4FIL
               ORGANIZATION IS SEQUENTIAL
002500         ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS R4-STATUS.
002700     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
002800     SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
003000 DATA DIVISION.
003100 FILE SECTION.
003300 FD  R4FILE
003400     RECORD CONTAINS 44 CHARACTERS
003500     LABEL RECORDS ARE OMITTED
003600     DATA RECORD IS R4REC.
003700 01  R4REC                         PIC X(44).
003900 FD  PRINT-FILE
004000     RECORD CONTAINS 132 CHARACTERS
004100     LABEL RECORD IS OMITTED
004200     DATA RECORD IS PRINTF.
004300 01  PRINTF                        PIC X(132).
004500 SD  SORT-FILE
004600     RECORD CONTAINS 28 CHARACTERS
004700     DATA RECORD IS SORT-REC.
004800 01  SORT-REC.
004900     05  ZONE-SORT                 PIC X(4).
005000     05  CRFT-SORT                 PIC X(2).
005100     05  SHFT-SORT                 PIC X.
005200     05  PRTY-SORT                 PIC X.
005300     05  RECD-SORT                 PIC 9(4).
005400     05  STRT-SORT                 PIC 9(4).
005500     05  COMP-SORT                 PIC 9(4).
005600     05  RESP-SORT                 PIC 9(4).
005700     05  WORK-SORT                 PIC 9(4).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
006000 WORKING-STORAGE SECTION.
006200 01  ALL-RECORDS-WRITTEN-SW        PIC X.
006300 01  ARGUMENT-DEFN                 PIC XX.
006400 01  ARG-NO                        PIC 9(9).
       01  BLOWUP-BASE                   PIC X(16).
006800 01  COMP-DATE                     PIC X(12).
004400 01  COMPRESS-PRINT                PIC X(8).
006900 01  DAYS-LAST-YEAR                PIC S9(4).
007000 01  DATE-BUFF.
007500     05 YR-BUFF-9                  PIC 99.
007100     05 MTH-BUFF-9                 PIC 99.
007300     05 DAY-BUFF-9                 PIC 99.
       01  DAY-DIGIT                     PIC X.
007600 COPY TDATESUB  OF COPYLIB.
007700 01  DBPARAMETERS.                 COPY DBPARMS OF COPYLIB.
       01  DELETE-FILE                   PIC X(10) VALUE "MCFPMR4FIL".
007800 01  DETAIL-REC.
007900     05 CALLS-RECD                 PIC S9(4).
008000     05 CALLS-STRT                 PIC S9(4).
008100     05 CALLS-COMP                 PIC S9(4).
008200     05 CALLS-NOT-STRT             PIC S9(4).
008300     05 CALLS-NOT-COMP             PIC S9(4).
008400     05 CALLS-NET-RECD             PIC S9(4).
008500     05 CALLS-NET-STRT             PIC S9(4).
008600     05 CALLS-AVG-RESP             PIC S9(4).
008700     05 CALLS-AVG-WORK             PIC S9(4).
008800 01  DETAIL-PRNT.
008900     05 FILLER                     PIC X(17) VALUE SPACES.
009000     05 FILLER                     PIC X(9)  VALUE ALL "-".
009100     05 FILLER                     PIC X     VALUE SPACES.
009200     05 CALLS-RECD-P               PIC ZZ99.
009300     05 FILLER                     PIC X(4)  VALUE SPACES.
009400     05 CALLS-STRT-P               PIC ZZ99.
009500     05 FILLER                     PIC X(4)  VALUE SPACES.
009600     05 CALLS-COMP-P               PIC ZZ99.
009700     05 FILLER                     PIC X(4)  VALUE SPACES.
009800     05 CALLS-NOT-STRT-P           PIC ZZ99.
009900     05 FILLER                     PIC X(4)  VALUE SPACES.
010000     05 CALLS-NOT-COMP-P           PIC ZZ99.
010100     05 FILLER                     PIC X(4)  VALUE SPACES.
010200     05 CALLS-NET-RECD-P           PIC +ZZ99.
010300     05 FILLER                     PIC X(4)  VALUE SPACES.
010400     05 CALLS-NET-STRT-P           PIC +ZZ99.
010500     05 FILLER                     PIC X(4)  VALUE SPACES.
010600     05 CALLS-AVG-RESP-P           PIC ZZ99.
010700     05 FILLER                     PIC X(4)  VALUE SPACES.
010800     05 CALLS-AVG-WORK-P           PIC ZZ99.
010900     05 FILLER                     PIC X(38) VALUE SPACES.
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  R4-STATUS                 PIC XX.
           05  WBF-STATUS                PIC XX.
           05  WLNU-STATUS               PIC XX.
       01  GREG-DATE.
           05  GREG-CC                   PIC XX.
           05  GREG-YMD.
               10  GREG-YY               PIC XX.
               10  GREG-YY-9 REDEFINES GREG-YY  PIC 99.
               10  GREG-MM               PIC XX.
               10  GREG-DD               PIC XX.
011700 01  H1.
011800     05 FILLER                     PIC X(2) VALUE "R4".
011900     05 FILLER                     PIC X(23) VALUE SPACES.
012000     05 FILLER                     PIC X(41)
012100        VALUE "C R A F T   R E S P O N S E   R E P O R T".
012200     05 FILLER                     PIC X(23) VALUE SPACES.
012300     05 DATE-1-H                   PIC X(8).
012400 01  H2.
012500     05 FILLER                     PIC X(27) VALUE SPACES.
012600     05 FILLER                     PIC X(2) VALUE "WO".
012700     05 FILLER                     PIC X(6) VALUE SPACES.
012800     05 FILLER                     PIC X(2) VALUE "WO".
012900     05 FILLER                     PIC X(6) VALUE SPACES.
013000     05 FILLER                     PIC X(2) VALUE "WO".
013100     05 FILLER                     PIC X(6) VALUE SPACES.
013200     05 FILLER                     PIC X(3) VALUE "NOT".
013300     05 FILLER                     PIC X(5) VALUE SPACES.
013400     05 FILLER                     PIC X(3) VALUE "NOT".
013500     05 FILLER                     PIC X(6) VALUE SPACES.
013600     05 FILLER                     PIC X(3) VALUE "NET".
013700     05 FILLER                     PIC X(6) VALUE SPACES.
013800     05 FILLER                     PIC X(3) VALUE "NET".
013900     05 FILLER                     PIC X(5) VALUE SPACES.
014000     05 FILLER                     PIC X(3) VALUE "AVG".
014100     05 FILLER                     PIC X(5) VALUE SPACES.
014200     05 FILLER                     PIC X(3) VALUE "AVG".
014300 01  H3.
014400     05 FILLER                     PIC X(27) VALUE SPACES.
014500     05 FILLER                     PIC X(4)  VALUE "RECD".
014600     05 FILLER                     PIC X(4)  VALUE SPACES.
014700     05 FILLER                     PIC X(4)  VALUE "STRT".
014800     05 FILLER                     PIC X(4)  VALUE SPACES.
014900     05 FILLER                     PIC X(4)  VALUE "COMP".
015000     05 FILLER                     PIC X(4)  VALUE SPACES.
015100     05 FILLER                     PIC X(4)  VALUE "STRT".
015200     05 FILLER                     PIC X(4)  VALUE SPACES.
015300     05 FILLER                     PIC X(4)  VALUE "COMP".
015400     05 FILLER                     PIC X(5)  VALUE SPACES.
015500     05 FILLER                     PIC X(4)  VALUE "RECD".
015600     05 FILLER                     PIC X(5)  VALUE SPACES.
015700     05 FILLER                     PIC X(4)  VALUE "STRT".
015800     05 FILLER                     PIC X(4)  VALUE SPACES.
015900     05 FILLER                     PIC X(4)  VALUE "RESP".
016000     05 FILLER                     PIC X(4)  VALUE SPACES.
016100     05 FILLER                     PIC X(4)  VALUE "WORK".
       01  JULIAN-DATE                   PIC X(7).
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA IN COPYLIB.
018500 01  JUL-DAY-COMP                  PIC 9(7).
018600 01  JUL-DAY-RECD                  PIC 9(7).
018700 01  JUL-DAY-SAVE                  PIC 9(7).
018800 01  JUL-DAY-STRT                  PIC 9(7).
023300 COPY LANGSUB  OF COPYLIB.
023400 01  LAST-RECORD-PRNT-SW           PIC X.
023200 01  LAST-WO-BUFF.                 COPY MLASTWO  OF COPYLIB.
       01  LEAP-YEAR-FLAG                PIC X.
021600 01  LINK-DATA.
021700     05 ZONE-BUF-LINK              PIC X(4).
021800     05 TIME-IN.
021900        10 HRS-IN                  PIC 99.
022000        10 MIN-IN                  PIC 99.
022100     05 CODE-BUF                   PIC X.
022200     05 SHIFTS.
022300        10 S-1                     PIC 9999.
022400        10 E-1                     PIC 9999.
022500        10 S-2                     PIC 9999.
022600        10 E-2                     PIC 9999.
022700        10 S-3                     PIC 9999.
022800        10 E-3                     PIC 9999.
022900        10 S-4                     PIC 9999.
023000        10 E-4                     PIC 9999.
023100     05 CURR-SHIFT                 PIC 9.
018900 01  LITERALS.
019000     05 ZONE-LITL.
019100        10 FILLER                  PIC X(4) VALUE "ZONE".
019200        10 FILLER                  PIC X(5) VALUE SPACES.
019300        10 ZONE-VALUE              PIC X(4).
019400        10 FILLER                  PIC X(119) VALUE SPACES.
019600     05 CRFT-LITL.
019700        10 FILLER                  PIC X(2) VALUE SPACES.
019800        10 FILLER                  PIC X(5) VALUE "CRAFT".
019900        10 FILLER                  PIC X(4) VALUE SPACES.
020000        10 CRFT-VALUE              PIC X(2).
020100        10 FILLER                  PIC X(119) VALUE SPACES.
020300     05 SHFT-LITL.
020400        10 FILLER                  PIC X(4) VALUE SPACES.
020500        10 FILLER                  PIC X(5) VALUE "SHIFT".
020600        10 FILLER                  PIC X(4) VALUE SPACES.
020700        10 SHFT-VALUE              PIC X.
020800        10 FILLER                  PIC X(118) VALUE SPACES.
021000     05 PRTY-LITL.
021100        10 FILLER                  PIC X(6) VALUE SPACES.
021200        10 FILLER                  PIC X(8) VALUE "PRIORITY".
021300        10 FILLER                  PIC X VALUE SPACE.
021400        10 PRTY-VALUE              PIC X.
021500        10 FILLER                  PIC X(116) VALUE SPACES.
       01  NORMAL-PRINT                  PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
005400 01  R4-BUFFER.
           05  R4-DATA-1.
005900         10 R4-OPTS OCCURS 5 TIMES.
006000            15  ZONE-R  OCCURS 1 TIMES
006100                                   PIC X(4).
006200            15  EQPNUMS OCCURS 5 TIMES.
006300                20  EQPNUM-R       PIC X(6).
006400            15  CRAFTS  OCCURS 5 TIMES.
006500                20  CRAFT-R        PIC X(2).
           05  R4-DATA-2 REDEFINES R4-DATA-1.
               10  R4-DATE-TIME-S.
005500             15 BEG-DATE           PIC X(6).
005600             15 BEG-TIME           PIC X(4).
               10  FILLER                PIC X(34).
           05  R4-DATA-4 REDEFINES R4-DATA-1.
               10  R4-DATE-TIME-E.
005700             15 END-DATE           PIC X(6).
005800             15 END-TIME           PIC X(4).
               10  FILLER                PIC X(34).
024700 01  R4FILE-SW                     PIC X.
024800 01  RESP-TOTAL                    PIC 9(18) COMP-4.
024900 01  RESP-CNTR                     PIC 9(10) COMP-4.
025000 01  SWITCHES.
025100     05 RECD-SW                    PIC X.
025200     05 STRT-SW                    PIC X.
025300     05 COMP-SW                    PIC X.
025400     05 RECD-NUM                   PIC X.
025500     05 STRT-NUM                   PIC X.
025600     05 COMP-NUM                   PIC X.
025700 01  S1                            PIC S9(4) COMP-4.
025800 01  START-DATE-CN.
           05 STRT-CC                    PIC 99.
           05 START-DATE.
025900         10 STRT-YY                PIC 99.
026000         10 STRT-MM                PIC 99.
026100         10 STRT-DD                PIC 99.
026200         10 STRT-TIME              PIC 9999.
026300 01  STOP-DATE-CN.
           05 STOP-CC                    PIC 99.
           05 STOP-DATE.
026400         10 STOP-YY                PIC 99.
026500         10 STOP-MM                PIC 99.
026600         10 STOP-DD                PIC 99.
026700         10 STOP-TIME              PIC 9999.
027000 COPY DBSTAT  IN COPYLIB.
027100 01  STATUS-VALUES.
027200     05 FILLER                     PIC X(2) VALUE "FF".
027300     05 FILLER                     PIC X(2) VALUE "DW".
027400     05 FILLER                     PIC X(2) VALUE "CW".
027500     05 FILLER                     PIC X(2) VALUE "IP".
027600     05 FILLER                     PIC X(2) VALUE "OO".
027700 01  STATUS-TABLE REDEFINES STATUS-VALUES.
027800     05 STAT OCCURS 5 TIMES        PIC X(2).
       COPY TBLOWUP IN COPYLIB.
027900 01  TCOMP-MIN                     PIC S9(4).
       COPY THDPRT  IN COPYLIB.
028000 01  TIME-BUFF.
028100     02  TIME-HHMM                 PIC XXXX.
028200     02  FILLER                    PIC XX.
028300 01  TRECD-MIN                     PIC S9(4).
028400 01  TSAVE-MIN                     PIC S9(4).
028500 01  TSTRT-MIN                     PIC S9(4).
028600 01  TABLE-NUM                     PIC S9(4) COMP-4.
028700 01  TABLE-NUM1                    PIC S9(4) COMP-4.
028800 01  TAGS.
028900     05  ZONE-TAG                  PIC X(4).
029000     05  CRFT-TAG                  PIC X(2).
029100     05  SHFT-TAG                  PIC X.
029200     05  PRTY-TAG                  PIC X.
       COPY VCOMLINK  OF COPYLIB.
029300 01  WORK-TOTAL                    PIC 9(18) COMP-4.
029400 01  WORK-CNTR                     PIC 9(10) COMP-4.
029500 01  WO-BASIC-DATA.                COPY DWOBASIC OF COPYLIB.
029600 01  WRITE-K                       PIC 9(4) VALUE 0.
029700 01  ZONE-TABLE.
029800     05 ZT OCCURS 100 TIMES.
029900        10 TZONE                   PIC X(4).
030000        10 EQPNUMS.
030100           15 TEQPNUM OCCURS 5 TIMES
030200                                   PIC X(6).
030300        10 CRAFTS.
030400           15 TCRAFT  OCCURS 5 TIMES
030500                                   PIC X(2).
030800 PROCEDURE DIVISION.
031000 BEGIN-PROC.
           OPEN INPUT  R4FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
031300     MOVE SPACES TO ZONE-TABLE.
030900     ACCEPT DATE-BUFF FROM DATE.
031000     ACCEPT TIME-BUFF FROM TIME.
           MOVE YR-BUFF-9 TO STOP-YY.
           MOVE MTH-BUFF-9 TO STOP-MM.
           MOVE DAY-BUFF-9 TO STOP-DD.
           MOVE TIME-HHMM TO STOP-TIME.
031300     MOVE MTH-BUFF-9 TO GREG-MM.
031400     MOVE DAY-BUFF-9 TO GREG-DD.
031500     MOVE YR-BUFF-9  TO GREG-YY.
           IF GREG-YY > "70"
               MOVE "19"   TO GREG-CC
           ELSE
           MOVE "20"       TO GREG-CC.
031700     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           IF JULIAN-DATE-9 > 1
031800         SUBTRACT 1 FROM JULIAN-DATE-9
           ELSE
032000         MOVE 12 TO GREG-MM
032100         MOVE 31 TO GREG-DD
032200         SUBTRACT 1 FROM GREG-YY-9
               MOVE SPACES TO JULIAN-DATE
               IF GREG-YY > "70"
                   MOVE "19" TO GREG-CC
032300             CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG
               ELSE
               MOVE "20" TO GREG-CC
               CALL "JULGREG" USING GREG-DATE, JULIAN-DATE
                                DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE SPACES TO GREG-DATE.
032500     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
032800     MOVE GREG-YY TO STRT-YY.
032900     MOVE GREG-MM TO STRT-MM.
033000     MOVE GREG-DD TO STRT-DD.
033100     MOVE TIME-HHMM TO STRT-TIME.
033300     MOVE MTH-BUFF-9 TO GREG-MM.
033400     MOVE DAY-BUFF-9 TO GREG-DD.
033500     MOVE YR-BUFF-9  TO GREG-YY.
           MOVE SPACES     TO JULIAN-DATE.
           IF GREG-YY > "70"
               MOVE "19"   TO GREG-CC
           ELSE
           MOVE "20"       TO GREG-CC.
033700     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
033800     MOVE 12 TO GREG-MM.
033900     MOVE 31 TO GREG-DD.
034000     SUBTRACT 1 FROM GREG-YY-9.
           MOVE SPACES TO JULIAN-DATE.
034100     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
034200     MOVE JULIAN-DATE-9 TO DAYS-LAST-YEAR.
028900     MOVE SPACES TO ZONE-TABLE.
           MOVE SPACES TO R4-BUFFER.
029100     PERFORM 1-LOAD-OPTIONS THRU 1-LO-EXIT.
           CLOSE R4FILE.
           CALL "MCDLT" USING DELETE-FILE.
031600     SORT SORT-FILE
031700        ASCENDING KEY  ZONE-SORT  CRFT-SORT  SHFT-SORT  PRTY-SORT
031800        INPUT  PROCEDURE 8-INPUT-RECORDS
031900        OUTPUT PROCEDURE 9-WRITE-RECORDS.
032100
032300 2-EOJ.
089000     WRITE PRINTF FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
032900     GOBACK.

035500 1-LOAD-OPTIONS.
           READ R4FILE INTO R4-BUFFER AT END GO TO 1-LO-EXIT.
           IF R4-BUFFER = SPACES GO TO 1-LO-EXIT.
           MOVE R4-DATE-TIME-S TO START-DATE.
           IF STRT-YY > "70"
               MOVE "19" TO STRT-CC
           ELSE
           MOVE "20"     TO STRT-CC.
           READ R4FILE INTO R4-BUFFER AT END GO TO 1-LO-EXIT.
           IF R4-BUFFER = SPACES GO TO 1-LO-EXIT.
           MOVE R4-DATE-TIME-E TO STOP-DATE.
           IF STOP-YY > "70"
               MOVE "19" TO STOP-CC
           ELSE
           MOVE "20"     TO STOP-CC.
           READ R4FILE INTO R4-BUFFER AT END GO TO 1-LO-EXIT.
           MOVE 1 TO S1.
           PERFORM 10-READ-OPTIONS THRU 10-R-O-E.
       1-LO-EXIT.    EXIT.

       10-READ-OPTIONS.
           MOVE R4-BUFFER TO ZT (S1).
           READ R4FILE INTO R4-BUFFER AT END GO TO 10-R-O-E.
           IF R4-BUFFER = SPACES GO TO 10-R-O-E.
           ADD 1 TO S1.
           GO TO 10-READ-OPTIONS.
       10-R-O-E.    EXIT.
033000
041900 8-INPUT-RECORDS.
042000     PERFORM 81-HOUSEKEEPING THRU 81-HOUSEKEEPING-EXIT.
042100     PERFORM 86-MAIN THRU 86-MAIN-EXIT VARYING S1 FROM 1 BY 1
042200         UNTIL S1 > 5.
042500
042700 81-HOUSEKEEPING.
           MOVE 0 TO COND-WORD.
044400     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
044700     MOVE DATE-FLAG-SW TO DATE-FLAG.
044800     MOVE 1 TO DATE-MODE.
044900     MOVE DATE-FLAG TO DATE-CODE.
045000     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
045100     MOVE DATE-SLASH-OUT TO DATE-1-H.
045200 81-HOUSEKEEPING-EXIT.    EXIT.
045400
045600 86-MAIN.
           PERFORM 89-START-WO-BASIC-FILE.
046200     IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
046500     PERFORM 861-DBGET THRU 861-DBGET-EXIT UNTIL COND-WORD = 15.
046600 86-MAIN-EXIT.    EXIT.
046800
047000 861-DBGET.
047100     PERFORM 89-READ-WO-BASIC-FILE.
047300     IF COND-WORD = 15 GO TO 861-DBGET-EXIT.
047900     IF TZONE (1) = SPACES GO TO 861-DBGET-CONT.
048400     PERFORM 8610-LOCATE-ZONE VARYING TABLE-NUM FROM 1 BY 1
              UNTIL (TABLE-NUM > 100) OR
048500           ZONE = TZONE (TABLE-NUM) OR TZONE (TABLE-NUM) = SPACES.
048700     IF TZONE (TABLE-NUM) = SPACES OR TABLE-NUM > 100
048800         GO TO 861-DBGET-EXIT.

049000     IF TEQPNUM (TABLE-NUM, 1) = SPACES
049100         NEXT SENTENCE
049200     ELSE
049300     PERFORM 8610-LOCATE-EQPNUM VARYING TABLE-NUM1 FROM 1 BY 1
              UNTIL (TABLE-NUM1 > 5) OR
049400            (EQUIP-NUM = TEQPNUM (TABLE-NUM, TABLE-NUM1))
049600        IF TABLE-NUM1 > 5
049700         GO TO 861-DBGET-EXIT.
049800
049900     IF TCRAFT (TABLE-NUM, 1) = SPACES
050000         NEXT SENTENCE
050100     ELSE
050200     PERFORM 8610-LOCATE-CRAFT  VARYING TABLE-NUM1 FROM 1 BY 1
              UNTIL (TABLE-NUM1 > 5) OR
050300            (CRAFTS-REQD-1 = TCRAFT (TABLE-NUM, TABLE-NUM1))
050500       IF TABLE-NUM1 > 5
050600         GO TO 861-DBGET-EXIT.
050700
050800 861-DBGET-CONT.
051000     MOVE ZONE TO ZONE-SORT.
051100     MOVE PRIORITY TO PRTY-SORT.
051200     MOVE CRAFTS-REQD-1 TO CRFT-SORT.
051400     PERFORM 8611-CALC-NUMBERS THRU 8611-CN-EXIT.
051500
051600 861-DBGET-EXIT.    EXIT.
052500
       8610-LOCATE-ZONE.

       8610-LOCATE-EQPNUM.

       8610-LOCATE-CRAFT.

052700 8611-CALC-NUMBERS.
052900     MOVE "N" TO RECD-SW STRT-SW COMP-SW
053000                 RECD-NUM STRT-NUM COMP-NUM.
053200     MOVE 0 TO RECD-SORT STRT-SORT COMP-SORT RESP-SORT WORK-SORT.
053400     IF DATE-RECD-CN NUMERIC AND TIME-RECD NUMERIC
053500       MOVE "Y" TO RECD-NUM
053600       STRING DATE-RECD-CN TIME-RECD DELIMITED BY SIZE
                 INTO COMP-DATE
053700       IF (COMP-DATE > START-DATE-CN OR COMP-DATE = START-DATE-CN)
053800        AND
053900          (COMP-DATE < STOP-DATE-CN  OR COMP-DATE = STOP-DATE-CN)
054000         MOVE ZONE TO ZONE-BUF-LINK
054100         MOVE TIME-RECD TO TIME-IN
054200         CALL "TGETSHFT" USING LINK-DATA
054300                               DBPARAMETERS
054500         MOVE CURR-SHIFT TO SHFT-SORT
054600         MOVE 1 TO RECD-SORT
054700         MOVE "Y" TO RECD-SW
054800         RELEASE SORT-REC.
054900
055000     MOVE 0 TO RECD-SORT STRT-SORT COMP-SORT RESP-SORT WORK-SORT.
055100
055200     IF DATE-STRT-CN NUMERIC AND TIME-STRT NUMERIC
055300       MOVE "Y" TO STRT-NUM
055400       STRING DATE-STRT-CN TIME-STRT DELIMITED BY SIZE
                 INTO COMP-DATE
055500       IF (COMP-DATE > START-DATE-CN OR COMP-DATE = START-DATE-CN)
055600        AND
055700          (COMP-DATE < STOP-DATE-CN  OR COMP-DATE = STOP-DATE-CN)
055800         MOVE ZONE TO ZONE-BUF-LINK
055900         MOVE TIME-STRT TO TIME-IN
056000         CALL "TGETSHFT" USING LINK-DATA
056100                               DBPARAMETERS
056300         MOVE CURR-SHIFT TO SHFT-SORT
056400         MOVE 1 TO STRT-SORT
056500         MOVE "Y" TO STRT-SW
056600         RELEASE SORT-REC.
056700
056800     MOVE 0 TO RECD-SORT STRT-SORT COMP-SORT RESP-SORT WORK-SORT.
056900
057000     IF DATE-COMP-CN NUMERIC AND TIME-COMP NUMERIC
057100       MOVE "Y" TO COMP-NUM
057200       STRING DATE-COMP-CN TIME-COMP DELIMITED BY SIZE
                 INTO COMP-DATE
057300       IF (COMP-DATE > START-DATE-CN OR COMP-DATE = START-DATE-CN)
057400        AND
057500          (COMP-DATE < STOP-DATE-CN  OR COMP-DATE = STOP-DATE-CN)
057600         MOVE ZONE TO ZONE-BUF-LINK
057700         MOVE TIME-COMP TO TIME-IN
057800         CALL "TGETSHFT" USING LINK-DATA
057900                               DBPARAMETERS
058100         MOVE CURR-SHIFT TO SHFT-SORT
058200         MOVE 1 TO COMP-SORT
058300         MOVE "Y" TO COMP-SW
058400         RELEASE SORT-REC.
058500
058600     IF RECD-NUM = "Y"
058700         MOVE DATE-RECD-DD      TO GREG-DD
058800         MOVE DATE-RECD-MM      TO GREG-MM
058900         MOVE DATE-RECD-YY      TO GREG-YY
               MOVE SPACES            TO JULIAN-DATE
               IF GREG-YY > "70"
                   MOVE "19"          TO GREG-CC
                   CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG
                   MOVE JULIAN-DATE-9 TO JUL-DAY-RECD
               ELSE
               MOVE "20"              TO GREG-CC
059100         CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                DAY-DIGIT, LEAP-YEAR-FLAG
059200         MOVE JULIAN-DATE-9     TO JUL-DAY-RECD.
059300
059400     IF STRT-NUM = "Y"
059500         MOVE DATE-STRT-DD      TO GREG-DD
059600         MOVE DATE-STRT-MM      TO GREG-MM
059700         MOVE DATE-STRT-YY      TO GREG-YY
               MOVE SPACES            TO JULIAN-DATE
               IF GREG-YY > "70"
                   MOVE "19"          TO GREG-CC
                   CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG
                   MOVE JULIAN-DATE-9 TO JUL-DAY-STRT
               ELSE
               MOVE "20"              TO GREG-CC
059900         CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                DAY-DIGIT, LEAP-YEAR-FLAG
060000         MOVE JULIAN-DATE-9     TO JUL-DAY-STRT.
060100
060200     IF COMP-NUM = "Y"
060300         MOVE DATE-COMP-DD      TO GREG-DD
060400         MOVE DATE-COMP-MM      TO GREG-MM
060500         MOVE DATE-COMP-YY      TO GREG-YY
               MOVE SPACES            TO JULIAN-DATE
               IF GREG-YY > "70"
                   MOVE "19"          TO GREG-CC
                   CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG
                   MOVE JULIAN-DATE-9 TO JUL-DAY-COMP
               ELSE
               MOVE "20"              TO GREG-CC
060700         CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                DAY-DIGIT, LEAP-YEAR-FLAG
060800         MOVE JULIAN-DATE-9     TO JUL-DAY-COMP.
060900
061000     MOVE 0 TO RECD-SORT STRT-SORT COMP-SORT RESP-SORT WORK-SORT.
061100
061200     IF STRT-SW = "Y" AND RECD-NUM = "Y" AND STRT-NUM = "Y"
061300         NEXT SENTENCE
061400     ELSE
061500     GO TO 8611-CONT.
061600
061700     MOVE ZONE TO ZONE-BUF-LINK.
061800     MOVE TIME-STRT TO TIME-IN
061900     CALL "TGETSHFT" USING LINK-DATA
062000                           DBPARAMETERS
062200     MOVE CURR-SHIFT TO SHFT-SORT.
062300
062400     IF JUL-DAY-RECD > JUL-DAY-STRT
062500         MOVE DAYS-LAST-YEAR TO JUL-DAY-SAVE
062600     ELSE
062700     MOVE 0 TO JUL-DAY-SAVE.
062800     IF JUL-DAY-RECD NOT = JUL-DAY-STRT
062900         ADD JUL-DAY-STRT TO JUL-DAY-SAVE
063000         SUBTRACT JUL-DAY-RECD FROM JUL-DAY-SAVE
063100         MULTIPLY 1440 BY JUL-DAY-SAVE.
063200     MULTIPLY 60 BY TIME-RECD-HH GIVING TRECD-MIN.
063300     ADD TIME-RECD-MM TO TRECD-MIN.
063400     MULTIPLY 60 BY TIME-STRT-HH GIVING TSTRT-MIN.
063500     ADD TIME-STRT-MM TO TSTRT-MIN.
063600     SUBTRACT TRECD-MIN FROM TSTRT-MIN GIVING TSAVE-MIN.
063700     ADD JUL-DAY-SAVE TO TSAVE-MIN.
063800     IF TSAVE-MIN > 480 GO TO 8611-CONT.
064000     MOVE TSAVE-MIN TO RESP-SORT.
064100     RELEASE SORT-REC.
064200
064300 8611-CONT.
064500     MOVE 0 TO RECD-SORT STRT-SORT COMP-SORT RESP-SORT WORK-SORT.
064700     IF COMP-SW = "Y" AND STRT-NUM = "Y" AND COMP-NUM = "Y"
064800         NEXT SENTENCE
064900     ELSE
065000     GO TO 8611-CN-EXIT.
065100
065200     MOVE ZONE TO ZONE-BUF-LINK.
065300     MOVE TIME-COMP TO TIME-IN
065400     CALL "TGETSHFT" USING LINK-DATA
065500                           DBPARAMETERS.
065700     MOVE CURR-SHIFT TO SHFT-SORT.
065900     IF JUL-DAY-STRT > JUL-DAY-COMP
066000         MOVE DAYS-LAST-YEAR TO JUL-DAY-SAVE
066100     ELSE
066200     MOVE 0 TO JUL-DAY-SAVE.
066300     IF JUL-DAY-STRT NOT = JUL-DAY-COMP
066400         ADD JUL-DAY-COMP TO JUL-DAY-SAVE
066500         SUBTRACT JUL-DAY-STRT FROM JUL-DAY-SAVE
066600         MULTIPLY 1440 BY JUL-DAY-SAVE.
066700     MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
066800     ADD TIME-COMP-MM TO TCOMP-MIN.
066900     MULTIPLY 60 BY TIME-STRT-HH GIVING TSTRT-MIN.
067000     ADD TIME-STRT-MM TO TSTRT-MIN.
067100     SUBTRACT TSTRT-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
067200     ADD JUL-DAY-SAVE TO TSAVE-MIN.
067300     IF TSAVE-MIN > 480 GO TO 8611-CN-EXIT.
067500     MOVE TSAVE-MIN TO WORK-SORT.
067600     RELEASE SORT-REC.
067700
067800 8611-CN-EXIT.    EXIT.
068000
       89-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WOSTATUS OF WBFREC NOT = STAT (S1) MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       89-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE STAT (S1) TO WOSTATUS OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

068200 9-WRITE-RECORDS.
068300     PERFORM 91-HOUSEKEEPING THRU 91-HOUSEKEEPING-EXIT.
068400     MOVE "N" TO ALL-RECORDS-WRITTEN-SW.
068500     PERFORM 96-MAIN THRU 96-MAIN-EXIT UNTIL
068600             ALL-RECORDS-WRITTEN-SW = "Y".
068900
069100 91-HOUSEKEEPING.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISR4.PUB"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
097800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
097900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
098000         PERFORM 998-BLOWUP.
098100
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
098500
098600     IF NOT PAPER-IS-132-COLS
098700         WRITE PRINTF FROM COMPRESS-PRINT AFTER ADVANCING 0.
070400     RETURN SORT-FILE
070500      AT END
070600      DISPLAY
070700       "NO VERBAL WORK ORDERS WERE COMPLETED IN LAST 24 HRS"
070800       GO TO 2-EOJ.
070900     MOVE "N" TO LAST-RECORD-PRNT-SW.
071000     PERFORM HEAD-LIT.
071100     PERFORM DETL-REC.
071200     PERFORM ZONE-LIT.
071300     PERFORM CRFT-LIT.
071400     PERFORM SHFT-LIT.
071500     PERFORM PRTY-LIT.
071600     PERFORM SAVE-TAG.
071700     PERFORM INTL-SUM.
071800 91-HOUSEKEEPING-EXIT.    EXIT.
072000
072200 96-MAIN.
072400     IF ZONE-SORT NOT = ZONE-TAG
072500         PERFORM PRNT-REC
072600         PERFORM HEAD-LIT
072700         PERFORM DETL-REC
072800         PERFORM ZONE-LIT
072900         PERFORM CRFT-LIT
073000         PERFORM SHFT-LIT
073100         PERFORM PRTY-LIT
073200         PERFORM SAVE-TAG
073300         PERFORM INTL-SUM
073400     ELSE
073500     IF CRFT-SORT NOT = CRFT-TAG
073600         PERFORM PRNT-REC
073700         PERFORM DETL-REC
073800         PERFORM CRFT-LIT
073900         PERFORM SHFT-LIT
074000         PERFORM PRTY-LIT
074100         PERFORM SAVE-TAG
074200         PERFORM INTL-SUM
074300     ELSE
074400     IF SHFT-SORT NOT = SHFT-TAG
074500         PERFORM PRNT-REC
074600         PERFORM DETL-REC
074700         PERFORM SHFT-LIT
074800         PERFORM PRTY-LIT
074900         PERFORM SAVE-TAG
075000         PERFORM INTL-SUM
075100     ELSE
075200     IF PRTY-SORT NOT = PRTY-TAG
075300         PERFORM PRNT-REC
075400         PERFORM DETL-REC
075500         PERFORM PRTY-LIT
075600         PERFORM SAVE-TAG
075700         PERFORM INTL-SUM.
075800
075900     ADD RECD-SORT TO CALLS-RECD.
076000     ADD STRT-SORT TO CALLS-STRT.
076100     ADD COMP-SORT TO CALLS-COMP.
076200     ADD RESP-SORT TO RESP-TOTAL.
076300     ADD WORK-SORT TO WORK-TOTAL.
076400     IF RESP-SORT NOT = 0 ADD 1 TO RESP-CNTR.
076600     IF WORK-SORT NOT = 0 ADD 1 TO WORK-CNTR.
076900     RETURN SORT-FILE
077000        AT END PERFORM AT-END-PAR.
077300     MOVE "N" TO LAST-RECORD-PRNT-SW.
077400
077500 96-MAIN-EXIT.    EXIT.
077700
077900 HEAD-LIT.
078000     MOVE H1 TO PRINTF.
078100     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
078200     MOVE SPACES TO PRINTF.
078300     WRITE PRINTF AFTER ADVANCING 1 LINES.
078400     STRING "START DATE " START-DATE-CN " STOP DATE "
078500         STOP-DATE-CN DELIMITED BY SIZE INTO PRINTF.
078600     WRITE PRINTF AFTER ADVANCING 1 LINES.
078700     MOVE SPACES TO PRINTF.
078800     WRITE PRINTF AFTER ADVANCING 2 LINES.
078900     MOVE H2 TO PRINTF.
079000     WRITE PRINTF AFTER ADVANCING 1 LINES.
079100     MOVE H3 TO PRINTF.
079200     WRITE PRINTF AFTER ADVANCING 1 LINES.
079300     MOVE SPACES TO PRINTF.
079400     WRITE PRINTF AFTER ADVANCING 2 LINES.
079500     MOVE 9 TO WRITE-K.
079600
079800 DETL-REC.
079900     MOVE ZONE-SORT TO ZONE-VALUE.
080000     MOVE CRFT-SORT TO CRFT-VALUE.
080100     MOVE SHFT-SORT TO SHFT-VALUE.
080200     MOVE PRTY-SORT TO PRTY-VALUE.
080300
080500 ZONE-LIT.
080600     IF WRITE-K > 60 PERFORM HEAD-LIT.
080800     MOVE ZONE-LITL TO PRINTF.
080900     WRITE PRINTF AFTER ADVANCING 1 LINES.
081000     ADD 1 TO WRITE-K.
081100
081300 CRFT-LIT.
081400     IF WRITE-K > 60 PERFORM HEAD-LIT.
081600     MOVE CRFT-LITL TO PRINTF.
081700     WRITE PRINTF AFTER ADVANCING 1 LINES.
081800     ADD 1 TO WRITE-K.
081900
082100 SHFT-LIT.
082200     IF WRITE-K > 60 PERFORM HEAD-LIT.
082400     MOVE SHFT-LITL TO PRINTF.
082500     WRITE PRINTF AFTER ADVANCING 1 LINES.
082600     ADD 1 TO WRITE-K.
082700
082900 PRTY-LIT.
083000     IF WRITE-K > 60 PERFORM HEAD-LIT.
083200     MOVE PRTY-LITL TO PRINTF.
083300     WRITE PRINTF AFTER ADVANCING 1 LINES.
083400     ADD 1 TO WRITE-K.
083500
083700 SAVE-TAG.
083800     MOVE ZONE-SORT TO ZONE-TAG.
083900     MOVE CRFT-SORT TO CRFT-TAG.
084000     MOVE SHFT-SORT TO SHFT-TAG.
084100     MOVE PRTY-SORT TO PRTY-TAG.
084200
084400 INTL-SUM.
084500     MOVE 0 TO CALLS-RECD CALLS-STRT   CALLS-COMP CALLS-NOT-STRT
084600               CALLS-NOT-COMP   CALLS-NET-RECD    CALLS-NET-STRT
084700               CALLS-AVG-RESP CALLS-AVG-WORK RESP-CNTR WORK-CNTR
084800               RESP-TOTAL WORK-TOTAL.
084900
085100 PRNT-REC.
085200     COMPUTE CALLS-NOT-STRT = CALLS-RECD - CALLS-STRT.
085300     IF CALLS-NOT-STRT <  0  MOVE 0 TO CALLS-NOT-STRT.
085400     COMPUTE CALLS-NOT-COMP = CALLS-RECD - CALLS-COMP.
085500     IF CALLS-NOT-COMP <  0  MOVE 0 TO CALLS-NOT-COMP.
085600     COMPUTE CALLS-NET-RECD = CALLS-STRT - CALLS-RECD.
085700     COMPUTE CALLS-NET-STRT = CALLS-COMP - CALLS-STRT.
085800     COMPUTE CALLS-AVG-RESP = RESP-TOTAL / RESP-CNTR.
085900     COMPUTE CALLS-AVG-WORK = WORK-TOTAL / WORK-CNTR.
086100     MOVE CALLS-RECD     TO   CALLS-RECD-P.
086200     MOVE CALLS-STRT     TO   CALLS-STRT-P.
086300     MOVE CALLS-COMP     TO   CALLS-COMP-P.
086400     MOVE CALLS-NOT-STRT TO   CALLS-NOT-STRT-P.
086500     MOVE CALLS-NOT-COMP TO   CALLS-NOT-COMP-P.
086600     MOVE CALLS-NET-RECD TO   CALLS-NET-RECD-P.
086700     MOVE CALLS-NET-STRT TO   CALLS-NET-STRT-P.
086800     MOVE CALLS-AVG-RESP TO   CALLS-AVG-RESP-P.
086900     MOVE CALLS-AVG-WORK TO   CALLS-AVG-WORK-P.
087100     IF WRITE-K > 60 PERFORM HEAD-LIT.
087300     WRITE PRINTF FROM DETAIL-PRNT AFTER ADVANCING 1 LINES.
087400     ADD 1 TO WRITE-K.
087500     MOVE "Y" TO LAST-RECORD-PRNT-SW.
087600
087800 AT-END-PAR.
087900     IF LAST-RECORD-PRNT-SW = "Y"
088000         NEXT SENTENCE
088100     ELSE
088200     PERFORM PRNT-REC.
088300     MOVE "Y" TO ALL-RECORDS-WRITTEN-SW.

       COPY OVRPFCALL IN COPYLIB.

177600 998-BLOWUP.
177700     MOVE "TDCRRESP" TO BU-PGM-NAME.
177800     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
177900                      VIEW-COMAREA DUMMY-KSAM-STAT
178000                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

