000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TDELREQS.
000400*REMARKS.    THIS PROGRAM WILL DELETE REQ LINKS IN STORES DATABASE.
      *C
      *C 09/05/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP DATABASE CHANGES.
      *C
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER. AS400.
000800 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDELREQS-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT DREQITM
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DREQDESC
               ASSIGN TO DATABASE-MCFLCS2301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DREQQUE
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT MREQ
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
000900 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100 OF MCFLCS2101.
       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-MCRPCS2200 OF MCFLCS2201.
       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300 OF MCFLCS2301.
       FD  DREQQUE
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC.
           COPY DDS-MCRPCS4400 OF MCFLCS4401.
       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000 OF MCFLCS2001.
001000 WORKING-STORAGE SECTION.
       77  NO-MREQ-SW               PIC X.
001300 01  BLOWUP-BASE              PIC X(16).
       COPY CPYIND   IN COPYLIB.
       COPY CATREAD  IN COPYLIB.
       COPY DATAB    IN COPYLIB.
001400 COPY DREQD    IN COPYLIB.
001500 COPY DREQDESC IN COPYLIB.
001600 COPY DREQITM  IN COPYLIB.
001700 COPY DREQQUE  IN COPYLIB.
       01  DSPLY-STATUS             PIC XX.
002300 01  ERROR-BUFFER.
002400     05  ERR-MSG1.
002500         10  ERR-LIT1         PIC X(11) VALUE SPACES.
002600         10  ERR-REQ          PIC X(12) VALUE SPACES.
002700         10  ERR-LIT2         PIC X(45) VALUE SPACES.
002800     05  ERR-DELAY            PIC X(8)  VALUE SPACES.
       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILLER               PIC X.
003600 01  INPUT-BUFFER.
           05  INPUT-REQ-NUMBER     PIC X(12).
           05  INPUT-COMMAND-LINE   PIC X(79).
           05  INPUT-ERROR-LINE     PIC X(79).
       COPY IOFEEDBACK IN COPYLIB.
003800 COPY LANGSUB    IN COPYLIB.
004400 COPY MREQ IN COPYLIB.
004900 COPY TBLOWUP    IN COPYLIB.
005000 COPY VCOMLINK   IN COPYLIB.
       COPY WSCONTROL  IN COPYLIB.
005200 PROCEDURE DIVISION.
005300 START-PGM.
005400     PERFORM 1-HSK.
005500     PERFORM 6-MAIN THRU 6-MAIN-X UNTIL VIEW-LASTKEY = 3.
005600 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE DREQD.
           CLOSE DREQITM.
           CLOSE DREQDESC.
           CLOSE DREQQUE.
           CLOSE MREQ.
006000     GOBACK.
023200 2-BLOWUP.
023300     MOVE "TDELREQS" TO BU-PGM-NAME.
023400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
023500                      VIEW-COMAREA DUMMY-KSAM-STAT
023600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
006100 1-HSK.
           OPEN I-O DISPLAY-FILE.
011200     OPEN I-O DREQD.
           OPEN I-O DREQITM.
           OPEN I-O DREQDESC.
           OPEN I-O DREQQUE.
           OPEN I-O MREQ.
           MOVE SPACES TO INPUT-REQ-NUMBER.
011300 6-MAIN.
011100     MOVE "FDELREQS" TO VIEW-CFNAME.
           MOVE 06027 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO INPUT-COMMAND-LINE.
           MOVE INPUT-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO INPUT-BUFFER.
012300     IF VIEW-LASTKEY = 3 GO TO 6-MAIN-X.
           MOVE INPUT-REQ-NUMBER TO REQNO OF MREQ-REC.
           MOVE "N" TO NO-MREQ-SW.
           READ MREQ INTO BUF-MREQ.
           IF FILE-STATUS NOT = "00"
               MOVE "Y" TO NO-MREQ-SW.
           PERFORM 60-DELETE-REQ-SEGS THRU 60-DRS-X.
013400     MOVE "REQ NUMBER " TO ERR-LIT1.
013500     MOVE INPUT-REQ-NUMBER TO ERR-REQ.
013600     MOVE " HAS BEEN DELETED" TO ERR-LIT2.
           MOVE ERROR-BUFFER TO INPUT-COMMAND-LINE.
           MOVE B"1" TO INDS (98).
           MOVE INPUT-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE SPACES TO INPUT-REQ-NUMBER.
014100 6-MAIN-X.    EXIT.

       60-DELETE-REQ-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE INPUT-REQ-NUMBER TO REQNO OF DREQD-REC.
           START DREQD KEY = REQNO OF DREQD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
021600     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 60-DELETE-DREQITM
               ELSE
021700         MOVE "START DREQD ERROR *TDELREQS*" TO BU-DISPLAY-MSG
               MOVE INPUT-REQ-NUMBER TO BU-DISPLAY-FLD (2)
021800         GO TO 2-BLOWUP.
021900
022000     PERFORM 600-DELETE-DREQD  THRU  600-DD-X
022100         UNTIL COND-WORD = 15.
022200
       60-DELETE-DREQITM.
           MOVE 0 TO COND-WORD.
           MOVE INPUT-REQ-NUMBER TO REQNO OF DREQITM-REC.
           START DREQITM KEY = REQNO OF DREQITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
022500     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 60-DELETE-DREQDESC
               ELSE
022600         MOVE "START ERROR DREQITM *TDELREQS*" TO BU-DISPLAY-MSG
               MOVE INPUT-REQ-NUMBER TO BU-DISPLAY-FLD (2)
022700         GO TO 2-BLOWUP.
022800
022900     PERFORM 601-DELETE-DREQITM THRU 601-DD-X
023000         UNTIL COND-WORD = 15.
023100
       60-DELETE-DREQDESC.
           MOVE 0 TO COND-WORD.
           MOVE INPUT-REQ-NUMBER TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
023400     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 60-DELETE-DREQQUE
               ELSE
023500         MOVE "START DREQQUE ERROR *TDELREQS*" TO BU-DISPLAY-MSG
               MOVE INPUT-REQ-NUMBER TO BU-DISPLAY-FLD (2)
023600         GO TO 2-BLOWUP.
023700
023800     PERFORM 602-DELETE-DREQDESC  THRU  602-DD-X
023900         UNTIL COND-WORD = 15.
024000
        60-DELETE-DREQQUE.
           MOVE 0 TO COND-WORD.
           MOVE INPUT-REQ-NUMBER TO REQNO OF DREQQUE-REC.
           START DREQQUE KEY = REQNO OF DREQQUE-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
024300     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 60-DELETE-MREQ
               ELSE
024400         MOVE "START DREQQUE ERROR *TDELREQS*" TO BU-DISPLAY-MSG
               MOVE INPUT-REQ-NUMBER TO BU-DISPLAY-FLD (2)
024500         GO TO 2-BLOWUP.
024600
024700     PERFORM 603-DELETE-DREQQUE THRU 603-DD-X
024800         UNTIL COND-WORD = 15.
024900
        60-DELETE-MREQ.
           IF NO-MREQ-SW = "Y"
               NEXT SENTENCE
           ELSE
           MOVE 0 TO COND-WORD
           DELETE MREQ
025200     IF FILE-STATUS NOT = "00"
025300         MOVE "DELETE MREQ ERROR *TDELREQS*" TO BU-DISPLAY-MSG
025400         GO TO 2-BLOWUP.
025600
       60-RESET-ITM-THRU-QUE.
           CLOSE DREQITM.
           CLOSE DREQDESC.
           CLOSE DREQQUE.
           OPEN I-O DREQITM.
           OPEN I-O DREQDESC.
           OPEN I-O DREQQUE.
026600 60-DRS-X.    EXIT.
026700
026800 600-DELETE-DREQD.
           MOVE 0 TO COND-WORD.
           READ DREQD NEXT INTO BUF-DREQD
               AT END    MOVE 15 TO COND-WORD.
026900     IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DREQD-REQ-NUMBER NOT = INPUT-REQ-NUMBER
               MOVE 15 TO COND-WORD.
027100     IF COND-WORD NOT = 0
027200         IF COND-WORD = 15
027300             NEXT SENTENCE
027400         ELSE
027500         MOVE "READ ERROR DREQD *TDELREQS*" TO BU-DISPLAY-MSG
027600             GO TO 2-BLOWUP
027700     ELSE
           DELETE DREQD
028000     IF FILE-STATUS NOT = "00"
028100         MOVE "DELETE DREQD *TDELREQS*" TO BU-DISPLAY-MSG
028200         GO TO 2-BLOWUP.
028300
028400 600-DD-X.    EXIT.
028500
028600 601-DELETE-DREQITM.
           MOVE 0 TO COND-WORD.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQITM-REQ-NUMBER NOT = INPUT-REQ-NUMBER
               MOVE 15 TO COND-WORD.
028900     IF COND-WORD NOT = 0
029000         IF COND-WORD = 15
029100             NEXT SENTENCE
029200         ELSE
029300             MOVE "READ DREQITM *TDELREQS*" TO BU-DISPLAY-MSG
029400             GO TO 2-BLOWUP
029500     ELSE
           DELETE DREQITM
029800     IF FILE-STATUS NOT = "00"
029900         MOVE "DELETE DREQITM *TDELREQS*" TO BU-DISPLAY-MSG
030000         GO TO 2-BLOWUP.
030100 601-DD-X.    EXIT.
030200
030300 602-DELETE-DREQDESC.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQDESC-REQ-NUMBER NOT = INPUT-REQ-NUMBER
               MOVE 15 TO COND-WORD.
030600     IF COND-WORD NOT = 0
030700         IF COND-WORD = 15
030800             NEXT SENTENCE
030900         ELSE
031000             MOVE "READ DREQDESC *TDELREQS*" TO BU-DISPLAY-MSG
031100             GO TO 2-BLOWUP
031200     ELSE
           DELETE DREQDESC
031500     IF FILE-STATUS NOT = "00"
031600         MOVE "DELETE DREQDESC *TDELREQS*" TO BU-DISPLAY-MSG
031700         GO TO 2-BLOWUP.
031800 602-DD-X.    EXIT.
031900
032000 603-DELETE-DREQQUE.
           MOVE 0 TO COND-WORD.
           READ DREQQUE NEXT INTO BUF-DREQQUE
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DRQQ-REQ-NUMBER NOT = INPUT-REQ-NUMBER
               MOVE 15 TO COND-WORD.
032300     IF COND-WORD NOT = 0
032400         IF COND-WORD = 15
032500             NEXT SENTENCE
032600         ELSE
032700             MOVE "READ DREQQUE *TDELREQS*" TO BU-DISPLAY-MSG
032800             GO TO 2-BLOWUP
032900     ELSE
           DELETE DREQQUE
033200     IF FILE-STATUS NOT = "00"
033300         MOVE "DELETE DREQQUE *TDELREQS*" TO BU-DISPLAY-MSG
033400         GO TO 2-BLOWUP.
033500 603-DD-X.    EXIT.

014200
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
