       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TDELTMFR.
      *AUTHOR.         DAVE PLUM.
      *DATE-WRITTEN.   MARCH 1997.
      *REMARKS.
      ****************************************************************
      *D  TDELTMFR - MANUFACTURER NAME CLEAN UP PROGRAM
      *
      *   THIS PROGRAM DELETES THOSE MANUFACTURER NAMES WHICH EXIST
      *   IN THE VALID MANUFACTURER NAME FILE (MMANUFACT - MCFPCS3500),
      *   THAT DO NOT EXIST IN THE CODE-MANUFACTURER-PART FILE
      *   (DMANPART - MCFPCS3600).  IN OTHER WORDS, WE ARE DELETING
      *   THOSE MANUFACTURER NAMES WHICH ARE ASSOCIATED WITH EXACTLY
      *   ZERO STOREROOM CODES.
      *
      *   THIS PROGRAM WILL BE ESPECIALLY HELPFUL TO THOSE PLANTS
      *   WHICH DO NOT USE THE CP1 LOCAL CODING FUNCTION TO CONTROL
      *   THEIR SET OF "VALID MANUFACTURER NAMES".  THESE PLANTS
      *   OBTAIN ALL OF THEIR STOREROOM CODES AND DESCRIPTIONS FROM
      *   THE MAINFRAME PAW00000 APPLICATION.  THIS PROGRAM WILL
      *   ALLOW THESE PLANTS TO LIMIT THEIR SET OF VALID
      *   MANUFACTURER NAMES TO THOSE THAT ARE ACTUALLY IN USE.
      ****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS400.
       OBJECT-COMPUTER.  AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MMANUFACT-O
                  ASSIGN TO DATABASE-MCFLCS3501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-M-I
                  ASSIGN TO DATABASE-MCFLCS3601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MMANUFACT-O
           LABEL RECORDS ARE STANDARD.
       01  MMANUFACT-REC-O.
           COPY DDS-MCRPCS3500  OF MCFLCS3501.

       FD  DMANPART-M-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-M-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3601.

       WORKING-STORAGE SECTION.
       77  MCXCBLERR-SCOPE             PIC X(1)         VALUE "C".
       77  EOF-MMANUFACT               PIC X(1)         VALUE "N".
       77  COUNT-MMANUFACT             PIC S9(9)        VALUE +0.
       77  COUNT-DELETES               PIC S9(9)        VALUE +0.
       77  DISPLAY-COUNT               PIC ZZZ,ZZZ,ZZ9.

       01  CURRENT-DATE.
           05  CURRENT-CC              PIC X(2)  VALUE SPACES.
           05  CURRENT-YYMMDD.
               10  CURRENT-YY          PIC X(2)  VALUE SPACES.
               10  CURRENT-MM          PIC X(2)  VALUE SPACES.
               10  CURRENT-DD          PIC X(2)  VALUE SPACES.

       01  CURRENT-TIME.
           05  CURRENT-HOUR            PIC X(2)  VALUE SPACES.
           05  CURRENT-MIN             PIC X(2)  VALUE SPACES.
           05  CURRENT-SEC             PIC X(2)  VALUE SPACES.

       01  DISPLAY-DATE.
           05  DISPLAY-CC              PIC X(2)  VALUE SPACES.
           05  DISPLAY-YY              PIC X(2)  VALUE SPACES.
           05     FILLER               PIC X(1)  VALUE "/".
           05  DISPLAY-MM              PIC X(2)  VALUE SPACES.
           05     FILLER               PIC X(1)  VALUE "/".
           05  DISPLAY-DD              PIC X(2)  VALUE SPACES.

       01  DISPLAY-TIME.
           05  DISPLAY-HOUR            PIC X(2)  VALUE SPACES.
           05     FILLER               PIC X(1)  VALUE ":".
           05  DISPLAY-MIN             PIC X(2)  VALUE SPACES.
           05     FILLER               PIC X(1)  VALUE ":".
           05  DISPLAY-SEC             PIC X(2)  VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X(1)  VALUE "0".
           05  FILE-STATUS-2           PIC X(1)  VALUE "0".

       COPY MMANUFAC  OF COPYLIB.

       COPY DATAB     OF COPYLIB.

       COPY TBLOWUP   OF COPYLIB.

       PROCEDURE DIVISION.
       0-MAINLINE.
           PERFORM 1-HSK.
           PERFORM 6-MAIN
              UNTIL EOF-MMANUFACT = "Y".
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           DISPLAY "--- BEGIN PROGRAM ---".
           PERFORM 11-GET-DISPLAY-DATE-TIME.
           DISPLAY " ".

           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           MOVE +0  TO  DISPLAY-COUNT.

           OPEN I-O   MMANUFACT-O.
           OPEN INPUT DMANPART-M-I.

      *------ PREPARE TO READ THE FIRST RECORD FROM MMANUFACT
           MOVE LOW-VALUES TO MANUFACT OF MMANUFACT-REC-O.
           START MMANUFACT-O KEY >= MANUFACT OF MMANUFACT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START OF MMANUFACT FAILED" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

      *------ READ THE FIRST RECORD FROM MMANUFACT
           PERFORM 3-READ-MMANUFACT.
           IF EOF-MMANUFACT = "Y"
               DISPLAY "FIRST READ OF MMANUFACT OF RESULTED IN "
               DISPLAY "END OF FILE.  NO DATA TO PROCESS.".

       11-GET-DISPLAY-DATE-TIME.
           ACCEPT CURRENT-YYMMDD FROM DATE.
           IF CURRENT-YY > "70"
               MOVE "19" TO CURRENT-CC
           ELSE
               MOVE "20" TO CURRENT-CC.

           ACCEPT CURRENT-TIME FROM TIME.

           MOVE CURRENT-CC    TO  DISPLAY-CC.
           MOVE CURRENT-YY    TO  DISPLAY-YY.
           MOVE CURRENT-MM    TO  DISPLAY-MM.
           MOVE CURRENT-DD    TO  DISPLAY-DD.

           MOVE CURRENT-HOUR  TO  DISPLAY-HOUR.
           MOVE CURRENT-MIN   TO  DISPLAY-MIN.
           MOVE CURRENT-SEC   TO  DISPLAY-SEC.

           DISPLAY "DATE: ", DISPLAY-DATE, " TIME: ", DISPLAY-TIME.

       2-BLOWUP.
           MOVE "TDELTMFR"  TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

       2-EOJ.
           CLOSE MMANUFACT-O, DMANPART-M-I.

           DISPLAY " ".
           MOVE COUNT-MMANUFACT  TO  DISPLAY-COUNT.
           DISPLAY "MMANUFACT RECORDS READ    = ", DISPLAY-COUNT.
           MOVE COUNT-DELETES    TO  DISPLAY-COUNT.
           DISPLAY "MMANUFACT RECORDS DELETED = ", DISPLAY-COUNT.

           DISPLAY " ".
           DISPLAY "--- END OF PGM ---".
           PERFORM 11-GET-DISPLAY-DATE-TIME.

       3-READ-MMANUFACT.
           READ MMANUFACT-O NEXT INTO BUF-MMANUFACT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               ADD +1 TO COUNT-MMANUFACT
           ELSE
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "Y" TO EOF-MMANUFACT
               ELSE
                   MOVE "READ MMANUFACT ERROR * 3-R-M"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       3-READ-DMANPART.
           MOVE MANUFACT-MAN-NAME TO MANUFACT OF DMANPART-M-REC-I.
           START DMANPART-M-I KEY = MANUFACT OF DMANPART-M-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DMANPART ERROR * 3-R-D"
                       TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       6-MAIN.
           PERFORM 3-READ-DMANPART.
           IF FILE-STATUS-1 = "2"
               PERFORM 61-DELETE-MMANUFACT.

           PERFORM 3-READ-MMANUFACT.

       61-DELETE-MMANUFACT.
           ADD +1 TO COUNT-DELETES.
           DISPLAY "DELETING MFR: ", MANUFACT-MAN-NAME.
           DELETE MMANUFACT-O
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE MMANUFACT ERROR * 61-D-M"
                  TO BU-DISPLAY-MSG
               MOVE MANUFACT-MAN-NAME TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
