000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TDELMMIS.
000400 ENVIRONMENT DIVISION.
      *C
      *C 09/05/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP DATABASE CHANGES.
      *C
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-NUMBER
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-BASIC
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED-2
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PARTS
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-LABOR
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-SCHEDULE
               ASSIGN TO DATABASE-MCFLMM4404
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT LABOR-CURR-STAT
               ASSIGN TO DATABASE-MCFLMM1602
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT JOBPLAN
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-OPEN-QUEUE
               ASSIGN TO DATABASE-MCFLMM1902
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-SCHEDULE
               ASSIGN TO DATABASE-MCFLMM2302
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-MESSAGE
               ASSIGN TO DATABASE-MCFLMM2403
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-TRACKING
               ASSIGN TO DATABASE-MCFLMM2601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-OPEN-QUEUE
               ASSIGN TO DATABASE-MCFLMM3901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

000500 DATA DIVISION.
       FILE SECTION.
       FD  WO-NUMBER
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.

       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  REC10.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  REC1101.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-PLANNED-2
           LABEL RECORDS ARE STANDARD.
       01  REC1101-2.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-PARTS
           LABEL RECORDS ARE STANDARD.
       01  REC12.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       FD  WO-LABOR
           LABEL RECORDS ARE STANDARD.
       01  REC13.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  PM-SCHEDULE
           LABEL RECORDS ARE STANDARD.
       01  REC14.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  LABOR-CURR-STAT
           LABEL RECORDS ARE STANDARD.
       01  REC16.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  JOBPLAN
           LABEL RECORDS ARE STANDARD.
       01  REC18.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.

       FD  WO-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  REC19.
           COPY DDS-ALL-FORMATS OF MCFLMM1902.

       FD  WO-SCHEDULE
           LABEL RECORDS ARE STANDARD.
       01  REC23.
           COPY DDS-ALL-FORMATS OF MCFLMM2302.

       FD  WO-MESSAGE
           LABEL RECORDS ARE STANDARD.
       01  REC24.
           COPY DDS-ALL-FORMATS OF MCFLMM2403.

       FD  WO-TRACKING
           LABEL RECORDS ARE STANDARD.
       01  REC26.
           COPY DDS-ALL-FORMATS OF MCFLMM2601.

       FD  PM-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  REC39.
           COPY DDS-ALL-FORMATS OF MCFLMM3901.

000600 WORKING-STORAGE SECTION.
000700 77  DEL-CSTAT-SW                PIC X VALUE "N".
000800 77  DEL-LABOR-SW                PIC X VALUE "N".
000900 77  DEL-MESSAGE-SW              PIC X VALUE "N".
001000 77  DEL-OPENQ-SW                PIC X VALUE "N".
001100 77  DEL-PARTS-SW                PIC X VALUE "N".
001200 77  DEL-SCHEDULE-SW             PIC X VALUE "N".
001300 77  DEL-TRACKING-SW             PIC X VALUE "N".
       77  DEL-RECS-CTR                PIC 9(5).
001400 77  JOB-CMP-SEQ                 PIC 999.
001500 77  NO-DEL-SW                   PIC X.
001600 77  SUB1                        PIC 9(4).
001700 01  ARG-VALUE.
001800     05  FILLER                  PIC X(6).
001900     05  ARG7                    PIC X.
002000     05  FILLER                  PIC XXX.
       01  DELETE-WONUM                PIC X(10).
       01  FILE-STATUS                 PIC XX.
010100 01  JOBPLAN-BUFFER.            COPY DJOBPLAN IN COPYLIB.
010200 01  JOBPLAN-KEY.
010300     05  JOBP-WO-NO              PIC X(10).
010400     05  JOBP-SEQ-NO             PIC 999.
010500     05  FILLER                  PIC X.
       01  JOBP-WONUM                  PIC X(10).
       01  MASTER-SW                   PIC X.
       01  TEMP-WONUM.
           05 TEMP-NUMBER              PIC X(7).
           05 TEMP-SUFFIX              PIC X(3).
010600 01  WO-MESSAGE-DATA.           COPY DWOMSG   IN COPYLIB.
010700 01  WO-OPEN-QUEUE-DATA.        COPY DWOOPENQ IN COPYLIB.
010800 01  WO-PLANNED-DATA.           COPY DWOPLAN  IN COPYLIB.
010900 01  WO-SCHEDULE-DATA.          COPY DWOSCHED IN COPYLIB.
011000 01  WO-TRACKING-DATA.          COPY DWOTRACK IN COPYLIB.
011100 LINKAGE SECTION.
011200 01  DBPARAMETERS.              COPY DBPARMS  IN COPYLIB.
011300 COPY DBSTAT  IN COPYLIB.
011400 01  TABLE-WO-NUMS.
011500     02  T-WO-NUMS OCCURS 2500 TIMES.
011600         03  T-WO                PIC X(10).
011700 PROCEDURE DIVISION USING DBPARAMETERS STATUS-AREA
011800                      TABLE-WO-NUMS.
011900 BEGIN-DELETE.
012000     PERFORM 1-HSK.
012100     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
012200 2-EOJ.
           IF ENG-PL-SCHD-ID = "OLDW"
               MOVE DEL-RECS-CTR TO DBPARM-PAD2.
           CLOSE JOBPLAN.
           CLOSE WO-PARTS.
           CLOSE WO-LABOR.
           CLOSE PM-SCHEDULE.
           CLOSE LABOR-CURR-STAT.
           CLOSE WO-OPEN-QUEUE.
           CLOSE WO-MESSAGE.
           CLOSE WO-SCHEDULE.
           CLOSE WO-TRACKING.
           CLOSE WO-BASIC.
           CLOSE WO-PLANNED.
           CLOSE WO-PLANNED-2.
           CLOSE PM-OPEN-QUEUE.
           CLOSE WO-NUMBER.
012300     GOBACK.
012400 1-HSK.
012500     MOVE 0 TO SUB1.
           OPEN INPUT WO-PLANNED-2.
           OPEN I-O JOBPLAN.
           OPEN I-O WO-PARTS.
           OPEN I-O WO-LABOR.
           OPEN I-O PM-SCHEDULE.
           OPEN I-O LABOR-CURR-STAT.
           OPEN I-O WO-OPEN-QUEUE.
           OPEN I-O WO-MESSAGE.
           OPEN I-O WO-SCHEDULE.
           OPEN I-O WO-TRACKING.
           OPEN I-O WO-BASIC.
           OPEN I-O WO-PLANNED.
           OPEN I-O PM-OPEN-QUEUE.
           OPEN I-O WO-NUMBER.
           MOVE 0 TO DEL-RECS-CTR.
014300 6-MAIN.
014400     ADD 1 TO SUB1.
014500     IF SUB1 GREATER THAN 2500 OR T-WO (SUB1) = SPACES
014600         GO TO 6-MAIN-EXIT.
           MOVE T-WO (SUB1) TO DELETE-WONUM.
           MOVE DELETE-WONUM TO WONUM OF REC10.
           START WO-BASIC
               KEY IS = WONUM OF REC10.
           IF FILE-STATUS = "00"
               PERFORM DELETE-VERBAL THRU DELETE-VERBAL-EXIT
           ELSE
           MOVE DELETE-WONUM TO WONUM OF REC1101
           START WO-PLANNED
               KEY IS = WONUM OF REC1101
           IF FILE-STATUS = "00"
               PERFORM DELETE-PLNNED THRU DELETE-PLNNED-EXIT
           ELSE
           PERFORM DELETE-WO-NUMBER
           PERFORM DELETE-WO-PARTS
           PERFORM DELETE-WO-LABOR
           PERFORM DELETE-LABOR-CURR-STAT
           PERFORM DELETE-PM-SCHEDULE
           PERFORM DELETE-JOBPLAN
           PERFORM DELETE-WO-OPEN-QUEUE
           PERFORM DELETE-WO-SCHEDULE
           PERFORM DELETE-WO-MESSAGE
           PERFORM DELETE-WO-TRACKING
           PERFORM DELETE-PM-OPEN-QUEUE.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       DELETE-VERBAL.
           READ WO-BASIC NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-VERBAL-EXIT.
           PERFORM DELETE-WO-NUMBER.
           PERFORM DELETE-WO-PARTS.
           PERFORM DELETE-WO-LABOR.
           PERFORM DELETE-LABOR-CURR-STAT.
           PERFORM DELETE-WO-OPEN-QUEUE.
           PERFORM DELETE-WO-MESSAGE.
           PERFORM DELETE-WO-TRACKING.
           DELETE WO-BASIC RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING W/O = " DELETE-WONUM
               GO TO 2-EOJ.
           ADD 1 TO DEL-RECS-CTR.
       DELETE-VERBAL-EXIT.
           EXIT.

       DELETE-PLNNED.
           READ WO-PLANNED NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-PLNNED-EXIT.
           IF SAVEHISTSW OF REC1101 NOT = "  "
               GO TO DELETE-PLNNED-EXIT.
           IF ENG-PL-SCHD-ID = "OLDW"
               IF WOSTATUS OF REC1101 = "FF" OR "DW"
                   NEXT SENTENCE
               ELSE
               GO TO DELETE-PLNNED-EXIT.
           PERFORM CHECK-MASTER THRU CHECK-MASTER-EXIT.
           IF MASTER-SW = "Y"
               GO TO DELETE-PLNNED-EXIT.
           PERFORM DELETE-WO-NUMBER.
           PERFORM DELETE-WO-PARTS.
           PERFORM DELETE-WO-LABOR.
           PERFORM DELETE-LABOR-CURR-STAT.
           PERFORM DELETE-PM-SCHEDULE.
           PERFORM DELETE-JOBPLAN.
           PERFORM DELETE-WO-OPEN-QUEUE.
           PERFORM DELETE-WO-SCHEDULE.
           PERFORM DELETE-WO-MESSAGE.
           PERFORM DELETE-WO-TRACKING.
           PERFORM DELETE-PM-OPEN-QUEUE.
           DELETE WO-PLANNED RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING W/O = " DELETE-WONUM
               GO TO 2-EOJ.
           ADD 1 TO DEL-RECS-CTR.
       DELETE-PLNNED-EXIT.
           EXIT.

       CHECK-MASTER.
           MOVE "N" TO MASTER-SW.
           MOVE WONUM OF REC1101 TO TEMP-WONUM.
           IF TEMP-SUFFIX NUMERIC
               IF TEMP-SUFFIX > "000"
                   NEXT SENTENCE
               ELSE
               GO TO CHECK-MASTER-EXIT
           ELSE
           GO TO CHECK-MASTER-EXIT.

           MOVE WONUM OF REC1101 TO WONUM OF REC1101-2.
           READ WO-PLANNED-2
           IF FILE-STATUS NOT = "00"
               GO TO CHECK-MASTER-EXIT.

           IF WOSTATUS OF REC1101-2 NOT = "FF"
               MOVE "Y" TO MASTER-SW.

       CHECK-MASTER-EXIT.
           EXIT.

       DELETE-WO-NUMBER.
           MOVE DELETE-WONUM TO WONUM OF REC1.
           START WO-NUMBER
               KEY IS = WONUM OF REC1.
           IF FILE-STATUS = "00"
               READ WO-NUMBER NEXT RECORD
               IF FILE-STATUS = "00"
                   DELETE WO-NUMBER RECORD.

       DELETE-WO-PARTS.
           MOVE DELETE-WONUM TO WONUM OF REC12.
           START WO-PARTS
               KEY IS = WONUM OF REC12.
           IF FILE-STATUS = "00"
               PERFORM DELETE-WO-PARTS-C THRU DELETE-WO-PARTS-C-E.

       DELETE-WO-PARTS-C.
           READ WO-PARTS NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-PARTS-C-E.

           IF WONUM OF REC12 NOT = DELETE-WONUM
               REWRITE REC12
               GO TO DELETE-WO-PARTS-C-E.

           DELETE WO-PARTS RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING W/O PARTS FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-PARTS-C.
       DELETE-WO-PARTS-C-E.
           EXIT.

       DELETE-WO-LABOR.
           MOVE DELETE-WONUM TO WONUM OF REC13.
           START WO-LABOR
              KEY IS = WONUM OF REC13.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-LABOR-C THRU DELETE-WO-LABOR-C-E.

       DELETE-WO-LABOR-C.
           READ WO-LABOR NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-LABOR-C-E.

           IF WONUM OF REC13 NOT = DELETE-WONUM
               REWRITE REC13
               GO TO DELETE-WO-LABOR-C-E.

           DELETE WO-LABOR RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING LABOR FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-LABOR-C.
       DELETE-WO-LABOR-C-E.
           EXIT.

       DELETE-PM-SCHEDULE.
           MOVE DELETE-WONUM TO WONUM OF REC14.
           START PM-SCHEDULE
               KEY IS = WONUM OF REC14.
           IF FILE-STATUS = "00"
               PERFORM DELETE-SCHEDULE-C THRU DELETE-SCHEDULE-C-E.

       DELETE-SCHEDULE-C.
           READ PM-SCHEDULE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-SCHEDULE-C-E.

           IF WONUM OF REC14 NOT = DELETE-WONUM
               REWRITE REC14
               GO TO DELETE-SCHEDULE-C-E.

           DELETE PM-SCHEDULE RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING PM-SCHED FOR W/O " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-SCHEDULE-C.
       DELETE-SCHEDULE-C-E.
           EXIT.

       DELETE-LABOR-CURR-STAT.
           MOVE DELETE-WONUM TO WONUM OF REC16.
           START LABOR-CURR-STAT
               KEY IS = WONUM OF REC16.
           IF FILE-STATUS = "00"
               PERFORM DELETE-LCS-C THRU DELETE-LCS-C-E.

       DELETE-LCS-C.
           READ LABOR-CURR-STAT NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-LCS-C-E.

           IF WONUM OF REC16 NOT = DELETE-WONUM
               REWRITE REC16
               GO TO DELETE-LCS-C-E.

           DELETE LABOR-CURR-STAT RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING CURR LABOR FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-LCS-C.
       DELETE-LCS-C-E.
           EXIT.

       DELETE-JOBPLAN.
           MOVE DELETE-WONUM TO JOBPWOSEQ.
           START JOBPLAN
               KEY IS NOT LESS THAN JOBPWOSEQ.
           IF FILE-STATUS = "00"
               PERFORM DELETE-JOBPLAN-C THRU DELETE-JOBPLAN-C-E.

       DELETE-JOBPLAN-C.
           READ JOBPLAN NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-JOBPLAN-C-E.

           MOVE JOBPWOSEQ TO JOBP-WONUM.
           IF JOBP-WONUM NOT = DELETE-WONUM
               REWRITE REC18
               GO TO DELETE-JOBPLAN-C-E.

           DELETE JOBPLAN RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING JOBPLAN FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-JOBPLAN-C.
       DELETE-JOBPLAN-C-E.
           EXIT.

       DELETE-WO-OPEN-QUEUE.
           MOVE DELETE-WONUM TO WONUM OF REC19.
           START WO-OPEN-QUEUE
               KEY IS = WONUM OF REC19.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-OPEN-Q-C THRU DELETE-WO-OPEN-Q-C-E.

       DELETE-WO-OPEN-Q-C.
           READ WO-OPEN-QUEUE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-OPEN-Q-C-E.

           IF WONUM OF REC19 NOT = DELETE-WONUM
               REWRITE REC19
               GO TO DELETE-WO-OPEN-Q-C-E.

           DELETE WO-OPEN-QUEUE RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING WO-OPEN-QUEUE FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-OPEN-Q-C.
       DELETE-WO-OPEN-Q-C-E.
           EXIT.

       DELETE-WO-SCHEDULE.
           MOVE DELETE-WONUM TO WONUM OF REC23.
           START WO-SCHEDULE
               KEY IS = WONUM OF REC23.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-SCHEDULE-C THRU DELETE-WO-SCHEDULE-C-E.

       DELETE-WO-SCHEDULE-C.
           READ WO-SCHEDULE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-SCHEDULE-C-E.

           IF WONUM OF REC23 NOT = DELETE-WONUM
               REWRITE REC23
               GO TO DELETE-WO-SCHEDULE-C-E.

           DELETE WO-SCHEDULE RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING WO-SCHEDULES FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-SCHEDULE-C.
       DELETE-WO-SCHEDULE-C-E.
           EXIT.

       DELETE-WO-MESSAGE.
           MOVE DELETE-WONUM TO TOWO OF REC24.
           START WO-MESSAGE
               KEY IS = TOWO OF REC24.
           IF FILE-STATUS = "00"
               PERFORM DELETE-WO-MESSAGE-C THRU DELETE-WO-MESSAGE-C-E.

       DELETE-WO-MESSAGE-C.
           READ WO-MESSAGE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-WO-MESSAGE-C-E.

           IF TOWO OF REC24 NOT = DELETE-WONUM
             REWRITE REC24
             GO TO DELETE-WO-MESSAGE-C-E.

           DELETE WO-MESSAGE RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING WO-MESSAGE FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-MESSAGE-C.
       DELETE-WO-MESSAGE-C-E.
           EXIT.

       DELETE-WO-TRACKING.
           MOVE DELETE-WONUM TO WONUM OF REC26.
           START WO-TRACKING
            KEY IS = WONUM OF REC26.
           IF FILE-STATUS = "00"
             PERFORM DELETE-WO-TRACKING-C THRU DELETE-WO-TRACKING-C-E.

       DELETE-WO-TRACKING-C.
           READ WO-TRACKING NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-WO-TRACKING-C-E.

           IF WONUM OF REC26 NOT = DELETE-WONUM
             REWRITE REC26
             GO TO DELETE-WO-TRACKING-C-E.

           DELETE WO-TRACKING RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING WO-TRACKING FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-TRACKING-C.
       DELETE-WO-TRACKING-C-E.
           EXIT.

       DELETE-PM-OPEN-QUEUE.
           MOVE DELETE-WONUM TO WONUM OF REC39.
           START PM-OPEN-QUEUE
            KEY IS = WONUM OF REC39.
           IF FILE-STATUS = "00"
             PERFORM DELETE-PM-OPEN-QUE-C THRU DELETE-PM-OPEN-QUE-C-E.

       DELETE-PM-OPEN-QUE-C.
           READ PM-OPEN-QUEUE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-PM-OPEN-QUE-C-E.

           IF WONUM OF REC39 NOT = DELETE-WONUM
             REWRITE REC39
             GO TO DELETE-WO-TRACKING-C-E.

           DELETE PM-OPEN-QUEUE RECORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR DELETING PM-OPEN-QUEUE FOR " DELETE-WONUM
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-PM-OPEN-QUE-C.
       DELETE-PM-OPEN-QUE-C-E.
           EXIT.
