000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TDETCODE.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        AUGUST 25, 1984.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.  THIS SUBPROGRAM DETERMINES THE ALTERNATE CODE OF
001000*          A RAW MATERIAL FABRIC BASED ON THE 2CD LINE OF
001100*          DESCRIPTION.  FOR EXAMPLE, IF "GOODYEAR BASE CODE
001200*          AD334 NYLON" WAS PASSED, "AD334" WOULD BE RETURNED.
001300*
001400*
001500*    PARAMETERS:
001600*
001700*    RET-CODE         -  "00" IS RETURNED IF THE CODE NUMBER
001800*                        WAS FOUND, "NF" IF NOT FOUND.
001900*
002000*    DESC-DATA        -  THE 2CD LINE OF THE RAW MATERIAL FABRIC
002100*                        DESCRIPTION IS PASSED HERE.
002200*
002300*    FABRIC-CODE      -  THE FABRIC CODE IS RETURNED HERE.
002400*
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.  HP-3000.
002800 OBJECT-COMPUTER.  HP-3000.
002900
003000 DATA DIVISION.
003100 WORKING-STORAGE SECTION.
003200
003300 77  SUB                                  PIC S9(4) BINARY VALUE 0.
003400 77  SUB2                                 PIC S9(4) BINARY VALUE 0.
003500
003600 01  CODE-WORK-AREA.
003700     05  CODE-BYTE OCCURS 66 TIMES        PIC X(1).
003800
003900 01  FABRIC-CODE-AREA.
004000     05  FABRIC-CODE-BYTE OCCURS 66 TIMES PIC X(1).
004100
004200**************************************************************
004300**                                                          **
004400**            L I N K A G E   S E C T I O N                 **
004500**                                                          **
004600**************************************************************
004700
004800 LINKAGE SECTION.
004900 01  RET-CODE                  PIC X(2).
005000
005100 01  DESC-DATA                  PIC X(80).
005200 01  DESC-LAYOUT-1 REDEFINES DESC-DATA.
005300     05  TEST-AREA-1            PIC X(9).
005400     05  CODE-AREA-1            PIC X(71).
005500 01  DESC-LAYOUT-2 REDEFINES DESC-DATA.
005600     05  TEST-AREA-2            PIC X(19).
005700     05  CODE-AREA-2            PIC X(61).
005800 01  DESC-LAYOUT-3 REDEFINES DESC-DATA.
005900     05  TEST-AREA-3            PIC X(14).
006000     05  CODE-AREA-3            PIC X(66).
006100
006200 01  FABRIC-CODE                PIC X(40).
006300
006400 PROCEDURE DIVISION USING RET-CODE,
                                DESC-DATA,
                                FABRIC-CODE.
006500 6000-MAIN.
006600     MOVE "00" TO RET-CODE.
006700     MOVE SPACES  TO  FABRIC-CODE.
006800     MOVE SPACES  TO  FABRIC-CODE-AREA, CODE-WORK-AREA.
006900
007000 6100-FIND-CODE-AREA.
007100     IF TEST-AREA-2 = "GOODYEAR BASE CODE "
007200         MOVE CODE-AREA-2  TO  CODE-WORK-AREA
007300     ELSE
007400     IF TEST-AREA-3 = "GOODYEAR CODE "
007500         MOVE CODE-AREA-3  TO  CODE-WORK-AREA
007600     ELSE
007700     IF TEST-AREA-1 = "GOODYEAR "
007800         MOVE CODE-AREA-1  TO  CODE-WORK-AREA
007900     ELSE
008000     IF TEST-AREA-3 = "SPECIAL PAPER "
008100         MOVE CODE-AREA-3  TO  CODE-WORK-AREA
008200     ELSE
008300     IF DESC-DATA = "54 IN  GRADE .009  CHIP ON CHIP"
008400         MOVE "CHIP 600"   TO  FABRIC-CODE
008500         GO TO 6990-MAIN-X
008600     ELSE
008700     IF DESC-DATA = "BURLAP MATERIAL  40 IN WIDTH"
008800         MOVE "BURLAP 586" TO  FABRIC-CODE
008900         GO TO 6990-MAIN-X
009000     ELSE
009100         MOVE "NF"         TO  RET-CODE
009200         GO TO 6990-MAIN-X.
009300
009400 6200-DETERMINE-CODE.
009500     MOVE 0                        TO   SUB, SUB2.
009600     MOVE SPACES                   TO     FABRIC-CODE-AREA.
009700 6210-DETERMINE-CODE-LOOP.
009800
009900     ADD 1 TO SUB.
010000     IF SUB > 66
010100         MOVE FABRIC-CODE-AREA TO FABRIC-CODE
010200         GO TO 6990-MAIN-X.
010300
010400     IF CODE-BYTE (SUB) = " "
010500         GO TO 6210-DETERMINE-CODE-LOOP.
010600
010700     ADD 1                         TO   SUB2.
010800     MOVE CODE-BYTE (SUB) TO FABRIC-CODE-BYTE (SUB2).
010900
011000     GO TO 6210-DETERMINE-CODE-LOOP.
011100
011200 6990-MAIN-X.
011300     GOBACK.
