       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDFDISP.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDRAWING-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT DRAWING-FILE-NUM
                  ASSIGN       TO DATABASE-MCFLDF0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-CODE
                  ASSIGN       TO DATABASE-MCFLDF0102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-EQP
                  ASSIGN       TO DATABASE-MCFLDF0103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-TYPE
                  ASSIGN       TO DATABASE-MCFLDF0104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN       TO DATABASE-OUTDRWFI
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS OUT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  DRAWING-FILE-NUM
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS DFREC-NUM.
       01  DFREC-NUM.
           COPY DDS-ALL-FORMATS OF MCFLDF0101.

       FD  DRAWING-FILE-CODE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS DFREC-CODE.
       01  DFREC-CODE.
           COPY DDS-ALL-FORMATS OF MCFLDF0102.

       FD  DRAWING-FILE-EQP
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS DFREC-EQP.
       01  DFREC-EQP.
           COPY DDS-ALL-FORMATS OF MCFLDF0103.

       FD  DRAWING-FILE-TYPE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS DFREC-TYPE.
       01  DFREC-TYPE.
           COPY DDS-ALL-FORMATS OF MCFLDF0104.

       FD  OUT-FILE RECORD     CONTAINS 146 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-KEY                         PIC 9(4).
           05  OUT-DATA.
               10  DRAWING-NUM-OUT             PIC X(16).
               10  REV-NUM-OUT                 PIC X(04).
               10  DRAWING-CODE-OUT.
                   15  DRAW-CODE-OUT           PIC X(08).
                   15  DRAW-SELECT-OUT         PIC X(01).
               10  DRAW-DESC-OUT               PIC X(50).
               10  DRAW-ENUM-OUT               PIC X(06).
               10  DRAW-TNUM-OUT               PIC X(08).
               10  DRAW-SUBSYS-OUT             PIC X(04).
               10  DRAW-ZONE-OUT               PIC X(04).
               10  DRAW-DEPT-OUT               PIC X(04).
               10  DRAW-BLDG-OUT               PIC X(04).
               10  INIT-DATE-OUT.
                   15  INIT-YY-OUT             PIC X(02).
                   15  INIT-MM-OUT             PIC X(02).
                   15  INIT-DD-OUT             PIC X(02).
               10  REV-DATE-OUT.
                   15  REV-YY-OUT              PIC X(02).
                   15  REV-MM-OUT              PIC X(02).
                   15  REV-DD-OUT              PIC X(02).
               10  KP-LIST-OUT                 PIC X(08).
               10  DRAWING-LOC-OUT             PIC X(08).
               10  VEND-CODE-OUT               PIC X(04).
               10  SORT-CODE-FILLER            PIC X.

       SD  SORT-FILE RECORD    CONTAINS 142 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  DRAWING-NUM-SORT                PIC X(16).
           05  REV-NUM-SORT                    PIC X(04).
           05  DRAWING-CODE-SORT.
               10  DRAW-CODE-SORT              PIC X(08).
               10  DRAW-SELECT-SORT            PIC X(01).
           05  DRAW-DESC-SORT                  PIC X(50).
           05  DRAW-ENUM-SORT                  PIC X(06).
           05  DRAW-TNUM-SORT                  PIC X(08).
           05  DRAW-SUBSYS-SORT                PIC X(04).
           05  DRAW-ZONE-SORT                  PIC X(04).
           05  DRAW-DEPT-SORT                  PIC X(04).
           05  DRAW-BLDG-SORT                  PIC X(04).
           05  INIT-DATE-SORT.
               10  INIT-YY-SORT                PIC X(02).
               10  INIT-MM-SORT                PIC X(02).
               10  INIT-DD-SORT                PIC X(02).
           05  REV-DATE-SORT.
               10  REV-YY-SORT                 PIC X(02).
               10  REV-MM-SORT                 PIC X(02).
               10  REV-DD-SORT                 PIC X(02).
           05  KP-LIST-SORT                    PIC X(08).
           05  DRAWING-LOC-SORT                PIC X(08).
           05  VEND-CODE-SORT                  PIC X(04).
           05  SORT-CODE                       PIC X.

       WORKING-STORAGE SECTION.
       77  ACT-KEY             PIC 9(5).
       77  ARG-NO              PIC 9(9).
       77  DRAW-C-BUF          PIC X(08).
       77  DRAW-NUM-SAVE       PIC X(16) VALUE SPACES.
       77  EDIT-SW             PIC 99    VALUE 0.
       77  ERASE-BUFFER        PIC X(40) VALUE SPACES.
       77  EOF-SW              PIC 9     VALUE 0.
       77  E-NUM-BUF           PIC X(06).
       77  E-TYPE-BUF          PIC X(08).
       77  MAX-KEY             PIC 9(5).
       77  SEARCH-SW           PIC 9     VALUE 0.
       77  ERROR-BUFFER        PIC X(80).
       77  DATE-TEMP           PIC XX.
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDFDISP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE "DISPLAYS ENTRIES ".
                   15  FILLER      PIC X(07) VALUE "IN THE ".
                   15  FILLER      PIC X(12) VALUE "ENGINEERING ".
                   15  FILLER      PIC X(17) VALUE "DRAWING FILE FOR ".
                   15  FILLER      PIC X(7)  VALUE "MAINTEN".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(14) VALUE "ANCE PURPOSES ".
                   15  FILLER      PIC X(46) VALUE SPACES.
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F4 ".
                   15  FILLER      PIC X(11) VALUE "KEY OF THE ".
                   15  FILLER      PIC X(13) VALUE "DRAWING FILE ".
                   15  FILLER      PIC X(12) VALUE "MAINTENANCE ".
                   15  FILLER      PIC X(07) VALUE "MENU".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  DATE-SCREEN.
           05  DATE-TYPE                         PIC X(20).
           05  STRT-DATE.
               10  STRT-MM                       PIC XX.
               10  STRT-MM-9 REDEFINES STRT-MM   PIC 99.
               10  STRT-DD                       PIC XX.
               10  STRT-DD-9 REDEFINES STRT-DD   PIC 99.
               10  STRT-YY                       PIC XX.
               10  STRT-YY-9 REDEFINES STRT-YY   PIC 99.
           05  END-DATE.
               10  END-MM                        PIC XX.
               10  END-MM-9 REDEFINES END-MM     PIC 99.
               10  END-DD                        PIC XX.
               10  END-DD-9 REDEFINES END-DD     PIC 99.
               10  END-YY                        PIC XX.
               10  END-YY-9 REDEFINES END-YY     PIC 99.
           05  CMDMSG                            PIC X(79).
           05  ERRMSG                            PIC X(79).

       01  DISP-ALL-SCREEN.
           05  DRAWING-NUM-DISP                PIC X(16).
           05  REV-NUM-DISP                    PIC X(04).
           05  DRAW-DESC-DISP                  PIC X(50).
           05  DRAWING-CODE-DISP.
               10  DRAW-CODE-DISP              PIC X(08).
               10  DRAW-SELECT-DISP            PIC X(01).
           05  VEND-CODE-DISP                  PIC X(04).
           05  DRAW-ENUM-DISP                  PIC X(06).
           05  DRAW-TNUM-DISP                  PIC X(08).
           05  DRAW-SUBSYS-DISP                PIC X(04).
           05  DRAW-ZONE-DISP                  PIC X(04).
           05  DRAW-DEPT-DISP                  PIC X(04).
           05  DRAW-BLDG-DISP                  PIC X(04).
           05  INIT-DATE-DISP.
               10  INIT-MM-DISP                PIC X(02).
               10  INIT-DD-DISP                PIC X(02).
               10  INIT-YY-DISP                PIC X(02).
           05  REV-DATE-DISP.
               10  REV-MM-DISP                 PIC X(02).
               10  REV-DD-DISP                 PIC X(02).
               10  REV-YY-DISP                 PIC X(02).
           05  KP-LIST-DISP                    PIC X(08).
           05  DRAWING-LOC-DISP                PIC X(08).
           05  DISP-CMD-LINE                   PIC X(79).
           05  DISP-ERR-LINE                   PIC X(79).

       01  S-DATE.
           05  S-DATE-CC                          PIC 99.
           05  S-DATE-YY                          PIC 99.
           05  S-DATE-MM                          PIC 99.
           05  S-DATE-DD                          PIC 99.

       01  E-DATE.
           05  E-DATE-CC                          PIC 99.
           05  E-DATE-YY                          PIC 99.
           05  E-DATE-MM                          PIC 99.
           05  E-DATE-DD                          PIC 99.

       01  SCREEN-DATA.
           05  LINE-1.
               10  DRAWING-NUM-1             PIC X(16).
               10  REV-NUM-1                 PIC X(04).
               10  DRAW-CODE-1               PIC X(08).
               10  DRAW-DESC-1               PIC X(45).
           05  LINE-2.
               10  DRAWING-NUM-2             PIC X(16).
               10  REV-NUM-2                 PIC X(04).
               10  DRAW-CODE-2               PIC X(08).
               10  DRAW-DESC-2               PIC X(45).
           05  LINE-3.
               10  DRAWING-NUM-3             PIC X(16).
               10  REV-NUM-3                 PIC X(04).
               10  DRAW-CODE-3               PIC X(08).
               10  DRAW-DESC-3               PIC X(45).
           05  LINE-4.
               10  DRAWING-NUM-4             PIC X(16).
               10  REV-NUM-4                 PIC X(04).
               10  DRAW-CODE-4               PIC X(08).
               10  DRAW-DESC-4               PIC X(45).
           05  LINE-5.
               10  DRAWING-NUM-5             PIC X(16).
               10  REV-NUM-5                 PIC X(04).
               10  DRAW-CODE-5               PIC X(08).
               10  DRAW-DESC-5               PIC X(45).
           05  LINE-6.
               10  DRAWING-NUM-6             PIC X(16).
               10  REV-NUM-6                 PIC X(04).
               10  DRAW-CODE-6               PIC X(08).
               10  DRAW-DESC-6               PIC X(45).
           05  LINE-7.
               10  DRAWING-NUM-7             PIC X(16).
               10  REV-NUM-7                 PIC X(04).
               10  DRAW-CODE-7               PIC X(08).
               10  DRAW-DESC-7               PIC X(45).
           05  LINE-8.
               10  DRAWING-NUM-8             PIC X(16).
               10  REV-NUM-8                 PIC X(04).
               10  DRAW-CODE-8               PIC X(08).
               10  DRAW-DESC-8               PIC X(45).
           05  FD-SLCT                       PIC X.
           05  SCREEN-CMD-LINE               PIC X(79).
           05  SCREEN-ERR-LINE               PIC X(79).

       01  SELECT-DATA.
           05  SEARCH-KEYS.
               10  DRAW-NUM-B         PIC X(16).
               10  DRAW-CODE-B.
                   15  DRAW-C-B       PIC X(08).
                   15  DRAW-F-B       PIC X.
               10  E-NUM-B            PIC X(06).
               10  SUB1-B             PIC X(04).
               10  E-TYPE-B           PIC X(08).
               10  SUB2-B             PIC X(04).
           05  ZONE-B                 PIC XXXX.
           05  DEPT-B                 PIC XXXX.
           05  BLDG-B                 PIC XXXX.
           05  IR-DATE.
               10  I-DATE             PIC X.
               10  R-DATE             PIC X.
           05  KP-B                   PIC X(08).
           05  VENDOR-B               PIC XXXX.
           05  SELECT-CMD-LINE        PIC X(79).
           05  SELECT-ERR-LINE        PIC X(79).

       01  ACT-KEY-BUFFER.
           05  KEY-POS-1             PIC 9(8).
           05  KEY-POS-2             PIC 9(8).
           05  KEY-POS-3             PIC 9(8).
           05  KEY-POS-4             PIC 9(8).
           05  KEY-POS-5             PIC 9(8).
           05  KEY-POS-6             PIC 9(8).
           05  KEY-POS-7             PIC 9(8).
           05  KEY-POS-8             PIC 9(8).

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  DRAW-FILE-DATA.
           COPY DDRAWFIL       OF COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        OF COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS.
       BEGIN-PGM.
           CALL "CLOUTDF".
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          DRAWING-FILE-NUM.
           OPEN INPUT          DRAWING-FILE-CODE.
           OPEN INPUT          DRAWING-FILE-EQP.
           OPEN INPUT          DRAWING-FILE-TYPE.
           OPEN I-O            OUT-FILE.

           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           MOVE SPACES         TO SELECT-DATA ERROR-BUFFER.

       6-MAIN.
           MOVE "VDRAWSEL"     TO SCREEN-NAME.
           MOVE ERROR-BUFFER   TO SELECT-ERR-LINE.
           MOVE SELECT-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SELECT-DATA.
           MOVE 0              TO SEARCH-SW.

           IF SEARCH-KEYS = SPACES
               MOVE 41024      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 6-MAIN.

           MOVE 0              TO EDIT-SW.
           IF DRAW-NUM-B NOT = SPACES
               ADD 1           TO EDIT-SW.

           IF DRAW-C-B NOT = SPACES
               ADD 5           TO EDIT-SW.

           IF E-NUM-B NOT = SPACES
               ADD 10          TO EDIT-SW.

           IF E-TYPE-B NOT = SPACES
               ADD 12          TO EDIT-SW.

           IF EDIT-SW = 1 OR 10 OR 12 OR 15 OR 17
               NEXT SENTENCE
           ELSE
           MOVE 41023          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL       TO IND(1) IND(99)
           GO TO 6-MAIN.

           IF EDIT-SW = 1
               MOVE 1          TO SEARCH-SW
               GO TO 6-MAIN-DATECHK.

           IF EDIT-SW = 15 OR 17
               MOVE 2          TO SEARCH-SW
               IF DRAW-F-B = "F" OR "G" OR SPACE
                   NEXT SENTENCE
               ELSE
               MOVE 35105      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO 6-MAIN.

           IF EDIT-SW = 10
               MOVE 3          TO SEARCH-SW.

           IF E-NUM-B NOT = SPACES
               IF SUB1-B NOT = SPACES
                   IF SUB1-B NOT NUMERIC
                       MOVE 45044    TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO IND(5) IND(99)
                       GO TO 6-MAIN.

           IF EDIT-SW = 12
               MOVE 4          TO SEARCH-SW.

           IF E-TYPE-B NOT = SPACES
               IF SUB2-B NOT = SPACES
                   IF SUB2-B NOT NUMERIC
                       MOVE 45044    TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO IND(7) IND(99)
                       GO TO 6-MAIN.

       6-MAIN-DATECHK.
           IF IR-DATE = SPACES
               GO TO 6-MAIN-CONT.

           MOVE SPACES         TO DATE-SCREEN.

           IF I-DATE = SPACE
               MOVE "     R E V I S I O N" TO DATE-TYPE
               GO TO 6-DATE-FUNCTION.

           IF R-DATE = SPACE
               MOVE " I N I T I A T I O N" TO DATE-TYPE
               GO TO 6-DATE-FUNCTION.

           MOVE 30029          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE TRUE-VAL       TO IND(10) IND(99)
           GO TO 6-MAIN.

       6-DATE-FUNCTION.
           MOVE "VDRAWDAT"     TO SCREEN-NAME.
           IF IND(99) = TRUE-VAL
               MOVE ERROR-BUFFER TO ERRMSG.

           MOVE DATE-SCREEN    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO DATE-SCREEN.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF STRT-DATE = SPACES
               MOVE 30031      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO 6-DATE-FUNCTION.

           IF STRT-DATE NOT NUMERIC
               MOVE 35014      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO 6-DATE-FUNCTION.

           IF END-DATE = SPACES
               MOVE 30013      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(5) IND(99)
               GO TO 6-DATE-FUNCTION.

           IF END-DATE NOT NUMERIC
               MOVE 35012      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(5) IND(99)
               GO TO 6-DATE-FUNCTION.

           IF STRT-YY-9 IS NUMERIC
               IF DATE-FLAG = 1
                   IF STRT-MM-9 > 0 AND STRT-MM-9 < 13
                       IF STRT-DD-9 > 0 AND STRT-DD-9 < 32
                           NEXT SENTENCE
                       ELSE
                       MOVE 35030    TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO IND(3) IND(99)
                       GO TO 6-DATE-FUNCTION
                   ELSE
                   MOVE 35031    TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(2) IND(99)
                   GO TO 6-DATE-FUNCTION
               ELSE
               IF STRT-MM-9 > 0 AND STRT-MM-9 < 32
                   IF STRT-DD-9 > 0 AND STRT-DD-9 < 13
                        NEXT SENTENCE
                   ELSE
                   MOVE 35031    TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(3) IND(99)
                   GO TO 6-DATE-FUNCTION
               ELSE
               MOVE 35030      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO 6-DATE-FUNCTION
           ELSE
           MOVE 35032          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL       TO IND(4) IND(99)
           GO TO 6-DATE-FUNCTION.

           IF END-YY-9 IS NUMERIC
               IF DATE-FLAG = 1
                   IF END-MM-9 > 0 AND END-MM-9 < 13
                       IF END-DD-9 > 0 AND END-DD-9 < 32
                           NEXT SENTENCE
                       ELSE
                       MOVE 35030    TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO IND(6) IND(99)
                       GO TO 6-DATE-FUNCTION
                   ELSE
                   MOVE 35031    TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO 6-DATE-FUNCTION
               ELSE
               IF END-MM-9 > 0 AND END-MM-9 < 32
                   IF END-DD-9 > 0 AND END-DD-9 < 13
                       NEXT SENTENCE
                   ELSE
                   MOVE 35031    TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO 6-DATE-FUNCTION
               ELSE
               MOVE 35030      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(5) IND(99)
               GO TO 6-DATE-FUNCTION
           ELSE
           MOVE 35032          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL       TO IND(7) IND(99)
           GO TO 6-DATE-FUNCTION.

           IF DATE-FLAG = 3
               MOVE STRT-MM    TO DATE-TEMP
               MOVE STRT-DD    TO STRT-MM
               MOVE DATE-TEMP  TO STRT-DD.

           MOVE STRT-YY-9      TO S-DATE-YY.
           MOVE STRT-MM-9      TO S-DATE-MM.
           MOVE STRT-DD-9      TO S-DATE-DD.

           MOVE "20"           TO S-DATE-CC.
           IF S-DATE-YY > "70"
               MOVE "19"       TO S-DATE-CC.

           IF DATE-FLAG = 3
               MOVE END-MM     TO DATE-TEMP
               MOVE END-DD     TO END-MM
               MOVE DATE-TEMP  TO END-DD.

           MOVE END-YY-9       TO E-DATE-YY.
           MOVE END-MM-9       TO E-DATE-MM.
           MOVE END-DD-9       TO E-DATE-DD.

           MOVE "20"           TO E-DATE-CC.
           IF E-DATE-YY > "70"
               MOVE "19"       TO E-DATE-CC.

           SUBTRACT 1          FROM S-DATE-DD.
           ADD 1               TO E-DATE-DD.

       6-MAIN-CONT.
           MOVE 0              TO ACT-KEY.
           SORT SORT-FILE      ASCENDING KEY
                               SORT-CODE
                               DRAWING-NUM-SORT
                               REV-NUM-SORT
               INPUT PROCEDURE  7-SORT-INPUT-RECORDS
               OUTPUT PROCEDURE 8-SORT-WRITE-FILE.

           IF ACT-KEY = 0
               MOVE 40011      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(99)
               GO TO 6-MAIN.

           MOVE 0              TO OUT-KEY.

       61-RESET-SCREEN.
           MOVE "VDRAWDNO"     TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA ERROR-BUFFER.
           PERFORM 62-FILL-SCREEN THRU 62-FS-EXIT.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               IF EOF-SW = 1
                   GO TO END-OF-JOB
               ELSE
               GO TO 61-RESET-SCREEN.

           IF FD-SLCT NOT = SPACE
               GO TO 63-DISPLAY-ONE.

           IF EOF-SW = 1
               MOVE 0          TO EOF-SW
               MOVE 0          TO OUT-KEY.

           GO TO 61-RESET-SCREEN.

       62-FILL-SCREEN.
           MOVE 0              TO EOF-SW.
           MOVE SPACES         TO DRAW-NUM-SAVE.
           ADD 1               TO OUT-KEY.
           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-1.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-1.
           MOVE DRAWING-NUM-1  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-1.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-2.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-2.
           MOVE DRAWING-NUM-2  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-2.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-3.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-3.
           MOVE DRAWING-NUM-3  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-3.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-4.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-4.
           MOVE DRAWING-NUM-4  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-4.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-5.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-5.
           MOVE DRAWING-NUM-5  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-5.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-6.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-6.
           MOVE DRAWING-NUM-6  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-6.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-7.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-7.
           MOVE DRAWING-NUM-7  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-7.
           ADD 1               TO OUT-KEY.

           MOVE SPACES         TO OUT-DATA.
           PERFORM 62-READ-FILE THRU 62-RF-EXIT.

           IF EOF-SW = 1
               GO TO 62-FS-EXIT.

           MOVE OUT-DATA       TO LINE-8.
           MOVE DRAW-DESC-OUT  TO DRAW-DESC-8.
           MOVE DRAWING-NUM-8  TO DRAW-NUM-SAVE.
           MOVE OUT-KEY        TO KEY-POS-8.

       62-FS-EXIT.             EXIT.

       62-READ-FILE.
           IF OUT-KEY = 1
               READ OUT-FILE   FIRST     AT END
                   MOVE 1      TO EOF-SW
                   GO TO 62-RF-EXIT
           ELSE
           READ OUT-FILE       NEXT      AT END
               MOVE 1          TO EOF-SW
               GO TO 62-RF-EXIT.

           IF OUT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-RF-EXIT.

           IF SEARCH-SW NOT = 1
               IF DRAWING-NUM-OUT = DRAW-NUM-SAVE
                   ADD 1       TO OUT-KEY
                   GO TO 62-READ-FILE.

       62-RF-EXIT.             EXIT.

       63-DISPLAY-ONE.
           IF FD-SLCT = "A"
               IF LINE-1 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-1  TO ACT-KEY
           ELSE
           IF FD-SLCT = "B"
               IF LINE-2 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-2  TO ACT-KEY
           ELSE
           IF FD-SLCT = "C"
               IF LINE-3 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-3  TO ACT-KEY
           ELSE
           IF FD-SLCT = "D"
               IF LINE-4 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-4  TO ACT-KEY
           ELSE
           IF FD-SLCT = "E"
               IF LINE-5 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-5  TO ACT-KEY
           ELSE
           IF FD-SLCT = "F"
               IF LINE-6 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-6  TO ACT-KEY
           ELSE
           IF FD-SLCT = "G"
               IF LINE-7 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-7  TO ACT-KEY
           ELSE
           IF FD-SLCT = "H"
               IF LINE-8 = SPACES
                   MOVE 999    TO ACT-KEY
               ELSE
               MOVE KEY-POS-8  TO ACT-KEY
           ELSE
           MOVE 35105          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL       TO IND(35) IND(99)
           GO TO 6-MAIN.

           MOVE SPACES         TO OUT-DATA.
           MOVE 0              TO OUT-KEY.
           PERFORM 631-READ-OUT-FILE THRU 631-ROF-EXIT.
           MOVE "VDRAWALL"     TO SCREEN-NAME.
           MOVE SPACES         TO DISP-ALL-SCREEN.

           MOVE DRAWING-NUM-OUT    TO DRAWING-NUM-DISP.
           MOVE REV-NUM-OUT        TO REV-NUM-DISP.
           MOVE DRAW-DESC-OUT      TO DRAW-DESC-DISP.
           MOVE DRAWING-CODE-OUT   TO DRAWING-CODE-DISP.
           MOVE VEND-CODE-OUT      TO VEND-CODE-DISP.
           MOVE DRAW-ENUM-OUT      TO DRAW-ENUM-DISP.
           MOVE DRAW-TNUM-OUT      TO DRAW-TNUM-DISP.
           MOVE DRAW-SUBSYS-OUT    TO DRAW-SUBSYS-DISP.
           MOVE DRAW-ZONE-OUT      TO DRAW-ZONE-DISP.
           MOVE DRAW-DEPT-OUT      TO DRAW-DEPT-DISP.
           MOVE DRAW-BLDG-OUT      TO DRAW-BLDG-DISP.
           MOVE KP-LIST-OUT        TO KP-LIST-DISP.

           MOVE INIT-YY-OUT    TO INIT-YY-DISP.
           MOVE INIT-MM-OUT    TO INIT-MM-DISP.
           MOVE INIT-DD-OUT    TO INIT-DD-DISP.
           IF DATE-FLAG = 3
               MOVE INIT-MM-OUT TO INIT-DD-DISP
               MOVE INIT-DD-OUT TO INIT-MM-DISP.

           MOVE REV-YY-OUT     TO REV-YY-DISP.
           MOVE REV-MM-OUT     TO REV-MM-DISP.
           MOVE REV-DD-OUT     TO REV-DD-DISP.
           IF DATE-FLAG = 3
               MOVE REV-MM-OUT TO REV-DD-DISP
               MOVE REV-DD-OUT TO REV-MM-DISP.

           MOVE DRAWING-LOC-OUT TO DRAWING-LOC-DISP.
           MOVE DISP-ALL-SCREEN TO DISPLAY-REC.
           MOVE "00"            TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO DISP-ALL-SCREEN.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           MOVE 0              TO OUT-KEY.
           MOVE SPACE          TO FD-SLCT.
           GO TO 61-RESET-SCREEN.

       631-READ-OUT-FILE.
           ADD 1               TO OUT-KEY.
           IF OUT-KEY = 1
               READ OUT-FILE   FIRST     AT END
                   MOVE 31087  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(35) IND(99)
                   GO TO 631-ROF-EXIT
           ELSE
           READ OUT-FILE       NEXT      AT END
               MOVE 31087      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(35) IND(99)
               GO TO 631-ROF-EXIT.

           IF OUT-KEY NOT = ACT-KEY
               GO TO 631-READ-OUT-FILE.

       631-ROF-EXIT.           EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               DRAWING-FILE-NUM.
           CLOSE               DRAWING-FILE-CODE.
           CLOSE               DRAWING-FILE-EQP.
           CLOSE               DRAWING-FILE-TYPE.
           CLOSE               OUT-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO ERROR-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.

       999-CATREAD-EXIT.       EXIT.

       7-SORT-INPUT-RECORDS.
           PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.

       70-SORT-MAIN.
           IF SEARCH-SW = 1
               MOVE DRAW-NUM-B TO DRWNUM OF DFREC-NUM
               START DRAWING-FILE-NUM
                               KEY IS = EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-M-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 2
               MOVE DRAW-C-B   TO DRWCODEA OF DFREC-CODE
               START DRAWING-FILE-CODE
                               KEY IS = EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-M-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 3
               MOVE E-NUM-B    TO DRWEQPNUM OF DFREC-EQP
               START DRAWING-FILE-EQP
                               KEY IS = EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-M-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 4
               MOVE E-TYPE-B   TO DRWTYPNUM OF DFREC-TYPE
               START DRAWING-FILE-TYPE
                               KEY IS = EXTERNALLY-DESCRIBED-KEY
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-M-EXIT.

           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT.

       70-SORT-M-EXIT.         EXIT.

       70-SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           IF SEARCH-SW = 1
               READ DRAWING-FILE-NUM NEXT
                               INTO DRAW-FILE-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-DBGET-EXIT
               ELSE
               IF DRAW-NUM-B NOT = DRWNUM OF DFREC-NUM
                   GO TO 70-SORT-DBGET-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 2
               READ DRAWING-FILE-CODE NEXT
                               INTO DRAW-FILE-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-DBGET-EXIT
               ELSE
               IF DRAW-C-B NOT = DRWCODEA OF DFREC-CODE
                   GO TO 70-SORT-DBGET-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 3
               READ DRAWING-FILE-EQP NEXT
                               INTO DRAW-FILE-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF FILE-STAT NOT = "00"
                   GO TO 70-SORT-DBGET-EXIT
               ELSE
               IF E-NUM-B NOT = DRWEQPNUM OF DFREC-EQP
                   GO TO 70-SORT-DBGET-EXIT
               END-IF
           ELSE
           IF SEARCH-SW = 4
               READ DRAWING-FILE-TYPE NEXT
                               INTO DRAW-FILE-DATA
                   AT END      MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF E-TYPE-B NOT = DRWTYPNUM OF DFREC-TYPE
                   GO TO 70-SORT-DBGET-EXIT.

           IF SEARCH-SW = 2
             IF E-NUM-B NOT = SPACES
               IF E-NUM-B NOT = DRAW-ENUM
                   GO TO 70-SORT-DBGET.

           IF SEARCH-SW = 2
             IF E-TYPE-B NOT = SPACES
               IF E-TYPE-B NOT = DRAW-TNUM
                   GO TO 70-SORT-DBGET.

           IF SEARCH-SW = 2 OR 3
               IF SUB1-B NOT = SPACES
                   IF DRAW-SUBSYS NOT = SUB1-B
                       GO TO 70-SORT-DBGET.

           IF SEARCH-SW = 2 OR 4
               IF SUB2-B NOT = SPACES
                   IF DRAW-SUBSYS NOT = SUB2-B
                       GO TO 70-SORT-DBGET.

           IF DRAW-F-B NOT = SPACES
               IF DRAW-F-B NOT = DRAW-SELECT
                   GO TO 70-SORT-DBGET.

           IF IR-DATE NOT = SPACES
               IF I-DATE NOT = SPACE
                   IF S-DATE < INIT-DATE-CN AND
                      E-DATE > INIT-DATE-CN
                       NEXT SENTENCE
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF S-DATE < REV-DATE-CN AND
                   E-DATE > REV-DATE-CN
                       NEXT SENTENCE
                   ELSE
                   GO TO 70-SORT-DBGET.

           IF ZONE-B = DRAW-ZONE OR SPACES
             IF DEPT-B = DRAW-DEPT OR SPACES
               IF BLDG-B = DRAW-BLDG OR SPACES
                 IF KP-B = KP-LIST OR SPACES
                   IF VENDOR-B = VEND-CODE OR SPACES
                       MOVE DRAWING-NUM   TO DRAWING-NUM-SORT
                       MOVE REV-NUM       TO REV-NUM-SORT
                       MOVE DRAW-CODE     TO DRAW-CODE-SORT
                       MOVE DRAW-SELECT   TO DRAW-SELECT-SORT
                       MOVE DRAW-DESC     TO DRAW-DESC-SORT
                       MOVE DRAW-ENUM     TO DRAW-ENUM-SORT
                       MOVE DRAW-TNUM     TO DRAW-TNUM-SORT
                       MOVE DRAW-SUBSYS   TO DRAW-SUBSYS-SORT
                       MOVE DRAW-ZONE     TO DRAW-ZONE-SORT
                       MOVE DRAW-DEPT     TO DRAW-DEPT-SORT
                       MOVE DRAW-BLDG     TO DRAW-BLDG-SORT
                       MOVE INIT-YY       TO INIT-YY-SORT
                       MOVE INIT-MM       TO INIT-MM-SORT
                       MOVE INIT-DD       TO INIT-DD-SORT
                       MOVE REV-YY        TO REV-YY-SORT
                       MOVE REV-MM        TO REV-MM-SORT
                       MOVE REV-DD        TO REV-DD-SORT
                       MOVE KP-LIST       TO KP-LIST-SORT
                       MOVE DRAWING-LOC   TO DRAWING-LOC-SORT
                       MOVE VEND-CODE     TO VEND-CODE-SORT
                       IF DRAW-SELECT = "G"
                          MOVE "A" TO SORT-CODE
                          RELEASE SORT-REC
                       ELSE
                       MOVE "B" TO SORT-CODE
                       RELEASE SORT-REC.

           GO TO 70-SORT-DBGET.

       70-SORT-DBGET-EXIT.     EXIT.

       8-SORT-WRITE-FILE.
           MOVE 0              TO ACT-KEY.
           PERFORM 8-SWF-LOOP  THRU 8-SWFL-EXIT.

       8-SWF-LOOP.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO 8-SWFL-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE ACT-KEY        TO OUT-KEY.
           MOVE SORT-REC       TO OUT-DATA.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO 8-SWFL-EXIT.
           GO TO 8-SWF-LOOP.

       8-SWFL-EXIT.            EXIT.

