       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDFDEL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDRAWING-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT DRAWING-FILE
                  ASSIGN       TO DATABASE-MCFLDF0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  DRAWING-FILE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS DFREC.
       01  DFREC.
           COPY DDS-ALL-FORMATS OF MCFLDF0101.

       WORKING-STORAGE SECTION.
       77  CHAIN-SW            PIC 9  VALUE 0.
       77  FIND-SW             PIC 9  VALUE 0.
       77  BLOWUP-BASE         PIC X(16).
       77  TRUE-VAL            PIC 1  VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TDFDEL  ".
           05  PROGRAM-TYPE    PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER  PIC X(16) VALUE "ALLOWS DELETION ".
                   15  FILLER  PIC X(14) VALUE "OF ENTRIES IN ".
                   15  FILLER  PIC X(16) VALUE "THE ENGINEERING ".
                   15  FILLER  PIC X(14) VALUE "DRAWING FILE  ".
               10  PROG-DESC-B PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION.
                   15  FILLER  PIC X(17) VALUE "RUNS FROM THE F3 ".
                   15  FILLER  PIC X(11) VALUE "KEY OF THE ".
                   15  FILLER  PIC X(13) VALUE "DRAWING FILE ".
                   15  FILLER  PIC X(19) VALUE "MAINTENANCE MENU".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  ERROR-BUFFER.
           05  FILLER          PIC X(16).
           05  E-DWGNO         PIC X(16).
           05  FILLER          PIC X.
           05  E-REVNO         PIC X(4).
           05  FILLER          PIC X(43).

       01  SCREEN-DATA.
           05  DRAW-NUM-BUF        PIC X(16).
           05  REV-NUM-BUF         PIC X(04).
           05  DRAW-DESC-BUF       PIC X(50).
           05  DRAWING-CODE-BUF.
               10  DRAW-CODE-BUF   PIC X(08).
               10  DRAW-SELECT-BUF PIC X(01).
           05  VEND-CODE-BUF       PIC X(04).
           05  DRAW-ENUM-BUF       PIC X(06).
           05  DRAW-TNUM-BUF       PIC X(08).
           05  DRAW-SUBSYS-BUF     PIC X(04).
           05  DRAW-ZONE-BUF       PIC X(04).
           05  DRAW-DEPT-BUF       PIC X(04).
           05  DRAW-BLDG-BUF       PIC X(04).
           05  INIT-DATE-BUF.
               10  INIT-MM-BUF     PIC X(02).
               10  INIT-DD-BUF     PIC X(02).
               10  INIT-YY-BUF     PIC X(02).
           05  REV-DATE-BUF.
               10  REV-MM-BUF      PIC X(02).
               10  REV-DD-BUF      PIC X(02).
               10  REV-YY-BUF      PIC X(02).
           05  KP-LIST-BUF         PIC X(08).
           05  DRAWING-LOC-BUF     PIC X(08).
           05  SCREEN-MSG-LINE     PIC X(79).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).

           COPY SCREENIO       OF COPYLIB.

           COPY LANGSUB        IN COPYLIB.

           COPY CATREAD        OF COPYLIB.

       01  DRAW-FILE-DATA.
           COPY DDRAWFIL       OF COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        OF COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS.
       BEGIN-PROC.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            DRAWING-FILE.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           MOVE SPACES         TO SCREEN-DATA ERROR-BUFFER.
           MOVE 0              TO FIND-SW.

       6-MAIN.
           IF IND(99) = TRUE-VAL
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
           ELSE
               MOVE ERROR-BUFFER TO SCREEN-MSG-LINE.

           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "VDRAWDEL"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 2
               MOVE SPACES     TO SCREEN-DATA ERROR-BUFFER
               MOVE 0          TO FIND-SW CHAIN-SW
               GO TO 6-MAIN.

           IF KEY-HIT = 5
               IF CHAIN-SW = 1
                   GO TO 61-DBGET.

           IF KEY-HIT NOT = 0
               MOVE 0          TO FIND-SW CHAIN-SW
               GO TO 6-MAIN.

           IF FIND-SW = 1
               GO TO 63-UPDATE-FILE.

           IF DRAW-NUM-BUF = SPACES
               MOVE 30071      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 6-MAIN.

       61-DBFIND.
           MOVE 0              TO FIND-SW.
           MOVE DRAW-NUM-BUF   TO DRWNUM OF DFREC.
           START DRAWING-FILE  KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 30074      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 6-MAIN.

           MOVE 1              TO CHAIN-SW.

       61-DBGET.
           READ DRAWING-FILE   NEXT INTO DRAW-FILE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FIND-SW = 0
                   MOVE 30074  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(1) IND(99)
                   GO TO 6-MAIN
               ELSE
               MOVE 0          TO CHAIN-SW
               GO TO 61-DBFIND.

           IF DRAW-NUM-BUF NOT = DRWNUM OF DFREC
               IF FIND-SW = 0
                   MOVE 30074  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO IND(1) IND(99)
                   GO TO 6-MAIN
               ELSE
               MOVE 0          TO CHAIN-SW
               GO TO 61-DBFIND.

           MOVE 1              TO FIND-SW.
           MOVE REV-NUM        TO REV-NUM-BUF.
           MOVE DRAW-DESC      TO DRAW-DESC-BUF.
           MOVE DRAW-CODE      TO DRAW-CODE-BUF.
           MOVE DRAW-SELECT    TO DRAW-SELECT-BUF.
           MOVE VEND-CODE      TO VEND-CODE-BUF.
           MOVE DRAW-ENUM      TO DRAW-ENUM-BUF.
           MOVE DRAW-TNUM      TO DRAW-TNUM-BUF.
           MOVE DRAW-SUBSYS    TO DRAW-SUBSYS-BUF.
           MOVE DRAW-ZONE      TO DRAW-ZONE-BUF.
           MOVE DRAW-BLDG      TO DRAW-BLDG-BUF.
           MOVE DRAW-DEPT      TO DRAW-DEPT-BUF.
           MOVE KP-LIST        TO KP-LIST-BUF.
           MOVE DRAWING-LOC    TO DRAWING-LOC-BUF.

           MOVE INIT-YY        TO INIT-YY-BUF.
           MOVE INIT-MM        TO INIT-MM-BUF.
           MOVE INIT-DD        TO INIT-DD-BUF.
           IF DATE-FLAG = 3
               MOVE INIT-DD    TO INIT-MM-BUF
               MOVE INIT-MM    TO INIT-DD-BUF.

           MOVE REV-YY         TO REV-YY-BUF.
           MOVE REV-MM         TO REV-MM-BUF.
           MOVE REV-DD         TO REV-DD-BUF.
           IF DATE-FLAG = 3
               MOVE REV-DD     TO REV-MM-BUF
               MOVE REV-MM     TO REV-DD-BUF.

           IF REV-DATE-BUF = "000000"
               MOVE SPACES     TO REV-DATE-BUF.

           MOVE 42063          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           GO TO 6-MAIN.

       63-UPDATE-FILE.
           DELETE DRAWING-FILE RECORD
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               DISPLAY "DELETE FAILED *TDFDEL* FILE-STAT = " FILE-STAT
               GO TO 6-MAIN.

           MOVE 66167          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE DRAW-NUM-BUF   TO E-DWGNO.
           MOVE REV-NUM-BUF    TO E-REVNO.
           MOVE 0              TO FIND-SW CHAIN-SW.
           MOVE SPACES         TO SCREEN-DATA.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               DRAWING-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO ERROR-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.

       999-CATREAD-EXIT.       EXIT.

