       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDFEXEC.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDRAWING-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       77  ACT-KEY                     PIC 9(9).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDFEXEC ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(09) VALUE "DISPLAYS ".
                   15  FILLER      PIC X(15) VALUE "SELECTION MENU ".
                   15  FILLER      PIC X(16) VALUE "FOR DRAWING FILE".
                   15  FILLER      PIC X(20) VALUE "MAINTENANCE ".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

           COPY SCREENIO       OF COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        OF COPYLIB.

       01  LAST-WO-BUFF.
           COPY MLASTWO        OF COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-PGM.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-LAST-NUM-USED.
           MOVE 1              TO ACT-KEY.

           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 1          TO DATE-FLAG-SW.

           MOVE DATE-FLAG-SW   TO DATE-FLAG.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       6-MAIN.
           MOVE "VDRAWEXC"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               CALL "TDFINIT"  USING DBPARAMETERS
           ELSE
           IF KEY-HIT = 2
               CALL "TDFUPDT"  USING DBPARAMETERS
           ELSE
           IF KEY-HIT = 4
               CALL "TDFDEL"   USING DBPARAMETERS
           ELSE
           IF KEY-HIT = 5
               CALL "TDFDISP"  USING DBPARAMETERS
           ELSE
               GO TO 6-MAIN.

           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-LAST-NUM-USED.
           GOBACK.

