       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDISPWO.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-MESSAGE-WO
                  ASSIGN       TO DATABASE-MCFLMM2403
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDISPWO-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-MESSAGE-WO
           LABEL RECORDS ARE STANDARD.
       01  MWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2403.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  WO-KEY              PIC X(10).
       77  MSG-BUF             PIC X(12).
       77  FILE-STAT           PIC XX.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDISPWO ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                   "DISPLAY WORKORDERS FROM THE CR".
               10  PROG-DESC-A2    PIC X(30) VALUE
                   "AFTSMAN's EXECUTIVE PROGRAM.  ".
               10  PROG-DESC-B1    PIC X(30) VALUE
                   "DISPLAYS WORKORDER, MESSAGES, ".
               10  PROG-DESC-B2    PIC X(30) VALUE
                   "AND EQUIPMENT HISTORY.        ".
               10  PROG-FUNCTION1  PIC X(30) VALUE
                   "RUNS FROM F5 KEY OF PRIMARY ME".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                   "NU IN EXECUTIVE PROGRAM.      ".
           05  PASSWORD-FLAG       PIC X.

       01  LINKAGE-DATA.
           05  EQP-INPUT.
               10  EQP-NUM-BUF PIC X(06).
               10  EQP-TYP-BUF PIC X(08).
               10  EQP-ZON-BUF PIC X(04).
               10  EQP-DEP-BUF PIC X(04).
               10  EQP-SUB-BUF PIC X(04).
           05  SORT-SELECT.
               10  FC-SORT-BUF PIC X  VALUE " ".
               10  WO-SORT-BUF PIC X  VALUE " ".
               10  CD-SORT-BUF PIC X  VALUE "X".
           05  PLANNED-SW      PIC X  VALUE "N".
           05  CALL-SW         PIC X.

       01  MSG-AREA.
           05  CNUM-MSG        PIC X(04).
           05  WONUM-MSG       PIC X(10).
           05  MESSAGE-BUFFER  PIC X(76).

       01  CUR-DATE-WA.
           02  CUR-DATE-MM     PIC 99.
           02  SLASH1          PIC X.
           02  CUR-DATE-DD     PIC 99.
           02  SLASH2          PIC X.
           02  CUR-DATE-YY     PIC 99.

       01  CUR-DATE-99.
           05  C-DATE-YY       PIC 99.
           05  C-DATE-MM       PIC 99.
           05  C-DATE-DD       PIC 99.

       01  TIME-BUFF.
           02  TIME-HM.
               03  TIME-HRS    PIC 99.
               03  TIME-MINS   PIC 99.
           02  FILLER          PIC XXXX.

       01  SCREEN-BUF-VWO.
           05  CURDATE-VWO.
               15  DATE-CVWO-MM  PIC XX.
               15  FILLER        PIC X.
               15  DATE-CVWO-DD  PIC XX.
               15  FILLER        PIC X.
               15  DATE-CVWO-YY  PIC XX.
           05  CURTIME-VWO.
               10  CT-HH-VWO     PIC XX.
               10  CT-FILL-VWO   PIC X.
               10  CT-MM-VWO     PIC XX.
           05  WO-NUM-VWO        PIC X(10).
           05  WO-STATUS-VWO     PIC XX.
           05  WO-TYPE-VWO       PIC XX.
           05  DATE-RECD-VWO.
               10  DR-MM-VWO     PIC XX.
               10  DR-DD-VWO     PIC XX.
               10  DR-YY-VWO     PIC XX.
           05  TIME-RECD-VWO.
               10  TR-HH-VWO     PIC XX.
               10  TR-MM-VWO     PIC XX.
           05  APPROVAL-VWO      PIC X.
           05  REQUESTER-VWO     PIC X(16).
           05  EQUIP-NUM-VWO     PIC X(6).
           05  EQUIP-NAME-VWO    PIC X(50).
           05  TYPE-NUM-VWO      PIC X(8).
           05  DEPT-VWO          PIC X(4).
           05  ZONE-VWO          PIC X(4).
           05  LOCATION-VWO      PIC X(8).
           05  PRIORITY-VWO      PIC X.
           05  EQUIP-DOWN-VWO    PIC X.
           05  CRFT-REQD-1-VWO   PIC XX.
           05  CRFT-REQD-2-VWO   PIC XX.
           05  CRFT-REQD-3-VWO   PIC XX.
           05  EXP-CLASS-VWO     PIC X(8).
           05  DESC-1-VWO        PIC X(30).
           05  DESC-2-VWO        PIC X(66).
           05  DESC-3-VWO        PIC X(66).
           05  CRAFTSMEN-1-VWO   PIC X(4).
           05  CRAFTSMEN-2-VWO   PIC X(4).
           05  CRAFTSMEN-3-VWO   PIC X(4).
           05  DATE-STRT-VWO.
               10  DS-MM-VWO     PIC XX.
               10  DS-DD-VWO     PIC XX.
               10  DS-YY-VWO     PIC XX.
           05  TIME-STRT-VWO.
               10  TS-HH-VWO     PIC XX.
               10  TS-MM-VWO     PIC XX.
           05  FAIL-CODE-VWO.
               10  FC-REAS-VWO   PIC XX.
               10  FC-SUBS-VWO   PIC X(4).
           05  DATE-COMP-VWO.
               10  DC-MM-VWO     PIC XX.
               10  DC-DD-VWO     PIC XX.
               10  DC-YY-VWO     PIC XX.
           05  TIME-COMP-VWO.
               10  TC-HH-VWO     PIC XX.
               10  TC-MM-VWO     PIC XX.
           05  MSG-MSG-VWO       PIC X(12).
           05  SCREEN-MSGS.
               10  CMDMSGV       PIC X(79).
               10  ERRMSGV       PIC X(79).

       01  SCREEN-BUF-PWO.
           05  CURDATE-PWO.
               15  DATE-CPWO-MM  PIC XX.
               15  FILLER        PIC X.
               15  DATE-CPWO-DD  PIC XX.
               15  FILLER        PIC X.
               15  DATE-CPWO-YY  PIC XX.
           05  CURTIME-PWO.
               10  CT-HH-PWO     PIC XX.
               10  CT-FILL-PWO   PIC X.
               10  CT-MM-PWO     PIC XX.
           05  WO-NUM-PWO        PIC X(10).
           05  WO-STATUS-PWO     PIC XX.
           05  WO-TYPE-PWO       PIC XX.
           05  DATE-RECD-PWO.
               10  DR-MM-PWO     PIC XX.
               10  DR-DD-PWO     PIC XX.
               10  DR-YY-PWO     PIC XX.
           05  TIME-RECD-PWO.
               10  TR-HH-PWO     PIC XX.
               10  TR-MM-PWO     PIC XX.
           05  APPROVAL-PWO      PIC X.
           05  REQUESTER-PWO     PIC X(16).
           05  EQUIP-NUM-PWO     PIC X(6).
           05  EQUIP-NAME-PWO    PIC X(50).
           05  TYPE-NUM-PWO      PIC X(8).
           05  DEPT-PWO          PIC X(4).
           05  ZONE-PWO          PIC X(4).
           05  LOCATION-PWO      PIC X(8).
           05  PRIORITY-PWO      PIC X.
           05  RIME-PWO          PIC XX.
           05  EQUIP-DOWN-PWO    PIC X.
           05  EXP-CLASS-PWO     PIC X(8).
           05  DATE-REQD-PWO.
               10  DD-MM-PWO     PIC XX.
               10  DD-DD-PWO     PIC XX.
               10  DD-YY-PWO     PIC XX.
           05  TIME-REQD-PWO.
               10  TD-HH-PWO     PIC XX.
               10  TD-MM-PWO     PIC XX.
           05  DESC-1-PWO        PIC X(30).
           05  DESC-2-PWO        PIC X(66).
           05  DESC-3-PWO        PIC X(66).
           05  DESC-4-PWO        PIC X(66).
           05  DESC-5-PWO        PIC X(66).
           05  DESC-6-PWO        PIC X(66).
           05  DESC-7-PWO        PIC X(66).
           05  DESC-8-PWO        PIC X(66).
           05  DESC-9-PWO        PIC X(66).
           05  ENGR-PWO          PIC X(4).
           05  PLANNER-PWO       PIC X(4).
           05  SCHED-PWO         PIC X(4).
           05  DATE-SCHD-PWO.
               10  SD-MM-PWO     PIC XX.
               10  SD-DD-PWO     PIC XX.
               10  SD-YY-PWO     PIC XX.
           05  TIME-SCHD-PWO.
               10  SD-HH-PWO     PIC XX.
               10  SS-MM-PWO     PIC XX.
           05  BUDGET-PWO        PIC X(13).
           05  REQNO-PWO         PIC X(12).
           05  DATE-STRT-PWO.
               10  DS-MM-PWO     PIC XX.
               10  DS-DD-PWO     PIC XX.
               10  DS-YY-PWO     PIC XX.
           05  TIME-STRT-PWO.
               10  TS-HH-PWO     PIC XX.
               10  TS-MM-PWO     PIC XX.
           05  FAIL-CODE-PWO.
               10  FC-1-2-PWO    PIC XX.
               10  FC-3-6-PWO    PIC XXXX.
           05  JOBPLAN-NAME      PIC X(10).
           05  DATE-COMP-PWO.
               10  DC-MM-PWO     PIC XX.
               10  DC-DD-PWO     PIC XX.
               10  DC-YY-PWO     PIC XX.
           05  TIME-COMP-PWO.
               10  TC-HH-PWO     PIC XX.
               10  TC-MM-PWO     PIC XX.
           05  MASTER-SCHED-NAME PIC X(10).
           05  MSG-MSG-PWO       PIC X(12).
           05  SCREEN-MSGS.
               10  CMDMSGP       PIC X(79).
               10  ERRMSGP       PIC X(79).

           COPY SCREENIO       IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  WO-MESSAGE-DATA.
           COPY DWOMSG         IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  FILE-SW             PIC X.

       PROCEDURE DIVISION      USING DBPARAMETERS
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               FILE-SW.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       BEGIN.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-MESSAGE-WO.
           MOVE SPACES         TO MSG-AREA.
           ACCEPT CUR-DATE-99  FROM DATE.
           MOVE C-DATE-YY      TO CUR-DATE-YY.
           MOVE C-DATE-MM      TO CUR-DATE-MM.
           MOVE C-DATE-DD      TO CUR-DATE-DD.
           MOVE "/"            TO SLASH1 SLASH2.
           MOVE SPACES         TO SCREEN-BUF-VWO SCREEN-BUF-PWO.

           IF JCW-PWOSW-273 NOT = " "
               MOVE "Y"        TO PLANNED-SW.

       MAIN.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           IF FILE-SW = "B"
               MOVE "DISPVERB" TO SCREEN-NAME
               MOVE WO-NUM     TO WONUM-MSG WO-KEY
               PERFORM MESSAGE-SEARCH
               MOVE MSG-BUF    TO MSG-MSG-VWO
               MOVE SPACES     TO DBPARM-PAD
               MOVE ZONE       TO DBPARM-PAD
               MOVE MESSAGE-BUFFER TO ERRMSGV
               MOVE EQUIP-NUM  TO EQP-NUM-BUF
               PERFORM 2-LOAD-VWO
               MOVE SCREEN-BUF-VWO TO DISPLAY-REC
           ELSE
               MOVE "DISPPLAN" TO SCREEN-NAME
               MOVE WO-NUM-PLANNED TO WONUM-MSG WO-KEY
               PERFORM MESSAGE-SEARCH
               MOVE MSG-BUF    TO MSG-MSG-PWO
               MOVE SPACES     TO DBPARM-PAD
               MOVE ZONE-P     TO DBPARM-PAD
               MOVE MESSAGE-BUFFER TO ERRMSGP
               MOVE EQUIP-NUM-P TO EQP-NUM-BUF
               PERFORM 2-LOAD-PWO
               MOVE SCREEN-BUF-PWO TO DISPLAY-REC.

       1-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 0 OR 2 OR 8 OR 4
               GO TO 1-SHOWFORM.

           IF KEY-HIT = 5
               CALL "TDISPMES" USING DBPARAMETERS
                               MSG-AREA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN.

           IF KEY-HIT = 6
             IF RETURN-BYTE = "R"
                   GO TO END-OF-JOB
               ELSE
               MOVE "D"        TO CALL-SW
               CALL "CLEQPHIST" USING DBPARAMETERS
                                LINKAGE-DATA
               MOVE " "        TO CALL-SW
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN.

       END-OF-JOB.
           CLOSE               WO-MESSAGE-WO.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       2-LOAD-VWO.
           MOVE CUR-DATE-WA    TO CURDATE-VWO.
           IF DATE-FLAG = 3
               MOVE CUR-DATE-DD TO DATE-CVWO-MM
               MOVE CUR-DATE-MM TO DATE-CVWO-DD.

           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HRS       TO CT-HH-VWO.
           MOVE ":"            TO CT-FILL-VWO.
           MOVE TIME-MINS      TO CT-MM-VWO.
           MOVE WO-NUM         TO WO-NUM-VWO.
           MOVE WO-STATUS      TO WO-STATUS-VWO.
           MOVE WO-STRT-STATUS TO WO-TYPE-VWO.

           IF DATE-RECD = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-RECD-YY TO DR-YY-VWO
               MOVE DATE-RECD-MM TO DR-MM-VWO
               MOVE DATE-RECD-DD TO DR-DD-VWO
               IF DATE-FLAG = 3
                   MOVE DATE-RECD-DD TO DR-MM-VWO
                   MOVE DATE-RECD-MM TO DR-DD-VWO.

           MOVE TIME-RECD      TO TIME-RECD-VWO.
           MOVE APPROVAL-CODE  TO APPROVAL-VWO.
           MOVE REQUESTER-B    TO REQUESTER-VWO.
           MOVE EQUIP-NUM      TO EQUIP-NUM-VWO.
           MOVE EQUIP-NAME     TO EQUIP-NAME-VWO.
           MOVE TYPE-NUM       TO TYPE-NUM-VWO.
           MOVE DEPT           TO DEPT-VWO.
           MOVE ZONE           TO ZONE-VWO.
           MOVE LOCATION       TO LOCATION-VWO.
           MOVE PRIORITY       TO PRIORITY-VWO.
           MOVE EQUIP-DOWN     TO EQUIP-DOWN-VWO.
           MOVE CRAFTS-REQD-1  TO CRFT-REQD-1-VWO.
           MOVE CRAFTS-REQD-2  TO CRFT-REQD-2-VWO.
           MOVE CRAFTS-REQD-3  TO CRFT-REQD-3-VWO.
           MOVE EXP-CLASS      TO EXP-CLASS-VWO.
           MOVE DESCRIPTION-1  TO DESC-1-VWO.
           MOVE DESCRIPTION-2-1 TO DESC-2-VWO.
           MOVE DESCRIPTION-2-2 TO DESC-3-VWO.
           MOVE CRAFTSMEN-1    TO CRAFTSMEN-1-VWO.
           MOVE CRAFTSMEN-2    TO CRAFTSMEN-2-VWO.
           MOVE CRAFTSMEN-3    TO CRAFTSMEN-3-VWO.

           IF DATE-STRT = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-STRT-YY TO DS-YY-VWO
               MOVE DATE-STRT-MM TO DS-MM-VWO
               MOVE DATE-STRT-DD TO DS-DD-VWO
               IF DATE-FLAG = 3
                   MOVE DATE-STRT-DD TO DS-MM-VWO
                   MOVE DATE-STRT-MM TO DS-DD-VWO.

           IF DATE-STRT = "000000"
               MOVE SPACES     TO DATE-STRT-VWO.

           MOVE TIME-STRT      TO TIME-STRT-VWO.
           MOVE FAILURE-CODE   TO FAIL-CODE-VWO.

           IF DATE-COMP = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-COMP-YY TO DC-YY-VWO
               MOVE DATE-COMP-MM TO DC-MM-VWO
               MOVE DATE-COMP-DD TO DC-DD-VWO
               IF DATE-FLAG = 3
                   MOVE DATE-COMP-DD TO DC-MM-VWO
                   MOVE DATE-COMP-MM TO DC-DD-VWO.

           IF DATE-COMP = "000000"
               MOVE SPACES     TO DATE-COMP-VWO.

           MOVE TIME-COMP      TO TIME-COMP-VWO.

       2-LOAD-PWO.
           MOVE CUR-DATE-WA    TO CURDATE-PWO.
           IF DATE-FLAG = 3
               MOVE CUR-DATE-DD TO DATE-CPWO-MM
               MOVE CUR-DATE-MM TO DATE-CPWO-DD.

           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HRS       TO CT-HH-PWO.
           MOVE ":"            TO CT-FILL-PWO.
           MOVE TIME-MINS      TO CT-MM-PWO.

           MOVE WO-NUM-PLANNED TO WO-NUM-PWO.
           MOVE WO-STATUS-P    TO WO-STATUS-PWO.
           MOVE WO-START-STATUS TO WO-TYPE-PWO.

           IF DATE-RECD-P = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-RECD-P-YY TO DR-YY-PWO
               MOVE DATE-RECD-P-MM TO DR-MM-PWO
               MOVE DATE-RECD-P-DD TO DR-DD-PWO
               IF DATE-FLAG = 3
                   MOVE DATE-RECD-P-DD TO DR-MM-PWO
                   MOVE DATE-RECD-P-MM TO DR-DD-PWO.

           MOVE TIME-RECD-P    TO TIME-RECD-PWO.
           MOVE APPROVAL-CODE-P TO APPROVAL-PWO.
           MOVE REQUESTER-P    TO REQUESTER-PWO.
           MOVE EQUIP-NUM-P    TO EQUIP-NUM-PWO.
           MOVE EQUIP-NAME-P   TO EQUIP-NAME-PWO.
           MOVE TYPE-NUM-P     TO TYPE-NUM-PWO.
           MOVE DEPT-P         TO DEPT-PWO.
           MOVE ZONE-P         TO ZONE-PWO.
           MOVE LOCATION-P     TO LOCATION-PWO.
           MOVE PRIORITY-P     TO PRIORITY-PWO.
           MOVE RIME-P         TO RIME-PWO.
           MOVE EQUIP-DOWN-P   TO EQUIP-DOWN-PWO.
           MOVE EXP-CLASS-P    TO EXP-CLASS-PWO.

           IF DATE-REQD = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-REQD-P-YY TO DD-YY-PWO
               MOVE DATE-REQD-P-MM TO DD-MM-PWO
               MOVE DATE-REQD-P-DD TO DD-DD-PWO
               IF DATE-FLAG = 3
                   MOVE DATE-REQD-P-DD TO DD-MM-PWO
                   MOVE DATE-REQD-P-MM TO DD-DD-PWO.

           IF DATE-REQD = "000000"
               MOVE SPACES     TO DATE-REQD-PWO.

           MOVE TIME-REQD      TO TIME-REQD-PWO.
           MOVE DESCRIPTION-1-P TO DESC-1-PWO.
           MOVE DESCRIPTION-2-1-P TO DESC-2-PWO.
           MOVE DESCRIPTION-2-2-P TO DESC-3-PWO.
           MOVE DESCRIPTION-3-1-P TO DESC-4-PWO.
           MOVE DESCRIPTION-3-2-P TO DESC-5-PWO.
           MOVE SPECL-INSTR-1  TO DESC-6-PWO.
           MOVE SPECL-INSTR-2  TO DESC-7-PWO.
           MOVE SPECL-EQUIP    TO DESC-8-PWO.
           MOVE SAFETY-NOTE    TO DESC-9-PWO.
           MOVE ENGINEER-P     TO ENGR-PWO.
           MOVE PLANNER-P      TO PLANNER-PWO.
           MOVE SCHEDULER-P    TO SCHED-PWO.

           IF DATE-SCHD = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-SCHD-P-YY TO SD-YY-PWO
               MOVE DATE-SCHD-P-MM TO SD-MM-PWO
               MOVE DATE-SCHD-P-DD TO SD-DD-PWO
               IF DATE-FLAG = 3
                   MOVE DATE-SCHD-P-DD TO SD-MM-PWO
                   MOVE DATE-SCHD-P-MM TO SD-DD-PWO.

           IF DATE-SCHD = "000000"
               MOVE SPACES     TO DATE-SCHD-PWO.

           MOVE TIME-SCHD      TO TIME-SCHD-PWO.
           MOVE BUDGET-NO      TO BUDGET-PWO.
           MOVE REQUEST-NO     TO REQNO-PWO.

           IF DATE-STRT-P = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-STRT-P-YY TO DS-YY-PWO
               MOVE DATE-STRT-P-MM TO DS-MM-PWO
               MOVE DATE-STRT-P-DD TO DS-DD-PWO
               IF DATE-FLAG = 3
                   MOVE DATE-STRT-P-DD TO DS-MM-PWO
                   MOVE DATE-STRT-P-MM TO DS-DD-PWO.

           IF DATE-STRT = "000000"
               MOVE SPACES     TO DATE-STRT-PWO.

           MOVE TIME-STRT-P    TO TIME-STRT-PWO.
           MOVE FAILURE-CODE-P TO FAIL-CODE-PWO.
           MOVE PM-JOBPLAN-KEY TO JOBPLAN-NAME.
           MOVE PM-SCHEDULE-KEY TO MASTER-SCHED-NAME.

           IF DATE-COMP-P = SPACES
               NEXT SENTENCE
           ELSE
               MOVE DATE-COMP-P-YY TO DC-YY-PWO
               MOVE DATE-COMP-P-MM TO DC-MM-PWO
               MOVE DATE-COMP-P-DD TO DC-DD-PWO
               IF DATE-FLAG = 3
                   MOVE DATE-COMP-P-DD TO DC-MM-PWO
                   MOVE DATE-COMP-P-MM TO DC-DD-PWO.

           IF DATE-COMP = "000000"
               MOVE SPACES     TO DATE-COMP-PWO.

           MOVE TIME-COMP-P    TO TIME-COMP-PWO.

       MESSAGE-SEARCH.
           MOVE "NO MESSAGES " TO MSG-BUF.
           MOVE WO-KEY         TO TOWO OF WO-MESSAGE-WO.
           START WO-MESSAGE-WO KEY = TOWO OF WO-MESSAGE-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "MESSAGES    "  TO MSG-BUF.

      *************  END OF FILE - TDISPWO  ********************
