       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDISHIST.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
       DATE-WRITTEN.           NOVEMBER 1985.
      *C****************************************************************
      *C  2/23/93  WDR
      *C  INCREASED SIZE OF ACT-KEY FROM 9(4) TO 9(8) FOR RELATIVE
      *C  RECORD READS
      *C****************************************************************
      *C  2/25/93  JSB
      *C    ADDED "PR" AS A VALID STATUS, CHANGED ALL IF STMTS TO HAVE
      *C    "PR" ACT AS "SD" STATUS.
      *C****************************************************************
      *C  1/27/94  WDR
      *C  CHANGED SCREEN TO ALLOW SELECTION OF WORKORDER NUMBER TO BE
      *C  DISPLAYED BY CALLING TDISPWO
      *C****************************************************************
      *C  2/10/98  WDR
      *C  CHANGED PROGRAM TO ALLOW SELECTION OF EQUIPMENT GROUPS BY
      *C  PARTIAL EQUIPMENT NUMBER.
      *C****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA
                               C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1003
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-BASIC-WO
                  ASSIGN       TO DATABASE-MCFLMM1001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED-WO
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-BASIC-ZONE
                  ASSIGN       TO DATABASE-MCFLMM1004
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED-ZONE
                  ASSIGN       TO DATABASE-MCFLMM1108
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZDISHIST-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-HISTFILE
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS       ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1003.

       FD  WO-PLANNED
           LABEL RECORDS       ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1103.

       FD  WO-BASIC-WO
           LABEL RECORDS       ARE STANDARD.
       01  VWO-WOC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED-WO
           LABEL RECORDS       ARE STANDARD.
       01  PWOWOEC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-BASIC-ZONE
           LABEL RECORDS       ARE STANDARD.
       01  VWO-ZOC.
           COPY DDS-ALL-FORMATS OF MCFLMM1004.

       FD  WO-PLANNED-ZONE
           LABEL RECORDS       ARE STANDARD.
       01  PWO-ZOC.
           COPY DDS-ALL-FORMATS OF MCFLMM1108.

       FD  PRINT-FILE
           LABEL RECORD        IS OMITTED
           RECORD CONTAINS     79 CHARACTERS.
       01  PRINT-REC           PIC X(79).

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD     CONTAINS 67 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  WO-FLAG-OUT     PIC X.
           05  WO-NUM-OUT      PIC X(10).
           05  WO-STAT-OUT     PIC XX.
           05  WO-EQP-OUT      PIC X(06).
           05  WO-DESC-OUT     PIC X(30).
           05  WO-FC-OUT.
               10  FC-R-OUT    PIC XX.
               10  FC-SS-OUT   PIC XXXX.
           05  DATE-C-OUT.
               10  D-OUT-CC    PIC XX.
               10  D-OUT-YY    PIC XX.
               10  D-OUT-MM    PIC XX.
               10  D-OUT-DD    PIC XX.
           05  TIME-C-OUT      PIC XXXX.

       SD  SORT-FILE RECORD    CONTAINS 67 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  WO-FLAG-SORT    PIC X.
           05  WO-NUM-SORT.
               10  WO-NUM-S    PIC X(06).
               10  WO-NUM-YR   PIC X.
               10  WO-NUM-SUF  PIC X(03).
           05  WO-STAT-SORT    PIC XX.
           05  WO-EQP-SORT     PIC X(06).
           05  WO-DESC-SORT    PIC X(30).
           05  WO-FC-SORT.
               10  FC-R-SORT   PIC XX.
               10  FC-SS-SORT  PIC XXXX.
           05  DATE-C-SORT     PIC X(08).
           05  TIME-C-SORT     PIC XXXX.

       WORKING-STORAGE SECTION.
       77  FIELD-HOLD          PIC X(79).
       77  FIELD-CTR           PIC 99    VALUE 0.
       77  LINE-CTR            PIC 99     VALUE 60.
       77  PAGE-CTR            PIC 99     VALUE 0.
       77  EOF-SW              PIC 9     VALUE 0.
       77  DISPLAY-FLAG        PIC 9     VALUE 0.
       77  SORT-FLAG           PIC 9     VALUE 0.
       77  FIRST-PAGE-FLAG     PIC 9     VALUE 0.
       77  FILE-SW             PIC X     VALUE "B".
       77  START-SW            PIC X     VALUE " ".
           88  ZONE-KEY                  VALUE "Z".
           88  EQUIP-KEY                 VALUE "E".
           88  SEQN-KEY                  VALUE "S".
       77  PRINT-SW            PIC 9     VALUE 0.
           88  PRINT-SWITCH-IS-OFF       VALUE 0.
       77  WO-PARM             PIC X(10) VALUE SPACES.
       77  WORK-BUFFER         PIC X(34) VALUE SPACES.
       77  SUB                 PIC 9(04) COMP-4.
       77  ACT-KEY             PIC 9(08) COMP-4.
       77  MAX-KEY             PIC 9(08) COMP-4.
       77  ARW-SW              PIC X     VALUE SPACE.
       77  BASE                PIC X(16) VALUE "MMISA".
       77  DASH-LINE           PIC X(79)  VALUE ALL "-".
       77  FILE-STAT           PIC XX.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TDISHIST".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " K0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-1 PIC X(30) VALUE
                   "DISPLAY EQUIPMENT HISTORY FROM".
               10  PROG-DESC-2 PIC X(30) VALUE
                   " WORKORDER DISPLAY PROGRAM.   ".
               10  PROG-DESC-3 PIC X(30) VALUE
                   "SHOWS ALL VERBAL WORKORDERS FR".
               10  PROG-DESC-4 PIC X(30) VALUE
                   "OM SINGLE PIECE OF EQUIPMENT. ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "RUNS FROM f6 KEY FROM THE WO D".
               10  PROG-FUNCN2 PIC X(30) VALUE
                   "ISPLAY IN CRAFTSMAN EXECUTIVE.".
           05  PASSWORD-FLAG   PIC X.

       01  EQP-NUM-SORT.
           05  EQPS1           PIC X.
           05  EQPS2           PIC X.
           05  EQPS3           PIC X.
           05  EQPS4           PIC X.
           05  EQPS5           PIC X.
           05  EQPS6           PIC X.

       01  SCREEN-DATA.
           05  FIELD-1             PIC X(79).
           05  FIELD-2             PIC X(79).
           05  FIELD-3.
               10  FIELD-3-A       PIC X(20).
               10  FIELD-3-B       PIC X(59).
           05  FIELD-4.
               10  FIELD-4-A       PIC X(20).
               10  FIELD-4-B       PIC X(59).
           05  DATA-LINES          OCCURS 17 TIMES.
               10  DATA-LINE.
                   15  INFLD       PIC X.
                   15  B-P         PIC X.
                   15  DISPWO      PIC X(10).
                   15  FILLER      PIC X(57).
           05  FIELD-22            PIC X(79).
           05  FIELD-23            PIC X(79).
           05  CMDMSG              PIC X(79).
           05  ERRMSG              PIC X(79).

       01  DETAIL-REC.
           05  DISPFLD         PIC X.
           05  VP-CODE         PIC X.
           05  WO-NUM-BUF      PIC X(10).
           05  STAT-BUF        PIC XX.
           05  EQP-BUF         PIC X(06).
           05  DESC-BUF        PIC X(30).
           05  FC-BUF.
               10  FC-REASON   PIC XX.
               10  DASH-BUF    PIC X.
               10  FC-SS       PIC XXXX.
           05  DATEC-BUF.
               10  DATEC-MM    PIC XX.
               10  SLASH-1     PIC X.
               10  DATEC-DD    PIC XX.
               10  SLASH-2     PIC X.
               10  DATEC-YY    PIC XX.
           05  TIMEC-BUF       PIC XXXX.

       01  PRINT-DETAIL-REC.
           05  PVP-CODE        PIC X.
           05  PWO-NUM-BUF     PIC X(10).
           05  FILLER          PIC XX     VALUE SPACES.
           05  PSTAT-BUF       PIC XX.
           05  FILLER          PIC XX     VALUE SPACES.
           05  PEQP-BUF        PIC X(06).
           05  FILLER          PIC XX     VALUE SPACES.
           05  PDESC-BUF       PIC X(30).
           05  FILLER          PIC XX     VALUE SPACES.
           05  PFC-BUF.
               10  PFC-REASON  PIC XX.
               10  PDASH-BUF   PIC X.
               10  PFC-SS      PIC XXXX.
           05  FILLER          PIC XX     VALUE SPACES.
           05  PDATEC-BUF.
               10  PDATEC-MM   PIC XX.
               10  PSLASH-1    PIC X.
               10  PDATEC-DD   PIC XX.
               10  PSLASH-2    PIC X.
               10  PDATEC-YY   PIC XX.
           05  FILLER          PIC X      VALUE SPACES.
           05  PTIMEC-BUF      PIC XXXX.

       01  ZONE-ARGUMENT.
           05  Z-ARG           PIC X(4).
           05  FILLER          PIC XX   VALUE "1 ".

       01  CUR-DATE.
           05  CUR-YY          PIC X(02).
           05  CUR-MM          PIC X(02).
           05  CUR-DD          PIC X(02).

       01  TIME-BUFFER.
           05  TIME-BUF.
               10  HRS         PIC XX.
               10  MIN         PIC XX.
               10  SEC         PIC XX.
           05  TIME-EXP.
               10  TIME-H      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-M      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-S      PIC XX.

       01  DATE-HEADER.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "DATE:  ".
           05  P-DATE.
               10  P-DATE-MM   PIC X(02)  VALUE SPACES.
               10  FILLER      PIC X(01)  VALUE "/".
               10  P-DATE-DD   PIC X(02)  VALUE SPACES.
               10  FILLER      PIC X(01)  VALUE "/".
               10  P-DATE-YY   PIC X(02)  VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "TIME:  ".
           05  P-TIME          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE "PAGE:".
           05  ZPAGE           PIC ZZZ   VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.

       01  HEADING-1.
           05  FILLER  PIC X(16) VALUE "          W O R ".
           05  FILLER  PIC X(20) VALUE "K O R D E R   H I S ".
           05  FILLER  PIC X(18) VALUE "T O R Y   F O R   ".
           05  TAG-BUF PIC X(06).
           05  FILLER  PIC X(02) VALUE "  ".
           05  KEY-BUF PIC X(08).
           05  FILLER  PIC X(09) VALUE "         ".

       01  HEADING-2.
           05  FILLER      PIC X(20)   VALUE "                 An ".
           05  FILLER      PIC X(20)   VALUE "asterisk '*' indicat".
           05  FILLER      PIC X(20)   VALUE "es a Planned workord".
           05  FILLER      PIC X(19)   VALUE "er.                ".

       01  HEADING-3.
           05  FILLER      PIC X(20)   VALUE "   WO NUMBER STATUS ".
           05  FILLER      PIC X(20)   VALUE "    DESCRIPTION     ".
           05  FILLER      PIC X(20)   VALUE "               FAIL ".
           05  FILLER      PIC X(19)   VALUE "CODE   COMPLETED   ".

       01  HEADING-4.
           05  FILLER      PIC X(79) VALUE ALL "-".

       01  JCW-PARMS.
           05  TJCW            PIC  X(8) VALUE "TIMEOUT ".
           05  TJCWVAL         PIC S9(4) VALUE 0 COMP-4.
           05  TJCWSTAT        PIC S9(4) VALUE 0 COMP-4.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

           COPY VCOMAREA       IN COPYLIB.

           COPY OVRPFDATA      IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  LINKAGE-DATA.
           05  EQP-INPUT.
               10  EQP-NUM-BUF.
                   15  EQP1    PIC X.
                   15  EQP2    PIC X.
                   15  EQP3    PIC X.
                   15  EQP4    PIC X.
                   15  EQP5    PIC X.
                   15  EQP6    PIC X.
               10  EQP-TYP-BUF PIC X(08).
               10  EQP-ZON-BUF PIC X(04).
               10  EQP-DEP-BUF PIC X(04).
               10  EQP-SUB-BUF PIC X(04).
           05  SORT-SELECT.
               10  FC-SORT-BUF PIC X.
               10  WO-SORT-BUF PIC X.
               10  CD-SORT-BUF PIC X.
           05  PLANNED-SW      PIC X.
           05  CALL-SW         PIC X.

       PROCEDURE DIVISION      USING DBPARAMETERS
                               LINKAGE-DATA.

       INITIALIZATION          SECTION 01.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-BASIC.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          WO-BASIC-WO.
           OPEN INPUT          WO-PLANNED-WO.
           OPEN INPUT          WO-BASIC-ZONE.
           OPEN INPUT          WO-PLANNED-ZONE.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE EQP-NUM-BUF    TO KEY-BUF.
           MOVE " EQUIP"       TO TAG-BUF.
           IF KEY-BUF = SPACES
               MOVE EQP-ZON-BUF TO KEY-BUF
               MOVE " ZONE "    TO TAG-BUF.
           IF KEY-BUF = SPACES
               MOVE EQP-TYP-BUF TO KEY-BUF
               MOVE " TYPE "    TO TAG-BUF.
           IF KEY-BUF = SPACES
               MOVE EQP-DEP-BUF TO KEY-BUF
               MOVE " DEPT "    TO TAG-BUF.
           IF KEY-BUF = SPACES
               MOVE EQP-SUB-BUF TO KEY-BUF
               MOVE "SUBSYS"    TO TAG-BUF.

      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           GO TO BA-GET-DATA.

       END-OF-JOB.
           MOVE " "            TO RETURN-BYTE.
           CLOSE               OUT-FILE.
           CLOSE               WO-BASIC.
           CLOSE               WO-PLANNED.
           CLOSE               WO-BASIC-WO.
           CLOSE               WO-PLANNED-WO.
           CLOSE               WO-BASIC-ZONE.
           CLOSE               WO-PLANNED-ZONE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       BA-GET-DATA.
           MOVE 0              TO EOF-SW PRINT-SW.
           MOVE "N"            TO ARW-SW.
           MOVE " "            TO RETURN-BYTE.
           IF CALL-SW = " "
               MOVE "R"        TO RETURN-BYTE.

       BC-SORT-INPUT.
           MOVE 0              TO ACT-KEY PAGE-CTR.
           MOVE 60             TO LINE-CTR.
           IF FC-SORT-BUF = "S"
               SORT SORT-FILE  ASCENDING KEY
                               FC-SS-SORT
                               FC-R-SORT
                               DATE-C-SORT
                               WO-NUM-YR
                               WO-NUM-S
               INPUT PROCEDURE SORT-INPUT-RECORDS THRU SORT-IP-EXIT
              OUTPUT PROCEDURE SORT-WRITE-FILE THRU SORT-WF-EXIT
           ELSE
           IF FC-SORT-BUF NOT = SPACE
               SORT SORT-FILE  ASCENDING KEY
                               WO-FC-SORT
                               DATE-C-SORT
                               WO-NUM-YR
                               WO-NUM-S
               INPUT PROCEDURE SORT-INPUT-RECORDS THRU SORT-IP-EXIT
              OUTPUT PROCEDURE SORT-WRITE-FILE THRU SORT-WF-EXIT
           ELSE
           IF WO-SORT-BUF NOT = SPACE
               SORT SORT-FILE  ASCENDING KEY
                               WO-NUM-YR
                               WO-NUM-S
               INPUT PROCEDURE SORT-INPUT-RECORDS THRU SORT-IP-EXIT
              OUTPUT PROCEDURE SORT-WRITE-FILE THRU SORT-WF-EXIT
           ELSE
               SORT SORT-FILE  DESCENDING KEY
                               DATE-C-SORT
                               WO-FC-SORT
                               WO-NUM-YR
                               WO-NUM-S
               INPUT PROCEDURE SORT-INPUT-RECORDS THRU SORT-IP-EXIT
              OUTPUT PROCEDURE SORT-WRITE-FILE THRU SORT-WF-EXIT.

           IF ACT-KEY = 0
               MOVE SPACES     TO SCREEN-DATA
      **********************************************************************
      **    MESSAGE 040/011:
      **  NO RECORDS FOUND WHICH MATCH YOUR SELECTION
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  11        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-3-B
      **********************************************************************
      **    MESSAGE 042/071:
      **  PRESS 'ENTER' TO CONTINUE
      **********************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  71        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-4-B
               MOVE "FULLINPT" TO SCREEN-NAME
               MOVE "00"       TO SCREEN-STATUS
               MOVE SCREEN-DATA TO DISPLAY-REC
               WRITE DISPLAY-REC FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
               END-WRITE
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN WRITE ERROR   SCREEN-STATUS IS "
                               SCREEN-STATUS
                   GO TO END-OF-JOB
               END-IF
               READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
               END-READ
               IF SCREEN-STATUS NOT = "00"
                   DISPLAY "SCREEN READ ERROR   SCREEN-STATUS IS "
                               SCREEN-STATUS
                   GO TO END-OF-JOB
               END-IF
               GO TO END-OF-JOB.

       BD-DISPLAY-OUTPUT.
           OPEN INPUT          OUT-FILE.
           MOVE 0              TO ACT-KEY.
           MOVE "FULLINPT"     TO SCREEN-NAME.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE SPACES         TO SCREEN-DATA.

           PERFORM BDCA-HEADINGS.
           PERFORM BDC-MAIN    THRU BDC-EXIT UNTIL
                      ARW-SW = "Y".
           GO TO END-OF-JOB.

       BDC-MAIN.
           IF FIELD-CTR > 20
               MOVE 0          TO FIELD-CTR
      **********************************************************************
      **    MESSAGE 042/069:
      **  PRESS 'ENTER' TO CONTINUE OR PRESS APPROPRIATE FUNCTION KEY
      **********************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  69        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-23
               PERFORM BDC-SHOWFORM THRU BDC-S-EXIT
               PERFORM BDCA-HEADINGS
               GO TO BDC-EXIT.

           ADD 1               TO ACT-KEY.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
      **********************************************************************
      **    MESSAGE 031/062:
      **  END OF DATA - PRESS APPROPRIATE FUNCTION KEY
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  62        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-23
               PERFORM BDC-SHOWFORM THRU BDC-S-EXIT
               GO TO BDC-EXIT.

           READ OUT-FILE NEXT
               AT END
               MOVE 1          TO EOF-SW
      **********************************************************************
      **    MESSAGE 031/062:
      **  END OF DATA - PRESS APPROPRIATE FUNCTION KEY
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  62        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-23
               PERFORM BDC-SHOWFORM THRU BDC-S-EXIT.

           MOVE SPACES         TO DETAIL-REC.
           MOVE WO-FLAG-OUT    TO VP-CODE.
           MOVE WO-NUM-OUT     TO WO-NUM-BUF.
           MOVE WO-STAT-OUT    TO STAT-BUF.
           IF WO-EQP-OUT NOT = EQP-NUM-BUF
               MOVE WO-EQP-OUT TO EQP-BUF.
           MOVE WO-DESC-OUT    TO DESC-BUF.
           IF WO-FC-OUT NOT = SPACES
               MOVE FC-R-OUT   TO FC-REASON
               MOVE "-"        TO DASH-BUF
               MOVE FC-SS-OUT  TO FC-SS.
           IF DATE-C-OUT NOT = SPACES
               MOVE D-OUT-YY   TO DATEC-YY
               MOVE D-OUT-MM   TO DATEC-MM
               MOVE D-OUT-DD   TO DATEC-DD
               MOVE "/"        TO SLASH-1 SLASH-2
               MOVE TIME-C-OUT TO TIMEC-BUF
               IF DATE-FLAG = 3
                   MOVE D-OUT-DD TO DATEC-MM
                   MOVE D-OUT-MM TO DATEC-DD.
           MOVE DETAIL-REC     TO FIELD-HOLD.
           PERFORM BE-WRITE-FIELDS.

       BDC-EXIT.               EXIT.

       BDC-SHOWFORM.
           IF CALL-SW = "D"
               MOVE B"1"       TO IND(10).

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 5
               MOVE 1          TO PRINT-SW
               MOVE 0          TO FIRST-PAGE-FLAG
               CLOSE           OUT-FILE
               ACCEPT CUR-DATE FROM DATE
               MOVE CUR-YY     TO P-DATE-YY
               MOVE CUR-MM     TO P-DATE-MM
               MOVE CUR-DD     TO P-DATE-DD
               ACCEPT TIME-BUF FROM TIME
               MOVE HRS        TO TIME-H
               MOVE MIN        TO TIME-M
               MOVE SEC        TO TIME-S
               MOVE TIME-EXP   TO P-TIME
               GO TO BC-SORT-INPUT
           ELSE
           IF KEY-HIT = 0
               PERFORM DISPLAY-SEARCH
               IF DISPLAY-FLAG = 1
                   GO TO BDC-SHOWFORM
               ELSE
               IF EOF-SW = 0
                   NEXT SENTENCE
               ELSE
                   MOVE 1      TO KEY-HIT
                   MOVE "Y"    TO ARW-SW
           ELSE
               MOVE 1          TO KEY-HIT
               MOVE "Y"        TO ARW-SW.

           MOVE SPACES         TO SCREEN-DATA.

       BDC-S-EXIT.             EXIT.

       BDCA-HEADINGS.
           MOVE HEADING-1      TO FIELD-1.
           IF PLANNED-SW = "N"
               MOVE SPACES     TO FIELD-2
           ELSE
               MOVE HEADING-2  TO FIELD-2.
           MOVE HEADING-3      TO FIELD-3.
           MOVE HEADING-4      TO FIELD-4.
           MOVE 4              TO FIELD-CTR.
           MOVE SPACES         TO FIELD-22.
           IF CALL-SW = " "
      **********************************************************************
      **    MESSAGE 031/108:
      **  ENTER AN 'X' IN FRONT OF WORKORDER NUMBER TO DISPLAY WORKORDER
      **********************************************************************
               MOVE  31        TO CATREAD-MSG-SET
               MOVE 108        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO FIELD-22.

       BE-WRITE-FIELDS.
           ADD 1               TO FIELD-CTR.
           IF FIELD-CTR = 5
               MOVE FIELD-HOLD TO DATA-LINE(1)
           ELSE
           IF FIELD-CTR = 6
               MOVE FIELD-HOLD TO DATA-LINE(2)
           ELSE
           IF FIELD-CTR = 7
               MOVE FIELD-HOLD TO DATA-LINE(3)
           ELSE
           IF FIELD-CTR = 8
               MOVE FIELD-HOLD TO DATA-LINE(4)
           ELSE
           IF FIELD-CTR = 9
               MOVE FIELD-HOLD TO DATA-LINE(5)
           ELSE
           IF FIELD-CTR = 10
               MOVE FIELD-HOLD TO DATA-LINE(6)
           ELSE
           IF FIELD-CTR = 11
               MOVE FIELD-HOLD TO DATA-LINE(7)
           ELSE
           IF FIELD-CTR = 12
               MOVE FIELD-HOLD TO DATA-LINE(8)
           ELSE
           IF FIELD-CTR = 13
               MOVE FIELD-HOLD TO DATA-LINE(9)
           ELSE
           IF FIELD-CTR = 14
               MOVE FIELD-HOLD TO DATA-LINE(10)
           ELSE
           IF FIELD-CTR = 15
               MOVE FIELD-HOLD TO DATA-LINE(11)
           ELSE
           IF FIELD-CTR = 16
               MOVE FIELD-HOLD TO DATA-LINE(12)
           ELSE
           IF FIELD-CTR = 17
               MOVE FIELD-HOLD TO DATA-LINE(13)
           ELSE
           IF FIELD-CTR = 18
               MOVE FIELD-HOLD TO DATA-LINE(14)
           ELSE
           IF FIELD-CTR = 19
               MOVE FIELD-HOLD TO DATA-LINE(15)
           ELSE
           IF FIELD-CTR = 20
               MOVE FIELD-HOLD TO DATA-LINE(16)
           ELSE
           IF FIELD-CTR = 21
               MOVE FIELD-HOLD TO DATA-LINE(17).

       DISPLAY-SEARCH.
           MOVE 0              TO SUB DISPLAY-FLAG.
           PERFORM DISPLAY-LOOP THRU DS-EXIT
                               UNTIL SUB > 16.

       DISPLAY-LOOP.
           ADD 1               TO SUB.
           IF DISPWO(SUB) = SPACES
               GO TO DS-EXIT.

           MOVE "B"            TO FILE-SW.
           IF B-P(SUB) = "*"
               MOVE "P"        TO FILE-SW.

           IF INFLD(SUB) NOT = SPACE
               MOVE 1          TO DISPLAY-FLAG
               MOVE DISPWO(SUB) TO WO-PARM
               PERFORM DISPLAY-PROC THRU DP-EXIT
               MOVE SPACE      TO INFLD(SUB).

       DS-EXIT.                EXIT.

       DISPLAY-PROC.
           MOVE SPACES         TO WO-BASIC-DATA WO-PLANNED-DATA.
           MOVE WO-PARM        TO WONUM OF WO-BASIC-WO
                                  WONUM OF WO-PLANNED-WO.
           IF FILE-SW = "B"
               READ WO-BASIC-WO INTO WO-BASIC-DATA
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
           ELSE
               READ WO-PLANNED-WO INTO WO-PLANNED-DATA
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT.

           IF FILE-STAT NOT = "00"
               GO TO DP-EXIT.

           CALL "TDISPWO"      USING DBPARAMETERS
                               WO-BASIC-DATA
                               WO-PLANNED-DATA
                               FILE-SW.

       DP-EXIT.                EXIT.

       SORT-INPUT-RECORDS-SECT SECTION 04.
       SORT-INPUT-RECORDS.
           PERFORM SORT-MAIN   THRU SORT-M-EXIT.
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           IF EQP-ZON-BUF NOT = SPACES
               MOVE "Z"            TO START-SW
               MOVE EQP-ZON-BUF    TO Z-ARG
               MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-BASIC-ZONE
               START WO-BASIC-ZONE KEY NOT < ZONEPRTY OF WO-BASIC-ZONE
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-CONT
               END-IF
           ELSE
           IF EQP-NUM-BUF NOT = SPACES
               MOVE "E"            TO START-SW
               MOVE EQP-NUM-BUF    TO EQPNUM OF WO-BASIC
               START WO-BASIC      KEY NOT < EQPNUM OF WO-BASIC
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-CONT
               END-IF
           ELSE
               MOVE "S"            TO START-SW
               MOVE LOW-VALUES     TO WONUM OF WO-BASIC-WO
               START WO-BASIC-WO   KEY NOT < WONUM OF WO-BASIC-WO
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-CONT.

           IF ZONE-KEY
               PERFORM SORT-DBGET-B-Z THRU SORT-B-Z-EXIT
           ELSE
           IF EQUIP-KEY
               PERFORM SORT-DBGET-B-E THRU SORT-B-E-EXIT
           ELSE
           IF SEQN-KEY
               PERFORM SORT-DBGET-B-S THRU SORT-B-S-EXIT.

       SORT-M-CONT.
           IF PLANNED-SW = "N"
               GO TO SORT-M-EXIT.

           IF EQP-ZON-BUF NOT = SPACES
               MOVE "Z"            TO START-SW
               MOVE EQP-ZON-BUF    TO Z-ARG
               MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-PLANNED-ZONE
               START WO-PLANNED-ZONE
                   KEY NOT < ZONEPRTY OF WO-PLANNED-ZONE
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-EXIT
               END-IF
           ELSE
           IF EQP-NUM-BUF NOT = SPACES
               MOVE "E"            TO START-SW
               MOVE EQP-NUM-BUF    TO EQPNUM OF WO-PLANNED
               START WO-PLANNED    KEY NOT < EQPNUM OF WO-PLANNED
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-EXIT
               END-IF
           ELSE
               MOVE "S"            TO START-SW
               MOVE LOW-VALUES     TO WONUM OF WO-PLANNED-WO
               START WO-PLANNED-WO KEY NOT < WONUM OF WO-PLANNED-WO
                   INVALID KEY     MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = ZEROS
                   GO TO SORT-M-EXIT.

           IF ZONE-KEY
               PERFORM SORT-DBGET-P-Z THRU SORT-P-Z-EXIT
           ELSE
           IF EQUIP-KEY
               PERFORM SORT-DBGET-P-E THRU SORT-P-E-EXIT
           ELSE
           IF SEQN-KEY
               PERFORM SORT-DBGET-P-S THRU SORT-P-S-EXIT.


       SORT-M-EXIT.            EXIT.

       SORT-DBGET-B-Z.
           MOVE SPACES         TO SORT-REC.
           READ WO-BASIC-ZONE  NEXT INTO WO-BASIC-DATA
               AT END          GO TO SORT-B-Z-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-B-Z-EXIT.

           IF ZONE NOT = EQP-ZON-BUF
               GO TO SORT-B-Z-EXIT.

           IF WO-STATUS = "OO" OR "IP" OR "HM" OR
                          "CW" OR "DW" OR "FF"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-Z.

           IF EQP-TYP-BUF = TYPE-NUM OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-Z.

           IF EQP-DEP-BUF = DEPT OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-Z.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-Z.

           MOVE WO-NUM         TO WO-NUM-SORT.
           MOVE WO-STATUS      TO WO-STAT-SORT.
           MOVE EQUIP-NUM      TO WO-EQP-SORT.
           MOVE DESCRIPTION-1  TO WO-DESC-SORT.
           MOVE EQUIP-NUM-P    TO WO-EQP-SORT.
           MOVE FAILURE-CODE   TO WO-FC-SORT.
           MOVE DATE-COMP-CN   TO DATE-C-SORT.
           MOVE TIME-COMP      TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-B-Z.

       SORT-B-Z-EXIT.          EXIT.

       SORT-DBGET-B-E.
           MOVE SPACES         TO SORT-REC.
           READ WO-BASIC       NEXT INTO WO-BASIC-DATA
               AT END          GO TO SORT-B-E-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-B-E-EXIT.

           MOVE EQUIP-NUM      TO EQP-NUM-SORT.
           IF EQP1 NOT = EQPS1
               GO TO SORT-B-E-EXIT.

           IF EQP1 = EQPS1
             IF EQP2 = EQPS2 OR SPACE
               IF EQP3 = EQPS3 OR SPACE
                 IF EQP4 = EQPS4 OR SPACE
                   IF EQP5 = EQPS5 OR SPACE
                     IF EQP6 = EQPS6 OR SPACE
                         NEXT SENTENCE
                     ELSE
                     GO TO SORT-DBGET-B-E
                   ELSE
                   GO TO SORT-DBGET-B-E
                 ELSE
                 GO TO SORT-DBGET-B-E
               ELSE
               GO TO SORT-DBGET-B-E
             ELSE
             GO TO SORT-DBGET-B-E
           ELSE
           GO TO SORT-DBGET-B-E.

           IF WO-STATUS = "OO" OR "IP" OR "HM" OR
                          "CW" OR "DW" OR "FF"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-E.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-E.

           MOVE WO-NUM         TO WO-NUM-SORT.
           MOVE WO-STATUS      TO WO-STAT-SORT.
           MOVE EQUIP-NUM      TO WO-EQP-SORT.
           MOVE DESCRIPTION-1  TO WO-DESC-SORT.
           MOVE FAILURE-CODE   TO WO-FC-SORT.
           MOVE DATE-COMP-CN   TO DATE-C-SORT.
           MOVE TIME-COMP      TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-B-E.

       SORT-B-E-EXIT.          EXIT.

       SORT-DBGET-B-S.
           MOVE SPACES         TO SORT-REC.
           READ WO-BASIC-WO    NEXT INTO WO-BASIC-DATA
               AT END          GO TO SORT-B-S-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-B-S-EXIT.

           IF WO-STATUS = "OO" OR "IP" OR "HM" OR
                          "CW" OR "DW" OR "FF"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-S.

           IF EQP-TYP-BUF = TYPE-NUM OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-S.

           IF EQP-DEP-BUF = DEPT OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-S.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-B-S.

           MOVE WO-NUM         TO WO-NUM-SORT.
           MOVE WO-STATUS      TO WO-STAT-SORT.
           MOVE EQUIP-NUM      TO WO-EQP-SORT.
           MOVE DESCRIPTION-1  TO WO-DESC-SORT.
           MOVE FAILURE-CODE   TO WO-FC-SORT.
           MOVE DATE-COMP-CN   TO DATE-C-SORT.
           MOVE TIME-COMP      TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-B-S.

       SORT-B-S-EXIT.          EXIT.

       SORT-DBGET-P-Z.
           MOVE SPACES         TO SORT-REC.
           READ WO-PLANNED-ZONE NEXT INTO WO-PLANNED-DATA
               AT END          GO TO SORT-P-Z-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-P-Z-EXIT.

           IF ZONE-P NOT = EQP-ZON-BUF
               GO TO SORT-P-Z-EXIT.

           IF WO-STATUS-P = "OO" OR "IP" OR "SD" OR "HS" OR
                            "HM" OR "CW" OR "DW" OR "FF" OR "PR"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-Z.

           IF EQP-TYP-BUF = TYPE-NUM-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-Z.

           IF EQP-DEP-BUF = DEPT-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-Z.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-Z.

           MOVE "*"             TO WO-FLAG-SORT.
           MOVE WO-NUM-PLANNED  TO WO-NUM-SORT.
           MOVE WO-STATUS-P     TO WO-STAT-SORT.
           MOVE EQUIP-NUM-P    TO WO-EQP-SORT.
           MOVE DESCRIPTION-1-P TO WO-DESC-SORT.
           MOVE FAILURE-CODE-P  TO WO-FC-SORT.
           MOVE DATE-COMP-P-CN  TO DATE-C-SORT.
           MOVE TIME-COMP-P     TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-P-Z.

       SORT-P-Z-EXIT.          EXIT.

       SORT-DBGET-P-E.
           MOVE SPACES         TO SORT-REC.
           READ WO-PLANNED     NEXT INTO WO-PLANNED-DATA
               AT END          GO TO SORT-P-E-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-P-E-EXIT.

           MOVE EQUIP-NUM-P    TO EQP-NUM-SORT.
           IF EQP1 NOT = EQPS1
               GO TO SORT-P-E-EXIT.

           IF EQP1 = EQPS1
             IF EQP2 = EQPS2 OR SPACE
               IF EQP3 = EQPS3 OR SPACE
                 IF EQP4 = EQPS4 OR SPACE
                   IF EQP5 = EQPS5 OR SPACE
                     IF EQP6 = EQPS6 OR SPACE
                         NEXT SENTENCE
                     ELSE
                     GO TO SORT-DBGET-P-E
                   ELSE
                   GO TO SORT-DBGET-P-E
                 ELSE
                 GO TO SORT-DBGET-P-E
               ELSE
               GO TO SORT-DBGET-P-E
             ELSE
             GO TO SORT-DBGET-P-E
           ELSE
           GO TO SORT-DBGET-P-E.

           IF WO-STATUS-P = "OO" OR "IP" OR "SD" OR "HS" OR
                            "HM" OR "CW" OR "DW" OR "FF" OR "PR"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-E.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-E.

           MOVE "*"             TO WO-FLAG-SORT.
           MOVE WO-NUM-PLANNED  TO WO-NUM-SORT.
           MOVE WO-STATUS-P     TO WO-STAT-SORT.
           MOVE EQUIP-NUM-P    TO WO-EQP-SORT.
           MOVE DESCRIPTION-1-P TO WO-DESC-SORT.
           MOVE FAILURE-CODE-P  TO WO-FC-SORT.
           MOVE DATE-COMP-P-CN  TO DATE-C-SORT.
           MOVE TIME-COMP-P     TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-P-E.

       SORT-P-E-EXIT.          EXIT.

       SORT-DBGET-P-S.
           MOVE SPACES         TO SORT-REC.
           READ WO-PLANNED-WO  NEXT INTO WO-PLANNED-DATA
               AT END          GO TO SORT-P-S-EXIT.
           IF FILE-STAT NOT = ZEROS
               GO TO SORT-P-S-EXIT.

           IF WO-STATUS-P = "OO" OR "IP" OR "SD" OR "HS" OR
                            "HM" OR "CW" OR "DW" OR "FF" OR "PR"
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-S.

           IF EQP-TYP-BUF = TYPE-NUM-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-S.

           IF EQP-DEP-BUF = DEPT-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-S.

           IF EQP-SUB-BUF = FAIL-CODE-SUBSYS-P OR SPACES
               NEXT SENTENCE
           ELSE
               GO TO SORT-DBGET-P-S.

           MOVE "*"             TO WO-FLAG-SORT.
           MOVE WO-NUM-PLANNED  TO WO-NUM-SORT.
           MOVE WO-STATUS-P     TO WO-STAT-SORT.
           MOVE EQUIP-NUM-P    TO WO-EQP-SORT.
           MOVE DESCRIPTION-1-P TO WO-DESC-SORT.
           MOVE FAILURE-CODE-P  TO WO-FC-SORT.
           MOVE DATE-COMP-P-CN  TO DATE-C-SORT.
           MOVE TIME-COMP-P     TO TIME-C-SORT.
           RELEASE SORT-REC.
           GO TO SORT-DBGET-P-S.

       SORT-P-S-EXIT.          EXIT.

       SORT-IP-EXIT.           EXIT.

       SORT-WRITE-FILE-SECT    SECTION 05.
       SORT-WRITE-FILE.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-LOOP   THRU SORT-LOOP-EXIT.
           CLOSE               OUT-FILE.
           PERFORM SORT-PRINT-LOOP THRU SPL-EXIT.
           GO TO SORT-WF-EXIT.

       SORT-LOOP.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-LOOP-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-LOOP-EXIT.
           GO TO SORT-WRITE-FILE.

       SORT-LOOP-EXIT.         EXIT.

       SORT-PRINT-LOOP.
           IF PRINT-SWITCH-IS-OFF
               GO TO SPL-EXIT.

      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           MOVE 0              TO ACT-KEY.
           OPEN INPUT          OUT-FILE.
           OPEN OUTPUT         PRINT-FILE.

       PRINT-LOOP.
           IF LINE-CTR > 59
               PERFORM PRINT-HEADINGS.

           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE       INVALID KEY
               GO TO PL-EXIT.
           IF ACT-KEY > MAX-KEY
               GO TO PL-EXIT.

           MOVE SPACES         TO PRINT-DETAIL-REC.
           MOVE WO-FLAG-OUT    TO PVP-CODE.
           MOVE WO-NUM-OUT     TO PWO-NUM-BUF.
           MOVE WO-STAT-OUT    TO PSTAT-BUF.
           IF WO-EQP-OUT NOT = EQP-NUM-BUF
               MOVE WO-EQP-OUT TO PEQP-BUF.
           MOVE WO-DESC-OUT    TO PDESC-BUF.
           IF WO-FC-OUT NOT = SPACES
               MOVE FC-R-OUT   TO PFC-REASON
               MOVE "-"        TO PDASH-BUF
               MOVE FC-SS-OUT  TO PFC-SS.
           IF DATE-C-OUT NOT = SPACES
               MOVE D-OUT-YY   TO PDATEC-YY
               MOVE D-OUT-MM   TO PDATEC-MM
               MOVE D-OUT-DD   TO PDATEC-DD
               MOVE "/"        TO PSLASH-1 PSLASH-2
               MOVE TIME-C-OUT TO PTIMEC-BUF
               IF DATE-FLAG = 3
                   MOVE D-OUT-DD TO PDATEC-MM
                   MOVE D-OUT-MM TO PDATEC-DD.
           MOVE PRINT-DETAIL-REC TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           ADD  1              TO LINE-CTR.
           GO TO PRINT-LOOP.

       PL-EXIT.
           CLOSE               OUT-FILE.
           CLOSE               PRINT-FILE.
           MOVE 0              TO PRINT-SW.
           GO TO SPL-EXIT.

       PRINT-HEADINGS.
           ADD  1              TO PAGE-CTR.
           MOVE PAGE-CTR       TO ZPAGE.
           MOVE DATE-HEADER    TO PRINT-REC.
           IF FIRST-PAGE-FLAG = 0
               MOVE 1          TO FIRST-PAGE-FLAG
               WRITE PRINT-REC
           ELSE
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           MOVE DASH-LINE      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE FIELD-1        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE FIELD-2        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE FIELD-3        TO PRINT-REC
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE FIELD-4        TO PRINT-REC
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE DASH-LINE      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE 7              TO LINE-CTR.

       COPY OVRPFCALL IN COPYLIB.

       SPL-EXIT.               EXIT.

       SORT-WF-EXIT.           EXIT.

