000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TDISPDUPS.
      *C
      *C 09/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
      *SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
      *               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
001500     SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
004700 FD  PRINT-FILE
004800     RECORD CONTAINS 132 CHARACTERS
004900     DATA RECORD IS PRINTF.
005000 01  PRINTF                        PIC X(132).
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
       77  LINE-CTR                          PIC 99.
       77  SAVE-WO-NUM                       PIC X(10).
       77  SUB                               PIC 9(5).
       77  TOT-WO-CTR                        PIC 9(5).
003700 01  DBPARAMETERS.                    COPY DBPARMS OF COPYLIB.
       01  DETAIL-LINE.
           05  DETAIL-DEF-1.
               10  DETAIL-LIT-1              PIC X(60).
               10  FILLER                    PIC X.
               10  DETAIL-CTR-1              PIC 9(5).
               10  FILLER                    PIC X(14).
           05  DETAIL-DEF-2 REDEFINES DETAIL-DEF-1.
               10  DETAIL-WO-2               PIC X(10).
               10  FILLER                    PIC X.
               10  DETAIL-LIT-2A             PIC X(4).
               10  DETAIL-CTR-2              PIC 9(5).
               10  FILLER                    PIC X.
               10  DETAIL-LIT-2B             PIC X(10).
               10  FILLER                    PIC X(45).
       01  FILE-STATUS                       PIC XX.
       01  HEADER-1.
            05  FILLER           PIC X(10) VALUE "DUPLICATE ".
            05  FILLER           PIC X(12) VALUE "WORK ORDERS ".
            05  FILLER           PIC X(07) VALUE "ON THE ".
            05  FILLER           PIC X(11) VALUE "WO-PLANNED ".
            05  FILLER           PIC X(07) VALUE "DATASET".
            05  FILLER           PIC X(33) VALUE SPACES.
        01  HEADER-2.
             05  FILLER          PIC X(80) VALUE ALL "_".
       COPY IOFEEDBACK OF COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY DBSTAT OF COPYLIB.
       01  TABLE-WOS.
           05  T-WOS-DATA OCCURS 500 TIMES.
               10  DUPL-WO                   PIC X(10).
               10  DUPL-CTR                  PIC 9(4).
009400 01  WO-PLANNED-DATA.                 COPY DWOPLAN OF COPYLIB.
010000 PROCEDURE DIVISION.
010100 START-PROCESSING.
010200     PERFORM 1-HSK.
010300     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
010400 2-EOJ.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               WRITE PRINTF FROM HEADER-1 AFTER ADVANCING NEW-PAGE
               WRITE PRINTF FROM HEADER-2 AFTER ADVANCING 1 LINES
               ADD 2 TO LINE-CTR.
           MOVE SPACES TO DETAIL-LINE.
           MOVE "TOTAL WORK ORDERS READ = " TO DETAIL-LIT-1.
           MOVE TOT-WO-CTR TO DETAIL-CTR-1.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           IF DUPL-WO (1) = SPACES
               MOVE "NO WORK ORDER DUPLICATES ON THE FILE"
                   TO PRINTF
               WRITE PRINTF AFTER ADVANCING 1 LINES
           ELSE
           PERFORM 2-EOJ-DISPLAY VARYING SUB FROM 1 BY 1
               UNTIL (SUB > 500) OR (DUPL-WO (SUB) = SPACES).
           CLOSE WO-PLANNED-FILE.
           CLOSE PRINT-FILE.
011000     GOBACK.
       2-EOJ-DISPLAY.
           MOVE SPACES TO DETAIL-LINE.
           MOVE DUPL-WO (SUB) TO DETAIL-WO-2.
           MOVE "HAS " TO DETAIL-LIT-2A.
           MOVE DUPL-CTR (SUB) TO DETAIL-CTR-2.
           MOVE "DUPLICATES" TO DETAIL-LIT-2B.
           WRITE PRINTF FROM DETAIL-LINE AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               WRITE PRINTF FROM HEADER-1 AFTER ADVANCING NEW-PAGE
               WRITE PRINTF FROM HEADER-2 AFTER ADVANCING 1 LINES
               ADD 2 TO LINE-CTR.
      *    DISPLAY DUPL-WO (SUB) " HAS " DUPL-CTR (SUB) " DUPLICATES".
011100 1-HSK.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           MOVE SPACES TO SAVE-WO-NUM.
           MOVE 60 TO LINE-CTR.
           PERFORM 1-CLEAN-TABLE VARYING SUB FROM 1 BY 1
               UNTIL SUB > 500.
       1-CLEAN-TABLE.
           MOVE SPACES TO DUPL-WO (SUB).
           MOVE ZEROES TO DUPL-CTR (SUB).
023500 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE LOW-VALUES TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE "KEY PROBLEMS IN WO-PLANNED FILE" TO PRINTF
               WRITE PRINTF AFTER ADVANCING 0 LINES
               GO TO 2-EOJ.
           MOVE 0 TO TOT-WO-CTR.
       6-MAIN-LOOP.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 6-MAIN-EXIT.
           ADD 1 TO TOT-WO-CTR.
           IF SAVE-WO-NUM = SPACES
               MOVE WO-NUM-PLANNED TO SAVE-WO-NUM
           ELSE
           IF WO-NUM-PLANNED = SAVE-WO-NUM
               PERFORM 6-LOAD-DUPL-WO VARYING SUB FROM 1 BY 1
                   UNTIL (SUB > 500)
           ELSE
           MOVE WO-NUM-PLANNED TO SAVE-WO-NUM.
           GO TO 6-MAIN-LOOP.

       6-LOAD-DUPL-WO.
           IF WO-NUM-PLANNED = DUPL-WO (SUB)
               ADD 1 TO DUPL-CTR (SUB)
               MOVE 501 TO SUB
           ELSE
           IF DUPL-WO (SUB) = SPACES
               MOVE WO-NUM-PLANNED TO DUPL-WO (SUB)
               ADD 1 TO DUPL-CTR (SUB)
               MOVE 501 TO SUB.

       6-MAIN-EXIT.

       COPY OVRPFCALL IN COPYLIB.
