       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDLCODE.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NEWS-TABLE
                  ASSIGN TO DATABASE-MCFLMM2801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN TO DISK-DISTLIST
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

       DATA DIVISION.
       FILE SECTION.
       FD  NEWS-TABLE
           LABEL RECORDS ARE STANDARD.
       01  DL-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2801.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD CONTAINS 6 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  OUT-DCODE               PIC X(06).

       SD  SORT-FILE RECORD CONTAINS 6 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-DCODE              PIC X(06).

       WORKING-STORAGE SECTION.
       77  ACT-KEY                 PIC 9999   VALUE 0.
       77  MAX-KEY                 PIC 9999   VALUE 0.
       77  RECNO                   PIC 9999   VALUE 0.
       77  ARG-KEY                 PIC X(06).
       77  CODE-HOLD               PIC X(06)  VALUE SPACES.
       77  EOF-SW                  PIC 9      VALUE 0.
       77  TRUE-VAL                PIC 1      VALUE B"1".
       77  NEG-VAL                 PIC 1      VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDLCODE ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "LISTS DISTRIBUTION CODES FOR THE MMIS NEWS BULLETIN BOARD   ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "PROGRAM.  RUNS FROM THE f2 KEY OF THE DISTRIBUTION LIST     ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "MAINTENANCE MENU.                                           ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  HELP-DATA.
           05  HELP-SW             PIC 9(04) BINARY VALUE ZEROS.
           05  HELP-LOCA           PIC X(40).
           05  HELP-MSGLINE        PIC X(70).

       01  SCREEN-DATA.
           05  LOCA-ID                         PIC X(40).
           05  DISTRIBUTION-CODES.
               10  DCODE-1.
                   15  NUM-1                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-1                  PIC X(06).
               10  DCODE-9.
                   15  NUM-9                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-9                  PIC X(06).
               10  DCODE-17.
                   15  NUM-17                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-17                 PIC X(06).
               10  DCODE-25.
                   15  NUM-25                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-25                 PIC X(06).
               10  DCODE-33.
                   15  NUM-33                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-33                 PIC X(06).
               10  DCODE-41.
                   15  NUM-41                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-41                 PIC X(06).
               10  DCODE-2.
                   15  NUM-2                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-2                  PIC X(06).
               10  DCODE-10.
                   15  NUM-10                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-10                 PIC X(06).
               10  DCODE-18.
                   15  NUM-18                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-18                 PIC X(06).
               10  DCODE-26.
                   15  NUM-26                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-26                 PIC X(06).
               10  DCODE-34.
                   15  NUM-34                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-34                 PIC X(06).
               10  DCODE-42.
                   15  NUM-42                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-42                 PIC X(06).
               10  DCODE-3.
                   15  NUM-3                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-3                  PIC X(06).
               10  DCODE-11.
                   15  NUM-11                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-11                 PIC X(06).
               10  DCODE-19.
                   15  NUM-19                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-19                 PIC X(06).
               10  DCODE-27.
                   15  NUM-27                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-27                 PIC X(06).
               10  DCODE-35.
                   15  NUM-35                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-35                 PIC X(06).
               10  DCODE-43.
                   15  NUM-43                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-43                 PIC X(06).
               10  DCODE-4.
                   15  NUM-4                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-4                  PIC X(06).
               10  DCODE-12.
                   15  NUM-12                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-12                 PIC X(06).
               10  DCODE-20.
                   15  NUM-20                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-20                 PIC X(06).
               10  DCODE-28.
                   15  NUM-28                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-28                 PIC X(06).
               10  DCODE-36.
                   15  NUM-36                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-36                 PIC X(06).
               10  DCODE-44.
                   15  NUM-44                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-44                 PIC X(06).
               10  DCODE-5.
                   15  NUM-5                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-5                  PIC X(06).
               10  DCODE-13.
                   15  NUM-13                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-13                 PIC X(06).
               10  DCODE-21.
                   15  NUM-21                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-21                 PIC X(06).
               10  DCODE-29.
                   15  NUM-29                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-29                 PIC X(06).
               10  DCODE-37.
                   15  NUM-37                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-37                 PIC X(06).
               10  DCODE-45.
                   15  NUM-45                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-45                 PIC X(06).
               10  DCODE-6.
                   15  NUM-6                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-6                  PIC X(06).
               10  DCODE-14.
                   15  NUM-14                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-14                 PIC X(06).
               10  DCODE-22.
                   15  NUM-22                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-22                 PIC X(06).
               10  DCODE-30.
                   15  NUM-30                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-30                 PIC X(06).
               10  DCODE-38.
                   15  NUM-38                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-38                 PIC X(06).
               10  DCODE-46.
                   15  NUM-46                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-46                 PIC X(06).
               10  DCODE-7.
                   15  NUM-7                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-7                  PIC X(06).
               10  DCODE-15.
                   15  NUM-15                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-15                 PIC X(06).
               10  DCODE-23.
                   15  NUM-23                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-23                 PIC X(06).
               10  DCODE-31.
                   15  NUM-31                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-31                 PIC X(06).
               10  DCODE-39.
                   15  NUM-39                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-39                 PIC X(06).
               10  DCODE-47.
                   15  NUM-47                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-47                 PIC X(06).
               10  DCODE-8.
                   15  NUM-8                   PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-8                  PIC X(06).
               10  DCODE-16.
                   15  NUM-16                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-16                 PIC X(06).
               10  DCODE-24.
                   15  NUM-24                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-24                 PIC X(06).
               10  DCODE-32.
                   15  NUM-32                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-32                 PIC X(06).
               10  DCODE-40.
                   15  NUM-40                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-40                 PIC X(06).
               10  DCODE-48.
                   15  NUM-48                  PIC XXX.
                   15  FILLER                  PIC XX.
                   15  CODE-48                 PIC X(06).
           05  CODE-NUMBER.
               10  CNUM-1                      PIC X.
               10  CNUM-2                      PIC X.
           05  CNUM-99 REDEFINES CODE-NUMBER   PIC 99.
           05  HELP-LINE                       PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG                      PIC X(79).
               10  ERRMSG                      PIC X(79).

       01  DLIST-LINE.
           05  DIST-CC      PIC X(04).
           05  DIST-ZN      PIC X(04).
           05  DIST-CR      PIC X(02).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  DISTRIBUTION-TABLE.
           COPY DNEWSTBL       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  DLIST-DATA.
           05  DIST-CODE           PIC X(06).
           05  DIST-LOCA           PIC X(40).
           05  DIST-HELP           PIC X(70).

       PROCEDURE DIVISION USING DBPARAMETERS
                                DLIST-DATA.
       BEGIN-SORT SECTION 01.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO START-PROCESSING.
           GOBACK.

       START-PROCESSING.
           OPEN INPUT          NEWS-TABLE.
           OPEN I-O            DISPLAY-FILE.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE "VDLLIST"      TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE DIST-LOCA      TO LOCA-ID HELP-LOCA.
           MOVE DIST-HELP      TO HELP-LINE HELP-MSGLINE.
           MOVE SPACES         TO MESSAGE-BUFFER CODE-HOLD.
           MOVE 0              TO ACT-KEY MAX-KEY RECNO EOF-SW.

           SORT SORT-FILE ASCENDING KEY SORT-DCODE
               INPUT PROCEDURE SORT-INFILE
               OUTPUT PROCEDURE SORT-OUTFILE.

           IF ACT-KEY = 0
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE 1          TO EOF-SW
               MOVE TRUE-VAL   TO IND(99).

           MOVE 0              TO ACT-KEY.

       MAIN.
           OPEN INPUT          OUT-FILE.
           MOVE SPACES         TO CODE-NUMBER.
           IF EOF-SW = 1 AND MAX-KEY < 49
               GO TO SHOWFORM.

           IF EOF-SW = 1
               MOVE 0          TO ACT-KEY.

           MOVE 0              TO EOF-SW.
           MOVE SPACES         TO DISTRIBUTION-CODES.
           IF MSG-TEXT = SPACES PERFORM FILL-SCREEN THRU FS-EXIT
                               UNTIL EOF-SW > 0.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 5
               IF CODE-NUMBER = SPACES
                   GO TO SHOWFORM
               ELSE
                   PERFORM SUBF-CLEAR
                   PERFORM SETUP-GET-DLIST THRU SETUP-GDL-EXIT
                   MOVE SPACES TO MESSAGE-BUFFER
                   GO TO SHOWFORM.

           IF KEY-HIT = 7
               MOVE 60         TO HELP-SW
               CALL "TBBHELP" USING HELP-DATA
               MOVE "VDLLIST"  TO SCREEN-NAME
               GO TO SHOWFORM.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           MOVE SPACES         TO MESSAGE-BUFFER.
           GO TO MAIN.

       FILL-SCREEN.
           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 1-"          TO NUM-1.
           MOVE OUT-DCODE      TO CODE-1.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 2-"          TO NUM-2.
           MOVE OUT-DCODE      TO CODE-2.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 3-"          TO NUM-3.
           MOVE OUT-DCODE      TO CODE-3.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 4-"          TO NUM-4.
           MOVE OUT-DCODE      TO CODE-4.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 5-"          TO NUM-5.
           MOVE OUT-DCODE      TO CODE-5.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 6-"          TO NUM-6.
           MOVE OUT-DCODE      TO CODE-6.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 7-"          TO NUM-7.
           MOVE OUT-DCODE      TO CODE-7.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 8-"          TO NUM-8.
           MOVE OUT-DCODE      TO CODE-8.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE " 9-"          TO NUM-9.
           MOVE OUT-DCODE      TO CODE-9.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "10-"          TO NUM-10.
           MOVE OUT-DCODE      TO CODE-10.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "11-"          TO NUM-11.
           MOVE OUT-DCODE      TO CODE-11.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "12-"          TO NUM-12.
           MOVE OUT-DCODE      TO CODE-12.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "13-"          TO NUM-13.
           MOVE OUT-DCODE      TO CODE-13.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "14-"          TO NUM-14.
           MOVE OUT-DCODE      TO CODE-14.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "15-"          TO NUM-15.
           MOVE OUT-DCODE      TO CODE-15.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "16-"          TO NUM-16.
           MOVE OUT-DCODE      TO CODE-16.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "17-"          TO NUM-17.
           MOVE OUT-DCODE      TO CODE-17.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "18-"          TO NUM-18.
           MOVE OUT-DCODE      TO CODE-18.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "19-"          TO NUM-19.
           MOVE OUT-DCODE      TO CODE-19.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "20-"          TO NUM-20.
           MOVE OUT-DCODE      TO CODE-20.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "21-"          TO NUM-21.
           MOVE OUT-DCODE      TO CODE-21.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "22-"          TO NUM-22.
           MOVE OUT-DCODE      TO CODE-22.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "23-"          TO NUM-23.
           MOVE OUT-DCODE      TO CODE-23.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "24-"          TO NUM-24.
           MOVE OUT-DCODE      TO CODE-24.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "25-"          TO NUM-25.
           MOVE OUT-DCODE      TO CODE-25.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "26-"          TO NUM-26.
           MOVE OUT-DCODE      TO CODE-26.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "27-"          TO NUM-27.
           MOVE OUT-DCODE      TO CODE-27.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "28-"          TO NUM-28.
           MOVE OUT-DCODE      TO CODE-28.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "29-"          TO NUM-29.
           MOVE OUT-DCODE      TO CODE-29.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "30-"          TO NUM-30.
           MOVE OUT-DCODE      TO CODE-30.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "31-"          TO NUM-31.
           MOVE OUT-DCODE      TO CODE-31.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "32-"          TO NUM-32.
           MOVE OUT-DCODE      TO CODE-32.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "33-"          TO NUM-33.
           MOVE OUT-DCODE      TO CODE-33.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "34-"          TO NUM-34.
           MOVE OUT-DCODE      TO CODE-34.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "35-"          TO NUM-35.
           MOVE OUT-DCODE      TO CODE-35.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "36-"          TO NUM-36.
           MOVE OUT-DCODE      TO CODE-36.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "37-"          TO NUM-37.
           MOVE OUT-DCODE      TO CODE-37.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "38-"          TO NUM-38.
           MOVE OUT-DCODE      TO CODE-38.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "39-"          TO NUM-39.
           MOVE OUT-DCODE      TO CODE-39.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "40-"          TO NUM-40.
           MOVE OUT-DCODE      TO CODE-40.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "41-"          TO NUM-41.
           MOVE OUT-DCODE      TO CODE-41.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "42-"          TO NUM-42.
           MOVE OUT-DCODE      TO CODE-42.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "43-"          TO NUM-43.
           MOVE OUT-DCODE      TO CODE-43.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "44-"          TO NUM-44.
           MOVE OUT-DCODE      TO CODE-44.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "45-"          TO NUM-45.
           MOVE OUT-DCODE      TO CODE-45.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "46-"          TO NUM-46.
           MOVE OUT-DCODE      TO CODE-46.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "47-"          TO NUM-47.
           MOVE OUT-DCODE      TO CODE-47.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO FS-EXIT.
           MOVE "48-"          TO NUM-48.
           MOVE OUT-DCODE      TO CODE-48.
           MOVE 9              TO EOF-SW.

       FS-EXIT.    EXIT.

       SETUP-GET-DLIST.
           IF CNUM-2 = SPACE
               MOVE CNUM-1     TO CNUM-2
               MOVE "0"        TO CNUM-1.

           IF CNUM-1 = SPACE
               MOVE "0"        TO CNUM-1.

           IF CODE-NUMBER NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      **  INVALID ENTRY
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE 105        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           IF CNUM-99 < 1 OR > 48
      **********************************************************************
      **    MESSAGE 035/105:
      **  INVALID ENTRY
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE 105        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           IF CNUM-99 = 1
               IF CODE-1  NOT = SPACES
                   MOVE CODE-1 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 2
               IF CODE-2  NOT = SPACES
                   MOVE CODE-2 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 3
               IF CODE-3  NOT = SPACES
                   MOVE CODE-3 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 4
               IF CODE-4  NOT = SPACES
                   MOVE CODE-4 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 5
               IF CODE-5  NOT = SPACES
                   MOVE CODE-5 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 6
               IF CODE-6  NOT = SPACES
                   MOVE CODE-6 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 7
               IF CODE-7  NOT = SPACES
                   MOVE CODE-7 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 8
               IF CODE-8  NOT = SPACES
                   MOVE CODE-8 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 9
               IF CODE-9  NOT = SPACES
                   MOVE CODE-9 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 10
               IF CODE-10 NOT = SPACES
                   MOVE CODE-10 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 11
               IF CODE-11 NOT = SPACES
                   MOVE CODE-11 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 12
               IF CODE-12 NOT = SPACES
                   MOVE CODE-12 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 13
               IF CODE-13 NOT = SPACES
                   MOVE CODE-13 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 14
               IF CODE-14 NOT = SPACES
                   MOVE CODE-14 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 15
               IF CODE-15 NOT = SPACES
                   MOVE CODE-15 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 16
               IF CODE-16 NOT = SPACES
                   MOVE CODE-16 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 17
               IF CODE-17 NOT = SPACES
                   MOVE CODE-17 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 18
               IF CODE-18 NOT = SPACES
                   MOVE CODE-18 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 19
               IF CODE-19 NOT = SPACES
                   MOVE CODE-19 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 20
               IF CODE-20 NOT = SPACES
                   MOVE CODE-20 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 21
               IF CODE-21 NOT = SPACES
                   MOVE CODE-21 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 22
               IF CODE-22 NOT = SPACES
                   MOVE CODE-22 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 23
               IF CODE-23 NOT = SPACES
                   MOVE CODE-23 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 24
               IF CODE-24 NOT = SPACES
                   MOVE CODE-24 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 25
               IF CODE-25 NOT = SPACES
                   MOVE CODE-25 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 26
               IF CODE-26 NOT = SPACES
                   MOVE CODE-26 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 27
               IF CODE-27 NOT = SPACES
                   MOVE CODE-27 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 28
               IF CODE-28 NOT = SPACES
                   MOVE CODE-28 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 29
               IF CODE-29 NOT = SPACES
                   MOVE CODE-29 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 30
               IF CODE-30 NOT = SPACES
                   MOVE CODE-30 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 31
               IF CODE-31 NOT = SPACES
                   MOVE CODE-31 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 32
               IF CODE-32 NOT = SPACES
                   MOVE CODE-32 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 33
               IF CODE-33 NOT = SPACES
                   MOVE CODE-33 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 34
               IF CODE-34 NOT = SPACES
                   MOVE CODE-34 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 35
               IF CODE-35 NOT = SPACES
                   MOVE CODE-35 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 36
               IF CODE-36 NOT = SPACES
                   MOVE CODE-36 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 37
               IF CODE-37 NOT = SPACES
                   MOVE CODE-37 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 38
               IF CODE-38 NOT = SPACES
                   MOVE CODE-38 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 39
               IF CODE-39 NOT = SPACES
                   MOVE CODE-39 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 40
               IF CODE-40 NOT = SPACES
                   MOVE CODE-40 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 41
               IF CODE-41 NOT = SPACES
                   MOVE CODE-41 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 42
               IF CODE-42 NOT = SPACES
                   MOVE CODE-42 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 43
               IF CODE-43 NOT = SPACES
                   MOVE CODE-43 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 44
               IF CODE-44 NOT = SPACES
                   MOVE CODE-44 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 45
               IF CODE-45 NOT = SPACES
                   MOVE CODE-45 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 46
               IF CODE-46 NOT = SPACES
                   MOVE CODE-46 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 47
               IF CODE-47 NOT = SPACES
                   MOVE CODE-47 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

           IF CNUM-99 = 48
               IF CODE-48 NOT = SPACES
                   MOVE CODE-48 TO ARG-KEY
                   PERFORM GET-DLIST THRU GDL-EXIT
                   GO TO SETUP-GDL-EXIT
               ELSE
                   GO TO SETUP-GDL-EXIT.

       SETUP-GDL-EXIT.    EXIT.

       GET-DLIST.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE ARG-KEY        TO NEWSKEY OF NEWS-TABLE.
           START NEWS-TABLE    KEY = NEWSKEY OF NEWS-TABLE.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO GDL-EXIT.

       DBGET-DLIST.
           READ NEWS-TABLE NEXT INTO DISTRIBUTION-TABLE.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO GDL-CONT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "NEWS-TABLE" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO ERRMSG
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO GDL-EXIT.

           IF DIST-KEY NOT = ARG-KEY
               GO TO GDL-CONT.

           IF DIST-CC-NUM = "9999"
               MOVE SPACES     TO DIST-CC
           ELSE
              MOVE DIST-CC-NUM TO DIST-CC.

           MOVE DIST-ZONE      TO DIST-ZN.
           MOVE DIST-CRFT      TO DIST-CR.
           MOVE DLIST-LINE     TO DISPLAY-REC.
           ADD  1              TO RECNO.
           WRITE SUBFILE DISPLAY-REC FORMAT "RDSF"
               INDIC ARE SCREEN-INDICATORS.
           GO TO DBGET-DLIST.

       GDL-CONT.
           MOVE SPACES         TO CODE-NUMBER.
           WRITE DISPLAY-REC FORMAT "RDSB"
               INDIC ARE SCREEN-INDICATORS.
           MOVE B"1"           TO IND(76).
           IF RECNO > 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).
           MOVE ARG-KEY        TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC"
               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE FORMAT "RDSC"
               INDIC ARE SCREEN-INDICATORS.

       GDL-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               NEWS-TABLE.
           CLOSE               DISPLAY-FILE.
           CLOSE               OUT-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

       SUBF-CLEAR.
           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75) IND(76).
           MOVE TRUE-VAL       TO IND(77).
           MOVE SPACES         TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT "RDSC"
               INDIC ARE SCREEN-INDICATORS.
           MOVE NEG-VAL        TO IND(77).

       SORT-INFILE SECTION 02.
           MOVE LOW-VALUES     TO NEWSKEY OF NEWS-TABLE.
           START NEWS-TABLE    KEY > NEWSKEY OF NEWS-TABLE.
           PERFORM SORT-MAIN THRU SORT-M-EXIT.
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE SPACES         TO SORT-REC.
           READ NEWS-TABLE NEXT INTO DISTRIBUTION-TABLE
               AT END GO TO SORT-M-EXIT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
               GO TO SORT-M-EXIT
             ELSE
               MOVE "READ    " TO DB-FUNC
               MOVE "NEWS-TABLE" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               DISPLAY DB-ERROR
               GO TO SORT-M-EXIT.

           MOVE DIST-KEY       TO SORT-DCODE.
           RELEASE SORT-REC.
           GO TO SORT-MAIN.

       SORT-M-EXIT.    EXIT.

       SORT-IP-EXIT.    EXIT.

       SORT-OUTFILE SECTION 03.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-READ-LOOP THRU SRL-EXIT.
           CLOSE               OUT-FILE.
           GO TO SORT-OF-EXIT.

       SORT-READ-LOOP.
           RETURN SORT-FILE AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SRL-EXIT.
           IF SORT-REC = CODE-HOLD
               GO TO SORT-READ-LOOP.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC CODE-HOLD.
           WRITE OUT-REC INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SRL-EXIT.
           GO TO SORT-READ-LOOP.

       SRL-EXIT.    EXIT.

       SORT-OF-EXIT.    EXIT.
