       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TDLMAIN.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS. **** DISTRIBUTION LIST MAINTENANCE
      *                EXECUTIVE PROGRAM
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZBBNEW-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDLMAIN ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "MENU MODULE FOR MAINTAINING DISTRIBUTION LISTS IN THE MMIS  ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "NEWS BULLETIN BOARD SYSTEM.                                 ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM THE f6 KEY OF THE BULLETIN BOARD MENU.            ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  DL-LOCA-BUF         PIC X(40).
           05  DL-DIST-CODE        PIC X(06).
           05  DL-HELP-LINE        PIC X(70).
           05  SCREEN-MSGS.
               10  CMDMSG                      PIC X(79).
               10  ERRMSG                      PIC X(79).

       01  DLIST-DATA.
           05  DIST-CODE           PIC X(06).
           05  DIST-LOCA           PIC X(40).
           05  DIST-HELP           PIC X(70).

           COPY SCREENIO       IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  HELP-DATA.
           05  HELP-SW             PIC 9(04) BINARY.
           05  HELP-LOCA           PIC X(40).
           05  HELP-MSGLINE        PIC X(70).

       PROCEDURE DIVISION USING DBPARAMETERS
                                HELP-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE HELP-LOCA      TO DIST-LOCA DL-LOCA-BUF.
           MOVE HELP-MSGLINE   TO DIST-HELP DL-HELP-LINE.

       MAIN.
           MOVE "VDLMAIN"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 2
               CALL "CLDLCODE" USING DBPARAMETERS
                                     DLIST-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 8
               PERFORM GET-DLIST THRU GD-EXIT
               CALL "TDLUPDT" USING DBPARAMETERS
                                    DLIST-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   MOVE SPACES TO DL-DIST-CODE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 4
               PERFORM GET-DLIST THRU GD-EXIT
               CALL "TDLDEL" USING DBPARAMETERS
                                   DLIST-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   MOVE SPACES TO DL-DIST-CODE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 5
               PERFORM GET-DLIST THRU GD-EXIT
               CALL "TDLINIT" USING DBPARAMETERS
                                    DLIST-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   MOVE SPACES TO DL-DIST-CODE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 7
               MOVE 60         TO HELP-SW
               CALL "TBBHELP" USING HELP-DATA
               GO TO MAIN
           ELSE
               GO TO MAIN.

       GET-DLIST.
           MOVE "VDLCODE"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               MOVE SPACES     TO SCREEN-DATA
               GO TO MAIN.

           IF KEY-HIT NOT = 0
               GO TO GET-DLIST.

           IF DL-DIST-CODE = SPACES
               GO TO GET-DLIST.

           MOVE DL-DIST-CODE   TO DIST-CODE.

       GD-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.
