       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TDLTPIN.
       AUTHOR.        CA YODER.
       DATE-WRITTEN.  FEBRUARY 2004.

      ************************************************************
      ** THIS PROGRAM REMOVES ALL ITEMS FROM PIN REQUIREMENT    **
      ** ORDERS (IN MCFPAB2300).  THIS IS THE FIRST STEP IN     **
      ** DOWNLOADING UPDATED PIN PRICING INFORMATION ON THE     **
      ** REQUIREMENT ORDERS.                                    **
      ************************************************************
      *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MPLTINFO-I
               ASSIGN         TO DATABASE-MCFLCS0501
               ORGANIZATION   IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS    IS FILE-STATUS.

           SELECT VEN-FILE-I
               ASSIGN         TO DATABASE-MCFLAB2301
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT DPOITEM-IO
               ASSIGN         TO DATABASE-MCFLCS1002
               ORGANIZATION   IS INDEXED
                 ACCESS MODE  IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT DDAILYTC-IO
               ASSIGN         TO DATABASE-MCFLCS1601
               ORGANIZATION   IS INDEXED
                 ACCESS MODE  IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT DPODATAITM-IO
               ASSIGN         TO DATABASE-MCFLCS1101
               ORGANIZATION   IS INDEXED
                 ACCESS MODE  IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  VEN-FILE-I
           LABEL RECORDS ARE STANDARD.
       01  VEN-FILE-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLAB2301.

       FD  DPOITEM-IO
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-IO.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DDAILYTC-IO
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-IO.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DPODATAITM-IO
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-IO.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       WORKING-STORAGE SECTION.
       77  ITM-CTR                       PIC 9(6) VALUE 0.
       77  COMPANY-SAVE                  PIC X(3).
       77  PLT-ARG                       PIC X(4).

       COPY DTSPARMS2   IN COPYLIB.

      *****************************************************************
      **  D A T A B A S E   W O R K                                  **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT IN COPYLIB.

      *****************************************************************
      **  D A T A B A S E   B U F F E R S                            **
      *****************************************************************
       COPY MPLT0    IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.
       COPY DPOITEM  IN COPYLIB.
       COPY DVENPO   IN COPYLIB.
       COPY DDAILYTC IN COPYLIB.
       COPY TC32D    IN COPYLIB.
       COPY DPODATA  IN COPYLIB.

      *****************************************************************
      **  P R O C E D U R E   D I V I S I O N                        **
      *****************************************************************
       PROCEDURE DIVISION.
       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O    DPOITEM-IO
                       DDAILYTC-IO
                       DPODATAITM-IO
                INPUT  VEN-FILE-I
                       MPLTINFO-I.

           MOVE "P 01"                 TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-COMPANY   TO COMPANY-SAVE.

       2-EOJ.
           DISPLAY "# OF ITEMS DELETED:  " ITM-CTR.
           CLOSE DPOITEM-IO
                 VEN-FILE-I
                 DDAILYTC-IO
                 DPODATAITM-IO
                 MPLTINFO-I.

       6-MAIN.
           MOVE SPACES TO VENCDE OF VEN-FILE-REC-I
                          BUYERCDE OF VEN-FILE-REC-I.
           START VEN-FILE-I KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ VEN-FILE-I NEXT INTO BUF-DVENPO
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   PERFORM 61-READ-VEN-FILE UNTIL
                       FILE-STATUS NOT = "00".

       61-READ-VEN-FILE.
           MOVE DVENPO-PO-NUM TO PORCVNO OF DPOITEM-REC-IO.
           START DPOITEM-IO KEY = PORCVNO OF DPOITEM-REC-IO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ DPOITEM-IO NEXT INTO BUF-DPOITEM
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   PERFORM 62-DELETE-ITEMS
                       UNTIL ITM-PO-RCV-NO NOT = DVENPO-PO-NUM
                            OR FILE-STATUS NOT = "00".
           READ VEN-FILE-I NEXT INTO BUF-DVENPO
               AT END MOVE FILE-STATUS TO FILE-STATUS.

       62-DELETE-ITEMS.
           IF ITM-PIN-INDIC = "X"
               ADD 1 TO ITM-CTR
               PERFORM 63-WRITE-DDAILYTC
               DELETE DPOITEM-IO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-DELETE
               PERFORM 64-DELETE-DPODATAITM.
           READ DPOITEM-IO NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.

       63-WRITE-DDAILYTC.
           CALL "GETDTSTMP2" USING WS-SYSTEM-DATE-TIME2.
           MOVE WS-SYSTEM-DATE2-YMD   TO  DDAILYTC-DATE.
           MOVE WS-SYSTEM-TIME2       TO  DDAILYTC-TIME.
           MOVE "32D"                 TO  DDAILYTC-TC.
           MOVE COMPANY-SAVE          TO  DDAILYTC-PLT.
           MOVE ITM-CORP-CODE         TO  TC32D-CORP-CODE.
           MOVE ITM-PO-RCV-NO         TO  TC32D-PO-RLS.
           MOVE ITM-NUMBER            TO  TC32D-ITEM-NO.
           WRITE  DDAILYTC-REC-IO FROM BUF-DDAILYTC.

       64-DELETE-DPODATAITM.
           MOVE DVENPO-PO-NUM TO PORCVNO OF DPODATAITM-REC-IO.
           MOVE ITM-NUMBER    TO ITEMSEQNO OF DPODATAITM-REC-IO.
           START DPODATAITM-IO KEY >= EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ DPODATAITM-IO NEXT INTO BUF-DPODATAITM
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   PERFORM 65-DELETE-RECS
                       UNTIL DATAITM-PO-RCV-NO NOT = DVENPO-PO-NUM
                            OR DATAITM-ITEM-NO > ITM-NUMBER
                            OR FILE-STATUS NOT = "00".

       65-DELETE-RECS.
           DISPLAY "BUF-DPODATAITM:  " BUF-DPODATAITM.
           IF DATAITM-ITEM-NO = ITM-NUMBER
               DELETE DPODATAITM-IO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           READ DPODATAITM-IO NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.

