001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TDLYEXEC.
001300 AUTHOR.              C.A.KRIST.
001400*INSTALLATION.        GOODYEAR TIRE & RUBBER.
001500*DATE-WRITTEN.        JULY 6, 1983.
001600*SECURITY.            THIS PROGRAM IS UNDER NO SECURITY.
001700*REMARKS.             THIS IS THE MAIN PROGRAM FOR THE REPORT
001800*                     OF DAILY ACTIVITIES.  THIS PROGRAM READS
001900*                     THE R9-FILE CREATED BY THE USER THROUGH
002000*                     THE R9 SCREEN. IF OPTION = "A" THEN RUN
002100*                     THE FULL REPORT OF ALL ACTIVITY FOR ALL
002200*                     ALL DEPARTMENTS. "C" IS FOR A REPORT OF
002300*                     ISSUES AND RETURNS FOR DEPARTMENTS
002400*                     REQUESTED BY THE USER IN ORDER OF CHARGED
002500*                     DEPT. "R" IS FOR A REPORT OF ISSUES AND RETURNS
002600*                     FOR REQUESTED DEPTS IN ORDER OF REQUEST-
002700*                     ING DEPT. IF THE USER ENTERED "ALL" IN
002800*                     PLACE OF THE LIST OF DESIRED DEPTS THE
002900*                     REPORT WILL LIST ISSUES AND RETURNS FOR
003000*                     ALL DEPARTMENTS.
003100*
003200*    ON OCT 26, 1984, MODIFIED THIS PROGRAM TO CALL ONLY
003300*    "TCDLYAB2" INSTEAD OF "TCDLYAB2" AND "TCDLYCHG" AND
003400*    "TCDLYREQ".  THE PROGRAM "TCDLYAB2" HAS BEEN CHANGED TO
003500*    BE FLEXIBLE ENOUGH TO HANDLE THE "TCDLYCHG" REPORT (ONLY
003600*    ISSUE AND RETURN TRANSACTIONS SORTED BY CHARGE DEPT),
003700*    AND THE "TCDLYREQ" REPORT (ONLY ISSUE AND RETURN TRANSACTIONS
003800*    SORTED BY REQUESTING DEPT).  ALSO, THE BASE PARAMETER IS
003900*    ADDED TO THE PARAMETER LIST FOR THE CALL, SINCE THE MAIN
004000*    PROGRAM WILL NOW DO THE DBOPEN.  THIS IS BECAUSE THE CUTOFF
004100*    PROGRAM (TCDLYABS) WILL NOW BE CALLING THE PRINT SUBPROGRAM
004200*    (TCDLYAB2) - AND IT WILL ALREADY HAVE THE DB OPEN.  CIH.
004300*
004400*
      *C   08FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
004500 ENVIRONMENT DIVISION.
004600 CONFIGURATION SECTION.
004700 SOURCE-COMPUTER.  HP-3000.
004800 OBJECT-COMPUTER.  HP-3000.
004900 DATA DIVISION.
005000 WORKING-STORAGE SECTION.
005100
       77  MCXCBLERR-SCOPE              PIC X(1)  VALUE "C".

      *------ 8FEB1994 - COMMENTED OUT ALL TBLOWUP RELATED VARIABLES
      *------            AND LOGIC.  TBLOWUP CAN NEVER BE CALLED.
005200*** PARMS FOR CALL TO "TBLOWUP"
005300***
005400*01  BU-DISPLAY-MSG               PIC X(60) VALUE SPACES.
005500*01  BU-PGM-NAME                  PIC X(8)  VALUE "TDLYEXEC".
005600*01  BU-DISPLAY-AREA              PIC X(110) VALUE ALL "0".
005700*01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
005800*    05  BU-DISPLAY-LINE OCCURS 5 TIMES.
005900*        10  BU-DISPLAY-FLD        PIC X(14).
006000*        10  BU-DISPLAY-FLD9       PIC S9(8).
006100*01  DUMMY-KSAM-STAT               PIC X(2) VALUE "00".
006200*01  DUMMY-VIEW-AREA.
006300*    05  FILLER                    PIC X(118) VALUE ALL "0".
006400*    05  FILLER                    PIC S9(4) COMP VALUE 9999.
006500
006600*** PARM FOR CALL TO ANY SUBPROGRAM
006700
006800 01  RET-CODE                      PIC X(2)  VALUE SPACES.
006900
007000**************************************************************
007100**                                                          **
007200**            D A T A B A S E   W O R K                     **
007300**                                                          **
007400**************************************************************
007500
007600 01  BASE                       PIC X(16) VALUE "  STORES;".
007700 01  PASSWORD                   PIC X(8)  VALUE "JADE;   ".
007800 01  STATUS-AREA.
007900     05  COND-WORD              PIC S9(4) VALUE ZEROS   COMP.
008000     05  DATA-LENG              PIC S9(4) VALUE ZEROS   COMP.
008100     05  RCD-NO                 PIC S9(9) VALUE ZEROS   COMP.
008200     05  CHAIN-LENG             PIC S9(9) VALUE ZEROS   COMP.
008300     05  BKWD-ADDR              PIC S9(9) VALUE ZEROS   COMP.
008400     05  FWRD-ADDR              PIC S9(9) VALUE ZEROS   COMP.
008500
008600 01  MODE-AREA.
008700     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
008800
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  OPTION-AREA               PIC X(161).

008900************************************************************
009000*         P R O C E D U R E   D I V I S I O N              *
009100************************************************************
009400 PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-AREA.
009500
009600 PROGRAMM SECTION.
009700
009800 1-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
009900
010500     CALL "TCDLYAB2" USING RET-CODE, BASE, STATUS-AREA,
             HD-ROUTE-DATA, OPTION-AREA.
010600
010700     GOBACK.

      *------ 8FEB1994 - COMMENTED OUT ALL TBLOWUP RELATED VARIABLES
      *------            AND LOGIC.  TBLOWUP CAN NEVER BE CALLED.
010900*2100-BLOWUP.
011000*    CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
011100*      DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
011200*      BU-DISPLAY-FLDS.
