       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TDOCSET.
       AUTHOR.         W L MCINTYRE.
       DATE-WRITTEN.   JAN 1994.
       DATE-COMPILED.
      *REMARKS
      *D****************************************************************
      *D                      T  D  O  C  S  E  T                      *
      *D****************************************************************
      *D                                                               *
      *D  THIS UPDATE PROGRAM ALLOWS THE SYSTEM ADMINISTRATOR TO       *
      *D  WORK WITH SUB-SYSTEM DOCUMENTATION SELECTION STATUS FOR ALL  *
      *D  SUB-SYSTEMS RELATING TO A PRIMARY.  THIS PROGRAM GIVES THE   *
      *D  SYSTEM ADMINISTRATOR THE FLEXIBILITY TO CUSTOMIZE THE        *
      *D  APPLICATION TO ALLOW ONLY THE SUB-SYSTEM(S) WITH RELEVANT    *
      *D  ENHANCEMENTS FOR A RELEASE TO APPEAR TO THE USER.            *
      *D                                                               *
      *D  THE PROGRAM FIRST CALLS UP A SCREEN IN WHICH THE SYS ADMN    *
      *D  SELECTS THE PRIMARY SYSTEM, AT WHICH POINT A NEW SCREEN IS   *
      *D  DISPLAYED, LISTING ALL OF THE DEFINED SUB-SYSTEMS FOR THE    *
      *D  SELECTED PRIMARY SYSTEM.  THE SYSTEM ADMINISTRATOR CAN       *
      *D  THEN MAINTAIN THE SUB-SYSTEM'S STATUS FLAG BY ENTERING AN    *
      *D  'X' IN THAT FIELD TO TOGGLE BETWEEN "INCLUDE"ING A           *
      *D  SUB-SYSTEM TO APPEAR ON THE SYSTEM, OR "EXCLUDE"ING THE      *
      *D  SUB-SYSTEM.                                                  *
      *D                                                               *
      *D  THE SYSTEM ADMINSTRATOR MUST BE MADE WELL AWARE OF THE       *
      *D  FACT THAT "EXCLUDING" AN "INCLUDED" SUB-SYSTEM WILL NOT      *
      *D  DELETE ANY LINKED "CHILDREN" DETAIL RECORDS.  THE RECORDS,   *
      *D  HOWEVER, WILL NOT BE ABLE TO BE ACCESSED FROM A PROGRAM.     *
      *D  ACCESS TO THESE RECORDS CAN BE RE-ESTABLISHED BY             *
      *D  RE-"INCLUDE"ING THE SUB-SYSTEM.                              *
      *D                                                               *
      *D****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDOCSYS-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT MSUBHDR
               ASSIGN TO DATABASE-MCFLDS0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MSUBHDR-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       FD  MSUBHDR
           LABEL RECORDS ARE STANDARD.
       01  MSUBHDR-REC.
           COPY DDS-ALL-FORMATS OF MCFLDS0101.

       WORKING-STORAGE SECTION.

      *----------------------------------------------------------------
      *    B U F F E R S
      *----------------------------------------------------------------
       01  MESSAGE-BUFFER.
           05  FILLER                  PIC X(80).

       01  INPUT-BUF.
           05  WS-SELCSIS                  PIC X(01) VALUE SPACES.
           05  WS-SELMMIS                  PIC X(01) VALUE SPACES.
           05  WS-SELCSAS                  PIC X(01) VALUE SPACES.
           05  WS-SELREQS                  PIC X(01) VALUE SPACES.
           05  WS-SELDP                    PIC X(01) VALUE SPACES.
           05  SEL-INPUT-TABLE.
               10  SEL-INPUT OCCURS 15 TIMES.
                   15  WS-INPUT            PIC X(01) VALUE SPACES.
           05  WS-EXCRESP                  PIC X(01) VALUE SPACES.

       COPY MSUBHDR OF COPYLIB.

       01  WS-SCREEN.
           05  WS-ERRMSG               PIC X(79).
           05  WS-CSIS                 PIC X(01).
           05  WS-MMIS                 PIC X(01).
           05  WS-CSAS                 PIC X(01).
           05  WS-REQS                 PIC X(01).
           05  WS-DP                   PIC X(01).
           05  SUBSYSRECS OCCURS 15 TIMES.
               10  WS-SELECT           PIC X(01).
               10  WS-SUBSYS           PIC X(08).
               10  WS-STATUS           PIC X(03).
           05  WS-CMDMSG               PIC X(79).

      *----------------------------------------------------------------
      *    C O P Y   M E M B E R    A R E A S
      *----------------------------------------------------------------
       COPY CATREAD OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY WSCONTROL OF COPYLIB.

       COPY CPYIND OF COPYLIB.

       COPY IOFEEDBACK OF COPYLIB.

       01  SYSTEM-TABLE.
           COPY PRISYSVAL OF COPYLIB.
       01  SYSTEM-NUM                   PIC 9(05).

      *----------------------------------------------------------------
      *    D A T A B A S E   K E Y S  -   S T A T U S   F I E L D S
      *----------------------------------------------------------------
       01  MSUBHDR-KEY.
           05  MSUBHDR-5                PIC X(05).
           05  MSUBHDR-8                PIC X(08).

       01  MSUBHDR-STATUS               PIC XX VALUE SPACES.
       01  DSPLY-STATUS                 PIC XX.

      *----------------------------------------------------------------
      *    D I S P L A Y   S C R E E N   D A T A   A R E A
      *----------------------------------------------------------------
       01  FZDOCSYS.
           COPY DD-ALL-FORMATS OF ZDOCSYS.

      *----------------------------------------------------------------
      *    L I T E R A L S
      *----------------------------------------------------------------
       01  FALS-VAL                    PIC 1 VALUE B"0".
       01  TRUE-VAL                    PIC 1 VALUE B"1".
       01  INCLUDE-LIT                  PIC X(03) VALUE "INC".
       01  EXCLUDE-LIT                  PIC X(03) VALUE "EXC".

      *----------------------------------------------------------------
      *    P A G I N G   I N F O   A R E A
      *----------------------------------------------------------------
       01  PAGE-NO                      PIC 9(02)  VALUE ZEROS.
       01  CURRENT-KEY.
           05  CK-5                     PIC X(05)  VALUE SPACES.
           05  CK-8                     PIC X(08)  VALUE SPACES.
       01  NEXT-KEY.
           05  NK-5                     PIC X(05)  VALUE SPACES.
           05  NK-8                     PIC X(08)  VALUE SPACES.

      *----------------------------------------------------------------
      *    S A V E   A R E A S
      *----------------------------------------------------------------
       01  SEL-COUNT                   PIC 99 COMP-3  VALUE ZEROS.
       01  SAVE-SEL-COUNT              PIC 99 COMP-3  VALUE ZEROS.
       01  INCREMENT-VALUE             PIC 99 COMP-3  VALUE ZEROS.
       01  SAVE-KEYS-15.
           05  SAVE-ENTRY          OCCURS 15 TIMES.
               10  SAVE-KEY        PIC X(13)  VALUE SPACES.
       01  WS-SYSTEM                       PIC X(05) VALUE SPACES.

       01  SAVE-SUBHDR.
           05 SAVE-SUBHDR-RECORD OCCURS 15 TIMES PIC X(1110).

      *----------------------------------------------------------------
      *    S U B S C R I P T S
      *----------------------------------------------------------------
       01  S1                          PIC 99 COMP-3  VALUE ZEROS.
       01  S2                          PIC 99 COMP-3  VALUE ZEROS.
       01  S3                          PIC 99 COMP-3  VALUE ZEROS.

      *----------------------------------------------------------------
      *    S W I T C H E S
      *----------------------------------------------------------------
       01  SWITCHES.
           05  CONTINUE-SW             PIC X     VALUE "Y".
           05  COPY-SW                 PIC X     VALUE "N".
           05  INVALID-SW              PIC X     VALUE "N".
           05  ALL-SEL-EMPTY-SW        PIC X     VALUE "N".
           05  SEL-NOT-X-SW            PIC X     VALUE "N".
           05  LIST-RECS-SW            PIC X     VALUE " ".
           05  NEXT-PAGE-SW            PIC X     VALUE "N".
           05  PREV-PAGE-SW            PIC X     VALUE "N".

      *----------------------------------------------------------------
      *    M I S C E L L A N E O U S
      *----------------------------------------------------------------
       01  CUR-DATE-WA.
           05  CUR-DATE-YY             PIC XX.
           05  C-D-YY-9 REDEFINES CUR-DATE-YY.
               10  FILLER              PIC X.
               10  C-D-WA-Y            PIC 9.
           05  FILLER                  PIC X(4).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDOCSET ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " H0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
             "MAINTENANCE PROGRAM WHICH UPDATES SUBSYSTEM DATABASE    ".
               10  PROG-DESC-B     PIC X(60) VALUE
             "TO DESIGNATE SUBSYSTEM'S WHICH WILL HAVE DOCUMENTATION  ".
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  ERROR-MESSAGE-TABLE.
           05  ERROR-VALUES.
               10  FILLER              PIC X(74)   VALUE
           " CANNOT SELECT MORE THAN ONE PRIMARY SYSTEM             ".
               10  FILLER              PIC X(74)   VALUE
           " MUST SELECT ONE PRIMARY SYSTEM                         ".
               10  FILLER              PIC X(74)   VALUE
           " CANNOT PAGE BACKWARDS - AT TOP OF LIST                 ".
               10  FILLER              PIC X(74)   VALUE
           " CANNOT PAGE FORWARD - AT BOTTOM OF LIST                ".
               10  FILLER              PIC X(74)   VALUE
           " MUST SELECT ONE SUSBSYTEM                              ".
               10  FILLER              PIC X(74)   VALUE
           " CAN ONLY SELECT ONE SUBSYSTEM                          ".
               10  FILLER              PIC X(74)   VALUE
           " SELECT FIELD MUST BE A 'X'                             ".
               10  FILLER              PIC X(74)   VALUE
           " RECORD SELECTED NO LONGER EXISTS - F5 TO START OVER    ".
               10  FILLER              PIC X(74)   VALUE
           " PAGING NOT ALLOWED WHILE UPDATING RECORD               ".
               10  FILLER              PIC X(74)   VALUE
           " MUST ENTER A RESPONSE                                  ".
               10  FILLER              PIC X(74)   VALUE
           " CANNOT RESET LIST WHILE  UPDATING RECORD               ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
               10  FILLER              PIC X(74)   VALUE
           "                                                        ".
           05  ERROR-MESSAGE   REDEFINES  ERROR-VALUES
               OCCURS 20  TIMES  PIC X(74).

      *----------------------------------------------------------------
      *    M A I N    P R O C E D U R E
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
           OPEN I-O DISPLAY-FILE.
       INIT-SEL-SCREEN.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           IF CONTINUE-SW = "N"
              GO TO END-PROGRAM.
           PERFORM 6-MAIN THRU 6-EXIT.
           IF CONTINUE-SW = "Y"
              GO TO INIT-SEL-SCREEN.
       END-PROGRAM.
           PERFORM 2-END-OF-JOB THRU 2-EXIT.

       1-HOUSEKEEPING.
           ACCEPT CUR-DATE-WA FROM DATE.
           MOVE SPACES TO INPUT-BUF WS-SCREEN FZDOCSYS.
           MOVE ALL B"0" TO INDICS.
           MOVE "FDOCSET" TO VIEW-CFNAME.
           PERFORM 10-GET-SYSTEM THRU 10-EXIT.
           IF CONTINUE-SW = "N"
              GO TO 1-EXIT.
           PERFORM 11-INIT-LIST THRU 11-EXIT.

       1-EXIT.
           EXIT.

       10-GET-SYSTEM.
      *----SELECT THE PRIMARY SYSTEM TO WORK WITH.  PF3 TO EXIT PGM.
      *----CAN SELECT ONLY ONE SYSTEM, SELECT FIELD MUST BE AN "X"
           PERFORM 5-PRINT-SCREEN.
           IF VIEW-LASTKEY = 3
              MOVE "N" TO CONTINUE-SW
              GO TO 10-EXIT.
           MOVE ZEROS TO SEL-COUNT.
           MOVE SPACES TO SEL-NOT-X-SW.
           IF SELCSIS OF FDOCSET-I NOT EQUAL SPACES
              MOVE 1 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELCSIS OF FDOCSET-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELMMIS OF FDOCSET-I NOT EQUAL SPACES
              MOVE 2 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELMMIS OF FDOCSET-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELCSAS OF FDOCSET-I NOT EQUAL SPACES
              MOVE 3 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELCSAS OF FDOCSET-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELREQS OF FDOCSET-I NOT EQUAL SPACES
              MOVE 4 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELREQS OF FDOCSET-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELDP   OF FDOCSET-I NOT EQUAL SPACES
              MOVE 5 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELDP   OF FDOCSET-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           MOVE FALS-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                            INDS (38) INDS (99).
           IF SEL-COUNT GREATER THAN 1
              MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                               INDS (38) INDS (99)
              MOVE ERROR-MESSAGE (01) TO ERRMSG OF FDOCSET-O
              GO TO 10-GET-SYSTEM
           ELSE
              IF SEL-COUNT LESS THAN 1
                MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                                 INDS (38) INDS (99)
                MOVE ERROR-MESSAGE (02) TO ERRMSG OF FDOCSET-O
                GO TO 10-GET-SYSTEM.
           IF SEL-NOT-X-SW = "Y"
              MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                               INDS (38) INDS (99)
              MOVE ERROR-MESSAGE (07) TO ERRMSG OF FDOCSET-O
              GO TO 10-GET-SYSTEM.

       10-EXIT.
           EXIT.

       11-INIT-LIST.
      *----GET SUB-SYSTEMS FOR PRIMARY SYSTEM SELECTED BY USING SYSTEM
      *----TABLE FOR HIGH-LEVEL KEY FIELD, LOW-VALUES FOR LOWER-LEVEL
      *----KEY FIELD.
           OPEN I-O   MSUBHDR.
           MOVE SPACES TO INPUT-BUF WS-SCREEN FZDOCSYS.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE SYSTEM-NAME (SYSTEM-NUM) TO MSUBHDR-5
                                            WS-SYSTEM.
           MOVE LOW-VALUES               TO MSUBHDR-8.
           MOVE MSUBHDR-KEY TO CURRENT-KEY.
           MOVE LOW-VALUES  TO NEXT-KEY.
           MOVE SPACES TO NEXT-PAGE-SW PREV-PAGE-SW.
           MOVE 1                    TO PAGE-NO.
           PERFORM 110-START-LIST THRU 110-EXIT.

       11-EXIT.
           EXIT.

       110-START-LIST.
           MOVE SPACES      TO LIST-RECS-SW.
           MOVE ALL B"0" TO INDICS.
           MOVE MSUBHDR-5   TO SYSTEM OF MSUBHDR-REC.
           MOVE MSUBHDR-8   TO SUBSYS OF MSUBHDR-REC.
           START MSUBHDR
               KEY IS NOT LESS THAN SYSTEM OF MSUBHDR-REC,
                                    SUBSYS OF MSUBHDR-REC
                 INVALID KEY
                   MOVE "N" TO LIST-RECS-SW.
           PERFORM 1100-INIT-VALUES THRU 1100-EXIT
               VARYING S1 FROM 1 BY 1 UNTIL S1 > 15.
           MOVE 1 TO S1.
           IF LIST-RECS-SW NOT EQUAL TO  "N"
              PERFORM 1101-SUBSYS-LIST THRU 1101-EXIT
                 UNTIL S1 > 16.
           MOVE WS-SCREEN TO FDOCSET-O.

       110-EXIT.
           EXIT.

       1100-INIT-VALUES.
           MOVE SPACES TO SUBSYSRECS (S1).

       1100-EXIT.
           EXIT.

       1101-SUBSYS-LIST.
           READ MSUBHDR NEXT RECORD
               INTO BUF-MSUBHDR
               WITH NO LOCK
               AT END
                 MOVE 17 TO S1
                 GO TO 1101-EXIT.
           IF SYSTEM OF MSUBHDR-REC NOT EQUAL MSUBHDR-5
             MOVE 17 TO S1
             GO TO 1101-EXIT.
           IF S1 = 16
      *----OVERFLOW FOR THIS SCREEN, SAVE KEY TO START NEXT PAGE
              MOVE "Y" TO NEXT-PAGE-SW
              MOVE  SYSTEM OF MSUBHDR-REC TO NK-5
              MOVE  SUBSYS OF MSUBHDR-REC TO NK-8
              MOVE 17  TO S1
              GO TO 1101-EXIT
           ELSE
              MOVE SPACES                  TO  WS-SELECT (S1)
              MOVE SUBSYS OF MSUBHDR-REC   TO  WS-SUBSYS (S1)
              IF INCLSUB = "Y"
                 MOVE INCLUDE-LIT          TO  WS-STATUS (S1)
              ELSE
                 MOVE EXCLUDE-LIT          TO  WS-STATUS (S1)
              END-IF
              MOVE MSUBHDR-REC    TO  SAVE-SUBHDR-RECORD (S1)
              ADD +15 TO S1 GIVING S2
              MOVE TRUE-VAL              TO  INDS (S2)
      *----SAVE DATA FOR FIRST RECORD OF EACH SCREEN TO PAGE BACKWARD
              IF S1 = 1
                 MOVE MSUBHDR-REC TO SAVE-KEY (PAGE-NO)
              END-IF
              ADD 1 TO S1
           END-IF.

       1101-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE MSUBHDR.
           GOBACK.

       2-EXIT.
           EXIT.

       30-READ-MSUBHDR.
           READ MSUBHDR
             INTO BUF-MSUBHDR
             INVALID KEY
               MOVE "Y" TO INVALID-SW
             NOT INVALID
               MOVE "N" TO INVALID-SW.

       30-EXIT.
           EXIT.

       5-PRINT-SCREEN.
             MOVE FZDOCSYS TO DSPLY-REC.
             PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
             PERFORM 98-SCREEN-READ  THRU 98-EXIT.
             MOVE DSPLY-REC TO FZDOCSYS.

       5-EXIT.
           EXIT.

       6-MAIN.
      *----SET INDICATORS ON TO LOCK PRIMARY SYSTEM SELECT FIELDS
           MOVE TRUE-VAL TO INDS (15) INDS (34) INDS (35) INDS (36)
                            INDS (37) INDS (38).
           PERFORM 60-SET-PAGING-INDICATORS THRU 60-EXIT.
           MOVE "FDOCSET" TO VIEW-CFNAME.
           PERFORM 5-PRINT-SCREEN THRU 5-EXIT.
           IF VIEW-LASTKEY = 3
              MOVE "N" TO CONTINUE-SW
              GO TO 6-EXIT
           ELSE
              IF VIEW-LASTKEY = 5
                 GO TO 6-EXIT
              ELSE
                 IF VIEW-LASTKEY = 6 OR 7
                    PERFORM 61-PAGING-RQST THRU 61-EXIT
                    GO TO 6-MAIN
                 ELSE
                    PERFORM 62-CHECK-OPTION THRU 62-EXIT
                    IF VIEW-LASTKEY = 3
                       MOVE "N" TO CONTINUE-SW
                       GO TO 6-EXIT
                    ELSE
                      GO TO 6-MAIN.

       6-EXIT.
           EXIT.

       60-SET-PAGING-INDICATORS.
           IF NEXT-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (32)
           ELSE
              MOVE FALS-VAL TO INDS (32).
           IF PREV-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (33)
           ELSE
              MOVE FALS-VAL TO INDS (33).

       60-EXIT.
           EXIT.

       61-PAGING-RQST.
           IF (NEXT-PAGE-SW = "Y") AND (PREV-PAGE-SW = "Y")
              IF VIEW-LASTKEY = 7
                 PERFORM 610-PAGE-FORWARD THRU 610-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE SPACES TO NEXT-PAGE-SW
                 PERFORM 611-PAGE-BACKWARD THRU 611-EXIT
                 GO TO 61-EXIT
              END-IF
           END-IF.
           IF PREV-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 6
                 PERFORM 611-PAGE-BACKWARD THRU 611-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
                 MOVE ERROR-MESSAGE (04) TO ERRMSG OF FDOCSET-O
                 GO TO 61-EXIT
              END-IF
           END-IF.
           IF NEXT-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 7
                 MOVE "Y" TO PREV-PAGE-SW
                 PERFORM 610-PAGE-FORWARD THRU 610-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
                 MOVE "N" TO INVALID-SW
                 MOVE ERROR-MESSAGE (03) TO ERRMSG OF FDOCSET-O
                 GO TO 61-EXIT
              END-IF
           END-IF.

       61-EXIT.
           EXIT.

       610-PAGE-FORWARD.
           ADD 1 TO PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD AFTER OVERFLOW
           MOVE NEXT-KEY TO MSUBHDR-KEY.
           MOVE SPACES TO NEXT-PAGE-SW.
           PERFORM 110-START-LIST THRU 110-EXIT.

       610-EXIT.
           EXIT.

       611-PAGE-BACKWARD.
           SUBTRACT 1 FROM PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD ON PRIOR SCREEN
           MOVE SAVE-KEY (PAGE-NO) TO MSUBHDR-KEY.
           IF PAGE-NO = 1
              MOVE SPACES TO PREV-PAGE-SW
           END-IF.
           PERFORM 110-START-LIST THRU 110-EXIT.

       611-EXIT.
           EXIT.

       62-CHECK-OPTION.
           MOVE FALS-VAL           TO INDS (99).
           MOVE FDOCSET-I TO INPUT-BUF.
           MOVE SPACES TO ALL-SEL-EMPTY-SW SEL-NOT-X-SW.
           MOVE 1 TO S3.
           MOVE 0 TO SEL-COUNT.
      *----CHECK INPUT BUFFER FOR SUB-SYSTEM SELECT FIELDS.  MUST SELECT
      *----ONLY ONE SUB-SYSTEM, SELECT FIELD MUST BE AN "X"
           PERFORM UNTIL S3 > 15
             IF SEL-INPUT (S3) NOT EQUAL SPACES
                ADD 1 TO SEL-COUNT
                MOVE S3 TO SAVE-SEL-COUNT
                IF SEL-INPUT (S3) NOT EQUAL "X"
                   MOVE "Y" TO SEL-NOT-X-SW
                END-IF
             END-IF
             ADD 1 TO S3
           END-PERFORM.
           IF SEL-COUNT = 0
              MOVE "Y" TO ALL-SEL-EMPTY-SW.
      *----24 IS THE NUMERIC VALUE TO TURN ON/OFF INDICATORS FOR
      *----SUBSYS DISPLAY FIELDS IN SUBSEQUENT PARAGRAPH LOOPS
           MOVE +24 TO INCREMENT-VALUE.
           PERFORM 620-RESET-ERROR-INDIC THRU 620-EXIT
             VARYING S1  FROM 16 BY 1 UNTIL S1 > 30.
           IF ALL-SEL-EMPTY-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 621-SET-ERROR-INDIC  THRU 621-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 30
              MOVE ERROR-MESSAGE (05) TO ERRMSG OF FDOCSET-O
              GO TO 62-EXIT.
           IF SEL-COUNT GREATER THAN 1
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 621-SET-ERROR-INDIC  THRU 621-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 30
              MOVE ERROR-MESSAGE (06) TO ERRMSG OF FDOCSET-O
              GO TO 62-EXIT.
           IF SEL-NOT-X-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 621-SET-ERROR-INDIC  THRU 621-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 30
              MOVE ERROR-MESSAGE (07) TO ERRMSG OF FDOCSET-O
              GO TO 62-EXIT.
           MOVE SPACES TO COMMANDLN1 OF FDOCSET-O.
           MOVE FALS-VAL TO INDS (98).
           MOVE SPACES TO MSUBHDR-REC.
           MOVE SAVE-SUBHDR-RECORD (SAVE-SEL-COUNT)  TO MSUBHDR-REC.
      *----CHECK TO MAKE SURE THAT SUB-SYSTEM RECORD STILL EXISTS
           PERFORM 30-READ-MSUBHDR THRU 30-EXIT.
           IF INVALID-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
      *----39 IS CORRECT VALUE TO SET IND TO HIGHLIGHT SELECTED FIELD
              ADD +39 TO SAVE-SEL-COUNT GIVING S2
              MOVE TRUE-VAL TO INDS (S2)
              MOVE ERROR-MESSAGE (08) TO ERRMSG OF FDOCSET-O
              GO TO 62-EXIT.
           IF  (INVALID-SW = "N")
           AND (WS-STATUS (SAVE-SEL-COUNT) = INCLUDE-LIT)
      *----REQUEST MADE TO EXCLUDE AN INCLUDED SUB-SYSTEM
      *----SET ON INDICATOR THAT CAUSE PROGRAM TO PROMPT ADMN WITH
      *----A WARNING MESSAGE AND A CONFIRMATION FIELD
               MOVE TRUE-VAL TO INDS (31).
           MOVE FALS-VAL TO INDS (99).
           MOVE SPACES TO ERRMSG OF FDOCSET-O.

           PERFORM 622-PROCESS-MAINT  THRU 622-EXIT.
           IF VIEW-LASTKEY = 3
              GO TO 62-EXIT.
           PERFORM 623-START-OVER     THRU 623-EXIT.

       62-EXIT.
           EXIT.

       620-RESET-ERROR-INDIC.
           IF INDS (S1) EQUAL TRUE-VAL
              ADD INCREMENT-VALUE TO S1 GIVING S2
              MOVE FALS-VAL TO INDS (S2)
           ELSE
              GO TO 620-EXIT
           END-IF.

       620-EXIT.
           EXIT.

       621-SET-ERROR-INDIC.
           IF INDS (S1) EQUAL TRUE-VAL
              ADD INCREMENT-VALUE TO S1 GIVING S2
              MOVE TRUE-VAL TO INDS (S2)
           ELSE
              GO TO 621-EXIT
           END-IF.

       621-EXIT.
           EXIT.

       622-PROCESS-MAINT.
      *----IF INDICATOR FOR REQUESTED EXCLUSION OF INCLUDED SUBSYS
      *----IS NOT SET ON, THEN  REQUEST IS FOR AN INCLUSION OF AN
      *----EXCLUDED SYSTEM.  EXECUTE THIS LOGIC AND EXIT PARAGRAPH
           IF INDS (31) = FALS-VAL
              PERFORM 6220-INCLUDE-SUBSYS THRU 6220-EXIT
              GO TO 622-EXIT.
      *----REQUEST WAS FOR AN EXCUSION OF AN INCLUDED SUB-SYSTEM,
      *----WHICH COULD HAVE RELATED "CHILDREN" RECORDS LINKED TO IT
      *----39 IS VALUE THAT WHEN ADDED TO SUBSCRIPT S2 WILL RESULT
      *----IN TURNING ON IND TO HIGHLIGHT SELECTED DISPLAY FIELD
      *----AND DISPLAY WARNING MESSAGE WITH A CONFIRMATION FIELD
           ADD +39 TO SAVE-SEL-COUNT GIVING S2.
           MOVE TRUE-VAL TO INDS (S2).
           MOVE "FDOCSET" TO VIEW-CFNAME.
           PERFORM 5-PRINT-SCREEN THRU 5-EXIT.
           IF VIEW-LASTKEY = 12
             GO TO 622-EXIT
           ELSE
              IF VIEW-LASTKEY = 6 OR 7
                 MOVE TRUE-VAL TO INDS (99)
                 MOVE ERROR-MESSAGE (09) TO ERRMSG OF FDOCSET-O
                 GO TO 622-PROCESS-MAINT
              ELSE
                 IF VIEW-LASTKEY = 5
                    MOVE TRUE-VAL TO INDS (99)
                    MOVE ERROR-MESSAGE (11) TO ERRMSG OF FDOCSET-O
                    GO TO 622-PROCESS-MAINT
                 ELSE
                    IF VIEW-LASTKEY = 3
                       MOVE "N" TO CONTINUE-SW
                       GO TO 622-EXIT.
           MOVE FDOCSET-I TO INPUT-BUF.
      *----DO LOGIC TO EXCLUDE AN INCLUDED SUB-SYSTEM
           PERFORM 6221-EXCLUDE-SUBSYS THRU 6221-EXIT.
           GO TO 622-EXIT.

       622-EXIT.
           EXIT.

       6220-INCLUDE-SUBSYS.
           MOVE "Y" TO INCLSUB   OF MSUBHDR-REC.
           REWRITE MSUBHDR-REC.

       6220-EXIT.
           EXIT.

       6221-EXCLUDE-SUBSYS.
           IF WS-EXCRESP EQUAL SPACES
              MOVE TRUE-VAL TO INDS (99)
              MOVE ERROR-MESSAGE (10) TO ERRMSG OF FDOCSET-O
              GO TO 6221-EXIT
           ELSE
              IF WS-EXCRESP NOT = "Y"
                 GO TO 6221-EXIT.
           MOVE "N" TO INCLSUB   OF MSUBHDR-REC.
           REWRITE MSUBHDR-REC.

       6221-EXIT.
           EXIT.

       623-START-OVER.
             CLOSE MSUBHDR.
             MOVE SPACES TO DSPLY-REC.
             PERFORM 11-INIT-LIST THRU 11-EXIT.

       623-EXIT.
           EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDICATORS ARE INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF DSPLY-STATUS NOT = "00"
             MOVE 3 TO VIEW-LASTKEY
           ELSE
             MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98-EXIT.
           EXIT.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDICATORS ARE INDICS
                   NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.

       98A-EXIT.
           EXIT.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDICATORS ARE INDICS.

       99-EXIT.
           EXIT.

       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
