       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TDOCDSP.
       AUTHOR.         W L MCINTYRE.
       DATE-WRITTEN.   JAN 1994.
       DATE-COMPILED.
      *REMARKS
      *D****************************************************************
      *D                      T  D  O  C  D  S  P                      *
      *D****************************************************************
      *D                                                               *
      *D  THIS INQUIRY PROGRAM ALLOWS THE USER TO VIEW ENHANCEMENT     *
      *D  DOCUMENTATION FOR THE CURRENT RELEASE OF CSIS/MMIS SOFTWARE. *
      *D  THE PROGRAM FIRST CALLS UP A SCREEN IN WHICH THE USER        *
      *D  SELECTS THE PRIMARY SYSTEM AND THE SUB-SYSTEM TO VIEW, THEN  *
      *D  THE NEXT SCREEN LISTS ANY ENHANCEMENTS FOR THE SUB-SYSTEM.   *
      *D  AT THIS POINT, THE USER CAN SELECT THE PARTICULAR AREA OF    *
      *D  DOCUMENTATION TO VIEW.  THE PROGRAM THEN CALLS A CL PROGRAM  *
      *D  WHICH EXECUTES THE COMMAND TO DISPLAY THE OFFICE VISION/400  *
      *D  DOCUMENT THAT IS LINKED TO THE ENHANCEMENT.                  *
      *D                                                               *
      *D****************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDOCSYS-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT MSUBHDR
               ASSIGN TO DATABASE-MCFLDS0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MSUBHDR-STATUS.

           SELECT MSUBDTL
               ASSIGN TO DATABASE-MCFLDS0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MSUBDTL-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       FD  MSUBHDR
           LABEL RECORDS ARE STANDARD.
       01  MSUBHDR-REC.
           COPY DDS-ALL-FORMATS OF MCFLDS0101.

       FD  MSUBDTL
           LABEL RECORDS ARE STANDARD.
       01  MSUBDTL-REC.
           COPY DDS-ALL-FORMATS OF MCFLDS0201.

       WORKING-STORAGE SECTION.

      *----------------------------------------------------------------
      *    B U F F E R S
      *----------------------------------------------------------------
       01  MESSAGE-BUFFER.
           05  FILLER                  PIC X(80).

       01  INPUT-BUF.
           05  WS-SELCSIS                  PIC X(01) VALUE SPACES.
           05  WS-SELMMIS                  PIC X(01) VALUE SPACES.
           05  WS-SELCSAS                  PIC X(01) VALUE SPACES.
           05  WS-SELREQS                  PIC X(01) VALUE SPACES.
           05  WS-SELDP                    PIC X(01) VALUE SPACES.
           05  SEL-INPUT-TABLE.
               10  SEL-INPUT OCCURS 8 TIMES.
                   15  WS-INPUT            PIC X(01) VALUE SPACES.

       01  INPUT-BUF2.
           05  WS-ITTLCHR                  PIC X(02) VALUE LOW-VALUES.
           05  WS-ITTLNUM REDEFINES  WS-ITTLCHR  PIC 9(02).

       COPY MSUBHDR OF COPYLIB.

       COPY MSUBDTL OF COPYLIB.

       01  WS-SCREEN.
           05  WS-ERRMSG               PIC X(79).
           05  WS-CSIS                 PIC X(01).
           05  WS-MMIS                 PIC X(01).
           05  WS-CSAS                 PIC X(01).
           05  WS-REQS                 PIC X(01).
           05  WS-DP                   PIC X(01).
           05  WS-PROMPT               PIC X(54).
           05  SUBSYSRECS OCCURS 8 TIMES.
               10  WS-SELECT           PIC X(01).
               10  WS-SUBSYS           PIC X(08).
               10  WS-DESC             PIC X(60).
           05  WS-CMDMSG               PIC X(79).

       01  WS-SCREEN2.
           05  WS-ERRMSG               PIC X(79).
           05  WS-SYSTEM               PIC X(05).
           05  WS-SUB                  PIC X(08).
           05  TITLERECS OCCURS 10 TIMES.
               10  WS-TNO              PIC X(02).
               10  WS-DSC              PIC X(60).
           05  WS-TTLNUM               PIC X(02).
           05  WS-CMDMSG               PIC X(74).

      *----------------------------------------------------------------
      *    C O P Y   M E M B E R    A R E A S
      *----------------------------------------------------------------
       COPY CATREAD OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY WSCONTROL OF COPYLIB.

       COPY CPYIND OF COPYLIB.

       COPY IOFEEDBACK OF COPYLIB.

       01  SYSTEM-TABLE.
           COPY PRISYSVAL OF COPYLIB.
       01  SYSTEM-NUM                   PIC 9(05).

      *----------------------------------------------------------------
      *    D A T A B A S E   K E Y S   -   S T A T U S   F I E L D S
      *----------------------------------------------------------------
       01  MSUBHDR-KEY.
           05  MSUBHDR-5                PIC X(05).
           05  MSUBHDR-8                PIC X(08).

       01  MSUBDTL-KEY.
           05  MSUBDTL-5                PIC X(05).
           05  MSUBDTL-8                PIC X(08).
           05  MSUBDTL-2                PIC 9(02).

       01  MSUBHDR-STATUS               PIC XX VALUE SPACES.
       01  MSUBDTL-STATUS               PIC XX VALUE SPACES.
       01  DSPLY-STATUS                 PIC XX.

      *----------------------------------------------------------------
      *    D I S P L A Y   S C R E E N   D A T A   A R E A
      *----------------------------------------------------------------
       01  FZDOCSYS.
           COPY DD-ALL-FORMATS OF ZDOCSYS.

      *----------------------------------------------------------------
      *    L I T E R A L S
      *----------------------------------------------------------------
       01  FALS-VAL                    PIC 1 VALUE B"0".
       01  TRUE-VAL                    PIC 1 VALUE B"1".
       01  INCLUDE-LIT                  PIC X(03) VALUE "INC".
       01  EXCLUDE-LIT                  PIC X(03) VALUE "EXC".
       01  VIEWDOC-LIT                  PIC X(54) VALUE
             "Select Sub-System to View Release Documentation       ".

      *----------------------------------------------------------------
      *    P A G I N G   I N F O   A R E A
      *----------------------------------------------------------------
       01  PAGE-NO                      PIC 9(02)  VALUE ZEROS.
       01  CURRENT-KEY.
           05  CK-5                     PIC X(05)  VALUE SPACES.
           05  CK-8                     PIC X(08)  VALUE SPACES.
       01  NEXT-KEY.
           05  NK-5                     PIC X(05)  VALUE SPACES.
           05  NK-8                     PIC X(08)  VALUE SPACES.
       01  NEXT-KEY2.
           05  NK2-5                    PIC X(05)  VALUE SPACES.
           05  NK2-8                    PIC X(08)  VALUE SPACES.
           05  NK2-3                    PIC X(03)  VALUE SPACES.

      *----------------------------------------------------------------
      *    P A R A M E T E R S
      *----------------------------------------------------------------
       01  CALL-PARMS.
           05  DOCMNT                  PIC X(10) VALUE SPACES.
           05  FOUND                   PIC X(01) VALUE SPACES.

      *----------------------------------------------------------------
      *    S A V E   A R E A S
      *----------------------------------------------------------------
       01  SEL-COUNT                   PIC 99 COMP-3  VALUE ZEROS.
       01  SAVE-SEL-COUNT              PIC 99 COMP-3  VALUE ZEROS.
       01  INCREMENT-VALUE             PIC 99 COMP-3  VALUE ZEROS.
       01  SAVE-KEYS.
           05  SAVE-ENTRY          OCCURS 15 TIMES.
               10  SAVE-KEY        PIC X(13)  VALUE SPACES.
       01  SAVE-KEYS2.
           05  SAVE-ENTRY2         OCCURS 10 TIMES.
               10  SAVE-KEY2       PIC X(15)  VALUE SPACES.
       01  WS-PRISYSTEM                    PIC X(05) VALUE SPACES.
       01  WS-SUBSYSTEM                    PIC X(08) VALUE SPACES.

       01  SAVE-SUBHDR.
           05 SAVE-SUBHDR-RECORD OCCURS  8 TIMES PIC X(740).

       01  SAVE-SUBDTL.
           05 SAVE-SUBDTL-RECORD OCCURS 10 TIMES PIC X(940).
              10  FILLER                PIC X(13).
              10  SAVE-SUBDTL-RECORD-SEQCHR  PIC X(02).
              10  SAVE-SUBDTL-RECORD-SEQNUM  REDEFINES
                    SAVE-SUBDTL-RECORD-SEQCHR  PIC 9(02).
              10  FILLER                PIC X(79).

      *----------------------------------------------------------------
      *    S U B S C R I P T S
      *----------------------------------------------------------------
       01  S1                          PIC 99 COMP-3  VALUE ZEROS.
       01  S2                          PIC 99 COMP-3  VALUE ZEROS.
       01  S3                          PIC 99 COMP-3  VALUE ZEROS.

      *----------------------------------------------------------------
      *    S W I T C H E S
      *----------------------------------------------------------------
       01  SWITCHES.
           05  CONTINUE-SW             PIC X     VALUE "Y".
           05  FOUND-SW                PIC X     VALUE "N".
           05  INVALID-SW              PIC X     VALUE "N".
           05  ALL-SEL-EMPTY-SW        PIC X     VALUE "N".
           05  SEL-NOT-X-SW            PIC X     VALUE "N".
           05  LIST-RECS-SW            PIC X     VALUE " ".
           05  NEXT-PAGE-SW            PIC X     VALUE "N".
           05  PREV-PAGE-SW            PIC X     VALUE "N".

      *----------------------------------------------------------------
      *    M I S C E L L A N E O U S
      *----------------------------------------------------------------
       01  CUR-DATE-WA.
           05  CUR-DATE-YY             PIC XX.
           05  C-D-YY-99 REDEFINES CUR-DATE-YY.
               10  CD-YEAR             PIC 99.
           05  FILLER                  PIC X(4).

       01  WS-DATE.
           05  WS-CENT                 PIC 9(02).
           05  WS-YYMMDD               PIC 9(06).

       01  WS-TITLE-WORK.
           05  WS-TITLE-BIT OCCURS 2 TIMES PIC X(01).

       01  DEFAULT-MESSAGE.
           05  FILLER                  PIC X(74)  VALUE
                 "ERROR IN SELECTING OPTION - PLEASE RETRY".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDOCDSP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " H0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
             "INQUIRY PROGRAM WHICH ALLOWS USER TO VIEW ENHANCEMENT   ".
               10  PROG-DESC-B     PIC X(60) VALUE
             "DOCUMENTATION TITLES FOR CSIS/MMIS ONLINE SYSTEM        ".
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

      *----------------------------------------------------------------
      *    M A I N    P R O C E D U R E
      *----------------------------------------------------------------
       PROCEDURE DIVISION.
           OPEN I-O DISPLAY-FILE.
           OPEN I-O   MSUBHDR.
      *----IF SWITCH IS "N", THEN A PF3 KEY PRESSED TO EXIT THE PGM,
      *----IF IT IS A "B", THEN A PF5 KEY PRESSED TO RESTART PGM FROM
      *----BEGINNING TO ALLOW PRIMARY SYSTEM SELECTION
       INIT-SEL-SCREEN.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           IF CONTINUE-SW = "N"
              GO TO END-PROGRAM
           ELSE IF CONTINUE-SW = "B"
              GO TO INIT-SEL-SCREEN.
           PERFORM 6-MAIN THRU 6-EXIT.
           GO TO INIT-SEL-SCREEN.
       END-PROGRAM.
           PERFORM 2-END-OF-JOB THRU 2-EXIT.

       1-HOUSEKEEPING.
      *----IF SWITCH IS "S", THEN PGM IS RETURNING FROM DOCUMENTATION
      *----SELECTION SCREEN TO PRI SYS/SUBSYS SELECTION SCREEN.  KEEP
      *----PRIOR PRI SYS SELECTION BY SKIPPING PRI SYS SELECTION LOGIC
      *----AND GO GET THE SUBSYSTEM.  IF SWITCH IS NOT "S", THEN PGM
      *----IS STARTING A NEW SELECTION CYCLE.  EXECUTE LOGIC FOR PRI SYS
      *----AND SUBSYS SELECTION
           IF CONTINUE-SW EQUAL "S"
              MOVE WS-SELCSIS TO WS-CSIS
              MOVE WS-SELMMIS TO WS-MMIS
              MOVE WS-SELCSAS TO WS-CSAS
              MOVE WS-SELREQS TO WS-REQS
              MOVE WS-SELDP   TO WS-DP
              MOVE "Y" TO CONTINUE-SW
           ELSE
              PERFORM 10-PRIMARY-SYSTEM THRU 10-EXIT.
           IF CONTINUE-SW = "N"
              GO TO 1-EXIT.
           ACCEPT CUR-DATE-WA FROM DATE.
           IF CD-YEAR IS GREATER THAN 49
              MOVE 19 TO WS-CENT
           ELSE
              MOVE 20 TO WS-CENT.
           MOVE CUR-DATE-WA TO WS-YYMMDD.
           PERFORM 11-INIT-LIST THRU 11-EXIT.
           PERFORM 12-GET-SUBSYS THRU 12-EXIT.
           IF CONTINUE-SW = "N"
              GO TO 1-EXIT
           ELSE IF CONTINUE-SW = "B"
              GO TO 1-EXIT.
           PERFORM 13-INIT-LIST THRU 13-EXIT.

       1-EXIT.
           EXIT.

       10-PRIMARY-SYSTEM.
           MOVE SPACES TO INPUT-BUF WS-SCREEN FZDOCSYS.
           MOVE ALL B"0" TO INDICS.
           MOVE "FSUBSEL" TO VIEW-CFNAME.
           PERFORM 100-GET-SYSTEM THRU 100-EXIT.

       10-EXIT.
           EXIT.

       100-GET-SYSTEM.
      *----SELECT THE PRIMARY SYSTEM TO WORK WITH.  PF3 TO EXIT PGM
      *----CAN SELECT ONLY ONE SYSTEM, SELECT FIELD MUST BE AN "X"
           MOVE "Y" TO CONTINUE-SW.
           PERFORM 5-PRINT-SCREEN.
           IF VIEW-LASTKEY = 3
              MOVE "N" TO CONTINUE-SW
              GO TO 100-EXIT.
           MOVE ZEROS TO SEL-COUNT.
           MOVE SPACES TO SEL-NOT-X-SW.
           IF SELCSIS OF FSUBSEL-I NOT EQUAL SPACES
              MOVE 1 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELCSIS OF FSUBSEL-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELMMIS OF FSUBSEL-I NOT EQUAL SPACES
              MOVE 2 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELMMIS OF FSUBSEL-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELCSAS OF FSUBSEL-I NOT EQUAL SPACES
              MOVE 3 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELCSAS OF FSUBSEL-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELREQS OF FSUBSEL-I NOT EQUAL SPACES
              MOVE 4 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELREQS OF FSUBSEL-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           IF SELDP OF FSUBSEL-I NOT EQUAL SPACES
              MOVE 5 TO SYSTEM-NUM
              ADD 1 TO SEL-COUNT
              IF SELDP OF FSUBSEL-I NOT EQUAL "X"
                 MOVE "Y" TO SEL-NOT-X-SW
              END-IF
           END-IF.
           MOVE FALS-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                            INDS (38) INDS (99).
           IF SEL-COUNT GREATER THAN 1
              MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                               INDS (38) INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 004
      *M   CANNOT SELECT MORE THAN ONE PRIMARY SYSTEM
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE   4        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 100-GET-SYSTEM
           ELSE
              IF SEL-COUNT LESS THAN 1
                MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                                 INDS (38) INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 009
      *M   MUST SELECT ONE PRIMARY SYSTEM
      *M****************************************************************
                MOVE  68        TO CATREAD-MSG-SET
                MOVE   9        TO CATREAD-MSG-NUM
                PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
                PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
                GO TO 100-GET-SYSTEM
              END-IF
           END-IF.
           IF SEL-NOT-X-SW = "Y"
              MOVE TRUE-VAL TO INDS (34) INDS (35) INDS (36) INDS (37)
                               INDS (38) INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 012
      *M   SELECT FIELD MUST BE A 'X'
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE  12        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 100-GET-SYSTEM.
           MOVE FSUBSEL-I TO INPUT-BUF.

       100-EXIT.
           EXIT.

       11-INIT-LIST.
      *----GET SUB-SYSTEMS FOR PRIMARY SYSTEM SELECTED BY USING SYSTEM
      *----TABLE FOR HIGH-LEVEL KEY FIELD, LOW-VALUES FOR LOWER-LEVEL
      *----KEY FIELD.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE SYSTEM-NAME (SYSTEM-NUM) TO MSUBHDR-5
                                            WS-PRISYSTEM.
           MOVE LOW-VALUES               TO MSUBHDR-8.
           MOVE LOW-VALUES               TO NEXT-KEY.
           MOVE MSUBHDR-KEY TO CURRENT-KEY.
           MOVE SPACES      TO NEXT-PAGE-SW PREV-PAGE-SW.
           MOVE 1           TO PAGE-NO.
           PERFORM 110-START-LIST     THRU 110-EXIT.

       11-EXIT.
           EXIT.

       110-START-LIST.
           MOVE SPACES      TO LIST-RECS-SW.
           MOVE ALL B"0" TO INDICS.
           MOVE MSUBHDR-5   TO SYSTEM OF MSUBHDR-REC.
           MOVE MSUBHDR-8   TO SUBSYS OF MSUBHDR-REC.
           START MSUBHDR
               KEY IS NOT LESS THAN SYSTEM OF MSUBHDR-REC
                                    SUBSYS OF MSUBHDR-REC
                 INVALID KEY
                   MOVE "N" TO LIST-RECS-SW.
           PERFORM 1100-INIT-VALUES THRU 1100-EXIT
               VARYING S1 FROM 1 BY 1 UNTIL S1 > 8.
           MOVE 1 TO S1.
           IF LIST-RECS-SW NOT EQUAL TO  "N"
              PERFORM 1101-SUBSYS-LIST THRU 1101-EXIT
                 UNTIL S1 > 9.
           MOVE VIEWDOC-LIT TO WS-PROMPT OF WS-SCREEN.
           MOVE WS-SCREEN TO FSUBSEL-O.

       110-EXIT.
           EXIT.

       1100-INIT-VALUES.
           MOVE SPACES TO SUBSYSRECS (S1).

       1100-EXIT.
           EXIT.

       1101-SUBSYS-LIST.
           READ MSUBHDR NEXT RECORD
               INTO BUF-MSUBHDR
               WITH NO LOCK
               AT END
                 MOVE 10 TO S1
                 GO TO 1101-EXIT.
           IF SYSTEM OF MSUBHDR-REC NOT EQUAL MSUBHDR-5
              MOVE 10 TO S1
              GO TO 1101-EXIT.
           IF S1 = 9
      *----OVERFLOW FOR THIS SCREEN, SAVE KEY TO START NEXT PAGE
              MOVE "Y" TO NEXT-PAGE-SW
              MOVE  SYSTEM OF MSUBHDR-REC TO NK-5
              MOVE  SUBSYS OF MSUBHDR-REC TO NK-8
              MOVE 10  TO S1
              GO TO 1101-EXIT
           ELSE
      *----SUB-SYSTEM IS DESIGNATED FOR INCLUSION IN SYSTEM DOCUMENTAION
              IF INCLSUB = "Y"
                 MOVE SPACES                     TO  WS-SELECT (S1)
                 MOVE SUBSYS     OF MSUBHDR-REC  TO  WS-SUBSYS (S1)
                 MOVE SUBSYSDESC OF MSUBHDR-REC  TO  WS-DESC   (S1)
                 MOVE MSUBHDR-REC      TO   SAVE-SUBHDR-RECORD (S1)
                 ADD +15 TO S1 GIVING S2
                 MOVE TRUE-VAL           TO  INDS (S2)
      *----SAVE DATA FOR FIRST RECORD OF EACH SCREEN TO PAGE BACKWARD
                 IF S1 = 1
                    MOVE MSUBHDR-REC TO SAVE-KEY (PAGE-NO)
                 END-IF
                 ADD 1 TO S1
              END-IF.

       1101-EXIT.
           EXIT.

       12-GET-SUBSYS.
      *----SELECT SUB-SYSTEM TO VIEW DOCUMENTATION.  PF3 TO EXIT
      *----PGM, PF5 TO RESELECT PRIMARY SYSTEM, IF APPLICABLE, PF6
      *----AND/OR PF7 TO PAGE.  ONLY ONE SUB-SYSTEM CAN BE SELECTED,
      *----SELECT FIELD MUST BE AN "X"
      *----
      *----SET ON INDICATORS TO LOCK PRIMARY SELECTION FIELDS
           MOVE TRUE-VAL TO INDS (15) INDS (34) INDS (35) INDS (36)
                            INDS (37) INDS (38).
           PERFORM 120-SET-PAGING-INDICATORS THRU 120-EXIT.
           MOVE "FSUBSEL" TO VIEW-CFNAME.
           PERFORM 5-PRINT-SCREEN THRU 5-EXIT.
           IF VIEW-LASTKEY = 3
              MOVE "N" TO CONTINUE-SW
              GO TO 12-EXIT
           ELSE
              IF VIEW-LASTKEY = 5
                 MOVE "B" TO CONTINUE-SW
                 GO TO 12-EXIT
              ELSE
                 IF VIEW-LASTKEY = 6 OR 7
                    PERFORM 121-PAGING-RQST THRU 121-EXIT
                    GO TO 12-GET-SUBSYS.
           MOVE FALS-VAL           TO INDS (99).
           MOVE FSUBSEL-I TO INPUT-BUF.
           MOVE SPACES TO ALL-SEL-EMPTY-SW SEL-NOT-X-SW.
           MOVE 1 TO S3.
           MOVE 0 TO SEL-COUNT.
      *----CHECK INPUT BUFFER FOR SUB-SYSTEM SELECT FIELDS.  MUST SELECT
      *----ONLY ONE SUB-SYSTEM, SELECT FIELD MUST BE AN "X"
           PERFORM UNTIL S3 > 8
             IF SEL-INPUT (S3) NOT EQUAL SPACES
                ADD 1 TO SEL-COUNT
                MOVE S3 TO SAVE-SEL-COUNT
                IF SEL-INPUT (S3) NOT EQUAL "X"
                   MOVE "Y" TO SEL-NOT-X-SW
                END-IF
             END-IF
             ADD 1 TO S3
           END-PERFORM.
           IF SEL-COUNT = 0
              MOVE "Y" TO ALL-SEL-EMPTY-SW.
      *----24 IS THE NUMERIC VALUE TO TURN ON/OFF INDICATORS FOR
      *----SUBSYS DISPLAY FIELDS IN SUBSEQUENT PARAGRAPH LOOPS
           MOVE +24 TO INCREMENT-VALUE.
           PERFORM 122-RESET-ERROR-INDIC THRU 122-EXIT
             VARYING S1  FROM 16 BY 1 UNTIL S1 > 23.
           IF ALL-SEL-EMPTY-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 123-SET-ERROR-INDIC  THRU 123-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 23
      *M****************************************************************
      *M   Message Set: 68   Number: 010
      *M   MUST SELECT ONE SUBSYSTEM
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE  10        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 12-GET-SUBSYS.
           IF SEL-COUNT GREATER THAN 1
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 123-SET-ERROR-INDIC  THRU 123-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 23
      *M****************************************************************
      *M   Message Set: 68   Number: 001
      *M   CAN SELECT ONLY ONE SUBSYSTEM
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE   1        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 12-GET-SUBSYS.
           IF SEL-NOT-X-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
              PERFORM 123-SET-ERROR-INDIC  THRU 123-EXIT
                VARYING S1  FROM 16 BY 1 UNTIL S1 > 30
      *M****************************************************************
      *M   Message Set: 68   Number: 012
      *M   SELECT FIELD MUST BE A 'X'
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE  12        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 12-GET-SUBSYS.
           MOVE SPACES TO COMMANDLN1 OF FSUBSEL-O.
           MOVE FALS-VAL TO INDS (98).
           MOVE SPACES TO MSUBHDR-REC.
           MOVE SAVE-SUBHDR-RECORD (SAVE-SEL-COUNT)  TO MSUBHDR-REC.
      *----CHECK TO MAKE SURE THAT SUB-SYSTEM RECORD STILL EXISTS
           PERFORM 30-READ-MSUBHDR THRU 30-EXIT.
           IF INVALID-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
      *----39 IS VALUE TO SET INDICATOR ON TO HIGHLIGHT SELECTED
      *----FIELD ON THE DISPLAY
              ADD +39 TO SAVE-SEL-COUNT GIVING S2
              MOVE TRUE-VAL TO INDS (S2)
      *M****************************************************************
      *M   Message Set: 68   Number: 011
      *M   RECORD SELECTED NO LONGER EXISTS - F5 TO RESELECT PRI SYS
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE  11        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 12-GET-SUBSYS.
           MOVE FALS-VAL TO INDS (99).
           MOVE SPACES TO ERRMSG OF FSUBSEL-O.
      *----MOVE SELECT SUB-SYSTEM FROM SCREEN BUFFER TO KEY, DATA FIELDS
           MOVE WS-SUBSYS (SAVE-SEL-COUNT) TO WS-SUBSYSTEM MSUBHDR-8.

       12-EXIT.
           EXIT.

       120-SET-PAGING-INDICATORS.
           IF NEXT-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (32)
           ELSE
              MOVE FALS-VAL TO INDS (32).
           IF PREV-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (33)
           ELSE
              MOVE FALS-VAL TO INDS (33).

       120-EXIT.
           EXIT.

       121-PAGING-RQST.
           IF (NEXT-PAGE-SW = "Y") AND (PREV-PAGE-SW = "Y")
              IF VIEW-LASTKEY = 7
                 PERFORM 1210-PAGE-FORWARD THRU 1210-EXIT
                 GO TO 121-EXIT
              ELSE
                 MOVE SPACES TO NEXT-PAGE-SW
                 PERFORM 1211-PAGE-BACKWARD THRU 1211-EXIT
                 GO TO 121-EXIT
              END-IF
           END-IF.
           IF PREV-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 6
                 PERFORM 1211-PAGE-BACKWARD THRU 1211-EXIT
                 GO TO 121-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 003
      *M   CANNOT PAGE FORWARD - ALREADY AT BOTTOM OF LIST
      *M****************************************************************
                 MOVE  68        TO CATREAD-MSG-SET
                 MOVE   3        TO CATREAD-MSG-NUM
                 PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
                 GO TO 121-EXIT
              END-IF
           END-IF.
           IF NEXT-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 7
                 MOVE "Y" TO PREV-PAGE-SW
                 PERFORM 1210-PAGE-FORWARD THRU 1210-EXIT
                 GO TO 121-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 002
      *M   CANNOT PAGE BACKWARD - ALREADY AT TOP OF LIST
      *M****************************************************************
                 MOVE  68        TO CATREAD-MSG-SET
                 MOVE   2        TO CATREAD-MSG-NUM
                 PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
                 MOVE "N" TO INVALID-SW
                 GO TO 121-EXIT
              END-IF
           END-IF.

       121-EXIT.
           EXIT.

       1210-PAGE-FORWARD.
           ADD 1 TO PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD AFTER OVERFLOW
           MOVE NEXT-KEY TO MSUBHDR-KEY.
           MOVE SPACES TO NEXT-PAGE-SW.
           PERFORM 110-START-LIST THRU 110-EXIT.

       1210-EXIT.
           EXIT.

       1211-PAGE-BACKWARD.
           SUBTRACT 1 FROM PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD ON PRIOR SCREEN
           MOVE SAVE-KEY (PAGE-NO) TO MSUBHDR-KEY.
           IF PAGE-NO = 1
              MOVE SPACES TO PREV-PAGE-SW
           END-IF.
           PERFORM 110-START-LIST THRU 110-EXIT.

       1211-EXIT.
           EXIT.

       122-RESET-ERROR-INDIC.
           IF INDS (S1) EQUAL TRUE-VAL
              ADD INCREMENT-VALUE TO S1 GIVING S2
              MOVE FALS-VAL TO INDS (S2)
           ELSE
              GO TO 122-EXIT
           END-IF.

       122-EXIT.
           EXIT.

       123-SET-ERROR-INDIC.
           IF INDS (S1) EQUAL TRUE-VAL
              ADD INCREMENT-VALUE TO S1 GIVING S2
              MOVE TRUE-VAL TO INDS (S2)
           ELSE
              GO TO 123-EXIT
           END-IF.

       123-EXIT.
           EXIT.

       13-INIT-LIST.
      *----GET ENHANCEMENT RECORDS FOR SUBSYS OF PRI SYS SELECTED.  MOVE
      *----PRI SYS/SUBSYS VALUES TO HIGH-LEVEL KEY FIELD, LOW-VALUES TO
      *----LOWER-LEVEL KEY FIELD TO START AT BEGINNING OF DATA
           MOVE SPACES TO INPUT-BUF2 WS-SCREEN2 FZDOCSYS.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE WS-PRISYSTEM TO WS-SYSTEM.
           MOVE WS-SUBSYSTEM TO WS-SUB.
           MOVE MSUBHDR-KEY TO CURRENT-KEY.
           MOVE LOW-VALUES  TO NEXT-KEY2.
           MOVE MSUBHDR-KEY TO MSUBDTL-KEY.
           MOVE LOW-VALUES  TO MSUBDTL-2.
           MOVE 1                    TO PAGE-NO.
           MOVE SPACES TO NEXT-PAGE-SW PREV-PAGE-SW.
           PERFORM 130-START-LIST     THRU 130-EXIT.

       13-EXIT.
           EXIT.

       130-START-LIST.
           OPEN I-O   MSUBDTL.
           MOVE MSUBDTL-KEY TO MSUBDTL-REC.
           MOVE ALL B"0" TO INDICS.
           MOVE SPACES      TO LIST-RECS-SW.
           START MSUBDTL
             KEY IS NOT LESS THAN SYSTEM OF MSUBDTL-REC,
                                  SUBSYS OF MSUBDTL-REC,
                                  SEQNUM OF MSUBDTL-REC
             INVALID KEY
                 MOVE "N" TO LIST-RECS-SW.
           PERFORM 1300-INIT-VALUES THRU 1300-EXIT
               VARYING S1 FROM 1 BY 1 UNTIL S1 > 10.
           MOVE 1 TO S1.
           IF LIST-RECS-SW NOT EQUAL TO  "N"
              PERFORM 1301-SEQUENCE-LIST THRU 1301-EXIT
                 UNTIL S1 > 11.
           MOVE WS-SCREEN2 TO FDOCDSP-O.

       130-EXIT.
           EXIT.

       1300-INIT-VALUES.
           MOVE SPACES TO TITLERECS (S1).

       1300-EXIT.
           EXIT.

       1301-SEQUENCE-LIST.
           READ MSUBDTL NEXT RECORD
               INTO BUF-MSUBDTL
               WITH NO LOCK
               AT END
                 MOVE 12 TO S1
                 GO TO 1301-EXIT.
           IF (SUBSYS OF MSUBDTL-REC NOT EQUAL MSUBDTL-8)
           OR (SYSTEM OF MSUBDTL-REC NOT EQUAL MSUBDTL-5)
             MOVE 12 TO S1
             GO TO 1301-EXIT.
      *----OVERFLOW FOR THIS SCREEN, SAVE KEY TO START NEXT PAGE
           IF S1 = 11
              MOVE "Y" TO NEXT-PAGE-SW
              MOVE  SYSTEM OF MSUBDTL-REC TO NK2-5
              MOVE  SUBSYS OF MSUBDTL-REC TO NK2-8
              MOVE  SEQNUM OF MSUBDTL-REC TO NK2-3
              MOVE 12  TO S1
              GO TO 1301-EXIT
           ELSE
              MOVE S1                         TO  WS-TNO  (S1)
              MOVE SEQTITLE  OF MSUBDTL-REC   TO  WS-DSC  (S1)
              MOVE MSUBDTL-REC     TO  SAVE-SUBDTL-RECORD (S1)
      *----SAVE DATA FOR FIRST RECORD OF EACH SCREEN TO PAGE BACKWARD
              IF S1 = 1
                 MOVE MSUBDTL-REC TO SAVE-KEY2 (PAGE-NO)
              END-IF
              ADD 1 TO S1
           END-IF.

       1301-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE MSUBHDR.
           CLOSE MSUBDTL.
           GOBACK.

       2-EXIT.
           EXIT.

       30-READ-MSUBHDR.
           READ MSUBHDR
             INTO BUF-MSUBHDR
             WITH NO LOCK
             INVALID KEY
               MOVE "Y" TO INVALID-SW
             NOT INVALID
               MOVE "N" TO INVALID-SW.

       30-EXIT.
           EXIT.

       31-READ-MSUBDTL.
           READ MSUBDTL
             INTO BUF-MSUBDTL
             WITH NO LOCK
             INVALID KEY
               MOVE "Y" TO INVALID-SW
             NOT INVALID
               MOVE "N" TO INVALID-SW.

       31-EXIT.
           EXIT.

       5-PRINT-SCREEN.
             MOVE FZDOCSYS TO DSPLY-REC.
             PERFORM 99-SCREEN-WRITE THRU 99-EXIT.
             PERFORM 98-SCREEN-READ  THRU 98-EXIT.
             MOVE DSPLY-REC TO FZDOCSYS.

       5-EXIT.
           EXIT.

       6-MAIN.
           PERFORM 60-SET-PAGING-INDICATORS THRU 60-EXIT.
           MOVE "FDOCDSP" TO VIEW-CFNAME.
           PERFORM 5-PRINT-SCREEN THRU 5-EXIT.
      *----IF PF3 PRESSED, SET SWITCH TO RETURN PGM TO GET SUBSYS
           IF VIEW-LASTKEY = 3
              MOVE "S" TO CONTINUE-SW
              GO TO 6-EXIT
           ELSE IF VIEW-LASTKEY = 6 OR 7
              MOVE FALS-VAL TO INDS (99)
              PERFORM 61-PAGING-RQST THRU 61-EXIT
              GO TO 6-MAIN
           ELSE
              PERFORM 62-CHECK-OPTION THRU 62-EXIT
              IF VIEW-LASTKEY = 3
                 MOVE "S" TO CONTINUE-SW
                 GO TO 6-EXIT
              ELSE
                 GO TO 6-MAIN.

       6-EXIT.
           EXIT.

       60-SET-PAGING-INDICATORS.
           IF NEXT-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (15)
           ELSE
              MOVE FALS-VAL TO INDS (15).
           IF PREV-PAGE-SW = "Y"
              MOVE TRUE-VAL TO INDS (16)
           ELSE
              MOVE FALS-VAL TO INDS (16).

       60-EXIT.
           EXIT.

       61-PAGING-RQST.
           IF (NEXT-PAGE-SW = "Y") AND (PREV-PAGE-SW = "Y")
              IF VIEW-LASTKEY = 7
                 PERFORM 610-PAGE-FORWARD THRU 610-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE SPACES TO NEXT-PAGE-SW
                 PERFORM 611-PAGE-BACKWARD THRU 611-EXIT
                 GO TO 61-EXIT
              END-IF
           END-IF.
           IF PREV-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 6
                 PERFORM 611-PAGE-BACKWARD THRU 611-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 003
      *M   CANNOT PAGE FORWARD - ALREADY AT BOTTOM OF LIST
      *M****************************************************************
                 MOVE  68        TO CATREAD-MSG-SET
                 MOVE   3        TO CATREAD-MSG-NUM
                 PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
                 GO TO 61-EXIT
              END-IF
           END-IF.
           IF NEXT-PAGE-SW = "Y"
              IF VIEW-LASTKEY = 7
                 MOVE "Y" TO PREV-PAGE-SW
                 PERFORM 610-PAGE-FORWARD THRU 610-EXIT
                 GO TO 61-EXIT
              ELSE
                 MOVE TRUE-VAL TO INDS (99)
                 MOVE "N" TO INVALID-SW
      *M****************************************************************
      *M   Message Set: 68   Number: 002
      *M   CANNOT PAGE BACKWARD - ALREADY AT TOP OF LIST
      *M****************************************************************
                 MOVE  68        TO CATREAD-MSG-SET
                 MOVE   2        TO CATREAD-MSG-NUM
                 PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
                 PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
                 GO TO 61-EXIT
              END-IF
           END-IF.

       61-EXIT.
           EXIT.

       610-PAGE-FORWARD.
           ADD 1 TO PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD AFTER OVERFLOW
           MOVE NEXT-KEY2 TO MSUBDTL-KEY.
           MOVE SPACES TO NEXT-PAGE-SW.
           PERFORM 130-START-LIST THRU 130-EXIT.

       610-EXIT.
           EXIT.

       611-PAGE-BACKWARD.
           SUBTRACT 1 FROM PAGE-NO.
      *----USES THE SAVE KEY OF FIRST RECORD ON PRIOR SCREEN
           MOVE SAVE-KEY (PAGE-NO) TO MSUBDTL-KEY.
           IF PAGE-NO = 1
              MOVE SPACES TO PREV-PAGE-SW
           END-IF.
           PERFORM 130-START-LIST THRU 130-EXIT.

       611-EXIT.
           EXIT.

       62-CHECK-OPTION.
           MOVE FALS-VAL TO INDS (99).
           MOVE TTLNUM OF FDOCDSP-I TO WS-ITTLCHR.
           MOVE SPACES TO  WS-TITLE-WORK.
           MOVE WS-ITTLCHR TO WS-TITLE-WORK.
           PERFORM 620-ADJUST-TITLE THRU 620-EXIT.
           MOVE WS-TITLE-WORK TO WS-ITTLCHR.
           IF WS-ITTLNUM NOT NUMERIC
              MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 007
      *M   MUST ENTER A NUMBER IN TITLE NUMBER FIELD
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE   7        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 62-EXIT.
           MOVE "N" TO FOUND-SW.
           MOVE 1 TO S2.
      *----CHECK TO SEE THAT NUMBER IS A NUMBER LISTED ON SCREEN
           PERFORM 621-CHECK-TITLENO   THRU 621-EXIT.
           IF FOUND-SW = "Y"
              NEXT SENTENCE
           ELSE
              MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 008
      *M   MUST SELECT A TITLE NUMBER LISTED ON THE SCREEN
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE   8        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 62-EXIT.
           MOVE SPACES TO MSUBDTL-REC.
           MOVE SAVE-SUBDTL-RECORD-SEQNUM (WS-ITTLNUM) TO MSUBDTL-2.
           MOVE MSUBDTL-KEY TO MSUBDTL-REC.
      *----CHECK TO SEE THAT RECORD STILL EXISTS
           PERFORM 31-READ-MSUBDTL THRU 31-EXIT.
           IF INVALID-SW = "Y"
              MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 013
      *M   TITLE RECORD NO LONGER FOUND IN DATABASE
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE  13        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 62-EXIT.
           MOVE DOCUMENT OF MSUBDTL-REC TO DOCMNT.
           MOVE SPACES TO FOUND.
      *----EXECUTE CL PROGRAM TO MAKE SURE THAT THE DOCUMENT WHICH IS
      *----LINKED TO THE ENHANCEMENT TITLE STILL EXISTS IN THE
      *----DOCUMENTATION FOLDER
      *----10/13/94   -  REMOVED CALL TO CLCHKDOC FOR PLANTS TO AVOID
      *----BLOWUPS IN CL PGM, DUE TO THE CHKDLO COMMENT.  TO DO THE
      *----CMD, THE USER MUST BE IN DISTRIBUTION DIRECTORY.  SINCE ALL
      *----USERS IN PLANT MIGHT NOT BE DEFINED AS SUCH, DON'T CALL PGM.
      *    CALL "CLCHKDOC" USING DOCMNT FOUND.
      *    IF FOUND EQUAL "N"
      *       MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M   Message Set: 68   Number: 006
      *M   DOCUMENT DOES NOT EXIST IN DOCUMENTATION FOLDER
      *M****************************************************************
      *       MOVE  68        TO CATREAD-MSG-SET
      *       MOVE   6        TO CATREAD-MSG-NUM
      *       PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
      *       PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
      *       GO TO 62-EXIT.
           MOVE SPACES TO FOUND.
      *----EXECUTE CL PROGRAM TO DISPLAY THE OV/400 DOCUMENT WHICH IS
      *----LINKED TO THE ENHANCEMENT TITLE SELECTED
           CALL "CLDSPDOC" USING DOCMNT FOUND.
           IF FOUND EQUAL "N"
              MOVE TRUE-VAL TO INDS (99)
      *M****************************************************************
      *M  Message Set: 68   Number: 005
      *M  COULD NOT DISPLAY DOCUMENTATION - PROBLEM WITH LINKED DOCUMENT
      *M****************************************************************
              MOVE  68        TO CATREAD-MSG-SET
              MOVE   5        TO CATREAD-MSG-NUM
              PERFORM  999-CATREAD THRU 999-CATREAD-EXIT
              PERFORM 9999-MOVE-CATREAD-MSG THRU 9999-EXIT
              GO TO 62-EXIT.
           MOVE FALS-VAL TO INDS (99).
           MOVE SPACES TO ERRMSG OF FDOCDSP-O.
           PERFORM 622-START-OVER    THRU 622-START-OVER.

       62-EXIT.
           EXIT.

       620-ADJUST-TITLE.
           IF  WS-TITLE-BIT(1) NUMERIC
           AND WS-TITLE-BIT(2) EQUAL SPACES
               MOVE WS-TITLE-BIT(1) TO WS-TITLE-BIT(2)
               MOVE ZERO               TO WS-TITLE-BIT(1)
           END-IF.
           IF  WS-TITLE-BIT(1) EQUAL SPACES
           AND WS-TITLE-BIT(2) NUMERIC
               MOVE ZERO          TO WS-TITLE-BIT(1)
           END-IF.

       620-EXIT.
           EXIT.

       621-CHECK-TITLENO.
           IF S2 > 10
              GO TO 621-EXIT.
           IF WS-TNO (S2) = WS-ITTLCHR
              MOVE "Y" TO FOUND-SW
              GO TO 621-EXIT
           ELSE
              ADD 1 TO S2
              GO TO 621-CHECK-TITLENO.

       621-EXIT.
           EXIT.

       622-START-OVER.
           CLOSE MSUBDTL.
           MOVE SPACES TO DSPLY-REC.
           PERFORM 13-INIT-LIST THRU 13-EXIT.

       622-EXIT.
           EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDICATORS ARE INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF DSPLY-STATUS NOT = "00"
             MOVE 3 TO VIEW-LASTKEY
           ELSE
             MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98-EXIT.
           EXIT.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDICATORS ARE INDICS
                   NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.

       98A-EXIT.
           EXIT.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDICATORS ARE INDICS.

       99-EXIT.
           EXIT.

       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.

       9999-MOVE-CATREAD-MSG.
            IF CATREAD-MSG-TEXT = SPACES
               IF VIEW-CFNAME = "FSUBSEL"
                  MOVE DEFAULT-MESSAGE TO ERRMSG OF FSUBSEL-O
               ELSE
                  MOVE DEFAULT-MESSAGE TO ERRMSG OF FDOCDSP-O
               END-IF
            ELSE
               IF VIEW-CFNAME = "FSUBSEL"
                  MOVE MESSAGE-BUFFER TO ERRMSG OF FSUBSEL-O
               ELSE
                  MOVE MESSAGE-BUFFER TO ERRMSG OF FDOCDSP-O
            END-IF.
            MOVE SPACES TO MESSAGE-BUFFER.

       9999-EXIT.
            EXIT.
