000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TDRCHGIV.
000400 AUTHOR.               K MOVSESIAN.
000500 DATE-WRITTEN.         NOV. 20, 1987.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000800*REMARKS.
000900***************************************************************
001000**                                                           **
001100**   T D R C H G I V   -  THIS PROGRAM CREATES A FILE        **
001200**   OF ALL ACCOUNTING CLASSES THAT CONTAINS THE CLASS       **
001300**   DESCRIPTION, AND DIRECT CHARGE DOLLARS.  THE FILE       **
001400**   NAME 'CLASFILE' IS USED AS INPUT BY THE MOVEMENT        **
001500**   REPORT THEREFORE THIS PROGRAM MUST RUN PRIOR TO THE     **
001600**   MOVEMENT REPORT.                                        **
001700**                                                           **
001800***************************************************************
      *C
      *C   08FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09SEP1996   DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.      HP-3000.
002400 OBJECT-COMPUTER.      HP-3000.
002600
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT CLASS-EXT ASSIGN TO DISK-CLASFILE.

003200 DATA DIVISION.
003400 FILE SECTION.
003500
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
003600
003700 FD  CLASS-EXT
003800     DATA RECORD IS CLASS-EXT-REC
003900     RECORD CONTAINS 92 CHARACTERS
004000     LABEL RECORDS ARE STANDARD.
004100 01  CLASS-EXT-REC.
004200     05  CLASS-NO-EXT              PIC X(4).
004300     05  CLASS-DESCR-EXT           PIC X(60).
004400     05  CLASS-DOLLARS-EXT         PIC S9(12)V99.
004500     05  CLASS-ONDOCK-CARRY-EXT    PIC S9(12)V99.
004600
004800 SD  SORT-FILE
004900     DATA RECORD IS SORT-REC
005000     RECORD CONTAINS 18  CHARACTERS.
005100 01  SORT-REC.
005200     05  SORT-CLASS               PIC X(4).
005300     05  SORT-DCHG-DOLLARS        PIC S9(12)V99.
005400
005600 WORKING-STORAGE SECTION.
005700 77  NO-MORE-SORT                 PIC XXX       VALUE SPACES.
005800 77  SAVE-STR-DEPT                PIC X(4)      VALUE SPACES.
005900 77  SAVE-CLASS                   PIC X(4)      VALUE SPACES.
006000 77  SAVE-CLASS-DCHG-TOTAL        PIC S9(12)V99 VALUE ZEROS.
       77  MCXCBLERR-SCOPE              PIC X(1)      VALUE "C".
006100
006200************************************************************
006300**                                                        **
006400**           D A T A B A S E   B U F F E R S              **
006500**                                                        **
006600************************************************************
006700
006800*********************
006900**  MACCOUNT-INFO  **
007000*********************
007100
007200 COPY MACTINFO IN COPYLIB.
007300
007400*********************
007500**  MCLASS         **
007600*********************
007700
007800 COPY MCLASS IN COPYLIB.
007900
008000******************
008100**    DTRANS    **
008200******************
008300
008400 COPY DTRANS IN COPYLIB.
008500
008700**********************************************************
008800*              D A T A    B A S E                        *
008900**********************************************************
009000
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)  VALUE "0".
           05  FILE-STATUS-2    PIC X(1)  VALUE "0".

009100 COPY DBCSACCT IN COPYLIB.
009200
009300 COPY DBMODES IN COPYLIB.
009400
009500 COPY DBSTAT IN COPYLIB.
009600
009800 01  DATASET-NAMES.
009900     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
010000     05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
010100     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
010200
010300 01  ITEMS-LISTING.
010400     05  ALL-ITEMS           PIC X(2)   VALUE "@;".
010500
010700 01  IMAGE-ARGS.
010800     05  MACCT-KEY            PIC X(4)   VALUE SPACES.
010900     05  CLASS-ARG            PIC X(4)   VALUE SPACES.
011000     05  DUMMY-ARG            PIC X(10)  VALUE SPACES.
011100
011300 COPY TBLOWUP IN COPYLIB.
011400
011500******************************************
011600**   PARAMETERS FOR CALLING 'CBLOWSRT'
011700******************************************
011800
011900 COPY CBLOWSRT IN COPYLIB.
012000
       COPY TDATECHK IN COPYLIB.
012100
012200 PROCEDURE DIVISION.
012300
012400 001-BEGIN SECTION.
012500
012600 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           CALL "TDATECHK" USING DATE-CHECK-AREA.
012700     DISPLAY "BEGIN PROGRAM ", DATE-FORMATTED-TIME-OUT.
012800
012900*******************************************************
013000**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
013100**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
013200**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
013300**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
013400**   OCCURS
013500*******************************************************
013600
013700     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
013800                           ACCTG-BASE,
013900                           BU-PGM-NAME,
014000                           STATUS-AREA,
014100                           DUMMY-VIEW-AREA,
014200                           FILE-STATUS,
014300                           BU-DISPLAY-MSG,
014400                           BU-DISPLAY-FLDS.
014500
014700     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
014800         INPUT PROCEDURE IS 050-PROCESS-TRANS
014900         OUTPUT PROCEDURE IS 700-CREATE-CLASFILE.
015000     PERFORM 1000-CLOSE-FILES.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
015100     DISPLAY "END PROGRAM", DATE-FORMATTED-TIME-OUT.
015200     GOBACK.
015300
015500 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
015600     PERFORM 100-BEGIN.
015700
           PERFORM 9999-INIT-MCLASS-CL-I.
015800     PERFORM 400-GET-MCLASS.
015900     PERFORM 200-PROCESS-MCLASS
016000         UNTIL END-OF-FILE.
016100
           PERFORM 9999-INIT-DTRANS-MC-I.
016200     PERFORM 400-GET-DTRANS.
016300     PERFORM 300-PROCESS-DTRANS
016400         UNTIL END-OF-FILE.
016500
016600**********************************************************
016700*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
016800*  FOR SORTING OF RECORDS.                               *
016900**********************************************************
017000
017100     GO TO 699-PROCESS-EXIT.
017200
017300 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
018400
018500****************************************************
018600**   GET STOREROOM DEPT FROM MACCOUNT-INFO        **
018700**   KEY IS EQUAL TO 'SDPT'.  THE STOREROOM DEPT. **
018800****************************************************
018900
019000     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
019800     IF GOOD-CALL
019900         MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
020000     ELSE
020100         MOVE "GET MACCOUNT-INFO 'SDPT'* 100"
020200               TO BU-DISPLAY-MSG
020300         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
020400         PERFORM 990-BLOWUP.
020500
020800 200-PROCESS-MCLASS.
020900     MOVE MCLASS-CLS              TO SORT-CLASS.
021000     MOVE ZEROS                   TO SORT-DCHG-DOLLARS.
021100     RELEASE SORT-REC.
021200
021300     PERFORM 400-GET-MCLASS.
021400
021500 300-PROCESS-DTRANS.
021600     IF TRANS-DOCUMENT-NUM = "PROC"
021700         NEXT SENTENCE
021800     ELSE
021900         IF TRANS-CODE = "INV" OR "FRT"
022000             IF TRANS-STORES-CODE = "NON-STR"
022100                 PERFORM 410-RELEASE-SORT-REC
022200             ELSE
022300                 IF TRANS-DEPT NOT = SAVE-STR-DEPT
022400                     PERFORM 410-RELEASE-SORT-REC.
022500
022600     PERFORM 400-GET-DTRANS.
022700
022900 400-GET-MCLASS.
           PERFORM 9999-DBGET2-MCLASS-CL-I.
023700     IF GOOD-CALL
023800         NEXT SENTENCE
023900     ELSE
024000         IF END-OF-FILE
024100             NEXT SENTENCE
024200         ELSE
024300             MOVE "DBGET MCLASS * 400-GM" TO BU-DISPLAY-MSG
024400             PERFORM 990-BLOWUP.
024500
024600 400-GET-DTRANS.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
024900     IF GOOD-CALL
025000         NEXT SENTENCE
025100     ELSE
025200         IF END-OF-FILE
025300             NEXT SENTENCE
025400         ELSE
025500             MOVE "GET DTRANS * 400-GD" TO BU-DISPLAY-MSG
025600             PERFORM 990-BLOWUP.
025700
025800 410-RELEASE-SORT-REC.
025900     MOVE TRANS-CLASS             TO SORT-CLASS.
026000     MOVE TRANS-VALUE             TO SORT-DCHG-DOLLARS.
026100     RELEASE SORT-REC.
026200
026400 699-PROCESS-EXIT.
026500     EXIT.
026600
026700 700-CREATE-CLASFILE SECTION.
       700-CREATE-CLASFILE-PARA.
026800     PERFORM 710-BEGIN-CLASFILE.
026900     PERFORM 720-PROCESS-DATA
027000        UNTIL NO-MORE-SORT = "YES".
027100
027200**************************************************
027300**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
027400**  TO COMPLETE PROCESSING OF REPORT            **
027500**************************************************
027600
027700     GO TO 799-CREATE-EXIT.
027800
027900 710-BEGIN-CLASFILE.
028000     OPEN OUTPUT CLASS-EXT.
028100
028200     RETURN SORT-FILE
028300        AT END
028400            MOVE "YES" TO NO-MORE-SORT.
028500
028600 720-PROCESS-DATA.
028700     MOVE SORT-CLASS              TO SAVE-CLASS.
028800     MOVE ZEROS                   TO SAVE-CLASS-DCHG-TOTAL.
028900     PERFORM 730-PROCESS-CLASS
029000        UNTIL SORT-CLASS NOT = SAVE-CLASS OR
029100                NO-MORE-SORT = "YES"
029200     PERFORM 740-WRITE-CLASFILE-ENTRY.
029300
029500 730-PROCESS-CLASS.
029600     ADD SORT-DCHG-DOLLARS        TO SAVE-CLASS-DCHG-TOTAL.
029700
029800     RETURN SORT-FILE
029900        AT END
030000            MOVE "YES" TO NO-MORE-SORT.
030100
030300 740-WRITE-CLASFILE-ENTRY.
030400     MOVE SAVE-CLASS              TO CLASS-NO-EXT,
030500                                     CLASS-ARG.
030600     PERFORM 800-GET-MCLASS.
030700     MOVE SAVE-CLASS-DCHG-TOTAL   TO CLASS-DOLLARS-EXT.
030800     WRITE CLASS-EXT-REC.
030900
031100 800-GET-MCLASS.
           PERFORM 9999-DBGET7-MCLASS-CL-I.
031400     IF GOOD-CALL
031500         MOVE MCLASS-CLASS-DESCR  TO CLASS-DESCR-EXT
031600         MOVE MCLASS-ONDOCK-CARRY TO CLASS-ONDOCK-CARRY-EXT
031700     ELSE
031800         IF NO-ENTRY
031900             MOVE "INVALID CLASS" TO CLASS-DESCR-EXT
032000             MOVE ZEROS           TO CLASS-ONDOCK-CARRY-EXT
032100         ELSE
032200             MOVE "GET MCLASS * 800-GM" TO BU-DISPLAY-MSG
032300             MOVE CLASS-ARG      TO BU-DISPLAY-FLD (1)
032400             PERFORM 990-BLOWUP.
032500
032700 799-CREATE-EXIT.
032800     EXIT.
032900
033100 900-ERROR SECTION.
033200
033300 990-BLOWUP.
033400
033500***************************************************************
033600**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
033700**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
033800**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
033900**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
034000**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
034100**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
034200**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
034300**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
034400**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
034500**   PROBLEM IS AVOIDED.                                     **
034600***************************************************************
034700
034800     MOVE "TDRCHGIV"              TO  BU-PGM-NAME.
034900     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
035000                           ACCTG-BASE,
035100                           BU-PGM-NAME,
035200                           STATUS-AREA,
035300                           DUMMY-VIEW-AREA,
035400                           FILE-STATUS,
035500                           BU-DISPLAY-MSG,
035600                           BU-DISPLAY-FLDS.
035700
035900 1000-CLOSE-FILES.
036000     CLOSE CLASS-EXT.
           PERFORM 9999-CLOSE-STUFF.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-DBGET2-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           READ MCLASS-CL-I NEXT INTO BUF-MCLASS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-INIT-MCLASS-CL-I.
           MOVE SPACES TO ACTGCLASS OF MCLASS-CL-REC-I.
           START MCLASS-CL-I KEY >= ACTGCLASS OF MCLASS-CL-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT MCLASS-CL-I          .
           OPEN INPUT DTRANS-MC-I          .

       9999-CLOSE-STUFF.
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      MCLASS-CL-I          .
           CLOSE      DTRANS-MC-I          .
