       IDENTIFICATION DIVISION.
       PROGRAM-ID.           TDTLCHGS.
       AUTHOR.               MK MADDEN.
       DATE-WRITTEN.         JUNE 12, 1985.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *REMARKS.              THIS PROGRAM WILL READ THROUGH THE
      *                      DETAIL TRANSACTION DATA SET
      *                      AND FIND ALL ISS, ADJ, RET, RETV AND DIRECT
      *                      INVOICE TCS AND SORT AND PRINT THEM
      *                      IN REPORT CODE, LEDGER CODE, DEPT, CLASS,
      *                      AND DEPT/ACCOUNT ORDER.
      *C
      *C 27MAY1992    DAVE PLUM   REQUEST # 6196
      *C REVISED PARAGRAPH 500-GET-MMATL-ACCUM TO INCLUDE THE
      *C IF STATEMENT 'IF TRANS-CODE = "INV" OR "FRT"',  INSTEAD OF
      *C 'IF TRANS-CODE = "INV"'.  FRT CHARGES FOR CODED ITEMS HAVING
      *C NEW-WORK NUMBERS WERE NOT BEING TREATED THE SAME AS INVOICE
      *C CHARGES.
      *C
      *C 08FEB1994    DAVE PLUM
      *C ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C 08JUL1994    CR KALMAN   REQUEST # 6090
      *C REVISED DETAIL OF CHARGES REPORT TO HANDLE INVALID DEPTS.
      *C IT NO LONGER BLOWS UP WHEN AN INVALID DEPT IS FOUND.  IT
      *C NOW PRINTS AN "INVALID DEPT" MESSAGE AND AT THE END OF THE
      *C PROGRAM, THE FILE VCH85FLE IS CLEARED.
      *C
      *C 08DEC1994    CA ZUBEK    REQUEST # 94-050
      *C ADDED LOGIC TO PRINT OUT CONTROL BREAK TOTALS ON REPORT FOR
      *C VOUCHER 24.  SUB-TOTALS SHOW THE ACCUMULATED TOTALS FOR
      *C QUANTITY, ACTUAL, STANDARD, AND VARIANCE COLUMNS AFTER EACH
      *C CORPORATE CODE.
      *C
      *C 04SEP1996    CA YODER
      *C RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C 01DEC1997    CA YODER    REQ #: 97-014
      *C DIRECTED PRINTED OUTPUT TO FILE "DDTLCHGS" INSTEAD OF TO
      *C MCPRT.  THIS WILL ALLOW PROCESSING THE REPORT THROUGH
      *C "TPRTRPT" WHICH WILL DIRECT THE OUTPUT TO DIFFERENT OUTQS
      *C BASED ON DEPARTMENT.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.      HP-3000.
       OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-PO-I
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREPORT-RC-I
               ASSIGN TO DATABASE-MCFLCA0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MLEDGER-LD-I
               ASSIGN TO DATABASE-MCFLCA0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

      ***  SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT ONLINE-PRT ASSIGN TO DISK-DDTLCHGS.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT VCHR85-CHGS-FILE ASSIGN TO DISK-VCH85FLE.

       DATA DIVISION.
       FILE SECTION.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  DPODATAITM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-PO-REC-I.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MREPORT-RC-I
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-RC-REC-I.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.

       FD  MLEDGER-LD-I
           LABEL RECORDS ARE STANDARD.
       01  MLEDGER-LD-REC-I.
           COPY DDS-MCRPCA0500  OF MCFLCA0501.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

       FD  ONLINE-PRT
           DATA RECORD IS PRT-REC
           RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS ARE OMITTED.

       01  PRT-REC.
           05  PRT-CTL                   PIC X.
           05  PRT-LINE                  PIC X(132).

       SD  SORT-FILE
           DATA RECORD IS SORT-REC
9407CK     RECORD CONTAINS 154 CHARACTERS.

       01  SORT-REC.
           05  SORT-REPORT-CODE         PIC X(2).
           05  SORT-LEDG-CODE.
               10  SORT-LEDG            PIC XX.
               10  SORT-DIV             PIC XX.
           05  SORT-DEPT-ACCT.
               10  SORT-DEPT-CHGD       PIC X(6).
               10  SORT-ACCT-CHGD       PIC X(6).
           05  SORT-CLASS               PIC X(3).
           05  SORT-CODE-OR-PO          PIC X(7).
           05  SORT-UNIT-MEAS           PIC XX.
           05  SORT-TRANS-TYPE          PIC X(4).
           05  SORT-DESCR               PIC X(60).
           05  SORT-QTY-CHGD            PIC S9(10).
           05  SORT-VALUE               PIC S9(12)V99.
           05  SORT-STD-VALUE           PIC S9(12)V99.
           05  SORT-VAR                 PIC S9(12)V99.
           05  SORT-PO-RLS              PIC X(3).
           05  SORT-PO-ITEM             PIC X(4).
9407CK     05  SORT-ERR                 PIC X.

       FD  VCHR85-CHGS-FILE
           DATA RECORD IS VCH85-REC
           RECORD CONTAINS 71 CHARACTERS
           LABEL RECORDS ARE STANDARD.

       01  VCH85-REC.
           05  VO85-REC-ID               PIC X.
           05  VO85-LEDGER               PIC X(4).
           05  VO85-DEPT                 PIC X(4).
           05  VO85-ACCT                 PIC X(6).
           05  VO85-SUB-ACCT             PIC X(5).
           05  VO85-NWO                  PIC X(6).
           05  VO85-HOURS                PIC S9(7)V99.
           05  VO85-LABOR                PIC S9(7)V99.
           05  VO85-OVERTIME             PIC S9(7)V99.
           05  VO85-OVERHEAD             PIC S9(7)V99.
           05  VO85-MATL-VALUE           PIC S9(7)V99.

       WORKING-STORAGE SECTION.

       77  ENTRIES-READ                  PIC 9(6)   VALUE 0.
       77  NO-MORE-SORT                  PIC XXX     VALUE SPACES.
       77  LINE-CNT                      PIC 99     VALUE 0.
       77  PAGE-CNT                      PIC 9(4)    VALUE 0.
      *********************************************************
       77  GRAND-ACTUAL                  PIC S9(12)V99  VALUE 0.
       77  GRAND-STANDARD                PIC S9(12)V99  VALUE 0.
       77  GRAND-VARIANCE                PIC S9(12)V99  VALUE 0.
       77  GRAND-QTY                     PIC S9(10)     VALUE 0.
      *********************************************************
       77  VOUCHER-ACTUAL                PIC S9(12)V99  VALUE 0.
       77  VOUCHER-STANDARD              PIC S9(12)V99  VALUE 0.
       77  VOUCHER-VARIANCE              PIC S9(12)V99  VALUE 0.
       77  VOUCHER-QTY                   PIC S9(10)     VALUE 0.
      *********************************************************
       77  LEDGER-ACTUAL                 PIC S9(12)V99  VALUE 0.
       77  LEDGER-STANDARD               PIC S9(12)V99  VALUE 0.
       77  LEDGER-VARIANCE               PIC S9(12)V99  VALUE 0.
       77  LEDGER-QTY                    PIC S9(10)     VALUE 0.
      *********************************************************
       77  DEPT-ACTUAL                   PIC S9(12)V99  VALUE 0.
       77  DEPT-STANDARD                 PIC S9(12)V99  VALUE 0.
       77  DEPT-VARIANCE                 PIC S9(12)V99  VALUE 0.
       77  DEPT-QTY                      PIC S9(10)     VALUE 0.
      *********************************************************
       77  CLASS-ACTUAL                  PIC S9(12)V99  VALUE 0.
       77  CLASS-STANDARD                PIC S9(12)V99  VALUE 0.
       77  CLASS-VARIANCE                PIC S9(12)V99  VALUE 0.
       77  CLASS-QTY                     PIC S9(10)      VALUE 0.
      *********************************************************
       77  NWO-ACTUAL                    PIC S9(12)V99  VALUE 0.
       77  NWO-STANDARD                  PIC S9(12)V99  VALUE 0.
       77  NWO-VARIANCE                  PIC S9(12)V99  VALUE 0.
       77  NWO-QTY                       PIC S9(10)      VALUE 0.
      *********************************************************
       77  PREV-REPORT-CODE              PIC XX         VALUE SPACES.
       77  PREV-LEDGER                   PIC X(2)       VALUE SPACES.
       77  PREV-DEPT                     PIC X(6)       VALUE SPACES.
       77  PREV-CLASS                    PIC X(4)       VALUE SPACES.
       77  PREV-NWO                      PIC X(6)      VALUE SPACES.
       77  ITEM-FOUND                    PIC 9         VALUE 0.
       77  NO-ACTUAL-VALUE-SW            PIC X(1)      VALUE SPACES.
       77  MCXCBLERR-SCOPE               PIC X(1)       VALUE "C".
9407CK 77  FOUND-ERROR                   PIC X          VALUE SPACES.

       01  TIME-DIV.
           05  HH-DIV                    PIC XX   VALUE SPACES.
           05  MM-DIV                    PIC XX   VALUE SPACES.
           05  SS-DIV                    PIC XX   VALUE SPACES.

       01  DATE-DIVIDED.
           05  MONTH-DIV                PIC XX   VALUE SPACES.
           05  FILLER                   PIC X    VALUE SPACES.
           05  DAY-DIV                  PIC XX   VALUE SPACES.
           05  FILLER                   PIC X    VALUE SPACES.
           05  YEAR-DIV                 PIC XX   VALUE SPACES.

       01  MONTH-TABLE.
           05  FILLER                   PIC X(9)  VALUE "JANUARY".
           05  FILLER                   PIC X(9)  VALUE "FEBRUARY".
           05  FILLER                   PIC X(9)  VALUE "MARCH".
           05  FILLER                   PIC X(9)  VALUE "APRIL".
           05  FILLER                   PIC X(9)  VALUE "MAY".
           05  FILLER                   PIC X(9)  VALUE "JUNE".
           05  FILLER                   PIC X(9)  VALUE "JULY".
           05  FILLER                   PIC X(9)  VALUE "AUGUST".
           05  FILLER                   PIC X(9)  VALUE "SEPTEMBER".
           05  FILLER                   PIC X(9)  VALUE "OCTOBER".
           05  FILLER                   PIC X(9)  VALUE "NOVEMBER".
           05  FILLER                   PIC X(9)  VALUE "DECEMBER".

       01  MONTH-TAB REDEFINES MONTH-TABLE.
           05  MONTH-T OCCURS 12 TIMES  PIC X(9).

       01  MONTH-YEAR.
           05  MONTH-PARM               PIC 99.
           05  YEAR-PARM                PIC 99.

      *--- THESE FIELDS ARE USED FOR THE LOGIC ADDED FOR THE CONTROL
      *--- BREAK TOTALS ON THE REPORT.      12DEC1994.

       01  CONTROL-BREAK-FIELDS.
           05  HOLD-CODE-OR-PO          PIC X(7).

           05  CONTROL-BREAK-TOTALS.
               10  TOTAL-QTY-CHGD       PIC S9(12).
               10  TOTAL-VALUE          PIC S9(14)V99.
               10  TOTAL-STD-VALUE      PIC S9(14)V99.
               10  TOTAL-VAR            PIC S9(14)V99.

       01  CURRENT-DATE.
           05  CURRENT-YY        PIC X(2).
           05  CURRENT-MM        PIC X(2).
           05  CURRENT-DD        PIC X(2).

      ************************************************************
      **     PARMS FOR QCMDEXC                                  **
      ************************************************************

       01  CLRPFM-CMD.
           05  FILLER                     PIC X(21) VALUE
               "CLRPFM FILE(VCH85FLE)".

       01  CLRPFM-CMD-LEN                 PIC S9(10)V9(5) COMP-3
                                                    VALUE 21.
      ************************************************************
      **     REPORT PRINT LINES                                 **
      ************************************************************

       01  HEADER1.
           05  FILLER                     PIC X      VALUE SPACES.
           05  FILLER                     PIC X(49)
               VALUE "TDTLCHGS".
           05  FILLER                     PIC X(69)
               VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
           05  FILLER                     PIC X(5)   VALUE "DATE ".
           05  DATE-H1                    PIC X(8)   VALUE SPACES.

       01  HEADER2.
           05  FILLER                     PIC X      VALUE SPACES.
           05  FILLER                     PIC X(6)   VALUE "PAGE".
           05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
           05  FILLER                     PIC X(42)  VALUE SPACES.
           05  FILLER                     PIC X(66)
               VALUE "STORES DETAIL OF CHARGES".
           05  FILLER                     PIC X(5)   VALUE "TIME ".
           05  TIME-H2.
               10  HH-H2                  PIC XX     VALUE SPACES.
               10  FILLER                 PIC X      VALUE ":".
               10  MM-H2                  PIC XX     VALUE SPACES.
               10  FILLER                 PIC X      VALUE ":".
               10  SS-H2                  PIC XX     VALUE SPACES.

       01  HEADER3.
           05  FILLER                     PIC X(57)  VALUE SPACES.
           05  MONTH-H3                   PIC X(9)   VALUE SPACES.
           05  FILLER                     PIC X(3)   VALUE SPACES.
           05  YEAR-H3A                   PIC X(2)   VALUE "20".
           05  YEAR-H3B                   PIC X(2)   VALUE SPACES.

       01  HEADER4.
           05  FILLER                     PIC X      VALUE SPACES.
           05  FILLER                     PIC X(30)
                    VALUE "LC DEPT   ACCOUNT CODE OR PO".
           05  FILLER                     PIC X(42)
                    VALUE "RLS ITM  TRANS DESCR".
           05  FILLER                    PIC X(10)  VALUE "UM".
           05  FILLER                     PIC X(25)
                    VALUE "QTY         ACTUAL".
           05  FILLER                     PIC X(23)
                    VALUE "STANDARD       VARIANCE".

       01  REPORT-HDG.
           05  FILLER                     PIC X(13)
                VALUE "REPORT CODE".
           05  REPORT-DESCR-HDG           PIC X(60).

       01  BLANK-LINE                     PIC X(133)   VALUE SPACES.

       01  DETAIL-LINE.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-LEDGER                 PIC X(2)   VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-DEPT                   PIC X(6)   VALUE SPACES.
           05  PRT-HYPHEN                 PIC X      VALUE SPACES.
           05  PRT-ACCOUNT                PIC X(6)   VALUE SPACES.
           05  FILLER                     PIC X(2)   VALUE SPACES.
           05  PRT-CLASS                  PIC X(3).
           05  PRT-HYPHEN2                PIC X      VALUE SPACES.
           05  PRT-CODE-OR-PO             PIC X(7).
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-RLS                    PIC XXX    VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-ITEM                   PIC X(4)   VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-TRANS-CODE             PIC X(4)   VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-DESCR                  PIC X(27)  VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-UM                     PIC XX     VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-QTY                    PIC Z(10)-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-ACTUAL                 PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-STD                    PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-VAR                    PIC Z(10).ZZ-.

      *---- DETAIL LINE ADDED FOR CONTROL BREAK SUB-TOTALS.  08DEC1994

       01  SUB-TOTAL-DETAIL-LINE.
           05  FILLER                   PIC X(23)  VALUE
                                       "CORP CODE OR PO TOTAL  ".
           05  TD-CODE-OR-PO            PIC X(07).
           05  FILLER                   PIC X(46)  VALUE SPACES.
           05  TD-QTY-CHGD              PIC Z(10)-.
           05  FILLER                   PIC X      VALUE SPACES.
           05  TD-VALUE                 PIC Z(10).ZZ-.
           05  FILLER                   PIC X      VALUE SPACES.
           05  TD-STD-VALUE             PIC Z(10).ZZ-.
           05  FILLER                   PIC X      VALUE SPACES.
           05  TD-VAR                   PIC Z(10).ZZ-.

       01  VOUCHER-LINE.
           05  FILLER                     PIC X(13) VALUE "VCHR TOTAL".
           05  REPORT-CODE-TRLR            PIC XX     VALUE SPACES.
           05  FILLER                     PIC XX     VALUE SPACES.
           05  REPORT-TRAILER             PIC X(59)  VALUE SPACES.
           05  VOUCHER-QTY-PRT            PIC Z(10)-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  VOUCHER-ACTUAL-PRT         PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  VOUCHER-STANDARD-PRT       PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  VOUCHER-VARIANCE-PRT       PIC Z(10).ZZ-.

       01  LEDGER-LINE.
           05  FILLER                     PIC X(13)  VALUE "LEDG TOTAL".
           05  LEDG-CODE-TRLR             PIC XX     VALUE SPACES.
           05  FILLER                     PIC XX     VALUE SPACES.
           05  LEDGER-TRAILER             PIC X(59)  VALUE SPACES.
           05  LEDGER-QTY-PRT             PIC Z(10)-.
           05  FILLER                     PIC X       VALUE SPACES.
           05  LEDGER-ACTUAL-PRT          PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  LEDGER-STANDARD-PRT        PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  LEDGER-VARIANCE-PRT        PIC Z(10).ZZ-.

       01  DEPT-LINE.
           05  FILLER                     PIC X(11)  VALUE "DEPT TOTAL".
           05  DEPT-CODE-TRLR             PIC X(4)   VALUE SPACES.
           05  FILLER                     PIC XX     VALUE SPACES.
           05  DEPT-TRAILER               PIC X(59)  VALUE SPACES.
           05  DEPT-QTY-PRT               PIC Z(10)-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  DEPT-ACT-PRT               PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  DEPT-STD-PRT               PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  DEPT-VAR-PRT               PIC Z(10).ZZ-.

       01  CLASS-LINE.
           05  FILLER                     PIC X(12)
                VALUE "CLASS TOTAL".
           05  CLASS-CODE-TRLR            PIC X(3)   VALUE SPACES.
           05  FILLER                     PIC XX     VALUE SPACES.
           05  CLASS-TRAILER              PIC X(59)  VALUE SPACES.
           05  CLASS-QTY-PRT              PIC Z(10)-.
           05  FILLER                     PIC X       VALUE SPACES.
           05  CLASS-ACT-PRT              PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  CLASS-STD-PRT              PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  CLASS-VAR-PRT              PIC Z(10).ZZ-.

       01  NWO-LINE.
           05  FILLER                     PIC X(12)
                VALUE "NWO TOTAL".
           05  NWO-TRLR                   PIC X(6)   VALUE SPACES.
           05  FILLER                     PIC X(58)  VALUE SPACES.
           05  NWO-QTY-PRT                PIC Z(10)-.
           05  FILLER                     PIC X       VALUE SPACES.
           05  NWO-ACT-PRT                PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  NWO-STD-PRT                PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  NWO-VAR-PRT                PIC Z(10).ZZ-.

       01  GRAND-LINE.
           05  FILLER                     PIC X(76)
                VALUE "TOTAL STORES CHARGES".
           05  GRAND-QTY-PRT              PIC Z(10)-.
           05  FILLER                     PIC X        VALUE SPACES.
           05  GRAND-ACTUAL-PRT           PIC Z(10).ZZ-.
           05  FILLER                     PIC X       VALUE SPACES.
           05  GRAND-STANDARD-PRT         PIC Z(10).ZZ-.
           05  FILLER                     PIC X       VALUE SPACES.
           05  GRAND-VARIANCE-PRT         PIC Z(10).ZZ-.

       01  NO-ACTUAL-ERROR-LINE.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  FILLER  PIC X(7)  VALUE "*****  ".
           05  FILLER  PIC X(11) VALUE "WARNING || ".
           05  FILLER  PIC X(13) VALUE "TRANSACTIONS ".
           05  FILLER  PIC X(13) VALUE "ACTUAL VALUE ".
           05  FILLER  PIC X(9)  VALUE "IS ZERO  ".
           05  FILLER  PIC X(5)  VALUE "*****".

9407CK 01  INVALID-DEPT-LINE.
  .        05  FILLER  PIC X(5)  VALUE SPACES.
  .        05  FILLER  PIC X(7)  VALUE "*****  ".
  .        05  FILLER  PIC X(12) VALUE "INVALID DEPT".
9407CK     05  FILLER  PIC X(7)  VALUE "  *****".

       01  ASTERISK-LINE.
           05  FILLER  PIC X(80) VALUE ALL "*".

       01  ERROR-MSG-LINE1.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(11) VALUE "WARNING||||".
           05  FILLER  PIC X(61) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

       01  ERROR-MSG-LINE2.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(25) VALUE "ONE OR MORE TRANSACTIONS ".
           05  FILLER  PIC X(24) VALUE "CONTAIN AN ACTUAL VALUE ".
           05  FILLER  PIC X(9)  VALUE "OF ZEROS.".
           05  FILLER  PIC X(14) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

       01  ERROR-MSG-LINE3.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(28) VALUE "THE INDIVIDUAL TRANSACTIONS ".
           05  FILLER  PIC X(24) VALUE "HAVE BEEN FLAGED WITH A ".
           05  FILLER  PIC X(16) VALUE "WARNING MESSAGE.".
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

       01  ERROR-MSG-LINE4.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(20) VALUE "PLEASE REVIEW THESE ".
           05  FILLER  PIC X(26) VALUE "TRANSACTIONS TO MAKE SURE ".
           05  FILLER  PIC X(22) VALUE "THESE TRANSACTIONS ARE".
           05  FILLER  PIC X(4) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

       01  ERROR-MSG-LINE5.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(28) VALUE "CORRECT.  ALL RAW MATERIALS ".
           05  FILLER  PIC X(26) VALUE "MUST HAVE AN ACTUAL VALUE ".
           05  FILLER  PIC X(11) VALUE "IN ORDER TO".
           05  FILLER  PIC X(7)  VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

       01  ERROR-MSG-LINE6.
           05  FILLER  PIC X(6)  VALUE "**    ".
           05  FILLER  PIC X(23) VALUE "COMPUTE A RAW MATERIAL ".
           05  FILLER  PIC X(9)  VALUE "VARIANCE.".
           05  FILLER  PIC X(40) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".

      ************************************************************
      **                                                        **
      **           D A T A B A S E   B U F F E R S              **
      **                                                        **
      ************************************************************

      *********************
      **  MMATL-ACCUM    **
      *********************

       COPY MATLACUM IN COPYLIB.

      ******************
      **    DTRANS    **
      ******************
       COPY DTRANS IN COPYLIB.

      *****************
      *  MCHT-ACCTS   *
      *****************
       COPY MCHTACCT IN COPYLIB.

      *****************
      *   MCLASS      *
      *****************
       COPY MCLASS IN COPYLIB.

      *****************
      *   MREPORT     *
      *****************
       COPY MREPORT IN COPYLIB.

      *****************
      *   MLEDGER     *
      *****************
       COPY MLEDGER IN COPYLIB.

      *****************
      *   PODATAITM   *
      *****************
       COPY DPODATA IN COPYLIB.

      *****************
      *   MSTORERM    *
      *****************

       COPY MSTORERM IN COPYLIB.

      ****************************
      **    MACCOUNT-INFO       **
      ****************************

       COPY MACTINFO IN COPYLIB.

      **********************************************************
      *              D A T A    B A S E                        *
      **********************************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

       COPY DBCSACCT IN COPYLIB.

       01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
       01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".

       COPY DBMODES IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
           05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
           05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
           05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
           05  DSET-MREPORT     PIC X(16)  VALUE "MREPORT;".
           05  DSET-MCHT-ACCTS  PIC X(16)  VALUE "MCHT-ACCTS;".
           05  DSET-DPODATA     PIC X(16)  VALUE "DPODATAITM;".
           05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
           05  DSET-MLEDG       PIC X(16)  VALUE "MLEDGER;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS         PIC X(2)   VALUE "@;".
           05  PO-KEY            PIC X(10)  VALUE "PO-RCV-NO;".

       01  IMAGE-ARGS.
           05  MACCT-KEY         PIC X(4)   VALUE SPACES.
           05  MMATL-CODE-ARG.
               10  MMATL-FST4    PIC XXXX  VALUE SPACES.
               10  MMATL-LST4    PIC XXXX  VALUE SPACES.
           05  DEPT-KEY          PIC X(6)   VALUE SPACES.
           05  PO-KEY-ARG.
               10  KEY-REC-ID    PIC X    VALUE SPACES.
               10  KEY-PO-NO     PIC X(7) VALUE SPACES.
               10  KEY-PO-REL    PIC XXX  VALUE SPACES.
               10  KEY-PO-REC    PIC XXX  VALUE SPACES.
           05  REPORT-CODE-ARG   PIC XX   VALUE SPACES.
           05  CLASS-ARG         PIC X(4)  VALUE SPACES.
           05  LEDG-ARG          PIC X(4)  VALUE SPACES.

      *******************************************************
      *   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
      *   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
      *   READ ERRORS).                                     *
      *******************************************************

       COPY TBLOWUP IN COPYLIB.

      ******************************************
      **   PARAMETERS FOR CALLING 'CBLOWSRT'
      ******************************************

       COPY CBLOWSRT IN COPYLIB.

      *------- PARAMETERS FOR "SGETRPT" TO GET REPORT DISTRIBUTION
      *------- INFORMATION.
       01  SGETRPT-PARMS.
           05  SGETRPT-PGM              PIC X(8).
           05  SGETRPT-ID               PIC X(4).
           05  SGETRPT-SW               PIC X.
           05  SGETRPT-KEY              PIC X(10).
           05  SGETRPT-PRINTER          PIC X(2).

      ********************************************************
      **      C D E S C   P A R A M E T E R S               **
      ********************************************************

       COPY CDESC IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

       PROCEDURE DIVISION.

       001-BEGIN SECTION.

       010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

      *******************************************************
      **   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
      **   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
      **   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
      **   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
      **   OCCURS
      *******************************************************

           CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
                                 ACCTG-BASE,
                                 BU-PGM-NAME,
                                 STATUS-AREA,
                                 DUMMY-VIEW-AREA,
                                 FILE-STATUS,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.

      *--------- GET REPORT DISTRIBUTION INFO.
           MOVE "TDTLCHGS"       TO  SGETRPT-PGM.
           CALL "SGETRPT" USING SGETRPT-PARMS.

           SORT SORT-FILE ON ASCENDING KEY SORT-REPORT-CODE
                                           SORT-LEDG-CODE
                                           SORT-DEPT-CHGD
                                           SORT-CLASS
                                           SORT-DEPT-ACCT
                                           SORT-CODE-OR-PO
               INPUT PROCEDURE IS 050-PROCESS-TRANS
               OUTPUT PROCEDURE IS 700-CREATE-REPORT.
           PERFORM 1000-CLOSE-FILES.
           GOBACK.

       050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
           PERFORM 100-BEGIN.
           PERFORM 200-PROCESS-DETAIL
               UNTIL END-OF-FILE.

      **********************************************************
      *  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
      *  FOR SORTING OF RECORDS.                               *
      **********************************************************

           GO TO 699-PROCESS-EXIT.

       100-BEGIN.
           MOVE SPACES TO BU-DISPLAY-AREA.
           PERFORM 9999-OPEN-STUFF.
           OPEN OUTPUT VCHR85-CHGS-FILE.
           MOVE SPACES TO SORT-REC.
           MOVE 0 TO SORT-VALUE
                     SORT-STD-VALUE
                     SORT-VAR
                     SORT-QTY-CHGD.
           PERFORM 620-GET-STR-DEPT.
           PERFORM 9999-INIT-DTRANS-MC-I.
           PERFORM 400-GET-DTRANS.

       200-PROCESS-DETAIL.
           IF TRANS-DOCUMENT-NUM = "PROC"
               NEXT SENTENCE
           ELSE
               IF TRANS-CODE-TRANS = "ISS"
                   PERFORM 500-GET-MMATL-ACCUM
                   PERFORM 510-GET-LEDGER
                   PERFORM 520-GET-DESCR
                   PERFORM 550-GET-MSTORERM
                   PERFORM 600-BUILD-SORT-REC
               ELSE
               IF TRANS-CODE = "RET " OR "SADJ" OR "AADJ" OR "RETV"
                   PERFORM 500-GET-MMATL-ACCUM
                   PERFORM 510-GET-LEDGER
                   PERFORM 520-GET-DESCR
                   PERFORM 550-GET-MSTORERM
                   PERFORM 600-BUILD-SORT-REC
               ELSE
                   IF TRANS-CODE = "INV" OR "FRT"
                       IF TRANS-STORES-CODE = "NON-STR"
                           PERFORM 500-GET-MMATL-ACCUM
                           PERFORM 510-GET-LEDGER
                           PERFORM 520-GET-DESCR
                           PERFORM 550-GET-MSTORERM
                           PERFORM 600-BUILD-SORT-REC
                       ELSE
                       IF TRANS-DEPT NOT = MACCT-STR-DEPT
                           PERFORM 500-GET-MMATL-ACCUM
                           PERFORM 510-GET-LEDGER
                           PERFORM 520-GET-DESCR
                           PERFORM 550-GET-MSTORERM
                           PERFORM 600-BUILD-SORT-REC
                       ELSE
                           NEXT SENTENCE
                   ELSE
                       NEXT SENTENCE.
           PERFORM 400-GET-DTRANS.

       400-GET-DTRANS.
           ADD 1 TO ENTRIES-READ.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF END-OF-FILE
                   NEXT SENTENCE
               ELSE
                   MOVE "DBGET DTRANS * 400-GET" TO
                        BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
           MOVE TRANS-STORES-CODE TO MMATL-CODE-ARG.

       500-GET-MMATL-ACCUM.
           IF MMATL-CODE-ARG = "NON-STR"
               PERFORM 505-SET-REPORT-CODE
           ELSE
               PERFORM 9999-DBGET7-MMATL-ACCUM-MC-I
               IF GOOD-CALL
                   IF TRANS-ACCT > "009999"
      *****************IF TRANS-CODE = "INV"  ***REPLACED 27MAY92 DAP
                       IF TRANS-CODE = "INV" OR "FRT"
                           MOVE 06 TO SORT-REPORT-CODE
                       ELSE
                           MOVE 04 TO SORT-REPORT-CODE
                   ELSE
                       MOVE MATL-REPORT-CODE TO SORT-REPORT-CODE
               ELSE
                   MOVE "DBGET MMATL-ACCUM * 500-GMA" TO BU-DISPLAY-MSG
                   MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP.

      **********************************************************
      **  THIS SECTION SETS THE REPORT CODE FOR DIRECT        **
      **  DELIVERIES THAT ARE NOT CODED.  ALL CODED ITEMS     **
      **  HAVE A REPORT CODE ATTACHED.                        **
      **********************************************************

       505-SET-REPORT-CODE.
      *    IF TRANS-CLASS < 200
      *        MOVE 02 TO SORT-REPORT-CODE
      *    ELSE
      *        IF TRANS-CLASS < 344
      *            MOVE 05 TO SORT-REPORT-CODE
      *        ELSE
      *            IF TRANS-CLASS < 400
      *                MOVE 01 TO SORT-REPORT-CODE
      *            ELSE
      *                IF TRANS-CLASS < 500
      *                    MOVE 02 TO SORT-REPORT-CODE
      *                ELSE
      *                    MOVE 01 TO SORT-REPORT-CODE.
      ******************************************************
      *    THE ABOVE LOGIC WAS CHANGED 7/30/97 DUE TO      *
      *    VALLEYFIELD USING CLASS 080 FOR MAJOR SPARE     *
      *    PARTS.....JIM C.                                *
      ******************************************************
068100     IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
068200        (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
068300         MOVE "02"                TO SORT-REPORT-CODE
068400     ELSE
068500     IF (TRANS-CLASS > 199 AND TRANS-CLASS < 344)
068600         MOVE "05"                TO SORT-REPORT-CODE
068700     ELSE
068800     IF (TRANS-CLASS > 343 AND TRANS-CLASS < 400)  OR
068900        (TRANS-CLASS > 499) OR (TRANS-CLASS < 100)
069000         MOVE "01"                TO SORT-REPORT-CODE.
           IF TRANS-ACCT = "000000" OR TRANS-ACCT = SPACES
               NEXT SENTENCE
           ELSE
      *        IF TRANS-CLASS < 200 OR TRANS-CLASS > 399
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
                   (TRANS-CLASS > 399)
                   NEXT SENTENCE
               ELSE
                   IF TRANS-ACCT > "009999"
                       MOVE 06 TO SORT-REPORT-CODE
                   ELSE
                       IF TRANS-ACCT = "000951"
                           MOVE 02 TO SORT-REPORT-CODE
                       ELSE
                           IF TRANS-ACCT < "000100"
                               OR TRANS-ACCT = "000251" OR
                                  "000252" OR "000253" OR "000250"
                                  OR "000254"
                                     OR "000891" OR "000892"
                                   MOVE 05 TO SORT-REPORT-CODE
                           ELSE
                               MOVE 01 TO SORT-REPORT-CODE.

       510-GET-LEDGER.
           MOVE TRANS-DEPT TO DEPT-KEY.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
9407CK     IF NO-ENTRY
  .            MOVE "1" TO SORT-ERR
  .            MOVE "Y" TO FOUND-ERROR
  .            INITIALIZE BUF-MCHTACCTS
9407CK     ELSE
               MOVE "DBGET MCHT-ACCTS * 510-GL" TO BU-DISPLAY-MSG
               MOVE DEPT-KEY TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.

           MOVE MCHT-LEDGERT TO SORT-LEDG-CODE.

       520-GET-DESCR.
           IF TRANS-STORES-CODE = "NON-STR"
               PERFORM 530-GET-PO-DESCR
           ELSE
               IF MMATL-FST4 = "ACCR"
                   MOVE "WRITEDOWN" TO SORT-DESCR
               ELSE
                   MOVE 1               TO CDESC-LINES-TO-GET
                   MOVE "N"             TO CDESC-LOCAL-DESC-OPTION
                   CALL "CDESC" USING CDESC-RET-CODE
                                      STORES-BASE
                                      STATUS-AREA
                                      BU-DISPLAY-MSG
                                      TRANS-STORES-CODE
                                      CDESC-DATA
                   MOVE CDESC (1)       TO SORT-DESCR.

       530-GET-PO-DESCR.
           MOVE "P" TO KEY-REC-ID.
           MOVE TRANS-ORDER-NUM TO KEY-PO-NO.
           MOVE TRANS-RELEASE TO KEY-PO-REL.
           MOVE "000" TO KEY-PO-REC.
           PERFORM 9999-DBFIND-DPODATAITM-PO-I.
           IF GOOD-CALL
               PERFORM 540-CONT-DESCR UNTIL ITEM-FOUND = 1
                          OR END-OF-CHAIN
               MOVE 0 TO ITEM-FOUND
           ELSE
               IF NO-ENTRY
                    DISPLAY "NO FIND FOR PO NUM " PO-KEY-ARG
               ELSE
                    MOVE "DBFIND PODATAITM * 530-GPD"
                         TO BU-DISPLAY-MSG
                    PERFORM 990-BLOWUP.

       540-CONT-DESCR.
           PERFORM 9999-DBGET5-DPODATAITM-PO-I.
           IF GOOD-CALL
               IF TRANS-ITEM-NUM = DATAITM-ITEM-NO
                   IF DATAITM-LINE-NO = "01"
                       MOVE DATAITM-INFO TO SORT-DESCR
                       MOVE 1 TO ITEM-FOUND
                   ELSE
                       NEXT SENTENCE
               ELSE
                   NEXT SENTENCE
           ELSE
               IF END-OF-CHAIN
                   MOVE SPACES TO SORT-DESCR
               ELSE
                   MOVE "DBGET PODATAITM * 540-CD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

       550-GET-MSTORERM.
           IF MMATL-CODE-ARG = "NON-STR" OR MMATL-FST4 = "ACCR"
               MOVE 0 TO STR-STD-COST
           ELSE
               PERFORM 9999-DBGET7-MSTORERM-CD-I
               IF GOOD-CALL
                   NEXT SENTENCE
               ELSE
                   IF NO-ENTRY
                        MOVE 0 TO STR-STD-COST
                   ELSE
                       MOVE "DBGET MSTORE * 550-GM" TO BU-DISPLAY-MSG
                       MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
                       PERFORM 990-BLOWUP.

       600-BUILD-SORT-REC.
           MOVE TRANS-DEPT              TO SORT-DEPT-CHGD.
           MOVE TRANS-ACCT              TO SORT-ACCT-CHGD.
           MOVE TRANS-CLASS             TO SORT-CLASS.
           IF TRANS-STORES-CODE = "NON-STR"
               MOVE TRANS-ORDER-NUM     TO SORT-CODE-OR-PO
               MOVE TRANS-RELEASE       TO SORT-PO-RLS
               MOVE TRANS-ITEM-NUM      TO SORT-PO-ITEM
           ELSE
               MOVE TRANS-STORES-CODE   TO SORT-CODE-OR-PO
               MOVE SPACES              TO SORT-PO-RLS
                                           SORT-PO-ITEM.
           MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEAS.
           IF TRANS-STORES-CODE = "2641544" AND
                TRANS-ACCT = "000042"
                   MOVE 05              TO SORT-REPORT-CODE.
           IF MCHT-DEPT-TYPE = "MS" OR "MU" OR "MW"
      *        IF TRANS-CLASS > 199 AND TRANS-CLASS < 400
               IF (TRANS-CLASS > 199 AND TRANS-CLASS < 400)
                   MOVE 01              TO SORT-REPORT-CODE
               ELSE
                   NEXT SENTENCE
           ELSE
               NEXT SENTENCE.
           MOVE TRANS-CODE              TO SORT-TRANS-TYPE.
           IF TRANS-CODE = "RET" OR "RETV" OR "SADJ" OR "AADJ"
               COMPUTE SORT-QTY-CHGD = TRANS-QTY * -1
               COMPUTE SORT-VALUE = TRANS-VALUE * -1
           ELSE
               MOVE TRANS-QTY           TO SORT-QTY-CHGD
               MOVE TRANS-VALUE         TO SORT-VALUE.
           IF SORT-REPORT-CODE = 05
               PERFORM 610-CREATE-VOUCH85.

      *----- 09OCT90 DAP - ADDED "AADJ" TO THE IF "INV" PORTION
      *----- OF THE FOLLOWING IF STMT.  THIS ALLOWS THE "AADJ"
      *----- TO REMAIN VALUED AT THE DOLLAR AMT THE USER INPUT.

           IF MCHT-DEPT-TYPE = "PR"
      *        IF (TRANS-CLASS < 200) OR (TRANS-CLASS > 399
      *          AND TRANS-CLASS < 500)
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200)
                 OR (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
                     IF TRANS-STORES-CODE = "NON-STR" OR
                        STR-STD-COST = 0 OR
                        TRANS-CODE = "FRT" OR
                        TRANS-CODE = "INV" AND
                        SORT-QTY-CHGD = ZEROS
                        MOVE 0      TO SORT-STD-VALUE
                     ELSE
                         IF TRANS-CODE = "INV" OR "AADJ"
                             COMPUTE SORT-STD-VALUE =
                                 SORT-QTY-CHGD * STR-STD-COST
                         ELSE
                             MOVE SORT-VALUE TO SORT-STD-VALUE
                             COMPUTE SORT-VALUE =
                                 SORT-QTY-CHGD * STR-AVG-COST
               ELSE
                   MOVE 0                TO SORT-STD-VALUE
           ELSE
               MOVE 0                    TO SORT-STD-VALUE.

           IF TRANS-VALUE = 0
               MOVE 0                    TO SORT-STD-VALUE.

      **************************************************
      **   IF THE DEPT TYPE = V THIS IS A VARIANCE DEPT
      **   CHARGE AND THE ENTIRE AMOUNT SHOULD GO TO
      **   VARIANCE OTHERWISE CALCULATE A VARIANCE
      **   IF A STANDARD VALUE EXISTS (NOT = 0)
      **************************************************

           IF MCHT-DEPT-TYPE1 = "V"
               MOVE SORT-VALUE          TO SORT-VAR
               MOVE 0                   TO SORT-STD-VALUE
           ELSE
               IF SORT-STD-VALUE NOT = 0
                   COMPUTE SORT-VAR = SORT-VALUE - SORT-STD-VALUE
               ELSE
                   MOVE 0               TO SORT-VAR.

      ***************************************************
      **   IF THE DEPT TYPE = "PR" PROCESS DEPT,
      **   VOUCHER 24 (REPORT CODE 02) AND THE TRANSACTION
      **   IS FOR A NON-CODED ITEM OR AND INVOICE WITH
      **   ZERO QTY OR A FREIGHT TRANSACTION THEN THE
      **   ENTIRE AMOUNT WILL GO TO VARIANCE.
      ***************************************************

           IF MCHT-DEPT-TYPE = "PR"
               IF SORT-REPORT-CODE = "02"
                   IF TRANS-STORES-CODE = "NON-STR" OR
                      TRANS-CODE = "FRT" OR
                      TRANS-CODE = "INV" AND
                      SORT-QTY-CHGD = ZEROS
                       MOVE SORT-VALUE      TO SORT-VAR.

           RELEASE SORT-REC.
           MOVE SPACES                   TO SORT-REC.
           MOVE 0                        TO SORT-QTY-CHGD
                                            SORT-VALUE
                                            SORT-VAR
                                            SORT-STD-VALUE.

       610-CREATE-VOUCH85.
           MOVE "M"                      TO VO85-REC-ID.
           MOVE SORT-DEPT-CHGD           TO VO85-DEPT.
           MOVE SORT-ACCT-CHGD           TO VO85-ACCT.
           MOVE SORT-LEDG-CODE           TO VO85-LEDGER.
           MOVE SORT-VALUE               TO VO85-MATL-VALUE.
           IF (SORT-ACCT-CHGD < 10000) OR
                 (SORT-ACCT-CHGD > 50000)
                    MOVE 0 TO VO85-NWO
           ELSE
                    MOVE SORT-ACCT-CHGD TO VO85-NWO.
           MOVE 0 TO VO85-SUB-ACCT
                     VO85-HOURS
                     VO85-LABOR
                     VO85-OVERTIME
                     VO85-OVERHEAD.
           WRITE VCH85-REC.
           MOVE SPACES TO VCH85-REC.
           MOVE 0 TO VO85-HOURS
                     VO85-LABOR
                     VO85-OVERTIME
                     VO85-OVERHEAD
                     VO85-MATL-VALUE.

       620-GET-STR-DEPT.
           MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               MOVE "DBGET MACCOUNT-INFO * 620-GSD" TO BU-DISPLAY-MSG
               MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.

       699-PROCESS-EXIT.
           EXIT.

       700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
           DISPLAY "BEGIN REPORT".
           PERFORM 710-BEGIN-REPORT.
           PERFORM 720-PROCESS-VOUCHER
              UNTIL NO-MORE-SORT = "YES".
           PERFORM 711-END-REPORT.

      **************************************************
      **  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
      **  TO COMPLETE PROCESSING OF REPORT            **
      **************************************************

           GO TO 799-CREATE-EXIT.

       710-BEGIN-REPORT.
           OPEN OUTPUT ONLINE-PRT.

           ACCEPT CURRENT-DATE FROM DATE.
           MOVE "*"          TO  PRT-CTL.
           IF SGETRPT-SW = "Y"
               STRING CURRENT-DATE "Y" DELIMITED BY SIZE INTO PRT-LINE
           ELSE
               MOVE CURRENT-DATE TO PRT-LINE.
           WRITE PRT-REC.

           RETURN SORT-FILE
              AT END
                  MOVE "YES" TO NO-MORE-SORT.
           MOVE SORT-CODE-OR-PO   TO HOLD-CODE-OR-PO.
           MOVE ZEROS             TO CONTROL-BREAK-TOTALS.

       711-END-REPORT.
           MOVE GRAND-ACTUAL TO GRAND-ACTUAL-PRT.
           MOVE GRAND-STANDARD TO GRAND-STANDARD-PRT.
           MOVE GRAND-VARIANCE TO GRAND-VARIANCE-PRT.
           MOVE GRAND-QTY TO GRAND-QTY-PRT.
           MOVE GRAND-LINE    TO  PRT-LINE.
           MOVE "2"           TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM GRAND-LINE AFTER ADVANCING 2.
           IF NO-ACTUAL-VALUE-SW = "Y"
               MOVE ASTERISK-LINE     TO  PRT-LINE
               MOVE "3"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ASTERISK-LINE AFTER ADVANCING 3
               MOVE ERROR-MSG-LINE1   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE1 AFTER ADVANCING 1
               MOVE ERROR-MSG-LINE2   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE2 AFTER ADVANCING 1
               MOVE ERROR-MSG-LINE3   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE3 AFTER ADVANCING 1
               MOVE ERROR-MSG-LINE4   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE4 AFTER ADVANCING 1
               MOVE ERROR-MSG-LINE5   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE5 AFTER ADVANCING 1
               MOVE ERROR-MSG-LINE6   TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM ERROR-MSG-LINE6 AFTER ADVANCING 1
               MOVE ASTERISK-LINE     TO  PRT-LINE
               MOVE "1"               TO  PRT-CTL
               WRITE PRT-REC.
      ***      WRITE PRT-REC FROM ASTERISK-LINE AFTER ADVANCING 1.

       720-PROCESS-VOUCHER.
           PERFORM 721-BEGIN-VOUCHER.
           PERFORM 722-PROCESS-LEDGER
               UNTIL SORT-REPORT-CODE NOT = PREV-REPORT-CODE
                   OR NO-MORE-SORT = "YES".
           PERFORM 723-VOUCHER-END.

       721-BEGIN-VOUCHER.
           MOVE 0 TO VOUCHER-ACTUAL
                     VOUCHER-QTY
                     VOUCHER-STANDARD
                     VOUCHER-VARIANCE.
           MOVE SORT-REPORT-CODE TO PREV-REPORT-CODE.
           MOVE SORT-REPORT-CODE TO REPORT-CODE-ARG.
           PERFORM 9999-DBGET7-MREPORT-RC-I.
           IF GOOD-CALL
               MOVE MREPORT-DESC        TO REPORT-DESCR-HDG
           ELSE
               IF NO-ENTRY
                   DISPLAY "NO ENTRY IN REPORT CODE MASTER FOR "
                                SORT-REPORT-CODE
                   DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
                   MOVE SPACES          TO REPORT-DESCR-HDG
               ELSE
                   MOVE "DBGET MREPORT * 721-BV" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
           PERFORM 750-PRINT-HEADINGS.

       722-PROCESS-LEDGER.
           PERFORM 724-LEDGER-BEGIN.
           PERFORM 725-PROCESS-DEPT
               UNTIL SORT-LEDG NOT = PREV-LEDGER
                   OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
                        OR NO-MORE-SORT = "YES".
           PERFORM 726-LEDGER-END.

       723-VOUCHER-END.
           MOVE PREV-REPORT-CODE TO REPORT-CODE-TRLR.
           MOVE MREPORT-DESC     TO REPORT-TRAILER.
           MOVE VOUCHER-ACTUAL   TO VOUCHER-ACTUAL-PRT.
           MOVE VOUCHER-STANDARD TO VOUCHER-STANDARD-PRT.
           MOVE VOUCHER-VARIANCE TO VOUCHER-VARIANCE-PRT.
           MOVE VOUCHER-QTY TO VOUCHER-QTY-PRT.
           ADD VOUCHER-QTY TO GRAND-QTY.
           ADD VOUCHER-ACTUAL TO GRAND-ACTUAL.
           ADD VOUCHER-STANDARD TO GRAND-STANDARD.
           ADD VOUCHER-VARIANCE TO GRAND-VARIANCE.
           MOVE VOUCHER-LINE      TO  PRT-LINE.
           MOVE "2"               TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM VOUCHER-LINE AFTER ADVANCING 2 LINES.

       724-LEDGER-BEGIN.
           MOVE 0 TO LEDGER-ACTUAL
                     LEDGER-QTY
                     LEDGER-STANDARD
                     LEDGER-VARIANCE.
           MOVE SORT-LEDG TO PREV-LEDGER.

       725-PROCESS-DEPT.
           PERFORM 727-DEPT-BEGIN.
           PERFORM 728-CLASS-PROCESS
               UNTIL SORT-DEPT-CHGD NOT = PREV-DEPT
                  OR SORT-LEDG NOT = PREV-LEDGER
                    OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
                        OR NO-MORE-SORT = "YES".
           PERFORM 729-DEPT-END.

       726-LEDGER-END.
           MOVE PREV-LEDGER TO LEDG-ARG
                              LEDG-CODE-TRLR.
           PERFORM 9999-DBGET7-MLEDGER-LD-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF NO-ENTRY
                   DISPLAY "NO ENTRY IN LEDGER MASTER FOR "
                          PREV-LEDGER
                   DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
                   MOVE "NO LEDGER ENTRY IN LEDGER MASTER"
                       TO MLEDGER-DESCR
               ELSE
                   MOVE "DBGET MLEDGER * 726-LE" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
           MOVE MLEDGER-DESCR TO LEDGER-TRAILER.
           MOVE LEDGER-ACTUAL TO LEDGER-ACTUAL-PRT.
           MOVE LEDGER-STANDARD TO LEDGER-STANDARD-PRT.
           MOVE LEDGER-VARIANCE TO LEDGER-VARIANCE-PRT.
           MOVE LEDGER-QTY TO LEDGER-QTY-PRT.
           ADD LEDGER-QTY TO VOUCHER-QTY.
           ADD LEDGER-ACTUAL TO VOUCHER-ACTUAL.
           ADD LEDGER-STANDARD TO VOUCHER-STANDARD.
           ADD LEDGER-VARIANCE TO VOUCHER-VARIANCE.
           MOVE LEDGER-LINE       TO  PRT-LINE.
           MOVE "2"               TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM LEDGER-LINE AFTER ADVANCING 2.
           IF SORT-REPORT-CODE = PREV-REPORT-CODE
               PERFORM 750-PRINT-HEADINGS
           ELSE
               ADD 2 TO LINE-CNT.

       727-DEPT-BEGIN.
           MOVE 0 TO DEPT-ACTUAL
                     DEPT-QTY
                     DEPT-STANDARD
                     DEPT-VARIANCE.
           MOVE SORT-DEPT-CHGD TO PREV-DEPT.

       728-CLASS-PROCESS.
           IF SORT-REPORT-CODE = 04
               PERFORM 730-NWO-BEGIN
               PERFORM 731-DEPT-ACCT-PROCESS
                  UNTIL SORT-ACCT-CHGD NOT = PREV-NWO
                      OR SORT-DEPT-CHGD NOT = PREV-DEPT
                         OR SORT-LEDG NOT = PREV-LEDGER
                             OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
                               OR NO-MORE-SORT = "YES"
               PERFORM 732-NWO-END
           ELSE
               PERFORM 730-CLASS-BEGIN
               PERFORM 731-DEPT-ACCT-PROCESS
                   UNTIL SORT-CLASS NOT = PREV-CLASS
                      OR SORT-DEPT-CHGD NOT = PREV-DEPT
                           OR SORT-LEDG NOT = PREV-LEDGER
                            OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
                               OR NO-MORE-SORT = "YES"

               PERFORM 732-CLASS-END.

       729-DEPT-END.
           MOVE PREV-DEPT TO DEPT-KEY
                              DEPT-CODE-TRLR.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF NO-ENTRY
                   DISPLAY "NO ENTRY IN MCHT-ACCTS FOR "
                          PREV-DEPT
                   DISPLAY "MATL-CODE = " SORT-CODE-OR-PO
                   MOVE "NO DEPT ENTRY IN MCHG-ACCTS"
                       TO MCHT-DESC
               ELSE
                   MOVE "DBGET MDEPT * 729-DE" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

           MOVE MCHT-DESC TO DEPT-TRAILER.
           MOVE DEPT-ACTUAL TO DEPT-ACT-PRT.
           MOVE DEPT-STANDARD TO DEPT-STD-PRT.
           MOVE DEPT-VARIANCE TO DEPT-VAR-PRT.
           MOVE DEPT-QTY TO DEPT-QTY-PRT.
           ADD DEPT-QTY TO LEDGER-QTY.
           ADD DEPT-ACTUAL TO LEDGER-ACTUAL.
           ADD DEPT-STANDARD TO LEDGER-STANDARD.
           ADD DEPT-VARIANCE TO LEDGER-VARIANCE.
           MOVE DEPT-LINE         TO  PRT-LINE.
           MOVE "2"               TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM DEPT-LINE AFTER ADVANCING 2.
           IF SORT-LEDG = PREV-LEDGER
               PERFORM 750-PRINT-HEADINGS
           ELSE
               ADD 2 TO LINE-CNT.

       730-CLASS-BEGIN.
           MOVE 0 TO CLASS-ACTUAL
                     CLASS-QTY
                     CLASS-STANDARD
                     CLASS-VARIANCE.
           MOVE SORT-CLASS TO PREV-CLASS.

       730-NWO-BEGIN.
           MOVE 0                       TO NWO-ACTUAL
                                           NWO-QTY
                                           NWO-STANDARD
                                           NWO-VARIANCE.
           MOVE SORT-ACCT-CHGD          TO PREV-NWO.


       731-DEPT-ACCT-PROCESS.
9412CZ     PERFORM 731-ADD-VALUES-TO-HOLD.
           MOVE SORT-LEDG               TO PRT-LEDGER.
           MOVE SORT-DEPT-CHGD          TO PRT-DEPT.
           MOVE "-"                     TO PRT-HYPHEN.
           MOVE SORT-ACCT-CHGD          TO PRT-ACCOUNT.
           MOVE SORT-CLASS              TO PRT-CLASS.
           MOVE "-"                     TO PRT-HYPHEN2.
           MOVE SORT-CODE-OR-PO         TO PRT-CODE-OR-PO.
           MOVE SORT-PO-RLS             TO PRT-RLS.
           MOVE SORT-PO-ITEM            TO PRT-ITEM.
           MOVE SORT-TRANS-TYPE         TO PRT-TRANS-CODE.
           MOVE SORT-DESCR              TO PRT-DESCR.
           MOVE SORT-QTY-CHGD           TO PRT-QTY.
           MOVE SORT-VALUE              TO PRT-ACTUAL.
           MOVE SORT-STD-VALUE          TO PRT-STD.
           MOVE SORT-UNIT-MEAS          TO PRT-UM.
           MOVE SORT-VAR                TO PRT-VAR.
           IF SORT-REPORT-CODE = 04
               ADD SORT-VALUE           TO NWO-ACTUAL
               ADD SORT-STD-VALUE       TO NWO-STANDARD
               ADD SORT-VAR             TO NWO-VARIANCE
               ADD SORT-QTY-CHGD        TO NWO-QTY
           ELSE
               ADD SORT-VALUE           TO CLASS-ACTUAL
               ADD SORT-STD-VALUE       TO CLASS-STANDARD
               ADD SORT-QTY-CHGD        TO CLASS-QTY
               ADD SORT-VAR             TO CLASS-VARIANCE.
           MOVE DETAIL-LINE       TO  PRT-LINE.
           MOVE "1"               TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
           ADD 1                        TO LINE-CNT.

           IF SORT-VALUE = ZEROS
               MOVE "Y"                 TO NO-ACTUAL-VALUE-SW
               ADD 1                    TO LINE-CNT
               MOVE NO-ACTUAL-ERROR-LINE   TO  PRT-LINE
               MOVE "1"                    TO  PRT-CTL
               WRITE PRT-REC.
      ***      WRITE PRT-REC FROM NO-ACTUAL-ERROR-LINE
      ***          AFTER ADVANCING 1.

9406CK     IF SORT-ERR = "1"
  .            ADD 1                    TO LINE-CNT
               MOVE INVALID-DEPT-LINE   TO  PRT-LINE
               MOVE "1"                 TO  PRT-CTL
               WRITE PRT-REC.
  .   ***      WRITE PRT-REC FROM INVALID-DEPT-LINE
9406CK***          AFTER ADVANCING 1.

           IF LINE-CNT > 55
               PERFORM 750-PRINT-HEADINGS.
           MOVE SPACES                  TO PRT-REC
                                           DETAIL-LINE.
           RETURN SORT-FILE
              AT END
                  MOVE "YES"            TO NO-MORE-SORT.

9412CZ*--- LOGIC TO PRINT CORP. CODE TOTALS WHEN VOUCHER = 24
  .   *--- (REPORT CODE = 2).  29DEC1994
  .        IF SORT-CODE-OR-PO NOT EQUAL HOLD-CODE-OR-PO
  .              AND  NO-MORE-SORT NOT EQUAL "YES"
  .              AND  SORT-REPORT-CODE = "02"
  .            PERFORM 731-PRINT-BREAK-TOTALS
  .            MOVE ZEROS               TO CONTROL-BREAK-TOTALS
9412CZ         MOVE SORT-CODE-OR-PO     TO HOLD-CODE-OR-PO.

      *--- CALLED FROM 731-DEPT-ACCT-PROCESS.  ADDS VALUES TO
      *--- SUB-TOTAL FIELDS FOR CONTROL BREAK.    08DEC1994

9412CZ 731-ADD-VALUES-TO-HOLD.
  .        ADD SORT-QTY-CHGD      TO TOTAL-QTY-CHGD.
  .        ADD SORT-VALUE         TO TOTAL-VALUE.
  .        ADD SORT-STD-VALUE     TO TOTAL-STD-VALUE.
9412CZ     ADD SORT-VAR           TO TOTAL-VAR.

      *--- CALLED FROM 731-DEPT-ACCT-PROCESS.  MOVES SUB-TOTALS
      *--- TO PRINT LINE AND PRINTS TOTAL LINE.   08DEC1994

9412CZ 731-PRINT-BREAK-TOTALS.
  .        MOVE HOLD-CODE-OR-PO   TO TD-CODE-OR-PO.
  .        MOVE TOTAL-QTY-CHGD    TO TD-QTY-CHGD.
  .        MOVE TOTAL-VALUE       TO TD-VALUE.
  .        MOVE TOTAL-STD-VALUE   TO TD-STD-VALUE.
  .        MOVE TOTAL-VAR         TO TD-VAR.
  .        ADD 3                  TO LINE-CNT
           MOVE SUB-TOTAL-DETAIL-LINE   TO  PRT-LINE.
           MOVE "2"                     TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM SUB-TOTAL-DETAIL-LINE
  .   ***       AFTER ADVANCING 2.
           MOVE BLANK-LINE              TO  PRT-LINE.
           MOVE "1"                     TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM BLANK-LINE.
  .
  .        IF LINE-CNT > 55
  .            PERFORM 750-PRINT-HEADINGS.
  .        MOVE SPACES                  TO PRT-REC
9412CZ                                     DETAIL-LINE.

       732-CLASS-END.
           MOVE PREV-CLASS TO CLASS-ARG
                              CLASS-CODE-TRLR.
           PERFORM 9999-DBGET7-MCLASS-CL-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF NO-ENTRY
                   MOVE SPACES TO CLASS-TRAILER
               ELSE
                   MOVE "DBGET MCLASS * 732-CE" TO BU-DISPLAY-MSG
                   MOVE CLASS-ARG       TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP.
           MOVE MCLASS-CLASS-DESCR TO CLASS-TRAILER.
           MOVE CLASS-ACTUAL TO CLASS-ACT-PRT.
           MOVE CLASS-STANDARD TO CLASS-STD-PRT.
           MOVE CLASS-VARIANCE TO CLASS-VAR-PRT.
           MOVE CLASS-QTY TO CLASS-QTY-PRT.
           ADD CLASS-QTY TO DEPT-QTY.
           ADD CLASS-ACTUAL TO DEPT-ACTUAL.
           ADD CLASS-STANDARD TO DEPT-STANDARD.
           ADD CLASS-VARIANCE TO DEPT-VARIANCE.
           IF SORT-DEPT-CHGD NOT = PREV-DEPT
               MOVE CLASS-LINE           TO  PRT-LINE
               MOVE "2"                  TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2
               ADD 2 TO LINE-CNT
           ELSE
               MOVE CLASS-LINE           TO  PRT-LINE
               MOVE "2"                  TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM CLASS-LINE AFTER ADVANCING 2
               MOVE BLANK-LINE           TO  PRT-LINE
               MOVE "2"                  TO  PRT-CTL
               WRITE PRT-REC
      ***      WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2
               ADD 4 TO LINE-CNT.

       732-NWO-END.
           MOVE PREV-NWO TO NWO-TRLR.
           MOVE NWO-ACTUAL TO NWO-ACT-PRT.
           MOVE NWO-STANDARD TO NWO-STD-PRT.
           MOVE NWO-VARIANCE TO NWO-VAR-PRT.
           MOVE NWO-QTY TO NWO-QTY-PRT.
           ADD NWO-QTY TO DEPT-QTY.
           ADD NWO-ACTUAL TO DEPT-ACTUAL.
           ADD NWO-STANDARD TO DEPT-STANDARD.
           ADD NWO-VARIANCE TO DEPT-VARIANCE.
           MOVE NWO-LINE             TO  PRT-LINE.
           MOVE "2"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM NWO-LINE AFTER ADVANCING 2.
           MOVE BLANK-LINE           TO  PRT-LINE.
           MOVE "2"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
           ADD 4 TO LINE-CNT.

       750-PRINT-HEADINGS.
           IF SORT-DEPT-CHGD NOT = PREV-DEPT
           IF SGETRPT-SW = "Y"
               MOVE "D"       TO PRT-CTL
               MOVE SPACES    TO PRT-LINE
               STRING SGETRPT-ID SORT-DEPT-CHGD DELIMITED BY SIZE
                              INTO PRT-LINE
               WRITE PRT-REC.

           CALL "TDATECHK" USING DATE-CHECK-AREA.
      *****MOVE CURRENT-DATE TO DATE-H1.
           MOVE DATE-SLASH-OUT TO DATE-H1.
      *****MOVE TIME-OF-DAY TO TIME-DIV.
           MOVE DATE-UNFORMATTED-TIME-OUT TO TIME-DIV.
           MOVE HH-DIV TO HH-H2.
           MOVE MM-DIV TO MM-H2.
           MOVE SS-DIV TO SS-H2.
           MOVE "MY" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               MOVE "DBGET MACCOUNT-INFO * 750-PH" TO BU-DISPLAY-MSG
               MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.
           MOVE MACCT-MONTH TO MONTH-PARM.
           MOVE MACCT-YEAR TO YEAR-PARM.
           MOVE MONTH-T (MONTH-PARM) TO MONTH-H3.
           MOVE YEAR-PARM TO YEAR-H3B.
           ADD 1 TO PAGE-CNT.
           MOVE PAGE-CNT TO PAGE-H2.
           MOVE HEADER1              TO  PRT-LINE.
           MOVE "0"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
           MOVE HEADER2              TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
           MOVE HEADER3              TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
           MOVE REPORT-HDG           TO  PRT-LINE.
           MOVE "2"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM REPORT-HDG AFTER ADVANCING 2.
           MOVE HEADER4              TO  PRT-LINE.
           MOVE "2"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
           MOVE BLANK-LINE           TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
      ***  WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
           MOVE 7 TO LINE-CNT.

       799-CREATE-EXIT.
           EXIT.

       900-ERROR SECTION.

       990-BLOWUP.
           MOVE "TDTLCHGS"              TO  BU-PGM-NAME.

      ***************************************************************
      **   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
      **   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
      **   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
      **   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
      **   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
      **   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
      **   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
      **   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
      **   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
      **   PROBLEM IS AVOIDED.                                     **
      ***************************************************************

           CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
                                 ACCTG-BASE,
                                 BU-PGM-NAME,
                                 STATUS-AREA,
                                 DUMMY-VIEW-AREA,
                                 FILE-STATUS,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.


       1000-CLOSE-FILES.
           CLOSE VCHR85-CHGS-FILE.
9407CK     IF FOUND-ERROR = "Y"
  .           DISPLAY "ERRORS FOUND IN FILE.  "
  .                   "FILE VCH85FLE WILL BE CLEARED."
  .           CALL "QCMDEXC" USING CLRPFM-CMD  CLRPFM-CMD-LEN
9407CK        PERFORM 1010-WRITE-ERROR-BOX.
           CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

9407CK 1010-WRITE-ERROR-BOX.
  .        ADD 1 TO PAGE-CNT.
  .        MOVE PAGE-CNT TO PAGE-H2.
           MOVE HEADER1              TO  PRT-LINE.
           MOVE "0"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
           MOVE HEADER2              TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
           MOVE HEADER3              TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
           MOVE BLANK-LINE           TO  PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
  .        MOVE "* * * * * * * * * * * * * * * * * * * * * * * *"
  .   ***        TO PRT-REC.
  .              TO PRT-LINE.
           MOVE "8"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 8 LINES.
  .        MOVE "*                                             *"
  .   ***        TO PRT-REC.
                 TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*     ERRORS EXIST ON THIS VOUCHER REPORT     *"
  .   ***       TO PRT-REC.
                TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*                                             *"
  .   ***       TO PRT-REC.
                TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*      DO NOT SEND VOUCHER DATA TO AKRON      *"
  .   ***       TO PRT-REC.
                TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*                                             *"
  .   ***       TO PRT-REC.
                TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
  .   ***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "* * * * * * * * * * * * * * * * * * * * * * * *"
  .   ***       TO PRT-REC.
                TO PRT-LINE.
           MOVE "1"                  TO  PRT-CTL.
           WRITE PRT-REC.
9407CK***  WRITE PRT-REC  AFTER ADVANCING 1 LINES.

       9999-ROUTINES SECTION.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           READ MMATL-ACCUM-MC-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-KEY TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-KEY-ARG TO PORCVNO OF DPODATAITM-PO-REC-I.
           START DPODATAITM-PO-I KEY = PORCVNO OF DPODATAITM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DPODATAITM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-PO-I NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPODATAITM-PO-REC-I NOT = PO-KEY-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MREPORT-RC-I.
           MOVE 0 TO COND-WORD.
           MOVE REPORT-CODE-ARG TO RPTCODE OF MREPORT-RC-REC-I.
           READ MREPORT-RC-I INTO BUF-MREPORT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MLEDGER-LD-I.
           MOVE 0 TO COND-WORD.
           MOVE LEDG-ARG TO LEDGER OF MLEDGER-LD-REC-I.
           READ MLEDGER-LD-I INTO BUF-MLEDGER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN INPUT DPODATAITM-PO-I      .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MREPORT-RC-I         .
           OPEN INPUT MLEDGER-LD-I         .
           OPEN INPUT MCLASS-CL-I          .
           OPEN INPUT MACCOUNT-INFO-IK-I   .

       9999-CLOSE-STUFF.
           CLOSE      DTRANS-MC-I          .
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      DPODATAITM-PO-I      .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MREPORT-RC-I         .
           CLOSE      MLEDGER-LD-I         .
           CLOSE      MCLASS-CL-I          .
           CLOSE      MACCOUNT-INFO-IK-I   .
