000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400      TDTRANS.
000500 AUTHOR.
000600      KURT MOVSESIAN.
000800
000900******************************************************
001000*                                                    *
001100*   T D T R A N S                                    *
001200*                                                    *
001300*   THIS PROGRAM WILL CHECK TO MAKE SURE ALL NUMERIC *
001400*   DEFINED FIELDS ARE NUMERIC. NUMERIC FIELDS WHICH *
001500*   CONTAIN NON-NUMERIC DATA ARE SET TO ZERO.        *
001600******************************************************
      *C
      *C   08FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   04SEP1996    CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DTRANS-O
                  ASSIGN TO DATABASE-MCFLCA0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
002800
003100 DATA DIVISION.
003200 FILE SECTION.
       FD  DTRANS-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0701.
003300
003500 WORKING-STORAGE SECTION.
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003600
       01  ERROR-RECORD-CTR             PIC 9(8) COMP-4 VALUE ZEROS.
       01  ERR-SW                       PIC X  VALUE SPACES.

003700**************************************************************
003800**************************************************************
003900**                                                          **
004000**                DATABASE I/O BUFFER AREA                  **
004100**                                                          **
004200**************************************************************
004300**************************************************************
000001                                                                  DTRANS
       COPY DTRANS IN COPYLIB.
007100
       COPY DBSTAT IN COPYLIB.

       01  BASE   PIC X(10) VALUE SPACES.
007400
007500 COPY TBLOWUP IN COPYLIB.
007600
007700 COPY VIEWDUM IN COPYLIB.
007800
008500 PROCEDURE DIVISION.
008600
       BEGIN-HERE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN I-O DTRANS-O

008900     PERFORM 6-MAIN  THRU  6-M-X.

009000     CLOSE DTRANS-O.
009100     GOBACK.
009200
009400*******************************************************
009500**                                                   **
009600**   BLOWUP  ROUTINE                                 **
009700**                                                   **
009800*******************************************************
009900
010000 2-BLOWUP.
010100     MOVE "TDTRANS"      TO  BU-PGM-NAME.
010200     MOVE TRANS-STORES-CODE TO BU-DISPLAY-FLD (1).
010400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
010500         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
010600             BU-DISPLAY-FLDS.
010700
010800 6-MAIN.
010900     READ DTRANS-O FIRST RECORD INTO BUF-DTRANS
               AT END GO TO 6-M-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST DTRANS *6-MAIN" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

011000     PERFORM 61-READ-FILE THRU 61-RF-X.

           DISPLAY "TOTAL NO. OF RCDS WITH NON-NUM DATA IN NUM FLDS =".
           DISPLAY ERROR-RECORD-CTR.

011100
011200 6-M-X.
011300     EXIT.
011400
011500 61-READ-FILE.
           MOVE SPACES TO ERR-SW.
           IF TRANS-QTY NOT NUMERIC
               MOVE "Y" TO ERR-SW
               DISPLAY "CODE     = " TRANS-STORES-CODE
               DISPLAY "TRANS-QTY= " TRANS-QTY
               MOVE ZEROS TO TRANS-QTY.
           IF TRANS-VALUE NOT NUMERIC
               MOVE "Y" TO ERR-SW
               DISPLAY "CODE       = " TRANS-STORES-CODE
               DISPLAY "TRANS-VALUE= " TRANS-VALUE
               MOVE ZEROS TO TRANS-VALUE.
           IF TRANS-BALANCE-QTY NOT NUMERIC
               MOVE "Y" TO ERR-SW
               DISPLAY "CODE             = " TRANS-STORES-CODE
               DISPLAY "TRANS-BALANCE-QTY= " TRANS-BALANCE-QTY
               MOVE ZEROS TO TRANS-BALANCE-QTY.

           IF ERR-SW = "Y"
               ADD 1 TO ERROR-RECORD-CTR
               REWRITE DTRANS-REC-O FROM BUF-DTRANS
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DTRANS 61-RF" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DTRANS-O NEXT RECORD INTO BUF-DTRANS
               AT END GO TO 61-RF-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ NEXT DTRANS *61-RF" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           GO TO 61-READ-FILE.

       61-RF-X.
           EXIT.
