       IDENTIFICATION DIVISION.
       PROGRAM-ID.      TDUPLBAT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DUP-FILE
               ASSIGN TO DATABASE-MCFLMMDUPF
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS DF-STATUS.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
           SELECT JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JF-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT PRINT-FILE
              ASSIGN TO PRINTER-MCPRT.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PARTS-FILE-PF
               ASSIGN TO DATABASE-MCFPMM1200
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEYP
               FILE STATUS IS WPFDP-STATUS.
           SELECT WO-PARTS-FILE-2
               ASSIGN TO DATABASE-MCFLMM1202
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFD2-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DUP-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DFREC.
       01  DFREC.
           COPY DDS-ALL-FORMATS OF MCFLMMDUPF.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  JOBPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS JFREC.
       01  JFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  PRINT-FILE
           LABEL RECORD IS OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RECORD.
       01  PRINT-RECORD.
           05  PR-CCTL                 PIC X.
           05  PR-PRINT-AREA.
               10  PR-LIT1             PIC X(25).
               10  PR-VAL1             PIC X(4).
               10  FILLER              PIC X(6).
               10  PR-LIT2             PIC X(25).
               10  PR-VAL2             PIC X(4).
               10  FILLER              PIC X(67).
           05  PPA REDEFINES PR-PRINT-AREA.
               10  FILLER              PIC X(100).
               10  PPA-CD.
                   15  PPA-COND        PIC 9(4).
                   15  FILLER          PIC X(27).
               10  PPA-VALS REDEFINES PPA-CD.
                   15  PPA-TERM        PIC X(4).
                   15  FILLER          PIC XX.
                   15  PPA-CONV-TERM   PIC X(4).
                   15  FILLER          PIC X(21).
           05  PPB REDEFINES PR-PRINT-AREA.
               10  PPB-LIT1            PIC X(4).
               10  PPB-WONUM           PIC X(10).
               10  PPB-LIT2            PIC X(117).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PARTS-FILE-PF
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDPREC.
       01  WPFDPREC.
           COPY DDS-ALL-FORMATS OF MCFPMM1200.
       FD  WO-PARTS-FILE-2
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFD2REC.
       01  WPFD2REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1202.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       77  LINE-CTR                    PIC 99.
       77  JOBPLAN-EST-TIME-WORK       PIC 9(4)V9.
       77  PLANNED-SW                  PIC 9.
       77  PLANT-LABOR-RATE            PIC 99V99.
       77  QUEUE-ERROR                 PIC X(76).
       77  QUEUE-PRTY                  PIC 9.
       77  QUEUE-SW                    PIC X.
       77  REQS-SW                     PIC 9.
       77  RIME-WORK                   PIC 99.
       01  ACT-KEY                     PIC 9(9).
       01  ACT-KEYJ                    PIC 9(9).
       01  ACT-KEYP                    PIC 9(9).
       01  ARG-NO                      PIC 9(9).
       01  BLOWUP-BASE                 PIC X(16).
       COPY CATREAD IN COPYLIB.
       01  COMPRESS-PRINT              PIC X(8).
       01  CONDIT-CODE                 PIC X.
       COPY TDATESUB  IN COPYLIB.
       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       01  DBPARAMETERS-X.
           05  BASE-X                  PIC X(24).
           05  DSET-NAME-X             PIC X(16).
           05  PASSWORD-X              PIC X(8).
       01  DUPL-ASTERISKS              PIC X(80) VALUE ALL "*".
       01  DUPL-MSG.
           05  FILLER  PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(11) VALUE "WORK ORDER ".
           05  D-WO-1  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(21) VALUE " HAS BEEN DUPLICATED ".
           05  FILLER  PIC X(14) VALUE "AS WORK ORDER ".
           05  D-WO-2  PIC X(18) VALUE SPACES.
       01  DUPL-RCV-DATE.
           05  DRD-YY                  PIC XX.
           05  FILLER                  PIC X(4).
       01  EQP-EQUIPMENT.      COPY MEQPFILE OF COPYLIB.
       01  ERROR-BUFFER                PIC X(80).
       01  ERROR-SWITCH                PIC S9(4) COMP-4.
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  DF-STATUS               PIC XX.
           05  EF-STATUS               PIC XX.
           05  JF-STATUS               PIC XX.
           05  MR-STATUS               PIC XX.
           05  PF-STATUS               PIC XX.
           05  WBF-STATUS              PIC XX.
           05  WLNU-STATUS             PIC XX.
           05  WPFD-STATUS             PIC XX.
           05  WPFDP-STATUS            PIC XX.
           05  WPFD2-STATUS            PIC XX.
           05  WPF-STATUS              PIC XX.
       COPY THDPRT  IN COPYLIB.
       01  JOBPLAN-BUFFER.     COPY DJOBPLAN OF COPYLIB.
       01  JOBP-KEY.
           05  JOBP-WO-NO              PIC X(10).
           05  JOBP-SEQ-NO             PIC 999.
           05  FILLER                  PIC X.
       COPY LANGSUB  IN COPYLIB.
       01  LAST-WO-BUFF.       COPY MLASTWO  OF COPYLIB.
       01  NORMAL-PRINT                PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
       01  PART-ARG                    PIC XX   VALUE "M ".
       01  PER-PERSONNEL-DATA. COPY MPERSONL OF COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       01  TEMP-BGT.
           05  TB-P                    PIC X.
           05  TB-YY                   PIC XX.
       COPY TBLOWUP IN COPYLIB.
       01  TEMP-LABOR-COST.
           05  TLC.
               10  TLC-DOLLS                 PIC 9(12).
               10  TLC-CENTS                 PIC 99.
           05  TMP-LBR-CST REDEFINES TLC     PIC 9(12)V99.
       01  TIME-BUFF.
           05  TIME-HHMM               PIC X(4).
           05  FILLER                  PIC XX.
       COPY VCOMLINK  IN COPYLIB.
       01  WHO-VARIABLES.
           05  USERNAME                PIC X(10).
           05  TERMNUM                 PIC X(10).
           05  CURRLIB                 PIC X(10).
           05  JOBLIBX                 PIC X.
       01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
       01  WO-PARTS-DATA.      COPY DWOPARTS OF COPYLIB.
       01  WO-PLANNED-DATA.    COPY DWOPLAN  OF COPYLIB.
       01  WO-QUEUE-DATA.      COPY DWOOPENQ OF COPYLIB.
       01  WO-TRACK-DATA.      COPY DWOTRACK OF COPYLIB.
       01  WORK-ORDER-NUMBER           PIC X(10).
       PROCEDURE DIVISION.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL COND-WORD = 15.
       2-EOJ.
           MOVE SPACES TO PRINT-RECORD.
           WRITE PRINT-RECORD AFTER ADVANCING 1.
           PERFORM 1-WRITE-ASTERISKS.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO PRINT-RECORD
           WRITE PRINT-RECORD FROM NORMAL-PRINT
               AFTER ADVANCING NEW-PAGE.
           CLOSE DUP-FILE.
           CLOSE EQUIPMENT-FILE.
           CLOSE JOBPLAN-FILE.
           CLOSE PERSONNEL-FILE.
           CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PARTS-FILE-PF.
           CLOSE WO-PARTS-FILE-2.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DUP-FILE.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN I-O   JOBPLAN-FILE.
           OPEN INPUT PERSONNEL-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PARTS-FILE.
           OPEN I-O   WO-PARTS-FILE-PF.
           OPEN INPUT WO-PARTS-FILE-2.
           OPEN INPUT WO-PLANNED-FILE.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
           MOVE LOW-VALUES TO STATUS-AREA.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           MOVE 1 TO DATE-MODE.
           MOVE DATE-FLAG TO DATE-CODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-DB TO DUPL-RCV-DATE.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE "HMMISR18.PUB"   TO HD-FILE-NAME.
           CALL "THDPRT2"  USING HD-RET-CODE
                                 HD-FILE-NAME
                                 FNUM
                                 HD-ROUTE-DATA
                                 ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "ERROR IN THDPRT2 *TPRTOR*" TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI       TO COMPRESS-PRINT.
           MOVE CHAR-10PI         TO NORMAL-PRINT.
           IF PAPER-IS-132-COLS
               WRITE PRINT-RECORD FROM NORMAL-PRINT
                   AFTER ADVANCING NEW-PAGE
           ELSE
           WRITE PRINT-RECORD FROM COMPRESS-PRINT
               AFTER ADVANCING NEW-PAGE.
           PERFORM 1-WRITE-ASTERISKS.

       1-WRITE-ASTERISKS.
           MOVE 0 TO LINE-CTR.
           MOVE DUPL-ASTERISKS TO PRINT-RECORD.
           WRITE PRINT-RECORD AFTER ADVANCING 1.
           WRITE PRINT-RECORD AFTER ADVANCING 1.
           MOVE SPACES TO PRINT-RECORD.
           WRITE PRINT-RECORD AFTER ADVANCING 1.
           ADD 3 TO LINE-CTR.

       6-MAIN.
           MOVE 0 TO PLANNED-SW.
           MOVE SPACES TO WO-BASIC-DATA WO-PLANNED-DATA.
           PERFORM 69-READ-DUP-FILE.
           IF COND-WORD = 15 GO TO 6-MAIN-EXIT.
           IF DUPFDELBYT = "D " GO TO 6-MAIN.
           IF DUPFUSER = HD-USER
               NEXT SENTENCE
           ELSE
           GO TO 6-MAIN.
           PERFORM 60-FIND-WO THRU 60-FW-EXIT.
           IF PLANNED-SW = 1
               PERFORM 61-UPDATE-VERBAL THRU 61-UV-EXIT
               MOVE "D " TO DUPFDELBYT
               PERFORM 69-REWRITE-DUP-FILE
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               MOVE "ERROR UPDATING DUP-FILE * TDUPLBAT *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP
           ELSE
           IF PLANNED-SW = 2
               PERFORM 62-UPDATE-PLANNED THRU 62-UP-EXIT
               MOVE "D " TO DUPFDELBYT
               PERFORM 69-REWRITE-DUP-FILE
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               MOVE "ERROR UPDATING DUP-FILE * TDUPLBAT *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.

       6-MAIN-EXIT.    EXIT.

       60-FIND-WO.
           MOVE 0 TO COND-WORD.
           MOVE DUPFWORK TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-FW-PLANNED.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 60-FW-PLANNED.
           MOVE 1 TO PLANNED-SW.
           GO TO 60-FW-EXIT.
       60-FW-PLANNED.
           MOVE 0 TO COND-WORD.
           MOVE DUPFWORK TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE "W/O " TO PPB-LIT1
               MOVE DUPFWORK TO PPB-WONUM
               MOVE " IS NOT IN DATABASE - DUPLICATION FAILED"
                   TO PPB-LIT2
               WRITE PRINT-RECORD AFTER ADVANCING 1 LINES
               GO TO 60-FW-EXIT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 60-FW-EXIT.
           MOVE 2 TO PLANNED-SW.
       60-FW-EXIT.    EXIT.
       61-UPDATE-VERBAL.
           MOVE DUPL-RCV-DATE TO DATE-RECD.
           IF DATE-RECD-YY > "70"
               MOVE "19" TO DATE-RECD-CC
           ELSE
           MOVE "20"     TO DATE-RECD-CC.
           ACCEPT TIME-BUFF FROM TIME.
           MOVE TIME-HHMM TO TIME-RECD.
           MOVE SPACES TO CRAFTSMEN-1 CRAFTSMEN-2 CRAFTSMEN-3.
           MOVE SPACES TO DATE-STRT-CN.
           MOVE SPACES TO TIME-STRT.
           MOVE SPACES TO FAILURE-CODE.
           MOVE SPACES TO DATE-COMP-CN TIME-COMP.
           MOVE "VV" TO WO-STRT-STATUS.
           MOVE DUPFSTAT TO WO-STATUS.
           IF DUPFEQPN = "      " GO TO 61-BYPASS-EQP.
           MOVE 0 TO COND-WORD.
           MOVE DUPFEQPN TO EQPNUM OF EFREC.
           START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 61-BYPASS-EQP.
           READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
               AT END    MOVE 15 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 61-BYPASS-EQP.
           MOVE EQP-EQUIP-NUM     TO  EQUIP-NUM.
           MOVE EQP-EQUIP-NAME    TO  EQUIP-NAME.
           MOVE EQP-TYPE          TO  TYPE-NUM.
           MOVE EQP-MAINT-ZONE    TO  ZONE.
           MOVE EQP-LOCATION      TO  LOCATION.
           MOVE EQP-DEPT          TO  DEPT.
       61-BYPASS-EQP.
           MOVE 0 TO ERROR-SWITCH.
           CALL "TNEWWONU" USING DBPARAMETERS, STATUS-AREA,
                             LAST-WO-BUFF, ERROR-SWITCH.
           MOVE LAST-WO-NUM TO WORK-ORDER-NUMBER.
           IF ERROR-SWITCH = 99 GO TO 2-EOJ.
           MOVE WORK-ORDER-NUMBER TO WO-NUM.
           MOVE "0" TO CONDIT-CODE.
           CALL "TADDWO" USING DBPARAMETERS WO-BASIC-DATA
                           CONDIT-CODE ERROR-SWITCH.
           IF WO-STATUS = "OO"
               PERFORM 611-UOM-VERBAL-QUEUE.
           IF DUPFMATI NOT = " "
               PERFORM 651-DUPLICATE-PARTS THRU 651-DP-EXIT.
           MOVE SPACES TO WO-TRACK-DATA.
           MOVE USERNAME TO USER-NAME.
           MOVE TERMNUM TO USER-TERM.
           MOVE WO-NUM TO WO-NUM-TRACK.
           ACCEPT DATE-STAMP FROM DATE.
           IF DATE-STAMP-YY > "70"
               MOVE "19" TO DATE-STAMP-CC
           ELSE
           MOVE "20" TO DATE-STAMP-CC.
           ACCEPT TIME-BUFF FROM TIME.
           MOVE TIME-HHMM TO TIME-STAMP.
           MOVE WO-STRT-STATUS TO WO-TYPE-STATUS.
           MOVE USERNAME TO USER-ID.
           MOVE "    " TO CLOCK-CARD.
           MOVE WO-STATUS TO WO-STATUS-TRACK.
           MOVE "TDUPLBAT" TO PROGRAM-NAME.
           CALL "TWOTRACK" USING WO-TRACK-DATA.
           MOVE DUPFWORK TO D-WO-1.
           MOVE WORK-ORDER-NUMBER TO D-WO-2.
           MOVE DUPL-MSG TO PRINT-RECORD.
           WRITE PRINT-RECORD AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               PERFORM 1-WRITE-ASTERISKS.

       61-UV-EXIT.    EXIT.

       611-UOM-VERBAL-QUEUE.
           MOVE SPACES TO WO-QUEUE-DATA.
           MOVE ZONE OF WO-BASIC-DATA TO Q-ZONE.
           MOVE "1 "          TO Q-PRTY.
           MOVE WO-NUM        TO Q-WO-NUM.
           MOVE EQUIP-DOWN    TO Q-EQP-DOWN.
           MOVE "9999"        TO Q-CC-NUM.
           MOVE EQUIP-NUM     TO Q-EQUIP-NUM.
           MOVE DESCRIPTION-1 TO Q-DESCRIPTION.
           MOVE CRAFTS-REQD-1 TO Q-SKILL-1.
           MOVE CRAFTS-REQD-2 TO Q-SKILL-2.
           MOVE CRAFTS-REQD-3 TO Q-SKILL-3.
           IF PRIORITY = "1 " MOVE 9 TO QUEUE-PRTY.
           IF PRIORITY = "2 " MOVE 6 TO QUEUE-PRTY.
           IF PRIORITY = "3 " MOVE 4 TO QUEUE-PRTY.
           IF PRIORITY = "4 " MOVE 2 TO QUEUE-PRTY.
           IF PRIORITY = "5 " MOVE 1 TO QUEUE-PRTY.
           COMPUTE QUEUE-FACTOR = RIME-NO * QUEUE-PRTY.
           MOVE "A" TO QUEUE-SW.
           CALL "TQUPDATE" USING DBPARAMETERS WO-QUEUE-DATA
                             QUEUE-SW QUEUE-ERROR.

       62-UPDATE-PLANNED.
           MOVE DUPFSTAT TO WO-STATUS-P.
           MOVE DUPL-RCV-DATE TO DATE-RECD-P.
           IF DATE-RECD-P-YY > "70"
               MOVE "19" TO DATE-RECD-P-CC
           ELSE
           MOVE "20"     TO DATE-RECD-P-CC.
           ACCEPT TIME-BUFF FROM TIME.
           MOVE TIME-HHMM TO TIME-RECD-P.
           IF DUPFEQPN = "      " GO TO 62-BYPASS-EQP.
           MOVE 0 TO COND-WORD.
           MOVE DUPFEQPN TO EQPNUM OF EFREC.
           START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 62-BYPASS-EQP.
           READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
               AT END    MOVE 15 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 62-BYPASS-EQP.
           MOVE EQP-EQUIP-NUM     TO  EQUIP-NUM-P.
           MOVE EQP-EQUIP-NAME    TO  EQUIP-NAME-P.
           MOVE EQP-TYPE          TO  TYPE-NUM-P.
           MOVE EQP-MAINT-ZONE    TO  ZONE-P.
           MOVE EQP-LOCATION      TO  LOCATION-P.
           MOVE EQP-DEPT          TO  DEPT-P.
       62-BYPASS-EQP.
           MOVE SPACES TO DATE-REQD-CN TIME-REQD.
           IF PRIORITY-P = "1" MOVE 9 TO QUEUE-PRTY.
           IF PRIORITY-P = "2" MOVE 6 TO QUEUE-PRTY.
           IF PRIORITY-P = "3" MOVE 4 TO QUEUE-PRTY.
           IF PRIORITY-P = "4" MOVE 2 TO QUEUE-PRTY.
           IF PRIORITY-P = "5" MOVE 1 TO QUEUE-PRTY.
           MULTIPLY QUEUE-PRTY BY RIME-NO GIVING RIME-WORK.
           MOVE RIME-WORK TO RIME-P.
           IF DUPFSCHD = "      "
               NEXT SENTENCE
           ELSE
           MOVE 3 TO DATE-MODE
           MOVE DUPFSCHD TO DATE-VALIDATE-IN
           CALL "TDATECHK" USING DATE-CHECK-AREA
           MOVE DATE-DB TO DATE-SCHD.
           IF DATE-SCHD-P-YY > "70"
               MOVE "19" TO DATE-SCHD-P-CC
           ELSE
           MOVE "20"     TO DATE-SCHD-P-CC.
           MOVE DUPFSCHT TO TIME-SCHD.
           PERFORM 620-CHECK-MSTAT THRU 620-CM-EXIT.
           IF REQS-SW = 0
               NEXT SENTENCE
           ELSE
           IF DUPFMATI = " "
               NEXT SENTENCE
           ELSE
           MOVE "U" TO APPROVAL-CODE-P.
           MOVE SPACES TO DATE-STRT-P-CN TIME-STRT-P
                FAILURE-CODE-P DATE-COMP-P-CN TIME-COMP-P.
           MOVE SPACES TO SAVE-HIST-SW BUDGET-NO PLANNED-DEL-DATE.
           MOVE 0 TO ERROR-SWITCH.
           CALL "TNEWWONU" USING DBPARAMETERS, STATUS-AREA,
                       LAST-WO-BUFF, ERROR-SWITCH
           MOVE LAST-WO-NUM TO WORK-ORDER-NUMBER.
           IF ERROR-SWITCH = 99 GO TO 2-EOJ.
           MOVE WORK-ORDER-NUMBER TO WO-NUM-PLANNED.
           MOVE "0" TO CONDIT-CODE.
           CALL "TADDWOII" USING DBPARAMETERS, STATUS-AREA,
                       WO-PLANNED-DATA, CONDIT-CODE, ERROR-SWITCH.
           IF DUPFMATI NOT = "  "
               PERFORM 651-DUPLICATE-PARTS THRU 651-DP-EXIT.
           IF DUPFJOBI NOT = "  "
               PERFORM 661-DUPLICATE-JOBPLAN THRU 661-DJ-EXIT.
           MOVE SPACES TO WO-TRACK-DATA.
           MOVE USERNAME TO USER-NAME.
           MOVE TERMNUM TO USER-TERM.
           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           ACCEPT DATE-STAMP FROM DATE.
           IF DATE-STAMP-YY > "70"
               MOVE "19" TO DATE-STAMP-CC
           ELSE
           MOVE "20" TO DATE-STAMP-CC.
           ACCEPT TIME-BUFF FROM TIME.
           MOVE TIME-HHMM TO TIME-STAMP.
           MOVE WO-START-STATUS TO WO-TYPE-STATUS.
           MOVE USERNAME TO USER-ID.
           MOVE "    " TO CLOCK-CARD.
           MOVE WO-STATUS-P TO WO-STATUS-TRACK.
           MOVE "TDUPLBAT" TO PROGRAM-NAME.
           CALL "TWOTRACK" USING WO-TRACK-DATA.
           MOVE DUPFWORK TO D-WO-1.
           MOVE WORK-ORDER-NUMBER TO D-WO-2.
           MOVE DUPL-MSG TO PRINT-RECORD.
           WRITE PRINT-RECORD AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               MOVE 0 TO LINE-CTR
               PERFORM 1-WRITE-ASTERISKS.

       62-UP-EXIT.    EXIT.

       620-CHECK-MSTAT.
           MOVE 0 TO REQS-SW.
           MOVE 0 TO COND-WORD.
           MOVE PART-ARG TO PRTSTATUS OF WPFDREC.
           START WO-PARTS-FILE-2 KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD2-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 620-CM-EXIT.
       620-CM-LOOP.
           READ WO-PARTS-FILE-2 NEXT INTO WO-PARTS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPFD2-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 620-CM-EXIT.
           IF PRT-REQ-NO = "      " GO TO 620-CM-LOOP.
           MOVE 1 TO REQS-SW.
       620-CM-EXIT.    EXIT.

       651-DUPLICATE-PARTS.
           MOVE 0 TO COND-WORD.
           MOVE DUPFWORK TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 651-DP-EXIT.
       651-DP-LOOP.
           READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 651-DP-EXIT.
           MOVE WORK-ORDER-NUMBER TO PRT-WO-NU.
           MOVE SPACES TO PRT-REQ-NO PRT-PO-NO PRT-EST-QTY-FLAG.
           MOVE SPACES TO PRT-ITEM-NO PRT-DATE-USED-CN.
      *--------- MAKE SURE FIELD IS NUMERIC BEFORE CHECKING IF 0.
           IF PRT-EST-QTY-9 NOT NUMERIC
               MOVE 0 TO PRT-EST-QTY-9.
           IF PRT-EST-QTY-9 = 0
               IF PRT-ACT-QTY-9 > 0
                   MOVE PRT-ACT-QTY-9 TO PRT-EST-QTY-9.
           MOVE SPACES TO PRT-ACT-QTY PRT-ACT-COST.
           IF PRT-STATUS = "M " MOVE "X " TO PRT-STATUS.
           MOVE "99990909" TO PRT-DATE-USED-CN.
           MOVE "XXXX" TO PRT-ORIGINATOR.
           WRITE WPFDPREC FROM WO-PARTS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 651-DP-EXIT.
           GO TO 651-DP-LOOP.
       651-DP-EXIT.    EXIT.

       661-DUPLICATE-JOBPLAN.
           MOVE SPACES TO JOBP-KEY JOBPLAN-BUFFER.
           MOVE DUPFWORK TO JOBP-WO-NO.
           MOVE 001 TO JOBP-SEQ-NO.
       661-DJ-FIND.
           MOVE 0 TO COND-WORD.
           MOVE JOBP-KEY TO JOBPWOSEQ OF JFREC.
           START JOBPLAN-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           IF COND-WORD = 17
               ADD 001 TO JOBP-SEQ-NO
               IF JOBP-SEQ-NO > 998
                   GO TO 661-DJ-EXIT
               ELSE
               GO TO 661-DJ-FIND
           ELSE
           GO TO 661-DJ-EXIT.
       661-DJ-LOOP.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-FILE NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBP-KEY NOT = JOBPWOSEQ OF JFREC
               MOVE 15 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               ADD 001 TO JOBP-SEQ-NO
               IF JOBP-SEQ-NO > 998
                   GO TO 661-DJ-EXIT
               ELSE
               GO TO 661-DJ-FIND.
           MOVE WORK-ORDER-NUMBER TO JOBPLAN-WO-NO.
           WRITE JFREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           GO TO 661-DJ-LOOP.

       661-DJ-EXIT.    EXIT.

       6611-SET-LABOR-RATE.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 35.00 TO PLANT-LABOR-RATE
               GO TO 6611-SLR-EXIT.
           IF JOBPLAN-CRAFT NOT = PER-CRAFT
               GO TO 6611-SET-LABOR-RATE.
           MOVE PER-LABOR-RATE TO PLANT-LABOR-RATE.

       6611-SLR-EXIT.    EXIT.

       69-READ-DUP-FILE.
           MOVE 0 TO COND-WORD.
           READ DUP-FILE NEXT
               AT END    MOVE 15 TO COND-WORD.
           IF DF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-DUP-FILE.
           MOVE 0 TO COND-WORD.
           REWRITE DFREC
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF DF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       COPY OVRPFCALL IN COPYLIB.

       998-BLOWUP.
           MOVE "TDUPLBAT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
