       IDENTIFICATION DIVISION.
       PROGRAM-ID. TDUPLWOS.
      *REMARKS.    THIS PROGRAM IS THE EXECUTIVE CONTROLLING PROGRAM
      *            FOR DUPLICATING WORK ORDERS ('DU' ON UDC'S).
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    AS400.
       OBJECT-COMPUTER.    AS400.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDUPLWOS".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(11) VALUE " EXECUTIVE ".
                   15  FILLER      PIC X(12) VALUE "PROGRAM FOR ".
                   15  FILLER      PIC X(17) VALUE "DUPLICATING W/O'S".
                   15  FILLER      PIC X(20) VALUE SPACES.
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       COPY DBSTAT   IN COPYLIB.

       COPY VCOMLINK IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-PROCESSING.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GOBACK.

           CALL "TDUPLSUB" USING DBPARAMETERS VIEW-COMAREA.
           GOBACK.

