       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TDUTYLOD.
       AUTHOR.        ANNETTE TREUDLER.
       DATE-WRITTEN.  JANUARY 1989.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.

      *D* REMARKS.
      *D*
      *D* DUTY LOAD PROGRAM.
      *D* THIS PROGRAM IS THE DUTY LOAD PROGRAM THAT ACCEPTS
      *D* DUTY INFORMATION AND CREATES 'IT' ORDERS AGAINST THE
      *D* DUTY.
      *C*
      *C* CHANGES.
      *C*
      *C* FEBRUARY 11, 1993    CR KALMAN      REQ: #6360
      *C* TDUTYLOD ERRONEOUSLY MOVED ZEROES TO THE SEQUENCE NUMBER IN
      *C* DINVACCT.  NOW CORRECTLY MOVES '01' TO SEQUENCE NUMBER.
      *C*
      *C* JUNE 3, 1993         CR KALMAN      REQ: #6406
      *C* IF INCOMING PO IS MISSING THE RLSE NO, THE PGM WILL TRY TO FIND
      *C* THE "000" RLSE FOR INVOICE CREATION BEFORE USING THE DEFAULT PO
      *C* IN MPLTINFO.  IT WILL NO LONGER TRY TO FIND THE "999" RLSE.
      *C*
      *C* CR KALMAN      NOV 11, 1993
      *C* THE FILE THAT TORONTO IS SENDING TO NAPANEE IS SUPPOSED
      *C* TO BE SINGLE SPACED BUT THIS TIME IT WAS DOUBLE SPACED
      *C* WITH A PLUS SIGN AS THE CONTROL CHARACTER FOR THE BLANK
      *C* LINE. ADDED THIS CODE SO THE PGM WILL NOT BLOWUP IF THIS
      *C* STARTS TO HAPPEN ON A REGULAR BASIS.
      *C*
      *C* CR KALMAN      NOV 11, 1993
      *C* STARTED TO CHANGE PGM FROM BEING PORTABLE TO REGULAR.
      *C* DIDN'T FINISH BECAUSE IT STARTED TAKING TOO LONG.
      *C*
      *C* CR KALMAN        4/26/94            REQUEST 6490
      *C* REMOVED PORTABLILITY COPYLIBS.
      *C*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C*
      *C* FEBRUARY 16, 1995   CA ZUBEK
      *C*  ADDED LOGIC TO DISPLAY A MESSAGE AND END THE PROGRAM
      *C*  WHEN THE "INVDUTY" FILE IS EMPTY.  THIS SITUATION
      *C*  OCCURRED WHEN MULTIPLE REPORTS WERE COMBINED INTO ONE
      *C*  "INVDUTY" FILE, SO MULTIPLE BLANK FILES WERE CREATED.
      *C*
      *C* NOVEMBER 20, 1995    CA YODER
      *C*  ADDED LOGIC TO PUT DUTY ON DEFAULT PO IF NAPANEE DUE TO
      *C*  CURRENCY CODE PROBLEM.  (TEMPORARY MEASURE)
      *C*
      *C* DECEMBER 6, 1995     CA YODER
      *C*  IMPROVED DUTY REPORT FROM THIS PROGRAM.  THE ORIGINAL
      *C*  REPORT WAS NOT CLEAR, AND NAPANEE SAID IT WAS "USELESS".
      *C*  ADDED A TITLE, COLUMN HEADINGS, AND SHOWED ADDITIONAL
      *C*  FIELDS SO THAT IT WOULD BE EASIER TO READ.
      *C*
      *C* JUNE 19, 1996   CA YODER
      *C*  MODIFIED FOR CENTURY DATABASE CHANGES.
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               LOCAL-DATA       IS LOCAL-DATA-AREA
                               C01 IS NEW-PAGE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DUTY-FILE
                  ASSIGN TO DATABASE-INVDUTY.
           SELECT DUTY-REPORT
                  ASSIGN TO PRINTER-MCPRT.
           SELECT DUTY-SUM-RPT
                  ASSIGN TO DISK-DUTYSUMF.
           SELECT MPLTINFO-PK-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MPORCV-PO-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-PO-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-PO-O
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR-VN-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-RG-O
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVACCT-RG-O
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-RG-O
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
      *------ FOR IBM ONLY ------*
       FD  MPORCV-PO-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.
       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  DPOITEM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.
       FD  DPORECD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.
       FD  DVENDOR-VN-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
       FD  DINVRCD-RG-O
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-RG-REC-O.
           COPY DDS-MCRPCS2500  OF MCFLCS2501.
       FD  DINVACCT-RG-O
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-RG-REC-O.
           COPY DDS-MCRPCS2700  OF MCFLCS2701.
       FD  DINVITM-RG-O
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-RG-REC-O.
           COPY DDS-MCRPCS2600  OF MCFLCS2601.
      *------ FOR IBM ONLY ------*
       FD  DUTY-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORDS ARE DUTY-HDR-RCD, DUTY-LINE-RCD.
       01  DUTY-HDR-RCD.
           05  DH-HASP-CONTROL           PIC X.
           05  DH-TC                     PIC X(3).
           05  DH-PLT-TERR               PIC X(4).
           05  DH-SEQ-NO                 PIC 9(5).
           05  DH-NO-RCDS                PIC 9(5).
           05  FILLER                    PIC X(115).
       01  DUTY-LINE-RCD.
           05  DL-HASP-CONTROL           PIC X.
           05  DL-TC                     PIC X(3).
           05  DL-PO-NO                  PIC X(10).
           05  DL-INV-NO                 PIC X(9).
           05  DL-INV-DATE               PIC X(6).
           05  DL-INV-AMNT               PIC S9(11)V99.
           05  FILLER                    PIC X(91).
       FD  DUTY-REPORT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS DUTY-RCD.
       01  DUTY-RCD.
           05  DR-CTL                    PIC X(1).
           05  DR-LINE                   PIC X(132).

       FD  DUTY-SUM-RPT
           DATA RECORD IS DUTY-SUM-REC
           RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS ARE OMITTED.
       01  DUTY-SUM-REC.
           05  SUM-CTL               PIC X.
           05  SUM-LINE              PIC X(132).

       WORKING-STORAGE SECTION.
       77  INVITM-ADDR               PIC S9(9)      VALUE ZERO  COMP.
       77  SEQUENCE-CTR-CHK          PIC 9(5)       VALUE ZERO.
       77  RCD-CTR                   PIC 9(5)       VALUE 1.
       77  DUTY-CTR                  PIC 9(5)       VALUE ZERO.
       77  FRT-CTR                   PIC 9(5)       VALUE ZERO.
       77  PAGE-CTR                  PIC 9(5)       VALUE ZERO.
       77  LINE-CTR                  PIC 99         VALUE 99.
       77  DIST-CTR                  PIC 99         VALUE 1.
       77  ITM-CTR                   PIC 999        VALUE 0.
       77  DEFAULT-PO-RLSE-NO        PIC X(10).
       77  BAD-PO-MSG                PIC X(20).
      *------
       01  TOTAL-MATL-COST           PIC S9(11)V99   VALUE ZEROS.
       01  ITM-DIST-COST             PIC S9(11)V99   VALUE ZEROS.
       01  DIFF-COST-DIST            PIC S9(11)V99   VALUE ZEROS.
       01  TOTAL-COST-DIST           PIC S9(11)V99   VALUE ZEROS.
      *------
       01  INV-NO-EDIT.
           05  INV-TYPE                  PIC X(5)   VALUE SPACES.
           05  INV-NO-IN                 PIC X(9)   VALUE SPACES.
       01  PO-NO-EDIT.
           05  FILLER                    PIC X(1)   VALUE "P".
           05  PO-NO-IN.
               10  PO-NO-1-7             PIC X(7)   VALUE SPACES.
               10  PO-RLSE-NO            PIC X(3)   VALUE SPACES.
           05  FILLER                    PIC X(3)   VALUE "000".
       01  ACCTG-AREA.
           05  ACCTG-PRIME               PIC X(3).
           05  ACCTG-SUB                 PIC X(3).
           05  ACCTG-SUBD                PIC X(4).
           05  ACCTG-ADDL                PIC X(6).
      *-----  SAVE AREA
       01  PLANT-SAVE                    PIC X(3)  VALUE SPACES.
       01  TERR-SAVE                     PIC X(4)  VALUE SPACES.
       01  REG-NUM-SAVE                  PIC 9(5)  VALUE ZEROS.
      *-----  SWITCH AREA
       01  HANDLE-BLOWUP-FLAG            PIC X    VALUE "Y".
       01  BACKOUT-REGNUM-SW             PIC X    VALUE "N".
       01  SWITCHES.
           05  EOF-SW                    PIC X    VALUE "N".
           05  RESET-SW                  PIC X    VALUE "N".
       01  FILE-PROCESS-SW               PIC X    VALUE "N".
           88  FILE-PROCESSED                     VALUE "Y".
       01  PRT-DEFAULT-MSG               PIC X    VALUE "N".
       01  FOUND-INVOICE                 PIC X    VALUE "N".
9406CK 01  SCOPE   PIC X.
9502CZ 01  NUMBER-RECS-READ              PIC 9(5) VALUE 0.
      *----- TO COUNT THE NUMBER OF INVOICES FROM TORONTO.
       01  NUM-TOR-INV                   PIC 9(5) VALUE 0.
      *----- TO COUNT THE NUMBER OF INVOICES GENERATED IN CSIS.
       01  NUM-CSIS-INV                  PIC 9(5) VALUE 0.
      *----- TO TOTAL THE AMOUNT OF INVOICES FROM TORONTO.
       01  TOT-TOR-INV                   PIC S9(11)V99  VALUE 0.

      *----- ACCOUNT FOR CENTURY.
       01  CURRENT-DATE-CN                     VALUE SPACES.
           05  CURRENT-CC            PIC X(2).
           05  CURRENT-DATE-YMD.
               10  CURRENT-YY        PIC X(2).
               10  CURRENT-MM        PIC X(2).
               10  CURRENT-DD        PIC X(2).

       01  HOLD-DATE-CN.
           05  HOLD-CC               PIC X(2).
           05  HOLD-DATE-YMD.
               10  HOLD-YY           PIC X(2).
               10  HOLD-MM           PIC X(2).
               10  HOLD-DD           PIC X(2).

       01  CURRENT-TIME                        VALUE SPACES.
           05  CURRENT-HR            PIC X(2).
           05  CURRENT-MIN           PIC X(2).
           05  CURRENT-SEC           PIC X(2).

      *************************************************************
      **                                                         **
      **            D A T A B A S E        A R E A               **
      **                                                         **
      *************************************************************
       COPY FILESTAT IN COPYLIB.
       COPY DATAB IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-NAME             PIC X(16)    VALUE SPACE.
           05  DSET-MPLTINFO         PIC X(16)    VALUE "MPLTINFO;".
           05  DSET-DPORECD          PIC X(16)    VALUE "DPORECD;".
           05  DSET-DPOITEM          PIC X(16)    VALUE "DPOITEM;".
           05  DSET-DVENDOR          PIC X(16)    VALUE "DVENDOR;".
           05  DSET-DINVRCD          PIC X(16)    VALUE "DINVRCD;".
           05  DSET-DINVITM          PIC X(16)    VALUE "DINVITM;".
           05  DSET-DINVACCT         PIC X(16)    VALUE "DINVACCT;".
           05  DSET-MPORCV           PIC X(16)    VALUE "MPORCV;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS             PIC X(2)     VALUE "@;".
           05  PO-SEARCH             PIC X(10)    VALUE "PO-RCV-NO;".
           05  VEN-SEARCH            PIC X(10)    VALUE "VEN-CODE;".
           05  REG-SEARCH            PIC X(16)
                VALUE "REGISTER-NUMBER;".

       01  PASS-ARG-VALUES.
           05  PLT-ARG               PIC X(4)     VALUE SPACE.
           05  PO-ARG                PIC X(14)    VALUE SPACE.
           05  VEN-ARG.
               10  VEN-ARG1-7.
                   15  VEN-ARG1      PIC X        VALUE SPACE.
                   15  FILLER        PIC X(6)     VALUE SPACE.
               10  VEN-ARG8-10       PIC X(3)     VALUE SPACE.
           05  REGISTER-ARG          PIC 9(5)     VALUE ZEROES.

       01  DB-LOG-TEXT.
           05  FILLER            PIC X(8)  VALUE "TDUTYLOD".

       01  DB-LOG-TEXT-LEN       PIC S9(4) COMP VALUE -8.

       COPY MULTLOCK   IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY MPORCV     IN COPYLIB.

      *
      * MPLTINFO RECORD TYPES
      *
       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.
       COPY MPLTDUTY   IN COPYLIB.
       COPY MPLTPREG   IN COPYLIB.
       COPY MPLTDUPO   IN COPYLIB.

       COPY DPORECD    IN COPYLIB.
       COPY DPOITEM    IN COPYLIB.
       COPY DVENDOR    IN COPYLIB.
       COPY DINVRCD    IN COPYLIB.
       COPY DINVITM    IN COPYLIB.
       COPY DINVACCT   IN COPYLIB.

      *************************************************************
      **                                                         **
      **          E R R O R   M E S S A G E   A R E A S          **
      **                                                         **
      *************************************************************

      *01  HEADER-MSG.
      *    05  FILLER                    PIC X(40)  VALUE
      *        "***  DUTY/FREIGHT LOAD - FILE NUMBER - ".
      *    05  SEQ-NO-OUT                PIC ZZZZ9.
      *    05  FILLER                    PIC X(10)  VALUE "  ***".
      *    05  HDR-DATE-OUT              PIC X(8).
      *    05  FILLER                    PIC X(5)   VALUE SPACES.
      *    05  FILLER                    PIC X(6)   VALUE "PAGE: ".
      *    05  HDR-PAGE-OUT              PIC ZZZZ9.

      *************************************************************
      **             H E A D I N G   L I N E S                   **
      *************************************************************
       01  PRT-HDG-1.
           05                    PIC X(3).
           05  PRT-HDG-1-MM      PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-HDG-1-DD      PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-HDG-1-YY      PIC X(2).
           05                    PIC X(30).
           05                    PIC X(50)
            VALUE "ACCOUNTS PAYABLE -- DUTY INVOICE GENERATION REPORT".
           05                    PIC X(30).
           05                    PIC X(8) VALUE "TDUTYLOD".
           05                    PIC X(3).

       01  PRT-HDG-2.
           05                    PIC X(3).
           05  PRT-HDG-2-HR      PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-HDG-2-MIN     PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-HDG-2-SEC     PIC X(2).
           05                    PIC X(31).
           05                    PIC X(43)
               VALUE "FOR INVOICES IN TORONTO FILE WITH SEQUENCE ".
           05  PRT-HDG-2-SEQ     PIC 9(5).
           05                    PIC X(32).
           05                    PIC X(5) VALUE "PAGE ".
           05  PRT-HDG-2-PG      PIC Z9.
           05                    PIC X(3).

       01  PRT-HDG-3.
           05  PIC X(57).
           05  PIC X(11)  VALUE "  TORONTO  ".
           05  PIC X(5).
           05  PIC X(11)  VALUE "    CSIS   ".
           05  PIC X(48).

       01  PRT-HDG-4.
           05  PIC X(03).
           05  PIC X(17)  VALUE "  INVOICE AMOUNT ".
           05  PIC X(5).
           05  PIC X(14)  VALUE "INVOICE       ".
           05  PIC X(5).
           05  PIC X(8)   VALUE "REGISTER".
           05  PIC X(5).
           05  PIC X(11)  VALUE "PO/RECEIVER".
           05  PIC X(5).
           05  PIC X(11)  VALUE "PO/RECEIVER".
           05  PIC X(5).
           05  PIC X(40)  VALUE
                  "MESSAGE                                 ".
           05  PIC X(36).

       01  PRT-HDG-4U.
           05  PIC X(03).
           05  PIC X(17)  VALUE ALL "-".
           05  PIC X(5).
           05  PIC X(14)  VALUE ALL "-".
           05  PIC X(5).
           05  PIC X(8)   VALUE ALL "-".
           05  PIC X(5).
           05  PIC X(11)  VALUE ALL "-".
           05  PIC X(5).
           05  PIC X(11)  VALUE ALL "-".
           05  PIC X(5).
           05  PIC X(40)  VALUE ALL "-".
           05  PIC X(36).

       01  PRT-DTL.
           05                        PIC X(3).
           05  PRT-DTL-AMT           PIC ZZ,ZZZ,ZZZ,ZZ9.99.
           05                        PIC X(5).
           05  PRT-DTL-INV           PIC X(14).
           05                        PIC X(6).
           05  PRT-DTL-REG           PIC X(5).
           05                        PIC X(7).
           05  PRT-DTL-TOR-PO        PIC X(11).
           05                        PIC X(5).
           05  PRT-PO.
               10  PRT-DTL-CSIS-PO   PIC X(7).
               10  PRT-DTL-HYPHEN    PIC X.
               10  PRT-DTL-CSIS-RCV  PIC X(3).
           05                        PIC X(5).
           05  PRT-DTL-MSG           PIC X(40).
           05                        PIC X(3).

       01  PRT-TOT.
           05                        PIC X(3).
           05  PRT-INV-AMT           PIC ZZ,ZZZ,ZZZ,ZZ9.99.
           05                        PIC X(37).
           05  PRT-TOT-1-NUM         PIC ZZZZ9.
           05                        PIC X(11).
           05  PRT-TOT-2-NUM         PIC ZZZZ9.
           05                        PIC X(54).

       COPY TBLOWUP    IN COPYLIB.

       PROCEDURE DIVISION.

       MAIN-LINE-LOGIC.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X
           PERFORM 9999-CLOSES.
           STOP RUN.

       1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           MOVE "N" TO BACKOUT-REGNUM-SW.
           MOVE "Y" TO HANDLE-BLOWUP-FLAG.
           MOVE "1-HSK"                  TO   BU-DISPLAY-FLD (5).
           PERFORM 9999-OPENS.

           ACCEPT CURRENT-DATE-YMD FROM DATE.
      *------- ACCOUNT FOR CENTURY.
           IF CURRENT-YY > "70"
               MOVE "19"         TO  CURRENT-CC
           ELSE
               MOVE "20"         TO  CURRENT-CC.
           ACCEPT CURRENT-TIME FROM TIME.

      *------- MOVE DATE/TIME TO REPORT LINES.
           MOVE CURRENT-YY       TO  PRT-HDG-1-YY.
           MOVE CURRENT-MM       TO  PRT-HDG-1-MM.
           MOVE CURRENT-DD       TO  PRT-HDG-1-DD.
           MOVE CURRENT-HR       TO  PRT-HDG-2-HR.
           MOVE CURRENT-MIN      TO  PRT-HDG-2-MIN.
           MOVE CURRENT-SEC      TO  PRT-HDG-2-SEC.

      *--------* GET THE PLANT CODE
           MOVE "P 01" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL

             MOVE "GETKEY ERROR MPLTINFO*1-HSK" TO BU-DISPLAY-MSG
             MOVE "P 01" TO BU-DISPLAY-FLD (1)
             PERFORM 2100-BLOWUP

           ELSE

             MOVE MPLTINFO-COMPANY TO PLANT-SAVE
             MOVE MPLTINFO-TERR TO TERR-SAVE

           END-IF.

      *
      * GET THE DEFAULT PO NUMBER TO USE IF THE PO NUMBER SUPPLIED
      * IS INVALID
      *
           MOVE "DUPO" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL

             MOVE "GETKEY ERROR MPLTINFO*1-HSK" TO BU-DISPLAY-MSG
             MOVE "DUPO" TO BU-DISPLAY-FLD (1)
             PERFORM 2100-BLOWUP

           ELSE

             PERFORM 9999-RESET-MPLTINFO-PK-O
             MOVE MPLTINFO-DUPO-PO-RLSE-NO TO DEFAULT-PO-RLSE-NO

           END-IF.

           MOVE 1                        TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.

       201-UPDATE-DUTY.
           MOVE 1                TO  NUMBER-OF-DSETS-LOCKED.
           MOVE "MPLTINFO;"      TO  DSET-NAME-1.
           MOVE "PLTINFO-KEY;"   TO  ITEM-LIST-1.
           MOVE "DUTY"           TO  LOCK-VALUE-1.
           PERFORM 9999-MULTI-LOCK.
           MOVE "DUTY"                   TO  PLT-ARG,
                                             BU-DISPLAY-FLD (1).
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL
               MOVE "GETKEY ERR 210-UPDATE-DUTY" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           ADD +1                        TO  MPLTINFO-DUTY-SEQ.
           MOVE DATE-YMD-OUT             TO  MPLTINFO-DUTY-SEQ-DATE.
           MOVE DUTY-CTR                 TO  MPLTINFO-DUTY-CTR.
           MOVE FRT-CTR                  TO  MPLTINFO-DUTY-FRT-CTR.
           MOVE RCD-CTR                  TO  MPLTINFO-DUTY-RCD-CTR.
           MOVE ZEROS                    TO  MPLTINFO-DUTY-LAST.
           PERFORM 9999-UPDATE-MPLTINFO-PK-O.
           PERFORM 9999-UNLOCK.

       2100-BLOWUP.
           IF BACKOUT-REGNUM-SW EQUAL "Y"
             PERFORM 900-BACKOUT-REGNUM
           END-IF.
           IF RESET-SW = "Y"
             PERFORM 602-RESET-DUTY
           END-IF.
           IF DL-TC NUMERIC
             MOVE "TC ="                   TO  BU-DISPLAY-FLD (3)
             MOVE  DL-TC                   TO  BU-DISPLAY-FLD9 (3)
           ELSE
             MOVE "TC NOT NUMERIC" TO BU-DISPLAY-FLD(3)
           END-IF.
           MOVE  DL-PO-NO                TO  BU-DISPLAY-FLD (4).
           MOVE  DL-INV-NO               TO  BU-DISPLAY-FLD (5).
           MOVE  RCD-CTR                 TO  BU-DISPLAY-FLD9 (5).
           MOVE "TDUTYLOD"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       6-MAIN.
           MOVE "6-MAIN"                 TO   BU-DISPLAY-FLD (5).

      *---------- CHECK TO MAKE SURE THAT WE HAVE RECEIVED THE CORRECT
      *---------- SEQUENCE NUMBER.  DUTY WILL CONTAIN THE LAST SUCCESSFUL
      *---------- TRANSMISSION NUMBER.
           MOVE "DUTY"                   TO   PLT-ARG,
                                              BU-DISPLAY-FLD (1).
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NO-ENTRY
             PERFORM 601-CREATE-DUTY
           ELSE
             PERFORM 9999-RESET-MPLTINFO-PK-O
           END-IF.

           MOVE MPLTINFO-DUTY-SEQ        TO  SEQUENCE-CTR-CHK.
           PERFORM 900-READ-DUTY UNTIL
                   EOF-SW = "Y" OR
                   DH-TC  = "100".
           IF EOF-SW = "Y"
               IF NUMBER-RECS-READ = 0
                   PERFORM 900-PRINT-ERROR
                   GO TO 6-MAIN-X
               ELSE
               IF NOT FILE-PROCESSED
                   MOVE "HEADER RECORD MISSING" TO BU-DISPLAY-MSG
                   GO TO 2100-BLOWUP
               ELSE
                   GO TO 6-MAIN-X.
           ADD  1                        TO   SEQUENCE-CTR-CHK.
           IF  DH-SEQ-NO NOT = SEQUENCE-CTR-CHK
               MOVE "FILE EXPECTED = "   TO   BU-DISPLAY-FLD (1)
               MOVE SEQUENCE-CTR-CHK     TO   BU-DISPLAY-FLD9 (1)
               MOVE "FILE SENT = "       TO   BU-DISPLAY-FLD (2)
               MOVE DH-SEQ-NO            TO   BU-DISPLAY-FLD9 (2)
               GO TO 2100-BLOWUP.

           IF TERR-SAVE NOT = DH-PLT-TERR
               MOVE "TERR = "            TO   BU-DISPLAY-FLD (1)
               MOVE  TERR-SAVE           TO   BU-DISPLAY-FLD (2)
               MOVE "INVALID TERR NUMBER"  TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           MOVE DH-SEQ-NO                TO  PRT-HDG-2-SEQ.
           MOVE 1                        TO  RCD-CTR.
           MOVE "Y"                      TO  RESET-SW.

       6-READ-NEXT-RCD.
           MOVE "N" TO BACKOUT-REGNUM-SW.
           PERFORM 900-READ-DUTY.
           ADD 1 TO RCD-CTR.
           IF DH-TC = "900"
               PERFORM 201-UPDATE-DUTY
               MOVE "Y"                  TO  FILE-PROCESS-SW
               IF FOUND-INVOICE = "N"
                   PERFORM 900-PRINT-ERROR
               END-IF
               GO TO 6-MAIN.
           IF DL-TC = "200" OR "300"
               MOVE "Y"                  TO  FOUND-INVOICE
               ADD 1                     TO  NUM-TOR-INV
               ADD DL-INV-AMNT           TO  TOT-TOR-INV
           ELSE
9311CK         IF DL-HASP-CONTROL = "+"
  .               SUBTRACT 1 FROM RCD-CTR
  .               GO TO 6-READ-NEXT-RCD
9311CK         ELSE
                  MOVE "INVALID TC SENT"    TO  BU-DISPLAY-FLD (1)
                  MOVE "RCD NUMBER = "      TO  BU-DISPLAY-FLD (2)
                  MOVE  RCD-CTR             TO  BU-DISPLAY-FLD9 (2)
                  GO TO 2100-BLOWUP.

       61-VERIFY-PO.
           MOVE "N"                         TO  PRT-DEFAULT-MSG.
           MOVE SPACES TO BAD-PO-MSG.
           MOVE DL-PO-NO TO PO-NO-IN.
      *------- IF NAPANEE, SKIP THIS LOGIC TEMPORARILY.
           IF PLANT-SAVE = "631"
               NEXT SENTENCE
           ELSE
           IF PO-RLSE-NO = SPACES

      *
      * TRY FOR 000 PO FIRST
      *
             MOVE "000" TO PO-RLSE-NO
             MOVE PO-NO-EDIT TO PO-ARG, BU-DISPLAY-FLD(1)
             PERFORM 9999-GETKEY-MPORCV-PO-I
9306CK*      IF NO-ENTRY
  .   *
  .   *
  .   * TRY FOR 999 PO IF 000 PO NOT FOUND
  .   *
  .   *        MOVE "999" TO PO-RLSE-NO
  .   *        MOVE PO-NO-EDIT TO PO-ARG, BU-DISPLAY-FLD(1)
  .   *        PERFORM 9999-GETKEY-MPORCV-PO-I
  .   *
9306CK*      END-IF

           ELSE

             MOVE PO-NO-EDIT TO PO-ARG, BU-DISPLAY-FLD(1)
             PERFORM 9999-GETKEY-MPORCV-PO-I

           END-IF.

      *
      * IF GIVEN PO WASN'T FOUND THEN TRY THE DEFAULT PO NUMBER FOUND
      * IN MPLTINFO KEY = "DUPO"
      *
      * USE DEFAULT PO FOR NAPANEE DUTY FOR NOW.     11/20/95
      *
           IF NO-ENTRY OR PLANT-SAVE = "631"

             MOVE DEFAULT-PO-RLSE-NO TO PO-NO-IN
             MOVE PO-NO-EDIT TO PO-ARG, BU-DISPLAY-FLD(1)
             PERFORM 9999-GETKEY-MPORCV-PO-I
             IF NO-ENTRY

               MOVE "DEFAULT PO DOES NOT EXIST; NOT PROCESSED"
                                      TO  PRT-DTL-MSG
               MOVE SPACES            TO  PRT-DTL-REG
                                          PRT-DTL-INV
                                          PRT-PO
               PERFORM 900-PRINT-LINE
               GO TO 6-READ-NEXT-RCD

             ELSE

      *
      * PUT THE INVALID PO NUMBER INTO THE HOLD VERBAGE
      * IF IT WAS INDEED INVALID.
      *
               STRING "PO NUM = " DELIMITED BY SIZE,
                 DL-PO-NO DELIMITED BY SIZE INTO BAD-PO-MSG
               MOVE "Y"                     TO  PRT-DEFAULT-MSG
      *        MOVE "PO DOESN'T EXIST, DEFAULT PO ASSIGNED -" TO
      *        MOVE "INVOICE ASSIGNED TO DEFAULT PO"     TO  PRT-DTL-MSG
      *        PERFORM 900-PRINT-LINE

             END-IF

           END-IF.
           PERFORM 9999-CHAINHD-DPOITEM-PO-I.
           PERFORM 9999-GETNEXT-DPOITEM-PO-I.
           IF NOT GOOD-CALL
               MOVE "NO ITEMS ON PO; INVOICE NOT PROCESSED"
                                                        TO  PRT-DTL-MSG
               MOVE SPACES            TO  PRT-DTL-REG
                                          PRT-DTL-INV
                                          PRT-PO
               PERFORM 900-PRINT-LINE
               GO TO 6-READ-NEXT-RCD.
           PERFORM 9999-CHAINHD-DPORECD-PO-O.
           PERFORM 9999-GETNEXT-DPORECD-PO-O.
           IF NOT GOOD-CALL
               MOVE "GETNEXT DPORECD*61-VP"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.
           PERFORM 9999-RESET-DPORECD-PO-O.

       61-GET-VENDOR.

      *
      * CHECK IF VENDOR EXISTS AND GET PAYTO VENDOR INFO IF IT DOES
      *
           MOVE PO-VEN-CODE TO VEN-ARG.
           PERFORM 9999-CHAINHD-DVENDOR-VN-I.
           PERFORM 9999-GETNEXT-DVENDOR-VN-I.
           IF NOT GOOD-CALL
               MOVE "GETNEXT DVENDOR *  61-LO" TO BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.
           MOVE "000"  TO  VEN-ARG8-10.
           PERFORM 9999-CHAINHD-DVENDOR-VN-I.
           PERFORM 9999-GETNEXT-DVENDOR-VN-I.

       62-CREATE-INVOICE.
           PERFORM  621-CREATE-REGNUM.
           MOVE 3                        TO  NUMBER-OF-DSETS-LOCKED.
           MOVE DSET-DINVITM             TO  DSET-NAME-1.
           MOVE DSET-DINVACCT            TO  DSET-NAME-2.
           MOVE DSET-DINVRCD             TO  DSET-NAME-3.
           MOVE REG-SEARCH             TO  ITEM-LIST-1,
                                           ITEM-LIST-2,
                                           ITEM-LIST-3.
           MOVE REG-NUM-SAVE             TO  LOCK-VALUE-1,
                                             LOCK-VALUE-2,
                                             LOCK-VALUE-3.
           PERFORM 9999-MULTI-LOCK.

       62-BUILD-DINVRCD.
           MOVE SPACE                TO  BUF-DINVRCD.
           MOVE ZERO                 TO  INV-ADD-VFRT,
                                         INV-ADD-INS,
                                         INV-ADD-TAX,
                                         INV-ADD-CTNRS,
                                         INV-ADD-OTHER,
                                         CE3-FRT,
                                         CE4-INS,
                                         CE5-TAX,
                                         CE6-EXT-ERR,
                                         CE7-UPRC-ERR,
                                         CE8-OTHER,
                                         CE9-CASH-DSCNT,
                                         CE-EXT-VALUE-1,
                                         INV-ADD-GST,
                                         INV-NET-DUE-VENDOR,
                                         INV-TOTAL-CFRT,
                                         INV-ATAX-AMT (1),
                                         INV-ATAX-AMT (2),
                                         INV-ATAX-AMT (3),
                                         INV-ATAX-AMT (4),
                                         INV-ADJ-OTHER,
                                         INV-DIST-COST.

      *
      * IF THE INVOICE'S PO WAS REPLACE BY THE DEFAULT BECAUSE
      * IT DID NOT EXIST THE BAD-PO-MSG WILL CONTAIN THE BAD PO
      * NUMBER, OTHERWISE IT WILL BE SPACES
      *
           MOVE BAD-PO-MSG TO INV-FREE-VERB.
           MOVE "DUTY"               TO  INV-ADD-CLERK.
           MOVE REG-NUM-SAVE         TO  INV-REG-NO,
                                         REGISTER-ARG,
                                         BU-DISPLAY-FLD (1).
           MOVE PO-ARG               TO  INV-PO-RCV-NO.
           MOVE "P"                  TO  INV-STATUS,
                                         INV-PAYMENT-IND.
           MOVE VEN-ARG              TO  INV-VEN-CODE.
           MOVE DL-INV-NO            TO  INV-NO-IN.
           IF DL-TC = "200"
               ADD  +1               TO  DUTY-CTR
               MOVE "DUTY-"          TO  INV-TYPE
           ELSE
           IF DL-TC = "300"
               ADD  +1               TO  FRT-CTR
               MOVE "FRHT-"          TO  INV-TYPE.
           MOVE INV-NO-EDIT          TO  INV-NO.
           MOVE DL-INV-DATE          TO  DATE-VALIDATE-IN.
           MOVE 1                    TO  DATE-CODE.
           MOVE 3                    TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
      *-------- ACCOUNT FOR CENTURY.
           MOVE DATE-YMD-OUT         TO  HOLD-DATE-YMD.
           IF HOLD-YY > "70"
               MOVE "19"             TO  HOLD-CC
           ELSE
               MOVE "20"             TO  HOLD-CC.
           MOVE HOLD-DATE-CN         TO  INV-ENTRY-CN,
                                         INV-DATE-CN,
                                         INV-DUE-CN.
           MOVE "X"                  TO  INV-NO-CHECK-INDIC.
           MOVE PO-TERMS             TO  INV-TERMS.
           MOVE "1"                  TO  CE-CODE (1).
           MOVE DL-INV-AMNT          TO  CE-VALUE (1),
                                         INV-NET-DUE-VENDOR,
                                         INV-I-MATL-EXT,
                                         INV-P-MATL-EXT,
                                         INV-DIST-COST.
           MOVE PO-PRIME             TO  ACCTG-PRIME.
           MOVE PO-SUB               TO  ACCTG-SUB.
           MOVE PO-SUB-DET           TO  ACCTG-SUBD.
           MOVE ACCTG-AREA           TO  CE-ACCTG-DATA (1).

           PERFORM 9999-PUT-DINVRCD-RG-O.
           MOVE "Y" TO BACKOUT-REGNUM-SW.

       64-ITEM-MATCHING.
           MOVE ZEROS TO TOTAL-MATL-COST, ITM-CTR, TOTAL-COST-DIST.

      *
      * COUNT THE NUMBER OF ITEMS AND ADD UP THE TOTAL COST
      *
           PERFORM 9999-CHAINHD-DPOITEM-PO-I.
           PERFORM 9999-GETNEXT-DPOITEM-PO-I.
           PERFORM UNTIL END-OF-CHAIN

             ADD 1 TO ITM-CTR
             COMPUTE TOTAL-MATL-COST ROUNDED = TOTAL-MATL-COST +
                                       (ITM-UNIT-PRICE * ITM-QTY-ORD)
             PERFORM 9999-GETNEXT-DPOITEM-PO-I

           END-PERFORM.
           IF ITM-CTR EQUAL ZERO
               MOVE "NO ITEMS ON PO; INVOICE NOT PROCESSED"
                                                        TO  PRT-DTL-MSG
               MOVE SPACES            TO  PRT-DTL-REG
                                          PRT-DTL-INV
                                          PRT-PO
               PERFORM 900-PRINT-LINE
               PERFORM 900-BACKOUT-REGNUM
               GO TO 6-READ-NEXT-RCD.

      *
      * IF NO COST FOR MATERIAL THEN DIVIDE DUTY EVENLY
      *
           IF TOTAL-MATL-COST EQUAL ZERO

             COMPUTE ITM-DIST-COST ROUNDED = DL-INV-AMNT / ITM-CTR

           END-IF.
           PERFORM 9999-CHAINHD-DPOITEM-PO-I.
           PERFORM 9999-GETNEXT-DPOITEM-PO-I.
           PERFORM UNTIL END-OF-CHAIN

      *
      * CALCULATE THE MATERIAL PERCENTAGE FOR THIS ITEM IF
      * MATERIAL ON THE ENTIRE PO HAS A COST -- CHARGE ITS SHARE
      *
             IF TOTAL-MATL-COST NOT EQUAL ZERO

      *
      * %OF TOTAL COST * TOTAL INVOICE AMOUNT
      *
               COMPUTE ITM-DIST-COST ROUNDED =
                 ((ITM-UNIT-PRICE * ITM-QTY-ORD) / TOTAL-MATL-COST)
                 * DL-INV-AMNT

             END-IF
             ADD ITM-DIST-COST TO TOTAL-COST-DIST

      *
      * BUILD DINVITM ENTRY
      *
             MOVE SPACES TO BUF-DINVITM
             MOVE INV-REG-NO TO INVITM-REG-NO
             MOVE ITM-CORP-CODE TO INVITM-CORPCODE
             MOVE ZEROS TO INVITM-PO-QTY-PD, INVITM-INV-QTY-PD
             MOVE ITM-UM TO INVITM-PO-UM
             MOVE ITM-DIST-COST TO INVITM-PO-UPRICE, INVITM-INV-UPRICE
             MOVE ITM-NUMBER TO INVITM-ITEM-NO
             MOVE "NO" TO INVITM-TAX-CODE
             PERFORM 9999-PUT-DINVITM-RG-O

      *
      * BUILD DINVACCT ENTRY
      *
             MOVE SPACES TO BUF-DINVACCT
             MOVE INV-REG-NO TO INVACCT-REG-NO
             MOVE ITM-CLASS TO ACCTG-SUB
             MOVE ITM-SUB-DETL TO ACCTG-SUBD
             MOVE ITM-ADDL-DATA TO ACCTG-ADDL
             MOVE ACCTG-AREA TO INVACCT-DATA
             MOVE 100 TO INVACCT-PCT
             MOVE ITM-NUMBER TO INVACCT-ITEM
9302CK       MOVE 01    TO INVACCT-LINE
             PERFORM 9999-PUT-DINVACCT-RG-O
             PERFORM 9999-GETNEXT-DPOITEM-PO-I

           END-PERFORM.

           COMPUTE DIFF-COST-DIST = DL-INV-AMNT - TOTAL-COST-DIST.
           IF DIFF-COST-DIST NOT EQUAL ZERO

      *
      * FIND THE FIRST INVITM RECORD WITH DUTY CHARGED > 0
      * SO CAN CHARGE LEFTOVER COST TO THAT ITEM.
      *
             PERFORM 9999-CHAINHD-DINVITM-RG-O
             PERFORM 9999-GETNEXT-DINVITM-RG-O
             PERFORM UNTIL INVITM-PO-UPRICE > 0 OR
                           END-OF-CHAIN

               PERFORM 9999-GETNEXT-DINVITM-RG-O

             END-PERFORM
             IF END-OF-CHAIN

               MOVE "CAN'T DISTRIBUTE COSTS; NOT PROCESSED"
                                      TO  PRT-DTL-MSG
               MOVE SPACES            TO  PRT-DTL-REG
                                          PRT-DTL-INV
                                          PRT-PO
               PERFORM 900-PRINT-LINE

               PERFORM 900-BACKOUT-REGNUM
               GO TO 6-READ-NEXT-RCD

             ELSE

      *
      * PUT THE REST OF THE COST ON THE ITEM
      *
               ADD DIFF-COST-DIST TO INVITM-PO-UPRICE,
                                     INVITM-INV-UPRICE
               PERFORM 9999-UPDATE-DINVITM-RG-O

             END-IF

           END-IF.

           ADD 1                  TO  NUM-CSIS-INV

           IF PRT-DEFAULT-MSG = "Y"
               MOVE "DEFAULT PO USED; INVOICE PROCESSED"
                                  TO  PRT-DTL-MSG
           ELSE
               MOVE "INVOICE PROCESSED"
                                  TO  PRT-DTL-MSG
           END-IF

           MOVE REG-NUM-SAVE      TO  PRT-DTL-REG
           MOVE INV-NO-EDIT       TO  PRT-DTL-INV
           MOVE PO-NO-1-7         TO  PRT-DTL-CSIS-PO
           MOVE "-"               TO  PRT-DTL-HYPHEN
           MOVE PO-RLSE-NO        TO  PRT-DTL-CSIS-RCV
           PERFORM 900-PRINT-LINE

           PERFORM 9999-UNLOCK.

       64-UPDATE-MONTH-PAID.
           MOVE 1                       TO  NUMBER-OF-DSETS-LOCKED.
           MOVE DSET-DPORECD            TO  DSET-NAME-1.
           MOVE PO-SEARCH               TO  ITEM-LIST-1.
           MOVE PO-ARG                  TO  LOCK-VALUE-1.
           PERFORM 9999-MULTI-LOCK.

           PERFORM 9999-CHAINHD-DPORECD-PO-O.
           PERFORM 9999-GETNEXT-DPORECD-PO-O.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
      *-------- ACCOUNT FOR CENTURY.
           MOVE DATE-YMD-OUT TO HOLD-DATE-YMD.
           IF HOLD-YY > "70"
               MOVE "19"     TO HOLD-CC
           ELSE
               MOVE "20"     TO HOLD-CC.
           MOVE HOLD-DATE-CN TO PO-LAST-PAYMENT-CN.
           PERFORM 9999-UPDATE-DPORECD-PO-O.
           PERFORM 9999-UNLOCK.

           GO TO 6-READ-NEXT-RCD.

       6-MAIN-X.
           EXIT.

       601-CREATE-DUTY.
           MOVE 1                TO  NUMBER-OF-DSETS-LOCKED.
           MOVE "MPLTINFO;"      TO  DSET-NAME-1.
           MOVE "@;"             TO  ITEM-LIST-1.
           MOVE SPACES           TO  LOCK-VALUE-1.
           PERFORM 9999-MULTI-LOCK.
           MOVE SPACES                   TO  BUF-MPLTINFO.
           MOVE "DUTY"                   TO  MPLTINFO-KEY.
           MOVE "00000"                  TO  MPLTINFO-DUTY-SEQ.
           MOVE DATE-YMD-OUT             TO  MPLTINFO-DUTY-SEQ-DATE.
           PERFORM 9999-PUT-MPLTINFO-PK-O.
           PERFORM 9999-UNLOCK.

       602-RESET-DUTY.
           MOVE "N" TO RESET-SW.
           MOVE 1                TO  NUMBER-OF-DSETS-LOCKED.
           MOVE "MPLTINFO;"      TO  DSET-NAME-1.
           MOVE "@;"             TO  ITEM-LIST-1.
           MOVE SPACES           TO  LOCK-VALUE-1.
           PERFORM 9999-MULTI-LOCK.
           MOVE "DUTY"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           MOVE MPLTINFO-DUTY-SEQ        TO  MPLTINFO-DUTY-LAST.
           MOVE "00000"                  TO  MPLTINFO-DUTY-SEQ.
           MOVE DATE-YMD-OUT             TO  MPLTINFO-DUTY-SEQ-DATE.
           MOVE DUTY-CTR                 TO  MPLTINFO-DUTY-CTR.
           MOVE FRT-CTR                  TO  MPLTINFO-DUTY-FRT-CTR.
           MOVE RCD-CTR                  TO  MPLTINFO-DUTY-RCD-CTR.
           PERFORM 9999-UPDATE-MPLTINFO-PK-O.
           PERFORM 9999-UNLOCK.

       621-CREATE-REGNUM.
           MOVE 1                TO  NUMBER-OF-DSETS-LOCKED.
           MOVE "MPLTINFO;"      TO  DSET-NAME-1.
           MOVE "PLTINFO-KEY;"   TO  ITEM-LIST-1.
           MOVE "PREG"           TO  LOCK-VALUE-1.
           PERFORM 9999-MULTI-LOCK.
           MOVE "PREG"  TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.

      *
      * MAKE SURE THE REGISTER NUMBER DOESN'T EXIST
      *
           COMPUTE REGISTER-ARG = MPLTINFO-REGNUM + 1.
           PERFORM 9999-CHAINHD-DINVRCD-RG-O.
           PERFORM 9999-GETNEXT-DINVRCD-RG-O.
           PERFORM UNTIL END-OF-CHAIN

             ADD 1 TO REGISTER-ARG
             PERFORM 9999-CHAINHD-DINVRCD-RG-O
             PERFORM 9999-GETNEXT-DINVRCD-RG-O

           END-PERFORM.
           MOVE REGISTER-ARG TO REG-NUM-SAVE, MPLTINFO-REGNUM.
           PERFORM 9999-UPDATE-MPLTINFO-PK-O.
           PERFORM 9999-UNLOCK.

       900-READ-DUTY.
           READ DUTY-FILE
               AT END MOVE "Y"           TO  EOF-SW.
           IF EOF-SW = "N"
9502CZ         ADD 1                     TO  NUMBER-RECS-READ.

       900-BACKOUT-REGNUM.
           MOVE "N" TO BACKOUT-REGNUM-SW.
      *    STRING "REGISTER NUMBER " REG-NUM-SAVE " BACKED OUT"
      *      DELIMITED BY SIZE INTO PO-ERROR-MSG.
      *    PERFORM 900-PRINT-LINE.
           MOVE 4                        TO  NUMBER-OF-DSETS-LOCKED.
           MOVE DSET-DINVITM             TO  DSET-NAME-1.
           MOVE DSET-DINVACCT            TO  DSET-NAME-2.
           MOVE DSET-DINVRCD             TO  DSET-NAME-3.
           MOVE DSET-MPLTINFO            TO  DSET-NAME-4.
           MOVE REG-SEARCH             TO  ITEM-LIST-1,
                                           ITEM-LIST-2,
                                           ITEM-LIST-3.
           MOVE "PLTINFO-KEY;"           TO  ITEM-LIST-4.
           MOVE REG-NUM-SAVE             TO  LOCK-VALUE-1,
                                             LOCK-VALUE-2,
                                             LOCK-VALUE-3.
           MOVE "PREG"                   TO  LOCK-VALUE-4.
           PERFORM 9999-MULTI-LOCK.
           MOVE "PREG"  TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF REG-NUM-SAVE  =  MPLTINFO-REGNUM

             SUBTRACT 1 FROM MPLTINFO-REGNUM
             PERFORM 9999-UPDATE-MPLTINFO-PK-O

           ELSE

             PERFORM 9999-RESET-MPLTINFO-PK-O

           END-IF.

           MOVE REG-NUM-SAVE TO REGISTER-ARG, BU-DISPLAY-FLD(1).

      *
      * DELETE DINVRCD ENTRY
      *
           PERFORM 9999-CHAINHD-DINVRCD-RG-O.
           PERFORM 9999-GETNEXT-DINVRCD-RG-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DINVRCD-RG-O
             PERFORM 9999-GETNEXT-DINVRCD-RG-O

           END-PERFORM.

      *
      * DELETE DINVITM ENTRY
      *
           PERFORM 9999-CHAINHD-DINVITM-RG-O.
           PERFORM 9999-GETNEXT-DINVITM-RG-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DINVITM-RG-O
             PERFORM 9999-GETNEXT-DINVITM-RG-O

           END-PERFORM.

      *
      * DELETE DINVACCT ENTRY
      *
           PERFORM 9999-CHAINHD-DINVACCT-RG-O.
           PERFORM 9999-GETNEXT-DINVACCT-RG-O.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 9999-DELETE-DINVACCT-RG-O
             PERFORM 9999-GETNEXT-DINVACCT-RG-O

           END-PERFORM.
           PERFORM 9999-UNLOCK.

       900-PRINT-ERROR.
           IF LINE-CTR > 55
               PERFORM 900-PRINT-HEADINGS.
           MOVE "** NO INVOICES TRANSMITTED **"
                                         TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 2 LINES.
           WRITE DUTY-SUM-REC.
           ADD 2 TO  LINE-CTR.

       900-PRINT-LINE.
           IF LINE-CTR > 55
               PERFORM 900-PRINT-HEADINGS.
           MOVE DL-INV-AMNT              TO  PRT-DTL-AMT.
           MOVE DL-PO-NO                 TO  PRT-DTL-TOR-PO.
           MOVE PRT-DTL                  TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 1 LINE.
           WRITE DUTY-SUM-REC.
           ADD 1 TO  LINE-CTR.

       900-PRINT-HEADINGS.
           ADD 1                         TO  PAGE-CTR.
           MOVE PAGE-CTR                 TO  PRT-HDG-2-PG.
           MOVE PRT-HDG-1                TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING NEW-PAGE.
           WRITE DUTY-SUM-REC.
           MOVE PRT-HDG-2                TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 1 LINE.
           WRITE DUTY-SUM-REC.
           MOVE PRT-HDG-3                TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 2 LINES.
           WRITE DUTY-SUM-REC.
           MOVE PRT-HDG-4                TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 1 LINE.
           WRITE DUTY-SUM-REC.
           MOVE PRT-HDG-4U               TO  DR-LINE
                                             SUM-LINE.
           WRITE DUTY-RCD AFTER ADVANCING 1 LINE.
           WRITE DUTY-SUM-REC.
           MOVE 6                        TO  LINE-CTR.

       9999-OPENS.
           OPEN INPUT  DUTY-FILE
                       MPORCV-PO-I
                       DPOITEM-PO-I
                       DVENDOR-VN-I.
           OPEN OUTPUT DUTY-REPORT.
           OPEN I-O    MPLTINFO-PK-O
                       DPORECD-PO-O
                       DINVRCD-RG-O
                       DINVACCT-RG-O
                       DINVITM-RG-O.
           OPEN EXTEND DUTY-SUM-RPT.

       9999-CLOSES.
           IF FOUND-INVOICE = "N" OR NUMBER-RECS-READ = 0
               NEXT SENTENCE
           ELSE
      *------ WRITE TOTAL LINES ON REPORT.
               MOVE TOT-TOR-INV              TO  PRT-INV-AMT
               MOVE NUM-TOR-INV              TO  PRT-TOT-1-NUM
               MOVE NUM-CSIS-INV             TO  PRT-TOT-2-NUM
               MOVE "   TOTALS:  "           TO  DR-LINE
                                                 SUM-LINE
               WRITE DUTY-RCD AFTER ADVANCING 2 LINES
               WRITE DUTY-SUM-REC
               MOVE PRT-TOT                  TO  DR-LINE
                                                 SUM-LINE
               WRITE DUTY-RCD AFTER ADVANCING 1 LINE
               WRITE DUTY-SUM-REC.

           CLOSE  DUTY-FILE
                  MPORCV-PO-I
                  DPOITEM-PO-I
                  DVENDOR-VN-I
                  DUTY-REPORT
                  MPLTINFO-PK-O
                  DPORECD-PO-O
                  DINVRCD-RG-O
                  DINVACCT-RG-O
                  DINVITM-RG-O
                  DUTY-SUM-RPT.
      *
      * DATABASE ACCESS PROCEDURES
      *
       9999-UNLOCK.
      * DUMMY PARAGRAPH ON AS/400

       9999-MULTI-LOCK.
      * DUMMY PARAGRAPH ON AS/400

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           WRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-GETKEY-MPORCV-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF MPORCV-PO-REC-I.
           READ MPORCV-PO-I INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPORCV-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-PO-REC-I.
           START DPOITEM-PO-I KEY = PORCVNO OF DPOITEM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPOITEM-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPOITEM-PO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.


       9999-CHAINHD-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY = PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DPORECD-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPORECD-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY > PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPORECD-PO-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-CHAINHD-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-I.
           START DVENDOR-VN-I KEY = VENCDE OF DVENDOR-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.


       9999-CHAINHD-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVRCD-RG-REC-O.
           START DINVRCD-RG-O KEY = REGISTERNO OF DINVRCD-RG-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVRCD-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           READ DINVRCD-RG-O NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DINVRCD-RG-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVRCD-RG-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVRCD-RG-REC-O NOT = REGISTER-ARG
               PERFORM 9999-RESET-DINVRCD-RG-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DINVRCD-RG-O.
           MOVE HIGH-VALUES TO REGISTERNO OF DINVRCD-RG-REC-O.
           START DINVRCD-RG-O KEY > REGISTERNO OF DINVRCD-RG-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           WRITE DINVRCD-RG-REC-O FROM BUF-DINVRCD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DINVRCD-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           DELETE DINVRCD-RG-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DINVRCD-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-CHAINHD-DINVACCT-RG-O.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCT-RG-REC-O.
           START DINVACCT-RG-O KEY = REGISTERNO OF DINVACCT-RG-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVACCT-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVACCT-RG-O.
           MOVE 0 TO COND-WORD.
           READ DINVACCT-RG-O NEXT INTO BUF-DINVACCT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DINVACCT-RG-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVACCT-RG-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVACCT-RG-REC-O NOT = REGISTER-ARG
               PERFORM 9999-RESET-DINVACCT-RG-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DINVACCT-RG-O.
           MOVE HIGH-VALUES TO REGISTERNO OF DINVACCT-RG-REC-O.
           START DINVACCT-RG-O KEY > REGISTERNO OF DINVACCT-RG-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DINVACCT-RG-O.
           MOVE 0 TO COND-WORD.
           WRITE DINVACCT-RG-REC-O FROM BUF-DINVACCT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DINVACCT-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DINVACCT-RG-O.
           MOVE 0 TO COND-WORD.
           DELETE DINVACCT-RG-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DINVACCT-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-CHAINHD-DINVITM-RG-O.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-RG-REC-O.
           START DINVITM-RG-O KEY = REGISTERNO OF DINVITM-RG-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVITM-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVITM-RG-O.
           MOVE 0 TO COND-WORD.
           READ DINVITM-RG-O NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DINVITM-RG-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVITM-RG-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVITM-RG-REC-O NOT = REGISTER-ARG
               PERFORM 9999-RESET-DINVITM-RG-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DINVITM-RG-O.
           MOVE HIGH-VALUES TO REGISTERNO OF DINVITM-RG-REC-O.
           START DINVITM-RG-O KEY > REGISTERNO OF DINVITM-RG-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DINVITM-RG-O.
           MOVE 0 TO COND-WORD.
           WRITE DINVITM-RG-REC-O FROM BUF-DINVITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DINVITM-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DINVITM-RG-O.
           MOVE 0 TO COND-WORD.
           REWRITE DINVITM-RG-REC-O FROM BUF-DINVITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DINVITM-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DINVITM-RG-O.
           MOVE 0 TO COND-WORD.
           DELETE DINVITM-RG-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DINVITM-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

