000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TDVCWINQ.
000700 ENVIRONMENT DIVISION.
000800 CONFIGURATION SECTION.
000900 SOURCE-COMPUTER.   AS400.
001000 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001500     SELECT OUT-FILE
               ASSIGN TO DATABASE-OUTCWDVI
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
001900     SELECT PRINT-FILE
002000         ASSIGN TO PRINTER-MCPRT.
001800     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS DYNAMIC
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
           SELECT WO-ZONE-PRTY-MSTR-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPMF-STATUS.
002100 DATA DIVISION.
002200 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
002700 FD  OUT-FILE RECORD CONTAINS 104 CHARACTERS
002800     LABEL RECORDS ARE OMITTED
002900     DATA RECORD IS OUT-REC.
003000 01  OUT-REC.
           05  OUT-DATA.
003100         10  DEPT-OUT            PIC X(4).
003200         10  ZONE-OUT.
003300             15  Z-OUT           PIC X(4).
003400             15  P-OUT           PIC X.
003500             15  FILLER          PIC X.
003600         10  SHIFT-OUT           PIC X.
003700         10  WOSTAT-OUT.
003800             15  WOSTAT-O-1      PIC X.
003900             15  WOSTAT-O-2      PIC X.
004000             15  WOSTAT-O-34     PIC XX.
004100         10  WONUM-OUT.
004200             15  WONO-OUT        PIC X(7).
004300             15  WOSU-OUT        PIC X(3).
004400         10  WODESC-OUT          PIC X(30).
004500         10  EQNUM-OUT           PIC X(6).
004600         10  EQDOWN-OUT          PIC XX.
004700         10  DATE-RCVD.
004800             15  DATE-RCVD-MM    PIC XX.
004900             15  DATE-RCVD-DD    PIC XX.
005000             15  DATE-RCVD-YY    PIC XX.
005100         10  TIME-RCVD           PIC XXXX.
005200         10  TIME-COMP-OUT       PIC XXXX.
005300         10  CRAFTSREQ-OUT.
005400             15  C1-OUT          PIC XX.
005500             15  C2-OUT          PIC XX.
005600             15  C3-OUT          PIC XX.
005700         10  CMAN-1-OUT          PIC XXXX.
005800         10  CMAN-2-OUT          PIC XXXX.
005900         10  CMAN-3-OUT          PIC XXXX.
006000         10  TSTRT-OUT           PIC XXXX.
006100         10  RETM-OUT            PIC XXXX.
006200         10  VP-FLAG-OUT         PIC X.
006300
002300 FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
002400     LABEL RECORDS ARE OMITTED
002500     DATA RECORD IS PRINT-REC.
002600 01  PRINT-REC                   PIC X(80).

006400 SD  SORT-FILE RECORD CONTAINS 104 CHARACTERS
006500     DATA RECORD IS SORT-REC.
006600 01  SORT-REC.
006700     05  SORT-DEPT               PIC X(4).
006800     05  SORT-ZONE.
006900         10  SORT-Z              PIC X(4).
007000         10  SORT-P              PIC X.
007100         10  FILLER              PIC X.
007200     05  SORT-SHIFT              PIC X.
007300     05  SORT-WOSTAT             PIC X(4).
007400     05  SORT-WONUM.
007500         10  SORT-WONO           PIC X(7).
007600         10  SORT-WOSU           PIC X(3).
007700     05  SORT-WODESC             PIC X(30).
007800     05  SORT-EQNUM.
007900         10  SORT-EQ1            PIC X.
008000         10  SORT-EQ2            PIC X.
008100         10  SORT-EQ3            PIC X.
008200         10  SORT-EQ4            PIC X.
008300         10  SORT-EQ5            PIC X.
008400         10  SORT-EQ6            PIC X.
008500     05  SORT-EQDOWN             PIC XX.
008600     05  SORT-DATE-RCVD.
008700         10  SORT-DATE-RCVD-MM   PIC XX.
008800         10  SORT-DATE-RCVD-DD   PIC XX.
008900         10  SORT-DATE-RCVD-YY   PIC XX.
009000     05  SORT-TIME-RCVD          PIC XXXX.
009100     05  TIME-COMP-SORT          PIC XXXX.
009200     05  SORT-CRAFTSREQ.
009300         10  SORT-C1             PIC XX.
009400         10  SORT-C2             PIC XX.
009500         10  SORT-C3             PIC XX.
009600     05  CMAN-1-SORT             PIC XXXX.
009700     05  CMAN-2-SORT             PIC XXXX.
009800     05  CMAN-3-SORT             PIC XXXX.
009900     05  TSTRT-SORT              PIC XXXX.
010000     05  RETM-SORT               PIC XXXX.
010100     05  VP-FLAG-SORT            PIC X.
010200
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.

       FD  WO-ZONE-PRTY-MSTR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPMFREC.
       01  WZPMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

010300 WORKING-STORAGE SECTION.
010400 77  ACT-KEY                     PIC 9(9).
011400 77  ADV-CTR                     PIC 9     VALUE 1.
012600 77  ALL-RECORDS-WRITTEN-SW      PIC X     VALUE SPACE.
010500 77  ARG-NO                      PIC 9(9).
012400 77  DATE-WA-SAV1                PIC 999999.
012500 77  DATE-WA-SAV2                PIC 999999.
010800 77  EOF-SW                      PIC 9     VALUE 0.
010600 77  FIELD-CTR                   PIC 99    VALUE 0.
015600 77  FIELD-HOLD                  PIC X(79).
011100 77  FILE-SW                     PIC 9     VALUE 1.
011200     88  BASIC-FILE                        VALUE 1.
014800 77  HOLD-BUFFER                 PIC X(79).
013700 77  JUL-DAY-RECD                PIC 9(7).
013800 77  JUL-DAY-STRT                PIC 9(7).
013900 77  JUL-DAY-COMP                PIC 9(7).
014000 77  JUL-DAYS-LYR                PIC 9(7).
014100 77  JUL-DAY-SAVE                PIC 9(7).
014600 77  MASTER-BUFFER               PIC X(8).
010900 77  NEW-STAT-SW                 PIC 9     VALUE 0.
011700 77  PRIORITY-TAG                PIC X.
011300 77  PRTY-CTR                    PIC 99999 VALUE 0.
011500 77  P-SAVE                      PIC X     VALUE SPACE.
013500 77  RELEASE-FLAG                PIC 9     VALUE 0.
013600     88  RELEASE-FLAG-UP                   VALUE 1.
010700 77  SCREEN-FLAG                 PIC 9     VALUE 0.
       77  SORTED-RECS                 PIC 9(6).
011600 77  STAT-SAVE                   PIC X(4)  VALUE SPACES.
011000 77  SUB                         PIC 99    VALUE ZERO.
014200 77  TRECD-MIN                   PIC S9(4) VALUE 0.
014300 77  TSTRT-MIN                   PIC S9(4) VALUE 0.
014400 77  TCOMP-MIN                   PIC S9(4) VALUE 0.
014500 77  TSAVE-MIN                   PIC S9(4) VALUE 0.
015500 77  WONUM-SAVE                  PIC X(10) VALUE SPACES.
014900 77  WOSTAT-BUF                  PIC XX    VALUE "CW".
011800 77  ZONE-HOLD                   PIC X(04) VALUE SPACES.
015700
031000 01  BU-DISPLAY-AREA.
031100     05  FILLER                 PIC XX.
031200     05  BU-DISPLAY-MSG         PIC X(27).
031300     05  FILLER                 PIC XX.
031400     05  BU-DISPLAY-STAT        PIC S9(4).
031500     05  FILLER                 PIC XX.
031600     05  BU-DISPLAY-FLD         PIC X(14).
031700     05  FILLER                 PIC XX.
031800
       COPY CATREAD  OF COPYLIB.

037400 01  COUNTERS.
037500     05  PRTY1-K                 PIC 9(4).
037600     05  PRTY2-K                 PIC 9(4).
037700     05  PRTY3-K                 PIC 9(4).
037800     05  PRTY4-K                 PIC 9(4).
037900     05  PRTY5-K                 PIC 9(4).
038000     05  LINE-K                  PIC S99.
038100
       COPY CPYIND  OF COPYLIB.

023300 01  CURDATE-BUFFER.
023800     05  YY-BUFFER               PIC XX.
023400     05  MM-BUFFER               PIC XX.
023600     05  DD-BUFFER               PIC XX.
023900
024800 01  DATE-TIME-HOLD.
024900     05  DATE-HOLD.
025000         10  DHOLD-MM            PIC 99.
025100         10  DHOLD-DD            PIC 99.
025200         10  DHOLD-YY            PIC 99.
025300     05  TIME-HOLD.
025400         10  THOLD-HH            PIC 99.
025500         10  THOLD-MM            PIC 99.
025600
024000 01  DATE-WA.
024100     05  DATE-WA-YY              PIC XX.
024200     05  DATE-WA-YY-9 REDEFINES DATE-WA-YY  PIC 99.
024300     05  DATE-WA-MM              PIC XX.
024400     05  DATE-WA-MM-9 REDEFINES DATE-WA-MM  PIC 99.
024500     05  DATE-WA-DD              PIC XX.
024600     05  DATE-WA-DD-9 REDEFINES DATE-WA-DD  PIC 99.
024700
025700 01  DATE-WA-2.
025800     05  DATE-WA-YY-2            PIC 99.
025900     05  DATE-WA-MM-2            PIC 99.
026000     05  DATE-WA-DD-2            PIC 99.
026100
       01  DAY-DIGIT                   PIC X.

048000 01  DBPARAMETERS.         COPY DBPARMS OF COPYLIB.

038200 01  DETAIL-REC.
038300     05  DETAIL-PREFIX.
038400         10  VP-FLAG             PIC X.
038500         10  WONUM-7             PIC X(7).
038600         10  FILLER              PIC X  VALUE "-".
038700         10  WONUM-3             PIC X(3).
038800         10  FILLER              PIC XX VALUE SPACES.
038900         10  EQNUM               PIC X(6).
039000         10  FILLER              PIC XX VALUE SPACES.
039100         10  EQDOWN              PIC XX.
039200         10  FILLER              PIC XX VALUE SPACE.
039300         10  WODESC              PIC X(25).
039400     05  DREC-CD.
039500         10  FILLER              PIC XX.
039600         10  WOTM-CD             PIC Z(4).
039700         10  FILLER              PIC XX.
039800         10  RETM-CD             PIC XXXX.
039900         10  FILLER              PIC XX.
040000         10  CNTM-CD             PIC 9(4).
040100         10  FILLER              PIC XX.
040200         10  CCNUM-CD            PIC XXXX.
040300         10  FILLER              PIC XX.
040400         10  CRAFTSREQ-1-CD      PIC XX.
040600
       01  ERROR-BUFFER                PIC X(80).

       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  OF-STATUS               PIC XX.
           05  WBF-STATUS              PIC XX.
           05  WLF-STATUS              PIC XX.
           05  WLNU-STATUS             PIC XX.
           05  WPF-STATUS              PIC XX.
           05  WZPMF-STATUS            PIC XX.

027900 01  FILL-SCREEN.
028000     05  FIELD-1                 PIC X(78).
028100     05  FIELD-2                 PIC X(79).
028200     05  FIELD-3                 PIC X(79).
028300     05  FIELD-4                 PIC X(79).
028400     05  FIELD-5                 PIC X(79).
028500     05  FIELD-6                 PIC X(79).
028600     05  FIELD-7                 PIC X(79).
028700     05  FIELD-8                 PIC X(79).
028800     05  FIELD-9                 PIC X(79).
028900     05  FIELD-10                PIC X(79).
029000     05  FIELD-11                PIC X(79).
029100     05  FIELD-12                PIC X(79).
029200     05  FIELD-13                PIC X(79).
029300     05  FIELD-14                PIC X(79).
029400     05  FIELD-15                PIC X(79).
029500     05  FIELD-16                PIC X(79).
029600     05  FIELD-17                PIC X(79).
029700     05  FIELD-18                PIC X(79).
029800     05  FIELD-19                PIC X(79).
029900     05  FIELD-20                PIC X(79).
030000     05  FIELD-21                PIC X(79).
           05  FIELD-22                PIC X(79).
030100     05  FIELD-23                PIC X(79).
030200     05  SCRN-CMD-LINE           PIC X(79).
           05  SCRN-ERR-LINE           PIC X(79).
030300
031900 01  FORMS-BUFFER.
032000     05  ZONE-BUF.
032100         10  Z-BUF-1             PIC X.
032200         10  Z-BUF-2             PIC X.
032300         10  FILLER              PIC XX.
032400     05  DATE-BUF.
032500         10  DATE-BUF-MM         PIC XX.
032600         10  DATE-BUF-DD         PIC XX.
032700         10  DATE-BUF-YY         PIC XX.
032800     05  SHIFT-BUF               PIC X.
032900     05  PRIORITY-BUF            PIC X.
033000     05  PRINT-BUF               PIC X.
           05  FORMS-CMD-LINE          PIC X(79).
           05  FORMS-MSG-LINE          PIC X(79).
033100
       01  GREG-DATE.
           05  GREG-CC                 PIC XX.
           05  GREG-YMD.
               10  GREG-YY             PIC XX.
               10  GREG-MM             PIC XX.
               10  GREG-DD             PIC XX.

040700 01  HEADING-DT-TM.
040800     05  FILLER  PIC X(20) VALUE SPACES.
040900     05  FILLER  PIC X(13) VALUE "PRINT DATE:  ".
033100     05  P-DATE.
               10  P-M PIC XX    VALUE SPACES.
               10  FILLER  PIC X VALUE "/".
               10  P-D PIC XX    VALUE SPACES.
               10  FILLER  PIC X VALUE "/".
               10  P-Y PIC XX    VALUE SPACES.
041100     05  FILLER  PIC X(15) VALUE "        TIME:  ".
041200     05  P-TIME  PIC X(04) VALUE SPACES.
041300     05  FILLER  PIC X(20) VALUE SPACES.
041400
041500 01  HEADING-1-H.
041600     05  FILLER  PIC X(03) VALUE SPACES.
041700     05  FILLER  PIC X(10) VALUE "C W   S T ".
041800     05  FILLER  PIC X(17) VALUE "A T U S   B A C K".
041900     05  FILLER  PIC X(20) VALUE " L O G   S C R E E N".
042000     05  FILLER  PIC X(21) VALUE "   F O R   Z O N E:  ".
042100     05  MZ-1-H  PIC X(04) VALUE SPACES.
042200     05  FILLER  PIC X(03) VALUE SPACES.
042300
042400 01  HEADING-X.
042500     05  FILLER        PIC X(20) VALUE SPACES.
042600     05  FILLER        PIC X(20) VALUE "'*' IS A PLANNED OR ".
042700     05  FILLER        PIC X(20) VALUE "ENGINEERED WORKORDER".
042800     05  FILLER        PIC X(19) VALUE SPACES.
042900
043000 01  HEADING-2-COMP.
043100     05  HEADING-2             PIC X(79).
043200
043300 01  HEADING-2-CWDW.
043400     05  FILLER            PIC X(14) VALUE " W/O NUM      ".
043500     05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
043600     05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
043700     05  FILLER            PIC X(10) VALUE SPACES.
043800     05  FILLER            PIC X(18) VALUE "  WOTM  RETM  CWTM".
043900     05  FILLER            PIC X(10) VALUE "  CC # CFT".
044000
044100 01  HEADING-DOTS.
044200     05 FILLER  PIC X(20)
044300                VALUE "--------------------".
044400     05 FILLER  PIC X(20)
044500                VALUE "--------------------".
044600     05 FILLER  PIC X(20)
044700                VALUE "                    ".
044800     05 FILLER  PIC X(19)
044900                VALUE "                    ".
045000
       01  JULIAN-DATE                 PIC X(7).
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).

019400 01  LABOR-BUFFER.
019500     05  L-CC-BUF                PIC XXXX.
019600     05  L-CRFT-BUF              PIC XX.
019700     05  L-TSTRT-BUF             PIC 9999.
019800     05  L-TCOMP-BUF             PIC 9999.
019900     05  L-RETM-BUF.
020000          10  L-RETM-12          PIC XX.
020100          10  L-RETM-DEC         PIC X.
020200          10  L-RETM-4           PIC X.
020300
048700 01  LABOR-CURR-STAT-DATA. COPY DCURRLBR OF COPYLIB.
048900
020400 01  LABOR-TAB.
020500     05  LABOR-TABLE OCCURS 10 TIMES PIC X(18).
020600
015800 01  LAST-WO-BUFF.         COPY MLASTWO OF COPYLIB.
015900
       01  LEAP-YEAR-FLAG              PIC X.

045100 01  LITERAL-1-L.
045200     05  FILLER            PIC X(9) VALUE "PRIORITY:".
045300     05  PRTY-1-L          PIC X.
045400     05  FILLER            PIC X(15) VALUE " ***TOTAL WORK ".
045500     05  FILLER            PIC X(9) VALUE "ORDERS = ".
045600     05  NUM-1-L           PIC ZZZ9.
045700     05  FILLER            PIC X(41) VALUE SPACES.
045800
033700 01  NO-RECORDS-ERR.
033800     05  FILLER  PIC X(18) VALUE "NO W/O'S".
033900     05  FILLER  PIC X(26) VALUE " MEET THESE REQUIREMENTS--".
034000     05  FILLER  PIC X(22) VALUE "PRESS 'F2' TO REQUEST ".
034100     05  FILLER  PIC X(22) VALUE "AGAIN, 'F3' TO END JOB".
034200
       COPY OVRPFDATA IN COPYLIB.

030900 01  PASSED-SPOOL-PRT            PIC S9(2)  COMP.

016000 01  PASSWORD-INFORMATION.
016100     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TDVCWINQ".
016200     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
016300     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
016400     05  PROGRAM-DESCRIPTION.
016500         10  PROG-DESC-A         PIC X(60) VALUE
016600           "INQUIRY FOR CW'D WORK ORDERS ONLY IN DANVILLE"       .
016700         10  PROG-DESC-B         PIC X(60) VALUE SPACES.
016900         10  PROG-FUNCTION       PIC X(60) VALUE SPACES.
017100     05  PASSWORD-FLAG           PIC X.
017200
048500 01  PER-PERSONNEL-DATA.   COPY MPERSONL OF COPYLIB.

047700 01  RETURN-CODE-2.
047800     05  RET-CODE-2              PIC XX VALUE SPACES.
047900
030400 01  SCREEN-PRINT-PARMS.
030500     05  PRINTCNTL               PIC S9(4)    VALUE ZERO COMP.
030600     05  PAGECNTL                PIC S9(4)    VALUE 49   COMP.
030700     05  SPOOLFIL-OPEN-SW        PIC X        VALUE "N".

       COPY DBSTAT OF COPYLIB.

022700 01  TIME-BUFFER.
022800     05  CUR-TIME.
022900         10  CUR-HRS             PIC XX.
023000         10  CUR-MINS            PIC XX.
023100     05  CUR-SECS                PIC XX.
023200
       01  TRUE-VAL                    PIC 1 VALUE B"1".

       COPY VCOMAREA OF COPYLIB.

048200 01  WO-BASIC-DATA.        COPY DWOBASIC OF COPYLIB.

048400 01  WO-LABOR-DATA.        COPY DWOLABOR OF COPYLIB.

048300 01  WO-PLANNED-DATA.      COPY DWOPLAN OF COPYLIB.

018000 01  WO-TIME                     PIC 9999  VALUE 0.
018100 01  WO-TIM-TOT.
018200     05  WOTIME                  PIC 999V9 VALUE 0.
018300     05  WOTIM REDEFINES WOTIME.
018400         10  WOT-TRUNC           PIC 9.
018500         10  WOT-HR              PIC 99.
018600         10  WOT-MIN             PIC 9.
018700 01  WO-TOT.
018800     05  WO-HR.
018900         10  WO-HR-1             PIC X.
019000         10  WO-HR-2             PIC X.
019100     05  WO-DEC                  PIC X VALUE ".".
019200     05  WO-MIN                  PIC X.
019300
036700 01  WORK-ARGUMENTS.
036800     05  ARG-DEFN.
036900         10  WO-NUM-ARG          PIC X(7).
037000         10  WO-SUFF-ARG         PIC X(3).
037100     05  ARG-DEFN-3              PIC X(04).
037200     05  ANS                     PIC X.
037300
       COPY WSCONTROL OF COPYLIB.

047200 01  ZONE-ARGUMENT.
047300     05  Z-ARG-4                 PIC X(4).
047400     05  Z-ARG-5                 PIC X VALUE "1".
047500     05  FILLER                  PIC X VALUE SPACE.
047600
033200 01  ZONE-BUFFERS.
033300     05  ZONE-BUF1               PIC XXXX.
033400     05  ZONE-BUF2               PIC XXXX.
033500     05  ZONE-BUF3               PIC XXXX.
033600
049000 PROCEDURE DIVISION.
049200 BEGIN-PROC.
           CALL "CLCWINQ".
049300     PERFORM 1-HSK.
049400     PERFORM 6-MAIN THRU 6-LOOP-WRITE-SCREEN
               UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           IF PRINT-BUF = "P" CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           CLOSE WO-ZONE-PRTY-MSTR-FILE.
104600     GOBACK.
049600
049700 1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PLANNED-FILE.
           OPEN INPUT  WO-ZONE-PRTY-MSTR-FILE.
049800     ACCEPT CURDATE-BUFFER FROM DATE.
           MOVE YY-BUFFER TO P-Y.
           MOVE MM-BUFFER TO P-M.
           MOVE DD-BUFFER TO P-D.
           ACCEPT TIME-BUFFER FROM TIME.
           MOVE CUR-TIME  TO P-TIME.
049900     MOVE LOW-VALUES TO STATUS-AREA.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ACT-KEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
054200     CALL "TPWORD" USING PASSWORD-INFORMATION.
054600     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
054800*    CALL "TERMPRNT" USING PRINTER-NUM TERMNUM
054900*                               RETURN-CODE-2.
055000*
057000     MOVE "FDVCWINQ" TO VIEW-CFNAME.
           MOVE SPACES TO FORMS-BUFFER ERROR-BUFFER.

055100 6-MAIN.
           MOVE 0 TO SORTED-RECS.
055900     MOVE 0 TO PRTY-CTR.
056000     MOVE SPACES TO ZONE-HOLD.
056100     MOVE 1 TO ADV-CTR.
056200     ACCEPT TIME-BUFFER FROM TIME.
056300     MOVE CUR-TIME TO P-TIME.
056400     MOVE SPACES TO WORK-ARGUMENTS.
           IF ERROR-BUFFER NOT = SPACES
               MOVE SPACES TO DATE-BUF SHIFT-BUF
                              PRIORITY-BUF PRINT-BUF
               MOVE ERROR-BUFFER TO FORMS-MSG-LINE
               MOVE SPACES TO ERROR-BUFFER
           ELSE
056500     MOVE SPACES TO FORMS-BUFFER ERROR-BUFFER.
056600     MOVE SPACES TO WONUM-SAVE.
056800     MOVE "N" TO ALL-RECORDS-WRITTEN-SW.
056900     MOVE ZEROS TO COUNTERS.
       6-LOOP-WRITE-SCREEN.
           MOVE FORMS-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO FORMS-BUFFER.
           MOVE SPACES TO FORMS-MSG-LINE ERROR-BUFFER.
058600     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
058800     IF VIEW-LASTKEY NOT = 0 GO TO 6-LOOP-WRITE-SCREEN.
059200     IF PRINT-BUF = " "
059300         NEXT SENTENCE
059400     ELSE
059500     MOVE "P" TO PRINT-BUF
      *    MOVE 0 TO OVRPRTF-TOFILE-NUM
           MOVE "P " TO OVRPRTF-TOFILE-NUM-X
           PERFORM 996-OVERRIDE-PRINT-FILE
           OPEN OUTPUT PRINT-FILE.
           IF PLANT-IDENT = "126 "
               PERFORM 69-START-WO-ZONE-PRTY-MSTR
061900         IF COND-WORD = 17
062000             MOVE 35044 TO CATREAD-MSG-NUMBER
062100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
062200             MOVE TRUE-VAL TO INDS (1) INDS (99)
062400             GO TO 6-LOOP-WRITE-SCREEN
               ELSE
               NEXT SENTENCE
           ELSE
060300     IF ZONE-BUF = SPACES
060400         NEXT SENTENCE
060500     ELSE
060600     IF Z-BUF-1 = "A" AND Z-BUF-2 = " " OR "A"
060700         NEXT SENTENCE
060800     ELSE
060900     IF Z-BUF-1 = "B" AND Z-BUF-2 = " " OR "B" OR "C" OR "D"
061000         NEXT SENTENCE
061100     ELSE
061200     IF Z-BUF-1 = "C" AND Z-BUF-2 = " "
061300         NEXT SENTENCE
061400     ELSE
           PERFORM 69-START-WO-ZONE-PRTY-MSTR
061900     IF COND-WORD = 17
062000         MOVE 35044 TO CATREAD-MSG-NUMBER
062100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
062200         MOVE TRUE-VAL TO INDS (1) INDS (99)
062400         GO TO 6-LOOP-WRITE-SCREEN.
062600
062700     IF DATE-BUF-MM = "X " OR " X" OR "XX"
062800         PERFORM 60-CUR-DATE.
062900     IF DATE-BUF = SPACES
063000       IF SHIFT-BUF NOT = SPACE
063100           MOVE 29006 TO CATREAD-MSG-NUMBER
063200           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
063300           MOVE TRUE-VAL TO INDS (2) INDS (99)
063500           GO TO 6-LOOP-WRITE-SCREEN.
063600     IF SHIFT-BUF NOT NUMERIC
063700         MOVE SPACE TO SHIFT-BUF.
063800     IF SHIFT-BUF < 1 OR > 3
063900         MOVE SPACE TO SHIFT-BUF.
064000     IF DATE-BUF = SPACES
064100         NEXT SENTENCE
064200     ELSE
064300     IF DATE-BUF-MM > "00" AND < "13"
064400         IF DATE-BUF-DD > "00" AND < "32"
064500             IF DATE-BUF-YY IS NUMERIC
064600                 NEXT SENTENCE
064700             ELSE
064800             MOVE 35032 TO CATREAD-MSG-NUMBER
064900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065000             MOVE TRUE-VAL TO INDS (2) INDS (99)
065200             GO TO 6-LOOP-WRITE-SCREEN
065300         ELSE
065400         MOVE 35030 TO CATREAD-MSG-NUMBER
065500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
065600         MOVE TRUE-VAL TO INDS (2) INDS (99)
065800         GO TO 6-LOOP-WRITE-SCREEN
065900     ELSE
066000     MOVE 35031 TO CATREAD-MSG-NUMBER
066100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
066200     MOVE TRUE-VAL TO INDS (2) INDS (99)
066400     GO TO 6-LOOP-WRITE-SCREEN.
066900     IF PRIORITY-BUF = SPACE
067000         MOVE "A" TO PRIORITY-BUF.
067100     IF PRIORITY-BUF = "1" OR "2" OR "3" OR "4" OR
067200                              "5" OR "A"
067300         NEXT SENTENCE
067400     ELSE
067500     MOVE 35080 TO CATREAD-MSG-NUMBER
067600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
067700     MOVE TRUE-VAL TO INDS (3) INDS (99)
067900     GO TO 6-LOOP-WRITE-SCREEN.
068000
055300     PERFORM 62-SORT-INPUT.
           IF SORTED-RECS = 0
               MOVE 40068 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               CLOSE OUT-FILE
               GO TO 6-MAIN
           ELSE
055400     PERFORM 63-DISPLAY-OUTPUT
           CLOSE OUT-FILE
057000     MOVE "FDVCWINQ" TO VIEW-CFNAME
           MOVE SPACES TO FORMS-BUFFER ERROR-BUFFER.
055600
068200
068300 60-CUR-DATE.
068400     MOVE MM-BUFFER TO DATE-BUF-MM.
068500     MOVE DD-BUFFER TO DATE-BUF-DD.
068600     MOVE YY-BUFFER TO DATE-BUF-YY.
068700     IF SHIFT-BUF = SPACE
068800         IF CUR-TIME > "0699" AND < "1900"
068900             MOVE 1 TO SHIFT-BUF
069000         ELSE
069100         IF CUR-TIME > "1899" AND < "2400"
069200             MOVE 2 TO SHIFT-BUF
069300         ELSE
069400         IF CUR-TIME > "0000" AND < "0700"
                   MOVE 2 TO SHIFT-BUF.
069500
069600 62-SORT-INPUT.
070400     IF ZONE-BUF = SPACES
070500         SORT SORT-FILE ASCENDING KEY SORT-Z
070600                          SORT-P SORT-WONUM CMAN-1-SORT
070700         INPUT PROCEDURE  7-SORT-INPUT-RECORDS
070800         OUTPUT PROCEDURE 8-WRITE-FILE
070900     ELSE
071000     SORT SORT-FILE ASCENDING KEY SORT-P
071100                       SORT-WONUM CMAN-1-SORT
071200     INPUT PROCEDURE  7-SORT-INPUT-RECORDS
071300     OUTPUT PROCEDURE 8-WRITE-FILE.
           MOVE 0 TO ACT-KEY COND-WORD.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.
071400
071500 63-DISPLAY-OUTPUT.
071600     MOVE "FQ1SCRN" TO VIEW-CFNAME.
072000     MOVE SPACES TO FILL-SCREEN.
072100     PERFORM 631-SETUP THRU 631-EXIT.
072200     PERFORM 632-MAIN THRU 632-EXIT UNTIL
072300                 ALL-RECORDS-WRITTEN-SW = "Y".
072500
072600 632-MAIN.
072700     IF ZONE-BUF = SPACES
072800         IF Z-OUT NOT = ZONE-HOLD
072900             MOVE P-SAVE TO PRTY-1-L
073000             PERFORM 6321-PRTY-LITERAL
073100             IF PRINT-BUF NOT = "P"
073200                 MOVE 18 TO LINE-K
073300             ELSE
073400             MOVE Z-OUT TO ZONE-HOLD MZ-1-H
073500             MOVE 55 TO LINE-K.
073800     IF PRINT-BUF NOT = "P"
073900         IF FIELD-CTR > 22 OR LINE-K > 16
074000             MOVE 42061 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 4 TO FIELD-CTR
074200             PERFORM 632-SHOWFORM.
074300
074400     IF PRINT-BUF = "P"
074500         IF LINE-K > 54
074600             MOVE 0 TO LINE-K
074700             PERFORM 6320-HEADINGS.
074800
074900     MOVE SPACES TO DETAIL-REC.
075000     MOVE WONO-OUT         TO WONUM-7.
075100     MOVE WOSU-OUT         TO WONUM-3.
075200     MOVE EQNUM-OUT        TO EQNUM.
075300     MOVE EQDOWN-OUT       TO EQDOWN.
075400     MOVE WODESC-OUT       TO WODESC.
           IF TIME-RCVD = "    "
               MOVE ZEROES TO TIME-RCVD.
075500     MOVE TIME-RCVD        TO WO-TIME.
075600     DIVIDE WO-TIME BY 60 GIVING WOTIME ROUNDED.
075700     MOVE WOT-HR  TO WO-HR.
075800     MOVE WOT-MIN TO WO-MIN.
075900     IF WO-HR-1 = "0" MOVE SPACE TO WO-HR-1.
076000     MOVE WO-TOT  TO WOTM-CD.
076100     MOVE RETM-OUT         TO RETM-CD.
           IF TIME-COMP-OUT = "    "
               MOVE ZEROES TO TIME-COMP-OUT.
076200     MOVE TIME-COMP-OUT    TO CNTM-CD.
076300     MOVE CMAN-1-OUT       TO CCNUM-CD.
076400     MOVE C1-OUT           TO CRAFTSREQ-1-CD.
076500     MOVE VP-FLAG-OUT      TO VP-FLAG.
076600
076700     IF WONUM-OUT = WONUM-SAVE
076800         MOVE SPACES TO DETAIL-PREFIX
076900         MOVE ZEROS TO WOTM-CD
077000     ELSE
077100     MOVE WONUM-OUT TO WONUM-SAVE.
077200
077300     IF ZONE-BUF NOT = SPACES
077400         IF P-OUT NOT = PRIORITY-TAG
077500             MOVE P-OUT TO PRIORITY-TAG
077600             PERFORM 6321-PRTY-LITERAL.
077700
077800     IF ZONE-BUF = SPACES
077900       IF Z-OUT = ZONE-HOLD
078000         IF P-OUT NOT = PRIORITY-TAG
078100             MOVE P-SAVE TO PRTY-1-L
078200             PERFORM 6321-PRTY-LITERAL.
078300
078400     IF ZONE-BUF = SPACES
078500         IF Z-OUT NOT = ZONE-HOLD
078600             MOVE 0 TO PRTY-CTR
078700             MOVE Z-OUT TO ZONE-HOLD MZ-1-H
078800             IF PRINT-BUF NOT = "P"
078900                 PERFORM 6320-HEADINGS.
079000
079100     IF PRINT-BUF NOT = "P"
079200        MOVE DETAIL-REC TO FIELD-HOLD
079300        PERFORM 6322-WRITE-FIELDS
079400        IF FIELD-CTR > 22
079500            MOVE 1 TO SCREEN-FLAG.
079600
079700     IF PRINT-BUF = "P"
079800         MOVE DETAIL-REC TO HOLD-BUFFER
079900         PERFORM 6322-PRINT-FUNCTION.
080000
080100     ADD 1 TO LINE-K.
080200     IF DETAIL-PREFIX NOT = SPACES
080300         ADD 1 TO PRTY-CTR.
080400     ADD 1 TO ACT-KEY.
080500     READ OUT-FILE    INVALID KEY
080600         PERFORM 6323-INVALID-KEY-FUNCTION THRU 6323-IKF-EXIT
080700         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
080800         GO TO 632-SHOWFORM.
081000     IF PRINT-BUF = "P" GO TO 632-EXIT.
081300     IF SCREEN-FLAG = 0 GO TO 632-EXIT.
081500     MOVE 0 TO SCREEN-FLAG.
081600
081700 632-SHOWFORM.
081800     IF PRINT-BUF = "P" GO TO 632-EXIT.
           MOVE 0 TO LINE-K FIELD-CTR.
           MOVE ERROR-BUFFER TO SCRN-ERR-LINE.
           IF EOF-SW = 1
               MOVE 66133 TO CATREAD-MSG-NUMBER
           ELSE
           MOVE 42061 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCRN-CMD-LINE.
           MOVE FILL-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
082600     PERFORM 98-SCREEN-READ.
085500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
083300     IF VIEW-LASTKEY = 1 OR 0
083400         IF EOF-SW = 0
083500             IF NEW-STAT-SW = 0
083600                 PERFORM 6320-HEADINGS
083700             ELSE
083800             MOVE 0 TO NEW-STAT-SW
083900             MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
084000         ELSE
084100         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
084200         MOVE 2 TO VIEW-LASTKEY
084300     ELSE
084400     IF VIEW-LASTKEY = 2
084500         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
085600     ELSE
085700     MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
085800     MOVE 2 TO VIEW-LASTKEY.
085900
086000 632-EXIT.    EXIT.
086100
086200 6320-HEADINGS.
086300     MOVE SPACES TO FILL-SCREEN.
086400     IF PRINT-BUF NOT = "P"
086500         MOVE HEADING-1-H  TO FIELD-2
086600         MOVE HEADING-X TO FIELD-3
086700     ELSE
086800     MOVE HEADING-DT-TM TO PRINT-REC
086900     WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
087000     MOVE HEADING-1-H TO HOLD-BUFFER
087100     PERFORM 6322-PRINT-FUNCTION
087200     MOVE HEADING-X TO HOLD-BUFFER
087300     PERFORM 6322-PRINT-FUNCTION.
087400
087500     MOVE HEADING-2-CWDW TO HEADING-2.
087600
087700     IF PRINT-BUF NOT = "P"
087800         MOVE HEADING-2-COMP TO FIELD-4
087900         MOVE 4 TO FIELD-CTR
088000     ELSE
088100     MOVE HEADING-2 TO HOLD-BUFFER
088200     PERFORM 6322-PRINT-FUNCTION
088300     MOVE HEADING-DOTS TO HOLD-BUFFER
088400     PERFORM 6322-PRINT-FUNCTION.
088500
088600 6321-PRTY-LITERAL.
088700     MOVE P-OUT TO PRIORITY-TAG P-SAVE.
088800     IF ZONE-BUF NOT = SPACES
088900         MOVE P-OUT TO PRTY-1-L.
089000     IF ZONE-BUF = SPACES
089100         MOVE PRTY-CTR TO NUM-1-L
089200         MOVE 0 TO PRTY-CTR
089300     ELSE
089400     IF PRTY-1-L = 1
089500         MOVE PRTY1-K TO NUM-1-L
089600     ELSE
089700     IF PRTY-1-L = 2
089800         MOVE PRTY2-K TO NUM-1-L
089900     ELSE
090000     IF PRTY-1-L = 3
090100         MOVE PRTY3-K TO NUM-1-L
090200     ELSE
090300     IF PRTY-1-L = 4
090400         MOVE PRTY4-K TO NUM-1-L
090500     ELSE
090600     IF PRTY-1-L = 5
090700         MOVE PRTY5-K TO NUM-1-L.
090800
090900     IF PRINT-BUF NOT = "P"
091000         MOVE LITERAL-1-L TO FIELD-HOLD
091100         PERFORM 6322-WRITE-FIELDS
091200         IF ZONE-BUF = SPACES
091300             MOVE HEADING-DOTS TO FIELD-HOLD
091400             PERFORM 6322-WRITE-FIELDS
091500             ADD 1 TO LINE-K
091600         ELSE
091700         NEXT SENTENCE
091800     ELSE
091900     MOVE LITERAL-1-L TO HOLD-BUFFER
092000     PERFORM 6322-PRINT-FUNCTION
092100     IF ZONE-BUF = SPACES
092200         MOVE HEADING-DOTS TO HOLD-BUFFER
092300         PERFORM 6322-PRINT-FUNCTION
092400         ADD 1 TO LINE-K.
092500     ADD 1 TO LINE-K.
092600
092700 6323-INVALID-KEY-FUNCTION.
092800     IF PRINT-BUF NOT = "P"
092900         IF ZONE-BUF = SPACES
093000             MOVE P-SAVE TO PRTY-1-L
093100             PERFORM 6321-PRTY-LITERAL
093200             MOVE 66122 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
093300             MOVE 1 TO EOF-SW
093400         ELSE
093500         MOVE 66122 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
093600         MOVE 1 TO EOF-SW
093700     ELSE
093800     IF ZONE-BUF = SPACES
093900         MOVE P-SAVE TO PRTY-1-L
094000         PERFORM 6321-PRTY-LITERAL
094100         MOVE SPACES TO PRINT-REC
094200*        WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
094300         MOVE 2 TO VIEW-LASTKEY
094400         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
094500     ELSE
094600     MOVE SPACES TO PRINT-REC
094700*    WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
094800     MOVE 2 TO VIEW-LASTKEY
094900     MOVE "Y" TO ALL-RECORDS-WRITTEN-SW.
095000
095100 6323-IKF-EXIT.    EXIT.
095200
095300 631-SETUP.
095400     MOVE ZONE-BUF TO MZ-1-H.
095500     MOVE 1 TO ACT-KEY.
           MOVE 0 TO EOF-SW.
           READ OUT-FILE    INVALID KEY
               GO TO 2-EOJ.
096100     IF ZONE-BUF = SPACES
096200         MOVE Z-OUT TO ZONE-HOLD MZ-1-H.
096300     PERFORM 6320-HEADINGS.
096400     MOVE P-OUT TO PRIORITY-TAG P-SAVE.
096500     IF ZONE-BUF NOT = SPACES
096600         PERFORM 6321-PRTY-LITERAL.
096700
096800 631-EXIT.    EXIT.
096900
097000 6322-WRITE-FIELDS.
097100     ADD 1 TO FIELD-CTR.
097200     IF FIELD-CTR = 5
097300         MOVE FIELD-HOLD TO FIELD-5
097400     ELSE
097500     IF FIELD-CTR = 6
097600         MOVE FIELD-HOLD TO FIELD-6
097700     ELSE
097800     IF FIELD-CTR = 7
097900         MOVE FIELD-HOLD TO FIELD-7
098000     ELSE
098100     IF FIELD-CTR = 8
098200         MOVE FIELD-HOLD TO FIELD-8
098300     ELSE
098400     IF FIELD-CTR = 9
098500         MOVE FIELD-HOLD TO FIELD-9
098600     ELSE
098700     IF FIELD-CTR = 10
098800         MOVE FIELD-HOLD TO FIELD-10
098900     ELSE
099000     IF FIELD-CTR = 11
099100         MOVE FIELD-HOLD TO FIELD-11
099200     ELSE
099300     IF FIELD-CTR = 12
099400         MOVE FIELD-HOLD TO FIELD-12
099500     ELSE
099600     IF FIELD-CTR = 13
099700         MOVE FIELD-HOLD TO FIELD-13
099800     ELSE
099900     IF FIELD-CTR = 14
100000         MOVE FIELD-HOLD TO FIELD-14
100100     ELSE
100200     IF FIELD-CTR = 15
100300         MOVE FIELD-HOLD TO FIELD-15
100400     ELSE
100500     IF FIELD-CTR = 16
100600         MOVE FIELD-HOLD TO FIELD-16
100700     ELSE
100800     IF FIELD-CTR = 17
100900         MOVE FIELD-HOLD TO FIELD-17
101000     ELSE
101100     IF FIELD-CTR = 18
101200         MOVE FIELD-HOLD TO FIELD-18
101300     ELSE
101400     IF FIELD-CTR = 19
101500         MOVE FIELD-HOLD TO FIELD-19
101600     ELSE
101700     IF FIELD-CTR = 20
101800         MOVE FIELD-HOLD TO FIELD-20
101900     ELSE
102000     IF FIELD-CTR = 21
102100         MOVE FIELD-HOLD TO FIELD-21
           ELSE
           IF FIELD-CTR = 22
               MOVE FIELD-HOLD TO FIELD-22
           ELSE
           IF FIELD-CTR = 23
               MOVE FIELD-HOLD TO FIELD-23.
102800
102900 6322-PRINT-FUNCTION.
103000     MOVE HOLD-BUFFER TO PRINT-REC.
103100     WRITE PRINT-REC AFTER ADVANCING ADV-CTR.
103200
       69-START-WO-ZONE-PRTY-MSTR.
           MOVE 0 TO COND-WORD.
061600     MOVE ZONE-BUF TO Z-ARG-4.
           MOVE ZONE-ARGUMENT TO ZONEPRTY OF WZPMFREC.
           START WO-ZONE-PRTY-MSTR-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WZPMF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE INDIC IS INDICS
               MOVE FUNCTION-NUM TO VIEW-LASTKEY
               MOVE ALL B"0" TO INDICS.
       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.

       COPY OVRPFCALL OF COPYLIB.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.

105200 7-SORT-INPUT-RECORDS.
105300     PERFORM 7-SORT-MAIN THRU 7-SORT-M-EXIT.
105500
105600 7-SORT-MAIN.
105700     MOVE 1 TO FILE-SW.
           MOVE 0 TO COND-WORD.
           MOVE WOSTAT-BUF TO WOSTATUS OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
106000     IF COND-WORD = 17 GO TO 7-SORT-M-CONT.
           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT
               UNTIL COND-WORD = 15.
106900
107000 7-SORT-M-CONT.
107100     MOVE 2 TO FILE-SW.
           MOVE 0 TO COND-WORD.
           MOVE WOSTAT-BUF TO WOSTATUS OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
107400     IF COND-WORD = 17 GO TO 7-SORT-M-EXIT.
           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT
               UNTIL COND-WORD = 15.
108300
108400 7-SORT-M-EXIT.    EXIT.
108500
108600 70-SORT-DBGET.
108700     IF BASIC-FILE
108800         PERFORM 70-DBGET-BASIC-FILE THRU 70-SORT-DBF-EXIT
108900     ELSE
109000     PERFORM 70-DBGET-PLANNED-FILE THRU 70-SORT-DPF-EXIT.
109100     IF COND-WORD = 15 GO TO 70-SORT-DBGET-EXIT.
109300     MOVE ZONE-PRIORITY TO SORT-ZONE.
           IF PLANT-IDENT = "126 "
               MOVE ZONE-BUF TO ZONE-BUF1
           ELSE
109400     IF Z-BUF-1 = "A" AND Z-BUF-2 = " "
109500         MOVE "A1  " TO ZONE-BUF1
109600         MOVE "A2  " TO ZONE-BUF2
109700         MOVE "A3  " TO ZONE-BUF3
109800     ELSE
109900     IF Z-BUF-1 = "A" AND Z-BUF-2 = "A"
110000         MOVE "A1  " TO ZONE-BUF1
110100         MOVE "A2  " TO ZONE-BUF2
110200     ELSE
110300     IF Z-BUF-1 = "B" AND Z-BUF-2 = " "
110400         MOVE "B1  " TO ZONE-BUF1
110500         MOVE "B2  " TO ZONE-BUF2
110600         MOVE "B3  " TO ZONE-BUF3
110700     ELSE
110800     IF Z-BUF-1 = "B" AND Z-BUF-2 = "B"
110900         MOVE "B1  " TO ZONE-BUF1
111000         MOVE "B2  " TO ZONE-BUF2
111100     ELSE
111200     IF Z-BUF-1 = "B" AND Z-BUF-2 = "D"
111300         MOVE "B2  " TO ZONE-BUF1
111400         MOVE "B3  " TO ZONE-BUF2
111500     ELSE
111600     IF Z-BUF-1 = "B" AND Z-BUF-2 = "C"
111700         MOVE "B3  " TO ZONE-BUF1
111800         MOVE "C1  " TO ZONE-BUF2
111900         MOVE "C2  " TO ZONE-BUF3
112000     ELSE
112100     IF Z-BUF-1 = "C" AND Z-BUF-2 = " "
112200         MOVE "C1  " TO ZONE-BUF1
112300         MOVE "C2  " TO ZONE-BUF2
112400     ELSE
112500     IF ZONE-BUF = "Z1  "
112600         MOVE "Z1  " TO ZONE-BUF1
112700         MOVE "Z1A " TO ZONE-BUF2
112800     ELSE
112900     MOVE ZONE-BUF TO ZONE-BUF1.
113000     IF ZONE-BUF1 = SPACES MOVE SORT-Z TO ZONE-BUF1.
113100
113200     IF TIME-RECD = SPACES
113300         MOVE ZEROS TO TIME-RECD.
113400     IF TIME-RECD-HH > 23
113500         MOVE 00 TO TIME-RECD-HH.
           IF TIME-STRT = "    "
               MOVE "0000" TO TIME-STRT
           ELSE
113600     IF TIME-STRT-HH > 23
113700         MOVE 00 TO TIME-STRT-HH.
           IF TIME-COMP = "    "
               MOVE "0000" TO TIME-COMP
           ELSE
113800     IF TIME-COMP-HH > 23
113900         MOVE 00 TO TIME-COMP-HH.
114000         MOVE DATE-COMP TO DATE-HOLD
114100         MOVE TIME-COMP TO TIME-HOLD
114200     MOVE DATE-BUF-MM TO DATE-WA-MM.
114300     MOVE DATE-BUF-DD TO DATE-WA-DD.
114400     MOVE DATE-BUF-YY TO DATE-WA-YY.
114500     IF DATE-WA NOT NUMERIC AND SHIFT-BUF NOT NUMERIC
114600         GO TO 70-SORT-DBGET-CONT.
114700     IF SHIFT-BUF NOT NUMERIC
114800         MOVE 0 TO SHIFT-BUF.
114900     IF SHIFT-BUF = 1 OR 0
115000         IF TIME-HOLD > "0699" AND < "1900"
115100             IF DATE-HOLD = DATE-WA
115200                 GO TO 70-SORT-DBGET-CONT
115300             ELSE
115400             GO TO 70-SORT-DBGET
115500         ELSE
115600         IF SHIFT-BUF = 0
115700             GO TO 700-SECOND-SHIFT
115800         ELSE
115900         GO TO 70-SORT-DBGET.
116000 700-SECOND-SHIFT.
116100     IF SHIFT-BUF = 2 OR 0
116200         IF TIME-HOLD > "1899" AND < "2400"
116300             IF DATE-HOLD = DATE-WA
116400                 GO TO 70-SORT-DBGET-CONT
116500             ELSE
116600             GO TO 70-SORT-DBGET
116700         ELSE
116200         IF TIME-HOLD > "0000" AND < "0700"
116300             IF DATE-HOLD = DATE-WA
116400                 GO TO 70-SORT-DBGET-CONT
116500             ELSE
116600             GO TO 70-SORT-DBGET
116700         ELSE
116800         IF SHIFT-BUF = 0
116900             GO TO 700-THIRD-SHIFT
117000         ELSE
117100         GO TO 70-SORT-DBGET.
117200 700-THIRD-SHIFT.
117300     IF SHIFT-BUF = 3 OR 0
117400         PERFORM 70-SORT-GET-NEXT-GDATE THRU 70-SORT-GNG-EXIT
117500         IF TIME-HOLD > "2299" AND < "2400"
117600             IF DATE-HOLD = DATE-WA-SAV1
117700                 GO TO 70-SORT-DBGET-CONT
117800             ELSE
117900             GO TO 70-SORT-DBGET
118000         ELSE
118100         IF TIME-HOLD > "0000" AND < "0700"
118200             IF DATE-HOLD = DATE-WA-SAV2
118300                 GO TO 70-SORT-DBGET-CONT
118400             ELSE
118500             GO TO 70-SORT-DBGET
118600         ELSE
118700         IF TIME-HOLD = "0000"
118800             IF DATE-HOLD = DATE-WA-SAV2
118900                 GO TO 70-SORT-DBGET-CONT
119000             ELSE
119100             GO TO 70-SORT-DBGET
119200         ELSE
119300         GO TO 70-SORT-DBGET.
119400
119500 70-SORT-DBGET-CONT.
119600     MOVE WO-STATUS TO SORT-WOSTAT.
119700     MOVE WO-NUM TO SORT-WONUM.
119800     MOVE DESCRIPTION-1 TO SORT-WODESC.
119900     MOVE EQUIP-NUM TO SORT-EQNUM.
120000     MOVE EQUIP-DOWN TO SORT-EQDOWN.
120100     MOVE CRAFTS-REQD-1 TO SORT-C1.
120200     MOVE CRAFTS-REQD-2 TO SORT-C2.
120300     MOVE CRAFTS-REQD-3 TO SORT-C3.
120400     MOVE TIME-COMP TO TIME-COMP-SORT.
120500     PERFORM 70-SORT-CALC-COMP-TIMES THRU 70-SORT-CCT-EXIT.
120600     MOVE DATE-COMP-YY TO SORT-DATE-RCVD-YY.
120700     MOVE DATE-COMP-MM TO SORT-DATE-RCVD-MM.
120800     MOVE DATE-COMP-DD TO SORT-DATE-RCVD-DD.
120900
121000     IF PRIORITY-BUF = "A" OR SORT-P
121100         IF SORT-Z = ZONE-BUF OR ZONE-BUF1 OR ZONE-BUF2 OR
121200                     ZONE-BUF3 OR SPACES
121300             PERFORM 70-SORT-RELEASE-REC THRU 70-SORT-RR-EXIT
                   MOVE 0 TO COND-WORD
121400             IF SORT-P = 1
121500                 ADD 1 TO PRTY1-K
121600             ELSE
121700             IF SORT-P = 2
121800                 ADD 1 TO PRTY2-K
121900             ELSE
122000             IF SORT-P = 3
122100                 ADD 1 TO PRTY3-K
122200             ELSE
122300             IF SORT-P = 4
122400                 ADD 1 TO PRTY4-K
122500             ELSE
122600             IF SORT-P = 5
122700                 ADD 1 TO PRTY5-K.
122800
122900 70-SORT-DBGET-EXIT.    EXIT.
123000
123100 70-DBGET-BASIC-FILE.
123200     MOVE SPACES TO SORT-REC.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WOSTAT-BUF NOT = WO-STATUS MOVE 15 TO COND-WORD.
           IF ZONE NOT = ZONE-BUF GO TO 70-DBGET-BASIC-FILE.
123300     IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
123500     IF DATE-COMP = "      " GO TO 70-DBGET-BASIC-FILE.
124300
124400 70-SORT-DBF-EXIT.    EXIT.
124500
124600 70-DBGET-PLANNED-FILE.
124700     MOVE SPACES TO SORT-REC.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WOSTAT-BUF NOT = WO-STATUS-P MOVE 15 TO COND-WORD.
           IF ZONE-P NOT = ZONE-BUF GO TO 70-DBGET-PLANNED-FILE.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 70-SORT-DPF-EXIT.
125800     MOVE SPACES           TO WO-BASIC-DATA.
125900     MOVE WO-NUM-PLANNED   TO WO-NUM.
126000     MOVE WO-STATUS-P      TO WO-STATUS.
126100     MOVE DATE-RECD-P      TO DATE-RECD.
126200     MOVE TIME-RECD-P      TO TIME-RECD.
126300     MOVE APPROVAL-CODE-P  TO APPROVAL-CODE.
126400     MOVE REQUESTER-P      TO REQUESTER-B.
126500     MOVE EQUIP-NUM-P      TO EQUIP-NUM.
126600     MOVE EQUIP-NAME-P     TO EQUIP-NAME.
126700     MOVE TYPE-NUM-P       TO TYPE-NUM.
126800     MOVE DEPT-P           TO DEPT.
126900     MOVE ZONE-PRIORITY-P  TO ZONE-PRIORITY.
127000     MOVE LOCATION-P       TO LOCATION.
127100     MOVE EQUIP-DOWN-P     TO EQUIP-DOWN.
127200     MOVE EXP-CLASS-P      TO EXP-CLASS.
127300     MOVE DESCRIPTION-1-P  TO DESCRIPTION-1.
127400     MOVE DATE-STRT-P      TO DATE-STRT.
127500     MOVE TIME-STRT-P      TO TIME-STRT.
127600     MOVE DATE-COMP-P      TO DATE-COMP.
127700     MOVE TIME-COMP-P      TO TIME-COMP.
127800     MOVE "*"              TO VP-FLAG-SORT.
           IF DATE-COMP-P = "      " GO TO 70-DBGET-PLANNED-FILE.
127900
128000 70-SORT-DPF-EXIT.    EXIT.
128100
128200 70-SORT-GET-NEXT-GDATE.
           MOVE 0 TO JUL-DAY-SAVE.
           MOVE SPACES TO JULIAN-DATE.
           MOVE DATE-WA-YY TO GREG-YY.
           MOVE DATE-WA-MM TO GREG-MM.
           MOVE DATE-WA-DD TO GREG-DD.
           IF GREG-YY > "70"
               MOVE "19"   TO GREG-CC
           ELSE
           MOVE "20"       TO GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE SPACES TO GREG-DATE.
           SUBTRACT 1 FROM JULIAN-DATE-9.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE GREG-YY TO DATE-WA-YY-2.
           MOVE GREG-MM TO DATE-WA-MM-2.
           MOVE GREG-DD TO DATE-WA-DD-2.
           MOVE DATE-WA-2  TO DATE-WA-SAV1.
           MOVE DATE-WA    TO DATE-WA-SAV2.
129700
129800 70-SORT-GNG-EXIT.    EXIT.
129900
130000 70-SORT-CALC-COMP-TIMES.
           IF SPACES = DATE-COMP OR TIME-COMP
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-CCT-EXIT.
           MOVE 0 TO JUL-DAY-SAVE.
           MOVE SPACES TO JULIAN-DATE.
           MOVE DATE-COMP-YY TO GREG-YY.
           MOVE DATE-COMP-MM TO GREG-MM.
           MOVE DATE-COMP-DD TO GREG-DD.
           IF GREG-YY > "70"
               MOVE "19"     TO GREG-CC
           ELSE
           MOVE "20"         TO GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE JULIAN-DATE-9 TO JUL-DAY-COMP.
           IF SPACES = DATE-STRT OR TIME-STRT
               NEXT SENTENCE
           ELSE
           IF ZEROS = DATE-STRT
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO JULIAN-DATE
           MOVE DATE-STRT TO GREG-YMD
           PERFORM 70-SET-GREG-CC
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG
           MOVE JULIAN-DATE-9 TO JUL-DAY-STRT.
           MOVE SPACES TO JULIAN-DATE.
           MOVE DATE-RECD TO GREG-YMD.
           PERFORM 70-SET-GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE JULIAN-DATE-9 TO JUL-DAY-RECD.
133100     IF EQUIP-DOWN = "Y "
133200         PERFORM 70-SORT-RECD-COMP-CALC THRU 70-SORT-RCC-EXIT
133300     ELSE
133400     PERFORM 70-SORT-STRT-COMP-CALC THRU 70-SORT-SCC-EXIT.
133500
133600 70-SORT-CCT-EXIT.    EXIT.
133700
       70-SET-GREG-CC.
           IF GREG-YY > "70"
               MOVE "19" TO GREG-CC
           ELSE
           MOVE "20"     TO GREG-CC.

133800 70-SORT-RECD-COMP-CALC.
133900     MOVE 0 TO JUL-DAY-SAVE.
134000     IF SPACES = DATE-RECD OR TIME-RECD
134100         MOVE SPACES TO SORT-TIME-RCVD
134200         GO TO 70-SORT-RCC-EXIT.
134300     IF ZEROS = DATE-RECD
134400         MOVE SPACES TO SORT-TIME-RCVD
134500         GO TO 70-SORT-RCC-EXIT.
134600     IF JUL-DAY-RECD > JUL-DAY-COMP
134700         ADD JUL-DAYS-LYR TO JUL-DAY-SAVE.
134800     IF JUL-DAY-RECD NOT = JUL-DAY-COMP
134900         ADD JUL-DAY-COMP TO JUL-DAY-SAVE
135000         SUBTRACT JUL-DAY-RECD FROM JUL-DAY-SAVE
135100         MULTIPLY 1440 BY JUL-DAY-SAVE.
135200     MULTIPLY 60 BY TIME-RECD-HH GIVING TRECD-MIN.
135300     ADD TIME-RECD-MM TO TRECD-MIN.
135400     MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
135500     ADD TIME-COMP-MM TO TCOMP-MIN.
135600     SUBTRACT TRECD-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
135700     ADD JUL-DAY-SAVE TO TSAVE-MIN.
135800     MOVE TSAVE-MIN TO SORT-TIME-RCVD.
135900
136000 70-SORT-RCC-EXIT.    EXIT.
136100
136200 70-SORT-STRT-COMP-CALC.
136300     MOVE 0 TO JUL-DAY-SAVE.
136400     IF SPACES = DATE-STRT OR TIME-STRT
136500         MOVE SPACES TO SORT-TIME-RCVD
136600         GO TO 70-SORT-SCC-EXIT.
136700     IF ZEROS = DATE-STRT
136800         MOVE SPACES TO SORT-TIME-RCVD
136900         GO TO 70-SORT-SCC-EXIT.
137000     IF JUL-DAY-STRT > JUL-DAY-COMP
137100         ADD JUL-DAYS-LYR TO JUL-DAY-SAVE.
137200     IF JUL-DAY-STRT NOT = JUL-DAY-COMP
137300         ADD JUL-DAY-COMP TO JUL-DAY-SAVE
137400         SUBTRACT JUL-DAY-STRT FROM JUL-DAY-SAVE
137500         MULTIPLY 1440 BY JUL-DAY-SAVE.
137600     MULTIPLY 60 BY TIME-STRT-HH GIVING TSTRT-MIN.
137700     ADD TIME-STRT-MM TO TSTRT-MIN.
137800     MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
137900     ADD TIME-COMP-MM TO TCOMP-MIN.
138000     SUBTRACT TSTRT-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
138100     ADD JUL-DAY-SAVE TO TSAVE-MIN.
138200     MOVE TSAVE-MIN TO SORT-TIME-RCVD.
138300
138400 70-SORT-SCC-EXIT.    EXIT.
138500
138600 70-SORT-RELEASE-REC.
138700     MOVE 0 TO SUB.
138800     MOVE 1 TO RELEASE-FLAG.
138900     MOVE WO-NUM  TO ARG-DEFN.
           MOVE 0 TO COND-WORD.
           MOVE ARG-DEFN TO WONUM OF WLFREC.
           START WO-LABOR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
139200     IF COND-WORD = 17
139300         IF SUB < 1
                   ADD 1 TO SORTED-RECS
139400             RELEASE SORT-REC
139500             GO TO 70-SORT-RR-EXIT
139600         ELSE
139700         GO TO 70-SORT-RR-EXIT.
140400     MOVE SPACES TO LABOR-TAB.
140500     PERFORM 70-SORT-GET-REC THRU 70-SORT-GR-EXIT
140600                      UNTIL SUB > 9.
140700     MOVE 0 TO SUB.
           MOVE 0 TO COND-WORD.
140800     PERFORM 70-SORT-READ-TABLE THRU 70-SORT-RT-EXIT
140900                      UNTIL SUB > 9.
141000
141100 70-SORT-RR-EXIT.    EXIT.
141200
141300 70-SORT-GET-REC.
141400     ADD 1 TO SUB.
           MOVE 0 TO COND-WORD.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF ARG-DEFN NOT = LBR-WO-NUM MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
141700     IF COND-WORD = 15
141800         IF RELEASE-FLAG-UP
                   ADD 1 TO SORTED-RECS
141900             RELEASE SORT-REC
142000             MOVE 10 TO SUB
142100             GO TO 70-SORT-GR-EXIT
142200         ELSE
142300         MOVE 10 TO SUB
142400         GO TO 70-SORT-GR-EXIT.
143100
143200     IF DATE-WA = SPACES
143300         NEXT SENTENCE
143400     ELSE
143500     IF LBR-COMPL-DATE = DATE-WA-SAV1 OR DATE-WA-SAV2
143600                         OR DATE-WA
143700         NEXT SENTENCE
143800     ELSE
143900     SUBTRACT 1 FROM SUB
144000     GO TO 70-SORT-GR-EXIT.
144100
144200     MOVE 0 TO RELEASE-FLAG.
144300     MOVE LBR-EMPL-NUM     TO  L-CC-BUF.
144400     MOVE LBR-CRAFT        TO  L-CRFT-BUF.
144500     MOVE LBR-START-TIME   TO  L-TSTRT-BUF.
144600     MOVE LBR-COMPL-TIME   TO  L-TCOMP-BUF.
144700
144800     IF SHIFT-BUF = LBR-SHIFT-1
144900         MOVE LBR-HRS1 TO L-RETM-12
145000         MOVE "." TO L-RETM-DEC
145100         MOVE LBR-HRS2 TO L-RETM-4
145200     ELSE
145300     MOVE SPACES TO  L-RETM-BUF.
145400
145500     MOVE LABOR-BUFFER     TO  LABOR-TABLE (SUB).
145600
145700 70-SORT-GR-EXIT.    EXIT.
145800
145900 70-SORT-READ-TABLE.
146000     ADD 1 TO SUB.
146100     MOVE LABOR-TABLE (SUB) TO LABOR-BUFFER.
146200     IF L-CC-BUF = SPACES
146300         MOVE 10 TO SUB
146400         GO TO 70-SORT-RT-EXIT.
146500     MOVE L-CC-BUF TO CMAN-1-SORT.
146600     MOVE L-CRFT-BUF TO SORT-C1.
146700     MOVE L-TSTRT-BUF TO TSTRT-SORT.
146800     MOVE L-TCOMP-BUF TO TIME-COMP-SORT.
146900     MOVE L-RETM-BUF TO RETM-SORT.
147000
           ADD 1 TO SORTED-RECS.
147100     RELEASE SORT-REC.
147200
147300 70-SORT-RT-EXIT.    EXIT.
147400
147800 8-WRITE-FILE.
           MOVE 0 TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           PERFORM 8-WF-CONT THRU 8-WF-EXIT.
       8-WF-CONT.
147900     RETURN SORT-FILE AT END GO TO 8-WF-EXIT.
148100     ADD 1 TO ACT-KEY.
148200     MOVE SORT-REC TO OUT-DATA.
148300     WRITE OUT-REC    INVALID KEY GO TO 8-WF-EXIT.
148600     GO TO 8-WF-CONT.
148700
148800 8-WF-EXIT.    EXIT.
