000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400      TDVENDITM.
000500 AUTHOR.
000600      KURT MOVSESIAN.
000800
000900******************************************************
001000*                                                    *
001100*   T D V E N D I T M                                *
001200*                                                    *
001300*   THIS PROGRAM WILL CHECK TO MAKE SURE ALL NUMERIC *
001400*   DEFINED FIELDS ARE NUMERIC. IF A FIELD IS FOUND  *
001500*   NOT TO BE NUMERIC THEN ZEROS IS MOVED IN.        *
001600******************************************************
001700
002300
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DVENDITM-O
                  ASSIGN TO DATABASE-MCFLCS0801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
002800
003000
003100 DATA DIVISION.
003200 FILE SECTION.
       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS0801.
003300
003400
003500 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
003600
       01  ERROR-RECORD-CTR             PIC 9(8) COMP-4 VALUE ZEROS.
       01  ERR-SW                       PIC X  VALUE SPACES.

003700**************************************************************
003800**************************************************************
003900**                                                          **
004000**                DATABASE I/O BUFFER AREA                  **
004100**                                                          **
004200**************************************************************
004300**************************************************************
004400
004500 COPY DVENDITM IN COPYLIB.
007100
       COPY DBSTAT IN COPYLIB.

       01  BASE   PIC X(10) VALUE SPACES.
007400
007500 COPY TBLOWUP IN COPYLIB.
007600
007700 COPY VIEWDUM IN COPYLIB.
007800
008400
008500 PROCEDURE DIVISION.
008600
008700
008800
       BEGIN-HERE.
           OPEN I-O DVENDITM-O

008900     PERFORM 6-MAIN  THRU  6-M-X.

009000     CLOSE DVENDITM-O.
009100     GOBACK.
009200
009300
009400*******************************************************
009500**                                                   **
009600**   BLOWUP  ROUTINE                                 **
009700**                                                   **
009800*******************************************************
009900
010000 2-BLOWUP.
010100     MOVE "TDVENDITM"      TO  BU-PGM-NAME.
010200     MOVE VENCDE OF DVENDITM-REC-O TO BU-DISPLAY-FLD (1).
010300     MOVE CORPCDE OF DVENDITM-REC-O TO BU-DISPLAY-FLD (2).
010400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
010500         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
010600             BU-DISPLAY-FLDS.
010700
010800 6-MAIN.
010900     READ DVENDITM-O FIRST RECORD INTO BUF-DVENDITM
               AT END GO TO 6-M-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST DVENDITM *6-MAIN" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

011000     PERFORM 61-READ-FILE THRU 61-RF-X.

           DISPLAY "TOTAL NO. OF RCDS WITH NON-NUMERIC DATA = ".
           DISPLAY ERROR-RECORD-CTR.

011100
011200 6-M-X.
011300     EXIT.
011400
011500 61-READ-FILE.
           MOVE SPACES TO ERR-SW.
           IF VEN-ITM-YTD-BUS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO VEN-ITM-YTD-BUS.
           IF VEN-NONCODED-ITEM NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO VEN-NONCODED-ITEM.
           IF VEN-DISCOUNT-PERCENT NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO VEN-DISCOUNT-PERCENT.

           IF ERR-SW = "Y"
               ADD 1 TO ERROR-RECORD-CTR
      *        DISPLAY "BUF-DVENDITM ", BUF-DVENDITM.
               REWRITE DVENDITM-REC-O FROM BUF-DVENDITM
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DVENDITM 61-RF" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DVENDITM-O NEXT RECORD INTO BUF-DVENDITM
               AT END GO TO 61-RF-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ NEXT DVENDITM *61-RF" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           GO TO 61-READ-FILE.

       61-RF-X.
           EXIT.
