000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TEACHKEM.
000400 AUTHOR.        C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.  10/28/87.
000600 DATE-COMPILED.
000700*INSTALLATION.  GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   ELECTRONIC APPROVAL CHECK EMPLOYEE AND FIX.  FINDS EMPLOYEES
001100*D   THAT ARE ASSIGNED TO THE WRONG LEVEL (2 ACTIVE EMPLS AT THE
001200*D   SAME LEVEL) AND GETS THE REQS MOVED BACK TO THE CORRECT
001300*D   EMPLOYEE.                                                   V
002400 ENVIRONMENT DIVISION.
002500 CONFIGURATION SECTION.
002600 SOURCE-COMPUTER.  HP-3000.
002700 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL-EM-I
               ASSIGN TO DATABASE-MCFLCS4201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MLEVEL-LN-I
               ASSIGN TO DATABASE-MCFLCS4101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

002800
002900 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENTS FOR IBM ONLY ------*
       FD  MEMPL-EM-I
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-EM-REC-I.
           COPY DDS-MCRPCS4200  OF MCFLCS4201.

       FD  MLEVEL-LN-I
           LABEL RECORDS ARE STANDARD.
       01  MLEVEL-LN-REC-I.
           COPY DDS-MCRPCS4100  OF MCFLCS4101.
      *------ FD STATEMENTS FOR IBM ONLY ------*
003000 WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG       PIC X(1)  VALUE "Y".
       COPY TBLOWUP IN COPYLIB.
       COPY CEAUPEMP IN COPYLIB.

       COPY DBSTAT  IN COPYLIB.
       01  UPDATE-FLAG   PIC X(1).
       01  BASE          PIC X(24)  VALUE "  STORES;".
       01  LEVEL-ARG     PIC X(2).
       01  EMPL-ARG      PIC X(4).
       COPY MEMPL IN COPYLIB.
       COPY MLEVEL IN COPYLIB.
       COPY FILESTAT IN COPYLIB.

007900 PROCEDURE DIVISION.
       0000-START.
           DISPLAY "UPDATE DATABASE? (CAPITAL U OR N)".
           ACCEPT UPDATE-FLAG.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GOBACK.

041400 2100-BLOWUP.
041600     MOVE "TEACHKEM"               TO  BU-PGM-NAME.
041900     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
042000       DUMMY-VIEW-AREA FILE-STATUS BU-DISPLAY-MSG
042100       BU-DISPLAY-FLDS.
042200
008500 6000-MAIN.
           PERFORM 9999-OPEN-STUFF.
           PERFORM 9999-GETSER-MEMPL-EM-I.
           PERFORM UNTIL NOT GOOD-CALL
               MOVE MEMPL-LEVEL TO LEVEL-ARG
               PERFORM 9999-GETKEY-MLEVEL-LN-I
               IF MEMPL-EMPL NOT = MLEVEL-ACTIVE-EMPL
               AND MEMPL-ACTIVE-FLAG = "Y" AND (MEMPL-LEVEL NOT = "00")
                   DISPLAY "EMPL ", MEMPL-EMPL, " ACTIVE AT LEVEL ",
                     MEMPL-LEVEL, " BUT NOT IN MLEVEL"
                   IF UPDATE-FLAG = "Y"
                      MOVE MEMPL-EMPL TO CEAU-EMPL
                      MOVE "Y"        TO CEAU-OLD-ACTIVE
                      MOVE "N"        TO CEAU-CURRENT-ACTIVE
                      MOVE MEMPL-LEVEL TO CEAU-OLD-LEVEL
                      MOVE MEMPL-LEVEL TO CEAU-CURRENT-LEVEL
                      MOVE "Y"         TO CEAU-UPDATE-MEMPL-FLAG
                      CALL "CEAUPEMP" USING BASE, STATUS-AREA,
                        CEAUPEMP-PARMS, BU-DISPLAY-MSG
                      IF BU-DISPLAY-MSG-1 NOT = SPACES
                         PERFORM 2100-BLOWUP
                      END-IF
                      MOVE MLEVEL-ACTIVE-EMPL TO CEAU-EMPL
                      MOVE "N"         TO CEAU-OLD-ACTIVE
                      MOVE "Y"         TO CEAU-CURRENT-ACTIVE
                      MOVE MEMPL-LEVEL TO CEAU-OLD-LEVEL
                      MOVE MEMPL-LEVEL TO CEAU-CURRENT-LEVEL
                      MOVE "Y"         TO CEAU-UPDATE-MEMPL-FLAG
                      CALL "CEAUPEMP" USING BASE, STATUS-AREA,
                        CEAUPEMP-PARMS, BU-DISPLAY-MSG
                      IF BU-DISPLAY-MSG-1 NOT = SPACES
                          PERFORM 2100-BLOWUP
                      END-IF
                      CALL "CEAQCHG" USING BASE, STATUS-AREA,
                        BU-DISPLAY-MSG, MEMPL-EMPL, MLEVEL-ACTIVE-EMPL,
                        MEMPL-LEVEL
                      IF BU-DISPLAY-MSG-1 NOT = SPACES
                          PERFORM 2100-BLOWUP
                      END-IF
                   END-IF
               END-IF
               PERFORM 9999-GETSER-MEMPL-EM-I
           END-PERFORM.
           PERFORM 9999-CLOSE-STUFF.
       6990-MAIN-X.
           GOBACK.

       9999-OPEN-STUFF.
           OPEN INPUT MEMPL-EM-I.
           OPEN INPUT MLEVEL-LN-I.

       9999-CLOSE-STUFF.
           CLOSE MEMPL-EM-I.
           CLOSE MLEVEL-LN-I.

       9999-GETSER-MEMPL-EM-I.
           MOVE 0 TO COND-WORD.
           READ MEMPL-EM-I NEXT INTO BUF-MEMPL
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MEMPL-EM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MEMPL-EM-I.
           MOVE SPACES TO EMPLOYID OF MEMPL-EM-REC-I.
           START MEMPL-EM-I KEY >= EMPLOYID OF MEMPL-EM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETKEY-MLEVEL-LN-I.
           MOVE 0 TO COND-WORD.
           MOVE LEVEL-ARG TO LEVELNUM OF MLEVEL-LN-REC-I.
           READ MLEVEL-LN-I INTO BUF-MLEVEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MLEVEL-LN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

