000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TEAQCHG.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   04/06/88.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS PROGRAMS CHANGES ALL REQS QUEUED TO 1 APPROVER TO ANOTHER
001100*D   APPROVER.
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
001700
001800 DATA DIVISION.
001900 WORKING-STORAGE SECTION.
002000 01  OLD-APPROVER-ID               PIC X(4).
002100 01  NEW-APPROVER-ID               PIC X(4).
002200 01  NEW-APPROVER-LEVEL            PIC X(2)  VALUE "AL".
002300
002400******************************************************************
002500**                                                              **
002600**          S U B P R O G R A M   A R E A S                     **
002700**                                                              **
002800******************************************************************
002900
003000 COPY TBLOWUP    IN COPYLIB.
003100
003200*************************************************************
003300**                                                         **
003400**           D A T A B A S E   W O R K                     **
003500**                                                         **
003600*************************************************************
003700
003800 01  BASE                          PIC X(10) VALUE "  STORES;".
003900 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
004000
004100 COPY DBSTAT     IN COPYLIB.
004400
005500 PROCEDURE DIVISION.
005600
005700 0000-START.
005800     PERFORM 9999-OPEN-STUFF.
006200
006300     PERFORM 6000-MAIN THRU 6990-MAIN-X.
006400     GOBACK.
006500
006600 2100-BLOWUP.
006700     MOVE "TEAQCHG"                TO   BU-PGM-NAME.
006800     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
006900       DUMMY-VIEW-AREA, DUMMY-KSAM-STAT BU-DISPLAY-MSG
007000       BU-DISPLAY-FLDS.
007100
007200 6000-MAIN.
007300     DISPLAY "THIS PROGRAM CHANGES ALL REQS QUEUED TO A CERTAIN".
007400     DISPLAY "APPROVER TO ANOTHER APPROVER".
007500
007600 6100-LOOP.
007700     DISPLAY "INPUT EMPLOYEE ID OF THE OLD APPROVER".
007800     DISPLAY "(HIT 'RETURN') TO QUIT".
007900     MOVE SPACES                   TO   OLD-APPROVER-ID.
008000     ACCEPT OLD-APPROVER-ID.
008100     IF OLD-APPROVER-ID = SPACES
008200         GO TO 6990-MAIN-X.
008300     DISPLAY "INPUT EMPLOYEE ID OF THE NEW APPROVER".
008400     ACCEPT NEW-APPROVER-ID.

      *------ EXAMPLE OF WHAT'S HAPPENING BELOW: SAY YOU HAVE THIS:
      *------   APPROVER 0310  LEVEL 99  ACCOUNTING
      *------   APPROVER 0063  LEVEL 90  PLANT MANAGER
      *------ AND SAY 0310 IS SUBBING FOR 0063 WHO IS ON VACATION.
      *------ NOW SAY YOU WANNA MOVE ALL THE LEVEL 90 REQS FOR
      *------ 0310 BACK TO THE ORIGINAL APPROVER 0063.  YOU WOULD
      *------ USE LEVEL '90' INSTEAD OF 'AL' FOR THE NEW APPROVER.
      *------ IF YOU USED 'AL', IT WOULD MOVE ALL UNAPPROVED REQS
      *------ QUEUED TO 0310 OVER TO 0063, EVEN IF IT WAS AT LEVEL
      *------ 99 AS WELL AS THE LEVEL 90 REQS.
           DISPLAY "INPUT THE LEVEL OF THE NEW APPROVER, OR 'AL'".
           DISPLAY "IF YOU INPUT 'AL', ALL REQS FROM OLD EMPL WILL".
           DISPLAY "BE MOVED TO THE NEW EMPL, OTHERWISE ONLY THE REQS".
           DISPLAY "AT THE NEW APPROVER'S LEVEL WILL BE MOVED".
           ACCEPT NEW-APPROVER-LEVEL.
008500
008600     CALL "CEAQCHG" USING BASE, STATUS-AREA, BU-DISPLAY-MSG,
008700       OLD-APPROVER-ID, NEW-APPROVER-ID, NEW-APPROVER-LEVEL.
008800     IF BU-DISPLAY-MSG-1 NOT = SPACES
008900         PERFORM 2100-BLOWUP.
009000
009100     GO TO 6100-LOOP.
009200
009300 6990-MAIN-X.
009400     EXIT.

       9999-OPEN-STUFF.

       9999-CLOSE-STUFF.
