000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TEARETRN.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   04/06/88.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS PROGRAM RETURNS A REQ, BUT DOESNT PUT IT INTO HOLD
001100*D   STATUS.
001200
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ-RQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE-RQ-O
               ASSIGN TO DATABASE-MCFLCS4401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

001700
001800 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MREQ-RQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQQUE-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-RQ-REC-O.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
001900 WORKING-STORAGE SECTION.
002000*************************************************************
002100**                                                         **
002200**           D A T A B A S E   W O R K                     **
002300**                                                         **
002400*************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
002500
002600 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
002700 01  PASSWORD-MMISA                PIC X(7)  VALUE "DO-ALL;".
002800 01  DSET-NAMES.
002900     05  DSET-NAME                 PIC X(16) VALUE SPACES.
003000     05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".
003100     05  DSET-MREQ                 PIC X(16) VALUE "MREQ;".
003200     05  DSET-DREQITM              PIC X(16) VALUE "DREQITM;".
003300     05  DSET-DREQD                PIC X(16) VALUE "DREQD;".
003400     05  DSET-DREQQUE              PIC X(16) VALUE "DREQQUE;".
003500
003600 01  PLT-ARG                       PIC X(4).
003700 01  REQ-ARG                       PIC X(12).
003800 01  REQ-SEARCH                    PIC X(11) VALUE "REQ-NUMBER;".
003900
004000 01  MODE-AREA.
004100     05  DB-MODE                   PIC S9(4)   COMP       VALUE 0.
004200     05  MODE1                     PIC S9(4)   COMP       VALUE 1.
004300     05  MODE3                     PIC S9(4)   COMP       VALUE 3.
004400     05  MODE4                     PIC S9(4)   COMP       VALUE 4.
004500     05  MODE5                     PIC S9(4)   COMP       VALUE 5.
004600     05  MODE7                     PIC S9(4)   COMP       VALUE 7.
004700
004800 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
004900
005000 01  BASE                          PIC X(10) VALUE "  STORES;".
005100 01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
005200 01  BASE-BUDGET                   PIC X(24) VALUE SPACES.
005300 COPY DBSTAT     IN COPYLIB.
005400
005500 COPY MREQ       IN COPYLIB.
       COPY DREQQUE    IN COPYLIB.
005600 COPY MPLT0      IN COPYLIB.
005700 COPY MPLTRQGB   IN COPYLIB.
005800 COPY TBLOWUP    IN COPYLIB.
005900 COPY REQGLOBS   IN COPYLIB.
006000 COPY LANGUAGE   IN COPYLIB.
006100 COPY CEAQUE     IN COPYLIB.
006200 COPY CEARQPH    IN COPYLIB.
006300
006400 01  MULTI-LOCK.
006500     05  NUMBER-OF-DSETS-LOCKED PIC S9(4) BINARY VALUE 2.
006600     05  LOCK1.
006700         10  LENGTH-1           PIC S9(4) BINARY VALUE 24.
006800         10  DSET-NAME-1        PIC X(16)  VALUE "MREQ;".
006900         10  ITEM-LIST-1        PIC X(16)  VALUE "@;".
007000         10  REL-OP-1           PIC XX     VALUE "= ".
007100         10  LOCK-VALUE-1       PIC X(12)  VALUE SPACES.
007200     05  LOCK2.
007300         10  LENGTH-2           PIC S9(4) BINARY VALUE 24.
007400         10  DSET-NAME-2        PIC X(16)  VALUE "DREQQUE;".
007500         10  ITEM-LIST-2        PIC X(16)  VALUE "@;".
007600         10  REL-OP-2           PIC XX     VALUE "= ".
007700         10  LOCK-VALUE-2       PIC X(12)  VALUE SPACES.
007800 PROCEDURE DIVISION.
007900
008000 0000-START.
           PERFORM 9999-OPEN-STUFF.

011100     MOVE "RQGB"                   TO  PLT-ARG.
           PERFORM 9999-DBGET7-MPLTINFO-PK-I.
011400     IF GOOD-CALL
011500         MOVE MPLTINFO-RQGB        TO   REQ-GLOBALS
011600     ELSE
011700     IF NO-ENTRY
011800         MOVE "Y"                  TO   MPLT-PRINT-WO-REQPK
011900         MOVE "N"                  TO   MPLT-WOAP-TO-CUT-REQ
012000         MOVE "N"                  TO   MPLT-WOAP-TO-APP-REQ.
012400
012500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
012600     GOBACK.
012700
012800 2100-BLOWUP.
012900     DISPLAY "FATAL ERROR".
013000     DISPLAY BU-DISPLAY-MSG.
013100     DISPLAY "COND-WORD = ", COND-WORD.
           DISPLAY "FILE-STATUS = ", FILE-STATUS.
013300     GOBACK.
013400
013500 6000-MAIN.
013600 6500-SERIAL-LOOP.
013700     MOVE SPACES                   TO   REQ-ARG.
013800     DISPLAY "INPUT REQ NUMBER TO RETURN".
013900     ACCEPT REQ-ARG.
014000     IF REQ-ARG = SPACES
014100         GO TO 6990-MAIN-X.
014200
014300     MOVE REQ-ARG                  TO   LOCK-VALUE-1,
014400                                        LOCK-VALUE-2.
014500     PERFORM 9931-MULTI-LOCK.
014600
           PERFORM 9999-DBGET7-MREQ-RQ-I.
014900     IF NO-ENTRY
015000         DISPLAY "REQ DOES NOT EXIST"
015100         PERFORM 9940-UNLOCK
015200         GO TO 6500-SERIAL-LOOP.
015700
           IF REQ-RELEASE-STAT = "XX"
               DISPLAY "CAN'T RE-QUEUE, IT'S ON A P.O."
               PERFORM 9940-UNLOCK
               GO TO 6500-SERIAL-LOOP.

           MOVE ZERO TO COND-WORD.
           PERFORM 9999-DBFIND-DREQQUE-RQ-O.
           PERFORM UNTIL COND-WORD NOT = 0
               PERFORM 9999-DBGET5-DREQQUE-RQ-O
               IF GOOD-CALL
                   PERFORM 9999-DBDELETE-DREQQUE-RQ-O
               END-IF
           END-PERFORM.
016200
016300     MOVE "R"                      TO   RQPH-PATH-TYPE.
016400     MOVE REQ-SUB                  TO   RQPH-CLASS.
016500     MOVE REQ-SUBD                 TO   RQPH-DEPARTMENT.
016600     MOVE REQ-REQ-DEPT             TO   RQPH-REQ-DEPT.
016700     MOVE REQ-ADDTL-DATA           TO   RQPH-EXPENSE-CLASS.
016800     MOVE REQ-BUDGET-AMT           TO   RQPH-VALUE.
016900     MOVE SPACES                   TO   RQPH-WO-APPROVED.
017000
017100     CALL "CEARQPH" USING          BASE,
017200                                   STATUS-AREA,
017300                                   RQPH-AREA,
017400                                   BU-DISPLAY-MSG.
017500     IF BU-DISPLAY-MSG-1 NOT = SPACES
017600         PERFORM 2100-BLOWUP.
017700
017800     MOVE MREQ-NUMBER              TO   EAQ-REQ-NUMBER.
017900     MOVE RQPH-RET-PATH            TO   EAQ-PATH-ARG.
018000     MOVE RQPH-RET-PATH2           TO   EAQ-PATH-ARG2.
018100     MOVE REQ-ORIGINATOR           TO   EAQ-ORIG-EMPL.
018200     MOVE "RE-QUEUED BY TEARETRN"  TO   EAQ-REASON-1.
018300     MOVE "MANUAL RE-QUEUE PROGRAM" TO   EAQ-REASON-2.
018400     MOVE "R"                      TO   EAQ-QUEUE-TYPE.
018500     CALL "CEAQUE" USING BASE, STATUS-AREA, EAQ-AREA,
018600       REQ-GLOBALS, BUF-MREQ, BU-DISPLAY-MSG.
018700     IF BU-DISPLAY-MSG-1 NOT = SPACES
018800         PERFORM 2100-BLOWUP.
018900
019000     PERFORM 9940-UNLOCK.
019100
019200     GO TO 6500-SERIAL-LOOP.
019300
019400
019500 6990-MAIN-X.
019600     EXIT.
019700
       9930-LOCK.
       9931-MULTI-LOCK.
       9940-UNLOCK.
       9999-DBGET7-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MPLTINFO-PK-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET7-MREQ-RQ-I.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-RQ-REC-I.
           READ MREQ-RQ-I INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MREQ-RQ-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBFIND-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQQUE-RQ-REC-O.
           START DREQQUE-RQ-O KEY = REQNO OF DREQQUE-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DREQQUE-RQ-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQQUE-RQ-O NEXT INTO BUF-DREQQUE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQQUE-RQ-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DREQQUE-RQ-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF REQNO OF DREQQUE-RQ-REC-O NOT = REQ-ARG
               PERFORM 9999-RESET-DREQQUE-RQ-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQQUE-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF DREQQUE-RQ-REC-O.
           START DREQQUE-RQ-O KEY > REQNO OF DREQQUE-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DREQQUE-RQ-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQQUE-RQ-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DREQQUE-RQ-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN INPUT MPLTINFO-PK-I         MREQ-RQ-I            .
           OPEN I-O   DREQQUE-RQ-O                               .

       9999-CLOSE-STUFF.
           CLOSE      MPLTINFO-PK-I         MREQ-RQ-I
                      DREQQUE-RQ-O                               .
