000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TEASETUP.
000400 AUTHOR.              C HILLES/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.        07/01/87.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS IS THE EXECUTIVE PROGRAM FOR THE ELECTRONIC REQUISITION
001100*D   APPROVAL SYSTEM SETUP MENU.  THIS BRINGS UP THE MAIN MENU
001200*D   FOR THE SETUP TRANSACTIONS FOR REQ APPROVAL SYSTEM.
001300
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.  HP-3000.
001700 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEASETUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

001800
001900 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(500).

002000 WORKING-STORAGE SECTION.
002100
002200**************************************************************
002300**                                                          **
002400**           S U B P R O G R A M   A R E A S                **
002500**                                                          **
002600**************************************************************
002700
002800*------ PARM FOR CALL TO 'SRSCRNS'
002900 01  PASS-RPT-NUMBER               PIC S9(4) COMP-4 VALUE 54.
003000 COPY CSWITCHF   IN COPYLIB.
003100 COPY TBLOWUP    IN COPYLIB.
003200 COPY TSHWRDFM   IN COPYLIB.
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                   PIC XXXX.
       01  WS-CONTROL.
           05  FUNCTION-NUM              PIC XX.
               88  EXIT-KEY-F8-USED                 VALUE "08".
               88  REFRESH-KEY-F4-USED              VALUE "04".
               88  ENTER-KEY-USED                   VALUE "00".
               88  F1-KEY-USED                      VALUE "01".
               88  F2-KEY-USED                      VALUE "02".
               88  F3-KEY-USED                      VALUE "03".
               88  F4-KEY-USED                      VALUE "04".
               88  F5-KEY-USED                      VALUE "05".
               88  F6-KEY-USED                      VALUE "06".
               88  F7-KEY-USED                      VALUE "07".
               88  F8-KEY-USED                      VALUE "08".
           05  FUN-KEY REDEFINES FUNCTION-NUM  PIC XX.
           05  TERMINAL-ID               PIC X(10).
           05  FORMAT-NAME               PIC X(10).

       01  DISPLAY-STATUS                PIC X(2).

       COPY IOFEEDBACK IN COPYLIB.
003300 COPY ESCNAM2   IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
003400
003500**************************************************************
003600**                                                          **
003700**                  V I E W   W O R K                       **
003800**                                                          **
003900**************************************************************
004000
       COPY VCOMAREA IN COPYLIB.
008700 01  FORMFILE.
008800     05  FORM-FNAME                PIC X(8)  VALUE "FEASETUP".
008900     05  FILLER                    PIC X     VALUE ".".
009000     05  FORM-GNAME.
009100         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009200         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009300     05  FILLER                    PIC X(19) VALUE SPACES.
009400
009500 01  TERMFILENAME                  PIC X(11) VALUE "TERM;".
009600
010100 01  MESSAGE-BUFFER.
010200     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1  PIC X(1)     VALUE SPACE.
               10  FILLER            PIC X(67)    VALUE SPACE.
010300     05  MSG-FLD               PIC X(8)     VALUE SPACE.
010400     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
010500
       01  DE-FIELDS.
           05  DE-COMMAND-LINE       PIC X(79).
           05  DE-MESSAGE-LINE       PIC X(79).

       01  FIELD-NUMBER              PIC S9(4) COMP-4 VALUE 0.

010600**************************************************************
010700**                                                          **
010800**            D A T A B A S E   W O R K                     **
010900**                                                          **
011000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
011100
011200 01  BASE                          PIC X(24) VALUE "  STORES;".
011300 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
011400 01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
011500 01  BASE-BUDGET                   PIC X(24) VALUE "  BUDGET;".
011600 01  MMIS-PASSWORD                 PIC X(7)  VALUE "DO-ALL;".
011700 01  DSET-DUMMY                    PIC X(2)  VALUE SPACES.
011800
011900 COPY DBSTAT     IN COPYLIB.
012000 01  MODE-AREA.
012100     05  MODE1                     PIC S9(4) COMP-4 VALUE 1.
012200     05  MODE7                     PIC S9(4) COMP-4 VALUE 7.
012300
012400 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
012500
012600 01  PLT-ARG                       PIC X(4)  VALUE SPACES.
012700
012800**************************************
012900*                                    *
013000*    NATIVE LANGUAGE SUPPORT AREA    *
013100*                                    *
013200**************************************
013300
013400 COPY LANGUAGE IN COPYLIB.
013500
013600
013700 PROCEDURE DIVISION.
013800 1-HOUSEKEEP SECTION.
013900
           OPEN I-O DISPLAY-FILE.
014000     CALL "TESCSEQ" USING ESC-NAME.
016700*------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
016800     MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
016900     PERFORM 7150-CALL-CSWITCHF.
017000
017600     PERFORM 6000-MAIN THRU 6990-MAIN-X.
017700
017800 1-EOJ.
           CLOSE DISPLAY-FILE.
018400     GOBACK.
018500
018600 2100-BLOWUP.
018700     MOVE "TEASETUP"               TO   BU-PGM-NAME.
018800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
018900       VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
019000       BU-DISPLAY-FLDS.
019100
       4030-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
019200 6000-MAIN.
019300 6010-GETNEXTFORM.
019400     MOVE "EAMENU"                 TO   VIEW-NFNAME.
020500 6100-SHOWFORM.
020600     MOVE 0                        TO   SRF-KEYSET.
020700     MOVE "P"                      TO   SRF-FKEY (5).
       6110-SHOWFORM.
           MOVE DE-FIELDS TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           MOVE DISPLAY-REC TO DE-FIELDS.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 4030-SETERROR
               GO TO 6110-SHOWFORM.

021300
021400     IF VIEW-LASTKEY = 8
021500         GO TO 6990-MAIN-X.
021600
021700     IF VIEW-LASTKEY = 1
021800         CALL "SEASETGB" USING BASE, BASE-MMISA, VIEW-COMAREA,
021900                               SRF-COMAREA, LANGUAGE-PARMS
022000     ELSE
022100     IF VIEW-LASTKEY = 2
022200         CALL "SEASETLV" USING BASE, BASE-MMISA, VIEW-COMAREA,
022300                               SRF-COMAREA, LANGUAGE-PARMS
022400     ELSE
022500     IF VIEW-LASTKEY = 3
022600         CALL "SEASETUS" USING BASE, BASE-MMISA, VIEW-COMAREA,
022700                               SRF-COMAREA, LANGUAGE-PARMS
022800     ELSE
022900     IF VIEW-LASTKEY = 4
023000         CALL "SEASETPH" USING BASE, BASE-MMISA, VIEW-COMAREA,
023100                               SRF-COMAREA, LANGUAGE-PARMS
023200     ELSE
023300     IF VIEW-LASTKEY = 6
023400         CALL "SEASETDP" USING BASE, BASE-MMISA, VIEW-COMAREA,
023500                               SRF-COMAREA, LANGUAGE-PARMS
023600     ELSE
023700     IF VIEW-LASTKEY = 7
023800         MOVE "FRSCREEN"           TO   CSF-NEW-FORMFILE-NAME
023900         MOVE "N"                  TO   CSF-MODE
024000         PERFORM 7150-CALL-CSWITCHF
024100         IF CSF-OPENFORM-ERR-SW = "Y"
024200             GO TO 6100-SHOWFORM
024300         ELSE
024400             CALL "SRSCRNS" USING BASE, VIEW-COMAREA,
024500               LANGUAGE-PARMS, PASS-RPT-NUMBER
024700             MOVE "O"              TO   CSF-MODE
024800             MOVE "N"              TO   CSF-CLOSE-FORMFILE-FLAG
024900             PERFORM 7150-CALL-CSWITCHF.
025000
025100
025200     GO TO 6010-GETNEXTFORM.
025300 6990-MAIN-X.
025400     EXIT.
025500
026100 7150-CALL-CSWITCHF.
026200     CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
026300       FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
026400     IF BU-DISPLAY-MSG-1 NOT = SPACES
026500         PERFORM 2100-BLOWUP.

       COPY DISPCALL IN COPYLIB.
            IF VIEW-LASTKEY = 3
                MOVE 8 TO VIEW-LASTKEY
            ELSE
            IF VIEW-LASTKEY = 8
                MOVE 3 TO VIEW-LASTKEY.
            IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
                MOVE "I" TO SRF-FKEY (7).
            IF SRF-KEYSET > 0
                MOVE "I" TO SRF-FKEY (5).
            IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
                MOVE "I" TO SRF-FKEY (4).
            IF SRF-KEYSET = 5 OR 6
                MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
            ELSE
            IF SRF-KEYSET = 7 OR 8
                MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
            MOVE SPACES TO MESSAGE-BUFFER-1.
            IF VIEW-LASTKEY = 0
                IF SRF-ENTER-FLAG = "I"
      *M            "E28: 'ENTER' NOT VALID HERE"
                    MOVE 5 TO LANG-SETNUM
                    MOVE 28 TO LANG-MSGNUM
                    MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                ELSE
                NEXT SENTENCE
            ELSE
            IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *M        "I10: INVALID FUNCTION KEY"
                MOVE 9 TO LANG-SETNUM
                MOVE 10 TO LANG-MSGNUM
                MOVE 1 TO FIELD-NUMBER, SRF-ERROR-FLD
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
            IF MESSAGE-BUFFER-1 = SPACES
                MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
        9989-WS-X.
            EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
