000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TEDICRTE.
000600
000700**************************************************************
000800*D                                                           *
000900*D  T E D I C R T E   THIS PROGRAM LAUNCHES THE JOB THAT     *
001000*D    PROCESSES THE LOGGED EDI PURCHASE ORDERS (DEDILOG).    *
001100*D    THIS PROGRAM GIVES THE USER 4 OPTIONS BY WHICH TO      *
001200*D    PROCESS THE BATCH FILE.  BASED ON THE SELECTION IT     *
001300*D    BUILDS A JOB STREAM OR ALLOWS THE USER TO SIMPLY       *
001400*D    BROWSE THE ENTRIES IN THE FILE.                        *
001700*D                                                           *
001800**************************************************************
001900*D                                                           *
002000*D  TO BUILD THE TEMPORARY JOB STREAM "BEDICRTE" THIS        *
002100*D  PROGRAM USES 2 PERMANENT PARTIAL JOB STREAMS.            *
002200*D    1) BXEDITOP    - USED TO FORM THE TOP OF THE JOB       *
002300*D       'BEDICRTE'     PRIOR TO THE USER CHOSEN SELECTIONS  *
002400*D    2) BXEDIBOT    - USED TO FORM THE BOTTOM OF THE JOB    *
002500*D       STREAM AFTER THE USER CHOSEN SELECTIONS HAVE BEEN   *
002600*D       WRITE TO THE JOB STREAM 'BEDICRTE'.                 *
002700*D                                                           *
002800**************************************************************
      *C
      *C  09/12/96  JEFF BUNGO
      *C       EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C       RECOMPILE TO PICK UP COPYLIB CHANGES.
005000
005100 ENVIRONMENT DIVISION.
005200 CONFIGURATION SECTION.
005300 SOURCE-COMPUTER.  AS400.
005400 OBJECT-COMPUTER.  AS400.

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
005500
005600 INPUT-OUTPUT SECTION.
005700 FILE-CONTROL.
005800     SELECT BATCH-FILE-SORTED ASSIGN TO DISK-BATCHEDI
               ORGANIZATION IS RELATIVE
005900         ACCESS MODE IS DYNAMIC
006000         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DEDILOG-LK-I
               ASSIGN TO DATABASE-MCFLCS4802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.


           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEDICRTE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
006500
006200     SELECT EDI-CREATE-BEGIN-FILE ASSIGN TO DISK-BXEDITOP.
006300     SELECT EDI-CREATE-END-FILE ASSIGN TO DISK-BXEDIBOT.
006400     SELECT EDI-CREATE-JOB-FILE ASSIGN TO DISK-BEDICRTE.
006100     SELECT SORT-FILE ASSIGN TO DISK-SORT.
006500
006600 DATA DIVISION.
006700 FILE SECTION.
006800 FD  BATCH-FILE-SORTED
006900     RECORD CONTAINS 80 CHARACTERS
007000     LABEL RECORD IS OMITTED
007100     DATA RECORD IS BATCH-FILE-SORTED-RCD.
007200 01  BATCH-FILE-SORTED-RCD.
           05  BTEDI-KEY               PIC X(14).
           05  BTEDI-INIT-DATE         PIC X(6).
           05  BTEDI-FLAGS.
               10  BTEDI-ADD-FLAG      PIC X.
               10  BTEDI-MOD-FLAG      PIC X.
               10  BTEDI-DEL-FLAG      PIC X.
               10  BTEDI-SND-FLAG      PIC X.
               10  FILLER              PIC XX.
           05  BTEDI-VENDOR            PIC X(10).
           05  BTEDI-ITEM-NO           PIC X(4).
           05  FILLER                  PIC X(40).
009000
       FD  DEDILOG-LK-I
           LABEL RECORDS ARE STANDARD.
       01  DEDILOG-LK-REC-I.
           COPY DDS-MCRPCS4800 OF MCFLCS4802.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZEDICRTE.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

010000 FD  EDI-CREATE-BEGIN-FILE
010100     RECORD CONTAINS 90 CHARACTERS
010200     DATA RECORD IS EDI-CREATE-BEGIN-RCD.
010300 01  EDI-CREATE-BEGIN-RCD.
010400     05  FILLER                  PIC X(90).
010500
010600 FD  EDI-CREATE-END-FILE
010700     RECORD CONTAINS 90 CHARACTERS
010800     DATA RECORD IS EDI-CREATE-END-RCD.
010900 01  EDI-CREATE-END-RCD.
011000     05  FILLER                  PIC X(90).
011100
011200 FD  EDI-CREATE-JOB-FILE
011300     RECORD CONTAINS 90 CHARACTERS
011400     DATA RECORD IS EDI-CREATE-JOB-RCD.
011500 01  EDI-CREATE-JOB-RCD.
           05  FILLER                   PIC X(12).
           05  EDI-NUM-ENTRY            PIC X(14).
           05  FILLER                   PIC X(64).
011800
009100 SD  SORT-FILE
009200     RECORD CONTAINS 90 CHARACTERS.
009300 01  SORT-RCD.
           05  SORT-KEY                 PIC X(14).
           05  SORT-INIT-DATE           PIC X(6).
           05  SORT-EDI-FLAGS.
               10  SORT-ADD-FLAG        PIC X.
               10  SORT-MOD-FLAG        PIC X.
               10  SORT-DEL-FLAG        PIC X.
               10  SORT-SND-FLAG        PIC X.
               10  FILLER               PIC XX.
           05  SORT-VENDOR              PIC X(10).
           05  SORT-ITEM-NO             PIC X(4).
           05  FILLER                   PIC X(50).

012000 WORKING-STORAGE SECTION.
012100 77  COMP-SCREEN-INDIC            PIC X(3)  VALUE SPACES.
       77  HANDLE-BLOWUP-FLAG           PIC X     VALUE "Y".
012300 77  SUB                          PIC S9(4) VALUE ZEROS COMP-4.
       77  SUB1                         PIC S9(4) VALUE ZEROS COMP-4.

012200 01  ACT-KEY                      PIC 9(9)  VALUE ZEROS.

028100 01 ARG-VALUES.
028300     05  PLT-ARG                  PIC X(4)  VALUE SPACES.
028500     05  PO-ARG                   PIC X(14) VALUE SPACES.
029500
030000 01  BUILD-COMMAND.
030100     05  FILLER  PIC X(6)  VALUE "BUILD ".
030200     05  FILLER  PIC X(8)  VALUE "RLEDIACT".
030300
014000 01  BUILD-PO-NUM.
014100     05  FILLER                  PIC X    VALUE "P".
014200     05  PO-NUM-OUT              PIC X(7) VALUE SPACES.
014300     05  PO-REL-OUT              PIC X(3) VALUE SPACES.
014400     05  PO-RCV                  PIC X(3) VALUE "000".
014500
       COPY CATREAD IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

       COPY CCHKOBJM IN COPYLIB.

       COPY CCRTFILE IN COPYLIB.

       COPY CDLTFILE IN COPYLIB.

030800 01  DATES-AND-TIMES.
030900     05  HP-CUR-DATE.
031000         10  MM                   PIC XX.
031100         10  FILLER               PIC X.
031200         10  DD                   PIC XX.
031300         10  FILLER               PIC X.
031400         10  YY                   PIC XX.
031500     05  CUR-DATE.
031600         10  YY                   PIC XX.
031700         10  MM                   PIC XX.
031800         10  DD                   PIC XX.
031900
027300 COPY DATAB    IN COPYLIB.
027400
       COPY DEDILOG IN COPYLIB.

022100 01  DE-FIELDS-1.
022200     05  DISP-COMPANY-1           PIC X(3)  VALUE SPACES.
022300     05  DE-PROCESS-ALL-1         PIC X     VALUE SPACES.
022400     05  DE-VENDOR-ALL-1.
               10  DE-V-ALL-1           PIC XXX   VALUE SPACES.
               10  FILLER               PIC X(7)  VALUE SPACES.
           05  DE-COMMAND-LINE-1        PIC X(79) VALUE SPACES.
           05  DE-MESSAGE-LINE-1        PIC X(79) VALUE SPACES.
022500
022600 01  DE-FIELDS-2.
022700     05  DISP-COMPANY-2           PIC X(3)  VALUE SPACES.
           05  DE-PROCESS-ALL-2         PIC X.
           05  DE-EDI-SEND-2.
               10  DE-EDI-POS-2 OCCURS 8 TIMES.
                   15  DE-EDI-PORELS.
                       20  DE-EDI-PO-2S    PIC X(7).
                       20  DE-EDI-REL-2S   PIC XXX.
           05  DE-EDI-NOSEND-2.
               10  DE-EDI-PON-2 OCCURS 8 TIMES.
                   15  DE-EDI-PORELN.
                       20  DE-EDI-PO-2N    PIC X(7).
                       20  DE-EDI-REL-2N   PIC XXX.
           05  DE-BATCH-ENTRIES-2.
023400         10  DE-DISP-ENTRIES-2 OCCURS 8 TIMES.
                   15  FILLER           PIC X(4).
015000             15  DE2-KEY          PIC X(10).
015100             15  FILLER           PIC X(3).
015200             15  DE2-INIT-DATE    PIC X(6).
015300             15  FILLER           PIC X(4).
016200             15  DE2-ADD-FLAG     PIC X.
016300             15  FILLER           PIC X(5).
016200             15  DE2-MOD-FLAG     PIC X.
016300             15  FILLER           PIC X(5).
016200             15  DE2-DEL-FLAG     PIC X.
016300             15  FILLER           PIC X(4).
016400             15  DE2-VENDOR       PIC X(10).
016500             15  FILLER           PIC X(3).
016800             15  DE2-ITEM-NO      PIC X(4).
016900             15  FILLER           PIC X(18).
           05  DE-MSG-LINE-2            PIC X(30) VALUE SPACES.
           05  DE-COMMAND-LINE-2        PIC X(79) VALUE SPACES.
           05  DE-MESSAGE-LINE-2        PIC X(79) VALUE SPACES.
023700
022100 01  DE-FIELDS-3.
022200     05  DISP-COMPANY-3           PIC X(3)  VALUE SPACES.
           05  DE-COMMAND-LINE-3        PIC X(79) VALUE SPACES.
           05  DE-MESSAGE-LINE-3        PIC X(79) VALUE SPACES.
022500
026700 01  DSET-NAMES.
026800     05  DSET-NAME                PIC X(16)  VALUE SPACES.
           05  DSET-DEDILOG             PIC X(16)  VALUE "DEDILOG;".
           05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
027200
014700 01  EDI-BATCH-TABLE.
014800     05  EDI-BATCH-DETAIL-LINE OCCURS 8 TIMES.
014900         10  EDI-ITEM-INFO.
                   15  FILLER           PIC X(4).
015000             15  EDI-KEY          PIC X(10).
015100             15  FILLER           PIC X(3).
015200             15  EDI-INIT-DATE    PIC X(6).
015300             15  FILLER           PIC X(4).
016200             15  EDI-ADD-FLAG     PIC X.
016300             15  FILLER           PIC X(5).
016400             15  EDI-MOD-FLAG     PIC X.
016500             15  FILLER           PIC X(5).
                   15  EDI-DEL-FLAG     PIC X.
                   15  FILLER           PIC X(4).
016600             15  EDI-VENDOR       PIC X(10).
016700             15  FILLER           PIC X(3).
016800             15  EDI-ITEM-NO      PIC X(4).
016900             15  FILLER           PIC X(18).
024000
       COPY DISPDATA IN COPYLIB.

019600 01  FIELD-NUMBER                 PIC S9(4) VALUE 1 COMP-4.
019800
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X     VALUE "0".
           05  FILE-STATUS-2            PIC X     VALUE "0".

       COPY IOFEEDBACK IN COPYLIB.
021200
027500 01 ITEMS-LISTING.
027600     05  ALL-ITEMS                PIC XX    VALUE "@;".
027700     05  CODE-SEARCH              PIC X(10) VALUE "CORP-CODE;".
027800     05  PO-SEARCH                PIC X(10) VALUE "PO-RCV-NO;".
027900     05  REQ-SEARCH               PIC X(12) VALUE "REQ-NUMBER;".
028000
032600 COPY LANGUAGE IN COPYLIB.
032700
018700 01  MESSAGE-BUFFER.
018800     05  MSG-TEXT                 PIC X(64) VALUE SPACE.
018900     05  MSG-FLD                  PIC X(12) VALUE SPACE.
019000     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.
019100
025800 COPY MPLTINFO IN COPYLIB.
026000
024100 01  NO-ENTRIES-QUALIFIED-MSG.
024200     05  FILLER                   PIC X(34).
024300     05  NO-ENTRIES-VEN-NUM       PIC X(10) VALUE SPACES.
024400     05  FILLER                   PIC X(12).
024600
       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.
032200
019900 01  PASSED-SPOOL-PRT             PIC S9(2) VALUE ZEROS COMP-4.
020000
       01  PO-CHECK-KEY.
           05  FILLER                   PIC X        VALUE "P".
           05  POREL-CHECK              PIC X(10)    VALUE SPACES.
           05  FILLER                   PIC X(3)     VALUE "000".

030400 01  PURGE-COMMAND.
030500     05  FILLER  PIC X(6)  VALUE "PURGE ".
030600     05  FILLER  PIC X(8)  VALUE "RLEDIACT".
030700
020100 01  SCREEN-PRINT-PARMS.
020200     05  PRINTCNTL             PIC S9(4)    VALUE ZERO    COMP-4.
020300     05  PAGECNTL              PIC S9(4)    VALUE 49      COMP-4.
020400     05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".
026600
       COPY SEDIVNCK IN COPYLIB.
032800
029600 01  STREAM-COMMAND.
029700     05  FILLER  PIC X(7)  VALUE "STREAM ".
029800     05  FILLER  PIC X(8) VALUE "BEDICRTE".
029900
013000 01  SWITCH-AREA.
013100     05  FATAL-ERR-SW            PIC X       VALUE "N".
013200     05  F6-VALID-SW             PIC X       VALUE "N".
013300         88  F6-VALID                        VALUE "Y".
013400     05  F7-VALID-SW             PIC X       VALUE "N".
013500         88  F7-VALID                        VALUE "Y".
013600     05  EOF-SW                  PIC X       VALUE "N".
013700     05  ERR-SW                  PIC X       VALUE "N".
013800
032300 COPY TBLOWUP IN COPYLIB.
032500
017500 COPY VCOMAREA IN COPYLIB.
018600
032900 PROCEDURE DIVISION.
033000
033100 PROC-DIV SECTION 01.
033200
033300 BEGIN-HERE.
033400     PERFORM 1-HSK THRU 1-H-X.
033500
033600     PERFORM 6-MAIN THRU 6-M-X.
033700
033800     PERFORM 2-EOJ  THRU 2-EOJ-X.
033900
034000     GOBACK.
034100
034200 1-HSK.
037100     MOVE  14 TO LANG-SETNUM.
037200     MOVE 119 TO LANG-MSGNUM.
037300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
037400     MOVE MESSAGE-BUFFER TO NO-ENTRIES-QUALIFIED-MSG.
037500*M   NO EDI ENTRIES FOUND FOR VENDOR NUMBER
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MPLTINFO-I, DEDILOG-LK-I.

038800**************************************************
038900*                                                *
039000*   GET CO. AND PRIME FROM MPLTINFO              *
039100*   USING 'P 01' AS THE ARGUMENT                 *
039200*                                                *
039300**************************************************
039400
039500     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
039900         MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
040000         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (1)
040100         GO TO 2100-BLOWUP.
040200     MOVE MPLTINFO-COMPANY            TO  COMP-SCREEN-INDIC.
           ACCEPT CUR-DATE FROM DATE.
           MOVE SPACES                      TO  SEDIVNCK-PARMS.
040500
040600 1-H-X.    EXIT.
040800
040900 2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-I, DEDILOG-LK-I.
043000 2-EOJ-X.    EXIT.
043200
043300******************************************************
043400**                                                  **
043500**   BLOWUP ROUTINE                                 **
043600**                                                  **
043700******************************************************
043800
043900 2100-BLOWUP.
           MOVE SPACES           TO DLTFILE-PARMS.
054200     MOVE "RLEDIACT"       TO  DLTFILE-FILE-NAME.
           CALL "CDLTFILE" USING DLTFILE-LIB-NAME,
                                 DLTFILE-FILE-NAME,
                                 DLTFILE-RETURN-STATUS.
054500     IF DLTFILE-RETURN-STATUS NOT = "00"
055700         IF DLTFILE-NOT-FOUND
055800             NEXT SENTENCE
055900         ELSE
               NEXT SENTENCE.
056500
044200     MOVE "TEDICRTE"              TO  BU-PGM-NAME.
044300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
044400         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
044500                 BU-DISPLAY-FLDS.
044600
044700 2100-BLOWUP-X.    EXIT.
048000
048100 4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
           MOVE MESSAGE-BUFFER  TO DE-MESSAGE-LINE-1
                                   DE-MESSAGE-LINE-2
                                   DE-MESSAGE-LINE-3.
048900
       4-PGM-ERROR-X.    EXIT.
052400
052500**************************************************
052600*                                                *
052700*     6 - M A I N                                *
052800*                                                *
052900**************************************************
053000
053100 6-MAIN.
053200     MOVE "FEDICRTE"         TO  VIEW-NFNAME.
054700     MOVE SPACES             TO  DE-FIELDS-1.
054800     MOVE COMP-SCREEN-INDIC  TO  DISP-COMPANY-1.
055500
055600 6-SHOWFORM-SCREEN-1.
           MOVE DE-FIELDS-1        TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO DE-FIELDS-1.
056400     IF VIEW-LASTKEY = 3
056500         GO TO 6-M-X
056600     ELSE
058000     IF VIEW-LASTKEY = 1 OR
058100        VIEW-LASTKEY = 2 OR
058200        VIEW-LASTKEY = 4 OR
058300        VIEW-LASTKEY = 5 OR
058400        VIEW-LASTKEY = 6 OR
058500        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
058700*        "* INVALID FUNCTION KEY ENTERED *"
058800         MOVE   9 TO LANG-SETNUM
058900         MOVE  10 TO LANG-MSGNUM
059000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
059100         MOVE 3  TO  FIELD-NUMBER
059200         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
059300         GO TO 6-SHOWFORM-SCREEN-1.
059400
      *------ FIELD EDITS
           IF DE-PROCESS-ALL-1 = " " AND DE-VENDOR-ALL-1 = "          "
      *M   YOU MUST CHOOSE AN OPTION
               MOVE 25016 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 3  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.
061300
           IF DE-PROCESS-ALL-1 NOT = SPACES AND
              DE-VENDOR-ALL-1 NOT = SPACES
      *M   SELECT ONLY ONE OPTION
               MOVE 19027 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 1  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.

061400****************************************************
061500*                                                  *
061600*   CHECK FOR AND PROCESS THE ENTIRE FILE OPTION   *
061700*   SELECTION. IF THIS WAS CHOSEN THEN BYPASS      *
061800*   THE REVIEW SCREEN AND STREAM THE RELEASE       *
061900*   CREATE JOB STREAM. ONCE THIS IS DONE END THE   *
062000*   PROGRAM                                        *
062100*                                                  *
062200****************************************************
062300
062400 6-CHECK-FOR-PROCESS-ALL.
062500     IF DE-PROCESS-ALL-1 = "X"
062600         PERFORM 64-BUILD-RLEDIACT  THRU  64-BUILD-RLEDIACT-X
062700         IF ERR-SW = "Y"
062800             MOVE 2  TO  FIELD-NUMBER
062900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
063000             GO TO 6-SHOWFORM-SCREEN-1
063100         ELSE
063200         MOVE "X"  TO  DE-PROCESS-ALL-1
063300         PERFORM 62-CREATE-LAUNCH-JOB-STREAM  THRU  62-CLJS-X
063400         GO TO 6-M-X.
063500
066500 6-REVIEW-BATCH-FILE.
066600     PERFORM 61-PROCESS-BATCH-FILE  THRU  61-PBF-X.
066700     IF VIEW-LASTKEY = 3
               CLOSE DEDILOG-LK-I
               OPEN INPUT DEDILOG-LK-I
               GO TO 6-MAIN.
067000     PERFORM 62-CREATE-LAUNCH-JOB-STREAM  THRU  62-CLJS-X.
           CLOSE DEDILOG-LK-I.
           OPEN INPUT DEDILOG-LK-I.
067200     GO TO 6-MAIN.
067300
067400 6-M-X.    EXIT.
067700
067800 61-PROCESS-BATCH-FILE.
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE 'BATCHEDI'
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "BATCHEDI"    TO CCRTFILE-FILE.
           MOVE "0080"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "20"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'BATCHEDI' FAILED"
                  TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
      *******************************************************
      **   DO A CLEAR PHYSICAL FILE MEMBER ON BATCHEDI
      **   IN CASE THIS ROUTINE WAS ALREADY EXECUTED AT LEAST
      **   ONCE BECAUSE FOR SOME REASON IF NO ENTRIES QUALIFY
      **   DURING THE INPUT PROCEDURE THEN THE FILE BATCFILE
      **   HAS THE OLD ENTRIES FROM THE PREVIOUS EXECUTION.
      *******************************************************

           MOVE "CLRPFM FILE(QTEMP/BATCHEDI)" TO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.

067900     SORT SORT-FILE ON ASCENDING KEY SORT-KEY
068200         INPUT PROCEDURE IS READ-BATCH-FILE
068300         GIVING BATCH-FILE-SORTED.
068400
068500     OPEN INPUT BATCH-FILE-SORTED.
068600
068700     MOVE "FEDICRTE2"        TO  VIEW-NFNAME.
069200
069300     MOVE SPACES             TO  DE-FIELDS-2.
069400     MOVE COMP-SCREEN-INDIC  TO  DISP-COMPANY-2.
069500     MOVE 1                  TO  ACT-KEY.
069600
069700 61-PUT-BUFFER-2.
069800     PERFORM 611-FILL-BATCH-INQ-SCREEN  THRU  611-FBIS-X.
071300
071400 61-SHOWFORM-SCREEN-2.
           MOVE DE-FIELDS-2    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-FIELDS-2.
072100
072200     IF VIEW-LASTKEY = 3
072300         GO TO 61-CLOSE-BATCH-FILE
072400     ELSE
072500     IF VIEW-LASTKEY = 7
072800         IF F7-VALID
072900             GO TO 61-PUT-BUFFER-2
073000         ELSE
073100*M       "* INVALID FUNCTION KEY ENTERED *"
073200         MOVE   9 TO LANG-SETNUM
073300         MOVE  10 TO LANG-MSGNUM
073400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
073500         MOVE 2  TO  FIELD-NUMBER
073600         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
073700         GO TO 61-SHOWFORM-SCREEN-2
073800     ELSE
073900     IF VIEW-LASTKEY = 6
074200         IF F6-VALID
074300             SUBTRACT 16  FROM  ACT-KEY
074400             GO TO 61-PUT-BUFFER-2
074500         ELSE
074600*M       "* INVALID FUNCTION KEY ENTERED *"
074700         MOVE   9 TO LANG-SETNUM
074800         MOVE  10 TO LANG-MSGNUM
074900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
075000         MOVE 2  TO  FIELD-NUMBER
075100         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
075200         GO TO 61-SHOWFORM-SCREEN-2
075300     ELSE
           IF VIEW-LASTKEY = 1
               PERFORM 610-DISPLAY-INSTRUCTION-SCREEN THRU 610-DIS-X
               GO TO 61-SHOWFORM-SCREEN-2
           ELSE
077100     IF VIEW-LASTKEY = 2 OR
077200        VIEW-LASTKEY = 4 OR
077300        VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 8
077500*        "* INVALID FUNCTION KEY ENTERED *"
077600         MOVE   9 TO LANG-SETNUM
077700         MOVE  10 TO LANG-MSGNUM
077800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
077900         MOVE 2  TO  FIELD-NUMBER
078000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
078100         GO TO 61-SHOWFORM-SCREEN-2.
080100
080200 61-EDIT-SELECTION.
080300     IF DE-PROCESS-ALL-2 NOT = SPACES
080400         IF DE-EDI-SEND-2 NOT = SPACES
080500*M           "* SELECT ONLY ONE OPTION *"
080600             MOVE  19 TO LANG-SETNUM
080700             MOVE  27 TO LANG-MSGNUM
080800             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
080900             MOVE 3  TO  FIELD-NUMBER
081000             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
081100             GO TO 61-SHOWFORM-SCREEN-2
081200         ELSE
081300         IF DE-EDI-NOSEND-2 NOT = SPACES
081400*M           "* SELECT ONLY ONE OPTION *"
081500             MOVE  19 TO LANG-SETNUM
081600             MOVE  27 TO LANG-MSGNUM
081700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
081800             MOVE 15  TO  FIELD-NUMBER
081900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
082000             GO TO 61-SHOWFORM-SCREEN-2
082100         ELSE
082200             NEXT SENTENCE
082300     ELSE
082400     IF DE-EDI-SEND-2 NOT = SPACES
082500         IF DE-EDI-NOSEND-2 NOT = SPACES
082600*M           "* SELECT ONLY ONE OPTION *"
082700             MOVE  19 TO LANG-SETNUM
082800             MOVE  27 TO LANG-MSGNUM
082900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
083000             MOVE 15  TO  FIELD-NUMBER
083100             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
083200             GO TO 61-SHOWFORM-SCREEN-2
083300         ELSE
083400             NEXT SENTENCE
083500     ELSE
083600     IF DE-EDI-NOSEND-2 = SPACES
083700*M       "YOU MUST SELECT AN OPTION BY WHICH TO PROCESS THE BATCH FILE"
083800              MOVE  25 TO LANG-SETNUM
083900              MOVE  16 TO LANG-MSGNUM
084000              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
084100         MOVE 2  TO  FIELD-NUMBER
084200         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
084300         GO TO 61-SHOWFORM-SCREEN-2.
084400
084500     PERFORM 64-BUILD-RLEDIACT  THRU  64-BUILD-RLEDIACT-X
084600     IF ERR-SW = "Y"
084700         MOVE 2  TO  FIELD-NUMBER
084800         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
084900         GO TO 61-SHOWFORM-SCREEN-2.
085000
085100 61-CLOSE-BATCH-FILE.
085200     CLOSE BATCH-FILE-SORTED.
085300
085400 61-PBF-X.    EXIT.
085600
       610-DISPLAY-INSTRUCTION-SCREEN.
           MOVE "FEDICRTE3" TO VIEW-NFNAME.
           MOVE SPACES      TO DE-FIELDS-3.
           MOVE COMP-SCREEN-INDIC TO DISP-COMPANY-3.
       610-SHOWFORM-SCREEN-3.
           MOVE DE-FIELDS-3 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-FIELDS-3.
058000     IF VIEW-LASTKEY = 1 OR
058100        VIEW-LASTKEY = 2 OR
058200        VIEW-LASTKEY = 4 OR
058300        VIEW-LASTKEY = 5 OR
058400        VIEW-LASTKEY = 6 OR
058500        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *M   "* INVALID FUNCTION KEY ENTERED * "
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE   1 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR
               GO TO 610-SHOWFORM-SCREEN-3.
           MOVE "FEDICRTE2" TO VIEW-NFNAME.
       610-DIS-X.    EXIT.

085700 611-FILL-BATCH-INQ-SCREEN.
           MOVE SPACES        TO EDI-BATCH-TABLE.
           MOVE 0 TO SUB.
           MOVE "N" TO EOF-SW
                       F6-VALID-SW
                       F7-VALID-SW.

086400 611-READ-BATCH-FILE-LOOP.
086500     READ BATCH-FILE-SORTED
086600          INVALID KEY
086700              MOVE "Y"  TO  EOF-SW.
086800
086900     ADD 1  TO  SUB.
087000     IF SUB > 8
087100         GO TO 611-FILL-BUFFER.
087200     IF EOF-SW = "Y"
087300         IF ACT-KEY = 1
087400             GO TO 611-FILL-BUFFER
087500         ELSE
087600         ADD 1  TO  ACT-KEY
087700         GO TO 611-READ-BATCH-FILE-LOOP.
087800
           MOVE BTEDI-KEY       TO EDI-KEY (SUB).
           MOVE BTEDI-INIT-DATE TO EDI-INIT-DATE (SUB).
           MOVE BTEDI-ADD-FLAG  TO EDI-ADD-FLAG (SUB).
           MOVE BTEDI-MOD-FLAG  TO EDI-MOD-FLAG (SUB).
           MOVE BTEDI-DEL-FLAG  TO EDI-DEL-FLAG (SUB).
           MOVE BTEDI-VENDOR    TO EDI-VENDOR (SUB).
           MOVE BTEDI-ITEM-NO   TO EDI-ITEM-NO (SUB).
088400     ADD 1  TO  ACT-KEY.
088500     GO TO 611-READ-BATCH-FILE-LOOP.
088600
088700 611-FILL-BUFFER.
           MOVE EDI-BATCH-TABLE TO DE-BATCH-ENTRIES-2.
           MOVE SPACES          TO DE-MSG-LINE-2.
089100     IF EOF-SW = "Y"
089200         IF ACT-KEY = 1
089300             IF DE-V-ALL-1 = "ALL"
089400*M               "EDI P.O. BATCH FILE IS EMPTY"
089500                 MOVE   5 TO LANG-SETNUM
089600                 MOVE  81 TO LANG-MSGNUM
089700                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
089800                 MOVE MESSAGE-BUFFER TO DE-DISP-ENTRIES-2 (2)
089900             ELSE
                   MOVE DE-VENDOR-ALL-1 TO NO-ENTRIES-VEN-NUM
090100             MOVE NO-ENTRIES-QUALIFIED-MSG
090200                  TO  DE-DISP-ENTRIES-2 (2)
090300         ELSE
090400         IF ACT-KEY < 10
090500             NEXT SENTENCE
090600         ELSE
090700*M       "PRESS 'f6' TO REVIEW PREVIOUS"
090800         MOVE  16 TO LANG-SETNUM
090900         MOVE   9 TO LANG-MSGNUM
091000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
091100         MOVE MESSAGE-BUFFER TO DE-MSG-LINE-2
091200         MOVE "Y"  TO  F6-VALID-SW
091300     ELSE
091400     IF ACT-KEY < 10
091500*M       "PRESS 'f7' TO REVIEW NEXT"
091600         MOVE  16 TO LANG-SETNUM
091700         MOVE  10 TO LANG-MSGNUM
091800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
091900         MOVE MESSAGE-BUFFER TO DE-MSG-LINE-2
092000         MOVE "Y"  TO  F7-VALID-SW
092100     ELSE
092200*M   "PRESS 'f6' TO REVIEW PREVIOUS"
092300     MOVE  16 TO LANG-SETNUM
092400     MOVE   9 TO LANG-MSGNUM
092500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
092600     MOVE MESSAGE-BUFFER TO DE-MSG-LINE-2
092700*M   "      'f7' TO REVIEW NEXT"
092800     MOVE  16 TO LANG-SETNUM
092900     MOVE  10 TO LANG-MSGNUM
093000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
093100     MOVE MESSAGE-BUFFER TO DE-MSG-LINE-2.
093200     MOVE "Y"         TO  F6-VALID-SW,
093300                          F7-VALID-SW.
093400
093500 611-FBIS-X.    EXIT.
096300
096400 62-CREATE-LAUNCH-JOB-STREAM.
      **************************************************
      **  OVERRIDE FILE 'BXEDITOP' TO QJOBSRC/BXEDITOP
      **************************************************
           STRING "OVRDBF FILE(BXEDITOP) TOFILE(QJOBSRC) ",
             "MBR(BXEDITOP)" DELIMITED BY SIZE INTO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
      **************************************************
      **  OVERRIDE FILE 'BXEDIBOT' TO QJOBSRC/BXEDIBOT
      **************************************************
           STRING "OVRDBF FILE(BXEDIBOT) TOFILE(QJOBSRC) ",
             "MBR(BXEDIBOT)" DELIMITED BY SIZE INTO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
      ****************************************************
      **   CALL 'CCHKOBJM' TO SEE IF THE FILE
      **   'QTEMP/QJOBSRC' EXISTS IF IT DOESNT CREATE
      **   IT VIA 'CRTSRCPF'.
      ****************************************************
           MOVE "QJOBSRC" TO CHKOBJM-FILE-NAME.
           CALL "CCHKOBJM" USING CHKOBJM-LIB,
                                CHKOBJM-FILE-NAME,
                                CHKOBJM-FILE-MBR,
                                CHKOBJM-OBJ-TYPE,
                                CHKOBJM-RETURN-STATUS.
           IF CHKOBJM-EXISTS
               NEXT SENTENCE
           ELSE
               MOVE "CRTSRCPF FILE(QJOBSRC)" TO OVRDBF-PARM1
               CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
      ****************************************************
      **   CALL 'CCHKOBJM' TO SEE IF THE FILE MEMBER
      **   'BEDICRTE' IN 'QTEMP/QJOBSRC' EXISTS
      **   IF IT  DOESNT CREATE IT VIA 'ADDPFM'
      ****************************************************
           MOVE "QJOBSRC" TO CHKOBJM-FILE-NAME.
           MOVE "BEDICRTE" TO CHKOBJM-FILE-MBR.
           CALL "CCHKOBJM" USING CHKOBJM-LIB,
                                CHKOBJM-FILE-NAME,
                                CHKOBJM-FILE-MBR,
                                CHKOBJM-OBJ-TYPE,
                                CHKOBJM-RETURN-STATUS.
           IF CHKOBJM-EXISTS
               NEXT SENTENCE
           ELSE
               MOVE "ADDPFM FILE(QJOBSRC) MBR(BEDICRTE) " TO
                   OVRDBF-PARM1
               CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
      **************************************************
      **   OVERRIDE FILE 'BEDICRTE' TO QJOBSRC/BEDICRTE
      **************************************************
           STRING "OVRDBF FILE(BEDICRTE) TOFILE(QJOBSRC) ",
           "MBR(BEDICRTE)" DELIMITED BY SIZE INTO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.

096500     OPEN INPUT  EDI-CREATE-BEGIN-FILE,
096600                 EDI-CREATE-END-FILE
096700          OUTPUT EDI-CREATE-JOB-FILE.
096800
096900 62-READ-EDI-BEGIN-FILE.
097000     READ EDI-CREATE-BEGIN-FILE
097100         AT END  GO TO 62-WRITE-SELECTION.
097200     MOVE EDI-CREATE-BEGIN-RCD
097300         TO  EDI-CREATE-JOB-RCD.
097400     WRITE EDI-CREATE-JOB-RCD.
097500     GO TO 62-READ-EDI-BEGIN-FILE.
097600
097700 62-WRITE-SELECTION.
097800     MOVE SPACES     TO  EDI-CREATE-JOB-RCD.
           IF DE-PROCESS-ALL-1 = "X"
               MOVE "ALL" TO EDI-NUM-ENTRY
               WRITE EDI-CREATE-JOB-RCD
           ELSE
097900     IF DE-PROCESS-ALL-2 = "X"
               IF DE-V-ALL-1 = "ALL"
098000             MOVE "ALL"  TO  EDI-NUM-ENTRY
098100             WRITE EDI-CREATE-JOB-RCD
               ELSE
               PERFORM 621-WRITE-SELECTED-ENTRIES THRU 621-WSE-X
098200     ELSE
098300     PERFORM 621-WRITE-SELECTED-ENTRIES THRU 621-WSE-X.
098400
098500 62-READ-EDI-END-FILE.
098600     READ EDI-CREATE-END-FILE
098700         AT END  GO TO 62-STREAM-JOB.
098800     MOVE EDI-CREATE-END-RCD
098900         TO  EDI-CREATE-JOB-RCD.
099000     WRITE EDI-CREATE-JOB-RCD.
099100     GO TO 62-READ-EDI-END-FILE.
099200
099300 62-STREAM-JOB.
099400     CLOSE EDI-CREATE-BEGIN-FILE,
099500           EDI-CREATE-END-FILE,
099600           EDI-CREATE-JOB-FILE.
      ***********************************************************
      **   STRDBRDR TO LAUNCH JOB STREAM 'BEDICRTE' IN QJOBSRC
      ***********************************************************
           MOVE "STRDBRDR FILE(*LIBL/QJOBSRC) MBR(BEDICRTE)"
               TO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
100400
100500 62-CLJS-X.    EXIT.
100700
100800 621-WRITE-SELECTED-ENTRIES.
101000     MOVE "INCLUDE"            TO  EDI-NUM-ENTRY.
101300     WRITE EDI-CREATE-JOB-RCD.
101500
           IF DE-PROCESS-ALL-2 = "X"
               MOVE DE-VENDOR-ALL-1 TO EDI-NUM-ENTRY
               WRITE EDI-CREATE-JOB-RCD
           ELSE
102000     IF DE-EDI-SEND-2  NOT = SPACES
               PERFORM 6210-INCLUDE-ENTRIES
                   VARYING SUB FROM 1 BY 1 UNTIL (SUB > 8)
                       OR (DE-EDI-POS-2 (SUB) = SPACES)
           ELSE
           IF DE-EDI-NOSEND-2 NOT = SPACES
               PERFORM 6211-EXCLUDE-ENTRIES
                   VARYING SUB FROM 1 BY 1 UNTIL (SUB > 8)
                       OR (DE-EDI-PON-2 (SUB) = SPACES)
                   PERFORM 6212-INCLUDE-NONBLANK THRU 6212-INX
                       VARYING SUB FROM 1 BY 1 UNTIL (SUB > 8).

           MOVE "**************" TO EDI-NUM-ENTRY.
103600     WRITE EDI-CREATE-JOB-RCD.

103800 621-WSE-X.    EXIT.

       6210-INCLUDE-ENTRIES.
102100     IF DE-EDI-POS-2 (SUB)  NOT = SPACES
102200         MOVE DE-EDI-PO-2S (SUB)  TO PO-NUM-OUT
               MOVE DE-EDI-REL-2S (SUB) TO PO-REL-OUT
               MOVE BUILD-PO-NUM        TO EDI-NUM-ENTRY
               WRITE EDI-CREATE-JOB-RCD.

       6211-EXCLUDE-ENTRIES.
           IF DE-EDI-PON-2 (SUB) NOT = SPACES
               PERFORM 62110-CLEAR-ENTRY VARYING SUB1 FROM 1 BY 1
                   UNTIL SUB1 > 8.

       62110-CLEAR-ENTRY.
102600     IF DE-EDI-PON-2 (SUB) = DE2-KEY (SUB1)
               MOVE SPACES TO DE-DISP-ENTRIES-2 (SUB1).

       6212-INCLUDE-NONBLANK.
           IF DE-DISP-ENTRIES-2 (SUB) = SPACES GO TO 6212-INX.
           MOVE DE2-KEY (SUB)        TO DE-EDI-POS-2 (SUB).
           MOVE DE-EDI-PO-2S (SUB)   TO PO-NUM-OUT.
           MOVE DE-EDI-REL-2S (SUB)  TO PO-REL-OUT.
           MOVE BUILD-PO-NUM         TO EDI-NUM-ENTRY.
103100     WRITE EDI-CREATE-JOB-RCD.
       6212-INX.    EXIT.
103300
113000 64-BUILD-RLEDIACT.
113100     MOVE "N"  TO  ERR-SW.

           MOVE "RLEDIACT" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
113600*    "EDI PO'S ARE BEING PROCESSED NOW; TRY AGAIN LATER"
113700     MOVE   5 TO LANG-SETNUM
           MOVE  59 TO LANG-MSGNUM
113900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
114000     MOVE "Y"  TO  ERR-SW
           GO TO 64-BUILD-RLEDIACT-X.
114600
      *------ CALL CCRTFILE TO CREATE 'RLEDIACT"
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "RLEDIACT"    TO CCRTFILE-FILE.
           MOVE "0080"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "00001"       TO CCRTFILE-NO-RECORDS.
           MOVE "00000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "00"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'RLEDIACT' FAILED"
                  TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

114700 64-BUILD-RLEDIACT-X.    EXIT.
114900
       COPY DISPCALL IN COPYLIB.
115000
       9999-GETSER-DEDILOG-LK-I.
           MOVE 0 TO COND-WORD.
           READ DEDILOG-LK-I NEXT INTO BUF-DEDILOG
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DEDILOG-LK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DEDILOG-LK-I.
           MOVE SPACES TO EDILOGKEY OF DEDILOG-LK-REC-I.
           START DEDILOG-LK-I KEY >= EDILOGKEY OF DEDILOG-LK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.


118900 CAT-READ SECTION.
119000
119100 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
120700 999-CATREAD-EXIT.    EXIT.

115100 READ-BATCH-FILE SECTION.
115300 70-READ-DEDILOG.
           PERFORM 9999-GETSER-DEDILOG-LK-I.
048500     IF END-OF-FILE GO TO 70-RD-X.
           IF LOG-BATCHNO-X = "        "
               IF DE-PROCESS-ALL-1 = "X"
                   NEXT SENTENCE
               ELSE
               IF DE-VENDOR-ALL-1 = "ALL       "
                   NEXT SENTENCE
               ELSE
               IF DE-VENDOR-ALL-1 = LOG-VENDOR
                   NEXT SENTENCE
               ELSE
               GO TO 70-READ-DEDILOG
           ELSE
           GO TO 70-READ-DEDILOG.
           MOVE SPACES                   TO SORT-RCD.
           MOVE LOG-KEY                  TO PO-CHECK-KEY.
           MOVE POREL-CHECK              TO SORT-KEY.
           MOVE LOG-INIT-DATE            TO SORT-INIT-DATE.
           MOVE LOG-FLAGS                TO SORT-EDI-FLAGS.
           MOVE LOG-VENDOR               TO SORT-VENDOR.
           MOVE LOG-ITEM-NO-X            TO SORT-ITEM-NO.
           RELEASE SORT-RCD.
           GO TO 70-READ-DEDILOG.

       70-RD-X.    EXIT.
