       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TENGCHGS.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM WILL CREATE EITHER A FILE OR A REPORT     **
      ** FOR MIKE ALBRIGHT AND ANY OTHER PLANT THAT WANTS TO    **
      ** TRACK ENGINEERING MAINTENANCE COSTS.                   **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DTRANS
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT ENG-CHGS
               ASSIGN TO DATABASE-ENGCHGS
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT FPREQSFI
               ASSIGN TO DATABASE-FPREQSFI
               ORGANIZATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT FPSTRACT
               ASSIGN TO DATABASE-FPSTRACT
               ORGANIZATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MATL-ACCUM
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS
               ASSIGN TO DATABASE-MCFLCA0302
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPERSON
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS RANDOM
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  DTRANS
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA0701.

       FD  ENG-CHGS
           RECORD CONTAINS 110 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ENG-CHGS-REQ.
       01  ENG-CHGS-REQ.
           05  TOTAL-PLANT-PAID          PIC S9(11).
           05  TOTAL-PLANT-COMM          PIC S9(11).
           05  TOTAL-PLANT-REQS          PIC S9(11).
           05  TOTAL-BCA                 PIC S9(7).
           05  TOTAL-BCB                 PIC S9(7).
           05  TOTAL-BCC                 PIC S9(7).
           05  TOTAL-BCD                 PIC S9(7).
           05  TOTAL-BCE                 PIC S9(7).
           05  TOTAL-QTECH               PIC S9(7).
           05  TOTAL-RECV                PIC S9(7).
           05  TOTAL-SHIP                PIC S9(7).
           05  TOTAL-ALLOC               PIC S9(7).
           05  TOTAL-OTHER               PIC S9(7).
           05  TOTAL-MOLDS               PIC S9(7).

       FD  FPREQSFI
           LABEL RECORDS ARE STANDARD.
       01  FPREQSFI-REC.
           05  REQNUM                    PIC X(12).
           05  REQDATE.
               10  REQDATE-CCYY          PIC 9(4).
               10  REQDATE-MM            PIC 9(2).
               10  REQDATE-DD            PIC 9(2).
           05  REQCLS                    PIC X(3).
           05  REQDEPT                   PIC X(4).
           05  REQEXP                    PIC X(6).
           05  REQBNW                    PIC X(10).
           05  REQTYPE                   PIC XX.
           05  REQORIG                   PIC X(4).
           05  REQCOST                   PIC S9(8)V9(4).
           05  FILLER                    PIC X(19).

       FD  FPSTRACT
           LABEL RECORDS ARE STANDARD.
       01  FPSTRACT-REC.
           05  SRDATE.
               10  SRDATE-CCYY           PIC 9(4).
               10  SRDATE-MM             PIC 9(2).
               10  SRDATE-DD             PIC 9(2).
           05  SRACLS                    PIC X(3).
           05  SRDEPT                    PIC X(4).
           05  SREXP                     PIC X(6).
           05  SRCCDE                    PIC X(7).
           05  SRTRANS                   PIC X(4).
           05  SREMP                     PIC X(4).
           05  SRQTY                     PIC 9(10).
           05  SRVAL                     PIC S9(8)V99.
           05  SRFIL                     PIC X(24).

       FD  MACCOUNT-INFO
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MACCOUNT-INFO-REC.
       01  MACCOUNT-INFO-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MATL-ACCUM
           LABEL RECORDS ARE STANDARD.
       01  MATL-ACCUM-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA0601.

       FD  MCHT-ACCTS
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCA0302.

       FD  MPERSON
           LABEL RECORDS ARE STANDARD.
       01  MPERSON-REC.
           COPY DDS-ALL-FORMATS  OF MCFLMM0301.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-LINE.
       01  PRINT-LINE                    PIC X(132).

       WORKING-STORAGE SECTION.
       77  HOLD-BC                       PIC X(1496).
       77  MO-DAYS                       PIC 99.
       77  SAVE-BC                       PIC X(4).
       77  SAVE-SUB                      PIC S9(4) COMP-4.
       77  SAVE-SUBMO                    PIC 99.
       77  SUB                           PIC S9(4) COMP-4.
       77  SUB1                          PIC S9(4) COMP-4.
       77  SUB2                          PIC S9(4) COMP-4.
       77  SUB3                          PIC S9(4) COMP-4.
       77  SUB4                          PIC S9(4) COMP-4.
       77  SUB5                          PIC S9(4) COMP-4.
       77  TOTAL-ALL                     PIC S9(10).
       77  TOTAL-REQS                    PIC S9(10).
       77  TOTAL-WITH                    PIC S9(10).
       77  VALID-SW                      PIC X.

       01  BC-TABLE.
           05  BC-TAB OCCURS 31 TIMES.
               10  BCT                   PIC X(4).
               10  BCT-TOTS OCCURS 31 TIMES.
                   15  BC-REQ-TOT        PIC S9(12)V9(4).
                   15  BC-WITH-TOT       PIC S9(12)V9(4).
                   15  BC-INVC-TOT       PIC S9(12)V9(4).

       01  BUILD-PO-NUM.
           05  FILLER                    PIC X     VALUE "P".
           05  BUILD-PO-NO               PIC X(07).
           05  BUILD-PO-REL              PIC X(03).
           05  FILLER                    PIC X(03) VALUE "000".

       01  CHECK-DATES.
           05  C-DATE-LOW.
               10  C-DATE-LOW-CC         PIC XX.
               10  C-DATE-LOW-YMD.
                   15  C-DATE-LOW-YY     PIC XX.
                   15  C-DATE-LOW-MM     PIC XX.
                   15  C-DATE-LOW-DD     PIC XX.
           05  C-DATE-HIGH.
               10  C-DATE-HIGH-CC        PIC XX.
               10  C-DATE-HIGH-YMD.
                   15  C-DATE-HIGH-YY    PIC XX.
                   15  C-DATE-HIGH-MM    PIC XX.
                   15  C-DATE-HIGH-DD    PIC XX.

       01  COMPRESS-PRINT                PIC X(8).

       01  CUR-DATE.
           05  CUR-DATE-YY               PIC 99.
           05  CUR-DATE-MM               PIC 99.
           05  CUR-DATE-DD               PIC 99.

       01  DEPTS-TABLE.
           05  D-TAB OCCURS 200.
               10  D-BC-DEPT.
                   15  D-BCDEPT.
                       20  D-BC          PIC X(4).
                       20  D-DEPT        PIC X(4).
                   15  D-DAY OCCURS 31.
                       20  D-REQ-TOT     PIC S9(12)V9(4).
                       20  D-WITH-TOT    PIC S9(12)V9(4).
                       20  D-INVC-TOT    PIC S9(12)V9(4).

       01  D1.
           05  D1-DA                     PIC Z9.
           05  FILLER                    PIC X    VALUE "-".
           05  D1-MO                     PIC X(3) VALUE "APR".
           05  FILLER                    PIC X.
           05  D-TOTPD                   PIC Z(10)9.
           05  FILLER                    PIC X.
           05  D-TOTCO                   PIC Z(10)9.
           05  FILLER                    PIC X.
           05  D-TOTREQS                 PIC Z(10)9.
           05  FILLER                    PIC X.
           05  D-BCNOS OCCURS 7 TIMES.
               10  D-BCNO                PIC Z(10)9.
               10  D-SPACE               PIC X.

       COPY ESCNAM2 IN COPYLIB.

       COPY FILESTAT   IN COPYLIB.

       01  FNUM                          PIC S9(4) COMP-4 VALUE 0.

       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

       01  HD-RET-CODE                   PIC S9(4) COMP-4 VALUE 0.

       COPY IOFEEDBACK IN COPYLIB.

       01  MACCT-ARG                     PIC X(4).

       01  NORMAL-PRINT                  PIC X(8).

       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.

       COPY OVRPFDATA  IN COPYLIB.

       01  PLANTS-TABLE.
           05  PLANT-TAB.
               10  FILLER  PIC X(16) VALUE "120SPARTANBURG  ".
               10  FILLER  PIC X(16) VALUE "126DANVILLE     ".
               10  FILLER  PIC X(16) VALUE "129UNION CITY   ".
               10  FILLER  PIC X(16) VALUE "130SOCIAL CIRCLE".
               10  FILLER  PIC X(16) VALUE "131GADSDEN      ".
               10  FILLER  PIC X(16) VALUE "133TOPEKA       ".
               10  FILLER  PIC X(16) VALUE "153LAWTON       ".
               10  FILLER  PIC X(16) VALUE "155ASHEBORO     ".
               10  FILLER  PIC X(16) VALUE "173CARTERSVILLE ".
               10  FILLER  PIC X(16) VALUE "174DECATUR      ".
               10  FILLER  PIC X(16) VALUE "178CARTERSVILLE ".
               10  FILLER  PIC X(16) VALUE "631NAPANEE      ".
           05  P-TAB REDEFINES PLANT-TAB.
               10  P-T OCCURS 12.
                   15  PLANT-NO   PIC X(3).
                   15  PLANT-NAME PIC X(13).

       01  PLT-ARG                       PIC X(4).

       01  PRINT-TABLE.
           05  P-LINE OCCURS 31 TIMES.
               10  P-L-TOTPD             PIC S9(12).
               10  P-L-TOTCO             PIC S9(12).
               10  P-L-TOTREQS           PIC S9(12).
               10  P-L-BC OCCURS 31 TIMES.
                   15  P-L-TOTBC         PIC S9(12).

       01  REPORT-DATE-WA.
           05  RD-CCYYMMDD.
               10  RD-CC                 PIC XX.
               10  RD-YMD.
                   15  RD-YY             PIC XX.
                   15  RD-MM             PIC XX.
                   15  RD-DD             PIC XX.

       01  REQ-ARG                       PIC X(12).

       COPY TBLOWUP  IN COPYLIB.

       COPY TDATESUB IN COPYLIB.

       COPY TNRQDESC IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       01  WHO-PARMS.
           05  USERNAME                  PIC X(10).
           05  TERMNUM                   PIC X(10).
           05  CURRLIB                   PIC X(10).
           05  JOBLIBX                   PIC X.

       01  WORK-TOTAL                    PIC 9(12).

       COPY WSCONTROL OF COPYLIB.
      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY DTRANS     IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY MACTINFO   IN COPYLIB.
       COPY MATLACUM   IN COPYLIB.
       COPY MCHTACCT   IN COPYLIB.
       01   BUF-PERSONNEL.       COPY MPERSONL IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.

       PROCEDURE DIVISION.
       START-PGM SECTION.
       STARTP.
           OPEN INPUT  DTRANS.
           OPEN INPUT  FPREQSFI.
           OPEN INPUT  FPSTRACT.
           OPEN INPUT  MACCOUNT-INFO.
           OPEN INPUT  MCHT-ACCTS.
           OPEN INPUT  MPERSON.
           OPEN INPUT  MPLTINFO.
           OPEN INPUT  MATL-ACCUM.
           PERFORM 1-HSK  THRU 1-HSK-X.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           GO TO 2-EOJ.

       2-BLOWUP.
           MOVE "TENGCHGS"    TO BU-PGM-NAME.
           MOVE REQ-ARG       TO BU-DISPLAY-FLD (1).
           MOVE FILE-STATUS   TO BU-DISPLAY-FLD9 (2).
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       2-EOJ.
           CLOSE DTRANS.
           CLOSE FPREQSFI.
           CLOSE FPSTRACT.
           CLOSE MACCOUNT-INFO.
           CLOSE MCHT-ACCTS.
           CLOSE MPERSON.
           CLOSE MPLTINFO.
           CLOSE MATL-ACCUM.
           CLOSE PRINT-FILE.
           GOBACK.

       1-HSK.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
           MOVE "P 01"         TO PLT-ARG.
           MOVE PLT-ARG        TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           PERFORM 10-SET-PLANT-LIT
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 12.
           MOVE "SDPT"         TO MACCT-ARG.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC.
           READ MACCOUNT-INFO INTO BUF-MACCT-INFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "SDPT RECORD DOES NOT EXIST" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           ACCEPT CUR-DATE FROM DATE.
           MOVE "MTED"         TO MACCT-ARG.
           MOVE MACCT-ARG TO INFOKEY OF MACCOUNT-INFO-REC.
           READ MACCOUNT-INFO INTO BUF-MACCT-INFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE CUR-DATE   TO C-DATE-LOW
                                  C-DATE-HIGH
               MOVE "01"       TO C-DATE-LOW-DD
               IF C-DATE-HIGH-YY > "70"
                   MOVE "19"   TO C-DATE-LOW-CC
                                  C-DATE-HIGH-CC
                   GO TO 1-HSK-X
               ELSE
               MOVE "20"       TO C-DATE-LOW-CC
                                  C-DATE-HIGH-CC
               GO TO 1-HSK-X.
           MOVE MACCT-PREV-MTH-END-DATE TO C-DATE-LOW-YMD.
           IF C-DATE-LOW-YY > "70"
               MOVE "19"       TO C-DATE-LOW-CC
           ELSE
           MOVE "20"           TO C-DATE-LOW-CC.
           MOVE MACCT-MONTH-END-DATE    TO C-DATE-HIGH-YMD.
           IF C-DATE-HIGH-YY > "70"
               MOVE "19"       TO C-DATE-HIGH-CC
           ELSE
           MOVE "20"           TO C-DATE-HIGH-CC.
           DISPLAY "C-DATE-LOW  = " C-DATE-LOW.
           DISPLAY "C-DATE-HIGH = " C-DATE-HIGH.
           MOVE SPACES         TO DEPTS-TABLE.
           MOVE 0              TO SUB2.
           PERFORM 11-LOAD-DEPTS-TAB THRU 11-LDT-X.
           MOVE ZEROES         TO BC-TABLE.
           MOVE ZEROES         TO PRINT-TABLE.
           MOVE ZEROES         TO TOTAL-ALL
                                  TOTAL-REQS
                                  TOTAL-WITH.

       1-HSK-X.    EXIT.

       10-SET-PLANT-LIT.
           IF MPLTINFO-COMPANY = PLANT-NO (SUB)
      *        MOVE PLANT-NAME (SUB) TO H0-PLT
               MOVE 13 TO SUB.

       11-LOAD-DEPTS-TAB.
           READ  MCHT-ACCTS NEXT INTO BUF-MCHTACCTS
               AT END    GO TO 11-LDT-X.
      *    IF MCHT-BC = "    " GO TO 11-LOAD-DEPTS-TAB.
           ADD 1               TO SUB2.
           IF SUB2 > 200
               DISPLAY "PLANT DEPT TABLE EXCEEDED"
               GO TO 11-LDT-X
           ELSE
           IF MCHT-DEPT NOT < "1000" AND MCHT-DEPT NOT > "9000"
               NEXT SENTENCE
           ELSE
           GO TO 11-LOAD-DEPTS-TAB.
           MOVE MCHT-BC        TO D-BC (SUB2).
           MOVE MCHT-DEPT      TO D-DEPT (SUB2).
           PERFORM VARYING SUB3 FROM 1 BY 1 UNTIL SUB3 > 31
               MOVE ZEROES     TO D-REQ-TOT (SUB2, SUB3)
                                  D-WITH-TOT (SUB2, SUB3)
                                  D-INVC-TOT (SUB2, SUB3)
           END-PERFORM.
           GO TO 11-LOAD-DEPTS-TAB.
       11-LDT-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.

       6-MAIN.
           PERFORM 60-GET-REQS THRU 60-GR-X.
           PERFORM 61-GET-WITH THRU 61-GW-X.
           PERFORM 62-GET-INVC THRU 62-GI-X.
           MOVE SPACES TO PRINT-LINE.
           WRITE PRINT-LINE AFTER ADVANCING NEW-PAGE.
           PERFORM 63-SORT-TABLE THRU 63-ST-X.
           MOVE 0               TO SUB3.
           MOVE SPACES          TO SAVE-BC.
           PERFORM 64-BUILD-BC-TABLE THRU 64-BBT-X
               VARYING SUB FROM 1 BY 1
                  UNTIL SUB > 200.
           IF C-DATE-HIGH-MM = "02"
               MOVE 28 TO MO-DAYS
           ELSE
           IF C-DATE-HIGH-MM = "04" OR "06" OR "09" OR "11"
               MOVE 30 TO MO-DAYS
           ELSE
           MOVE 31 TO MO-DAYS.
           PERFORM 65-PRINT-TABLE
               VARYING SUB FROM 1 BY 1 UNTIL SUB > MO-DAYS.
       6-MAIN-X.    EXIT.

       60-GET-REQS.
           READ FPREQSFI AT END GO TO 60-GR-X.
           IF REQDATE NOT LESS THAN C-DATE-LOW
              AND REQDATE NOT GREATER THAN C-DATE-HIGH
                  NEXT SENTENCE
           ELSE
           GO TO 60-GET-REQS.
           MOVE "N"        TO VALID-SW.
           PERFORM 600-CHECK4-VAL-REQ-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 200.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 60-GET-REQS.
           IF REQEXP NOT = "000250" GO TO 60-GET-REQS.
           IF REQDATE-MM = C-DATE-HIGH-MM
               NEXT SENTENCE
           ELSE
           IF REQDATE-MM = C-DATE-LOW-MM
               MOVE 01 TO REQDATE-DD.
           ADD REQCOST TO D-REQ-TOT (SAVE-SUB, REQDATE-DD).
           GO TO 60-GET-REQS.

       600-CHECK4-VAL-REQ-DEPT.
           IF REQDEPT = D-DEPT (SUB)
               MOVE "Y" TO VALID-SW
               MOVE SUB TO SAVE-SUB
               MOVE 201 TO SUB.

       60-GR-X.    EXIT.

       61-GET-WITH.
           READ FPSTRACT AT END GO TO 61-GW-X.
           IF SRDATE NOT LESS THAN C-DATE-LOW
              AND SRDATE NOT GREATER THAN C-DATE-HIGH
                  NEXT SENTENCE
           ELSE
           GO TO 61-GET-WITH.
           MOVE "N"        TO VALID-SW.
           PERFORM 610-CHECK4-VAL-SR-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 200.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 61-GET-WITH.
           IF SREXP NOT = "000250" GO TO 61-GET-WITH.
           IF SRDATE-MM = C-DATE-HIGH-MM
               NEXT SENTENCE
           ELSE
           IF SRDATE-MM = C-DATE-LOW-MM
               MOVE 01 TO SRDATE-DD.
           ADD SRVAL TO D-WITH-TOT (SAVE-SUB, SRDATE-DD).
           GO TO 61-GET-WITH.

       610-CHECK4-VAL-SR-DEPT.
           IF SRDEPT = D-DEPT (SUB)
               MOVE "Y" TO VALID-SW
               MOVE SUB TO SAVE-SUB
               MOVE 201 TO SUB.

       61-GW-X.    EXIT.

       62-GET-INVC.
           READ DTRANS NEXT INTO BUF-DTRANS
               AT END    GO TO 62-GI-X.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "46"
                   GO TO 62-GI-X
               ELSE
               PERFORM 2-BLOWUP.
           IF TRANS-CODE-TRANS = "INV" OR "FRT"
               NEXT SENTENCE
           ELSE
           GO TO 62-GET-INVC.
           IF TRANS-DATE-CN NOT LESS THAN C-DATE-LOW
               AND TRANS-DATE-CN NOT GREATER THAN C-DATE-HIGH
                   NEXT SENTENCE
           ELSE
           GO TO 62-GET-INVC.
           IF TRANS-ACCT = "000010" OR "000250"
               NEXT SENTENCE
           ELSE
           GO TO 62-GET-INVC.
           MOVE "N" TO VALID-SW.
           PERFORM 620-CHECK4-VAL-INV-DEPT
               VARYING SUB FROM 1 BY 1
                   UNTIL SUB > 200.
           IF VALID-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 62-GET-INVC.
           IF TRANS-MM = C-DATE-HIGH-MM
               NEXT SENTENCE
           ELSE
           IF TRANS-MM = C-DATE-LOW-MM
               MOVE 01 TO TRANS-DD.
           ADD TRANS-VALUE TO D-INVC-TOT (SAVE-SUB, TRANS-DD-99).
           GO TO 62-GET-INVC.

       620-CHECK4-VAL-INV-DEPT.
           IF TRANS-DEPT = D-DEPT (SUB)
               MOVE "Y" TO VALID-SW
               MOVE SUB TO SAVE-SUB
               MOVE 201 TO SUB.

       62-GI-X.    EXIT.

       63-SORT-TABLE.
           MOVE 0 TO SUB1.
           MOVE 1 TO SUB2.
       63-SORT-LOOP.
           ADD 1 TO SUB1.
           ADD 1 TO SUB2.
           IF SUB2 > 200 GO TO 63-ST-X.
      *    IF D-BC (SUB2) = "    " GO TO 63-SORT-LOOP.
           IF D-BCDEPT (SUB1) NOT > D-BCDEPT (SUB2)
                   GO TO 63-SORT-LOOP.
           MOVE D-TAB (SUB1) TO HOLD-BC.
           MOVE D-TAB (SUB2) TO D-TAB (SUB1).
           MOVE HOLD-BC      TO D-TAB (SUB2).
           GO TO 63-SORT-TABLE.
       63-ST-X.    EXIT.

       64-BUILD-BC-TABLE.
           IF D-BC (SUB) = "    " GO TO 64-BBT-X.
           IF SAVE-BC = D-BC (SUB)
               PERFORM 640-BC-TOTALS
                   VARYING SUB2 FROM 1 BY 1
                       UNTIL SUB2 > 31
               GO TO 64-BBT-X.
           ADD 1             TO SUB3.
           IF SUB3 > 31
               DISPLAY "BC TABLE OVERFLOWED"
               GO TO 2-BLOWUP.
           MOVE D-BC (SUB)   TO BCT (SUB3)
                                SAVE-BC.
           IF SUB3 = 1
               PERFORM 640-BC-TOTALS
                   VARYING SUB2 FROM 1 BY 1
                       UNTIL SUB2 > 31
               GO TO 64-BBT-X.
           SUBTRACT 1 FROM SUB3 GIVING SUB4.
           PERFORM VARYING SUB5 FROM 1 BY 1
               UNTIL SUB5 > 31
             ADD BC-REQ-TOT (SUB4, SUB5) TO BC-WITH-TOT (SUB4, SUB5)
                 GIVING WORK-TOTAL
             ADD WORK-TOTAL TO P-L-TOTCO (SUB4)
             DISPLAY SUB4 " " P-L-TOTCO (SUB4)
             ADD WORK-TOTAL TO P-L-TOTBC (SUB4, SUB5)
             DISPLAY SUB4 " " P-L-TOTBC (SUB4, SUB5)
             ADD BC-REQ-TOT (SUB4, SUB5) TO P-L-TOTREQS (SUB4)
             DISPLAY SUB4 " " P-L-TOTREQS (SUB4)
             ADD BC-INVC-TOT (SUB4, SUB5) TO P-L-TOTPD (SUB4)
             DISPLAY SUB4 " " P-L-TOTPD (SUB4)
           END-PERFORM.

       64-BBT-X.    EXIT.

       640-BC-TOTALS.
           ADD D-REQ-TOT (SUB, SUB2) TO BC-REQ-TOT (SUB3, SUB2).
           ADD D-WITH-TOT (SUB, SUB2) TO BC-WITH-TOT (SUB3, SUB2).
           ADD D-INVC-TOT (SUB, SUB2) TO BC-INVC-TOT (SUB3, SUB2).

       65-PRINT-TABLE.
           PERFORM 650-PRINT-LINE
               VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 31.
           WRITE PRINT-LINE FROM D1 AFTER ADVANCING 1 LINES.

       650-PRINT-LINE.
           MOVE SUB TO D1-DA.
           MOVE P-L-TOTPD (SUB1) TO D-TOTPD.
           MOVE P-L-TOTCO (SUB1) TO D-TOTCO.
           MOVE P-L-TOTREQS (SUB1) TO D-TOTREQS.
           PERFORM
               VARYING SUB2 FROM 1 BY 1 UNTIL SUB2 > 7
                   MOVE P-L-TOTBC (SUB1, SUB2) TO D-BCNO (SUB2)
                   MOVE " "                    TO D-SPACE (SUB2)
           END-PERFORM.

