       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TEQPLIST.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       COPY SPECIALN OF COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS SEQUENTIAL
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.

           SELECT PRINTF  ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.

           SELECT WO-LAST-NUM-USED

               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS DYNAMIC
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  PRINTF
           RECORD CONTAINS 132 CHARACTERS.
       01  PRNTF               PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 152 CHARACTERS.
       01  SORT-REC.
           05  S-EQPNUM        PIC X(6).
           05  S-NAME          PIC X(50).
           05  S-TYPE          PIC X(8).
           05  S-DEPT          PIC X(4).
           05  S-ZONE          PIC X(4).
           05  S-LOCATION      PIC X(8).
           05  S-RIME          PIC X(2).
           05  S-CLASS         PIC X(8).
           05  S-DESC          PIC X(50).
           05  S-DOWN          PIC X(6).
           05  FILLER          PIC X(1).
           05  S-ASBF          PIC X(2).
           05  FILLER          PIC X(3).

       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       01  ARG-NO              PIC 9(9).

       01  COMPRESS-PRINT.
           05  COMPRESS-CHARS  PIC 9(12) COMP-4.

       01  DBPARAMETERS.      COPY DBPARMS  OF COPYLIB.

       01  EQP-SW              PIC X VALUE "N".
           88 END-OF-EQP             VALUE "Y".

       01  EQPNUM-BUFFER.     COPY MEQPFILE OF COPYLIB.

       01  EQPNUM-COMPARE.
           05 COMPARE OCCURS 5 TIMES
                               PIC X.

       01  ERROR-BUFFER        PIC X(80).

       01  EF-STATUS           PIC XX.

       COPY ESCMAIN  IN COPYLIB.

       COPY IOFEEDBACK OF COPYLIB.

       COPY LANGSUB    OF COPYLIB.

       01  LAST-WO-BUFF.      COPY MLASTWO  OF COPYLIB.

       01  LINE-COUNT          PIC 99.

       01  NORMAL-PRINT.
           05  NORMAL-CHARS    PIC 9(12) COMP-4.

       COPY OVRPFDATA  IN COPYLIB.

       01  PAGE-HEAD           PIC 9999.

       01  PAGE-RECS           PIC 99.

       01  SPACE-COUNT         PIC 9 VALUE 0.

       COPY DBSTAT   OF COPYLIB.

       01  SUB1                PIC 9.

       COPY TDATESUB OF COPYLIB.

       01  WLNU-STATUS         PIC XX.

       LINKAGE SECTION.
       COPY THDPRTB    IN COPYLIB.

       01  DATA-LINE.
           10  SORT-INPUT      PIC X.
           10  EQPNUM-INPUT    PIC X(5).
           10  TYPENUM-INPUT   PIC X(8).
           10  DEPT-INPUT      PIC X(4).
           10  ZONE-INPUT      PIC X(4).
           10  FILLER          PIC X(58).

       PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
       START-PROGRAM.
           PERFORM 1-HSK.
           IF SORT-INPUT = "1"
               SORT SORT-FILE ON ASCENDING KEY S-EQPNUM
               INPUT  PROCEDURE 7-READ-EQUIPMENT
               OUTPUT PROCEDURE 8-WRITE-EQUIPMENT
           ELSE
           IF SORT-INPUT = "2"
               SORT SORT-FILE ON ASCENDING KEY S-TYPE
                                               S-EQPNUM
               INPUT  PROCEDURE 7-READ-EQUIPMENT
               OUTPUT PROCEDURE 8-WRITE-EQUIPMENT
           ELSE
           IF SORT-INPUT = "3"
               SORT SORT-FILE ON ASCENDING KEY S-DEPT
                                               S-EQPNUM
               INPUT  PROCEDURE 7-READ-EQUIPMENT
               OUTPUT PROCEDURE 8-WRITE-EQUIPMENT
           ELSE
           IF SORT-INPUT = "4"
               SORT SORT-FILE ON ASCENDING KEY S-ZONE
                                               S-EQPNUM
               INPUT  PROCEDURE 7-READ-EQUIPMENT
               OUTPUT PROCEDURE 8-WRITE-EQUIPMENT.

       2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRNTF FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE PRINTF.
           CLOSE EQUIPMENT-FILE.
           CLOSE WO-LAST-NUM-USED.
           GOBACK.

       1-HSK.
           OPEN INPUT  EQUIPMENT-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINTF.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI       TO  COMPRESS-PRINT.
           MOVE CHAR-10PI         TO  NORMAL-PRINT.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRNTF FROM COMPRESS-PRINT AFTER ADVANCING 0 LINES.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           MOVE 1 TO DATE-MODE.
           MOVE DATE-FLAG TO DATE-CODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           INSPECT EQPNUM-INPUT TALLYING SPACE-COUNT FOR ALL " ".

       COPY OVRPFCALL IN COPYLIB.

       7-READ-EQUIPMENT.
           PERFORM 70-GET-EQP THRU 70-GET-EQP-EXIT.

       70-GET-EQP.
           MOVE 0 TO COND-WORD.
           READ EQUIPMENT-FILE NEXT INTO EQPNUM-BUFFER
               AT END    MOVE 11 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
           IF COND-WORD = 11 GO TO 70-GET-EQP-EXIT.
           IF EQP-EQUIP-NUM = "      "
               IF EQPNUM-INPUT = "     "
                   MOVE EQPNUM-BUFFER TO SORT-REC
                   RELEASE SORT-REC
                   GO TO 70-GET-EQP
               ELSE
               GO TO 70-GET-EQP.
           MOVE EQP-EQUIP-NUM TO EQPNUM-COMPARE.
           MOVE 5 TO SUB1.
           PERFORM 701-MOVE-SPACE SPACE-COUNT TIMES.
           IF EQPNUM-INPUT = SPACES
               NEXT SENTENCE
           ELSE
           IF EQPNUM-INPUT = EQPNUM-COMPARE
               NEXT SENTENCE
           ELSE
           GO TO 70-GET-EQP.

           IF TYPENUM-INPUT = SPACES
               NEXT SENTENCE
           ELSE
           IF TYPENUM-INPUT = EQP-TYPE
               NEXT SENTENCE
           ELSE
           GO TO 70-GET-EQP.

           IF DEPT-INPUT = SPACES
               NEXT SENTENCE
           ELSE
           IF DEPT-INPUT = EQP-DEPT
               NEXT SENTENCE
           ELSE
           GO TO 70-GET-EQP.

           IF ZONE-INPUT = SPACES
               NEXT SENTENCE
           ELSE
           IF ZONE-INPUT = EQP-MAINT-ZONE
               NEXT SENTENCE
           ELSE
           GO TO 70-GET-EQP.

           MOVE EQPNUM-BUFFER TO SORT-REC.
           RELEASE SORT-REC.
           GO TO 70-GET-EQP.

       701-MOVE-SPACE.
           MOVE SPACE TO COMPARE (SUB1).
           SUBTRACT 1 FROM SUB1.

       70-GET-EQP-EXIT.    EXIT.

       8-WRITE-EQUIPMENT.
           IF PAPER-IS-132-COLS
               MOVE 50 TO PAGE-RECS
           ELSE
           MOVE 70 TO PAGE-RECS.
           MOVE "N" TO EQP-SW.
           MOVE 80 TO LINE-COUNT.
           MOVE 0 TO PAGE-HEAD.
           PERFORM 8-WR-LOOP THRU 8-WL-X.

       8-WR-LOOP.
           RETURN SORT-FILE AT END GO TO 8-WL-X.
           MOVE SPACES TO PRNTF.
           IF LINE-COUNT > PAGE-RECS
               MOVE 0 TO LINE-COUNT
               ADD 1 TO PAGE-HEAD
               MOVE SPACES TO PRNTF
               STRING "                                      "
                      "E Q U I P M E N T    P R I N T"
                      "                              "
                      DATE-SLASH-OUT
                      "  "
                      PAGE-HEAD
               DELIMITED BY SIZE INTO PRNTF
               WRITE PRNTF AFTER ADVANCING NEW-PAGE
               MOVE SPACES TO PRNTF
               WRITE PRNTF
               WRITE PRNTF
               WRITE PRNTF

               STRING "EQPNUM"
                      "  "
                      "DESCRIPTION"
                      "                                         "
                      "TYPE"
                      "      "
                      "DEPT"
                      "  "
                      "ZONE"
                      "  "
                      "LOCATION"
                      "  "
                      "RM"
                      "  "
                      "CLASS"
                      "     "
                      "D/COST"
                      "  "
                      "ASBESTOS"
               DELIMITED BY SIZE INTO PRNTF
               WRITE PRNTF
               MOVE SPACES TO PRNTF
               WRITE PRNTF.

           MOVE SPACES TO PRNTF.
           STRING S-EQPNUM
                  "  "
                  S-NAME
                  "  "
                  S-TYPE
                  "  "
                  S-DEPT
                  "  "
                  S-ZONE
                  "  "
                  S-LOCATION
                  "  "
                  S-RIME
                  "  "
                  S-CLASS
                  "  "
                  S-DOWN
                  "  "
                  S-ASBF
           DELIMITED BY SIZE INTO PRNTF.
           WRITE PRNTF.
           ADD 1 TO LINE-COUNT.
           GO TO 8-WR-LOOP.

       8-WL-X.    EXIT.

