       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQPHIST.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
       DATE-WRITTEN.           JUNE 1985.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WO-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TEQPHIST".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA  PIC X(30) VALUE
                   "EXECUTIVE PROGRAM FOR THE EQUI".
               10  PROG-DESCB  PIC X(30) VALUE
                   "PMENT WORKORDER HISTORY       ".
               10  PROG-DESCC  PIC X(30) VALUE
                   "INQUIRY.  OPENS DATABASES AND ".
               10  PROG-DESCD  PIC X(30) VALUE
                   "CALLS THISTSUB TO ALLOW DATA  ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "INPUT FOR THE ACTUAL INQUIRY P".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "ROGRAM TDISHIST.              ".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN INPUT          WO-LAST-NUM-USED.
           MOVE 1              TO DATE-FLAG-SW.
           READ  WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               DISPLAY "UNABLE TO GET LAST-WO-USED DATA."
                       "    FILE-STATUS = " FILE-STAT
               CLOSE           WO-LAST-NUM-USED
               GO TO END-OF-JOB.

           CLOSE               WO-LAST-NUM-USED.
           MOVE DATE-FLAG-SW   TO DATE-FLAG.

           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           CALL "THISTSUB" USING DBPARAMETERS.

       END-OF-JOB.
           GOBACK.

