       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQPREFI.
       AUTHOR.                 W.D. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS PFKEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WLU-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       01  PFKEY               PIC 9(9).
       01  TRUE-VAL            PIC 1 VALUE B"1".
       01  FALS-VAL            PIC 1 VALUE B"0".

       01  PROGRAM-INFORMATION.
           05 PROGRAM-NAME     PIC X(8).
           05 PROGRAM-TYPE     PIC X(2).
           05 PROGRAM-RELEASE  PIC X(12).
           05 PROGRAM-DESCRIPTION.
              10 PROGRAM-DESC1 PIC X(60).
              10 PROGRAM-DESC2 PIC X(60).
              10 PROGRAM-DESC3 PIC X(60).
           05 PROGRAM-FLAG     PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  SCREEN-DATA.
           05 EQPNUM-BUF       PIC X(6).
           05 SUBNUM-BUF       PIC X(4).
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF     PIC X(06).
           05  SUB-SYS-BUF     PIC X(04).
           05  EQP-SUB-DESC    PIC X(50).
           05  EQP-TYPE-BUF    PIC X(08).

       01  SWITCHES.
           05 EQPREF-SW        PIC X.
           05 EQPREM-SW        PIC X.
           05 EQPOPS-SW        PIC X.
           05 PARTS-SW         PIC X.
           05 ACTIVE-KEY       PIC 99.

       01  EXECUTIVE-DATA.
           05  X-WO-NUM        PIC X(10).
           05  X-CC-NUM        PIC X(4).
           05  X-EQUIP-NUM     PIC X(6).
           05  X-PARTS.
               10 PART-1       PIC X(7).
               10 PART-2       PIC X(7).
               10 PART-3       PIC X(7).
               10 PART-4       PIC X(7).
               10 PART-5       PIC X(7).
               10 PART-6       PIC X(7).
               10 PART-7       PIC X(7).
               10 PART-8       PIC X(7).

       COPY SCREENIO           IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-LAST-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       PROCEDURE DIVISION.
       OPEN-PAR.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-LAST-NUM-USED.

           MOVE "TEQPREFI"     TO PROGRAM-NAME.
           MOVE "IN"           TO PROGRAM-TYPE.
           MOVE " J0100010001" TO PROGRAM-RELEASE.
           MOVE SPACES         TO PROGRAM-DESCRIPTION EXECUTIVE-DATA.
           MOVE "EQPUIPMENT REFERENCE INQUIRY" TO PROGRAM-DESC1.
           CALL "TPWORD" USING PROGRAM-INFORMATION.
           IF PROGRAM-FLAG = "N" GO TO END-OF-JOB.

           MOVE 1              TO PFKEY DATE-FLAG.
           READ WO-LAST-NUM-USED INTO WO-LAST-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE DATE-FLAG-SW TO DATE-FLAG.

       SHOW-SCREEN.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE SPACES         TO EQPNUM-BUF SUBNUM-BUF.

       READ-SCREEN.
           MOVE "VEXEC"        TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
             GO TO END-OF-JOB.

           IF KEY-HIT = 1
               CALL "TERINDEX" USING DBPARAMETERS
               GO TO SHOW-SCREEN.

           MOVE EQPNUM-BUF     TO EQP-NUM-BUF.
           MOVE SUBNUM-BUF     TO SUB-SYS-BUF.
           MOVE KEY-HIT        TO ACTIVE-KEY.

       NEXT-FUNCTION.
           IF ACTIVE-KEY = 0 OR 2
               IF EQPNUM-BUF = SPACES
                   GO TO READ-SCREEN
               ELSE
                   CALL "TEQRFIDX" USING DBPARAMETERS
                                         EQP-SUB-BUFFER
                                         SWITCHES
                   GO TO NEXT-FUNCTION.

           IF ACTIVE-KEY = 4
               CALL "TEQRFREF" USING DBPARAMETERS
                                     EQP-SUB-BUFFER
                                     SWITCHES
               GO TO NEXT-FUNCTION.

           IF ACTIVE-KEY = 5
               CALL "TEQRFREM" USING DBPARAMETERS
                                     EQP-SUB-BUFFER
                                     SWITCHES
               GO TO NEXT-FUNCTION.

           IF ACTIVE-KEY = 6
               CALL "TEQRFOPS" USING DBPARAMETERS
                                     EQP-SUB-BUFFER
                                     SWITCHES
               GO TO NEXT-FUNCTION.

           IF ACTIVE-KEY = 7
               CALL "TEQRFSPR" USING DBPARAMETERS
                                     EQP-SUB-BUFFER
                                     SWITCHES
                                     EXECUTIVE-DATA
               GO TO NEXT-FUNCTION.

           IF ACTIVE-KEY = 8
               CALL "TEQRFDRW" USING DBPARAMETERS
                                     EQP-SUB-BUFFER
                                     SWITCHES
               GO TO NEXT-FUNCTION.

           GO TO READ-SCREEN.

       END-OF-JOB.
           CLOSE               WO-LAST-NUM-USED.
           CLOSE               DISPLAY-FILE.
           GOBACK.

