       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQRFREF.
       AUTHOR.                 W.D. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-REFERENCE
                  ASSIGN TO DATABASE-MCFLER0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-REFERENCE
           LABEL RECORDS ARE STANDARD.
       01  EREF-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  T-VAL                             PIC 1 VALUE B"1".
       77  F-VAL                             PIC 1 VALUE B"0".

       01  FILE-STAT.
           05  FILE-STAT-1                   PIC X  VALUE "0".
           05  FILE-STAT-2                   PIC X  VALUE "0".

       01  EDIT-SUBSYS.
           05 B1                             PIC 9.
           05 B2                             PIC 9.
           05 B3                             PIC 9.
           05 B4                             PIC 9.

       01  PARENT-KEY.
           05 PK1                            PIC 9.
           05 PK2                            PIC 9.
           05 PK3                            PIC 9.
           05 PK4                            PIC 9.

       01  SCREEN-DATA.
           05  WS-EQPNUM                     PIC X(6).
           05  WS-SUB0                       PIC X(4).
           05  WS-DESC0                      PIC X(50).
           05  WS-TYPENUM                    PIC X(8).
           05  WS-MANUFACT                   PIC X(16).
           05  WS-MODEL                      PIC X(16).
           05  WS-SERIAL                     PIC X(16).
           05  WS-PROP                       PIC X(8).
           05  WS-NAME1                      PIC X(16).
           05  WS-FIELD1                     PIC X(16).
           05  WS-NAME2                      PIC X(16).
           05  WS-FIELD2                     PIC X(16).
           05  WS-NAME3                      PIC X(16).
           05  WS-FIELD3                     PIC X(16).
           05  WS-NAME4                      PIC X(16).
           05  WS-FIELD4                     PIC X(16).
           05  WS-NAME5                      PIC X(16).
           05  WS-FIELD5                     PIC X(16).
           05  WS-NAME6                      PIC X(16).
           05  WS-FIELD6                     PIC X(16).
           05  WS-NAME7                      PIC X(16).
           05  WS-FIELD7                     PIC X(16).
           05  WS-NAME8                      PIC X(16).
           05  WS-FIELD8                     PIC X(16).
           05  SCREEN-MSGS.
               10  CMDMSG                    PIC X(79).
               10  ERRMSG                    PIC X(79).

       COPY SCREENIO           IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF     PIC X(06) VALUE SPACES.
           05  SUB-SYS-BUF     PIC X(04) VALUE SPACES.
           05  EQP-SUB-DESC    PIC X(50) VALUE SPACES.
           05  EQP-TYPE-BUF    PIC X(08) VALUE SPACES.

       01  SWITCHES.
           05  EQPREF-SW       PIC X.
           05  EQPREM-SW       PIC X.
           05  EQPOPS-SW       PIC X.
           05  PARTS-SW        PIC X.
           05  ACTIVE-KEY      PIC 99.

       PROCEDURE DIVISION USING DBPARAMETERS
                                EQP-SUB-BUFFER
                                SWITCHES.

       OPEN-PAR.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-REFERENCE.
           MOVE SPACES         TO SCREEN-DATA.

           MOVE EQP-NUM-BUF    TO WS-EQPNUM.
           MOVE SUB-SYS-BUF    TO WS-SUB0.
           MOVE EQP-SUB-DESC   TO WS-DESC0.

           MOVE SPACES         TO EQRSUBKEY.
           STRING WS-EQPNUM WS-SUB0 DELIMITED BY SIZE INTO EQRSUBKEY.
           READ EQP-REFERENCE.
           IF FILE-STAT = "00"
             MOVE EQRCORPTYP   TO WS-TYPENUM
             MOVE EQRMFG       TO WS-MANUFACT
             MOVE EQRMOD       TO WS-MODEL
             MOVE EQRSER       TO WS-SERIAL
             MOVE EQRPROPNUM   TO WS-PROP
             MOVE EQRNAME1     TO WS-NAME1
             MOVE EQRFLD1      TO WS-FIELD1
             MOVE EQRNAME2     TO WS-NAME2
             MOVE EQRFLD2      TO WS-FIELD2
             MOVE EQRNAME3     TO WS-NAME3
             MOVE EQRFLD3      TO WS-FIELD3
             MOVE EQRNAME4     TO WS-NAME4
             MOVE EQRFLD4      TO WS-FIELD4
             MOVE EQRNAME5     TO WS-NAME5
             MOVE EQRFLD5      TO WS-FIELD5
             MOVE EQRNAME6     TO WS-NAME6
             MOVE EQRFLD6      TO WS-FIELD6
             MOVE EQRNAME7     TO WS-NAME7
             MOVE EQRFLD7      TO WS-FIELD7
             MOVE EQRNAME8     TO WS-NAME8
             MOVE EQRFLD8      TO WS-FIELD8.

       SHOW-SCREEN.
           IF EQPREM-SW = "Y"
             MOVE T-VAL        TO IND (51).
           IF EQPOPS-SW = "Y"
             MOVE T-VAL        TO IND (52).
           IF PARTS-SW = "Y"
             MOVE T-VAL        TO IND (53).

           MOVE "VREFPAGE"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 2 OR 3
               MOVE KEY-HIT    TO ACTIVE-KEY
               GO TO END-OF-JOB.

           IF KEY-HIT = 5
               IF EQPREM-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 6
               IF EQPOPS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 7
               IF PARTS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN.

       END-OF-JOB.
           CLOSE               EQP-REFERENCE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

