       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQRFDRW.
       AUTHOR.                 W.D. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DRAWING-FILE-1
                  ASSIGN       TO DATABASE-MCFLDF0105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-2
                  ASSIGN       TO DATABASE-MCFLDF0106
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS PFKEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DRAWING-FILE-1
           LABEL RECORDS       ARE STANDARD.
       01  DF1-REC.
           COPY DDS-ALL-FORMATS OF MCFLDF0105.

       FD  DRAWING-FILE-2
           LABEL RECORDS       ARE STANDARD.
       01  DF2-REC.
           COPY DDS-ALL-FORMATS OF MCFLDF0106.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WLU-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       SD  SORT-FILE
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  SORT-DRWNUM     PIC X(16).
           05  SORT-REV        PIC X(4).
           05  SORT-CODEA      PIC X(8).
           05  SORT-CODEB      PIC X(2).
           05  SORT-DESC       PIC X(50).
           05  SORT-EQPNUM     PIC X(6).
           05  SORT-TYPNUM     PIC X(8).
           05  SORT-SUBSYS     PIC X(4).
           05  SORT-ZONE       PIC X(4).
           05  SORT-DEPT       PIC X(4).
           05  SORT-BLDG       PIC X(4).
           05  SORT-INITDATE   PIC X(6).
           05  SORT-REVDATE    PIC X(6).
           05  SORT-KEYPART    PIC X(8).
           05  SORT-LOCATION   PIC X(8).
           05  SORT-VENDCODE   PIC X(4).
           05  G-OR-F          PIC X.

       WORKING-STORAGE SECTION.
       01  CT                  PIC S9(4) COMP-3.
       01  CT1                 PIC S9(4) COMP-3.
       01  EQP-NUM             PIC X(6).
       01  F-VAL               PIC 1 VALUE B"0".
       01  T-VAL               PIC 1 VALUE B"1".
       01  TYP-NUM             PIC X(8).
       01  TOTAL-DRW           PIC S9(4) COMP-3.
       01  SAVE-TE             PIC S9(4) COMP-3.
       01  SUB-NUM             PIC X(4).
       01  TE                  PIC S9(4) COMP-3.
       01  TE1                 PIC S9(4) COMP-3.
       01  FILE-STAT           PIC XX.
       01  PFKEY               PIC 9(9).
       01  STOP-READ           PIC X.

       01  SCROLL-TABLE.
         02 ST OCCURS 400 TIMES.
           05  SCROLL-DRWNUM   PIC X(16).
           05  SCROLL-REV      PIC X(4).
           05  SCROLL-DESC     PIC X(50).
           05  SCROLL-CODEA    PIC X(8).
           05  SCROLL-CODEB    PIC X(2).
           05  SCROLL-VENDCODE PIC X(4).
           05  SCROLL-TYPNUM   PIC X(8).
           05  SCROLL-ZONE     PIC X(4).
           05  SCROLL-DEPT     PIC X(4).
           05  SCROLL-BLDG     PIC X(4).
           05  SCROLL-INITDATE PIC X(6).
           05  SCROLL-REVDATE  PIC X(6).
           05  SCROLL-KEYPART  PIC X(8).
           05  SCROLL-LOCATION PIC X(8).

       01  SCREEN-DATA1.
           05  SD1-EQPNUM      PIC X(6).
           05  SD1-CUR-PAGE    PIC 99.
           05  SD1-TOT-PAGE    PIC 99.
           05  SD1-SUB         PIC X(4).
           05  SD1-SUB-DESC    PIC X(50).
           05  SD1-TABLE.
              10  SD1-DATA     OCCURS 8 TIMES.
                 15  SD1-S     PIC X.
                 15  SD1-DRWNUM PIC X(16).
                 15  SD1-REV   PIC X(4).
                 15  SD1-CODEA PIC X(8).
                 15  SD1-DESC  PIC X(44).
           05  SCREEN1-MSGS.
               10  SD1-CMDMSG  PIC X(79).
               10  SD1-ERRMSG  PIC X(79).

       01  SCREEN-DATA2.
           05  SD2-EQPNUM      PIC X(6).
           05  SD2-SUB         PIC X(4).
           05  SD2-SUB-DESC    PIC X(50).
           05  SD2-DATA.
              10  SD2-DRWNUM   PIC X(16).
              10  SD2-REV      PIC X(4).
              10  SD2-DESC     PIC X(50).
              10  SD2-CODEA    PIC X(8).
              10  SD2-CODEB    PIC X(2).
              10  SD2-VENDCODE PIC X(4).
              10  SD2-TYPNUM   PIC X(8).
              10  SD2-ZONE     PIC X(4).
              10  SD2-DEPT     PIC X(4).
              10  SD2-BLDG     PIC X(4).
              10  SD2-INITDATE PIC X(6).
              10  SD2-REVDATE  PIC X(6).
              10  SD2-KEYPART  PIC X(8).
              10  SD2-LOCATION PIC X(8).
           05  SCREEN2-MSGS.
               10  SD2-CMDMSG  PIC X(79).
               10  SD2-ERRMSG  PIC X(79).

       01  TABLE-NUM-SAVE.
           05  TABLE-NUM       OCCURS 8 TIMES  PIC S9(4) COMP-3.

       01  TEMP-PAGE           PIC 99V9.
       01  TP                  REDEFINES TEMP-PAGE.
           05  TP1             PIC 99.
           05  TP2             PIC 9.

           COPY SCREENIO       IN COPYLIB.

           COPY TDATESUB       IN COPYLIB.

       01  WO-LAST-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       LINKAGE SECTION.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF     PIC X(06).
           05  SUB-SYS-BUF     PIC X(04).
           05  EQP-SUB-DESC    PIC X(50).
           05  EQP-TYPE-BUF    PIC X(08).

       01  SWITCHES.
           05  EQPREF-SW       PIC X.
           05  EQPREM-SW       PIC X.
           05  EQPOPS-SW       PIC X.
           05  PARTS-SW        PIC X.
           05  ACTIVE-KEY      PIC 99.

       PROCEDURE DIVISION USING DBPARAMETERS
                                EQP-SUB-BUFFER
                                SWITCHES.

       OPEN-PAR.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          DRAWING-FILE-1.
           OPEN INPUT          DRAWING-FILE-2.
           OPEN INPUT          WO-LAST-NUM-USED.

           MOVE 1              TO PFKEY DATE-FLAG.
           READ WO-LAST-NUM-USED INTO WO-LAST-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE DATE-FLAG-SW TO DATE-CODE.

           MOVE EQP-NUM-BUF    TO EQP-NUM.
           MOVE EQP-TYPE-BUF   TO TYP-NUM.
           MOVE SUB-SYS-BUF    TO SUB-NUM.

           MOVE SPACES         TO SCREEN-DATA1
                                  SCREEN-DATA2
                                  SCROLL-TABLE.

           MOVE EQP-NUM-BUF    TO SD1-EQPNUM SD2-EQPNUM.
           MOVE SUB-SYS-BUF    TO SD1-SUB SD2-SUB.
           MOVE EQP-SUB-DESC   TO SD1-SUB-DESC SD2-SUB-DESC.

           SORT SORT-FILE ASCENDING KEY G-OR-F
                                        SORT-DRWNUM
                                        SORT-REV
           INPUT PROCEDURE SORT-IN
           OUTPUT PROCEDURE SORT-OUT.

           MOVE 0              TO TE.
           PERFORM NEXT-RECORD THRU NEXT-RECORD-EXIT
           VARYING TE1 FROM 1 BY 1 UNTIL TE1 > 8.
           MOVE 1              TO SD1-CUR-PAGE.
           COMPUTE TEMP-PAGE = TOTAL-DRW / 8.
           IF TP2 > 0
               ADD 1           TO TP1.
           MOVE TP1 TO SD1-TOT-PAGE.

       SHOW-SCREEN.
           IF EQPREF-SW = "Y"
               MOVE T-VAL      TO IND (50).
           IF EQPREM-SW = "Y"
               MOVE T-VAL      TO IND (51).
           IF EQPOPS-SW = "Y"
               MOVE T-VAL      TO IND (52).
           IF PARTS-SW  = "Y"
               MOVE T-VAL      TO IND (53).

           MOVE "VDRWPG1"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA1   TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA1.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 2 OR 3
               MOVE KEY-HIT    TO ACTIVE-KEY
               GO TO END-OF-JOB.

           IF KEY-HIT = 4
               IF EQPREF-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 5
               IF EQPREM-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 6
               IF EQPOPS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 7
               IF PARTS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 8
               PERFORM NEXT-RECORD THRU NEXT-RECORD-EXIT
               VARYING TE1 FROM 1 BY 1 UNTIL TE1 > 8
               PERFORM COMPUTE-PAGE
           ELSE
           IF KEY-HIT = 9
               COMPUTE TE = SAVE-TE - 9
               IF TE < 0
                   MOVE 0      TO TE
                   PERFORM NEXT-RECORD THRU NEXT-RECORD-EXIT
                   VARYING TE1 FROM 1 BY 1 UNTIL TE1 > 8
                   PERFORM COMPUTE-PAGE
               ELSE
                   PERFORM NEXT-RECORD THRU NEXT-RECORD-EXIT
                   VARYING TE1 FROM 1 BY 1 UNTIL TE1 > 8
                   PERFORM COMPUTE-PAGE
           ELSE
               PERFORM CHECK-SELECTION VARYING CT FROM 1 BY 1
                        UNTIL CT > 8
               GO TO SHOW-SCREEN.

           GO TO SHOW-SCREEN.

       CHECK-SELECTION.
           IF SD1-S (CT) NOT = SPACE
               MOVE SPACE      TO SD1-S (CT)
               IF SD1-DRWNUM (CT) NOT = SPACES
                   PERFORM SHOW-SCREEN2 THRU SHOW-SCREEN2-EXIT.

       SHOW-SCREEN2.
           IF EQPREF-SW = "Y"
               MOVE T-VAL      TO IND (50).
           IF EQPREM-SW = "Y"
               MOVE T-VAL      TO IND (51).
           IF EQPOPS-SW = "Y"
               MOVE T-VAL      TO IND (52).
           IF PARTS-SW  = "Y"
               MOVE T-VAL      TO IND (53).

           MOVE TABLE-NUM (CT) TO CT1.
           MOVE ST (CT1)       TO SD2-DATA.

           MOVE "VDRWPG2"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA2   TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA2.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 0
               GO TO SHOW-SCREEN2-EXIT
           ELSE
           IF KEY-HIT = 1 OR 2 OR 3
               MOVE KEY-HIT    TO ACTIVE-KEY
               GO TO END-OF-JOB.

           IF KEY-HIT = 4
               IF EQPREF-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN2
           ELSE
           IF KEY-HIT = 5
               IF EQPREM-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN2
           ELSE
           IF KEY-HIT = 6
               IF EQPOPS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN2
           ELSE
           IF KEY-HIT = 7
               IF PARTS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN2.

       SHOW-SCREEN2-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               DRAWING-FILE-1.
           CLOSE               DRAWING-FILE-2.
           CLOSE               WO-LAST-NUM-USED.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       COMPUTE-PAGE.
           COMPUTE TEMP-PAGE = TE / 8.
           IF TP2 > 0
               ADD 1           TO TP1.
           MOVE TP1            TO SD1-CUR-PAGE.

       NEXT-RECORD.
           ADD 1               TO TE.

           IF TE > 400
               MOVE 9          TO TE1
               MOVE 400        TO TE
               GO TO NEXT-RECORD-EXIT.

           IF ST (TE) = SPACES
               MOVE 9          TO TE1
               SUBTRACT 1      FROM TE
               GO TO NEXT-RECORD-EXIT.

           IF TE1 = 1
               MOVE TE         TO SAVE-TE
               MOVE SPACES     TO SD1-TABLE.

           MOVE SCROLL-DRWNUM (TE) TO SD1-DRWNUM (TE1).
           MOVE SCROLL-REV (TE)    TO SD1-REV (TE1).
           MOVE SCROLL-CODEA (TE)  TO SD1-CODEA (TE1).
           MOVE SCROLL-DESC (TE)   TO SD1-DESC (TE1).

           MOVE TE             TO TABLE-NUM (TE1).

       NEXT-RECORD-EXIT.    EXIT.

       SORT-IN.
           MOVE EQP-NUM        TO DRWEQPNUM OF DF1-REC.
           MOVE SUB-NUM        TO DRWSUBSYS OF DF1-REC.
           START DRAWING-FILE-1
               KEY = DRWEQPNUM OF DF1-REC DRWSUBSYS OF DF1-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "N"        TO STOP-READ
               PERFORM LOAD-DRAW-EQPNUM THRU DRAW-EQPNUM-EXIT
               UNTIL STOP-READ = "Y".

           MOVE TYP-NUM        TO DRWTYPNUM OF DF2-REC.
           MOVE SUB-NUM        TO DRWSUBSYS OF DF2-REC.
           START DRAWING-FILE-2
               KEY = DRWTYPNUM OF DF2-REC DRWSUBSYS OF DF2-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "N"        TO STOP-READ
               PERFORM LOAD-DRAW-TYPNUM THRU DRAW-TYPNUM-EXIT
               UNTIL STOP-READ = "Y".

       LOAD-DRAW-EQPNUM.
           READ DRAWING-FILE-1 NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-EQPNUM-EXIT.

           IF DRWEQPNUM OF DF1-REC NOT = EQP-NUM
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-EQPNUM-EXIT.
           IF DRWSUBSYS OF DF1-REC NOT = SUB-NUM
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-EQPNUM-EXIT.

           MOVE DRWNUM OF DF1-REC     TO SORT-DRWNUM.
           MOVE DRWREVNUM OF DF1-REC  TO SORT-REV.
           MOVE DRWCODEA OF DF1-REC   TO SORT-CODEA.
           MOVE DRWCODEB OF DF1-REC   TO SORT-CODEB.
           MOVE DRWDESC OF DF1-REC    TO SORT-DESC.
           MOVE DRWEQPNUM OF DF1-REC  TO SORT-EQPNUM.
           MOVE DRWTYPNUM OF DF1-REC  TO SORT-TYPNUM.
           MOVE DRWSUBSYS OF DF1-REC  TO SORT-SUBSYS.
           MOVE DRWZONE OF DF1-REC    TO SORT-ZONE.
           MOVE DRWDEPT OF DF1-REC    TO SORT-DEPT.
           MOVE DRWBLDG OF DF1-REC    TO SORT-BLDG.
           MOVE DRWINITDAT OF DF1-REC TO SORT-INITDATE.
           MOVE DRWREVDAT  OF DF1-REC TO SORT-REVDATE.
           MOVE DRWKEYLST OF DF1-REC  TO SORT-KEYPART.
           MOVE DRWLOC OF DF1-REC     TO SORT-LOCATION.
           MOVE DRWVENCOD OF DF1-REC  TO SORT-VENDCODE.
           IF DRWCODEB OF DF1-REC = "G "
               MOVE "A"        TO G-OR-F
           ELSE
               MOVE "B"        TO G-OR-F.

           RELEASE SORT-REC.

       DRAW-EQPNUM-EXIT.    EXIT.

       LOAD-DRAW-TYPNUM.
           READ DRAWING-FILE-2 NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-TYPNUM-EXIT.

           IF DRWTYPNUM OF DF2-REC NOT = TYP-NUM
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-TYPNUM-EXIT.
           IF DRWSUBSYS OF DF2-REC NOT = SUB-NUM
               MOVE "Y"        TO STOP-READ
               GO TO DRAW-TYPNUM-EXIT.

           MOVE DRWNUM OF DF2-REC     TO SORT-DRWNUM.
           MOVE DRWREVNUM OF DF2-REC  TO SORT-REV.
           MOVE DRWCODEA OF DF2-REC   TO SORT-CODEA.
           MOVE DRWCODEB OF DF2-REC   TO SORT-CODEB.
           MOVE DRWDESC OF DF2-REC    TO SORT-DESC.
           MOVE DRWEQPNUM OF DF2-REC  TO SORT-EQPNUM.
           MOVE DRWTYPNUM OF DF2-REC  TO SORT-TYPNUM.
           MOVE DRWSUBSYS OF DF2-REC  TO SORT-SUBSYS.
           MOVE DRWZONE OF DF2-REC    TO SORT-ZONE.
           MOVE DRWDEPT OF DF2-REC    TO SORT-DEPT.
           MOVE DRWBLDG OF DF2-REC    TO SORT-BLDG.
           MOVE DRWINITDAT OF DF2-REC TO SORT-INITDATE.
           MOVE DRWREVDAT  OF DF2-REC TO SORT-REVDATE.
           MOVE DRWKEYLST OF DF2-REC  TO SORT-KEYPART.
           MOVE DRWLOC OF DF2-REC     TO SORT-LOCATION.
           MOVE DRWVENCOD OF DF2-REC  TO SORT-VENDCODE.
           IF DRWCODEB OF DF2-REC = "G "
               MOVE "A"        TO G-OR-F
           ELSE
               MOVE "B"        TO G-OR-F.

           RELEASE SORT-REC.

       DRAW-TYPNUM-EXIT.    EXIT.

       SORT-OUT.
           PERFORM LOAD-SCROLL-TABLE THRU SCROLL-TABLE-EXIT
           VARYING TE FROM 1 BY 1 UNTIL TE > 400.

           IF SCROLL-DRWNUM (400) NOT = SPACES
               DISPLAY "DRAWING TABLE HAS OVER 400 ENTRIES"
               GO TO END-OF-JOB.

       LOAD-SCROLL-TABLE.
           RETURN SORT-FILE
            AT END
              MOVE 401         TO TE
              GO TO SCROLL-TABLE-EXIT.

           MOVE SORT-DRWNUM    TO SCROLL-DRWNUM (TE).
           MOVE SORT-REV       TO SCROLL-REV (TE).
           MOVE SORT-CODEA     TO SCROLL-CODEA (TE).
           MOVE SORT-CODEB     TO SCROLL-CODEB (TE).
           MOVE SORT-DESC      TO SCROLL-DESC (TE).
           MOVE SORT-TYPNUM    TO SCROLL-TYPNUM (TE).
           MOVE SORT-ZONE      TO SCROLL-ZONE (TE).
           MOVE SORT-DEPT      TO SCROLL-DEPT (TE).
           MOVE SORT-BLDG      TO SCROLL-BLDG (TE).

           MOVE 4              TO DATE-MODE.
           MOVE SORT-INITDATE  TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT       TO SCROLL-INITDATE (TE).

           MOVE 4              TO DATE-MODE.
           MOVE SORT-REVDATE   TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT       TO SCROLL-REVDATE (TE).

           MOVE SORT-KEYPART   TO SCROLL-KEYPART (TE).
           MOVE SORT-LOCATION  TO SCROLL-LOCATION (TE).
           MOVE SORT-VENDCODE  TO SCROLL-VENDCODE (TE).

           MOVE TE             TO TOTAL-DRW.

       SCROLL-TABLE-EXIT.    EXIT.

