       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQRFOPS.
       AUTHOR.                 W.D. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-OPERATIONS
                  ASSIGN       TO DATABASE-MCFLER0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT TYPE-OPERATIONS
                  ASSIGN       TO DATABASE-MCFLER0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-OPERATIONS
           LABEL RECORDS       ARE STANDARD.
       01  E-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0501.

       FD  TYPE-OPERATIONS
           LABEL RECORDS       ARE STANDARD.
       01  T-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  CORP-TYPE           PIC X(8).
       77  DATA-TYPE           PIC X.
       77  EQP-NUM             PIC X(6).
       77  E-DATA              PIC X.
       77  TE                  PIC S9(4) COMP-3.
       77  TOTAL-GEN           PIC 99.
       77  TOTAL-EQP           PIC 99.
       77  T-VAL               PIC 1 VALUE B"1".
       77  F-VAL               PIC 1 VALUE B"0".
       77  FILE-STAT           PIC XX.
       77  G-DATA              PIC X.
       77  SUB-NUM             PIC X(4).
       77  STOP-READ           PIC X.

       01  SCREEN-DATA.
           05  WS-EQPNUM       PIC X(6).
           05  WS-CUR-PAGE     PIC 99.
           05  WS-TOT-PAGE     PIC 99.
           05  WS-SUB0         PIC X(4).
           05  WS-DESC0        PIC X(50).
           05  WS-TYPENUM      PIC X(8).
           05  WS-REMARKS      PIC X(792).
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  EQP-NUM1.
           05 E-NUM            PIC X(6).
           05 E-SUB            PIC X(4).

       01  CORP-TYPE1.
           05 C-TYPE           PIC X(8).
           05 C-SUB            PIC X(4).

       01  EQPNUM-REMARKS.
           05 EQP-REM          OCCURS 40 TIMES.
              10 E-REM         PIC X(792).

       01  GENERIC-REMARKS.
           05 GEN-REM          OCCURS 40 TIMES.
              10 G-REM         PIC X(792).

       01  TEMP-EQP-REM.
           05 FILLER           PIC X(10).
           05 T-E-R            PIC X(792).

       01  TEMP-TYP-REM.
           05 FILLER           PIC X(12).
           05 T-T-R            PIC X(792).

       COPY SCREENIO           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF     PIC X(06).
           05  SUB-SYS-BUF     PIC X(04).
           05  EQP-SUB-DESC    PIC X(50).
           05  EQP-TYPE-BUF    PIC X(08).

       01  SWITCHES.
           05  EQPREF-SW       PIC X.
           05  EQPREM-SW       PIC X.
           05  EQPOPS-SW       PIC X.
           05  PARTS-SW        PIC X.
           05  ACTIVE-KEY      PIC 99.

       PROCEDURE DIVISION USING DBPARAMETERS
                                EQP-SUB-BUFFER
                                SWITCHES.

       OPEN-PAR.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-OPERATIONS.
           OPEN INPUT          TYPE-OPERATIONS.

           MOVE EQP-NUM-BUF    TO EQP-NUM.
           MOVE EQP-TYPE-BUF   TO CORP-TYPE.
           MOVE SUB-SYS-BUF    TO SUB-NUM.
           MOVE SPACES         TO SCREEN-DATA
                                  GENERIC-REMARKS
                                  EQPNUM-REMARKS.
           MOVE 0              TO TOTAL-GEN TOTAL-EQP.
           MOVE EQP-NUM-BUF    TO WS-EQPNUM.
           MOVE SUB-SYS-BUF    TO WS-SUB0.
           MOVE EQP-SUB-DESC   TO WS-DESC0.

           MOVE SPACES         TO EQRTYSUBK.
           STRING EQP-TYPE-BUF SUB-SYS-BUF
                               DELIMITED BY SIZE INTO EQRTYSUBK.
           START TYPE-OPERATIONS KEY = EQRTYSUBK
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "N"        TO STOP-READ
               PERFORM LOAD-GENERIC-REMARKS THRU LOAD-GENERIC-EXIT
               VARYING TE FROM 1 BY 1
               UNTIL STOP-READ = "Y" OR TE > 40.

           IF TE > 40
               DISPLAY "PROGRAM TABLE NOT BIG ENOUGH FOR REMARKS"
               GO TO END-OF-JOB.

           IF G-REM (1) = SPACES
               MOVE "N"        TO G-DATA
           ELSE
               MOVE "Y"        TO G-DATA.

           MOVE SPACES         TO EQRSUBKEY.
           STRING EQP-NUM-BUF SUB-SYS-BUF
                              DELIMITED BY SIZE INTO EQRSUBKEY.
           START EQP-OPERATIONS KEY = EQRSUBKEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "N"        TO STOP-READ
               PERFORM LOAD-LOCAL-REMARKS THRU LOAD-LOCAL-EXIT
               VARYING TE FROM 1 BY 1
               UNTIL STOP-READ = "Y" OR TE > 40.

           IF TE > 40
               DISPLAY "PROGRAM TABLE NOT BIG ENOUGH FOR REMARKS"
               GO TO END-OF-JOB.

           IF E-REM (1) = SPACES
               MOVE "N"        TO E-DATA
           ELSE
               MOVE "Y"        TO E-DATA.

           MOVE 1              TO TE.
           IF E-DATA = "Y"
               MOVE TE         TO WS-CUR-PAGE
               MOVE TOTAL-EQP  TO WS-TOT-PAGE
               MOVE SPACES     TO WS-TYPENUM
               MOVE E-REM (TE) TO WS-REMARKS
               MOVE "E"        TO DATA-TYPE
           ELSE
               MOVE TE         TO WS-CUR-PAGE
               MOVE TOTAL-GEN  TO WS-TOT-PAGE
               MOVE CORP-TYPE  TO WS-TYPENUM
               MOVE G-REM (TE) TO WS-REMARKS
               MOVE "G"        TO DATA-TYPE.

       SHOW-SCREEN.
           IF EQPREF-SW = "Y"
               MOVE T-VAL      TO IND (50).
           IF EQPREM-SW = "Y"
               MOVE T-VAL      TO IND (51).
           IF PARTS-SW = "Y"
               MOVE T-VAL      TO IND (53).

           IF DATA-TYPE = "G"
      *M********************************************************************
      *M    MESSAGE 042/153:
      *M  PRESS F10 TO TOGGLE TO EQUIPMENT DATA
      *M********************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE 153        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO CMDMSG
           ELSE
      *M********************************************************************
      *M    MESSAGE 042/154:
      *M  PRESS F10 TO TOGGLE TO GENERIC DATA
      *M********************************************************************
               MOVE  42        TO CATREAD-MSG-SET
               MOVE 154        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO CMDMSG.

           MOVE "VOPSPAGE"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 2 OR 3
               MOVE KEY-HIT    TO ACTIVE-KEY
               GO TO END-OF-JOB.

           IF KEY-HIT = 4
               IF EQPREF-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 5
               IF EQPREM-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 7
               IF PARTS-SW = "Y"
                   MOVE KEY-HIT TO ACTIVE-KEY
                   GO TO END-OF-JOB
               ELSE
                   GO TO SHOW-SCREEN
           ELSE
           IF KEY-HIT = 8
               PERFORM NEXT-RECORD THRU NEXT-RECORD-EXIT
           ELSE
           IF KEY-HIT = 9
               PERFORM PREV-RECORD THRU PREV-RECORD-EXIT
           ELSE
           IF KEY-HIT = 10
               PERFORM TOGGLE-DATA-TYPE.

           GO TO SHOW-SCREEN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-OPERATIONS.
           CLOSE               TYPE-OPERATIONS.
           GOBACK.

       TOGGLE-DATA-TYPE.
           IF DATA-TYPE = "G"
               IF E-DATA = "Y"
                   MOVE 1      TO TE
                   MOVE TE     TO WS-CUR-PAGE
                   MOVE TOTAL-EQP TO WS-TOT-PAGE
                   MOVE SPACES TO WS-TYPENUM
                   MOVE E-REM (TE) TO WS-REMARKS
                   MOVE "E"    TO DATA-TYPE
               ELSE
      *M********************************************************************
      *M    MESSAGE 033/005:
      *M  NO EQUIPMENT DATA TO DISPLAY
      *M********************************************************************
                   MOVE 33     TO CATREAD-MSG-SET
                   MOVE  5     TO CATREAD-MSG-NUM
                   CALL "CCATREAD" USING CATREAD-PARMS
                   MOVE CATREAD-MSG-TEXT TO ERRMSG
                   MOVE T-VAL  TO IND (99)
           ELSE
           IF DATA-TYPE = "E"
               IF G-DATA = "Y"
                   MOVE 1      TO TE
                   MOVE TE     TO WS-CUR-PAGE
                   MOVE TOTAL-GEN TO WS-TOT-PAGE
                   MOVE CORP-TYPE TO WS-TYPENUM
                   MOVE G-REM (TE) TO WS-REMARKS
                   MOVE "G"    TO DATA-TYPE
             ELSE
      *M********************************************************************
      *M    MESSAGE 033/004:
      *M  NO GENERIC DATA TO DISPLAY
      *M********************************************************************
                   MOVE 33     TO CATREAD-MSG-SET
                   MOVE  4     TO CATREAD-MSG-NUM
                   CALL "CCATREAD" USING CATREAD-PARMS
                   MOVE CATREAD-MSG-TEXT TO ERRMSG
                   MOVE T-VAL  TO IND (99).

       NEXT-RECORD.
           ADD 1               TO TE.

           IF TE > 40
               MOVE 40         TO TE
               GO TO NEXT-RECORD-EXIT.

           IF DATA-TYPE = "G"
               IF G-REM (TE) = SPACES
                   SUBTRACT 1  FROM TE
                   GO TO NEXT-RECORD-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF DATA-TYPE = "E"
               IF E-REM (TE) = SPACES
                   SUBTRACT 1 FROM TE
                   GO TO NEXT-RECORD-EXIT
               ELSE
                   NEXT SENTENCE.

           IF DATA-TYPE = "G"
               MOVE CORP-TYPE  TO WS-TYPENUM
               MOVE G-REM (TE) TO WS-REMARKS
           ELSE
           IF DATA-TYPE = "E"
               MOVE SPACES     TO WS-TYPENUM
               MOVE E-REM (TE) TO WS-REMARKS.

           MOVE TE             TO WS-CUR-PAGE.

       NEXT-RECORD-EXIT.    EXIT.

       PREV-RECORD.
           SUBTRACT 1          FROM TE.

           IF TE < 1
               MOVE 1          TO TE
               GO TO PREV-RECORD-EXIT.

           IF DATA-TYPE = "G"
               MOVE CORP-TYPE  TO WS-TYPENUM
               MOVE G-REM (TE) TO WS-REMARKS
           ELSE
           IF DATA-TYPE = "E"
               MOVE SPACES     TO WS-TYPENUM
               MOVE E-REM (TE) TO WS-REMARKS.

           MOVE TE             TO WS-CUR-PAGE.

       PREV-RECORD-EXIT.    EXIT.

       LOAD-GENERIC-REMARKS.
           READ TYPE-OPERATIONS NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-GENERIC-EXIT.

           MOVE EQRTYSUBK      TO CORP-TYPE1.
           IF CORP-TYPE NOT = C-TYPE
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-GENERIC-EXIT.
           IF SUB-NUM NOT = C-SUB
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-GENERIC-EXIT.

           MOVE T-REC          TO TEMP-TYP-REM.
           MOVE T-T-R          TO G-REM (TE).

           MOVE TE             TO TOTAL-GEN.

       LOAD-GENERIC-EXIT.    EXIT.

       LOAD-LOCAL-REMARKS.
           READ EQP-OPERATIONS NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-LOCAL-EXIT.

           MOVE EQRSUBKEY      TO EQP-NUM1.
           IF EQP-NUM NOT = E-NUM
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-LOCAL-EXIT.
           IF SUB-NUM NOT = E-SUB
               MOVE "Y"        TO STOP-READ
               GO TO LOAD-LOCAL-EXIT.

           MOVE E-REC          TO TEMP-EQP-REM.
           MOVE T-E-R          TO E-REM (TE).

           MOVE TE             TO TOTAL-EQP.

       LOAD-LOCAL-EXIT.    EXIT.

