       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQRFIDX.
       AUTHOR.                 W.D. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-EQUIP-HIER
                  ASSIGN       TO DATABASE-MCFLMM1701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-REFERENCE
                  ASSIGN       TO DATABASE-MCFLER0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-REMARKS
                  ASSIGN       TO DATABASE-MCFLER0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT TYPE-REMARKS
                  ASSIGN       TO DATABASE-MCFLER0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-OPERATIONS
                  ASSIGN       TO DATABASE-MCFLER0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT TYPE-OPERATIONS
                  ASSIGN       TO DATABASE-MCFLER0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT CORP-CODE-LINK
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-E
                  ASSIGN       TO DATABASE-MCFLDF0105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DRAWING-FILE-T
                  ASSIGN       TO DATABASE-MCFLDF0106
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-EQUIPMENT
           LABEL RECORDS       ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  WO-EQUIP-HIER
           LABEL RECORDS       ARE STANDARD.
       01  HEIR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1701.

       FD  EQP-REFERENCE
           LABEL RECORDS       ARE STANDARD.
       01  EREF-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.

       FD  EQP-REMARKS
           LABEL RECORDS       ARE STANDARD.
       01  REM-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0301.

       FD  TYPE-REMARKS
           LABEL RECORDS       ARE STANDARD.
       01  TREM-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0401.

       FD  EQP-OPERATIONS
           LABEL RECORDS       ARE STANDARD.
       01  OPS-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0501.

       FD  TYPE-OPERATIONS
           LABEL RECORDS       ARE STANDARD.
       01  TOPS-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.

       FD  CORP-CODE-LINK
           LABEL RECORDS       ARE STANDARD.
       01  CC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2101.

       FD  DRAWING-FILE-E
           LABEL RECORDS       ARE STANDARD.
       01  DFE-REC.
           COPY DDS-ALL-FORMATS OF MCFLDF0105.

       FD  DRAWING-FILE-T
           LABEL RECORDS       ARE STANDARD.
       01  DFT-REC.
           COPY DDS-ALL-FORMATS OF MCFLDF0106.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  CORP-TYPE           PIC X(8).
       77  EQP-NUMB            PIC X(8).
       77  DRWFIL-SW           PIC X.
       77  MUTANT-SW           PIC X VALUE " ".
           88  MUTANT                VALUE "M".
       77  F-VAL               PIC 1 VALUE B"0".
       77  T-VAL               PIC 1 VALUE B"1".
       77  STOP-READ           PIC X.
       77  S1                  PIC 99 COMP-3.
       77  S2                  PIC 99 COMP-3.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  EDIT-SUBSYS.
           05 B1               PIC 9.
           05 B2               PIC 9.
           05 B3               PIC 9.
           05 B4               PIC 9.

       01  PARENT-KEY.
           05 PK1              PIC 9.
           05 PK2              PIC 9.
           05 PK3              PIC 9.
           05 PK4              PIC 9.

       01  SCREEN-DATA.
           05  WS-EQPNUM         PIC X(6).
           05  WS-EDIT.
               10  WS-SUB0       PIC X(4).
               10  WS-DESC0      PIC X(50).
               10  SUBSYS-TABLE  OCCURS 9 TIMES.
                   15  REF-BYTE  PIC X.
                   15  REM-BYTE  PIC X.
                   15  OPR-BYTE  PIC X.
                   15  SPR-BYTE  PIC X.
                   15  DRW-BYTE  PIC X.
                   15  SCREEN-SUBSYS.
                       20  SS-B1 PIC 9.
                       20  SS-B2 PIC 9.
                       20  SS-B3 PIC 9.
                       20  SS-B4 PIC 9.
                   15  SCREEN-DESC PIC X(50).
           05  WS-CHG-SUB        PIC X(4).
           05  SCREEN-MSGS.
               10  CMDMSG        PIC X(79).
               10  ERRMSG        PIC X(79).

       COPY SCREENIO           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       01  SUBSYSBUF.
           05  SUBSYS-KEY.
               10  SUBSYS-TYPE           PIC X(08).
               10  SUBSYS-PARENT.
                   15  SUBSYS-PARENT-NUM PIC X(04).
                   15  FILLER            PIC X(02).
           05  SUBSYS-CHILD.
               10  SUBSYS-CHILD-NUM      PIC X(04).
               10  FILLER                PIC X(02).
           05  SUBSYS-DESC               PIC X(50).

       LINKAGE SECTION.

       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF     PIC X(06).
           05  SUB-SYS-BUF     PIC X(04).
           05  EQP-SUB-DESC    PIC X(50).
           05  EQP-TYPE-BUF    PIC X(08).

       01  SWITCHES.
           05  EQPREF-SW       PIC X.
           05  EQPREM-SW       PIC X.
           05  EQPOPS-SW       PIC X.
           05  PARTS-SW        PIC X.
           05  ACTIVE-KEY      PIC 99.

       PROCEDURE DIVISION USING DBPARAMETERS
                                EQP-SUB-BUFFER
                                SWITCHES.

       OPEN-PAR.
           OPEN INPUT          EQP-EQUIPMENT.
           OPEN INPUT          WO-EQUIP-HIER.
           OPEN INPUT          EQP-REFERENCE.
           OPEN INPUT          EQP-REMARKS.
           OPEN INPUT          TYPE-REMARKS.
           OPEN INPUT          EQP-OPERATIONS.
           OPEN INPUT          CORP-CODE-LINK.
           OPEN INPUT          TYPE-OPERATIONS.
           OPEN INPUT          DRAWING-FILE-E.
           OPEN INPUT          DRAWING-FILE-T.
           OPEN I-O            DISPLAY-FILE.

           MOVE ALL "N"        TO SWITCHES.
           MOVE 0              TO ACTIVE-KEY.
           MOVE "N"            TO DRWFIL-SW.
           MOVE SPACES         TO SCREEN-DATA.

           MOVE EQP-NUM-BUF    TO EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 66134      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE T-VAL      TO IND (99)
               MOVE SPACES     TO CORP-TYPE EQP-NUMB
               MOVE SUB-SYS-BUF TO WS-CHG-SUB
           ELSE
               MOVE EQPNUM     TO EQP-NUMB
               MOVE EQPTYPE    TO CORP-TYPE
               MOVE SUB-SYS-BUF TO WS-CHG-SUB.

           IF CORP-TYPE = SPACES
               MOVE HIGH-VALUES TO CORP-TYPE.

           MOVE CORP-TYPE      TO EQP-TYPE-BUF.
           MOVE EQP-NUM-BUF    TO WS-EQPNUM.

           IF CORP-TYPE NOT = HIGH-VALUES
               PERFORM LIST-SUBSYSTEM THRU LIST-SUBSYSTEM-EXIT
           ELSE
           IF FILE-STAT = "00"
               MOVE 66165      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE T-VAL      TO IND (99).

       SHOW-SCREEN.
           IF EQPREF-SW = "Y"
               MOVE T-VAL      TO IND (50).
           IF EQPREM-SW = "Y"
               MOVE T-VAL      TO IND (51).
           IF EQPOPS-SW = "Y"
               MOVE T-VAL      TO IND (52).
           IF PARTS-SW = "Y"
               MOVE T-VAL      TO IND (53).
           IF DRWFIL-SW = "Y"
               MOVE T-VAL      TO IND (54).

           MOVE "VSUBSYS"      TO SCREEN-NAME.
           MOVE " "            TO MUTANT-SW.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
             GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 0 OR 2
             PERFORM LIST-SUBSYSTEM THRU LIST-SUBSYSTEM-EXIT
           ELSE
           IF KEY-HIT = 4
             IF EQPREF-SW = "Y"
               GO TO END-OF-JOB
             ELSE
               NEXT SENTENCE
           ELSE
           IF KEY-HIT = 5
             IF EQPREM-SW = "Y"
               GO TO END-OF-JOB
             ELSE
               NEXT SENTENCE
           ELSE
           IF KEY-HIT = 6
             IF EQPOPS-SW = "Y"
               GO TO END-OF-JOB
             ELSE
               NEXT SENTENCE
           ELSE
           IF KEY-HIT = 7
             IF PARTS-SW = "Y"
               GO TO END-OF-JOB
             ELSE
               NEXT SENTENCE
           ELSE
           IF KEY-HIT = 8
             IF DRWFIL-SW = "Y"
               GO TO END-OF-JOB
             ELSE
               NEXT SENTENCE.

           GO TO SHOW-SCREEN.

       END-OF-JOB.
           MOVE WS-SUB0        TO SUB-SYS-BUF.
           MOVE WS-DESC0       TO EQP-SUB-DESC.
           MOVE KEY-HIT        TO ACTIVE-KEY.

           CLOSE               EQP-EQUIPMENT.
           CLOSE               WO-EQUIP-HIER.
           CLOSE               EQP-REFERENCE.
           CLOSE               EQP-REMARKS.
           CLOSE               TYPE-REMARKS.
           CLOSE               EQP-OPERATIONS.
           CLOSE               TYPE-OPERATIONS.
           CLOSE               CORP-CODE-LINK.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       LIST-SUBSYSTEM.
           MOVE WS-CHG-SUB     TO EDIT-SUBSYS.
           INSPECT EDIT-SUBSYS REPLACING ALL " " BY "0".
           MOVE EDIT-SUBSYS    TO WS-CHG-SUB.

           IF EDIT-SUBSYS NUMERIC
               NEXT SENTENCE
           ELSE
               MOVE 66136      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE T-VAL      TO IND (99)
               GO TO LIST-SUBSYSTEM-EXIT.

           IF B1 = 0 AND B2 NOT = 0
               MOVE "M"        TO MUTANT-SW.

           IF B2 = 0 AND B3 NOT = 0
               MOVE "M"        TO MUTANT-SW.

           IF B3 = 0 AND B4 NOT = 0
               MOVE "M"        TO MUTANT-SW.

           MOVE EDIT-SUBSYS    TO WS-SUB0.
           PERFORM LOAD-PARENT-DESC THRU LOAD-PARENT-EXIT.

           IF MUTANT
               MOVE " *** LOCALLY DEFINED MUTANT SUBSYSTEM ***"
                               TO WS-DESC0
               MOVE SPACES     TO SUBSYS-TABLE(1)
                                  SUBSYS-TABLE(2)
                                  SUBSYS-TABLE(3)
                                  SUBSYS-TABLE(4)
                                  SUBSYS-TABLE(5)
                                  SUBSYS-TABLE(6)
                                  SUBSYS-TABLE(7)
                                  SUBSYS-TABLE(8)
                                  SUBSYS-TABLE(9)
               GO TO LIST-SS-CONT.

           PERFORM CAL-SUBS    THRU CAL-SUBS-EXIT
                               VARYING S1 FROM 1 BY 1 UNTIL S1 > 9.
           PERFORM INIT-DESC   VARYING S1 FROM 1 BY 1 UNTIL S1 > 9.
           PERFORM LOAD-DESCS  THRU LOAD-DESCS-EXIT.

       LIST-SS-CONT.
           MOVE SPACES         TO EQRSUBKEY OF EREF-REC.
           STRING WS-EQPNUM WS-SUB0
               DELIMITED BY SIZE INTO EQRSUBKEY OF EREF-REC.
           START EQP-REFERENCE KEY = EQRSUBKEY OF EREF-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (50)
               MOVE "Y"        TO EQPREF-SW
           ELSE
               MOVE F-VAL      TO IND (50)
               MOVE "N"        TO EQPREF-SW.

           MOVE F-VAL          TO IND (51).
           MOVE "N"            TO EQPREM-SW.

           MOVE SPACES         TO EQRSUBKEY OF REM-REC.
           STRING WS-EQPNUM WS-SUB0
            DELIMITED BY SIZE  INTO EQRSUBKEY OF REM-REC.
           START EQP-REMARKS   KEY = EQRSUBKEY OF REM-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (51)
               MOVE "Y"        TO EQPREM-SW.

           MOVE SPACES         TO EQRTYSUBK OF TREM-REC.
           STRING CORP-TYPE WS-SUB0
             DELIMITED BY SIZE INTO EQRTYSUBK OF TREM-REC.
           START TYPE-REMARKS  KEY = EQRTYSUBK OF TREM-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (51)
               MOVE "Y"        TO EQPREM-SW.

           MOVE F-VAL          TO IND (52).
           MOVE "N"            TO EQPOPS-SW.

           MOVE SPACES         TO EQRSUBKEY OF OPS-REC.
           STRING WS-EQPNUM WS-SUB0
            DELIMITED BY SIZE  INTO EQRSUBKEY OF OPS-REC.
           START EQP-OPERATIONS KEY = EQRSUBKEY OF OPS-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (52)
               MOVE "Y"        TO EQPOPS-SW.

           MOVE SPACES         TO EQRTYSUBK OF TOPS-REC.
           STRING CORP-TYPE WS-SUB0
                DELIMITED BY SIZE INTO EQRTYSUBK OF TOPS-REC.
           START TYPE-OPERATIONS KEY = EQRTYSUBK OF TOPS-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (52)
               MOVE "Y"        TO EQPOPS-SW.

           MOVE F-VAL          TO IND (53).
           MOVE "N"            TO PARTS-SW.
           MOVE SPACES         TO HIERKEY OF CC-REC.
           STRING CORP-TYPE WS-SUB0
               DELIMITED BY SIZE INTO HIERKEY OF CC-REC.
           START CORP-CODE-LINK KEY = HIERKEY OF CC-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (53)
               MOVE "Y"        TO PARTS-SW.

           MOVE SPACES         TO HIERKEY OF CC-REC.
           STRING EQP-NUMB WS-SUB0
               DELIMITED BY SIZE INTO HIERKEY OF CC-REC.
           START CORP-CODE-LINK KEY = HIERKEY OF CC-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (53)
               MOVE "Y"        TO PARTS-SW.

           MOVE F-VAL          TO IND (54).
           MOVE "N"            TO DRWFIL-SW.

           MOVE WS-EQPNUM      TO DRWEQPNUM OF DFE-REC.
           MOVE WS-SUB0        TO DRWSUBSYS OF DFE-REC.
           START DRAWING-FILE-E
                 KEY = DRWEQPNUM OF DFE-REC DRWSUBSYS OF DFE-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (54)
               MOVE "Y"        TO DRWFIL-SW.

           MOVE CORP-TYPE      TO DRWTYPNUM OF DFT-REC.
           MOVE WS-SUB0        TO DRWSUBSYS OF DFT-REC.
           START DRAWING-FILE-T
                 KEY = DRWTYPNUM OF DFT-REC DRWSUBSYS OF DFT-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE T-VAL      TO IND (54)
               MOVE "Y"        TO DRWFIL-SW.

           PERFORM LOCATE-DATA VARYING S2 FROM 1 BY 1 UNTIL S2 > 9.

       LIST-SUBSYSTEM-EXIT.    EXIT.

       LOCATE-DATA.
           MOVE SPACES         TO EQRSUBKEY OF EREF-REC.
           STRING WS-EQPNUM SCREEN-SUBSYS (S2)
            DELIMITED BY SIZE  INTO EQRSUBKEY OF EREF-REC.
           START EQP-REFERENCE KEY = EQRSUBKEY OF EREF-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "4"        TO REF-BYTE (S2)
           ELSE
               MOVE " "        TO REF-BYTE (S2).

           MOVE " "            TO REM-BYTE (S2).

           MOVE SPACES         TO EQRSUBKEY OF REM-REC.
           STRING WS-EQPNUM SCREEN-SUBSYS (S2)
            DELIMITED BY SIZE  INTO EQRSUBKEY OF REM-REC.
           START EQP-REMARKS   KEY = EQRSUBKEY OF REM-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "5"        TO REM-BYTE (S2).

           MOVE SPACES         TO EQRTYSUBK OF TREM-REC.
           STRING CORP-TYPE SCREEN-SUBSYS (S2)
             DELIMITED BY SIZE INTO EQRTYSUBK OF TREM-REC.
           START TYPE-REMARKS  KEY = EQRTYSUBK OF TREM-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "5"        TO REM-BYTE (S2).

           MOVE " "            TO OPR-BYTE (S2).

           MOVE SPACES         TO EQRSUBKEY OF OPS-REC.
           STRING WS-EQPNUM SCREEN-SUBSYS (S2)
               DELIMITED BY SIZE INTO EQRSUBKEY OF OPS-REC.
           START EQP-OPERATIONS KEY = EQRSUBKEY OF OPS-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "6"        TO OPR-BYTE (S2).

           MOVE SPACES         TO EQRTYSUBK OF TOPS-REC.
           STRING CORP-TYPE SCREEN-SUBSYS (S2)
                DELIMITED BY SIZE INTO EQRTYSUBK OF TOPS-REC.
           START TYPE-OPERATIONS KEY = EQRTYSUBK OF TOPS-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "6"        TO OPR-BYTE (S2).

           MOVE " "            TO SPR-BYTE (S2).
           MOVE SPACES         TO HIERKEY OF CC-REC.
           STRING CORP-TYPE SCREEN-SUBSYS (S2)
               DELIMITED BY SIZE INTO HIERKEY OF CC-REC.
           START CORP-CODE-LINK KEY = HIERKEY OF CC-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "7"        TO SPR-BYTE (S2).

           MOVE SPACES         TO HIERKEY OF CC-REC.
           STRING EQP-NUMB SCREEN-SUBSYS (S2)
               DELIMITED BY SIZE INTO HIERKEY OF CC-REC.
           START CORP-CODE-LINK KEY = HIERKEY OF CC-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "7"        TO SPR-BYTE (S2).

           MOVE " "            TO DRW-BYTE (S2).

           MOVE WS-EQPNUM      TO DRWEQPNUM OF DFE-REC.
           MOVE SCREEN-SUBSYS (S2) TO DRWSUBSYS OF DFE-REC.
           START DRAWING-FILE-E
                 KEY = DRWEQPNUM OF DFE-REC DRWSUBSYS OF DFE-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "8"        TO DRW-BYTE (S2).

           MOVE CORP-TYPE      TO DRWTYPNUM OF DFT-REC.
           MOVE SCREEN-SUBSYS (S2) TO DRWSUBSYS OF DFT-REC.
           START DRAWING-FILE-T
                 KEY = DRWTYPNUM OF DFT-REC DRWSUBSYS OF DFT-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "8"        TO DRW-BYTE (S2).

       LOAD-PARENT-DESC.
           MOVE SPACES         TO WS-DESC0.
           IF WS-SUB0 = "0000"
               GO TO LOAD-PARENT-EXIT.
           MOVE SPACES         TO SUBSYS-KEY OF SUBSYSBUF.
           MOVE CORP-TYPE      TO SUBSYS-TYPE OF SUBSYSBUF.
           MOVE WS-SUB0        TO PARENT-KEY.
           PERFORM CAL-PARENT-KEY.
           MOVE PARENT-KEY     TO SUBSYS-PARENT-NUM OF SUBSYSBUF.
           MOVE SUBSYS-KEY OF SUBSYSBUF TO HIERKEY OF HEIR-REC.
           START WO-EQUIP-HIER
                 KEY IS EQUAL HIERKEY OF HEIR-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO LOAD-PARENT-EXIT.
           MOVE "N"            TO STOP-READ.
           PERFORM READ-PARENT THRU READ-PARENT-EXIT
                               UNTIL STOP-READ = "Y".

       LOAD-PARENT-EXIT.    EXIT.

       CAL-PARENT-KEY.
           IF PK2 = 0
               MOVE 0          TO PK1
           ELSE
           IF PK3 = 0
               MOVE 0          TO PK2
           ELSE
           IF PK4 = 0
               MOVE 0          TO PK3
           ELSE
               MOVE 0          TO PK4.

       READ-PARENT.
           READ WO-EQUIP-HIER  NEXT RECORD INTO SUBSYSBUF
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO READ-PARENT-EXIT.
           IF SUBSYS-PARENT-NUM OF SUBSYSBUF NOT = PARENT-KEY
           OR SUBSYS-TYPE OF SUBSYSBUF NOT = CORP-TYPE
               MOVE "Y"        TO STOP-READ
               GO TO READ-PARENT-EXIT.
           IF SUBSYS-CHILD-NUM OF SUBSYSBUF = WS-SUB0
               MOVE SUBSYS-DESC OF SUBSYSBUF TO WS-DESC0.

       READ-PARENT-EXIT.    EXIT.

       LOAD-DESCS.
           MOVE SPACES         TO SUBSYS-KEY OF SUBSYSBUF.
           MOVE CORP-TYPE      TO SUBSYS-TYPE OF SUBSYSBUF.
           MOVE WS-SUB0        TO SUBSYS-PARENT-NUM OF SUBSYSBUF.
           MOVE SUBSYS-KEY OF SUBSYSBUF TO HIERKEY OF HEIR-REC.
           START WO-EQUIP-HIER
               KEY IS EQUAL HIERKEY OF HEIR-REC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO LOAD-DESCS-EXIT.
           MOVE "N"            TO STOP-READ.
           PERFORM READ-SUBS THRU READ-SUBS-EXIT UNTIL STOP-READ = "Y".

       LOAD-DESCS-EXIT.    EXIT.

       READ-SUBS.
           READ WO-EQUIP-HIER  NEXT RECORD INTO SUBSYSBUF
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "Y"        TO STOP-READ
               GO TO READ-SUBS-EXIT.
           IF SUBSYS-PARENT-NUM OF SUBSYSBUF NOT = WS-SUB0
           OR SUBSYS-TYPE OF SUBSYSBUF NOT = CORP-TYPE
               MOVE "Y"        TO STOP-READ
               GO TO READ-SUBS-EXIT.
           PERFORM FILL-DESC VARYING S1 FROM 1 BY 1 UNTIL S1 > 9.

       READ-SUBS-EXIT.    EXIT.

       INIT-DESC.
           MOVE SPACES         TO SCREEN-DESC (S1).

       FILL-DESC.
           IF SCREEN-SUBSYS (S1) = SUBSYS-CHILD-NUM OF SUBSYSBUF
               MOVE SUBSYS-DESC OF SUBSYSBUF TO SCREEN-DESC  (S1)
               MOVE 10         TO S1.

       CAL-SUBS.
           IF WS-SUB0 = "0000"
             MOVE "1000"       TO SCREEN-SUBSYS (1)
             MOVE "2000"       TO SCREEN-SUBSYS (2)
             MOVE "3000"       TO SCREEN-SUBSYS (3)
             MOVE "4000"       TO SCREEN-SUBSYS (4)
             MOVE "5000"       TO SCREEN-SUBSYS (5)
             MOVE "6000"       TO SCREEN-SUBSYS (6)
             MOVE "7000"       TO SCREEN-SUBSYS (7)
             MOVE "8000"       TO SCREEN-SUBSYS (8)
             MOVE "9000"       TO SCREEN-SUBSYS (9)
             MOVE 10           TO S1
             GO TO CAL-SUBS-EXIT.

           MOVE EDIT-SUBSYS    TO SCREEN-SUBSYS (S1).
           IF SS-B2 (S1) = 0   ADD S1 TO SS-B2 (S1)
           ELSE
           IF SS-B3 (S1) = 0   ADD S1 TO SS-B3 (S1)
           ELSE
           IF SS-B4 (S1) = 0   ADD S1 TO SS-B4 (S1)
           ELSE
           MOVE SPACES         TO SCREEN-SUBSYS (S1).

       CAL-SUBS-EXIT.    EXIT.

