       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEQTPCPY.
       AUTHOR.                 P.D. RAGLOW.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
      *C****************************************************************
      *C  WDR  04/25/94
      *C  DELETED ALL REFERENCES TO PORTABILITY MODE COPYLIBS
      *C****************************************************************

       COPY SPECIALN           IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TYPE-REF-TS-O
                  ASSIGN       TO DATABASE-MCFLER0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT TYPE-REM-TS-O
                  ASSIGN       TO DATABASE-MCFLER0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT TYPE-OPS-TS-O
                  ASSIGN       TO DATABASE-MCFLER0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT DRAWING-FL-TN-O
                  ASSIGN       TO DATABASE-MCFLDF0104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STATUS.

           SELECT CC-LINK-HK-O
                  ASSIGN       TO DATABASE-MCFLMM2101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT CC-NOTE-MS-NK-O
                  ASSIGN       TO DATABASE-MCFLMM2201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT.

           SELECT WO-LAST-NM-LW-I
                  ASSIGN       TO DATABASE-MCFLMM0801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STATUS.

           SELECT FLAT-FILE
                  ASSIGN       TO DISK-DEQTXTAB.

           SELECT TEMP-TABLE
                  ASSIGN       TO DISK-DEQTPCPY.

       DATA DIVISION.
       FILE SECTION.
       FD  TYPE-REF-TS-O
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REF-TS-REC-O.
           COPY DDS-MCRPER0200  OF MCFLER0201.

       FD  TYPE-REM-TS-O
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REM-TS-REC-O.
           COPY DDS-MCRPER0400  OF MCFLER0401.

       FD  TYPE-OPS-TS-O
           LABEL RECORDS ARE STANDARD.
       01  TYPE-OPS-TS-REC-O.
           COPY DDS-MCRPER0600  OF MCFLER0601.

       FD  DRAWING-FL-TN-O
           LABEL RECORDS ARE STANDARD.
       01  DRAWING-FL-TN-REC-O.
           COPY DDS-MCRPDF0100  OF MCFLDF0104.

       FD  CC-LINK-HK-O
           LABEL RECORDS ARE STANDARD.
       01  CC-LINK-HK-REC-O.
           COPY DDS-MCRPMM2100  OF MCFLMM2101.

       FD  CC-NOTE-MS-NK-O
           LABEL RECORDS ARE STANDARD.
       01  CC-NOTE-MS-NK-REC-O.
           COPY DDS-MCRPMM2200  OF MCFLMM2201.

       FD  WO-LAST-NM-LW-I
           LABEL RECORDS ARE STANDARD.
       01  WO-LAST-NM-LW-REC-I.
           COPY DDS-MCRPMM0800  OF MCFLMM0801.

       FD  PRINT-FILE
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                PIC X(132).

       FD  FLAT-FILE
           DATA RECORD IS FLAT-REC.
       01  FLAT-REC         PIC X(80).

       FD  TEMP-TABLE
           DATA RECORD IS TEMP-REC.
       01  TEMP-REC         PIC X(804).

       WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG                PIC X    VALUE "Y".
       77  EOF-FLAG                          PIC X    VALUE "N".
       77  CNTR1                             PIC 99   VALUE 00.
       77  CNTR2                             PIC 9999 VALUE 00.
       77  LINE-CNT                          PIC 99   VALUE 00.
       77  SUB-HOLD                          PIC XXXX VALUE SPACES.
       77  SUBLVL-FOUND                      PIC X    VALUE "N".
       77  TEMP-TABLE-IND                    PIC X    VALUE "N".


       COPY FILESTAT           IN COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

      *
      * DATABASE AREA
      *

       COPY DATAB              IN COPYLIB.

       01  MMISA                    PIC X(24)   VALUE "  MMISA;".
       01  EQPREF                   PIC X(24)   VALUE "  EQPREF;".
       01  DRWFIL                   PIC X(24)   VALUE "  DRWFIL;".

       01  PASSWORD-MMISA           PIC X(24)   VALUE "DO-ALL;".
       01  PASSWORD-EQPREF          PIC X(24)   VALUE "DO-ALL;".
       01  PASSWORD-DRWFIL          PIC X(24)   VALUE "DO-ALL;".

       01  ALL-ITEMS                PIC XX      VALUE "@;".

       01  ARGUMENTS  VALUE SPACES.
           05  HIER-KEY-ARG.
               10  HKA-TYPE       PIC X(8).
               10  HKA-SUB.
                   15  HKA-SUB1   PIC X.
                   15  HKA-SUB2   PIC X.
                   15  HKA-SUB3   PIC X.
                   15  HKA-SUB4   PIC X.
               10  FILLER         PIC XX.
           05  TYPE-SUB-ARG.
               10  TSA-TYPE       PIC X(8).
               10  TSA-SUB        PIC X(4).
           05  TYPE-NUM-ARG       PIC X(8).
           05  LAST-WONUM-ARG     PIC X(6).
           05  NOTE-KEY-ARG.
               10 NK-TYPE            PIC X(8).
               10 NK-SUB             PIC X(4).
               10 FILLER             PIC X(2).
               10 NK-CODE            PIC X(8).

       01  SEARCH-FIELDS.
           05  HIER-KEY-SEARCH    PIC X(16)  VALUE "HIER-KEY;".
           05  NOTE-KEY-SEARCH    PIC X(16)  VALUE "NOTE-KEY;".
           05  TYPE-SUB-SEARCH    PIC X(16)  VALUE "TYPE-SUB-KEY;".
           05  TYPE-NUM-SEARCH    PIC X(16)  VALUE "TYPE-NUM;".
           05  LAST-WONUM-SEARCH  PIC X(16)  VALUE "LAST-WO-NUM;".

       01  DATASET-NAMES.
           05  DSET-TYPE-REF      PIC X(16)  VALUE "TYPE-REFERENCE;".
           05  DSET-TYPE-REM      PIC X(16)  VALUE "TYPE-REMARKS;".
           05  DSET-TYPE-OPS      PIC X(16)  VALUE "TYPE-OPERATIONS;".
           05  DSET-DRAWING-FL    PIC X(16)  VALUE "DRAWING-FILE;".
           05  DSET-WO-EQUIP-H    PIC X(16)  VALUE "WO-EQUIP-HIER;".
           05  DSET-CC-LINK       PIC X(16)  VALUE "CORP-CODE-LINK;".
           05  DSET-CC-NOTE-MS    PIC X(16)  VALUE "CC-NOTE-MSTR;".
           05  DSET-WO-LAST-NM    PIC X(17)  VALUE "WO-LAST-NUM-USED;".
           05  FILLER             PIC X      VALUE SPACE.
           05  DSET-NAME          PIC X(17)  VALUE SPACES.

       01  HOLDING-TABLE  VALUE SPACES.
           05  HT-DATA    OCCURS 20 TIMES.
               10  HT-KEY.
                   15  HT-TYPE        PIC X(8).
                   15  HT-SUBSYSTEM   PIC X(4).
               10  FILLER             PIC X(792).
       01  HOLDING-TABLE2 REDEFINES HOLDING-TABLE.
           05  HT2-DATA     OCCURS 50 TIMES.
               10  FILLER             PIC X(86).
               10  HT-DF-KEY          PIC X(8).
               10  FILLER             PIC X(98).
           05  FILLER                 PIC X(360).
       01  HOLDING-TABLE3 REDEFINES HOLDING-TABLE.
           05  HT3-DATA      OCCURS 370 TIMES.
               10  HT3-KEY.
                   15  HT3-TYPE       PIC X(8).
                   15  HT3-SUBSYSTEM  PIC X(4).
               10  FILLER             PIC X(10).
           05  FILLER                 PIC X(10).

       01  CODE-TABLE  VALUE SPACES.
           05  CODE-ITEM OCCURS 300 TIMES INDEXED BY CTX.
               10  CT-CORP-CODE    PIC X(8).

      *
      * PRINT FILE AREA
      *
       01  HEADER1.
           05  FILLER      PIC X(40)    VALUE "TEQTPCPY".
           05  FILLER      PIC X(60)    VALUE "EQUIPMENT SUBSYSTEM BREAK
      -       "DOWN - COPY FUNCTION".
           05  FILLER      PIC X(6)     VALUE "DATE:".
           05  H1-DATE     PIC X(8)     VALUE SPACES.
           05  FILLER      PIC X(10)    VALUE SPACES.
           05  FILLER      PIC X(5)     VALUE "PAGE".
           05  H1-PAGE     PIC 99       VALUE ZEROES.

       01  HEADER2.
           05  FILLER      PIC X(55)    VALUE SPACES.
           05  FILLER      PIC X(45)    VALUE "AUDIT REPORT".
           05  FILLER      PIC X(6)     VALUE "TIME:".
           05  H2-TIME     PIC X(8)     VALUE SPACES.

       01  HEADER3.
           05  FILLER      PIC X(11)    VALUE "FROM TYPE #".
           05  H3-FRTYPE   PIC X(12)    VALUE SPACES.
           05  FILLER      PIC X(15)    VALUE "FROM SUBSYSTEM".
           05  H3-FRSUB    PIC X(4)     VALUE SPACES.
           05  FILLER      PIC X(10)    VALUE SPACES.
           05  FILLER      PIC X(9)    VALUE "TO TYPE #".
           05  H3-TOTYPE   PIC X(12)    VALUE SPACES.
           05  FILLER      PIC X(13)    VALUE "TO SUBSYSTEM".
           05  H3-TOSUB    PIC X(4)     VALUE SPACES.
           05  FILLER      PIC X(10)    VALUE SPACES.

       01  HEADER4.
           05  FILLER      PIC X(19)    VALUE "FILE NAME".
           05  FILLER      PIC X(20)   VALUE "DATA RECORDS COPIED".

       01  HEADER5.
           05  FILLER      PIC X(19)    VALUE "---------".
           05  FILLER      PIC X(20)   VALUE "-------------------".

       01  PRINT-LINE.
           05  PL-FILE     PIC X(16)   VALUE SPACES.
           05  FILLER      PIC XXX     VALUE " -".
           05  PL-RECORD   PIC X(113)  VALUE SPACES.

       COPY CCRTFILE           IN COPYLIB.

       COPY TDATECHK           IN COPYLIB.

       COPY FUNCTDEF           IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       COPY VCOMAREA           IN COPYLIB.

       COPY COMMAND            IN COPYLIB.

       COPY OVRPFDAT           IN COPYLIB.

       COPY HMSGBUF            IN COPYLIB.

       01  BUF-FLAT  VALUE SPACES.
           05  FR-PLANT    PIC XXX.
           05  FR-FRTYPE   PIC X(8).
           05  FR-FRSUB    PIC XXXX.
           05  FR-TOTYPE   PIC X(8).
           05  FR-TOSUB    PIC XXXX.
           05  FR-DATE     PIC X(8).
           05  FR-TIME     PIC X(8).
           05  FILLER      PIC X(37).

       01  BUF-CORP-CODE.
       COPY DCCLINK            IN COPYLIB.

       01  BUF-CC-NOTE-MSTR.
       COPY MCCNOTE            IN COPYLIB.

       01  BUF-DRAWING-FILE.
       COPY DDRAWFIL           IN COPYLIB.

       01  BUF-LAST-NUM-USED.
       COPY MLASTWO            IN COPYLIB.

       COPY MTYPEREF           IN COPYLIB.

       COPY DTYPEREM           IN COPYLIB.

       COPY DTYPEOPS           IN COPYLIB.

       01  ACCEPT-FIELDS  VALUE SPACES.
           05  EQP-REF-OPT           PIC X.
           05  DRW-FIL-OPT           PIC X.
           05  SPR-PRT-OPT           PIC X.
           05  FROM-TYPE             PIC X(8).
           05  TO-TYPE               PIC X(8).
           05  ACCEPT-TABLE.
               10  FILLER    OCCURS 20 TIMES.
                   15  ACCEPT-ITEM.
                       20  FR-LVL        PIC XXXX.
                       20  FILLER        PIC X(23).
                       20  TO-LVL        PIC XXXX.
                       20  FILLER        PIC X(23).

       PROCEDURE DIVISION.
       MAIN-LINE-LOGIC.
           ACCEPT OVRPRTF-TOFILE-NUM.
           ACCEPT EQP-REF-OPT.
           ACCEPT DRW-FIL-OPT.
           ACCEPT SPR-PRT-OPT.
           ACCEPT FROM-TYPE.
           ACCEPT TO-TYPE.
           ACCEPT ACCEPT-ITEM(1).
           ACCEPT ACCEPT-ITEM(2).
           ACCEPT ACCEPT-ITEM(3).
           ACCEPT ACCEPT-ITEM(4).
           ACCEPT ACCEPT-ITEM(5).
           ACCEPT ACCEPT-ITEM(6).
           ACCEPT ACCEPT-ITEM(7).
           ACCEPT ACCEPT-ITEM(8).
           ACCEPT ACCEPT-ITEM(9).
           ACCEPT ACCEPT-ITEM(10).
           DISPLAY OVRPRTF-TOFILE-NUM.
           DISPLAY EQP-REF-OPT DRW-FIL-OPT SPR-PRT-OPT.
           DISPLAY FROM-TYPE TO-TYPE.
           DISPLAY ACCEPT-ITEM(1).
           DISPLAY ACCEPT-ITEM(2).
           DISPLAY ACCEPT-ITEM(3).
           DISPLAY ACCEPT-ITEM(4).
           DISPLAY ACCEPT-ITEM(5).
           DISPLAY ACCEPT-ITEM(6).
           DISPLAY ACCEPT-ITEM(7).
           DISPLAY ACCEPT-ITEM(8).
           DISPLAY ACCEPT-ITEM(9).
           DISPLAY ACCEPT-ITEM(10).

           PERFORM 996-OVERRIDE-PRINT-FILE.
           MOVE 0 TO H1-PAGE.
           MOVE 67 TO LINE-CNT.
           MOVE FROM-TYPE TO H3-FRTYPE.
           MOVE TO-TYPE   TO H3-TOTYPE.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-FORMATTED-TIME-OUT TO H2-TIME.
           MOVE DATE-SLASH-OUT     TO H1-DATE.
           OPEN OUTPUT PRINT-FILE.
           MOVE "*CURLIB"  TO CCRTFILE-LIBRARY.
           MOVE "DEQTXTAB" TO CCRTFILE-FILE.
           MOVE  80        TO CCRTFILE-RECORD-LENGTH.
           MOVE 10000      TO CCRTFILE-NO-RECORDS.
           MOVE 2000       TO CCRTFILE-INCREMENT-AMT.
           MOVE 20         TO CCRTFILE-NO-INCREMENTS.
           MOVE 0          TO CCRTFILE-STATUS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                 CCRTFILE-FILE
                                 CCRTFILE-RECORD-LENGTH
                                 CCRTFILE-NO-RECORDS
                                 CCRTFILE-INCREMENT-AMT
                                 CCRTFILE-NO-INCREMENTS
                                 CCRTFILE-STATUS.

           IF EQP-REF-OPT = "Y"
               PERFORM 10-COPY-EQP-REF
           END-IF.

           IF DRW-FIL-OPT = "Y"
               PERFORM 20-COPY-DRW-FIL
           END-IF.

           IF SPR-PRT-OPT = "Y"
               PERFORM 30-COPY-SPR-PRT
           END-IF.

           PERFORM 40-WRITE-FLAT-FILE.

       END-PROCESSES.
           CLOSE               PRINT-FILE.
           GOBACK.

      ****************************************************************
      *PARAGRAPH NAME : 04-PRINT-RTN.                                *
      *PURPOSE : TO PRINT THE AUDIT TRAIL.                           *
      ****************************************************************
       04-PRINT-RTN.
           IF LINE-CNT > 66
             PERFORM 05-HEADER-ROUTINE
           END-IF
           IF FR-LVL(CNTR1) NOT = H3-FRSUB
             IF LINE-CNT > 62
               PERFORM 05-HEADER-ROUTINE
             ELSE
               MOVE FR-LVL(CNTR1) TO H3-FRSUB
               MOVE TO-LVL(CNTR1) TO H3-TOSUB
               WRITE PRINT-REC FROM HEADER3 AFTER 2
               WRITE PRINT-REC FROM HEADER4 AFTER 1
               WRITE PRINT-REC FROM HEADER5 AFTER 1
               ADD 4 TO LINE-CNT
             END-IF
           END-IF
           WRITE PRINT-REC FROM PRINT-LINE  AFTER 1
           ADD 1 TO LINE-CNT.

      ****************************************************************
      *PARAGRAPH NAME : 05-HEADER-ROUTINE.                           *
      *PURPOSE : TO PRINT THE AUDIT TRAIL HEADER.                    *
      ****************************************************************
       05-HEADER-ROUTINE.
           IF FR-LVL(CNTR1) NOT = H3-FRSUB
             MOVE FR-LVL(CNTR1) TO H3-FRSUB
             MOVE TO-LVL(CNTR1) TO H3-TOSUB
           END-IF.
           ADD 1 TO H1-PAGE.
           WRITE PRINT-REC FROM HEADER1 AFTER ADVANCING PAGE.
           WRITE PRINT-REC FROM HEADER2 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM HEADER3 AFTER ADVANCING 2.
           WRITE PRINT-REC FROM HEADER4 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM HEADER5 AFTER ADVANCING 1.
           MOVE 5 TO LINE-CNT.

      ****************************************************************
      *PARAGRAPH NAME : 10-COPY-EQP-REF.                             *
      *PURPOSE : TO COPY INFORMATION TO THE NEW TYPE - SUBSYSTEM.    *
      ****************************************************************
       10-COPY-EQP-REF.
           OPEN I-O            TYPE-REF-TS-O.
           OPEN I-O            TYPE-REM-TS-O.
           OPEN I-O            TYPE-OPS-TS-O.
           MOVE 1              TO CNTR1.
           PERFORM UNTIL CNTR1 GREATER THAN 10
             MOVE FROM-TYPE TO TSA-TYPE
             IF FR-LVL(CNTR1) NOT = SPACES
               MOVE FR-LVL(CNTR1) TO TSA-SUB
               PERFORM 11-COPY-TO-TYPE-REF
               MOVE SPACES TO HOLDING-TABLE
               PERFORM 12-COPY-TO-TYPE-REM
               MOVE SPACES TO HOLDING-TABLE
               PERFORM 13-COPY-TO-TYPE-OPS
             END-IF
             ADD 1 TO CNTR1
           END-PERFORM.

           CLOSE               TYPE-REF-TS-O.
           CLOSE               TYPE-REM-TS-O.
           CLOSE               TYPE-OPS-TS-O.

      ****************************************************************
      *PARAGRAPH NAME : 11-COPY-TO-TYPE-REF.                         *
      *PURPOSE : TO COPY INFORMATION TO THE NEW TYPE - SUBSYSTEM.    *
      ****************************************************************
       11-COPY-TO-TYPE-REF.
           PERFORM 9999-GETKEY-TYPE-REF-TS-O.
           IF COND-WORD = 0
             MOVE TO-TYPE       TO TSA-TYPE TSK-EQUIP OF BUF-TYPE-REF
             MOVE TO-LVL(CNTR1) TO TSA-SUB  TSK-SUB OF BUF-TYPE-REF
             MOVE EQPREF        TO BASE
             MOVE DSET-TYPE-REF TO DSET-NAME
             MOVE DSET-TYPE-REF TO PL-FILE
             MOVE BUF-TYPE-REF TO PL-RECORD
             PERFORM 04-PRINT-RTN
             MOVE "N" TO HANDLE-BLOWUP-FLAG
             PERFORM 9999-DSET-LOCK
             PERFORM 9999-PUT-TYPE-REF-TS-O
             PERFORM 9999-UNLOCK
             MOVE "Y" TO HANDLE-BLOWUP-FLAG
           END-IF.

      ****************************************************************
      *PARAGRAPH NAME : 12-COPY-TO-TYPE-REM.                         *
      *PURPOSE : TO COPY INFORMATION TO THE NEW TYPE - SUBSYSTEM.    *
      ****************************************************************
       12-COPY-TO-TYPE-REM.
           MOVE FROM-TYPE TO TSA-TYPE.
           MOVE FR-LVL(CNTR1) TO TSA-SUB.
           PERFORM 9999-CHAINHD-TYPE-REM-TS-O.
           PERFORM 9999-GETNEXT-TYPE-REM-TS-O.
           MOVE 1 TO CNTR2.
           PERFORM UNTIL END-OF-CHAIN OR CNTR2 > 10
             MOVE BUF-TYPE-REM  TO HT-DATA(CNTR2)
             ADD 1 TO CNTR2
             PERFORM 9999-GETNEXT-TYPE-REM-TS-O
           END-PERFORM.
      *******************************************************************
      *   IF THERE ARE MORE RECORDS THAN HOLDING-TABLE CAN HOLD, CREATE *
      *   A TEMPORARY FILE TO HOLD THE OVERFLOW.                        *
      *******************************************************************
           IF NOT END-OF-CHAIN
             MOVE "QTEMP"    TO CCRTFILE-LIBRARY
             MOVE "DEQTPCPY" TO CCRTFILE-FILE
             MOVE  804       TO CCRTFILE-RECORD-LENGTH
             MOVE  400       TO CCRTFILE-NO-RECORDS
             MOVE   50       TO CCRTFILE-INCREMENT-AMT
             MOVE    3       TO CCRTFILE-NO-INCREMENTS
             MOVE    0       TO CCRTFILE-STATUS
             CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                   CCRTFILE-FILE
                                   CCRTFILE-RECORD-LENGTH
                                   CCRTFILE-NO-RECORDS
                                   CCRTFILE-INCREMENT-AMT
                                   CCRTFILE-NO-INCREMENTS
                                   CCRTFILE-STATUS
             OPEN OUTPUT TEMP-TABLE
             MOVE "Y" TO TEMP-TABLE-IND
             PERFORM UNTIL END-OF-CHAIN
               WRITE TEMP-REC   FROM BUF-TYPE-REM
               PERFORM 9999-GETNEXT-TYPE-REM-TS-O
             END-PERFORM
             CLOSE TEMP-TABLE
             OPEN INPUT TEMP-TABLE
           END-IF.
           MOVE 1 TO CNTR2.
           MOVE EQPREF        TO BASE.
           MOVE DSET-TYPE-REM TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           PERFORM UNTIL HT-KEY(CNTR2) = SPACES OR CNTR2 > 10
             MOVE HT-DATA(CNTR2) TO BUF-TYPE-REM
             MOVE TO-TYPE TO TSK-EQUIP OF BUF-TYPE-REM
             MOVE TO-LVL(CNTR1) TO TSK-SUB OF BUF-TYPE-REM
             MOVE DSET-TYPE-REM TO PL-FILE
             MOVE BUF-TYPE-REM TO PL-RECORD
             PERFORM 04-PRINT-RTN
             PERFORM 9999-PUT-TYPE-REM-TS-O
             ADD 1 TO CNTR2
           END-PERFORM.
           MOVE 0 TO COND-WORD.
           IF TEMP-TABLE-IND = "Y"
             MOVE "N" TO TEMP-TABLE-IND  EOF-FLAG
             READ TEMP-TABLE INTO BUF-TYPE-REM
                       AT END MOVE "Y" TO EOF-FLAG
             END-READ
             PERFORM UNTIL EOF-FLAG = "Y"
               MOVE TO-TYPE TO TSK-EQUIP OF BUF-TYPE-REM
               MOVE TO-LVL(CNTR1) TO TSK-SUB OF BUF-TYPE-REM
               MOVE DSET-TYPE-REM TO PL-FILE
               MOVE BUF-TYPE-REM TO PL-RECORD
               PERFORM 04-PRINT-RTN
               PERFORM 9999-PUT-TYPE-REM-TS-O
               READ TEMP-TABLE INTO BUF-TYPE-REM
                       AT END MOVE "Y" TO EOF-FLAG
               END-READ
             END-PERFORM
             CLOSE TEMP-TABLE
           END-IF.
           PERFORM 9999-UNLOCK.

      ****************************************************************
      *PARAGRAPH NAME : 13-COPY-TO-TYPE-OPS.                         *
      *PURPOSE : TO COPY INFORMATION TO THE NEW TYPE - SUBSYSTEM.    *
      ****************************************************************
       13-COPY-TO-TYPE-OPS.
           MOVE FROM-TYPE TO TSA-TYPE.
           MOVE FR-LVL(CNTR1) TO TSA-SUB.
           PERFORM 9999-CHAINHD-TYPE-OPS-TS-O.
           PERFORM 9999-GETNEXT-TYPE-OPS-TS-O.
           MOVE 1 TO CNTR2.
           PERFORM UNTIL END-OF-CHAIN OR CNTR2 > 10
             MOVE BUF-TYPE-OPS  TO HT-DATA(CNTR2)
             ADD 1 TO CNTR2
             PERFORM 9999-GETNEXT-TYPE-OPS-TS-O
           END-PERFORM.
      *******************************************************************
      *   IF THERE ARE MORE RECORDS THAN HOLDING-TABLE CAN HOLD, CREATE *
      *   A TEMPORARY FILE TO HOLD THE OVERFLOW.                        *
      *******************************************************************
           IF NOT END-OF-CHAIN
             MOVE "QTEMP"    TO CCRTFILE-LIBRARY
             MOVE "DEQTPCPY" TO CCRTFILE-FILE
             MOVE  804       TO CCRTFILE-RECORD-LENGTH
             MOVE  400       TO CCRTFILE-NO-RECORDS
             MOVE   50       TO CCRTFILE-INCREMENT-AMT
             MOVE    3       TO CCRTFILE-NO-INCREMENTS
             MOVE    0       TO CCRTFILE-STATUS
             CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                   CCRTFILE-FILE
                                   CCRTFILE-RECORD-LENGTH
                                   CCRTFILE-NO-RECORDS
                                   CCRTFILE-INCREMENT-AMT
                                   CCRTFILE-NO-INCREMENTS
                                   CCRTFILE-STATUS
             OPEN OUTPUT TEMP-TABLE
             MOVE "Y" TO TEMP-TABLE-IND
             PERFORM UNTIL END-OF-CHAIN
               WRITE TEMP-REC   FROM BUF-TYPE-OPS
               PERFORM 9999-GETNEXT-TYPE-OPS-TS-O
             END-PERFORM
             CLOSE TEMP-TABLE
             OPEN INPUT TEMP-TABLE
           END-IF.

           MOVE 1 TO CNTR2.
           MOVE EQPREF        TO BASE.
           MOVE DSET-TYPE-OPS TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           PERFORM UNTIL HT-KEY(CNTR2) = SPACES OR CNTR2 > 10
             MOVE HT-DATA(CNTR2) TO BUF-TYPE-OPS
             MOVE TO-TYPE TO TSK-EQUIP OF BUF-TYPE-OPS
             MOVE TO-LVL(CNTR1) TO TSK-SUB OF BUF-TYPE-OPS
             MOVE DSET-TYPE-OPS TO PL-FILE
             MOVE BUF-TYPE-OPS TO PL-RECORD
             PERFORM 04-PRINT-RTN
             PERFORM 9999-PUT-TYPE-OPS-TS-O
             ADD 1 TO CNTR2
           END-PERFORM.
           IF TEMP-TABLE-IND = "Y"
             MOVE "N" TO TEMP-TABLE-IND  EOF-FLAG
             READ TEMP-TABLE INTO BUF-TYPE-OPS
                       AT END MOVE "Y" TO EOF-FLAG
             END-READ
             PERFORM UNTIL EOF-FLAG = "Y"
               MOVE TO-TYPE TO TSK-EQUIP OF BUF-TYPE-OPS
               MOVE TO-LVL(CNTR1) TO TSK-SUB OF BUF-TYPE-OPS
               MOVE DSET-TYPE-OPS TO PL-FILE
               MOVE BUF-TYPE-OPS TO PL-RECORD
               PERFORM 04-PRINT-RTN
               PERFORM 9999-PUT-TYPE-OPS-TS-O
               READ TEMP-TABLE INTO BUF-TYPE-OPS
                       AT END MOVE "Y" TO EOF-FLAG
               END-READ
             END-PERFORM
             CLOSE TEMP-TABLE
           END-IF.
           PERFORM 9999-UNLOCK.

      ****************************************************************
      *PARAGRAPH NAME : 20-COPY-DRW-FIL.                             *
      *PURPOSE : TO COPY DRAWING FILE INFO TO NEW TYPE - SUBSYSTEM   *
      *                                                              *
      ****************************************************************
       20-COPY-DRW-FIL.
           OPEN I-O            DRAWING-FL-TN-O.
           MOVE 1              TO CNTR1.
           PERFORM UNTIL CNTR1 GREATER THAN 10
             MOVE SPACES TO HOLDING-TABLE
             IF FR-LVL(CNTR1) NOT = SPACES
               MOVE FROM-TYPE TO TYPE-NUM-ARG
               PERFORM 9999-CHAINHD-DRAWING-FL-TN-O
               PERFORM 9999-GETNEXT-DRAWING-FL-TN-O
               MOVE 1 TO CNTR2
               PERFORM UNTIL END-OF-CHAIN OR CNTR2 > 40
                 IF DRAW-SUBSYS = FR-LVL(CNTR1)
                   MOVE BUF-DRAWING-FILE TO HT2-DATA(CNTR2)
                   ADD 1 TO CNTR2
                 END-IF
                 PERFORM 9999-GETNEXT-DRAWING-FL-TN-O
               END-PERFORM
      *******************************************************************
      *   IF THERE ARE MORE RECORDS THAN HOLDING-TABLE CAN HOLD, CREATE *
      *   A TEMPORARY FILE TO HOLD THE OVERFLOW.                        *
      *******************************************************************
               IF NOT END-OF-CHAIN
                 MOVE "QTEMP"    TO CCRTFILE-LIBRARY
                 MOVE "DEQTPCPY" TO CCRTFILE-FILE
                 MOVE  804       TO CCRTFILE-RECORD-LENGTH
                 MOVE  400       TO CCRTFILE-NO-RECORDS
                 MOVE   50       TO CCRTFILE-INCREMENT-AMT
                 MOVE    3       TO CCRTFILE-NO-INCREMENTS
                 MOVE    0       TO CCRTFILE-STATUS
                 CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                       CCRTFILE-FILE
                                       CCRTFILE-RECORD-LENGTH
                                       CCRTFILE-NO-RECORDS
                                       CCRTFILE-INCREMENT-AMT
                                       CCRTFILE-NO-INCREMENTS
                                       CCRTFILE-STATUS
                 OPEN OUTPUT TEMP-TABLE
                 MOVE "Y" TO TEMP-TABLE-IND
                 PERFORM UNTIL END-OF-CHAIN
                   IF DRAW-SUBSYS = FR-LVL(CNTR1)
                     WRITE TEMP-REC FROM BUF-DRAWING-FILE
                   END-IF
                   PERFORM 9999-GETNEXT-DRAWING-FL-TN-O
                 END-PERFORM
                 CLOSE TEMP-TABLE
                 OPEN INPUT TEMP-TABLE
               END-IF
               MOVE 1 TO CNTR2
               MOVE DRWFIL          TO BASE
               MOVE DSET-DRAWING-FL TO DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM UNTIL CNTR2 > 40 OR HT-DF-KEY(CNTR2) = SPACES
                 MOVE HT2-DATA(CNTR2) TO BUF-DRAWING-FILE
                 MOVE TO-TYPE       TO DRAW-TNUM
                 MOVE TO-LVL(CNTR1) TO DRAW-SUBSYS
                 MOVE DSET-DRAWING-FL  TO PL-FILE
                 MOVE BUF-DRAWING-FILE TO PL-RECORD
                 PERFORM 04-PRINT-RTN
                 PERFORM 9999-PUT-DRAWING-FL-TN-O
                 ADD 1 TO CNTR2
               END-PERFORM
               IF TEMP-TABLE-IND = "Y"
                 MOVE "N" TO TEMP-TABLE-IND  EOF-FLAG
                 READ TEMP-TABLE INTO BUF-DRAWING-FILE
                           AT END MOVE "Y" TO EOF-FLAG
                 END-READ
                 PERFORM UNTIL EOF-FLAG = "Y"
                   MOVE TO-TYPE          TO DRAW-TNUM
                   MOVE TO-LVL(CNTR1)    TO DRAW-SUBSYS
                   MOVE DSET-DRAWING-FL  TO PL-FILE
                   MOVE BUF-DRAWING-FILE TO PL-RECORD
                   PERFORM 04-PRINT-RTN
                   PERFORM 9999-PUT-DRAWING-FL-TN-O
                   READ TEMP-TABLE INTO BUF-DRAWING-FILE
                           AT END MOVE "Y" TO EOF-FLAG
                   END-READ
                 END-PERFORM
                 CLOSE TEMP-TABLE
               END-IF
               PERFORM 9999-UNLOCK
             END-IF
             ADD 1 TO CNTR1
           END-PERFORM.

           CLOSE               DRAWING-FL-TN-O.

      ****************************************************************
      * PARAGRAPH : 2100-BLOWUP                                      *
      * PURPOSE   : TO LOG ERROR MESSAGE AND ABORT PROGRAM           *
      ****************************************************************
       2100-BLOWUP.
           MOVE "TEQTPCPY" TO BU-PGM-NAME.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.


      ****************************************************************
      *PARAGRAPH NAME : 30-COPY-SPR-PRT.                             *
      *PURPOSE :                                                     *
      *                                                              *
      ****************************************************************
       30-COPY-SPR-PRT.
           OPEN I-O            CC-LINK-HK-O.
           OPEN I-O            CC-NOTE-MS-NK-O.

           MOVE 1              TO CNTR1.
           PERFORM UNTIL CNTR1 GREATER THAN 10
             MOVE SPACES  TO HOLDING-TABLE
             MOVE TO-TYPE TO HKA-TYPE
             IF TO-LVL(CNTR1) NOT = SPACES
               MOVE TO-LVL(CNTR1) TO HKA-SUB
               PERFORM 9999-CHAINHD-CC-LINK-HK-O
               PERFORM 9999-GETNEXT-CC-LINK-HK-O
               MOVE 1 TO CNTR2
               MOVE SPACES TO CODE-TABLE
               PERFORM UNTIL END-OF-CHAIN OR CNTR2 > 365
                 MOVE CC-LINK      TO CT-CORP-CODE(CNTR2)
                 ADD 1 TO CNTR2
                 PERFORM 9999-GETNEXT-CC-LINK-HK-O
               END-PERFORM
               MOVE FROM-TYPE TO HKA-TYPE
               MOVE FR-LVL(CNTR1) TO HKA-SUB
               PERFORM 9999-CHAINHD-CC-LINK-HK-O
               PERFORM 9999-GETNEXT-CC-LINK-HK-O
               MOVE 1 TO CNTR2
               PERFORM UNTIL END-OF-CHAIN
                 SET CTX TO 1
                 SEARCH CODE-ITEM  VARYING CTX
                   AT END MOVE BUF-CORP-CODE TO HT3-DATA(CNTR2)
                   WHEN CT-CORP-CODE(CTX) = CC-LINK
                   ADD 0 TO CNTR2
                 END-SEARCH
                 ADD 1 TO CNTR2
                 PERFORM 9999-GETNEXT-CC-LINK-HK-O
               END-PERFORM
               MOVE 1 TO CNTR2
               MOVE MMISA        TO BASE
               MOVE DSET-CC-LINK TO DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM UNTIL HT3-KEY(CNTR2) = SPACES OR CNTR2 > 365
                 MOVE HT3-DATA(CNTR2) TO BUF-CORP-CODE
                 MOVE TO-TYPE TO HKEY-TYPE OF BUF-CORP-CODE
                 MOVE TO-LVL(CNTR1) TO HKEY-SS OF BUF-CORP-CODE
                 MOVE DSET-CC-LINK   TO PL-FILE
                 MOVE BUF-CORP-CODE  TO PL-RECORD
                 PERFORM 04-PRINT-RTN
                 PERFORM 9999-PUT-CC-LINK-HK-O
                 ADD 1 TO CNTR2
               END-PERFORM
               PERFORM 9999-UNLOCK
      *****************************************************************
      *   THE FOLLOWING IS FOR COPYING THE MACHINE NOTES OVER         *
      *****************************************************************
               MOVE 1 TO CNTR2
               MOVE MMISA        TO BASE
               MOVE DSET-CC-NOTE-MS TO DSET-NAME
               PERFORM 9999-DSET-LOCK
               PERFORM UNTIL HT3-KEY(CNTR2) = SPACES OR CNTR2 > 365
                 MOVE HT3-DATA(CNTR2) TO NOTE-KEY-ARG
                 PERFORM 9999-GETKEY-CC-NOTE-MS-NK-O
                 IF GOOD-CALL
                   MOVE TO-TYPE TO NK-TYPE
                   MOVE TO-LVL(CNTR1) TO NK-SUB
                   MOVE NOTE-KEY-ARG TO NOTE-KEY
                   PERFORM 9999-PUT-CC-NOTE-MS-NK-O
                   MOVE DSET-CC-NOTE-MS  TO PL-FILE
                   MOVE BUF-CC-NOTE-MSTR TO PL-RECORD
                   PERFORM 04-PRINT-RTN
                 END-IF
                 ADD 1 TO CNTR2
               END-PERFORM
               PERFORM 9999-UNLOCK
             END-IF
             ADD 1 TO CNTR1
           END-PERFORM.

           CLOSE               CC-LINK-HK-O.
           CLOSE               CC-NOTE-MS-NK-O.

      ****************************************************************
      *PARAGRAPH NAME : 40-WRITE-FLAT-FILE.                          *
      *PURPOSE : WRITE THE RELATIONSHIPS TO THE FLAT FILE.           *
      *                                                              *
      ****************************************************************
       40-WRITE-FLAT-FILE.

           OPEN EXTEND         FLAT-FILE.
           OPEN INPUT          WO-LAST-NM-LW-I.
           PERFORM 9999-GETSER-WO-LAST-NM-LW-I.
           MOVE PLANT-IDENT                TO FR-PLANT.
           MOVE FROM-TYPE                  TO FR-FRTYPE.
           MOVE TO-TYPE                    TO FR-TOTYPE.
           MOVE DATE-YMD-OUT               TO FR-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT  TO FR-TIME.
           MOVE 1 TO CNTR1.
           PERFORM UNTIL CNTR1 GREATER THAN 10
             IF FR-LVL(CNTR1) NOT = SPACES
               MOVE FR-LVL(CNTR1)  TO FR-FRSUB
               MOVE TO-LVL(CNTR1)  TO FR-TOSUB
               WRITE FLAT-REC FROM BUF-FLAT
             END-IF
             ADD 1 TO CNTR1
           END-PERFORM.

           CLOSE               FLAT-FILE.
           CLOSE               WO-LAST-NM-LW-I.

       COPY OVRPFCAL           IN COPYLIB.

       9999-COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

       COPY DLOCKCAL           IN COPYLIB.

       COPY UNLOCK             IN COPYLIB.

       9999-GETKEY-TYPE-REF-TS-O.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-REF-TS-REC-O.
           READ TYPE-REF-TS-O INTO BUF-TYPE-REF
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-TYPE-REF-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-TYPE-REF-TS-O.
           MOVE HIGH-VALUES TO EQRTYSUBK OF TYPE-REF-TS-REC-O.
           START TYPE-REF-TS-O KEY > EQRTYSUBK OF TYPE-REF-TS-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETKEY-CC-NOTE-MS-NK-O.
           MOVE 0 TO COND-WORD.
           MOVE NOTE-KEY-ARG TO NOTEKEY OF CC-NOTE-MS-NK-REC-O.
           READ CC-NOTE-MS-NK-O INTO BUF-CC-NOTE-MSTR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-CC-NOTE-MS-NK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-CC-NOTE-MS-NK-O.
           MOVE HIGH-VALUES TO NOTEKEY OF CC-NOTE-MS-NK-REC-O.
           START CC-NOTE-MS-NK-O KEY > NOTEKEY OF CC-NOTE-MS-NK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-CHAINHD-TYPE-REM-TS-O.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-REM-TS-REC-O.
           START TYPE-REM-TS-O KEY = EQRTYSUBK OF TYPE-REM-TS-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-TYPE-REM-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-TYPE-OPS-TS-O.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-ARG TO EQRTYSUBK OF TYPE-OPS-TS-REC-O.
           START TYPE-OPS-TS-O KEY = EQRTYSUBK OF TYPE-OPS-TS-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-TYPE-OPS-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DRAWING-FL-TN-O.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-NUM-ARG TO DRWTYPNUM OF DRAWING-FL-TN-REC-O.
           START DRAWING-FL-TN-O KEY = DRWTYPNUM OF DRAWING-FL-TN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DRAWING-FL-TN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-CC-LINK-HK-O.
           MOVE 0 TO COND-WORD.
           MOVE HIER-KEY-ARG TO HIERKEY OF CC-LINK-HK-REC-O.
           START CC-LINK-HK-O KEY = HIERKEY OF CC-LINK-HK-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-CC-LINK-HK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-TYPE-REM-TS-O.
           MOVE 0 TO COND-WORD.
           READ TYPE-REM-TS-O NEXT INTO BUF-TYPE-REM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-TYPE-REM-TS-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-TYPE-REM-TS-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF EQRTYSUBK OF TYPE-REM-TS-REC-O NOT = TYPE-SUB-ARG
               PERFORM 9999-RESET-TYPE-REM-TS-O
               MOVE 15 TO COND-WORD.

       9999-RESET-TYPE-REM-TS-O.
           MOVE HIGH-VALUES TO EQRTYSUBK OF TYPE-REM-TS-REC-O.
           START TYPE-REM-TS-O KEY > EQRTYSUBK OF TYPE-REM-TS-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-TYPE-OPS-TS-O.
           MOVE 0 TO COND-WORD.
           READ TYPE-OPS-TS-O NEXT INTO BUF-TYPE-OPS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-TYPE-OPS-TS-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-TYPE-OPS-TS-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF EQRTYSUBK OF TYPE-OPS-TS-REC-O NOT = TYPE-SUB-ARG
               PERFORM 9999-RESET-TYPE-OPS-TS-O
               MOVE 15 TO COND-WORD.

       9999-RESET-TYPE-OPS-TS-O.
           MOVE HIGH-VALUES TO EQRTYSUBK OF TYPE-OPS-TS-REC-O.
           START TYPE-OPS-TS-O KEY > EQRTYSUBK OF TYPE-OPS-TS-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DRAWING-FL-TN-O.
           MOVE 0 TO COND-WORD.
           READ DRAWING-FL-TN-O NEXT INTO BUF-DRAWING-FILE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DRAWING-FL-TN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DRAWING-FL-TN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF DRWTYPNUM OF DRAWING-FL-TN-REC-O NOT = TYPE-NUM-ARG
               PERFORM 9999-RESET-DRAWING-FL-TN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DRAWING-FL-TN-O.
           MOVE HIGH-VALUES TO DRWTYPNUM OF DRAWING-FL-TN-REC-O.
           START DRAWING-FL-TN-O KEY > DRWTYPNUM OF DRAWING-FL-TN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-CC-LINK-HK-O.
           MOVE 0 TO COND-WORD.
           READ CC-LINK-HK-O NEXT INTO BUF-CORP-CODE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-CC-LINK-HK-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-CC-LINK-HK-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF HIERKEY OF CC-LINK-HK-REC-O NOT = HIER-KEY-ARG
               PERFORM 9999-RESET-CC-LINK-HK-O
               MOVE 15 TO COND-WORD.

       9999-RESET-CC-LINK-HK-O.
           MOVE HIGH-VALUES TO HIERKEY OF CC-LINK-HK-REC-O.
           START CC-LINK-HK-O KEY > HIERKEY OF CC-LINK-HK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETSER-WO-LAST-NM-LW-I.
           MOVE 0 TO COND-WORD.
           READ WO-LAST-NM-LW-I NEXT INTO BUF-LAST-NUM-USED
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-WO-LAST-NM-LW-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-WO-LAST-NM-LW-I.
           MOVE SPACES TO LASTWONUM OF WO-LAST-NM-LW-REC-I.
           START WO-LAST-NM-LW-I KEY >= LASTWONUM OF WO-LAST-NM-LW-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-PUT-TYPE-REF-TS-O.
           MOVE 0 TO COND-WORD.
           WRITE TYPE-REF-TS-REC-O FROM BUF-TYPE-REF
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-TYPE-REF-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-TYPE-REM-TS-O.
           MOVE 0 TO COND-WORD.
           WRITE TYPE-REM-TS-REC-O FROM BUF-TYPE-REM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-TYPE-REM-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-TYPE-OPS-TS-O.
           MOVE 0 TO COND-WORD.
           WRITE TYPE-OPS-TS-REC-O FROM BUF-TYPE-OPS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-TYPE-OPS-TS-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DRAWING-FL-TN-O.
           MOVE 0 TO COND-WORD.
           WRITE DRAWING-FL-TN-REC-O FROM BUF-DRAWING-FILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DRAWING-FL-TN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-CC-LINK-HK-O.
           MOVE 0 TO COND-WORD.
           WRITE CC-LINK-HK-REC-O FROM BUF-CORP-CODE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-CC-LINK-HK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-CC-NOTE-MS-NK-O.
           MOVE 0 TO COND-WORD.
           WRITE CC-NOTE-MS-NK-REC-O FROM BUF-CC-NOTE-MSTR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-CC-NOTE-MS-NK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

