       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TERINDEX2.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.  ***  INQUIRY TO GIVE AN INDEX OF
      *               SPECIFIC GENERIC TYPE RECORDS FROM
      *               THE EQUIPMENT REFERENCE FILE INQUIRY
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TYPE-REFERENCE
                  ASSIGN TO DATABASE-MCFLER0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN TO DISK-ERINDEX
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  TYPE-REFERENCE
           LABEL RECORDS ARE STANDARD.
       01  TR-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD CONTAINS 4 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  SUB-OUT.
               10  OUT-1       PIC X.
               10  OUT-2       PIC X.
               10  OUT-3       PIC X.
               10  OUT-4       PIC X.

       SD  SORT-FILE RECORD CONTAINS 4 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SUB-SORT        PIC X(4).

       WORKING-STORAGE SECTION.
       77  SAVE-SW             PIC 9(4)  VALUE 0.
       77  EOF-SW              PIC 9(4)  VALUE 0.
           88  EOF                       VALUE 1.
       77  ACT-KEY             PIC 9(8).
       77  PAGE-NUM            PIC 99.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  SCREEN-DATA.
           05  SCRN-TEXT                    PIC X(46).
           05  PAGE-NO                      PIC Z9.
           05  SUB-DISPLAY.
               10  SUB-A.
                   15  SUB-A-1              PIC X(04).
                   15  SUB-A-2              PIC X(04).
                   15  SUB-A-3              PIC X(04).
                   15  SUB-A-4              PIC X(04).
               10  SUB-AA.
                   15  SUB-AA-1             PIC X(04).
                   15  SUB-AA-2             PIC X(04).
                   15  SUB-AA-3             PIC X(04).
                   15  SUB-AA-4             PIC X(04).
               10  SUB-B.
                   15  SUB-B-1              PIC X(04).
                   15  SUB-B-2              PIC X(04).
                   15  SUB-B-3              PIC X(04).
                   15  SUB-B-4              PIC X(04).
               10  SUB-BB.
                   15  SUB-BB-1             PIC X(04).
                   15  SUB-BB-2             PIC X(04).
                   15  SUB-BB-3             PIC X(04).
                   15  SUB-BB-4             PIC X(04).
               10  SUB-C.
                   15  SUB-C-1              PIC X(04).
                   15  SUB-C-2              PIC X(04).
                   15  SUB-C-3              PIC X(04).
                   15  SUB-C-4              PIC X(04).
               10  SUB-CC.
                   15  SUB-CC-1             PIC X(04).
                   15  SUB-CC-2             PIC X(04).
                   15  SUB-CC-3             PIC X(04).
                   15  SUB-CC-4             PIC X(04).
               10  SUB-D.
                   15  SUB-D-1              PIC X(04).
                   15  SUB-D-2              PIC X(04).
                   15  SUB-D-3              PIC X(04).
                   15  SUB-D-4              PIC X(04).
               10  SUB-DD.
                   15  SUB-DD-1             PIC X(04).
                   15  SUB-DD-2             PIC X(04).
                   15  SUB-DD-3             PIC X(04).
                   15  SUB-DD-4             PIC X(04).
               10  SUB-E.
                   15  SUB-E-1              PIC X(04).
                   15  SUB-E-2              PIC X(04).
                   15  SUB-E-3              PIC X(04).
                   15  SUB-E-4              PIC X(04).
               10  SUB-EE.
                   15  SUB-EE-1             PIC X(04).
                   15  SUB-EE-2             PIC X(04).
                   15  SUB-EE-3             PIC X(04).
                   15  SUB-EE-4             PIC X(04).
               10  SUB-F.
                   15  SUB-F-1              PIC X(04).
                   15  SUB-F-2              PIC X(04).
                   15  SUB-F-3              PIC X(04).
                   15  SUB-F-4              PIC X(04).
               10  SUB-FF.
                   15  SUB-FF-1             PIC X(04).
                   15  SUB-FF-2             PIC X(04).
                   15  SUB-FF-3             PIC X(04).
                   15  SUB-FF-4             PIC X(04).
               10  SUB-G.
                   15  SUB-G-1              PIC X(04).
                   15  SUB-G-2              PIC X(04).
                   15  SUB-G-3              PIC X(04).
                   15  SUB-G-4              PIC X(04).
               10  SUB-GG.
                   15  SUB-GG-1             PIC X(04).
                   15  SUB-GG-2             PIC X(04).
                   15  SUB-GG-3             PIC X(04).
                   15  SUB-GG-4             PIC X(04).
               10  SUB-H.
                   15  SUB-H-1              PIC X(04).
                   15  SUB-H-2              PIC X(04).
                   15  SUB-H-3              PIC X(04).
                   15  SUB-H-4              PIC X(04).
               10  SUB-HH.
                   15  SUB-HH-1             PIC X(04).
                   15  SUB-HH-2             PIC X(04).
                   15  SUB-HH-3             PIC X(04).
                   15  SUB-HH-4             PIC X(04).
               10  SUB-I.
                   15  SUB-I-1              PIC X(04).
                   15  SUB-I-2              PIC X(04).
                   15  SUB-I-3              PIC X(04).
                   15  SUB-I-4              PIC X(04).
               10  SUB-II.
                   15  SUB-II-1             PIC X(04).
                   15  SUB-II-2             PIC X(04).
                   15  SUB-II-3             PIC X(04).
                   15  SUB-II-4             PIC X(04).
               10  SUB-J.
                   15  SUB-J-1              PIC X(04).
                   15  SUB-J-2              PIC X(04).
                   15  SUB-J-3              PIC X(04).
                   15  SUB-J-4              PIC X(04).
               10  SUB-JJ.
                   15  SUB-JJ-1             PIC X(04).
                   15  SUB-JJ-2             PIC X(04).
                   15  SUB-JJ-3             PIC X(04).
                   15  SUB-JJ-4             PIC X(04).
               10  SUB-K.
                   15  SUB-K-1              PIC X(04).
                   15  SUB-K-2              PIC X(04).
                   15  SUB-K-3              PIC X(04).
                   15  SUB-K-4              PIC X(04).
               10  SUB-KK.
                   15  SUB-KK-1             PIC X(04).
                   15  SUB-KK-2             PIC X(04).
                   15  SUB-KK-3             PIC X(04).
                   15  SUB-KK-4             PIC X(04).
               10  SUB-L.
                   15  SUB-L-1              PIC X(04).
                   15  SUB-L-2              PIC X(04).
                   15  SUB-L-3              PIC X(04).
                   15  SUB-L-4              PIC X(04).
               10  SUB-LL.
                   15  SUB-LL-1             PIC X(04).
                   15  SUB-LL-2             PIC X(04).
                   15  SUB-LL-3             PIC X(04).
                   15  SUB-LL-4             PIC X(04).
               10  SUB-M.
                   15  SUB-M-1              PIC X(04).
                   15  SUB-M-2              PIC X(04).
                   15  SUB-M-3              PIC X(04).
                   15  SUB-M-4              PIC X(04).
               10  SUB-MM.
                   15  SUB-MM-1             PIC X(04).
                   15  SUB-MM-2             PIC X(04).
                   15  SUB-MM-3             PIC X(04).
                   15  SUB-MM-4             PIC X(04).
               10  SUB-N.
                   15  SUB-N-1              PIC X(04).
                   15  SUB-N-2              PIC X(04).
                   15  SUB-N-3              PIC X(04).
                   15  SUB-N-4              PIC X(04).
               10  SUB-NN.
                   15  SUB-NN-1             PIC X(04).
                   15  SUB-NN-2             PIC X(04).
                   15  SUB-NN-3             PIC X(04).
                   15  SUB-NN-4             PIC X(04).
               10  SUB-O.
                   15  SUB-O-1              PIC X(04).
                   15  SUB-O-2              PIC X(04).
                   15  SUB-O-3              PIC X(04).
                   15  SUB-O-4              PIC X(04).
               10  SUB-OO.
                   15  SUB-OO-1             PIC X(04).
                   15  SUB-OO-2             PIC X(04).
                   15  SUB-OO-3             PIC X(04).
                   15  SUB-OO-4             PIC X(04).
           05  CMDMSG                       PIC X(79).
           05  ERRMSG                       PIC X(79).

       01  SUB-BUFFER.
           05  SUB-BUF-1              PIC X(04).
           05  SUB-BUF-2              PIC X(04).
           05  SUB-BUF-3              PIC X(04).
           05  SUB-BUF-4              PIC X(04).

       01  TYPE-SUB-KEY.
           05  TYPE-EQUIP-NUM  PIC X(08).
           05  SUB-SYS-NUM     PIC X(04).

       01  TYPE-REF-DATA.
           05  TYPE-SUB-KEY-REF.
               10  TYPE-NUM-REF         PIC X(08).
               10  SUB-SYS-REF          PIC X(04).
           05  FILLER                   PIC X(312).

       01  SCREEN-TEXT.
           05  FILLER   PIC X(20) VALUE " SUBSYSTEMS FOR GENE".
           05  FILLER   PIC X(18) VALUE "RIC TYPE NUMBER:  ".
           05  TYPE-BUF PIC X(08).

       COPY SCREENIO           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       01  MESSAGE-DATA.       COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       01  EQP-TYP-BUF         PIC X(08).

       PROCEDURE DIVISION USING DBPARAMETERS
                                EQP-TYP-BUF.
       BEGIN-SORT SECTION.
           CALL "CLERINDEX".
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          TYPE-REFERENCE.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE ZEROS          TO PAGE-NUM.
           MOVE 0              TO SAVE-SW ACT-KEY EOF-SW.
           MOVE EQP-TYP-BUF    TO TYPE-EQUIP-NUM TYPE-BUF.
           MOVE SCREEN-TEXT    TO SCRN-TEXT.
           MOVE "0000"         TO SUB-SYS-NUM.

       4-SORT-FUNCTION.
           SORT SORT-FILE ASCENDING KEY SUB-SORT
               INPUT  PROCEDURE 41-SORT-INPUT
               OUTPUT PROCEDURE 41-SORT-OUTPUT.
           IF ACT-KEY = 0
               MOVE "A"        TO RETURN-BYTE
               GO TO END-OF-JOB.

       8-DISPLAY-FUNCTION.
           OPEN INPUT          OUT-FILE.
           MOVE "VSUBSYSL"     TO SCREEN-NAME.
           MOVE 0              TO ACT-KEY.

       81-FILL-SCREEN.
           MOVE SPACES         TO SUB-DISPLAY.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-A.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-B.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-C.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-D.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-E.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-F.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-G.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-H.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-I.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-J.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-K.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-L.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-M.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-N.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-O.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-AA.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-BB.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-CC.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-DD.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-EE.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-FF.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-GG.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-HH.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-II.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-JJ.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-KK.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-LL.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-MM.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-NN.
           IF EOF GO TO 81-WRITE-SCREEN.
           PERFORM 81-READ-FILE THRU 81-RF-EXIT.
           MOVE SUB-BUFFER     TO SUB-OO.
           IF EOF GO TO 81-WRITE-SCREEN.

       81-WRITE-SCREEN.
           ADD 1               TO PAGE-NUM.
           MOVE PAGE-NUM       TO PAGE-NO.
           IF EOF
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  88        TO CATREAD-MSG-NUM
      **MESSAGE******************************************************
      ** END OF DATA - PRESS FUNCTION KEY TO CONTINUE              **
      ***************************************************************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG
           ELSE
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  57        TO CATREAD-MSG-NUM
      **MESSAGE******************************************************
      ** PRESS `f2' TO CONTINUE TO NEXT SCREEN                     **
      ***************************************************************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG.

       81-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF EOF GO TO END-OF-JOB.

           GO TO 81-FILL-SCREEN.

       81-READ-FILE.
           MOVE SPACES         TO SUB-BUFFER.

       81-READ-LOOP.
           IF SAVE-SW = 0
               ADD 1           TO ACT-KEY
               READ OUT-FILE INVALID KEY
                   MOVE 1      TO EOF-SW
                   GO TO 81-RF-EXIT.
           MOVE 0              TO SAVE-SW.
           IF OUT-4 NOT = "0"
               IF SUB-BUF-4 = SPACES
                   MOVE SUB-OUT TO SUB-BUF-4
               ELSE
                   MOVE 1      TO SAVE-SW
           ELSE
           IF OUT-3 NOT = "0"
               IF SUB-BUF-3 = SPACES AND SUB-BUF-4 = SPACES
                   MOVE SUB-OUT TO SUB-BUF-3
                   GO TO 81-READ-LOOP
               ELSE
                   MOVE 1      TO SAVE-SW
           ELSE
           IF OUT-2 NOT = "0"
               IF SUB-BUF-2 = SPACES AND SUB-BUF-3 = SPACES AND
                     SUB-BUF-4 = SPACES
                   MOVE SUB-OUT TO SUB-BUF-2
                   GO TO 81-READ-LOOP
               ELSE
                   MOVE 1      TO SAVE-SW
           ELSE
               IF SUB-BUFFER = SPACES
                   MOVE SUB-OUT TO SUB-BUF-1
                   GO TO 81-READ-LOOP
               ELSE
                   MOVE 1      TO SAVE-SW.

       81-RF-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               TYPE-REFERENCE.
           CLOSE               OUT-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

       41-SORT-INPUT SECTION.
           MOVE TYPE-SUB-KEY   TO EQRTYSUBK OF TYPE-REFERENCE.
           START TYPE-REFERENCE KEY NOT < EQRTYSUBK OF TYPE-REFERENCE.
           IF FILE-STAT NOT = "00"
               GO TO 41-SI-EXIT.
           PERFORM 41-READ-SORT THRU 41-RS-EXIT.
           GO TO 41-SI-EXIT.

       41-READ-SORT.
           READ TYPE-REFERENCE NEXT INTO TYPE-REF-DATA.
           IF FILE-STAT = "00"
               IF TYPE-NUM-REF = TYPE-EQUIP-NUM
                   MOVE SUB-SYS-REF TO SUB-SORT
                   RELEASE SORT-REC
                   GO TO 41-READ-SORT.

       41-RS-EXIT.    EXIT.

       41-SI-EXIT.    EXIT.

       41-SORT-OUTPUT SECTION.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-READ-LOOP THRU SORT-RL-EXIT.
           CLOSE               OUT-FILE.
           GO TO SORT-OP-EXIT.

       SORT-READ-LOOP.
           RETURN SORT-FILE    AT END
               GO TO SORT-RL-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-RL-EXIT.
           GO TO SORT-READ-LOOP.

       SORT-RL-EXIT.    EXIT.

       SORT-OP-EXIT.    EXIT.

