       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TERINDEX3.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.  ***  INQUIRY TO GIVE AN INDEX OF
      *               ALL LOCAL EQUIPMENT RECORDS FROM
      *               THE EQUIPMENT REFERENCE FILE INQUIRY
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-REFERENCE
                  ASSIGN TO DATABASE-MCFLER0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZEQPREFI-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN TO DISK-ERINDEX3
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-REFERENCE
           LABEL RECORDS ARE STANDARD.
       01  ER-REC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD CONTAINS 6 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  EQUIP-OUT       PIC X(6).

       SD  SORT-FILE RECORD CONTAINS 6 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  EQUIP-SORT      PIC X(6).

       WORKING-STORAGE SECTION.
       77  ACT-KEY             PIC 9(08).
       77  MAX-KEY             PIC 9(08).
       77  FIND-SW             PIC S9(4)  VALUE 0.
       77  SUB                 PIC S9(4)  VALUE 0.
       77  EOF-SW              PIC  9(4)  VALUE 0.
           88  EOF                        VALUE 1.
       77  EQUIP-SAVE          PIC X(6)   VALUE SPACES.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  EQP-SUB-KEY.
           05  EQP-EQUIP-NUM   PIC X(06).
           05  SUB-SYS-NUM     PIC X(04).

       01  SCREEN-DATA.
           05  EQUIP-DISPLAY.
               10  EQP-A1             PIC X(6).
               10  EQP-B1             PIC X(6).
               10  EQP-C1             PIC X(6).
               10  EQP-D1             PIC X(6).
               10  EQP-E1             PIC X(6).
               10  EQP-F1             PIC X(6).
               10  EQP-G1             PIC X(6).
               10  EQP-A2             PIC X(6).
               10  EQP-B2             PIC X(6).
               10  EQP-C2             PIC X(6).
               10  EQP-D2             PIC X(6).
               10  EQP-E2             PIC X(6).
               10  EQP-F2             PIC X(6).
               10  EQP-G2             PIC X(6).
               10  EQP-A3             PIC X(6).
               10  EQP-B3             PIC X(6).
               10  EQP-C3             PIC X(6).
               10  EQP-D3             PIC X(6).
               10  EQP-E3             PIC X(6).
               10  EQP-F3             PIC X(6).
               10  EQP-G3             PIC X(6).
               10  EQP-A4             PIC X(6).
               10  EQP-B4             PIC X(6).
               10  EQP-C4             PIC X(6).
               10  EQP-D4             PIC X(6).
               10  EQP-E4             PIC X(6).
               10  EQP-F4             PIC X(6).
               10  EQP-G4             PIC X(6).
               10  EQP-A5             PIC X(6).
               10  EQP-B5             PIC X(6).
               10  EQP-C5             PIC X(6).
               10  EQP-D5             PIC X(6).
               10  EQP-E5             PIC X(6).
               10  EQP-F5             PIC X(6).
               10  EQP-G5             PIC X(6).
               10  EQP-A6             PIC X(6).
               10  EQP-B6             PIC X(6).
               10  EQP-C6             PIC X(6).
               10  EQP-D6             PIC X(6).
               10  EQP-E6             PIC X(6).
               10  EQP-F6             PIC X(6).
               10  EQP-G6             PIC X(6).
               10  EQP-A7             PIC X(6).
               10  EQP-B7             PIC X(6).
               10  EQP-C7             PIC X(6).
               10  EQP-D7             PIC X(6).
               10  EQP-E7             PIC X(6).
               10  EQP-F7             PIC X(6).
               10  EQP-G7             PIC X(6).
               10  EQP-A8             PIC X(6).
               10  EQP-B8             PIC X(6).
               10  EQP-C8             PIC X(6).
               10  EQP-D8             PIC X(6).
               10  EQP-E8             PIC X(6).
               10  EQP-F8             PIC X(6).
               10  EQP-G8             PIC X(6).
               10  EQP-A9             PIC X(6).
               10  EQP-B9             PIC X(6).
               10  EQP-C9             PIC X(6).
               10  EQP-D9             PIC X(6).
               10  EQP-E9             PIC X(6).
               10  EQP-F9             PIC X(6).
               10  EQP-G9             PIC X(6).
               10  EQP-A10            PIC X(6).
               10  EQP-B10            PIC X(6).
               10  EQP-C10            PIC X(6).
               10  EQP-D10            PIC X(6).
               10  EQP-E10            PIC X(6).
               10  EQP-F10            PIC X(6).
               10  EQP-G10            PIC X(6).
               10  EQP-A11            PIC X(6).
               10  EQP-B11            PIC X(6).
               10  EQP-C11            PIC X(6).
               10  EQP-D11            PIC X(6).
               10  EQP-E11            PIC X(6).
               10  EQP-F11            PIC X(6).
               10  EQP-G11            PIC X(6).
               10  EQP-A12            PIC X(6).
               10  EQP-B12            PIC X(6).
               10  EQP-C12            PIC X(6).
               10  EQP-D12            PIC X(6).
               10  EQP-E12            PIC X(6).
               10  EQP-F12            PIC X(6).
               10  EQP-G12            PIC X(6).
               10  EQP-A13            PIC X(6).
               10  EQP-B13            PIC X(6).
               10  EQP-C13            PIC X(6).
               10  EQP-D13            PIC X(6).
               10  EQP-E13            PIC X(6).
               10  EQP-F13            PIC X(6).
               10  EQP-G13            PIC X(6).
               10  EQP-A14            PIC X(6).
               10  EQP-B14            PIC X(6).
               10  EQP-C14            PIC X(6).
               10  EQP-D14            PIC X(6).
               10  EQP-E14            PIC X(6).
               10  EQP-F14            PIC X(6).
               10  EQP-G14            PIC X(6).
               10  EQP-A15            PIC X(6).
               10  EQP-B15            PIC X(6).
               10  EQP-C15            PIC X(6).
               10  EQP-D15            PIC X(6).
               10  EQP-E15            PIC X(6).
               10  EQP-F15            PIC X(6).
               10  EQP-G15            PIC X(6).
               10  EQP-A16            PIC X(6).
               10  EQP-B16            PIC X(6).
               10  EQP-C16            PIC X(6).
               10  EQP-D16            PIC X(6).
               10  EQP-E16            PIC X(6).
               10  EQP-F16            PIC X(6).
               10  EQP-G16            PIC X(6).
               10  EQP-A17            PIC X(6).
               10  EQP-B17            PIC X(6).
               10  EQP-C17            PIC X(6).
               10  EQP-D17            PIC X(6).
               10  EQP-E17            PIC X(6).
               10  EQP-F17            PIC X(6).
               10  EQP-G17            PIC X(6).
               10  EQP-A18            PIC X(6).
               10  EQP-B18            PIC X(6).
               10  EQP-C18            PIC X(6).
               10  EQP-D18            PIC X(6).
               10  EQP-E18            PIC X(6).
               10  EQP-F18            PIC X(6).
               10  EQP-G18            PIC X(6).
           05  EQUIP-TABLE REDEFINES EQUIP-DISPLAY.
               10  EQP-TAB OCCURS 126 TIMES  PIC X(06).
           05  CMDMSG                 PIC X(79).
           05  ERRMSG                 PIC X(79).

       01  STACK-BUFFER.
           05  EQP-1                  PIC X(06).
           05  EQP-2                  PIC X(06).
           05  EQP-3                  PIC X(06).
           05  EQP-4                  PIC X(06).
           05  EQP-5                  PIC X(06).
           05  EQP-6                  PIC X(06).
           05  EQP-7                  PIC X(06).
           05  EQP-8                  PIC X(06).
           05  EQP-9                  PIC X(06).
           05  EQP-10                 PIC X(06).
           05  EQP-11                 PIC X(06).
           05  EQP-12                 PIC X(06).
           05  EQP-13                 PIC X(06).
           05  EQP-14                 PIC X(06).
           05  EQP-15                 PIC X(06).
           05  EQP-16                 PIC X(06).
           05  EQP-17                 PIC X(06).
           05  EQP-18                 PIC X(06).

       01  EQP-REF-DATA.
           05  EQP-SUB-KEY-REF.
               10  EQP-NUM-REF          PIC X(06).
               10  SUB-SYS-REF          PIC X(04).
           05  FILLER                   PIC X(320).

       COPY SCREENIO           IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       01  MESSAGE-DATA.       COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.
       BEGIN-SORT SECTION.
           CALL "CLERINDEX3".
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-REFERENCE.
           MOVE SPACES         TO SCREEN-DATA RETURN-BYTE EQUIP-SAVE.
           MOVE 0              TO SUB EOF-SW ACT-KEY.

       4-SORT-FUNCTION.
           SORT SORT-FILE ASCENDING KEY EQUIP-SORT
              INPUT  PROCEDURE 41-SORT-INPUT
              OUTPUT PROCEDURE 41-SORT-OUTPUT.

           IF ACT-KEY = 0
               MOVE "A"        TO RETURN-BYTE
               GO TO END-OF-JOB.

       8-DISPLAY-FUNCTION.
           OPEN INPUT          OUT-FILE.
           MOVE "VEQPNUMS"     TO SCREEN-NAME.
           MOVE 0              TO ACT-KEY.

       81-FILL-SCREEN.
           MOVE SPACES         TO EQUIP-DISPLAY.
           MOVE 1              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 2              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 3              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 4              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 5              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 6              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           IF EOF GO TO 81-WRITE-SCREEN.
           MOVE 7              TO SUB.
           PERFORM 81-LOAD-STACK THRU 81-LS-EXIT.
           PERFORM 81-TRANSFER.
           GO TO 81-WRITE-SCREEN.

       81-LOAD-STACK.
           MOVE SPACES         TO STACK-BUFFER.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-1.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-2.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-3.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-4.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-5.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-6.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-7.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-8.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-9.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-10.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-11.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-12.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-13.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-14.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-15.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-16.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-17.
           PERFORM 81-READ-FILE.
           IF EOF GO TO 81-LS-EXIT.
           MOVE EQUIP-OUT      TO EQP-18.

       81-LS-EXIT.    EXIT.

       81-TRANSFER.
           MOVE EQP-1          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-2          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-3          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-4          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-5          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-6          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-7          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-8          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-9          TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-10         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-11         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-12         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-13         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-14         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-15         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-16         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-17         TO EQP-TAB(SUB).
           ADD 7               TO SUB.
           MOVE EQP-18         TO EQP-TAB(SUB).

       81-WRITE-SCREEN.
           IF EOF
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  88        TO CATREAD-MSG-NUM
      **MESSAGE******************************************************
      ** END OF DATA - PRESS FUNCTION KEY TO CONTINUE              **
      ***************************************************************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG
           ELSE
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  57        TO CATREAD-MSG-NUM
      **MESSAGE******************************************************
      ** PRESS `f2' TO CONTINUE TO NEXT SCREEN                     **
      ***************************************************************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CMDMSG.

       81-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF EOF GO TO END-OF-JOB.

           GO TO 81-FILL-SCREEN.

       81-READ-FILE.
           ADD 1               TO ACT-KEY.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW.

       END-OF-JOB.
           CLOSE               OUT-FILE.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-REFERENCE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

       41-SORT-INPUT SECTION.
           MOVE 0              TO FIND-SW.
           PERFORM 41-READ-SORT THRU 41-RS-EXIT.
           GO TO 41-SI-EXIT.

       41-READ-SORT.
           IF FIND-SW = 1
               READ EQP-REFERENCE NEXT  INTO EQP-REF-DATA
           ELSE
               READ EQP-REFERENCE FIRST INTO EQP-REF-DATA.

           IF FILE-STAT = "00"
               MOVE 1          TO FIND-SW
               MOVE EQP-NUM-REF TO EQUIP-SORT
               RELEASE SORT-REC
               GO TO 41-READ-SORT.

       41-RS-EXIT.    EXIT.

       41-SI-EXIT.    EXIT.

       41-SORT-OUTPUT SECTION.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-READ-LOOP THRU SORT-RL-EXIT.
           CLOSE               OUT-FILE.
           GO TO SORT-OP-EXIT.

       SORT-READ-LOOP.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-RL-EXIT.
           IF EQUIP-SORT = EQUIP-SAVE
               GO TO SORT-READ-LOOP.
           MOVE EQUIP-SORT     TO EQUIP-SAVE.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               DISPLAY "WRITE OUT-FILE ERR"
               GO TO SORT-RL-EXIT.
           GO TO SORT-READ-LOOP.

       SORT-RL-EXIT.    EXIT.

       SORT-OP-EXIT.    EXIT.

