       IDENTIFICATION DIVISION.
       PROGRAM-ID.           TERRCLNUP.
       AUTHOR.               KALMAN.
       DATE-WRITTEN.         JAN 1994.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *D* REMARKS.
      *D*     ERROR CLEANUP PROGRAM.
      *D*
      *D*     THIS PROGRAM WILL REMOVE THE OLDEST ENTRIES FROM
      *D*     MCFPERRORS (WHICH IS THE FILE USED IN THE COBOL ERROR
      *D*     HANDLER TO REPORT NON-TBLOWUP ERRORS).  A YEAR'S
      *D*     WORTH OF ERRORS RECORDS WILL REMAIN IN THE FILE.
      *D*
      *C* CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
       FILE-CONTROL.
           SELECT ERROR-FILE-O
                  ASSIGN TO DATABASE-MCFPERRORS
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.

       FD  ERROR-FILE-O
           LABEL RECORDS ARE STANDARD.
       01  ERROR-REC-O.
           COPY DDS-MCRPERRORS  OF MCFPERRORS.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *-----------------------------------------------------------------
      *  M I S C E L L A N E O U S   D A T E   &   T I M E   F I E L D S
      *-----------------------------------------------------------------


       01  CUR-DATE.
           05  CUR-DATE-CC                PIC X(2).
           05  CUR-SYSTEM-DATE.
               10  CUR-DATE-YY            PIC X(2).
               10  CUR-DATE-MM            PIC X(2).
               10  CUR-DATE-DD            PIC X(2).

       01  LAST-DATE.
           05  LAST-DATE-YY               PIC X(2).
           05  LAST-DATE-MM               PIC X(2).
           05  LAST-DATE-DD               PIC X(2).

       01  ALPHA-YEAR-YYYY                PIC X(4).
       01  NUMERIC-YEAR-YYYY REDEFINES ALPHA-YEAR-YYYY  PIC 9(4).
       01                    REDEFINES ALPHA-YEAR-YYYY.
           05  NUMERIC-YEAR-CC            PIC 9(2).
           05  NUMERIC-YEAR-YY            PIC 9(2).

      *-----------------------------------------------------------------
      *  F L A G S   A N D   S W I T C H E S
      *-----------------------------------------------------------------

       01  ERROR-FILE-EOF                 PIC X.

      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------


      *-----------------------------------------------------------------
      *  S A V E   F I E L D S
      *-----------------------------------------------------------------


      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------

       01  BUF-ERROR-FILE.
           05  ERR-DATE                       PIC X(6).
           05  ERR-TIME                       PIC X(30).
           05  ERR-JOB                        PIC X(10).
           05  ERR-USER                       PIC X(7).
           05  ERR-NBR                        PIC X(6).
           05  ERR-PGM                        PIC X(10).
           05  ERR-LIB                        PIC X(10).
           05  ERR-MSG                        PIC X(7).
           05  ERR-DESC                       PIC X(100).

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       COPY DBCSACCT OF COPYLIB.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY TDATECHK OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************

       0-CONTROL.

           PERFORM 1-HSK.

           PERFORM 6-CHECK-ERROR-RECORDS THRU 6-EXIT.

           PERFORM 2-CLOSE-FILES.

           GOBACK.

       1-HSK.

           OPEN I-O        ERROR-FILE-O.

      *----AS OF MAR 93 THE CENTURY IS NOT AVAILABLE FROM THE SYSTEM.
      *----UNTIL THE SITUATION CHANGES, THE FOLLOWING CODING IS A
      *----TEMPORARY MEASURE. THIS CODING IS USED FOR ALL DATES IN
      *----THIS PROGRAM THAT NEED CONVERSION.

           ACCEPT CUR-SYSTEM-DATE FROM DATE.
           IF CUR-DATE-YY < "40"
              MOVE "20" TO CUR-DATE-CC
           ELSE
              MOVE "19" TO CUR-DATE-CC.

      *----KEEP 1 YEAR'S WORTH OF ERROR MSGS.
      *----FIGURE OUT LAST DATE TO KEEP.

           MOVE CUR-DATE-MM TO LAST-DATE-MM.
           MOVE CUR-DATE-DD TO LAST-DATE-DD.
           MOVE CUR-DATE(1:4) TO ALPHA-YEAR-YYYY.
           SUBTRACT 1 FROM NUMERIC-YEAR-YYYY.
           MOVE NUMERIC-YEAR-YY TO LAST-DATE-YY.

       2-CLOSE-FILES.

           CLOSE           ERROR-FILE-O.

       6-CHECK-ERROR-RECORDS.


           READ ERROR-FILE-O FIRST INTO BUF-ERROR-FILE
              AT END MOVE "Y" TO ERROR-FILE-EOF.

           PERFORM UNTIL ERROR-FILE-EOF = "Y" OR
                         ERR-DATE >= LAST-DATE

              IF ERR-DATE < LAST-DATE
                 DELETE ERROR-FILE-O
                    INVALID KEY CONTINUE
              END-IF

              READ ERROR-FILE-O NEXT INTO BUF-ERROR-FILE
                 AT END MOVE "Y" TO ERROR-FILE-EOF
              END-READ

           END-PERFORM.

       6-EXIT.  EXIT.

       9999-BLOWUP.
           MOVE "TERRCLNUP" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.
