000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TETYPRET.
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER.   AS400.
000800 OBJECT-COMPUTER.   AS400.
000900 INPUT-OUTPUT SECTION.
001000 FILE-CONTROL.
001100     SELECT OUT-FILE
               ASSIGN TO DATABASE-MCFPOUTF
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS OF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS WLNU-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
001700 FD  OUT-FILE
001800     RECORD CONTAINS 12 CHARACTERS
001900     DATA RECORD IS OUTF.
002000 01  OUTF                          PIC X(12).
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
002300 WORKING-STORAGE SECTION.
002600 01  ACT-KEY                       PIC 9(9).
002800 01  DBPARAMETERS.                 COPY DBPARMS OF COPYLIB.
       COPY TDATESUB OF COPYLIB.
       01  DELETE-FILE.
           05  FILLER                    PIC X(10) VALUE "MCFPOUTF".
003000 01  EQUIP-TYPE                    PIC X(12).
       COPY LANGSUB OF COPYLIB.
002500 01  LAST-WO-BUFF.                 COPY MLASTWO OF COPYLIB.
       01  OF-STATUS                     PIC XX.
       COPY DBSTAT OF COPYLIB.
       01  WLNU-STATUS                   PIC XX.
004600 PROCEDURE DIVISION.
004800 1-START.
004900     PERFORM 1-HSK.
005000     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
005200 2-EOJ.
005300     CLOSE OUT-FILE.
           CLOSE WO-LAST-NUM-USED.
           CALL "MCDLT" USING DELETE-FILE.
005400     GOBACK.
005700 1-HSK.
006100     OPEN INPUT OUT-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           MOVE 0 TO COND-WORD.
007600     MOVE 1 TO ACT-KEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
007900     MOVE DATE-FLAG-SW TO DATE-FLAG.
008000     MOVE 1 TO DATE-MODE.
008100     MOVE DATE-FLAG TO DATE-CODE.
008200     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
008300
008400 6-MAIN.
008500     READ OUT-FILE AT END GO TO 6-MAIN-EXIT.
           IF OF-STATUS NOT = "00" GO TO 6-MAIN-EXIT.
009000     MOVE OUTF TO EQUIP-TYPE.
009200     CALL "TPRTSUB2" USING DBPARAMETERS
009400                           EQUIP-TYPE
009600                           DATE-CHECK-AREA.
010000     GO TO 6-MAIN.
010100
010200 6-MAIN-EXIT.    EXIT.
