       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TEXECUTV.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      ***************************************************************
      ***   THIS IS THE CRAFTSMAN'S FUNCTIONS EXECUTIVE PROGRAM   ***
      ***************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  WO-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.
       77  FILE-STAT           PIC XX.
       77  PLANT-ID            PIC X(04) VALUE SPACES.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TEXECUTV".
           05  PROGRAM-TYPE    PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE PIC X(12) VALUE " K0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                   "PRIMARY PROGRAM OF THE CRAFTSM".
               10  PROG-DESC-A2    PIC X(30) VALUE
                   "AN's EXECUTIVE PROGRAM.       ".
               10  PROG-DESC-B1    PIC X(30) VALUE
                   "OPENS ALL DATABASES AND PROCED".
               10  PROG-DESC-B2    PIC X(30) VALUE
                   "ES TO CRAFTSMAN FUNCTIONS.    ".
               10  PROG-FUNCTION1  PIC X(30) VALUE
                   "PROBABLY SHOULD NEVER APPLY PA".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                   "SSWORD TO THIS PROGRAM.       ".
           05  PASSWORD-FLAG   PIC X.

           COPY JCWAREA        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           MOVE SPACES         TO LAST-WO-USED-DATA.
           MOVE SPACES         TO WO-TRACK-DATA.
           MOVE SPACES         TO WHO-VARIABLES.
           MOVE SPACES         TO DBPARAMETERS.

           CALL "WHO"          USING MOD CAP LATTR
                               USERNAME GRPNAME ACCTNAME
                               HOMEGRP TERMNUM.
           MOVE USERNAME       TO USER-NAME.
           MOVE TERMNUM        TO TNUM.
           MOVE TNUM           TO USER-TERM.

           OPEN INPUT          WO-LAST-NUM-USED.
           MOVE 1              TO DATE-FLAG-SW.
           READ  WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               DISPLAY "UNABLE TO GET LAST-WO-USED DATA."
                       "    FILE-STATUS = " FILE-STAT
               CLOSE           WO-LAST-NUM-USED
               GO TO END-OF-JOB.

           IF PLANT-IDENT = SPACES
               DISPLAY "FAILED TO GET PLANT-ID"
               CLOSE           WO-LAST-NUM-USED
               GO TO END-OF-JOB.

           CLOSE               WO-LAST-NUM-USED.
           MOVE DATE-FLAG-SW   TO DATE-FLAG.
           MOVE PLANT-IDENT    TO PLANT-ID.

      **************************************
      **   SETJCW  JCW-MLOCK-262
      **************************************
           MOVE 262            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF A-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-WOLOCK-263
      **************************************
           MOVE 263            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF B-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-MULTIWO-264
      **************************************
           MOVE 264            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF C-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-Q1REPT-302
      **************************************
           MOVE 302            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF D-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-MULTISRW-303
      **************************************
           MOVE 303            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF E-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-CRWKSHT-304
      **************************************
           MOVE 304            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF F-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-QRFRSH-305
      **************************************
           MOVE 305            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF H-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-ASBSTS-306
      **************************************
           MOVE 306            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF I-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

      **************************************
      **   SETJCW  JCW-24HIST-308
      **************************************
           MOVE 308            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF L-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           PERFORM SET-JOB-CONTROL-WORDS.

       CALL-FUNCTION.
           CALL "TCFTHELP"     USING WO-TRACK-DATA
                               PLANT-ID
                               DBPARAMETERS.

       END-OF-JOB.             GOBACK.

       SET-JOB-CONTROL-WORDS.
           MOVE 1              TO SETJCW-LENGTH.
           CALL "SETJCW"       USING
                               SETJCW-VALUE
                               SETJCW-STARTING-POS
                               SETJCW-LENGTH
                               SETJCW-STATUS.

