000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TFIXRQDS.
000400 AUTHOR.         C.I.HILLES.
000500 DATE-WRITTEN.   31 JAN 88.
000600 DATE-COMPILED.
000700*INSTALLATION.   GOODYEAR TIRE AND RUBBER CO.
000800*REMARKS.
000900*    THIS PROGRAM WILL RENUMBER THE DESCRIPTION FOR ANY REQ.
001000*    THIS RENUMBERING SHOULD FIX ANY BAD DESCRIPTION PROBLEMS.
001100*
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER. HP-3000.
001500 OBJECT-COMPUTER. HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQDESC-RQ-O
               ASSIGN TO DATABASE-MCFLCS2301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

001600 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  DREQDESC-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-RQ-REC-O.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
001700 WORKING-STORAGE SECTION.
       COPY TBLOWUP IN COPYLIB.
001800**************************************************************
001900**                                                          **
002000**            D A T A B A S E   W O R K                     **
002100**                                                          **
002200**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

002300 COPY DREQDESC   IN COPYLIB.
002400
002500 01  REQ-SEARCH                    PIC X(11) VALUE "REQ-NUMBER;".
002600 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
002700 01  DSET-DREQDESC                 PIC X(9)  VALUE "DREQDESC;".
002800
002900 01  MODE-AREA.
003000     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
003100     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
003200     05  MODE6                  PIC S9(4)   COMP       VALUE 6.
003300
003400 01  BASE                          PIC X(10) VALUE "  STORES;".
003500 01  BASE-MMISA                    PIC X(24).
003600 COPY DBSTAT     IN COPYLIB.
003700 COPY DREQD      IN COPYLIB.
003800 01  REQ-STATUS                    PIC X(2).
003900 01  REQ-REMARKS.
004000     05  REMARK-1                  PIC X(79).
004100     05  REMARK-2                  PIC X(79).

004600
004700 01  REQ-DESC-TABLE.
004800     05  REQ-DESC-LINE OCCURS 99 TIMES.
004900         10  RDT-REQ-NUMBER        PIC X(12).
005000         10  RDT-ITM-SEQ-NO.
005100             15  RDT-ITM-NO        PIC X(4).
005200             15  RDT-SEQ-NO        PIC X(2).
005300         10  RDT-DESC              PIC X(80).
005400
005500 01  LINE-COUNT                    PIC 9(3).
005600 01  SUB                           PIC 9(2).
005700 01  SUB1                          PIC 9(2).
005800 01  SUB2                          PIC 9(2).
005900 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
006000 01  REQ-ARG                       PIC X(12).
006100
006200 01  RENUM-FLAG                    PIC X(1).
006300 01  DISP-REQ-LINE.
006400     05  DISP-REQ-NUM              PIC X(6).
006500     05  DISP-ITM                  PIC X(4).
006600     05  FILLER                    PIC X(1).
006700     05  DISP-SEQ                  PIC X(2).
006800     05  FILLER                    PIC X(1).
006900     05  DISP-DESC                 PIC X(65).
007000
007100 PROCEDURE DIVISION.
007200
007300 6000-MAIN.
           PERFORM 9999-OPEN-STUFF.
007900
008000 6010-REQ-LOOP.
008100     MOVE SPACES TO REQ-ARG.
008200     DISPLAY
008300     "ENTER REQ# FOR WHICH TO FIX DESC, 'RETURN' TO END"         .
008400     ACCEPT REQ-ARG.
008500     IF REQ-ARG = SPACES
008600         GO TO 6990-MAIN-X.
008700
008800     PERFORM 7100-LOAD-DESC-TABLE THRU 7190-LDT-X.
008900     IF COND-WORD = 17
009000         DISPLAY "REQ DOES NOT EXIST"
009100         GO TO 6010-REQ-LOOP.
009200
009300     PERFORM 7400-DISPLAY THRU 7490-D-X.
009400     DISPLAY "HIT 'Y' TO RENUMBER, ANY OTHER KEY NOT TO".
009500     ACCEPT RENUM-FLAG.
009600     IF RENUM-FLAG NOT = "Y"
009700         GO TO 6010-REQ-LOOP.
009800
009900     PERFORM 7200-RENUMBER-DESC-TABLE THRU 7290-RDT-X.
010000     PERFORM 9930-LOCK.
           PERFORM 9999-DBFIND-DREQDESC-RQ-O.
           PERFORM UNTIL COND-WORD NOT = ZERO
               PERFORM 9999-DBGET5-DREQDESC-RQ-O
               IF GOOD-CALL
                   PERFORM 9999-DBDELETE-DREQDESC-RQ-O
               END-IF
           END-PERFORM.

010500     PERFORM 9940-UNLOCK.
010600
010700     PERFORM 7300-RELOAD-DESC-TABLE THRU 7390-RDT-X.
010800
010900     GO TO 6010-REQ-LOOP.
011000
011100 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
011200     GOBACK.
011300
011400
011500
011600 7100-LOAD-DESC-TABLE.
           PERFORM 9999-DBFIND-DREQDESC-RQ-O.
           IF NO-ENTRY
               GO TO 7190-LDT-X.
012500     MOVE 0 TO LINE-COUNT.
012600
012700 7110-LOAD-DESC-LOOP.
           PERFORM 9999-DBGET5-DREQDESC-RQ-O.
           IF END-OF-CHAIN
               GO TO 7190-LDT-X.
013600
013700     ADD 1 TO LINE-COUNT.
013800
013900     MOVE BUF-DREQDESC TO REQ-DESC-LINE (LINE-COUNT).
014000
014100     GO TO 7110-LOAD-DESC-LOOP.
014200
014300 7190-LDT-X.
014400     EXIT.
014500
014600 7200-RENUMBER-DESC-TABLE.
014700     MOVE 0 TO SUB.
014800     MOVE 0 TO SUB2.
014900
015000 7220-RENUMBER-LOOP.
015100     ADD 1 TO SUB.
015200     IF RDT-SEQ-NO (SUB) = "95" OR "96" OR "97" OR "98" OR "99"
015300         NEXT SENTENCE
015400     ELSE
015500         ADD 1 TO SUB2
015600         IF SUB2 > 94
015700             DISPLAY "**** ERROR - TOO MANY LINES ****"
015800             GO TO 7290-RDT-X
015900         ELSE
016000         IF SUB > LINE-COUNT
016100             GO TO 7290-RDT-X
016200         ELSE
016300             MOVE "0001" TO RDT-ITM-NO (SUB)
016400             MOVE SUB2 TO RDT-SEQ-NO (SUB).
016500
016600     GO TO 7220-RENUMBER-LOOP.
016700
016800 7290-RDT-X.
016900
017000 7300-RELOAD-DESC-TABLE.
017100     MOVE 0 TO SUB.
017200
017300 7310-RELOAD-DESC-LOOP.
017400     ADD 1 TO SUB.
017500     IF SUB > LINE-COUNT
017600         GO TO 7390-RDT-X
017700     ELSE
017800     IF SUB > 96
017900         GO TO 7390-RDT-X.
018000
018100     MOVE REQ-DESC-LINE (SUB) TO BUF-DREQDESC.
018200     PERFORM 9930-LOCK.
018300
           PERFORM 9999-DBPUT-DREQDESC-RQ-O.
019000     PERFORM 9940-UNLOCK.
019100
019200     GO TO 7310-RELOAD-DESC-LOOP.
019300
019400 7390-RDT-X.
019500     EXIT.
019600
020400 7400-DISPLAY.
020500     MOVE 0 TO SUB.
020600 7410-DISPLAY-LOOP.
020700     ADD 1 TO SUB.
020800     IF SUB > LINE-COUNT
020900         GO TO 7490-D-X.
021000
021100     MOVE SPACES                   TO   DISP-REQ-LINE.
021200     MOVE RDT-REQ-NUMBER (SUB)     TO   DISP-REQ-NUM.
021300     MOVE RDT-ITM-NO (SUB)         TO   DISP-ITM.
021400     MOVE RDT-SEQ-NO (SUB)         TO   DISP-SEQ.
021500     MOVE RDT-DESC (SUB)           TO   DISP-DESC.
021600
021700     DISPLAY DISP-REQ-LINE.
021800     GO TO 7410-DISPLAY-LOOP.
021900
022000 7490-D-X.
022100     EXIT.
022200
022300 2100-BLOWUP.
022400     DISPLAY "***** BLOWUP ******"
022500     DISPLAY BU-DISPLAY-MSG.
022600     GOBACK.

       9930-LOCK.
       9940-UNLOCK.
       9999-DBFIND-DREQDESC-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-RQ-REC-O.
           START DREQDESC-RQ-O KEY = REQNO OF DREQDESC-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "DBFIND ERR 9999-DBFIND-DREQDESC-RQ-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBGET5-DREQDESC-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-RQ-O NEXT INTO BUF-DREQDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQDESC-RQ-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE "DBGET5 ERR 9999-DBGET5-DREQDESC-RQ-O"
                       TO BU-MSG-AREA
                   MOVE 99 TO COND-WORD
                   PERFORM 2100-BLOWUP
           ELSE
           IF REQNO OF DREQDESC-RQ-REC-O NOT = REQ-ARG
               PERFORM 9999-RESET-DREQDESC-RQ-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQDESC-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF DREQDESC-RQ-REC-O.
           START DREQDESC-RQ-O KEY > REQNO OF DREQDESC-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBDELETE-DREQDESC-RQ-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQDESC-RQ-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBDELETE ERR 9999-DBDELETE-DREQDESC-RQ-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-DBPUT-DREQDESC-RQ-O.
           MOVE 0 TO COND-WORD.
           WRITE DREQDESC-RQ-REC-O FROM BUF-DREQDESC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-DREQDESC-RQ-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN I-O   DREQDESC-RQ-O                              .

       9999-CLOSE-STUFF.
           CLOSE      DREQDESC-RQ-O                              .
