       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TFIXDPOR.
       AUTHOR.  CRAIG HILLES.
       DATE-COMPILED.
      ***------------------------------------------------------------***
      ***  >>>>>>>>>>  P O R T A B L E    P R O G R A M  <<<<<<<<<<  ***
      ***------------------------------------------------------------***
      ************************************************************
      ** THIS PROGRAM FINDS AND P.O.S WITHOUT A DPORECD ENTRY   **
      ** AND FIXES THEM.                                        **
      **                                                        **
      ************************************************************
      *C
      *C  09/06/1996    CA YODER
      *C    MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MBUYER-BY-I
               ASSIGN TO DATABASE-MCFLCS0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-PO-I
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-PO-O
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-PO-I
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MPORCV-PO-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  DPORECD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPOITEM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  MBUYER-BY-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-BY-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  DVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-O.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                     PIC X(132).

       WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
       01  MODE-LIT                      PIC X(40).

      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY TBLOWUP  IN COPYLIB.
       COPY TDATECHK IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       01  VEN-ARG                       PIC X(10).
       01  PO-ARG                        PIC X(14).
       01  PLT-ARG                       PIC X(4).
       COPY DBPOARG1 IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       COPY MBUYER   IN COPYLIB.
       COPY DVENDOR  IN COPYLIB.
       COPY MPLT0    IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.
       COPY DPOITEM  IN COPYLIB.
       COPY DPORECD  IN COPYLIB.
       COPY MPORCV   IN COPYLIB.

       LINKAGE SECTION.
       01  UPDATE-FLAG                   PIC X(1).

       PROCEDURE DIVISION USING UPDATE-FLAG.
       1000-START.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           IF UPDATE-FLAG = "A"
              MOVE "MODE: UPDATE, ADD NEW DPORECD ENTRIES" TO MODE-LIT
           ELSE
           IF UPDATE-FLAG = "P"
              MOVE "MODE: UPDATE, DELETE BAD PO'S" TO MODE-LIT
           ELSE
           IF UPDATE-FLAG = "R"
              MOVE "MODE: REPORT ONLY, DO NOT UPDATE" TO MODE-LIT
           ELSE
              DISPLAY "INVALID MODE PASSED"
              PERFORM 2100-BLOWUP.

           PERFORM 9999-OPEN-STUFF.
           OPEN OUTPUT PRINT-FILE.
           DISPLAY MODE-LIT.
           WRITE PRINT-REC FROM MODE-LIT AFTER ADVANCING 1.
           MOVE SPACES TO MODE-LIT.
           STRING "DATE: ", DATE-SLASH-OUT, " TIME: ",
              DATE-FORMATTED-TIME-OUT DELIMITED BY SIZE INTO MODE-LIT.
           WRITE PRINT-REC FROM MODE-LIT AFTER ADVANCING 1.

           IF UPDATE-FLAG = "A"
               MOVE "0000000000"         TO  VEN-ARG
               PERFORM 9999-CHAINHD-DVENDOR-VN-O
               PERFORM 9999-GETNEXT-DVENDOR-VN-O
               IF NOT GOOD-CALL
                   MOVE "0000000000"     TO  VEN-VEN-CODE
                   MOVE ZERO             TO  VEN-ITM-NO
                   MOVE "UNKNOWN VENDOR FOR PO HEADER ERROR"
                                         TO  VEN-ITM-DATA
                   PERFORM 9999-PUT-DVENDOR-VN-O.

           PERFORM 9999-BEGFIL-MBUYER-BY-I.
           PERFORM 9999-GETSER-MBUYER-BY-I.

           MOVE "P 01"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.

           MOVE SPACES                   TO  PRINT-REC.
           STRING "P.O.'S WITH NO DPORECD ENTRY FOR PLANT ",
             MPLTINFO-COMPANY, "  ", MPLTINFO-PLT-NAME
             DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES                   TO  PRINT-REC.
           STRING "UPDATE FLAG IS ", UPDATE-FLAG DELIMITED BY SIZE
             INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 9999-CLOSE-STUFF.
           CLOSE PRINT-FILE.
           GOBACK.

       2100-BLOWUP.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.
           DISPLAY "COND-WORD = ", COND-WORD.
           GOBACK.

       6000-MAIN.
           PERFORM 9999-BEGFIL-MPORCV-PO-I.
       6100-READ-LOOP.
           PERFORM 9999-GETSER-MPORCV-PO-I.
           IF END-OF-FILE
               GO TO 6990-MAIN-X.

           MOVE M-PO-RCV-NO              TO  WS-RECEIVER.
           IF WS-RS NOT = "000"
               GO TO 6100-READ-LOOP.

           MOVE M-PO-RCV-NO              TO  PO-ARG.
           PERFORM 9999-CHAINHD-DPORECD-PO-O.
           PERFORM 9999-GETNEXT-DPORECD-PO-O.
           IF GOOD-CALL
               GO TO 6100-READ-LOOP.

           PERFORM 9999-CHAINHD-DPOITEM-PO-I.
           PERFORM 9999-GETNEXT-DPOITEM-PO-I.
           IF NOT GOOD-CALL
               MOVE SPACES               TO  PRINT-REC
               STRING "PO ", PO-ARG,
                 " HAD NO DPORECD OR DPOITEM"
                 DELIMITED BY SIZE INTO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1
               IF UPDATE-FLAG = "P"
                   MOVE "DELETING THE PO" TO PRINT-REC
                   WRITE PRINT-REC AFTER ADVANCING 1
                   CALL "SDELTPO" USING BASE, PO-ARG, MPLTINFO-COMPANY
                   GO TO 6100-READ-LOOP
               ELSE
                   GO TO 6100-READ-LOOP.

           MOVE SPACES                   TO  PRINT-REC.
           STRING "PO ", PO-ARG, " HAD NO DPORECD BUT DID HAVE DPOITEM"
             DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           IF UPDATE-FLAG = "A"
               PERFORM 8000-NEW-DPORECD
           ELSE
           IF UPDATE-FLAG = "P"
               CALL "SDELTPO" USING BASE, PO-ARG, MPLTINFO-COMPANY.

           GO TO 6100-READ-LOOP.

       6990-MAIN-X.
           EXIT.

       8000-NEW-DPORECD.
           MOVE "MAKING A NEW DPORECD ENTRY" TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES                   TO  BUF-DPORECD.
           MOVE PO-ARG                   TO  PO-RCV-NO.
           MOVE ITM-SUB-DETL             TO  PO-FOR-DEPT.
           MOVE DATE-YMD-OUT             TO  PO-DATE.
      *-------- ACCOUNT FOR CENTURY.
           IF PO-DATE-YY > "70"
               MOVE "19"                 TO  PO-DATE-CC
           ELSE
               MOVE "20"                 TO  PO-DATE-CC.
           MOVE ITM-SHIP-DATE-CN         TO  PO-SHIP-DATE-CN.
           MOVE ITM-EXPECT-DATE-CN       TO  PO-EXPECT-DATE-CN.
           MOVE SPACES                   TO  PO-CO, PO-PRIME.
           MOVE ITM-CLASS                TO  PO-SUB.
           MOVE ITM-SUB-DETL             TO  PO-SUB-DET.
           MOVE ITM-ADDL-DATA            TO  PO-ADDL-DATA.
           MOVE ZERO                     TO  PO-BUDGET-AMT.
           MOVE ITM-TERMS                TO  PO-TERMS.
           MOVE "0000000000"             TO  PO-VEN-CODE.
           MOVE BUYER-CODE               TO  PO-BUYER-CODE.
           MOVE BUYER-NAME               TO  PO-BUYER.
           MOVE "ERR"                    TO  PO-TYPIST.
           MOVE "ERROR IN PO HDR"        TO  PO-ADDL-INFO.
           MOVE MPLTINFO-COMPANY         TO  PO-CO.
           MOVE MPLTINFO-PRIME           TO  PO-PRIME.
           PERFORM 9999-PUT-DPORECD-PO-O.

       9999-CHAINHD-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-PO-REC-I.
           START DPOITEM-PO-I KEY = PORCVNO OF DPOITEM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPOITEM-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY = PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY = VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CLOSE-STUFF.
           CLOSE DPOITEM-PO-I.
           CLOSE DPORECD-PO-O.
           CLOSE DVENDOR-VN-O.
           CLOSE MBUYER-BY-I.
           CLOSE MPLTINFO-PK-I.
           CLOSE MPORCV-PO-I.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPOITEM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPOITEM-PO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DPORECD-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPORECD-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY > PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-O NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDOR-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDOR-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDOR-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY > VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETSER-MBUYER-BY-I.
           MOVE 0 TO COND-WORD.
           READ MBUYER-BY-I NEXT INTO BUF-MBUYER
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MBUYER-BY-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MBUYER-BY-I.
           MOVE SPACES TO BUYERCDE OF MBUYER-BY-REC-I.
           START MBUYER-BY-I KEY >= BUYERCDE OF MBUYER-BY-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETSER-MPORCV-PO-I.
           MOVE 0 TO COND-WORD.
           READ MPORCV-PO-I NEXT INTO BUF-MPORCV
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MPORCV-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-MPORCV-PO-I.
           MOVE SPACES TO PORCVNO OF MPORCV-PO-REC-I.
           START MPORCV-PO-I KEY >= PORCVNO OF MPORCV-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-OPEN-STUFF.
           OPEN INPUT MBUYER-BY-I.
           OPEN INPUT MPLTINFO-PK-I.
           OPEN INPUT MPORCV-PO-I.
           OPEN INPUT DPOITEM-PO-I.
           OPEN I-O DPORECD-PO-O.
           OPEN I-O DVENDOR-VN-O.

       9999-PUT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DPORECD-PO-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           WRITE DVENDOR-VN-REC-O FROM BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

