000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TFLAGMAN.
000400 AUTHOR.        KURT MOVSESIAN.
000600 INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
000500 DATE-WRITTEN.  NOV 22, 1985.
000700
000800*REMARKS.        INVOICE PROCESSING.
001000**************************************************************
001100*                                                            *
001200*   T F L A G M A N                                          *
001300*                                                            *
001400*   THIS SUB PROGRAM CHECKS TO SEE IF THIS INVOICE IS PART   *
001500*   OF AN ACTIVE MANIFEST ('NEW' OR 'REPR').  IF IT IS       *
001600*   THE MANIFEST IS FLAG SUCH THAT THE USER CANT RELEASE     *
001700*   THE MANIFEST UNTIL A 'REPR' TRANSACTION IS RAN.          *
001800*   THIS IS NECESSARY SINCE THE USER CHANGED A INVOICE       *
001900*   THAT WAS PART OF A MANIFEST ALREADY SENT TO AKRON AND    *
002000*   FOR THE CHANGE TO TAKE PLACE IN AKRON THE USER MUST DO   *
002100*   A 'REPR' BEFORE THE MANIFEST IS RELEASED.                *
002200*                                                            *
002300**************************************************************
002400*   N O T E    T H I S   S U B R O U T I N E   I S           *
002500*         C A L L E D    B Y :                               *
002600*      1. TINVBACK.SOURCE - BACKS OUT AN INVOICE             *
002700*      2. TINVMHD.SOURCE  - MODIFY HEADER INFORMATION        *
002800**************************************************************
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
003300
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.    HP-3000.
003700 OBJECT-COMPUTER.    HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003800
003900 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
004000
004100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X VALUE "0".
           05  FILE-STATUS-2       PIC X VALUE "0".

9406CK 01  SCOPE   PIC X.
004300
004400*************************************************************
004500**                                                         **
004600**  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
004700**                                                         **
004800*************************************************************
004900
005200 COPY DBSTAT IN COPYLIB.
005300
006600*************************************************************
006700**                                                         **
006800**             D A T A B A S E   B U F F E R S             **
006900**                                                         **
007000*************************************************************
007100
007200
007300 COPY MPLTINFO IN COPYLIB.
007400
007500 COPY TBLOWUP  IN COPYLIB.
007600
007700*************************************************************
007800**                                                         **
007900**                L I N K A G E   A R E A                  **
008000**                                                         **
008100*************************************************************
008200
008300 LINKAGE SECTION.
008400
008500 01  BASE                      PIC X(10).
008600
008700 01  ARGUMENT-VALUES.
008800     05  PLT-ARG               PIC X(4).
008900     05  PO-ARG                PIC X(14).
009000     05  VEN-ARG.
009100         10  VEN-ARG1-7        PIC X(7).
009200         10  VEN-ARG8-10       PIC X(3).
009300     05  CORPCODE-ARG          PIC X(8).
009400     05  REGISTER-ARG          PIC X(6).
009500
009600 COPY DINVRCD  IN COPYLIB.
009700
009800
009900
010000 PROCEDURE DIVISION USING  BASE,
010100                           ARGUMENT-VALUES,
010200                           BUF-DINVRCD.
010300
010400
010500 FLAG-MANIFEST SECTION 04.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

010600     OPEN I-O MPLTINFO-O.
010700     PERFORM  6-FLAG-MANIFEST  THRU  6-FM-X.
           CLOSE    MPLTINFO-O.
010800     GOBACK.
010900
011000 2-BLOWUP.
011100     MOVE "TFLAGMAN"              TO  BU-PGM-NAME.
011200     MOVE REGISTER-ARG            TO  BU-DISPLAY-FLD (1).
011300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
011400         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
011500                 BU-DISPLAY-FLDS.
011600
011700 2-BLOWUP-X.
011800     EXIT.
011900
012000
012100 6-FLAG-MANIFEST.
012200     IF INV-MFEST-NO = SPACES
012300         GO TO 6-FM-X.
           MOVE 0 TO COND-WORD.
           MOVE "PMAN" TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
013500*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7, STATUS-AREA,
013600*        ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
013700     IF COND-WORD NOT = ZERO
013800         MOVE "DBGET MPLTINFO 6-FM PMAN"  TO  BU-DISPLAY-MSG
013900         MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (2)
014000         GO TO 2-BLOWUP.
014100
014200     IF MPLTINFO-MAN-STATUS = "NEW " OR "REPR"
014300         MOVE "Y"  TO  MPLTINFO-MODIFY-SW.
014400
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
014500*    CALL "DBUPDATE" USING BASE, DSET-MPLTINFO, MODE1,
014600*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO.
014700     IF COND-WORD NOT = 0
014800         MOVE "UPDATE MPLTINFO 6-FM" TO BU-DISPLAY-MSG
014900         MOVE MPLTINFO-MAN-NO          TO BU-DISPLAY-FLD (2)
015000         GO TO 2-BLOWUP.
015100
015800 6-FM-X.
015900     EXIT.
