000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TFLUPSEL.
000400 AUTHOR.     KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000600
000700**************************************************************
000800*                                                            *
000900*   T F L U P S E L   PURCHASE ORDER FOLLOWUP BUYER CODE     *
001000*    SELECTION.  THIS ONLINE PROGRAM LAUNCHES A JOB THAT     *
001100*    CREATES A PURCHASE ORDER FOLLOWUP FILE OF PURCHASE      *
001200*    ORDERS THAT NEED A FOLLOWUP NOTICE.  THE SELECTION      *
001300*    CRITERIA IS BUYER CODE AND NO OF DAYS PAST EXPECTED     *
001400*    DELIVERY DATE AND NO OF DAYS PAST LAST FOLLOWUP DAY.    *
001500*    AN OPTIONAL VENDOR CODE CAN BE ENTERED TO FIND ALL OPEN *
001600*    ORDERS FOR A SPECIFIED VENDOR CODE. IF VENDOR CODE IS   *
001700*    ENTERED THEN THE BUYER CODE IS NOT A FACTOR             *
001800*                                                            *
001900**************************************************************
      *C
      *C 09/11/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
002000
002800
002900
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.  HP-3000.
003300 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZFLUPSEL-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0902
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MBUYER-I
                  ASSIGN TO DATABASE-MCFLCS0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003600
003700 DATA DIVISION.
003800 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DD-FLUPSEL1-O OF ZFLUPSEL.
003900
       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0902.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0601.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

004000
004100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
004200 77  COMPANY-SAVE                 PIC X(3)   VALUE SPACES.
004300 77  SUB1                         PIC S9(4)  VALUE ZEROS COMP-4.
004400 77  SUB2                         PIC S9(4)  VALUE ZEROS COMP-4.
004600
004700 01  BUYER-CODE-WORK-AREA.
004800     05  BUYER-CODE-CHAR          PIC X(1)  OCCURS 4 TIMES.
004900
005000
005100 COPY VCOMLINK   IN COPYLIB.
005200
006100 01  MESSAGE-BUFFER.
006200     05  MSG-TEXT              PIC X(64)    VALUE SPACE.
006300     05  MSG-FLD               PIC X(12)    VALUE SPACE.
006400     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.
006500
007000 01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.
007100
008600**************************************************************
008700**************************************************************
008800**                                                          **
008900**             TERMINAL I/O DATA AREA                       **
009000**                                                          **
009100**************************************************************
009200**************************************************************
009300
009400 01  SCREEN-1.
009500     05  DISP-COMPANY-1           PIC X(3).
009600     05  DE-BUYER-CODE            PIC X(4).
009700     05  DE-FLUP-NO-OF-DAYS       PIC 9(2).
009800     05  DE-EXP-NO-OF-DAYS        PIC 9(2).
009900     05  DE-VENDOR-CODE.
               10  DE-VENDOR-CODE1-7    PIC X(7).
               10  DE-VENDOR-CODE8-10   PIC X(3).
010000     05  DE-COMMAND-LINE          PIC X(79).
010100     05  DE-MESSAGE-LINE          PIC X(79).

       COPY DISPDATA   IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD    IN COPYLIB.

010200**************************************************************
010300**************************************************************
010400**                                                          **
010500**                DATABASE I/O BUFFER AREA                  **
010600**                                                          **
010700**************************************************************
010800**************************************************************
010900
011000 COPY MBUYER     IN COPYLIB.
011100
011200 COPY MPLT0      IN COPYLIB.
011300
011400 COPY MPLTP01    IN COPYLIB.
011600
012800
012900 COPY DATAB      IN COPYLIB.
013000
013500 01 ARG-VALUES.
013600     05  BUYER-ARG                PIC X(4)  VALUE SPACES.
013700     05  PLT-ARG                  PIC X(4)  VALUE SPACES.
013800     05  VEN-ARG                  PIC X(10) VALUE SPACES.
013900
014700 01  BUYER-FILE-NAME.
014800     05  FILLER                   PIC X(4) VALUE "DPOB".
014900     05  BUYER-CODE-PART          PIC X(4) VALUE SPACES.
015000
015100 01  BUILD-COMMAND.
015200     05  FILLER  PIC X(7)  VALUE ":BUILD ".
015300     05  BUILD-BUYER-FILE-NAME  PIC X(8) VALUE SPACES.
015400     05  FILLER  PIC X(20) VALUE ";REC=-24,21,F,ASCII;".
015500     05  FILLER  PIC X(15) VALUE "DISC=20000,32,1".
015600
015700 01  FILE-COMMAND.
015800     05  FILLER  PIC X(15) VALUE ":FILE DPOBUYER=".
015900     05  FILE-BUYER-FILE-NAME  PIC X(8)  VALUE SPACES.
016000
016500 01  RUN-COMMAND.
016600     05  FILLER  PIC X(10) VALUE "TFLUPFIL ".
016800
016900 01  LAUNCH-JOB-DISPLAY.
017000     05  LAUNCH-JOB-MSG           PIC X(55).
017100     05  LAUNCH-JOB-BUYER-CODE    PIC X(4).
017200
       COPY CDLTFILE   IN COPYLIB.

017900 01  STRMRPT-COMAREA.
018000     05  STRM-RET-CODE            PIC X(2)  VALUE "00".
018100     05  STRM-MODE                PIC S9(4) VALUE ZEROS COMP-4.
018200     05  STRM-CO-CODE.
018300         10  CO-CODE-PREFIX       PIC X(2)  VALUE SPACES.
018400         10  CO-CODE-LAST-DIGIT   PIC X     VALUE SPACES.
018500     05  STRM-PRE-RUN-CARDS.
018600         10  STRM-PRE-RUN-CARD1   PIC X(80) VALUE SPACES.
018700         10  STRM-PRE-RUN-CARD2   PIC X(80) VALUE SPACES.
018800         10  STRM-PRE-RUN-CARD3   PIC X(80) VALUE SPACES.
018900         10  STRM-PRE-RUN-CARD4   PIC X(80) VALUE SPACES.
019000     05  STRM-RUN-CARD            PIC X(80) VALUE SPACES.
019100     05  STRM-JOB-NAME            PIC X(8)  VALUE "FLUPFIL ".
019200     05  STRM-ROUTE-CARD.
019300         10  FILLER               PIC X(19) VALUE SPACES.
019400         10  ROUTE-LP             PIC X(3)  VALUE SPACES.
019500         10  FILLER               PIC X(58) VALUE SPACES.
019600     05  STRM-OPTION-CARD.
019700         10  STRM-BUYER-CODE      PIC X(4)  VALUE SPACES.
019800         10  STRM-DAYS-EXP-DATE   PIC 9(2)  VALUE ZEROS.
019900         10  STRM-DAYS-FLUP-DATE  PIC 9(2)  VALUE ZEROS.
020000         10  STRM-VENDOR-CODE     PIC X(10) VALUE SPACES.
               10  STRM-BUYER-FILE      PIC X(10) VALUE SPACES.
020100         10  FILLER               PIC X(52) VALUE SPACES.
020200     05  STRM-OPTION-CARD2        PIC X(640) VALUE SPACES.
020300     05  STRM-OPTION-CARD2-CTR    PIC X(1)  VALUE SPACES.
020400     05  STRM-OPTION-CARD3        PIC X(80) VALUE SPACES.
020500     05  STRM-PRTRPT-CARD.
020600         10  STRM-PRTRPT-FLAG     PIC X(1).
020700         10  STRM-PRTRPT-FILE     PIC X(17).
020800         10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
020900         10  STRM-PRTRPT-PRINTER   PIC X(3).
021000
021100
021200 COPY TBLOWUP    IN COPYLIB.
021300
021400 COPY LANGUAGE   IN COPYLIB.
021500
021600
021700 PROCEDURE DIVISION.
021800
021900 PROC-DIV SECTION 01.
022000
022100 BEGIN-HERE.
022200     PERFORM 1-HSK THRU 1-H-X.
022300
022400     PERFORM 6-MAIN THRU 6-M-X.
022500
022600     PERFORM 2-EOJ  THRU 2-EOJ-X.
022700
022800     GOBACK.
022900
023000 1-HSK.
           OPEN INPUT DPORECD-I, MBUYER-I, MPLTINFO-I.
           OPEN I-O DISPLAY-FILE.

026900**************************************************
027000*                                                *
027100*   GET CO. AND PRIME FROM MPLTINFO              *
027200*   USING 'P 01' AS THE ARGUMENT                 *
027300*                                                *
027400**************************************************
027500
027600     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
028000         MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
028100         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (1)
028200         GO TO 2-BLOWUP.
028300     MOVE MPLTINFO-COMPANY            TO  COMPANY-SAVE.
028400
028500 1-H-X.
028600     EXIT.
028700
028800 2-EOJ.
           CLOSE DPORECD-I, MBUYER-I, MPLTINFO-I,
                 DISPLAY-FILE.
030800
030900 2-EOJ-X.
031000      EXIT.
031100
031200******************************************************
031300**                                                  **
031400**   BLOWUP ROUTINE                                 **
031500**                                                  **
031600******************************************************
031700
031800 2-BLOWUP.
031900     MOVE "TFLUPSEL"              TO  BU-PGM-NAME.
032000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
032100         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
032200                 BU-DISPLAY-FLDS.
032300
032400 2-BLOWUP-X.
032500     EXIT.
035300
035400 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
036200
036300 4-PGM-ERROR-X.
036400     EXIT.
036500
038400
038500
038600**************************************************
038700*                                                *
038800*     6 - M A I N                                *
038900*                                                *
039000**************************************************
039100
039200 6-MAIN.
039300     MOVE "FLUPSEL1"  TO  VIEW-NFNAME.
040800     MOVE SPACES             TO  SCREEN-1.
           MOVE ZEROS              TO  DE-FLUP-NO-OF-DAYS,
                                       DE-EXP-NO-OF-DAYS,
                                       DE-VENDOR-CODE8-10.
040900     MOVE COMPANY-SAVE       TO  DISP-COMPANY-1.
041600
041700 6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
042500
042600     IF VIEW-LASTKEY = 3
042700         GO TO 6-M-X
042800     ELSE
044200     IF VIEW-LASTKEY = 1 OR
044300        VIEW-LASTKEY = 2 OR
044400        VIEW-LASTKEY = 4 OR
044500        VIEW-LASTKEY = 5 OR
044600        VIEW-LASTKEY = 6 OR
044700        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
044900*        "* INVALID FUNCTION KEY ENTERED *"
045000         MOVE   9 TO LANG-SETNUM
045100         MOVE  10 TO LANG-MSGNUM
045200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
045300         MOVE 2  TO  FIELD-NUMBER
045400         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
045500         GO TO 6-SHOWFORM-SCREEN-1.
045600
      *------ FIELD EDITS
           IF DE-BUYER-CODE = SPACES
      *         YOU MUST ENTER A BUYER CODE
               MOVE 44036 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 2  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.
075900
           IF DE-FLUP-NO-OF-DAYS = ZEROS
      *         YOU MUST ENTER NUMBER OF DAYS (GREATER THAN ZERO)
               MOVE 66174 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 3  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.
047500
           IF DE-EXP-NO-OF-DAYS = ZEROS
      *         YOU MUST ENTER NUMBER OF DAYS (GREATER THAN ZERO)
               MOVE 66174 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 4  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.
047500
047600*****************************************************
047700*                                                   *
047800*    EDIT BUYER CODE                                *
047900*                                                   *
048000*****************************************************
048100
048200 6-EDIT-BUYER-CODE.
048300     IF DE-BUYER-CODE = "****"
048400         MOVE SPACES              TO  DE-BUYER-CODE.
048500     MOVE DE-BUYER-CODE           TO  BUYER-ARG.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-REC-I.
           START MBUYER-I KEY = BUYERCDE OF MBUYER-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
049000*            "BUYER CODE DOES NOT EXIST"
049100             MOVE   2 TO LANG-SETNUM
049200             MOVE   4 TO LANG-MSGNUM
049300             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
049400             MOVE MESSAGE-BUFFER TO MSG-TEXT
049500             MOVE BUYER-ARG  TO  MSG-FLD
049600             MOVE 2       TO  FIELD-NUMBER
049700             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
049800             GO TO 6-SHOWFORM-SCREEN-1
049900         ELSE
050000             MOVE "GET MBUYER * 6-EBC"  TO  BU-DISPLAY-MSG
050100             MOVE BUYER-ARG             TO  BU-DISPLAY-FLD (2)
050200             GO TO 2-BLOWUP.
050300
050400     PERFORM 61-LEFT-SHIFT-BUYER-CODE  THRU  61-LSBC-X.
050500
050600 6-EDIT-VENDOR-CODE.
050700     IF DE-VENDOR-CODE1-7 = SPACES
050800         NEXT SENTENCE
050900     ELSE
051000         MOVE DE-VENDOR-CODE         TO VEN-ARG
               MOVE VEN-ARG TO VENCDE OF DPORECD-REC-I
               START DPORECD-I KEY = VENCDE OF DPORECD-REC-I
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-START
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS-1 = "2"
053000*                "NO POs EXIST FOR THE VENDOR CODED ENTERED"
053100                 MOVE  14         TO  LANG-SETNUM
053200                 MOVE  114        TO  LANG-MSGNUM
053300                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
053400                 MOVE MESSAGE-BUFFER TO MSG-TEXT
053500                 MOVE VEN-ARG     TO  MSG-FLD
053600                 MOVE 5           TO  FIELD-NUMBER
053700                 PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
053800                 GO TO 6-SHOWFORM-SCREEN-1
                   ELSE
052500                 MOVE "FIND DPORECD * 6-EVC" TO BU-DISPLAY-MSG
052600                 MOVE VEN-ARG     TO BU-DISPLAY-FLD (2)
052700                 GO TO 2-BLOWUP.
053900
054000 6-PURGE-OLD-BUYER-FILE.
           MOVE SPACES           TO DLTFILE-PARMS.
054100     MOVE BUYER-CODE-WORK-AREA    TO  BUYER-CODE-PART.
054200     MOVE BUYER-FILE-NAME         TO  DLTFILE-FILE-NAME.
           CALL "CDLTFILE" USING DLTFILE-LIB-NAME,
                                 DLTFILE-FILE-NAME,
                                 DLTFILE-RETURN-STATUS.
054500     IF DLTFILE-RETURN-STATUS NOT = "00"
054600         IF DLTFILE-IN-USE
054700*         "BUYER FOLLOWUP FILE CURRENTLY ACCESSED FOR BUYER CODE"
054800             MOVE   2 TO LANG-SETNUM
054900             MOVE   2 TO LANG-MSGNUM
055000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
055100             MOVE MESSAGE-BUFFER TO MSG-TEXT
055200             MOVE BUYER-ARG  TO  MSG-FLD
055300             MOVE 2       TO  FIELD-NUMBER
055400             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
055500             GO TO 6-SHOWFORM-SCREEN-1
055600         ELSE
055700         IF DLTFILE-NOT-FOUND
055800             NEXT SENTENCE
055900         ELSE
056000             MOVE "DLTFILE COMMAND ERROR"  TO  BU-DISPLAY-MSG
056100             MOVE DLTFILE-RETURN-STATUS TO  BU-DISPLAY-FLD (1)
056300             GO TO 2-BLOWUP.
056500
056600     PERFORM 62-LAUNCH-BATCH-JOB  THRU  62-LBJ-X.
056700
056800     GO TO 6-MAIN.
056900
057000 6-M-X.
057100     EXIT.
057200
057300 61-LEFT-SHIFT-BUYER-CODE.
057400     MOVE DE-BUYER-CODE           TO  BUYER-CODE-WORK-AREA.
057500     MOVE 1                       TO  SUB1.
057600     MOVE 2                       TO  SUB2.
057700
057800 61-LEFT-SHIFT-LOOP.
057900     IF SUB2 > 4
058000         GO TO 61-LSBC-X
058100     ELSE
058200     IF BUYER-CODE-CHAR (SUB1) = SPACES
058300         MOVE BUYER-CODE-CHAR (SUB2)  TO  BUYER-CODE-CHAR (SUB1)
058400         MOVE SPACES              TO  BUYER-CODE-CHAR (SUB2)
058500         ADD 1                    TO  SUB2
058600     ELSE
058700         ADD 1                    TO  SUB1
058800         IF SUB1 = SUB2
058900             ADD 1                TO  SUB2.
059000     GO TO 61-LEFT-SHIFT-LOOP.
059100
059200 61-LSBC-X.
059300     EXIT.
059400
059500 62-LAUNCH-BATCH-JOB.
060300*   "LAUNCHING JOB TO CREATE FOLLOWUP FILE FOR BUYER CODE"
060400     MOVE 12                      TO  LANG-SETNUM.
060500     MOVE 2                       TO  LANG-MSGNUM.
060600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
060700     MOVE MESSAGE-BUFFER          TO  LAUNCH-JOB-MSG.
060800     MOVE DE-BUYER-CODE           TO  LAUNCH-JOB-BUYER-CODE.
           MOVE LAUNCH-JOB-DISPLAY      TO  DE-COMMAND-LINE.
           MOVE B"1" TO IND (98).
           MOVE SCREEN-1                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-AUTO-READ-SCREEN.
061000
061300     MOVE COMPANY-SAVE            TO  STRM-CO-CODE.
061600     MOVE RUN-COMMAND             TO  STRM-RUN-CARD.
061700     MOVE DE-BUYER-CODE           TO  STRM-BUYER-CODE.
061800     MOVE DE-EXP-NO-OF-DAYS       TO  STRM-DAYS-EXP-DATE.
061900     MOVE DE-FLUP-NO-OF-DAYS      TO  STRM-DAYS-FLUP-DATE.
           IF DE-VENDOR-CODE1-7 = SPACES
               MOVE SPACES              TO  STRM-VENDOR-CODE
           ELSE
062000         MOVE DE-VENDOR-CODE      TO  STRM-VENDOR-CODE.
           MOVE BUYER-FILE-NAME         TO  STRM-BUYER-FILE.
062100     CALL "TSTRMJOB" USING STRMRPT-COMAREA.
062200     IF STRM-RET-CODE NOT = "00"
062300         MOVE STRM-RET-CODE     TO  BU-DISPLAY-FLD9 (1)
062400         MOVE "STRM COMMAND FAIL * TSTRMJOB" TO BU-DISPLAY-MSG
062500         GO TO 2-BLOWUP.
062800
064500 62-LBJ-X.
064600     EXIT.
064700
       COPY DISPCALL IN COPYLIB.

       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

064900 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
066500 999-CATREAD-EXIT.
066600     EXIT.
