000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TFORMRJE.
000400 INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
000500 DATE-WRITTEN.   JUNE 1991.
000700****************************************************************
000800*  THIS PROGRAM IS NEEDED TO REDUCE THE EDI ABSTRACT FILE FROM *
000900*  160 BYTES TO 80 BYTES FOR RJE TRANSFER TO THE MAINFRAME     *
001000****************************************************************
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.    IBM-AS400.
001400 OBJECT-COMPUTER.    IBM-AS400.
001500 INPUT-OUTPUT SECTION.
001600 FILE-CONTROL.
            SELECT EDI-FILEABS
                ASSIGN TO DATABASE-EDIABST
                ORGANIZATION IS SEQUENTIAL
                ACCESS IS SEQUENTIAL
                FILE STATUS IS FILE-STATUS.
001800      SELECT FILE-80
                ASSIGN TO DATABASE-EDIABS80
                ORGANIZATION IS SEQUENTIAL.
001900 DATA DIVISION.
002000 FILE SECTION.
002100 FD  EDI-FILEABS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
002200 01  EFREC                           PIC X(160).
002300
002400 FD  FILE-80
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS REC-80.
002500 01  REC-80                          PIC X(80).
002600
002700 WORKING-STORAGE SECTION.
       01  BASE                            PIC X(10).
002800
       01  FILE-STATUS.
           05  FILE-STATUS-1               PIC X     VALUE "0".
           05  FILE-STATUS-2               PIC X     VALUE "0".

008400 COPY DBSTAT   IN COPYLIB.
008500
       01  OVRDBF-PARM1  PIC X(80) VALUE SPACES.
       01  OVRDBF-PARM2  PIC S9(10)V9(5) COMP-3 VALUE 80.

018100 COPY TBLOWUP IN COPYLIB.
018200
       COPY VCOMLINK IN COPYLIB.

002900 01  WORK-REC.
003000     05  WORK-REC-160.
003100         07  WORK-LINE1              PIC X(80)  VALUE SPACES.
003200         07  WORK-LINE2              PIC X(80)  VALUE SPACES.
003300
003400 PROCEDURE DIVISION.
003500 00-MAIN.
003600
003700     PERFORM 100-CREATE-80-BYTE-REC THRU 199-EXIT.
003800
003900     CLOSE FILE-80, EDI-FILEABS.
004000
004100     GOBACK.
004200
004300 100-CREATE-80-BYTE-REC.
004400     OPEN INPUT  EDI-FILEABS.
      **********************************************************
      **   DO A CLEAR PHYSICAL FILE MEMBER ON EDIABS80        **
      **   TO CLEAR FOR RJE TRANSMISSION                      **
      **********************************************************
           MOVE "CLRPFM FILE(*LIBL/EDIABS80)" TO OVRDBF-PARM1.
           CALL "QCMDEXC" USING OVRDBF-PARM1, OVRDBF-PARM2.
023400     OPEN OUTPUT FILE-80.

004700 105-READ-LOOP.
004800     MOVE SPACES TO WORK-REC.
004900
005000     READ EDI-FILEABS NEXT INTO WORK-REC
005100          AT END GO TO 199-EXIT.
005200
005300     WRITE REC-80 FROM WORK-LINE1.
005400     WRITE REC-80 FROM WORK-LINE2.
005500
005600     GO TO 105-READ-LOOP.
005700 199-EXIT.  EXIT.

024200 2100-BLOWUP.
024300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
024400           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
024500           BU-DISPLAY-AREA.
