       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TFRANSND.
       AUTHOR.        CA YODER.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  JANUARY 1998.

      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                             *
      *D*   THIS PROGRAM READS THROUGH DFRANACT (MCFPCS6500) AND      *
      *D*   PLACES THEM IN THE FORMAT USED BY EDI TRANSACTION 867.    *
      *D*   THE FRANCHISE VENDOR ID IS PASSED AS A PARAMETER AND ONLY *
      *D*   THE NEXT SEQUENCE NUMBER IS PROCESSED.                    *
      *D*                                                             *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C*
      *C*  CHANGES

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************

       FILE-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DFRANACT-I
                  ASSIGN TO DATABASE-MCFLCS6502
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-UM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT SENDFRAN-T
                  ASSIGN TO DISK-SENDFRAN.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  DFRANACT-I
           LABEL RECORDS ARE STANDARD.
       01  DFRANACT-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6502.

       FD  MVALIDUM-UM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-UM-REC-I.
           COPY DDS-MCRPCS0400 OF MCFLCS0401.

       FD  SENDFRAN-T
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 88 CHARACTERS
           DATA RECORD IS SENDFRAN-T-REC.
       01  SENDFRAN-T-REC            PIC X(88).

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************

      *-----------------------------------------------------------------
      *  M I S C E L L A N E O U S
      *-----------------------------------------------------------------

       01  HOLD-QTY                       PIC S9(8).
       01  HOLD-COMPANY                   PIC X(3).
       01  HOLD-FILENAME.
           05  FILLER                     PIC X(6)  VALUE "EDI867".
           05  HOLD-FILE-ID               PIC X.

       01  CLEDI867-FILENAME              PIC X(10).

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

       01  PLT-ARG               PIC X(4).
       01  UM-ARG                PIC X(4).

       01  DFRAN-ARG.
           05  DFRAN-ID          PIC X.
           05  DFRAN-ABST        PIC 9(5).
           05  FILLER            PIC X(14)     VALUE SPACES.

      *-----------------------------------------------------------------
      *  S W I T C H E S
      *-----------------------------------------------------------------

       01  ABSTFILE-EOF              PIC X     VALUE SPACES.
       01  SCOPE                     PIC X.

       01  CURRENT-DATE-CN                     VALUE SPACES.
           05  CURRENT-CC            PIC X(2).
           05  CURRENT-DATE.
               10  CURRENT-YY        PIC X(2).
               10  CURRENT-MM        PIC X(2).
               10  CURRENT-DD        PIC X(2).

       01  CURRENT-TIME                        VALUE SPACES.
           05  CURRENT-HR            PIC X(2).
           05  CURRENT-MIN           PIC X(2).
           05  CURRENT-SEC           PIC X(2).

       01  CUR-ABST                  PIC 9     VALUE ZEROES.
       01  FILE-OK                   PIC X     VALUE SPACES.
       01  LAST-FILE-PROCESSED       PIC X     VALUE SPACES.

       01  FIRST-PASS                PIC X     VALUE SPACES.

       01  SUB                       PIC 9(3)  VALUE 1.

      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------

       01  LINE-COUNT                PIC 99.
       01  PAGE-COUNT                PIC 999.

      *-----------------------------------------------------------------
      *  S A V E   F I E L D S
      *-----------------------------------------------------------------

       01  SAVE-LOAD-SEQ                       PIC 9(5).
       01  SAVE-SEND-SEQ                       PIC 9(5).

       01  S-EXPECTED-ABST-DATA.
           05  S-EXPECTED-SEQ-NEXT-LOAD        PIC 9(5).
           05  S-EXPECTED-SEQ  OCCURS 4 TIMES.
               10  S-EXPECTED-SEQ-VEND         PIC X.
               10  S-EXPECTED-SEQ-NEXT-SEND    PIC 9(5).

      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------

       COPY MPLT0    IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.
       COPY MPLTCCHM IN COPYLIB.
       COPY MPLTFRAS IN COPYLIB.
       COPY MPLTFRAN IN COPYLIB.

       COPY DFRANACT IN COPYLIB.

       COPY EDI867   IN COPYLIB.

       COPY MVALIDUM IN COPYLIB.

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       COPY DATAB IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       COPY VCOMAREA IN COPYLIB.

      *-----------------------------------------------------------------
      *  F I L E   P A R M S
      *-----------------------------------------------------------------

       COPY CCRTFILE IN COPYLIB.

      *-----------------------------------------------------------------
       01  OVRDBF-SEND-CMD.
           05  PIC X(22) VALUE "OVRDBF FILE(SENDFRAN) ".
           05  PIC X(19) VALUE "TOFILE(*LIBL/EDI867".

           05  OVRDBF-SEQ1                PIC X.

           05  PIC X(12) VALUE ") MBR(EDI867".

           05  OVRDBF-SEQ2                PIC X.

           05  PIC X(1) VALUE ")".

       01  OVRDBF-SEND-LEN                PIC S9(10)V9(5) COMP-3
                                                    VALUE 56.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP IN COPYLIB.

       LINKAGE SECTION.
       01  HOLD-ID                        PIC X.

      ******************************************************************
      *             P R O C E D U R E   D I V I S I O N                *
      ******************************************************************
       PROCEDURE DIVISION     USING HOLD-ID.

       1-0-START-HERE.
           PERFORM 1-1-HSK.
           PERFORM 1-6-MAIN.
           PERFORM 1-2-EOJ.
           GOBACK.

       1-1-HSK.
           MOVE "C" TO SCOPE.
           CALL "MCXCBLERR" USING SCOPE.

           DISPLAY "*********************************************".
           DISPLAY "****  ENTER FRANCHISE VENDOR ID TO BE    ****".
           DISPLAY "****      PROCESSED:  (1 CHAR. ID)       ****".
           DISPLAY "*********************************************".
      **** ACCEPT HOLD-ID.
           DISPLAY "FRANCHISE VENDOR:  " HOLD-ID.

           OPEN INPUT   MPLTINFO-I   DFRANACT-I   MVALIDUM-UM-I.
           OPEN I-O     MPLTINFO-O.

           ACCEPT CURRENT-DATE FROM DATE.
      *---------- ACCOUNT FOR CENTURY.
           IF CURRENT-YY > "70"
               MOVE "19"    TO  CURRENT-CC
           ELSE
               MOVE "20"    TO  CURRENT-CC.
           ACCEPT CURRENT-TIME FROM TIME.

      *---------- GET PLANT NUMBER.
           MOVE "P 01"     TO  PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           IF FILE-STATUS NOT = "00"
               MOVE "MPLTINFO: P 01 NOT FOUND*1-1-H" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP
           ELSE
               MOVE MPLTINFO-COMPANY  TO  HOLD-COMPANY.

      *---------- GET HOME CURRENCY.
           MOVE "CCHM"     TO  PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           IF FILE-STATUS NOT = "00"
               MOVE "MPLTINFO: CCHM NOT FOUND*1-1-H" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP
           ELSE
               MOVE MPLTINFO-HOME-CUR-CODE   TO  UM-ARG.

           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "ERR: GET MVALIDUM HOME CURRENCY"
                   TO BU-DISPLAY-MSG
               PERFORM 9999-BLOWUP.

           PERFORM 9999-FIND-NEXT-SEQ.

      *----CREATE TEMPORARY FILE TO HOLD FRANCHISE TRANSACTIONS.
           INITIALIZE         CCRTFILE-PARMS.
           MOVE "*CURLIB"     TO CCRTFILE-LIBRARY.
           MOVE HOLD-ID       TO HOLD-FILE-ID
                                 OVRDBF-SEQ1  OVRDBF-SEQ2.
           MOVE HOLD-FILENAME TO CCRTFILE-FILE
                                 CLEDI867-FILENAME.
           MOVE "0088"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "03000"       TO CCRTFILE-NO-RECORDS.
           MOVE "00500"       TO CCRTFILE-INCREMENT-AMT.
           MOVE  04           TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
              MOVE "CCRTFILE SENDFRAN FAILED*1-1-H" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.
           CALL "QCMDEXC" USING OVRDBF-SEND-CMD  OVRDBF-SEND-LEN.
           OPEN OUTPUT SENDFRAN-T.

       1-2-EOJ.
           CLOSE        MPLTINFO-I   DFRANACT-I   MVALIDUM-UM-I
                        MPLTINFO-O.

      ******************************************************************
      *                     M A I N   P A R A G R A P H                *
      ******************************************************************
       1-6-MAIN.
           READ DFRANACT-I INTO BUF-DFRANACT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           PERFORM 8-1-COPY-RECS
                   UNTIL  FRAN-FRANCHISE-ID NOT = HOLD-ID
                      OR  FRAN-ABSTFILE-SEQ-NO NOT = SAVE-SEND-SEQ
                      OR  FILE-STATUS NOT = "00".

           CLOSE SENDFRAN-T.

           IF FILE-STATUS = "23"
               DISPLAY "NO RECORDS FOUND FOR SEQ # " SAVE-SEND-SEQ
           ELSE
               DISPLAY "CALL CLEDI867"
      *---------- SEND EDI FILE.
               CALL "CLEDI867" USING CLEDI867-FILENAME
                                     CLEDI867-FILENAME.

           PERFORM 9999-UPDATE-FRAS.

      ******************************************************************
      *                     C O P Y   R E C O R D S                    *
      ******************************************************************
       8-1-COPY-RECS.

           MOVE "PL_DATA   "          TO  EDI867-LIT.
           MOVE HOLD-COMPANY          TO  EDI867-PLANT
                                          EDI867-PLANT-2.
           MOVE FRAN-FRANCHISE-ID     TO  EDI867-FRAN-ID.
           MOVE SAVE-SEND-SEQ         TO  EDI867-ABST-NUM.
           MOVE FRAN-DATE-YMD         TO  EDI867-DATE.
           MOVE FRAN-TIME             TO  EDI867-TIME.
           MOVE FRAN-CORPCODE         TO  EDI867-CORP-CODE.
           MOVE FRAN-CHARGE-DEPT      TO  EDI867-DEPT-CHG.
           MOVE FRAN-EMP              TO  EDI867-EMPL.
           MOVE FRAN-QTY              TO  EDI867-QTY.
           COMPUTE EDI867-COST ROUNDED = FRAN-UNIT-COST.
           MOVE FRAN-UM               TO  EDI867-UM.
           MOVE FRAN-EXP-CLASS        TO  EDI867-EXP-CLASS.
           MOVE FRAN-REQUEST-DEPT     TO  EDI867-REQ-DEPT.
           MOVE FRAN-CLASS            TO  EDI867-ACCT-CLASS.
           MOVE VALID-EDI-UM          TO  EDI867-CURR.

           WRITE SENDFRAN-T-REC FROM BUF-EDI867.

           READ DFRANACT-I NEXT INTO BUF-DFRANACT
               AT END MOVE FILE-STATUS TO FILE-STATUS.

      ******************************************************************
      *               U T I L I T Y   P A R A G R A P H S              *
      ******************************************************************
       9999-BLOWUP.
           MOVE "TFRANSND" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

       9999-READ-MPLTINFO-I.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MPLTINFO*9999-RMI" TO BU-DISPLAY-MSG
                 MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-MPLTINFO-O.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MPLTINFO*9999-RMO" TO BU-DISPLAY-MSG
                 MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-UNLOCK-MPLTINFO-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
              INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-FIND-NEXT-SEQ.
      *---------- GET NEXT ABSTFILE SEQUENCE NUMBER TO LOOK FOR.
           MOVE "FRAS" TO PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           IF FILE-STATUS-1 = "2"
              MOVE "MPLTINFO: FRAS NOT FOUND*9999-FNS" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.

           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 4 OR
                           MPLTINFO-FRAN-VEND (SUB) = HOLD-ID
               DISPLAY "SUB:  " SUB
           END-PERFORM.

           MOVE MPLTINFO-FRAN-DATA TO S-EXPECTED-ABST-DATA.
           MOVE MPLTINFO-FRAN-NEXT-LOAD         TO  SAVE-LOAD-SEQ.
           MOVE MPLTINFO-FRAN-NEXT-SEND (SUB)   TO  SAVE-SEND-SEQ
                                      ABSTSEQNO OF DFRANACT-I-REC.
           MOVE MPLTINFO-FRAN-VEND (SUB)
                                      TO  FRANID OF DFRANACT-I-REC.

           DISPLAY "MPLTINFO-FRAN-NEXT-SEND (SUB):  "
                    MPLTINFO-FRAN-NEXT-SEND (SUB).

           PERFORM 9999-UNLOCK-MPLTINFO-O.

           START DFRANACT-I KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-UPDATE-FRAS.
      *--------- UPDATE SEQUENCE NUMBER.
           MOVE "FRAS" TO PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-O.
           IF FILE-STATUS-1 = "2"
              MOVE "MPLTINFO: FRAS NOT FOUND*9999-UF"
                 TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.
           ADD 1                     TO MPLTINFO-FRAN-NEXT-SEND (SUB).
           MOVE MPLTINFO-FRAN-NEXT-SEND (SUB)
                                     TO  SAVE-SEND-SEQ.
           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE MPLTINFO*9999-UF"
                                   TO BU-DISPLAY-MSG
              MOVE "TRYING TO UPD" TO BU-DISPLAY-FLD (1)
              MOVE "ABST SEQ TO"   TO BU-DISPLAY-FLD (2)
              MOVE MPLTINFO-FRAN-NEXT-SEND (SUB)
                                   TO BU-DISPLAY-FLD (3)
              GO TO 9999-BLOWUP.

