       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TFRANLOD.
       AUTHOR.        CA YODER.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  JANUARY 1998.

      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                             *
      *D*   THIS PROGRAM READS THROUGH THE ABSTFILES AND COPIES ALL   *
      *D*   333, 335, 433, 435, AND 532 (WITH FRAN-ID > SPACES) TO    *
      *D*   THE DFRANACT (MCFPCS6500) DATAFILE.                       *
      *D*                                                             *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C*
      *C*  CHANGES

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************

       FILE-CONTROL.
           SELECT ABSTFILE-I
                  ASSIGN TO DISK-ABSTFI10.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DFRANACT-O
                  ASSIGN TO DATABASE-MCFLCS6501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT FRANDATA-T
                  ASSIGN TO DISK-FRANDATA.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.
       FD  ABSTFILE-I
           DATA RECORD IS ABSTFILE-I-REC
           RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS ARE STANDARD.
       01  ABSTFILE-I-REC            PIC X(80).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  DFRANACT-O
           LABEL RECORDS ARE STANDARD.
       01  DFRANACT-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6501.

       FD  FRANDATA-T
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS FRANDATA-T-REC.
       01  FRANDATA-T-REC            PIC X(80).

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************

      *-----------------------------------------------------------------
      *  M I S C E L L A N E O U S
      *-----------------------------------------------------------------

       01  OVRRIDE-CMD.
           05  FILLER                     PIC X(35) VALUE
               "OVRDBF FILE(ABSTFI10) TOFILE(*LIBL/".
           05  OVR-FILE-NAME.
               10  FILLER                 PIC X(7)  VALUE "ABSTFIL".
               10  OVR-FILE-NUMBER        PIC X(1)  VALUE "0".
           05  FILLER                     PIC X(1)  VALUE ")".

       01  OVRRIDE-CMD-LEN                PIC S9(10)V9(5) COMP-3
                                                    VALUE 44.
       01  FRAN-TRANS-CODE                PIC X(3).
           88  FRAN-TRANS                 VALUE "333"  "335"  "433"
                                                "435"  "532".

       01  HOLD-QTY                       PIC S9(8).
       01  HOLD-532-COST-SMALL            PIC SV9(4).
       01  HOLD-532-COST-BIG              PIC S9(11).

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

       01  PLT-ARG               PIC X(4).

      *-----------------------------------------------------------------
      *  S W I T C H E S
      *-----------------------------------------------------------------

       01  ABSTFILE-EOF              PIC X     VALUE SPACES.
       01  FRANDATA-EOF              PIC X     VALUE SPACES.
       01  SCOPE                     PIC X.

       01  CURRENT-DATE-CN                     VALUE SPACES.
           05  CURRENT-CC            PIC X(2).
           05  CURRENT-DATE.
               10  CURRENT-YY        PIC X(2).
               10  CURRENT-MM        PIC X(2).
               10  CURRENT-DD        PIC X(2).

       01  CURRENT-TIME                        VALUE SPACES.
           05  CURRENT-HR            PIC X(2).
           05  CURRENT-MIN           PIC X(2).
           05  CURRENT-SEC           PIC X(2).

       01  CUR-ABST                  PIC 9     VALUE ZEROES.
       01  FILE-OK                   PIC X     VALUE SPACES.
       01  LAST-FILE-PROCESSED       PIC X     VALUE SPACES.

       01  FIRST-PASS                PIC X     VALUE SPACES.

      *-----------------------------------------------------------------
      *  S A V E   F I E L D S
      *-----------------------------------------------------------------

       01  S-001-CUTOFF-SEQ          PIC 9(5) VALUE ZEROES.
       01  S-LAST-ABST-ALPHA         PIC X.
       01  S-LAST-ABST-NUMERIC
           REDEFINES S-LAST-ABST-ALPHA PIC 9.
       01  S-CUTOFF-DATE-CN.
           05  S-CUTOFF-CC           PIC XX.
           05  S-CUTOFF-DATE.
               10  S-CUTOFF-YY       PIC XX.
               10  S-CUTOFF-MM       PIC XX.
               10  S-CUTOFF-DD       PIC XX.
       01  S-EXPECTED-ABST-DATA.
           05  S-EXPECTED-SEQ-NEXT-LOAD        PIC 9(5).
           05  S-EXPECTED-SEQ  OCCURS 4 TIMES.
               10  S-EXPECTED-SEQ-VEND         PIC X.
               10  S-EXPECTED-SEQ-NEXT-SEND    PIC 9(5).

      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------

       COPY DDAILYTC IN COPYLIB.
       COPY TC333    IN COPYLIB.
       COPY TC335    IN COPYLIB.
       COPY TC433    IN COPYLIB.
       COPY TC435    IN COPYLIB.
       COPY TC532    IN COPYLIB.
       COPY TC900    IN COPYLIB.

       COPY MPLT0    IN COPYLIB.
       COPY MPLTFRAS IN COPYLIB.

       COPY DFRANACT IN COPYLIB.

       01  BUF-FRANDATA                 PIC X(80).

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       COPY DATAB IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       COPY VCOMAREA IN COPYLIB.

      *-----------------------------------------------------------------
      *  T E M P O R A R Y   F I L E   P A R M S
      *-----------------------------------------------------------------

       COPY CCRTFILE IN COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP IN COPYLIB.

      ******************************************************************
      *             P R O C E D U R E   D I V I S I O N                *
      ******************************************************************
       PROCEDURE DIVISION.

       1-0-START-HERE.
           PERFORM 1-1-HSK.
           PERFORM 1-6-MAIN.
           PERFORM 1-2-EOJ.
           GOBACK.

       1-1-HSK.
           MOVE "C" TO SCOPE.
           CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT   ABSTFILE-I   MPLTINFO-I.
           OPEN I-O     DFRANACT-O   MPLTINFO-O.

           ACCEPT CURRENT-DATE FROM DATE.
      *---------- ACCOUNT FOR CENTURY.
           IF CURRENT-YY > "70"
               MOVE "19"    TO  CURRENT-CC
           ELSE
               MOVE "20"    TO  CURRENT-CC.
           ACCEPT CURRENT-TIME FROM TIME.

      *----GET ABSTFILE SEQUENCE NUMBER TO LOOK FOR.

           MOVE "FRAS" TO PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           IF FILE-STATUS-1 = "2"
              MOVE "MPLTINFO: FRAS NOT FOUND*1-1-H" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.
           MOVE MPLTINFO-FRAN-DATA TO S-EXPECTED-ABST-DATA.
           MOVE 2 TO S-LAST-ABST-NUMERIC.

           DISPLAY "MPLTINFO-FRAN-NEXT-LOAD:  "
                    MPLTINFO-FRAN-NEXT-LOAD.

           PERFORM 9999-UNLOCK-MPLTINFO-O.

      *----CREATE TEMPORARY FILE TO HOLD FRANCHISE TRANSACTIONS.
           INITIALIZE          CCRTFILE-PARMS.
           MOVE "QTEMP"     TO CCRTFILE-LIBRARY.
           MOVE "FRANDATA"  TO CCRTFILE-FILE.
           MOVE "0080"      TO CCRTFILE-RECORD-LENGTH.
           MOVE "03000"     TO CCRTFILE-NO-RECORDS.
           MOVE "00500"     TO CCRTFILE-INCREMENT-AMT.
           MOVE  04         TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
              MOVE "CCRTFILE FRANDATA FAILED*1-1-H" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.


       1-2-EOJ.
           CLOSE        ABSTFILE-I   MPLTINFO-I
                        DFRANACT-O   MPLTINFO-O.

      ******************************************************************
      *                     M A I N   P A R A G R A P H                *
      ******************************************************************
       1-6-MAIN.
           MOVE "N" TO LAST-FILE-PROCESSED.

      *----CHECK ALL ABSTFILES FROM ABSTFI10 DOWN TO ABSTFIL2

           PERFORM VARYING CUR-ABST FROM 9 BY -1
              UNTIL LAST-FILE-PROCESSED = "Y"

      *-------EDIT FIRST RECORD OF ABSTFILE FOR ERRORS

              PERFORM 9999-READ-ABSTFILE-I
              IF ABSTFILE-EOF = "Y"
                 MOVE "FOUND EMPTY ABSTFILE*1-6-M" TO BU-DISPLAY-MSG
                 MOVE OVR-FILE-NAME       TO BU-DISPLAY-FLD (1)
                 MOVE "LOOKNG FOR SEQ"    TO BU-DISPLAY-FLD (2)
                 MOVE S-EXPECTED-SEQ-NEXT-LOAD
                                          TO BU-DISPLAY-FLD (3)
                 GO TO 9999-BLOWUP
              END-IF
              MOVE TC900-CUTOFF-SEQ TO S-001-CUTOFF-SEQ
              MOVE DDAILYTC-DATE TO S-CUTOFF-DATE
      *------------ ACCOUNT FOR CENTURY.
              IF S-CUTOFF-YY > "70"
                  MOVE "19"                 TO S-CUTOFF-CC
              ELSE
                  MOVE "20"                 TO S-CUTOFF-CC
              END-IF
              IF DDAILYTC-TC NOT = "001"
                 MOVE "ABSTFILE MISSING 001 REC*1-6-M"
                    TO BU-DISPLAY-MSG
                 MOVE OVR-FILE-NAME            TO BU-DISPLAY-FLD (1)
                 MOVE "LOOKNG FOR SEQ"         TO BU-DISPLAY-FLD (2)
                 MOVE S-EXPECTED-SEQ-NEXT-LOAD TO BU-DISPLAY-FLD (3)
                 GO TO 9999-BLOWUP
              END-IF
              IF S-001-CUTOFF-SEQ > S-EXPECTED-SEQ-NEXT-LOAD
                 MOVE "CORRECT ABSTFILE NOT FOUND*1-6-M"
                    TO BU-DISPLAY-MSG
                 MOVE "LOOKNG FOR SEQ"    TO BU-DISPLAY-FLD (1)
                 MOVE S-EXPECTED-SEQ-NEXT-LOAD TO BU-DISPLAY-FLD (2)
                 MOVE "STARTED AT SEQ"    TO BU-DISPLAY-FLD (3)
                 MOVE S-001-CUTOFF-SEQ    TO BU-DISPLAY-FLD (4)
                 GO TO 9999-BLOWUP
              END-IF

      *-------IF SEQ NUMBER MATCHES EXPECTED SEQ NUMBER, PROCESS FILE

              IF S-001-CUTOFF-SEQ = S-EXPECTED-SEQ-NEXT-LOAD
                 DISPLAY "** USING ABSTFILE SEQUENCE # "
                                                 S-001-CUTOFF-SEQ
                 DISPLAY "** ABSTFIL" OVR-FILE-NUMBER
                 OPEN OUTPUT FRANDATA-T

      *----------READ ALL RECORDS TO FIND TRAILER RECORD (TC900)

                 MOVE "N" TO FILE-OK
                 PERFORM UNTIL FILE-OK = "Y"
                    PERFORM 9999-READ-ABSTFILE-I
                    IF ABSTFILE-EOF = "Y"
                       MOVE "TC900 REC NOT FOUND*1-6-M"
                         TO BU-DISPLAY-MSG
                       MOVE OVR-FILE-NAME TO BU-DISPLAY-FLD (1)
                       GO TO 9999-BLOWUP
                    END-IF

      *-------------WHILE READING THRU RECORDS PUT NEEDED FRANCHISE
      *-------------RECORDS INTO TEMP FILE.

                    MOVE DDAILYTC-TC      TO FRAN-TRANS-CODE
                    IF FRAN-TRANS
                       IF (DDAILYTC-TC = "532"        AND
                           BUF-DDAILYTC (51:1) > " ")  OR
                          (DDAILYTC-TC NOT = "532"    AND
                           BUF-DDAILYTC (77:1) > " ")
                           INITIALIZE BUF-FRANDATA
                           MOVE BUF-DDAILYTC TO BUF-FRANDATA
                           WRITE FRANDATA-T-REC FROM BUF-FRANDATA
                       END-IF
                    END-IF

      *-------------IF TRAILER REC FOUND, MATCH IT TO HEADER

                    IF DDAILYTC-TC = "900"

      *----------------IF HEADER AND TRAILER SEQ MATCH, THEN
      *----------------CLOSE, SORT AND PROCESS TEMPORARY FILE

                       IF TC900-CUTOFF-SEQ = S-001-CUTOFF-SEQ
                          MOVE "Y" TO FILE-OK
                          CLOSE FRANDATA-T
                          PERFORM 8-1-COPY-RECS

      *-------------------UPDATE MPLTINFO "FRAS" ABSTFILE SEQ NUMBER

                          MOVE "FRAS" TO PLT-ARG
                          PERFORM 9999-READ-MPLTINFO-O
                          IF FILE-STATUS-1 = "2"
                             MOVE "MPLTINFO: FRAS NOT FOUND*1-6-M"
                                TO BU-DISPLAY-MSG
                             GO TO 9999-BLOWUP
                          END-IF
                          ADD 1 TO MPLTINFO-FRAN-NEXT-LOAD
                          MOVE MPLTINFO-FRAN-NEXT-LOAD
                             TO S-EXPECTED-SEQ-NEXT-LOAD
                          REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
                             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                          END-REWRITE
                          IF FILE-STATUS NOT = "00"
                             MOVE "REWRITE MPLTINFO*1-6-M"
                                                  TO BU-DISPLAY-MSG
                             MOVE "TRYING TO UPD" TO BU-DISPLAY-FLD (1)
                             MOVE "ABST SEQ TO"   TO BU-DISPLAY-FLD (2)
                             MOVE MPLTINFO-FRAN-NEXT-LOAD
                                                  TO BU-DISPLAY-FLD (3)
                             GO TO 9999-BLOWUP
                          END-IF
                          IF OVR-FILE-NUMBER = S-LAST-ABST-ALPHA
                             MOVE "Y" TO LAST-FILE-PROCESSED
                          END-IF
                       ELSE
                          MOVE "BEG/END SEQ UNEQUAL*1-6-M"
                             TO BU-DISPLAY-MSG
                          MOVE OVR-FILE-NAME TO BU-DISPLAY-FLD (1)
                          MOVE "BEGINNING SEQ" TO BU-DISPLAY-FLD (2)
                          MOVE S-001-CUTOFF-SEQ TO BU-DISPLAY-FLD (3)
                          MOVE "ENDING SEQ" TO BU-DISPLAY-FLD (4)
                          MOVE TC900-CUTOFF-SEQ TO BU-DISPLAY-FLD (5)
                          GO TO 9999-BLOWUP
                       END-IF
                    END-IF
                 END-PERFORM
              END-IF

      *-------GET NEXT FILE TO CHECK

              IF LAST-FILE-PROCESSED = "N"
                 CLOSE ABSTFILE-I
                 MOVE CUR-ABST TO OVR-FILE-NUMBER
                 IF CUR-ABST < S-LAST-ABST-NUMERIC
                    MOVE "CORRECT ABSTFILE NOT FOUND*1-6-M"
                       TO BU-DISPLAY-MSG
                    MOVE S-EXPECTED-SEQ-NEXT-LOAD
                                             TO BU-DISPLAY-FLD (1)
                    GO TO 9999-BLOWUP
                 END-IF
                 CALL "QCMDEXC" USING OVRRIDE-CMD  OVRRIDE-CMD-LEN
                 OPEN INPUT ABSTFILE-I
              END-IF
           END-PERFORM.

      ******************************************************************
      *                     C O P Y   R E C O R D S                    *
      ******************************************************************
       8-1-COPY-RECS.

           OPEN INPUT FRANDATA-T.
           INITIALIZE BUF-DDAILYTC.
           MOVE "N"                   TO  FRANDATA-EOF.
           PERFORM 9999-READ-FRANDATA-T.

           PERFORM 8-6-MAIN UNTIL FRANDATA-EOF = "Y".

           CLOSE      FRANDATA-T.

       8-6-MAIN.

           INITIALIZE BUF-DFRANACT.
           MOVE BUF-FRANDATA          TO  BUF-DDAILYTC.
           MOVE DDAILYTC-DATE         TO  FRAN-DATE-YMD.
           IF FRAN-DATE-YY > "70"
               MOVE "19"              TO  FRAN-DATE-CC
           ELSE
               MOVE "20"              TO  FRAN-DATE-CC.
           MOVE DDAILYTC-TIME         TO  FRAN-TIME.
           MOVE S-001-CUTOFF-SEQ      TO  FRAN-ABSTFILE-SEQ-NO.
           MOVE DDAILYTC-TC           TO  FRAN-TC.
           EVALUATE DDAILYTC-TC
               WHEN "333"
                   MOVE TC333-FRAN-ID         TO  FRAN-FRANCHISE-ID
                   MOVE TC333-CORPCODE        TO  FRAN-CORPCODE
                   MOVE TC333-DEPT            TO  FRAN-CHARGE-DEPT
                   MOVE TC333-OVERHEAD-CTR    TO  FRAN-OVERHEAD-CTR
                   MOVE TC333-WO              TO  FRAN-WORKORDER
                   MOVE TC333-WORK-CENTER     TO  FRAN-WORK-CTR
                   MOVE TC333-EMP             TO  FRAN-EMP
                   MOVE TC333-QTY             TO  FRAN-QTY
                   MOVE TC333-AVG-COST        TO  FRAN-UNIT-COST
                   MOVE TC333-UM              TO  FRAN-UM
                   MOVE TC333-EXP-CLASS       TO  FRAN-EXP-CLASS
                   MOVE TC333-REQ-DEPT        TO  FRAN-REQUEST-DEPT
                   MOVE TC333-CLASS           TO  FRAN-CLASS
               WHEN "335"
                   MOVE TC335-FRAN-ID         TO  FRAN-FRANCHISE-ID
                   MOVE TC335-CORP-CODE       TO  FRAN-CORPCODE
                   MOVE TC335-CHARGE-DEPT     TO  FRAN-CHARGE-DEPT
                   MOVE SPACES                TO  FRAN-OVERHEAD-CTR
                   MOVE SPACES                TO  FRAN-WORKORDER
                   MOVE SPACES                TO  FRAN-WORK-CTR
                   MOVE TC335-EMPL            TO  FRAN-EMP
                   MOVE TC335-QTY             TO  FRAN-QTY
                   MOVE TC335-AVG-COST        TO  FRAN-UNIT-COST
                   MOVE TC335-UM              TO  FRAN-UM
                   MOVE TC335-EXP-CLASS       TO  FRAN-EXP-CLASS
                   MOVE SPACES                TO  FRAN-REQUEST-DEPT
                   MOVE TC335-CLASS           TO  FRAN-CLASS
               WHEN "433"
                   MOVE TC433-FRAN-ID         TO  FRAN-FRANCHISE-ID
                   MOVE TC433-CORPCODE        TO  FRAN-CORPCODE
                   MOVE TC433-DEPT            TO  FRAN-CHARGE-DEPT
                   MOVE TC433-OHEAD-CTR       TO  FRAN-OVERHEAD-CTR
                   MOVE TC433-WO              TO  FRAN-WORKORDER
                   MOVE TC433-WORK-CENTER     TO  FRAN-WORK-CTR
                   MOVE TC433-EMP             TO  FRAN-EMP
                   MOVE TC433-QTY             TO  FRAN-QTY
                   MOVE TC433-AVG-COST        TO  FRAN-UNIT-COST
                   MOVE TC433-UM              TO  FRAN-UM
                   MOVE TC433-EXP-CLASS       TO  FRAN-EXP-CLASS
                   MOVE TC433-REQ-DEPT        TO  FRAN-REQUEST-DEPT
                   MOVE TC433-CLASS           TO  FRAN-CLASS
               WHEN "435"
                   MOVE TC435-FRAN-ID         TO  FRAN-FRANCHISE-ID
                   MOVE TC435-CORP-CODE       TO  FRAN-CORPCODE
                   MOVE TC435-CHARGE-DEPT     TO  FRAN-CHARGE-DEPT
                   MOVE SPACES                TO  FRAN-OVERHEAD-CTR
                   MOVE SPACES                TO  FRAN-WORKORDER
                   MOVE SPACES                TO  FRAN-WORK-CTR
                   MOVE TC435-EMPL            TO  FRAN-EMP
                   MOVE TC435-QTY             TO  FRAN-QTY
                   MOVE TC435-AVG-COST        TO  FRAN-UNIT-COST
                   MOVE TC435-UM              TO  FRAN-UM
                   MOVE TC435-EXP-CLASS       TO  FRAN-EXP-CLASS
                   MOVE SPACES                TO  FRAN-REQUEST-DEPT
                   MOVE TC435-CLASS           TO  FRAN-CLASS
               WHEN "532"
                   MOVE TC532-FRAN-ID         TO  FRAN-FRANCHISE-ID
                   MOVE TC532-CORP-CODE       TO  FRAN-CORPCODE
                   MOVE TC532-DEPT-CHG        TO  FRAN-CHARGE-DEPT
                   MOVE SPACES                TO  FRAN-OVERHEAD-CTR
                   MOVE SPACES                TO  FRAN-WORKORDER
                   MOVE SPACES                TO  FRAN-WORK-CTR
                   MOVE SPACES                TO  FRAN-EMP
                   COMPUTE HOLD-QTY = TC532-ADJ-QTY * -1
                   MOVE HOLD-QTY              TO  FRAN-QTY
      *---------------- SINCE THE BIG & SMALL VALUES CONTAIN DIFFERING
      *---------------- DECIMAL VALUES, USE THE DECIMAL PORTION FROM THE
      *---------------- SMALL VALUE & THE WHOLE NUMBER FROM THE BIG VALUE.
                   MOVE TC532-AVG-COST-BIG    TO  HOLD-532-COST-BIG
                   MOVE TC532-AVG-COST-SMALL  TO  HOLD-532-COST-SMALL
                   COMPUTE FRAN-UNIT-COST = HOLD-532-COST-SMALL
                                          + HOLD-532-COST-BIG
                   MOVE TC532-UM              TO  FRAN-UM
                   MOVE TC532-DFLT-EXP-CLASS  TO  FRAN-EXP-CLASS
                   MOVE SPACES                TO  FRAN-REQUEST-DEPT
                   MOVE TC532-CLASS           TO  FRAN-CLASS.

           WRITE DFRANACT-O-REC FROM BUF-DFRANACT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
               MOVE "PROBLEM WITH DFRANACT WRITE"   TO BU-DISPLAY-MSG
               MOVE DDAILYTC-TC    TO BU-DISPLAY-FLD (1)
               MOVE DDAILYTC-DATE  TO BU-DISPLAY-FLD (2)
               MOVE DDAILYTC-TIME  TO BU-DISPLAY-FLD (3)
               GO TO 9999-BLOWUP.

           PERFORM 9999-READ-FRANDATA-T.

      ******************************************************************
      *               U T I L I T Y   P A R A G R A P H S              *
      ******************************************************************
       9999-BLOWUP.
           MOVE "TFRANLOD" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

       9999-READ-ABSTFILE-I.
           READ ABSTFILE-I INTO BUF-DDAILYTC
              AT END MOVE "Y" TO ABSTFILE-EOF.

       9999-READ-MPLTINFO-I.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MPLTINFO*9999-RMI" TO BU-DISPLAY-MSG
                 MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-MPLTINFO-O.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ MPLTINFO*9999-RMO" TO BU-DISPLAY-MSG
                 MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-FRANDATA-T.
           READ FRANDATA-T INTO BUF-FRANDATA
              AT END MOVE "Y" TO FRANDATA-EOF.

       9999-UNLOCK-MPLTINFO-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
              INVALID KEY MOVE "00" TO FILE-STATUS.

