001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.           TFRTCANC.
001300 AUTHOR.               MK MADDEN.
001400 DATE-WRITTEN.         MAR 17, 1987.
001500*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
001600*D REMARKS.            THIS PROGRAM IS USED TO CANCEL FREIGHT
001700*D                     BILLS.
002100*D
      *C 06/29/1992     DAVE PLUM     REQUEST #6214
      *C CORRECTED A PROBLEM WITH THE "DEFAULT" VALUES MOVES TO
      *C THE DTRANS FIELDS FOR CLASS AND DEPARTMENT.  EVEN THOUGH
      *C CLASS IS A 4 BYTE FIELD, "000 " SHOULD BE USED AS THE
      *C DEFAULT VALUE INSTEAD OF "0000".  AND SIMILARLY; EVEN
      *C THOUGH DEPARTMENT IS A 6 BYTE FIELD, "0000  " SHOULD BE USED
      *C AS THE DEFAULT VALUE INSTEAD OF "000000".  ALSO CORRECTED
      *C A FEW TBLOWUP ERROR MESSAGES TO INSURE THAT THE PROPER
      *C PARAGRAPH NAME WAS BEING REFERENCED.
      *C - COMMENTED OUT PARAGRAPH 265-GET-MCLASS SINCE IT WAS NEVER
      *C   BEING EXECUTED.  COPIED MUCH OF THE LOGIC IN THIS
      *C   PARAGRAPH TO FORM PARAGRAPH 644-VALIDATE-CLASS.
      *C
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.      HP-3000.
002500 OBJECT-COMPUTER.      HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002600 INPUT-OUTPUT SECTION.
002700 FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZFRTCANC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RELATIVE-RECNO
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

003700     SELECT CARRIER-FILE  ASSIGN TO DATABASE-MCFLCACARR
003800                          ORGANIZATION IS INDEXED
003900                          ACCESS MODE IS DYNAMIC
004000                          RECORD KEY IS CARRIER-CODE
004100                          FILE STATUS IS FILE-STATUS.

            SELECT DAPPLFRT
              ASSIGN TO DATABASE-MCFLCA0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
004200
            SELECT DAPPLFRT-I
              ASSIGN TO DATABASE-MCFLCA0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
004200
            SELECT MACCOUNT
              ASSIGN TO DATABASE-MCFLCA0101
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

            SELECT DTRANS
              ASSIGN TO DATABASE-MCFLCA0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
004200
            SELECT MMATL-ACCUM
              ASSIGN TO DATABASE-MCFLCA0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
004200
            SELECT MCLASS
              ASSIGN TO DATABASE-MCFLCS4901
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

            SELECT MCHT-ACCTS
              ASSIGN TO DATABASE-MCFLCA0301
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

             SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

003400 DATA DIVISION.
003500 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(2000).
017000
008300 FD  CARRIER-FILE.
008400 01  CARRIER-RECORD.
008500     05  CARRIER-CODE           PIC X(4).
008600     05  CARRIER-NAME           PIC X(30).
008700
       FD  DAPPLFRT-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-REC-I.
           COPY DDS-MCRPCA0800  OF MCFLCA0803.
008700
       FD  DAPPLFRT
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-REC.
           COPY DDS-MCRPCA0800  OF MCFLCA0803.
008800
       FD  DTRANS
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.
008800
       FD  MACCOUNT
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.
008800
       FD  MMATL-ACCUM
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-REC.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.
008800
       FD  MCLASS
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.
008800
       FD  MCHT-ACCTS
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-REC.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.
008800
       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

004100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       01  RELATIVE-RECNO         PIC 9(9).
      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES   PIC 1 INDICATOR 01.

       COPY IOFEEDBACK OF COPYLIB.
        01  FORM-NAMES.
            05  UPD-HEADER           PIC X(8) VALUE "FRTHDR".
            05  ADD-DATE             PIC X(8) VALUE "ADDDATE".

004200 01  ACCT-TABLE-BEFORE.
004300     05  ACCT-CHARB OCCURS 6 TIMES  PIC X.
004400
004500 01  ACCT-TABLE-AFTER.
004600     05  ACCT-CHARA OCCURS 6 TIMES  PIC X.

004700 01  SAVE-STR-DEPT               PIC X(6)  VALUE SPACES.
004800 01  SAVE-TRANS-DEPT             PIC X(6)  VALUE SPACES.
004900 77  ERROR-SW                    PIC X(3)  VALUE "YES".
005000 77  VALUE-UNSIGNED              PIC 9(12)V99  VALUE 0.
005100 77  CARR-FOUND                   PIC X  VALUE "0".
005200 77  FRT-FOUND                     PIC X  VALUE "0".
005300 77  ITEM-FOUND                    PIC X    VALUE "0".
005400 77  NO-ERRORS                   PIC X(3)  VALUE SPACES.

005500 01  DATE-DIV.
005600     05  MONTH-DIV                  PIC XX  VALUE SPACES.
005700     05  FILLER                     PIC X   VALUE SPACES.
005800     05  DAY-DIV                    PIC XX  VALUE SPACES.
005900     05  FILLER                     PIC X   VALUE SPACES.
006000     05  YEAR-DIV                   PIC XX  VALUE SPACES.
006100
006200 01  CURRENT-REV.
006300     05  CURR-YR                    PIC XX.
006400     05  CURR-MO                    PIC XX.
006500     05  CURR-DA                    PIC XX.
006700
006800 01  CARRIER-STAT.
006900     05  CARRIER-STAT1           PIC X     VALUE SPACE.
007000     05  CARRIER-STAT2           PIC X     VALUE SPACE.
007100
007200 77  SUB                            PIC 9   VALUE 0.
007300 77  SUB1                           PIC 9   VALUE 0.
007400 77  NEW-SUB                        PIC 9   VALUE 0.
007500 77  COUNT-BACK                     PIC S9  VALUE -1.
007600 77  ACCT-FOUND                     PIC X   VALUE SPACES.
007700 77  TRANS-ACCT-HOLD                PIC 9(6)  VALUE 0.
008200 01  VALUE-HOLD.
008300     05  VALUE-1                   PIC 9(12)   VALUE 0.
008400     05  VALUE-2                   PIC V99     VALUE 0.
008500
008600 01  MESSAGE-BUFFER.
008700     05  MSG-TEXT                  PIC X(68)  VALUE SPACE.
008800     05  MSG-FLD                   PIC X(8)   VALUE SPACE.
008900     05  MSG-FLD-9 REDEFINES MSG-FLD   PIC ZZZZZZZ9.
009000
009100 01  MESSAGE-BUFLEN                PIC S9(4)  VALUE 76 COMP-4.
009200 01  MESSAGE-ACTLEN                PIC S9(4)  VALUE ZERO COMP-4.
009300 01  FIELD-NUMBER                  PIC S9(4)  VALUE 1    COMP-4.
009400 01  ADD-DATE-DBUFLEN              PIC S9(4)  VALUE 145 COMP-4.
009500
009600*************************************************************
009700**         D A T A  E N T R Y  B U F F E R S               **
009800*************************************************************
009900
010000 01  INQHDR-BUFFER.
010100     05  HDR-FRT-PRO-NO          PIC X(16).
010200     05  HDR-FRT-CARR            PIC X(4).
010300     05  HDR-FRT-ITEM            PIC X(4).
           05  DE-COMMAND-LINE         PIC X(79).
           05  DE-MESSAGE-LINE         PIC X(79).
010400
010500 01  ADD-DATE-BUFFER.
010600     05  DTL-CARRIER-NAME        PIC X(30).
010700     05  DTL-CARRIER-CODE        PIC X(4).
010800     05  DTL-PO-NUMBER           PIC X(10).
010900     05  DTL-RCVR                PIC X(4).
011000     05  DTL-ITEM                PIC X(4).
011100     05  DTL-RAIL-CAR            PIC X(10).
011200     05  DTL-MATL-CODE           PIC X(8).
011300     05  DTL-FRT-PRO-NO          PIC X(16).
011400     05  DTL-TERMS               PIC X(2).
011500     05  DTL-PAID-DATE.
011600         10  DTL-PAID-MM         PIC X(2).
011700         10  DTL-PAID-DD         PIC X(2).
011800         10  DTL-PAID-YY         PIC X(2).
011900     05  DTL-PAID-AMOUNT.
012000         10  DTL-PAID-DOL        PIC 9(12).
012100         10  DTL-PAID-DEC        PIC V99.
012200         10  DTL-PAID-SIGN       PIC X.
012300     05  DTL-SHIP-DATE.
012400         10  DTL-SHIP-MM         PIC XX.
012500         10  DTL-SHIP-DD         PIC XX.
012600         10  DTL-SHIP-YY         PIC XX.
012700     05  DTL-RATED-AMOUNT.
012800         10  DTL-RATED-DOL       PIC 9(12).
012900         10  DTL-RATED-DEC       PIC V99.
013000         10  DTL-RATED-SIGN      PIC X.
013100     05  DTL-TAX-AMOUNT.
013200         10  DTL-TAX-DOL         PIC 9(12).
013300         10  DTL-TAX-DEC         PIC V99.
013400         10  DTL-TAX-SIGN        PIC X.
013500     05  DTL-MONEY-FLAG          PIC X.
           05  DE-COMMAND-LINE2        PIC X(79).
           05  DE-MESSAGE-LINE2        PIC X(79).
013700
013800 COPY TBLOWUP  OF COPYLIB.
013900 COPY TDATECHK OF COPYLIB.
       COPY CATREAD OF COPYLIB.
014100************************************************************
014300**           D A T A B A S E   B U F F E R S              **
014500************************************************************
015000 COPY DAPPLFRT OF COPYLIB.
015100 COPY MCHTACCT OF COPYLIB.
015200 COPY DPOITEM  OF COPYLIB.
015800 COPY MATLACUM OF COPYLIB.
016400 COPY MCLASS   OF COPYLIB.
016500 COPY MACTINFO OF COPYLIB.
016600 COPY DTRANS   OF COPYLIB.
016700
016800**********************************************************
016900*              D A T A    B A S E                        *
017000**********************************************************
017100 COPY DBCSACCT OF COPYLIB.
017200 COPY DBMODES  OF COPYLIB.
017300 COPY DBSTAT   OF COPYLIB.
017400 01  BASE                 PIC X(10) VALUE "  STORES;".
017600
017700 01  SAVE-DB-COND         PIC S9(4)  COMP-4  VALUE 0.
017800     88  SAVE-END-OF-CHAIN          VALUE 15.
017900
020200 01  CSIS-PO-ARG.
020300     05  PO-EIGHT.
020400         10  KEY-REC-ID       PIC X      VALUE SPACES.
020500         10  KEY-PO-NO        PIC X(10)  VALUE SPACES.
020600     05  KEY-PO-REC       PIC X(3)   VALUE "000".
020700
020800 01  IMAGE-ARGS.
020900     05  FRT-ARG          PIC X(16)  VALUE SPACES.
021000     05  DEPT-ARG         PIC X(6) VALUE SPACES.
021100     05  FRT-CODE-ARG     PIC X(4)   VALUE SPACES.
021200     05  MMATL-CODE-ARG   PIC X(8)  VALUE SPACES.
021300     05  PO-ARG           PIC X(10)  VALUE SPACES.
021400     05  CLASS-ARG        PIC X(4)  VALUE SPACES.
021500     05  MACCT-KEY        PIC X(4)   VALUE SPACES.
021700
021800 01  BLOWUP-SW                     PIC X  VALUE "N".
021900 COPY VCOMAREA OF COPYLIB.
022000
022100 01  FORMFILE.
022200     05  FORM-FNAME                PIC X(8)  VALUE "FFRTCANC".
022300     05  FILLER                    PIC X     VALUE ".".
022400     05  FORM-GNAME.
022500         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
022600         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
022700     05  FILLER                    PIC X(19) VALUE SPACES.
022800
022900 COPY LANGUAGE OF COPYLIB.
023000**********************************************************
023100**       S C R E E N  P R I N T  P A R A M E T E R S    **
023200**********************************************************
023300
023400 01  SCREEN-PRINT-PARMS.
023500     05  PRINT-CTL                   PIC S9(4)  VALUE ZERO COMP.
023600     05  PAGE-CTL                    PIC S9(4)  VALUE 49 COMP.
023700     05  SPOOLFIL-OPEN-SW            PIC X      VALUE "N".
023800
023900 01  PASS-SPOOL-PRT-NO               PIC S9(2)  VALUE ZERO COMP.

024300 PROCEDURE DIVISION.
024400
024500 001-BEGIN SECTION.
024600
024700 010-MAINLINE.
024800     PERFORM 100-BEGIN THRU 199-EXIT.
029600     IF CURRENT-REV > MACCT-MONTH-END-DATE
              GO TO 019-EXIT.
024900     PERFORM 200-PROCESS-UPDATE
025000       UNTIL VIEW-LASTKEY = 3.
025100     PERFORM 1000-CLOSE-FILES.
       019-EXIT.
025200     GOBACK.
025400
025500 100-BEGIN.
025600     MOVE SPACES TO BU-DISPLAY-AREA.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MACCOUNT MMATL-ACCUM MCHT-ACCTS DPOITEM.
           OPEN INPUT DAPPLFRT-I.
      *****OPEN I-O DAPPLFRT MCLASS DTRANS.
           OPEN I-O DAPPLFRT DTRANS.
           OPEN INPUT MCLASS.
025700
030200*----------  GET AND SAVE STOREROOM DEPARTMENT
030300     MOVE "SDPT" TO MACCT-KEY.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-REC.
           READ MACCOUNT INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

031100     IF GOOD-CALL
031200         NEXT SENTENCE
031300     ELSE
031400         MOVE "DBGET MACCOUNT-INFO SDPT * 100-B"
031500             TO BU-DISPLAY-MSG
031600         PERFORM 990-BLOWUP.

031700     MOVE MACCT-STR-DEPT TO SAVE-STR-DEPT.
035100
027700*----------  GET ACCOUNTING MONTH END DATE
027800     MOVE "MTED" TO MACCT-KEY.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-REC.
           READ MACCOUNT INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

028600     IF GOOD-CALL
028700         NEXT SENTENCE
028800     ELSE
028900         MOVE "DBGET MACCOUNT-INFO MTED * 100-B"
029000             TO BU-DISPLAY-MSG
029100         PERFORM 990-BLOWUP.

048600     MOVE 1 TO DATE-MODE.
048800     CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO DATE-DIV.
029300     MOVE MONTH-DIV TO CURR-MO.
029400     MOVE DAY-DIV TO CURR-DA.
029500     MOVE YEAR-DIV TO CURR-YR.

029600     IF CURRENT-REV > MACCT-MONTH-END-DATE
029700        DISPLAY "MONTH END CLOSING IS STILL IN PROGRESS---"
029800        DISPLAY "THIS PROGRAM CANNOT BE RUN UNTIL THAT IS",
029900                  " COMPLETED...."
030000        GO TO 199-EXIT.
030100
035200     OPEN INPUT CARRIER-FILE.

       199-EXIT.
           EXIT.
035300
035600 200-PROCESS-UPDATE.
035700     MOVE UPD-HEADER TO VIEW-NFNAME.
035800
           MOVE INQHDR-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO INQHDR-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
036200     IF VIEW-LASTKEY EQUAL 1 OR
036300        VIEW-LASTKEY EQUAL 2 OR
036400        VIEW-LASTKEY EQUAL 8 OR
036500        VIEW-LASTKEY EQUAL 4 OR
036600        VIEW-LASTKEY EQUAL 7 OR
036700        VIEW-LASTKEY EQUAL 6
036800        PERFORM 940-VSETERROR THRU 949-EXIT
036900        GO TO 200-PROCESS-UPDATE.
037200
037300     IF VIEW-LASTKEY = 3
037400         NEXT SENTENCE
037500     ELSE
037600         PERFORM 210-FIND-FRT-PRO-NO THRU 210-EXIT
037700            UNTIL  VIEW-LASTKEY = 8
037800               OR  VIEW-LASTKEY = 7 OR 2 OR 3
037900     MOVE "YES" TO ERROR-SW.
038100
038200 210-FIND-FRT-PRO-NO.
038700     MOVE HDR-FRT-PRO-NO TO FRT-ARG.
038800
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO FRTPRONO OF DAPPLFRT-REC-I.
           START DAPPLFRT-I KEY = FRTPRONO OF DAPPLFRT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
039500     IF GOOD-CALL
039600         PERFORM 220-GET-FRT-PRO-NO
039700             UNTIL END-OF-CHAIN OR NO-ERRORS = "YES"
039800         MOVE "NO" TO NO-ERRORS
039900         MOVE 0 TO CARR-FOUND
040000                   ITEM-FOUND
040100     ELSE
040200     IF NO-ENTRY
040300*             "** FRIEGHT BILL DOES NOT EXIST - REENTER **"
040400         MOVE  6 TO LANG-SETNUM
040500         MOVE 22 TO LANG-MSGNUM
040600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040700         PERFORM 940-VSETERROR THRU 949-EXIT
040800         PERFORM 800-SHOW-FORM THRU 800-EXIT
040900         GO TO 210-EXIT
041000     ELSE
041100         MOVE "DBFIND DAPPLFRT * 210-FFPN"
041200             TO BU-DISPLAY-MSG
               MOVE FRT-ARG TO BU-DISPLAY-FLD (1)
041300         PERFORM 990-BLOWUP.
041400
041500 210-EXIT.
041600     EXIT.

042000 220-GET-FRT-PRO-NO.
           MOVE 0 TO COND-WORD.
           READ DAPPLFRT-I NEXT INTO BUF-DAPPLFRT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF FRTPRONO OF DAPPLFRT-REC-I NOT = FRT-ARG
               MOVE 15 TO COND-WORD.
042800     IF GOOD-CALL
042900         IF DAPPL-CARRIER = HDR-FRT-CARR
043000             MOVE 1 TO CARR-FOUND
043100             IF DAPPL-ITEM-NUM = HDR-FRT-ITEM
043200                 MOVE 1 TO ITEM-FOUND
043300                 IF DAPPL-CANCEL-FLAG-1 = "X"
043400*             "** FRIEGHT BILL HAS BEEN CANCELLED **"
043500                     MOVE  6 TO LANG-SETNUM
043600                     MOVE 23 TO LANG-MSGNUM
043700                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043800                     PERFORM 940-VSETERROR THRU 949-EXIT
043900                     PERFORM 800-SHOW-FORM THRU 800-EXIT
044000                 ELSE
044100                     PERFORM 230-GET-CARRIER-NAME
044200              ELSE
044300                  NEXT SENTENCE
044400         ELSE
044500             NEXT SENTENCE
044600     ELSE
044700     IF END-OF-CHAIN
044800         IF CARR-FOUND = 1
044900             IF ITEM-FOUND = 1
045000                 NEXT SENTENCE
045100             ELSE
045200*             "** INVALID ITEM FOR THIS FREIGHT BILL - REENTER **"
045300                 MOVE  9 TO LANG-SETNUM
045400                 MOVE 73 TO LANG-MSGNUM
045500                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
045600                 PERFORM 940-VSETERROR THRU 949-EXIT
045700                 PERFORM 800-SHOW-FORM THRU 800-EXIT
045800         ELSE
045900*             "** INVALID CARRIER FOR THIS FREIGHT BILL - REENTER **"
046000             MOVE  9 TO LANG-SETNUM
046100             MOVE 74 TO LANG-MSGNUM
046200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
046300             PERFORM 940-VSETERROR THRU 949-EXIT
046400             PERFORM 800-SHOW-FORM THRU 800-EXIT
046500     ELSE
046600         MOVE "DBGET DAPPLFRT * 220-GFPN" TO BU-DISPLAY-MSG
               MOVE FRT-ARG TO BU-DISPLAY-FLD (1)
046700         PERFORM 990-BLOWUP.
046900
047000 230-GET-CARRIER-NAME.
047100     MOVE DAPPL-CARRIER TO CARRIER-CODE.
047200
047300     READ CARRIER-FILE
047500          INVALID KEY MOVE "CARRIER NOT FOUND" TO CARRIER-NAME.
047600
047700     MOVE CARRIER-NAME TO DTL-CARRIER-NAME.
047800     MOVE DAPPL-CARRIER TO DTL-CARRIER-CODE.
047900     MOVE DAPPL-PO-NUM TO DTL-PO-NUMBER.
048000     MOVE DAPPL-RCVR TO DTL-RCVR.
048100     MOVE DAPPL-ITEM-NUM TO DTL-ITEM.
048200     MOVE DAPPL-RAIL-CAR TO DTL-RAIL-CAR.
048300     MOVE DAPPL-CORP-CODE TO DTL-MATL-CODE.
048400     MOVE DAPPL-PRO-NO TO DTL-FRT-PRO-NO.
048500     MOVE DAPPL-TERMS TO DTL-TERMS.
048600     MOVE 4 TO DATE-MODE.
048700     MOVE DAPPL-PAID-DATE TO DATE-VALIDATE-IN.
048800     CALL "TDATECHK" USING DATE-CHECK-AREA.
048900     MOVE DATE-OUT TO DTL-PAID-DATE.
049000     MOVE DAPPL-PAID-AMT TO VALUE-UNSIGNED.
049100     MOVE VALUE-UNSIGNED TO VALUE-HOLD.
049200     MOVE VALUE-1 TO DTL-PAID-DOL.
049300     MOVE VALUE-2 TO DTL-PAID-DEC.
049400     IF DAPPL-PAID-AMT < 0
049500         MOVE "-" TO DTL-PAID-SIGN
049600     ELSE
049700         MOVE "+" TO DTL-PAID-SIGN.
049800     MOVE 0 TO VALUE-UNSIGNED
049900               VALUE-HOLD.
050000     MOVE 4 TO DATE-MODE.
050100     MOVE DAPPL-SHIP-DATE TO DATE-VALIDATE-IN.
050200     CALL "TDATECHK" USING DATE-CHECK-AREA.
050300     MOVE DATE-OUT TO DTL-SHIP-DATE.
050400     MOVE DAPPL-RATED-AMT TO VALUE-UNSIGNED.
050500     MOVE VALUE-UNSIGNED TO VALUE-HOLD.
050600     MOVE VALUE-1 TO DTL-RATED-DOL.
050700     MOVE VALUE-2 TO DTL-RATED-DEC.
050800     IF DAPPL-RATED-AMT < 0
050900         MOVE "-" TO DTL-RATED-SIGN
051000     ELSE
051100         MOVE "+" TO DTL-RATED-SIGN.
051200     MOVE 0 TO VALUE-UNSIGNED
051300               VALUE-HOLD.
051400     MOVE DAPPL-USE-TAX TO VALUE-UNSIGNED.
051500     MOVE VALUE-UNSIGNED TO VALUE-HOLD.
051600     MOVE VALUE-1 TO DTL-TAX-DOL.
051700     MOVE VALUE-2 TO DTL-TAX-DEC.
051800     IF DAPPL-USE-TAX < 0
051900         MOVE "-" TO DTL-TAX-SIGN
052000     ELSE
052100         MOVE "+" TO DTL-TAX-SIGN.
052200     MOVE 0 TO VALUE-UNSIGNED
052300               VALUE-HOLD.
052400
052500     MOVE ADD-DATE TO VIEW-NFNAME.
           MOVE ADD-DATE-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO ADD-DATE-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
036100
055100     IF VIEW-LASTKEY = 7 OR 3
055200         NEXT SENTENCE
055300     ELSE
055400     IF VIEW-LASTKEY = 2
055500         PERFORM 250-ADD-CANCEL-FLAG THRU 250-EXIT.
056000
056100 250-ADD-CANCEL-FLAG.
           MOVE HDR-FRT-PRO-NO TO FRT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE FRT-ARG TO FRTPRONO OF DAPPLFRT-REC.
           START DAPPLFRT KEY = FRTPRONO OF DAPPLFRT-REC
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF NOT GOOD-CALL
              GO TO 250-EXIT.

       250-LOOP.
           MOVE 0 TO COND-WORD.
           READ DAPPLFRT NEXT INTO BUF-DAPPLFRT
                AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF NOT GOOD-CALL
              GO TO 250-EXIT.
           IF FRTPRONO OF DAPPLFRT-REC NOT = FRT-ARG
              GO TO 250-EXIT.
           IF DAPPL-CARRIER = HDR-FRT-CARR
              IF DAPPL-ITEM-NUM = HDR-FRT-ITEM
                 NEXT SENTENCE
              ELSE
                 GO TO 250-LOOP
            ELSE
              GO TO 250-LOOP.

056400     MOVE DAPPL-PO-NUM TO KEY-PO-NO.
056500     MOVE 1 TO DATE-MODE.
056600     CALL "TDATECHK" USING DATE-CHECK-AREA.
056700     MOVE DATE-YMD-OUT TO DAPPL-CANCEL-DATE.
056800     MOVE "X" TO DAPPL-CANCEL-FLAG-1.
           MOVE DTL-MONEY-FLAG TO DAPPL-CANCEL-FLAG-2.
058200
           MOVE 0 TO COND-WORD.
           REWRITE DAPPLFRT-REC FROM BUF-DAPPLFRT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
058900     IF GOOD-CALL
059000         NEXT SENTENCE
059100     ELSE
059200         MOVE "DBUPDATE DAPPLFRT * 250-LOOP"
059300             TO BU-DISPLAY-MSG
059400         PERFORM 990-BLOWUP.
059500
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO FRTPRONO  OF DAPPLFRT-REC.
           START DAPPLFRT KEY > FRTPRONO OF DAPPLFRT-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
060000     IF GOOD-CALL
060100         NEXT SENTENCE
060200     ELSE
060300         MOVE "DBUNLOCK DAPPLFRT * 250-LOOP"
060400             TO BU-DISPLAY-MSG
060500         PERFORM 990-BLOWUP.
060600
060700*----------  IF TRANSACTION IS A MANUAL, THERE ARE NO DTRANS
060800*            ENTRIES, BUT THERE ARE THOUSANDS OF ENTRIES WITHOUT
060900*            PO NUMBER WHICH REALLY SLOWS DOWN PROCESSING AND
061000*            ACCOMPLISHES NOTHING, SO SKIP ADD-DTRANS
061100     IF DAPPL-PO-NUM NOT = SPACES
061600        IF DTL-MONEY-FLAG = "Y"
061610           PERFORM 270-ADD-DTRANS
061620           IF DAPPL-CORP-CODE = "NON-STR"
061630               NEXT SENTENCE
061640           ELSE
                     IF TRANS-DEPT = SAVE-STR-DEPT
061700                   PERFORM 260-UPDATE-MMATL-ACCUM.

       250-EXIT.
           EXIT.
066200
066300 260-UPDATE-MMATL-ACCUM.
066400     MOVE DAPPL-CORP-CODE TO MMATL-CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-REC.
           READ MMATL-ACCUM  INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

067200     IF GOOD-CALL
067300         NEXT SENTENCE
067400     ELSE
067500         MOVE "DBGET MMATL-ACCUM * 260-UMA" TO BU-DISPLAY-MSG
               MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
067600         MOVE DAPPL-PRO-NO TO BU-DISPLAY-FLD (2)
067700         PERFORM 990-BLOWUP.
067800
067900     IF DAPPL-PAID-AMT > 0
068000        SUBTRACT DAPPL-PAID-AMT FROM MATL-INV-DOLLARS
068100     ELSE
068200        SUBTRACT DAPPL-RATED-AMT FROM MATL-INV-DOLLARS.

068300     MOVE SPACES TO BU-DISPLAY-MSG.
068400     CALL "SUPDMATL" USING ACCTG-BASE, BUF-MATLACUM,
068500                     STATUS-AREA, BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
068600     IF BU-DISPLAY-MSG NOT = SPACES
068700        PERFORM 990-BLOWUP.
068800
      ****************************************************************
      *** 06/29/92 COMMENTED OUT THE FOLLOWING PARAGRAPH AND ITS EXIT
      *** SINCE IT WAS NEVER BEING EXECUTED ANYWAYS.  ---DAVE PLUM
      ****************************************************************
068900*265-GET-MCLASS.
069000*    MOVE TRANS-CLASS TO CLASS-ARG.
      *    MOVE 0 TO COND-WORD.
      *    MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-REC.
      *    READ MCLASS INTO BUF-MCLASS
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS-1 = "2"
      *        MOVE 17 TO COND-WORD
      *    ELSE
      *    IF FILE-STATUS NOT = "00"
      *        MOVE 99 TO COND-WORD.
069800*    IF GOOD-CALL
069900*        NEXT SENTENCE
070000*    ELSE
070100*        GO TO 265-EXIT.
070200*
070300*    SUBTRACT DAPPL-RATED-AMT FROM MCLASS-DCHG-DOLLARS.
070400*
      *    MOVE 0 TO COND-WORD.
      *    REWRITE MCLASS-REC FROM BUF-MCLASS
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE 99 TO COND-WORD.
      *
072300*    IF GOOD-CALL
072400*        NEXT SENTENCE
072500*    ELSE
072600*        MOVE "DBUPDATE MCLASS * 265-GET" TO BU-DISPLAY-MSG
072700*        MOVE DAPPL-PRO-NO TO BU-DISPLAY-FLD (1)
072800*        PERFORM 990-BLOWUP.
072900*
      *------- DO A START > HIGH-VALUES TO UNLOCK
      *    MOVE HIGH-VALUES TO ACTGCLASS  OF MCLASS-REC.
      *    START MCLASS KEY > ACTGCLASS OF MCLASS-REC
      *        INVALID KEY MOVE "00" TO FILE-STATUS.
073500*    IF GOOD-CALL
073600*        NEXT SENTENCE
073700*    ELSE
073800*        MOVE "DBUNLOCK MCLASS * 265-GET" TO BU-DISPLAY-MSG
073900*        MOVE DAPPL-PRO-NO TO BU-DISPLAY-FLD (1)
074000*        PERFORM 990-BLOWUP.
074100*
074200*265-EXIT.
      *    EXIT.
      ***************************************************************
074300
074400 270-ADD-DTRANS.
074500     MOVE SPACES TO BUF-DTRANS.
074600     PERFORM 642-GET-ITEM-DATA THRU 642-EXIT.
074700     MOVE 1 TO DATE-MODE.
074800     CALL "TDATECHK" USING DATE-CHECK-AREA.
074900     MOVE DATE-YMD-OUT TO TRANS-DATE.
075000     MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME.
075100     MOVE DAPPL-CORP-CODE       TO TRANS-STORES-CODE.
075200     MOVE DAPPL-PO-NUM          TO TRANS-PO-NUM.
075300     MOVE DAPPL-RCVR            TO TRANS-RCVR-NUM.
075400     MOVE DAPPL-ITEM-NUM        TO TRANS-ITEM-NUM.
075500     MOVE DAPPL-PRO-NO          TO TRANS-DOCUMENT-NUM.
075700     MOVE "CANC"                TO TRANS-EMP.
075800     MOVE "FRT"                 TO TRANS-CODE.
           MOVE ZEROES                TO TRANS-QTY TRANS-BALANCE-QTY.
075900     IF DAPPL-PAID-AMT > 0
076000        COMPUTE TRANS-VALUE = DAPPL-PAID-AMT * -1
076100     ELSE
076200        COMPUTE TRANS-VALUE = DAPPL-RATED-AMT * -1.
077500
           MOVE 0 TO COND-WORD.
           WRITE DTRANS-REC FROM BUF-DTRANS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
077800     IF GOOD-CALL
077900         NEXT SENTENCE
078000     ELSE
078100         MOVE "DBPUT DTRANS * 270-AD" TO BU-DISPLAY-MSG
               MOVE TRANS-STORES-CODE TO BU-DISPLAY-FLD (1)
               MOVE DAPPL-PRO-NO      TO BU-DISPLAY-FLD (2)
               MOVE TRANS-PO-NUM      TO BU-DISPLAY-FLD (3)
               MOVE TRANS-RCVR-NUM    TO BU-DISPLAY-FLD (4)
               MOVE TRANS-ITEM-NUM    TO BU-DISPLAY-FLD (5)
078200         PERFORM 990-BLOWUP.
078300
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO MATLCODE OF DTRANS-REC.
           START DTRANS KEY > MATLCODE OF DTRANS-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
078800     IF GOOD-CALL
078900         NEXT SENTENCE
079000     ELSE
079100         MOVE "DBUNLOCK DTRANS * 270-AD" TO BU-DISPLAY-MSG
079300         PERFORM 990-BLOWUP.

079400*----------  GET PO ITEM DATA FOR PUTTING DTRANS
079500 642-GET-ITEM-DATA.
079600     MOVE "P" TO KEY-REC-ID.
079700     MOVE "000 "   TO TRANS-CLASS.
079800     MOVE "0000  " TO TRANS-DEPT.
079900     MOVE "000000" TO TRANS-ACCT.
           MOVE 0 TO COND-WORD.
           MOVE CSIS-PO-ARG    TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
080700     IF NOT GOOD-CALL
080800        GO TO 642-EXIT.
080900
081000 642-DBGET.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = CSIS-PO-ARG
               MOVE 15 TO COND-WORD.
081800     IF GOOD-CALL
081900        IF DAPPL-ITEM-NUM = ITM-NUMBER
082000           MOVE ITM-CLASS TO TRANS-CLASS
082100           MOVE ITM-SUB-DETL TO TRANS-DEPT
082200           MOVE ITM-ADDL-DATA TO TRANS-ACCT
082300           PERFORM 643-VALIDATE-DEPT
                 PERFORM 644-VALIDATE-CLASS
082400        ELSE
082500           GO TO 642-DBGET
082600     ELSE
082700        IF END-OF-CHAIN
082800           GO TO 642-EXIT
082900        ELSE
083000           MOVE "DBGET DPOITEM 642-DBGET" TO BU-DISPLAY-MSG
083100           MOVE CSIS-PO-ARG TO BU-DISPLAY-FLD (1)
083200           PERFORM 990-BLOWUP.

083300 642-EXIT.
           EXIT.
083400
083500 643-VALIDATE-DEPT.
083600     MOVE TRANS-DEPT TO DEPT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHT-ACCTS-REC.
           READ MCHT-ACCTS INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

084400     IF GOOD-CALL
084500         NEXT SENTENCE
084600     ELSE
084700         IF NO-ENTRY
084800            MOVE "0000  " TO TRANS-DEPT
084900         ELSE
085000            MOVE "DBGET MCHT-ACCTS * 643-V-D" TO BU-DISPLAY-MSG
                  MOVE DEPT-ARG TO BU-DISPLAY-FLD (1)
085100            PERFORM 990-BLOWUP.
085200
       644-VALIDATE-CLASS.
           MOVE TRANS-CLASS TO CLASS-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-REC.
           READ MCLASS INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               IF NO-ENTRY
                   MOVE "000 " TO TRANS-CLASS
               ELSE
                   MOVE "DBGET MCLASS * 644-V-C" TO BU-DISPLAY-MSG
                   MOVE CLASS-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP.

085300 645-INIT-TABLES.
085400     MOVE SPACES TO ACCT-CHARA (SUB)
085500                    ACCT-CHARB (SUB).
085600
085700 646-CHECK-ACCT.
085800     MOVE TRANS-ACCT TO ACCT-TABLE-BEFORE.
085900     PERFORM 647-FIND-CHAR
086000        VARYING SUB FROM 1 BY 1
086100            UNTIL SUB > 6 OR ACCT-FOUND = 1.
086200     MOVE 0 TO ACCT-FOUND.
086300     IF SUB > 6
086400         NEXT SENTENCE
086500     ELSE
086600         MOVE ACCT-TABLE-AFTER TO TRANS-ACCT-HOLD
086700         INSPECT TRANS-ACCT-HOLD REPLACING LEADING SPACES BY
086800                   ZERO
086900         MOVE TRANS-ACCT-HOLD TO TRANS-ACCT.
087000
087100 647-FIND-CHAR.
087200     IF ACCT-CHARB (SUB) NOT NUMERIC
087300         MOVE 1 TO ACCT-FOUND
087400         SUBTRACT 1 FROM SUB
087500         MOVE 6 TO NEW-SUB
087600         PERFORM 648-MOVE-CHAR
087700            VARYING SUB1 FROM SUB BY COUNT-BACK
087800                 UNTIL SUB1 = 0
087900     ELSE
088000         NEXT SENTENCE.
088100
088200 648-MOVE-CHAR.
088300     MOVE ACCT-CHARB (SUB1) TO ACCT-CHARA (NEW-SUB).
088400     SUBTRACT 1 FROM NEW-SUB.
089400
089500 800-SHOW-FORM.
           MOVE INQHDR-BUFFER TO DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC TO INQHDR-BUFFER.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
091700 800-EXIT.
091800     EXIT.

128700 940-VSETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE,
                                  DE-MESSAGE-LINE2.

048600 949-EXIT.
           EXIT.

093000************************************************************
093100*                    B L O W U P                           *
093200*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
093300*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
093400*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
093500*                                                          *
093600*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
093700*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
093800*                                                          *
093900*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
094000************************************************************
094100 990-BLOWUP.
094200     MOVE "TFRTCANC"   TO BU-PGM-NAME.
094300     CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
094400           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
094500           BU-DISPLAY-FLDS.

094600 999-EXIT.
           EXIT.
094700
094800 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

096400 999-CATREAD-EXIT.
096500     EXIT.
096600
096700 1000-CLOSE-FILES.
           CLOSE MACCOUNT MMATL-ACCUM MCLASS MCHT-ACCTS DPOITEM.
           CLOSE DISPLAY-FILE.
           CLOSE DAPPLFRT DTRANS.
