       IDENTIFICATION DIVISION.
       PROGRAM-ID.           TFRTCONV.
       AUTHOR.               RAGLOW/KALMAN.
       DATE-WRITTEN.         FEB 20, 1992.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *D TFRTCONV. THIS PROGRAM WILL CONVERT THE INPUT FILE WITH THE
      *D           OLD DAPPLFRT FORMAT TO THE NEW DAPPLFRT FORMAT IN
      *D           THE OUTPUT FILE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.      HP-3000.
       OBJECT-COMPUTER.      HP-3000.

       SPECIAL-NAMES. C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT OLD-DAPPLFRT-PO-I
              ASSIGN TO DATABASE-MCFLCA0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

      *    SELECT NEW-DAPPLFRT-PO-O
      *       ASSIGN TO DATABASE-MCFLCA1101
      *       ORGANIZATION IS INDEXED
      *          ACCESS MODE IS DYNAMIC
      *       RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
      *          WITH DUPLICATES
      *       FILE STATUS IS FILE-STATUS.
           SELECT NEW-DAPPLFRT-O
                  ASSIGN TO DATABASE-MCFPCA1100.

       DATA DIVISION.

       FILE SECTION.

       FD  OLD-DAPPLFRT-PO-I
           LABEL RECORDS ARE STANDARD.
       01  OLD-DAPPLFRT-PO-REC-I.
           COPY DDS-MCRPCA0800  OF MCFLCA0801.

      *FD  NEW-DAPPLFRT-PO-O
      *    LABEL RECORDS ARE STANDARD.
      *01  NEW-DAPPLFRT-PO-REC-O.
      *    COPY DDS-MCRPCA1100  OF MCFLCA1101.
       FD  NEW-DAPPLFRT-O
           LABEL RECORDS ARE STANDARD.
       01  NEW-DAPPLFRT-REC-O.
           COPY DDS-MCRPCA1100  OF MCFPCA1100.

       WORKING-STORAGE SECTION.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       01  EOF-OLD-DAPPLFRT              PIC X.
       01  FIRST-PASS                    PIC X.
       01  DAPPLFRT-IX            PIC 9(4) COMP-4.

       01  PO-14-ARG                          VALUE SPACES.
           05  PO-11-ARG.
               10  PO-PREFIX-ARG    PIC X.
               10  PO-10-ARG.
                   15  PO-NUM-ARG   PIC X(7).
                   15  PO-RLS-ARG   PIC X(3).
           05  PO-RCVR-ARG          PIC X(3).
       01  PO-14-ARG-DUP            REDEFINES PO-14-ARG.
           05  PO-PREFIX-ARG-DUP    PIC X.
           05  PO-13-ARG            PIC X(13).

       01  CONVERTED-DATE.
           05  CONV-DATE-CC         PIC X(2)  VALUE "20".
           05  CONV-DATE-YMD        PIC X(6).

      ************************************************************
      **                                                        **
      **           D A T A B A S E   B U F F E R S              **
      **                                                        **
      ************************************************************

       01  BUF-OLD-DAPPLFRT.
           05  OLD-PO-NUM                   PIC X(10).
           05  OLD-ITEM-NUM                 PIC X(4).
           05  OLD-RCVR                     PIC X(4).
           05  OLD-CARRIER                  PIC X(4).
           05  OLD-PRO-NO                   PIC X(16).
           05  OLD-RAIL-CAR                 PIC X(10).
           05  OLD-PAID-DATE.
               10  OLD-PAID-YY              PIC XX.
               10  OLD-PAID-MM              PIC XX.
               10  OLD-PAID-DD              PIC XX.
           05  OLD-SHIP-DATE.
               10  OLD-SHIP-YY              PIC XX.
               10  OLD-SHIP-MM              PIC XX.
               10  OLD-SHIP-DD              PIC XX.
           05  OLD-PROC-DATE                PIC X(6).
           05  OLD-CORP-CODE                PIC X(8).
           05  OLD-TERMS                    PIC X(2).
           05  OLD-RATED-AMT                PIC S9(12)V99.
           05  OLD-PAID-AMT                 PIC S9(12)V99.
           05  OLD-USE-TAX                  PIC S9(12)V99.
           05  OLD-CANCEL-FLAG.
               10  OLD-CANCEL-FLAG-1        PIC X(1).
               10  OLD-CANCEL-FLAG-2        PIC X(1).
           05  OLD-CANCEL-DATE              PIC X(6).
           05  OLD-WRITEOFF-FLAG            PIC XX.
           05  OLD-WRITEOFF-DATE            PIC X(6).
           05  OLD-RATED-CARRIER            PIC X(4).

       01  BUF-HOLD-DAPPLFRT.
           05  HOLD-PO-NUM                   PIC X(10).
           05  HOLD-ITEM-NUM                 PIC X(4).
           05  HOLD-RCVR                     PIC X(4).
           05  HOLD-CARRIER                  PIC X(4).
           05  HOLD-PRO-NO                   PIC X(16).
           05  HOLD-RAIL-CAR                 PIC X(10).
           05  HOLD-PAID-DATE.
               10  HOLD-PAID-YY              PIC XX.
               10  HOLD-PAID-MM              PIC XX.
               10  HOLD-PAID-DD              PIC XX.
           05  HOLD-SHIP-DATE.
               10  HOLD-SHIP-YY              PIC XX.
               10  HOLD-SHIP-MM              PIC XX.
               10  HOLD-SHIP-DD              PIC XX.
           05  HOLD-PROC-DATE                PIC X(6).
           05  HOLD-CORP-CODE                PIC X(8).
           05  HOLD-TERMS                    PIC X(2).
           05  HOLD-RATED-AMT                PIC S9(12)V99.
           05  HOLD-PAID-AMT                 PIC S9(12)V99.
           05  HOLD-USE-TAX                  PIC S9(12)V99.
           05  HOLD-CANCEL-FLAG.
               10  HOLD-CANCEL-FLAG-1        PIC X(1).
               10  HOLD-CANCEL-FLAG-2        PIC X(1).
           05  HOLD-CANCEL-DATE              PIC X(6).
           05  HOLD-WRITEOFF-FLAG            PIC XX.
           05  HOLD-WRITEOFF-DATE            PIC X(6).
           05  HOLD-RATED-CARRIER            PIC X(4).

       01  BUF-NEW-DAPPLFRT.
           05  NEW-PO-14.
               10  NEW-PO-11.
                   15  NEW-PO-PREFIX        PIC X.
                   15  NEW-PO-10.
                       20  NEW-PO-NUM       PIC X(7).
                       20  NEW-PO-RLS       PIC X(3).
               10  NEW-PO-RCVR              PIC X(3).
           05  NEW-PO-14-DUP                REDEFINES NEW-PO-14.
               10  NEW-PO-PREFIX-DUP        PIC X(1).
               10  NEW-PO-13                PIC X(13).
           05  NEW-TIS-PAID-DATE.
               10  NEW-TIS-PAID-YYYY        PIC X(4).
               10  NEW-TIS-PAID-MM          PIC XX.
               10  NEW-TIS-PAID-DD          PIC XX.
           05  NEW-TIS-SHIP-DATE.
               10  NEW-TIS-SHIP-YYYY        PIC X(4).
               10  NEW-TIS-SHIP-MM          PIC XX.
               10  NEW-TIS-SHIP-DD          PIC XX.
           05  NEW-RAIL-CAR                 PIC X(10).
           05  NEW-TERMS                    PIC X(2).

           05  NEW-RATED-RCV-DATE           PIC X(8).
           05  NEW-RATED-CARRIER            PIC X(4).
           05  NEW-RATED-PRO-NO             PIC X(16).
           05  NEW-RATED-AMT                PIC S9(12)V99.
           05  NEW-RATED-APPL-DATE          PIC X(8).
           05  NEW-RATED-APPL-TIME          PIC X(6).

           05  NEW-PAID-RCV-DATE            PIC X(8).
           05  NEW-PAID-CARRIER             PIC X(4).
           05  NEW-PAID-PRO-NO              PIC X(16).
           05  NEW-PAID-AMT                 PIC S9(12)V99.
           05  NEW-PAID-TAX                 PIC S9(12)V99.
           05  NEW-PAID-APPL-DATE           PIC X(8).
           05  NEW-PAID-APPL-TIME           PIC X(6).

           05  NEW-MULTI-PO-FLAG            PIC X(2).

           05  NEW-STATUS.
               10  NEW-STATUS-1             PIC X(1).
               10  NEW-STATUS-2             PIC X(1).
           05  NEW-STATUS-DATE              PIC X(8).
           05  NEW-PAD-20                   PIC X(20).

      **********************************************************
      *              D A T A    B A S E                        *
      **********************************************************
       COPY DBCSACCT OF COPYLIB.
       COPY DATAB    OF COPYLIB.


       COPY TBLOWUP  OF COPYLIB.
       COPY VCOMAREA OF COPYLIB.

       PROCEDURE DIVISION.
       00-MAILINE.
           PERFORM 01-HSK.
           PERFORM 06-MAIN THRU 06-MAIN-X
              UNTIL EOF-OLD-DAPPLFRT = "Y".
           PERFORM 02-EOJ.
           GOBACK.

       01-HSK.
           OPEN INPUT  OLD-DAPPLFRT-PO-I.
           OPEN OUTPUT NEW-DAPPLFRT-O.

           MOVE SPACES TO PO-14-ARG.
           PERFORM 99-START-OLD-DAPPLFRT-GE-PO-I.
           PERFORM 99-READ-NEXT-OLD-DAPPLFRT-PO-I.
           MOVE "Y" TO FIRST-PASS.

       02-EOJ.
      *----ON EOF NEED TO WRITE LAST RECORD THAT WAS BEING FORMED.

           WRITE NEW-DAPPLFRT-REC-O FROM BUF-NEW-DAPPLFRT.
      *       INVALID KEY
      *          MOVE "WRITE DAPPLFRT*02-EOJ" TO BU-DISPLAY-MSG
      *          MOVE NEW-PO-14   TO BU-DISPLAY-FLD (1)
      *          MOVE DAPPLFRT-IX TO BU-DISPLAY-FLD (2)
      *          PERFORM 99-BLOWUP.

           CLOSE OLD-DAPPLFRT-PO-I
                 NEW-DAPPLFRT-O.

       06-MAIN.

      *----SKIP ALL CANCELED RECORDS UNLESS THEY ARE "MANUALS".

           IF OLD-CANCEL-FLAG-1 = "X"
              AND OLD-ITEM-NUM NOT = "MANL"
                  PERFORM 99-READ-NEXT-OLD-DAPPLFRT-PO-I
                  GO TO 06-MAIN-X.

      *----SKIP ALL MANUALS THAT WERE PAID PRIOR TO JUN 01, 93
      *----FOR A NEGATIVE VALUE.

           IF OLD-ITEM-NUM = "MANL"
      *       DISPLAY OLD-CARRIER "-" OLD-PRO-NO " IS MANUAL"
      *       DISPLAY "IF PAID-DATE OF " OLD-PAID-DATE
              IF OLD-PAID-DATE < "930601"
      *          DISPLAY "IS LESS THAN 930601"
      *          DISPLAY "AND RATED AMT OF " OLD-RATED-AMT
                 IF OLD-PAID-AMT < 0
      *             DISPLAY "IS LESS THAN 0 SO SKIP THIS REC"
                    PERFORM 99-READ-NEXT-OLD-DAPPLFRT-PO-I
                    GO TO 06-MAIN-X.

      *----SKIP RATED RECORDS THAT DON'T HAVE A PO NUMBER. THESE
      *----ARE CONSIDERED ERRORS IN THE NEW FRT SYSTEM.

           IF OLD-PAID-DATE = SPACES
              AND OLD-PO-NUM = SPACES
                 PERFORM 99-READ-NEXT-OLD-DAPPLFRT-PO-I
                 GO TO 06-MAIN-X.

      *----VERIFY THE RECORD IS PART OF THE SAME PO FOR CONSOLIDATION.
      *----REC'S WITH BLANK PO-NUM ARE CONSIDERED SEPARATE PO'S; THEY
      *----WILL NOT BE CONSOLIDATED.

           IF OLD-PO-NUM NOT = SPACES       AND
              OLD-PO-NUM     = HOLD-PO-NUM  AND
              OLD-RCVR       = HOLD-RCVR    AND
              OLD-PRO-NO     = HOLD-PRO-NO

                 ADD OLD-RATED-AMT TO NEW-RATED-AMT
                 ADD OLD-PAID-AMT  TO NEW-PAID-AMT
           ELSE
              IF FIRST-PASS = "N"
                 WRITE NEW-DAPPLFRT-REC-O FROM BUF-NEW-DAPPLFRT
      *             INVALID KEY
      *               MOVE "WRITE DAPPLFRT*06-MAIN" TO BU-DISPLAY-MSG
      *               MOVE NEW-PO-14 TO BU-DISPLAY-FLD (1)
      *               MOVE DAPPLFRT-IX TO BU-DISPLAY-FLD (2)
      *               PERFORM 99-BLOWUP
      *          END-WRITE
              ELSE
                 MOVE "N" TO FIRST-PASS
              END-IF

              MOVE BUF-OLD-DAPPLFRT TO BUF-HOLD-DAPPLFRT
              INITIALIZE BUF-NEW-DAPPLFRT

              IF OLD-PO-NUM > SPACES
                 MOVE "P"               TO   NEW-PO-PREFIX
                 MOVE OLD-PO-NUM        TO   NEW-PO-10
                 MOVE OLD-RCVR          TO   NEW-PO-RCVR
               END-IF

              IF OLD-PAID-DATE > SPACES
                 MOVE OLD-PAID-DATE     TO   CONV-DATE-YMD
                 MOVE CONVERTED-DATE    TO   NEW-TIS-PAID-DATE
              END-IF
              IF OLD-SHIP-DATE > SPACES
                 MOVE OLD-SHIP-DATE     TO   CONV-DATE-YMD
                 MOVE CONVERTED-DATE    TO   NEW-TIS-SHIP-DATE
              END-IF

              MOVE   OLD-RAIL-CAR       TO   NEW-RAIL-CAR
              MOVE   OLD-TERMS          TO   NEW-TERMS
              MOVE   OLD-CANCEL-FLAG-1  TO   NEW-STATUS-1
              MOVE   "*"                TO   NEW-STATUS-2
              IF OLD-CANCEL-DATE > SPACES
                 MOVE   OLD-CANCEL-DATE    TO   CONV-DATE-YMD
                 MOVE   CONVERTED-DATE     TO   NEW-STATUS-DATE
              END-IF

              IF OLD-PAID-DATE > SPACES
                 PERFORM 61-FILL-IN-PAID-FIELDS
              END-IF

              IF OLD-PROC-DATE > SPACES
                 PERFORM 62-FILL-IN-RATED-FIELDS
              END-IF

              IF OLD-PROC-DATE = SPACES AND
                 OLD-PAID-DATE = SPACES
                    MOVE OLD-SHIP-DATE TO OLD-PROC-DATE
                    PERFORM 62-FILL-IN-RATED-FIELDS
              END-IF.

           PERFORM 99-READ-NEXT-OLD-DAPPLFRT-PO-I.

       06-MAIN-X.
           EXIT.

       61-FILL-IN-PAID-FIELDS.
           MOVE  NEW-TIS-PAID-DATE  TO  NEW-PAID-RCV-DATE.
           MOVE  OLD-CARRIER        TO  NEW-PAID-CARRIER.
           MOVE  OLD-PRO-NO         TO  NEW-PAID-PRO-NO.
           MOVE  OLD-PAID-AMT       TO  NEW-PAID-AMT.
           IF NEW-PO-14 > SPACES
              MOVE "120000"          TO NEW-PAID-APPL-TIME
              MOVE NEW-TIS-PAID-DATE TO NEW-PAID-APPL-DATE.

       62-FILL-IN-RATED-FIELDS.
           MOVE  OLD-PROC-DATE      TO  CONV-DATE-YMD.
           MOVE  CONVERTED-DATE     TO  NEW-RATED-RCV-DATE.
           IF OLD-RATED-CARRIER = SPACES
              MOVE OLD-CARRIER TO NEW-RATED-CARRIER
           ELSE
              MOVE  OLD-RATED-CARRIER  TO  NEW-RATED-CARRIER.
           MOVE  OLD-PRO-NO         TO  NEW-RATED-PRO-NO.
           MOVE  OLD-RATED-AMT      TO  NEW-RATED-AMT.
           IF NEW-PO-14 > SPACES
              MOVE "120000"           TO  NEW-RATED-APPL-TIME
              MOVE NEW-RATED-RCV-DATE TO  NEW-RATED-APPL-DATE.

      *-----------------------------------------------------------------
      *  UTILITY SECTION
      *-----------------------------------------------------------------

       99-BLOWUP.
           MOVE "TFRTCONV" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                BU-DISPLAY-FLDS.

      *---------------------------------
      *  OLD DAPPLFRT
      *---------------------------------

       99-START-OLD-DAPPLFRT-GE-PO-I.
           MOVE PO-10-ARG TO PONUM OF OLD-DAPPLFRT-PO-REC-I.
           START OLD-DAPPLFRT-PO-I KEY >= PONUM OF OLD-DAPPLFRT-PO-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "START OLD-DAPPLFRT*99-SODGPI" TO BU-DISPLAY-MSG
              MOVE PO-10-ARG TO BU-DISPLAY-FLD (1)
              PERFORM 99-BLOWUP.

       99-READ-NEXT-OLD-DAPPLFRT-PO-I.
           READ OLD-DAPPLFRT-PO-I NEXT INTO BUF-OLD-DAPPLFRT
              AT END MOVE "Y" TO EOF-OLD-DAPPLFRT.

