       IDENTIFICATION DIVISION.
       PROGRAM-ID.           TFRTINQ.
       AUTHOR.               KALMAN.
       DATE-WRITTEN.         JULY 1993.
      *INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.

      *D* REMARKS.
      *D*     THIS IS AN ONLINE PROGRAM THAT WILL ALLOW THE USER
      *D*     TO INQUIRE ON ANY FREIGHT RECORD.  IT USES SFRTINQ.
      *D*
      *C* CHANGES.
      *C*
      *C* MAY 22, 1996    CA YODER
      *C* ADDED NUMBERS TO "PROBLEM ON LOAD SFL WRITE" MESSAGE TO
      *C* BETTER IDENTIFY WHERE PROBLEM OCCURRED IN BLOW-UP MESSAGE.
      *C*
      *C* 01/08/2004    CA YODER
      *C* INCREASED RELATIVE RECORD NUMBER FIELD SIZE FROM 4 TO 5.
      *C*
      *C* 04/29/2004    CA YODER
      *C* INCREASED SUBFILE SIZE FROM 4000 TO 9000.
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZFREIGHT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS SUBFILE-IX
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT DAPPLFRT-O
                  ASSIGN TO DATABASE-MCFPCA1100
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS DAPPLFRT-IX
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-I
                  ASSIGN TO DATABASE-MCFPCA1100
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS DAPPLFRT-IX
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-PO-I
                  ASSIGN TO DATABASE-MCFLCA1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-PCP-I
                  ASSIGN TO DATABASE-MCFLCA1103
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-RCP-I
                  ASSIGN TO DATABASE-MCFLCA1104
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-PPRO-I
                  ASSIGN TO DATABASE-MCFLCA1106
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-RPRO-I
                  ASSIGN TO DATABASE-MCFLCA1107
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DAPPLFRT-VS-I
                  ASSIGN TO DATABASE-MCFLCA1105
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(1000).

       FD  DAPPLFRT-O
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-REC-O.
           COPY DDS-MCRPCA1100  OF MCFPCA1100.

       FD  DAPPLFRT-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-REC-I.
           COPY DDS-MCRPCA1100  OF MCFPCA1100.

       FD  DAPPLFRT-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-PO-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1101.

       FD  DAPPLFRT-PCP-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-PCP-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1103.

       FD  DAPPLFRT-RCP-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-RCP-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1104.

       FD  DAPPLFRT-PPRO-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-PPRO-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1106.

       FD  DAPPLFRT-RPRO-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-RPRO-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1107.

       FD  DAPPLFRT-VS-I
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-VS-REC-I.
           COPY DDS-MCRPCA1100  OF MCFLCA1105.

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************
      *-----------------------------------------------------------------
      *  Q C M D E X C   F I E L D S
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  D A T E   &   T I M E   F I E L D S
      *-----------------------------------------------------------------

       01  CUR-DATE.
           05  CUR-DATE-CC                PIC X(2).
           05  CUR-SYSTEM-DATE.
               10  CUR-DATE-YY            PIC X(2).
               10  CUR-DATE-MM            PIC X(2).
               10  CUR-DATE-DD            PIC X(2).

       01  CUR-TIME                      PIC X(6).

       01  SAVE-MONTH-END-DATE.
           05  SAVE-ME-DATE-CC           PIC X(2).
           05  SAVE-ME-DATE-YMD.
               10  SAVE-ME-DATE-YY       PIC X(2).
               10  SAVE-ME-DATE-MMDD     PIC X(4).

       01  SAVE-MONTH-END-TIME           PIC X(6).

       01  CONVERT-DATE                  PIC X(10).

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

       01  PO-14-ARG                          VALUE SPACES.
           05  PO-11-ARG.
               10  PO-PREFIX-ARG    PIC X.
               10  PO-10-ARG.
                   15  PO-NUM-ARG   PIC X(7).
                   15  PO-RLS-ARG   PIC X(3).
           05  PO-RCVR-ARG          PIC X(3).
       01  PO-14-ARG-DUP            REDEFINES PO-14-ARG.
           05  PO-PREFIX-ARG-DUP    PIC X.
           05  PO-13-ARG            PIC X(13).
       01  RAIL-CAR-ARG             PIC X(10) VALUE SPACES.
       01  SHIP-DATE-ARG.
           05  SHIP-DATE-CC         PIC X(2).
           05  SHIP-DATE-YYMMDD     PIC X(6).
       01  RECNUM-ARG               PIC S9(5) COMP-4.
       01  DATE-ARG                 PIC X(8).
       01  CARRIER-ARG              PIC X(4).
       01  PRO-NO-ARG               PIC X(16).

      *-----------------------------------------------------------------
      *  F L A G S   A N D   S W I T C H E S
      *-----------------------------------------------------------------

       01  DAPPLFRT-EOF             PIC X.

       01  REC-LIST-OPTION          PIC X.
       01  SEARCH-TOGGLE            PIC X.

       01  RTN-CODE                 PIC 9.

       01  SAVE-AVG-COST-CALC-SW    PIC X(1).

       01  IN-CLOSING-PERIOD        PIC X.

       01  FLD-LEN                  PIC 9.

       01  INFO-TYPE                PIC X.

       01  SAVE-RECNUM              PIC S9(5) COMP-4.

      *-----------------------------------------------------------------
      *  I N D E X E S
      *-----------------------------------------------------------------

       01  SUBFILE-IX                    PIC  9(4).
       01  DAPPLFRT-IX                   PIC  9(5) COMP-4.

      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------

       01  LOAD-LIMIT                    PIC 999.
           88  LOAD-LIMIT-REACHED        VALUE 51.
       01  SUBFILE-REC-CNT               PIC 9(4).

      *-----------------------------------------------------------------
      *  T A B L E S
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  B U F F E R S
      *-----------------------------------------------------------------

      *SFL SCREEN.
       01  BUF-SCREEN1.
           05  S1-OPTION          PIC X(1).
           05  S1-ACTION          PIC X(2).
           05  S1-CARRIER         PIC X(4).
           05  S1-PRONUM          PIC X(16).
           05  S1-CAR             PIC X(10).
           05  S1-SHIPDT          PIC X(8).
           05  S1-PAIDDT          PIC X(8).
           05  S1-PO              PIC X(15).
           05  S1-RECNUM          PIC S9(5) COMP-4.

      *SFLCTL SCREEN.
       01  BUF-SCREEN2.
           05  S2-RELRCD          PIC S9(5).
           05  S2-DSPREC          PIC S9(4).
           05  S2-COL1            PIC X(4).
           05  S2-COL2            PIC X(5).
           05  S2-STR-CARR        PIC X(4).
           05  S2-STR-PRO         PIC X(16).
           05  S2-STR-VEH         PIC X(10).
           05  S2-STR-PO          PIC X(7).
           05  S2-STR-RLSE        PIC X(3).
           05  S2-STR-RCVR        PIC X(3).

      *FKEY & ERR MSG SCREEN FOR SFL.
       01  BUF-SCREEN3.
           05  S3-MSG-LINE        PIC X(79).

       01  SAVE-BUF-DAPPLFRT      PIC X(200).

       COPY DAPPLFRT OF COPYLIB.

       COPY MACTINFO OF COPYLIB.

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

       COPY DBCSACCT OF COPYLIB.

       COPY DATAB    OF COPYLIB.

       01  IOFEEDBACK.
           05  IO-OFFSET                       PIC S9(4) COMP-4.
           05  IO-OUT-COUNT                    PIC S9(8) COMP-4.
           05  IO-GET-COUNT                    PIC S9(8) COMP-4.
           05  IO-PUT-GET-COUNT                PIC S9(8) COMP-4.
           05  IO-OTHER-COUNT                  PIC S9(8) COMP-4.
           05  FILLER                          PIC X.
           05  IO-OPERATION                    PIC X.
           05  IO-FORMAT                       PIC X(10).
           05  IO-DEV-CLASS                    PIC X(2).
           05  IO-PGM-DEVICE                   PIC X(10).
           05  IO-REC-LEN                      PIC S9(8) COMP-4.
           05  IO-RTG-DTA                      PIC X(80).
           05  IO-BLK-REC                      PIC S9(4) COMP-4.
           05  IO-RESV                         PIC X(4).
           05  IO-BLK-CNT                      PIC S9(8) COMP-4.
           05  FILLER                          PIC X(8).

           05  FEEDBACK-SIZE                   PIC S9(8) COMP-4.
           05  JOIN-LOGICAL                    PIC X(4).
           05  KEY-OFFSET                      PIC S9(4) COMP-4.
           05  LOCKED-RECORDS                  PIC S9(4) COMP-4.
           05  MAX-FIELDS                      PIC S9(4) COMP-4.
           05  FIELD-MAPPING-OFFSET            PIC S9(8) COMP-4.
           05  CURRENT-FILE-POSITION           PIC X(1).
           05  CURRENT-RECORD-DELETE           PIC X(1).
           05  NO-OF-KEYS                      PIC S9(4) COMP-4.
           05  RESERVED-FIELD                  PIC X(4).
           05  KEY-LENGTH                      PIC S9(4) COMP-4.
           05  DATA-MEMBER-NO                  PIC S9(4) COMP-4.
           05  IO-RECNUM                       PIC S9(8) COMP-4.

      *-----------------------------------------------------------------
      *  T E M P O R A R Y   F I L E   P A R M S
      *-----------------------------------------------------------------

       COPY CCRTFILE IN COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY CATREAD OF COPYLIB.

       COPY TBLOWUP OF COPYLIB.

       COPY TDATECHK OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

      *COPY DISPDATA OF COPYLIB.
       01  WS-CONTROL.
           05  FUNCTION-KEY       PIC XX.
               88  ENTER-KEY-USED                       VALUE "00".
               88  F1-KEY-USED                          VALUE "01".
               88  F2-KEY-USED                          VALUE "02".
               88  F3-KEY-USED                          VALUE "03".
               88  F4-KEY-USED                          VALUE "04".
               88  F5-KEY-USED                          VALUE "05".
               88  F6-KEY-USED                          VALUE "06".
               88  F7-KEY-USED                          VALUE "07".
               88  F8-KEY-USED                          VALUE "08".
               88  F9-KEY-USED                          VALUE "09".
               88  F10-KEY-USED                         VALUE "10".
               88  F11-KEY-USED                         VALUE "11".
               88  F12-KEY-USED                         VALUE "12".
               88  ROLLUP-KEY-USED                      VALUE "RU".
           05  TERMINAL-ID        PIC X(10).
           05  FORMAT-NAME        PIC X(10).

       01  DISPLAY-STATUS         PIC X(2).

       01  SRF-INDICATORS.
           05  IND                PIC 1
                                  OCCURS 99 TIMES
                                  INDICATOR 1.
               88  IND-OFF        VALUE B"0".
               88  IND-ON         VALUE B"1".

       01  OFF-SWITCH             PIC 1  VALUE B"0".
       01  ON-SWITCH              PIC 1  VALUE B"1".

      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************

      *-----------------------------------------------------------------
       MAIN SECTION.
      *-----------------------------------------------------------------

       0-CONTROL.
           PERFORM 1-HSK.

           PERFORM 6-LOOP THRU 6-LOOP-X.

           PERFORM 2-EOJ.

           GOBACK.

       1-HSK.

           OPEN INPUT      DAPPLFRT-PCP-I      DAPPLFRT-PO-I
                           DAPPLFRT-RCP-I      DAPPLFRT-VS-I
                           DAPPLFRT-PPRO-I     DAPPLFRT-RPRO-I
                           DAPPLFRT-I.
           OPEN I-O        DISPLAY-FILE        DAPPLFRT-O.

      *----AS OF MAR 93 THE CENTURY IS NOT AVAILABLE FROM THE SYSTEM.
      *----UNTIL THE SITUATION CHANGES, THE FOLLOWING CODING IS A
      *----TEMPORARY MEASURE. THIS CODING IS USED FOR ALL DATES IN
      *----THIS PROGRAM THAT NEED CONVERSION.

           ACCEPT CUR-SYSTEM-DATE FROM DATE.
           IF CUR-DATE-YY < "40"
              MOVE "20" TO CUR-DATE-CC
           ELSE
              MOVE "19" TO CUR-DATE-CC.

           MOVE "3" TO REC-LIST-OPTION.
           MOVE  1  TO S2-DSPREC.
           MOVE "P" TO INFO-TYPE.

       2-EOJ.
           CLOSE
                           DAPPLFRT-PCP-I      DAPPLFRT-PO-I
                           DAPPLFRT-RCP-I      DAPPLFRT-VS-I
                           DISPLAY-FILE        DAPPLFRT-O.


      *-----------------------------------------------------------------
       6-LOOP SECTION.
      *-----------------------------------------------------------------

       60-LOAD-SCREEN.

           INITIALIZE DAPPLFRT-EOF, SUBFILE-IX, SUBFILE-REC-CNT.

      *----SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH TO IND (71)  IND (72).
           MOVE OFF-SWITCH TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN2
              FORMAT IS "ALSTSFLCTL"
              INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
              MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.

      *----TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       60A-GET-LIST.

           INITIALIZE BUF-SCREEN1, LOAD-LIMIT.
           MOVE SUBFILE-REC-CNT TO SUBFILE-IX.

      *----------------------------------
      * LIST OPTIONS:
      *      1 = LIST BY PO
      *      3 = LIST BY PAID CARRIER/PRO NO
      *      4 = LIST BY RATED CARRIER/PRO NO
      *      5 = LIST BY CAR/SHIP DT
      *      6 = LIST BY PAID PRO NO
      *      7 = LIST BY RATED PRO NO
      *----------------------------------

           IF REC-LIST-OPTION = 1
              PERFORM 601-LIST-BY-PO.
           IF REC-LIST-OPTION = 3
              PERFORM 603-LIST-BY-PD-CARR-PRO.
           IF REC-LIST-OPTION = 4
              PERFORM 604-LIST-BY-RTD-CARR-PRO.
           IF REC-LIST-OPTION = 5
              PERFORM 605-LIST-BY-CAR-SHIPDT.
           IF REC-LIST-OPTION = 6
              PERFORM 606-LIST-BY-PD-PRO.
           IF REC-LIST-OPTION = 7
              PERFORM 607-LIST-BY-RT-PRO.
           MOVE BUF-DAPPLFRT TO SAVE-BUF-DAPPLFRT.
           MOVE IO-RECNUM    TO SAVE-RECNUM.

       61-SHOW-SCREEN.

      *----PUT UP FUNCTION KEY SCREEN.

           WRITE DISPLAY-REC FROM BUF-SCREEN3
                 FORMAT IS "ALSTFKEY"
                 INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *----OVERLAY WITH SFLCTL AND SFL SCREENS.

           IF SUBFILE-IX = ZERO
              MOVE OFF-SWITCH TO IND (70)
           ELSE
              MOVE ON-SWITCH TO IND (70).
           MOVE ON-SWITCH TO IND (71).

           IF INFO-TYPE = "P"
              MOVE "PAID"  TO S2-COL1, S2-COL2.
           IF INFO-TYPE = "R"
              MOVE "RATED" TO S2-COL1, S2-COL2.

           IF REC-LIST-OPTION  = "1"  MOVE ON-SWITCH  TO IND (01).
           IF REC-LIST-OPTION  = "3"  MOVE ON-SWITCH  TO IND (03)
                                      MOVE ON-SWITCH  TO IND (04).
           IF REC-LIST-OPTION  = "4"  MOVE ON-SWITCH  TO IND (03)
                                      MOVE ON-SWITCH  TO IND (04).
           IF REC-LIST-OPTION  = "5"  MOVE ON-SWITCH  TO IND (05).
           IF REC-LIST-OPTION  = "6"  MOVE ON-SWITCH  TO IND (04).
           IF REC-LIST-OPTION  = "7"  MOVE ON-SWITCH  TO IND (04).

           IF DAPPLFRT-EOF = "Y"
              MOVE ON-SWITCH  TO IND (73)
           ELSE
              MOVE OFF-SWITCH TO IND (73).

           IF SEARCH-TOGGLE = "Y"
              MOVE "N" TO SEARCH-TOGGLE
              MOVE ON-SWITCH TO IND (20).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN2
              FORMAT IS "ALSTSFLCTL"
              INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
              MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
              MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
              MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
              GO TO 9999-BLOWUP.

      *----READ USER INPUT.
           READ DISPLAY-FILE INTO BUF-SCREEN2
              FORMAT IS "ALSTSFLCTL"
              INDICATORS ARE SRF-INDICATORS.
           IF IND-ON (75)
              SET ROLLUP-KEY-USED TO TRUE.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
              MOVE "PROBLEM ON READ SFL" TO BU-DISPLAY-MSG
              GO TO 9999-BLOWUP.

       62-ACTION.

           IF ROLLUP-KEY-USED
              COMPUTE S2-DSPREC = SUBFILE-REC-CNT + 1
              MOVE SAVE-BUF-DAPPLFRT TO BUF-DAPPLFRT
              MOVE SAVE-RECNUM       TO IO-RECNUM
              GO TO 60A-GET-LIST.

           IF ENTER-KEY-USED
              GO TO 61-SHOW-SCREEN.

           IF F2-KEY-USED
              PERFORM 621-CALL-SFRTINQ
              GO TO 61-SHOW-SCREEN.

           IF F3-KEY-USED
              GO TO 6-LOOP-X.

           IF F5-KEY-USED
              MOVE  1  TO S2-DSPREC
              INITIALIZE S2-STR-CARR,  S2-STR-PRO,   S2-STR-VEH,
                         S2-STR-PO,    S2-STR-RLSE,  S2-STR-RCVR
              GO TO 60-LOAD-SCREEN.

           IF F6-KEY-USED
              MOVE "Y" TO SEARCH-TOGGLE
              MOVE S2-RELRCD TO S2-DSPREC
              IF S2-DSPREC = 0
                 MOVE 1 TO S2-DSPREC
              END-IF
              GO TO 61-SHOW-SCREEN.

           IF F7-KEY-USED
              MOVE "P" TO INFO-TYPE
              MOVE "3" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

           IF F8-KEY-USED
              MOVE "R" TO INFO-TYPE
              MOVE "4" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

           IF F9-KEY-USED
              MOVE "P" TO INFO-TYPE
              MOVE "6" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

           IF F10-KEY-USED
              MOVE "R" TO INFO-TYPE
              MOVE "7" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

           IF F11-KEY-USED
              MOVE "R" TO INFO-TYPE
              MOVE "5" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

           IF F12-KEY-USED
              MOVE "P" TO INFO-TYPE
              MOVE "1" TO REC-LIST-OPTION
              MOVE  1  TO S2-DSPREC
              GO TO 60-LOAD-SCREEN.

       601-LIST-BY-PO.

           IF NOT ROLLUP-KEY-USED
              IF S2-STR-PO > SPACES
                 MOVE "P"          TO PO-PREFIX-ARG
              ELSE
                 MOVE SPACES       TO PO-PREFIX-ARG
              END-IF
              MOVE S2-STR-PO    TO PO-NUM-ARG
              MOVE S2-STR-RLSE  TO PO-RLS-ARG
              MOVE S2-STR-RCVR  TO PO-RCVR-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-PO
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-PO-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-PAID-CARRIER   TO S1-CARRIER
              MOVE DAPPL-PAID-PRO-NO    TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #1"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-PO      TO BU-DISPLAY-FLD (2)
                 MOVE S1-RECNUM  TO BU-DISPLAY-FLD (3)
                 MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (4)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-PO-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       603-LIST-BY-PD-CARR-PRO.

           IF NOT ROLLUP-KEY-USED
              MOVE S2-STR-CARR  TO CARRIER-ARG
              MOVE S2-STR-PRO   TO PRO-NO-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-PCP
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-PCP-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-PAID-CARRIER   TO S1-CARRIER
              MOVE DAPPL-PAID-PRO-NO    TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #2"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-CARRIER TO BU-DISPLAY-FLD (2)
                 MOVE S1-PRONUM  TO BU-DISPLAY-FLD (3)
                 MOVE DISPLAY-STATUS TO  BU-DISPLAY-FLD (4)
                 MOVE S1-RECNUM  TO BU-DISPLAY-FLD (5)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-PCP-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       604-LIST-BY-RTD-CARR-PRO.

           IF NOT ROLLUP-KEY-USED
              MOVE S2-STR-CARR  TO CARRIER-ARG
              MOVE S2-STR-PRO   TO PRO-NO-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-RCP
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-RCP-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-RATED-CARRIER  TO S1-CARRIER
              MOVE DAPPL-RATED-PRO-NO   TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #3"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-CARRIER TO BU-DISPLAY-FLD (2)
                 MOVE S1-PRONUM  TO BU-DISPLAY-FLD (3)
                 MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (4)
                 MOVE S1-RECNUM  TO BU-DISPLAY-FLD (5)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-RCP-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       605-LIST-BY-CAR-SHIPDT.

           IF NOT ROLLUP-KEY-USED
              MOVE S2-STR-VEH   TO RAIL-CAR-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-VS
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-VS-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-RATED-CARRIER  TO S1-CARRIER
              MOVE DAPPL-RATED-PRO-NO   TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #4"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-CAR     TO BU-DISPLAY-FLD (2)
                 MOVE S1-SHIPDT  TO BU-DISPLAY-FLD (3)
                 MOVE S1-RECNUM  TO BU-DISPLAY-FLD (4)
                 MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (5)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-VS-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       606-LIST-BY-PD-PRO.

           IF NOT ROLLUP-KEY-USED
              MOVE S2-STR-PRO   TO PRO-NO-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-PPRO
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-PPRO-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-PAID-CARRIER   TO S1-CARRIER
              MOVE DAPPL-PAID-PRO-NO    TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #5"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-CARRIER TO BU-DISPLAY-FLD (2)
                 MOVE S1-PRONUM  TO BU-DISPLAY-FLD (3)
                 MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (4)
                 MOVE S1-RECNUM  TO BU-DISPLAY-FLD (5)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-PPRO-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       607-LIST-BY-RT-PRO.

           IF NOT ROLLUP-KEY-USED
              MOVE S2-STR-PRO   TO PRO-NO-ARG
              PERFORM 9999-START-DAPPLFRT-I-GE-RPRO
              IF FILE-STATUS-1 = "2"
                 MOVE "Y" TO DAPPLFRT-EOF
              END-IF
              IF DAPPLFRT-EOF NOT = "Y"
                 PERFORM 9999-READ-NEXT-DAPPLFRT-RPRO-I
                 ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.

           PERFORM UNTIL DAPPLFRT-EOF = "Y" OR LOAD-LIMIT-REACHED
              MOVE DAPPL-RATED-CARRIER  TO S1-CARRIER
              MOVE DAPPL-RATED-PRO-NO   TO S1-PRONUM
              MOVE DAPPL-RAIL-CAR       TO S1-CAR
              MOVE DAPPL-TIS-SHIP-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-SHIPDT
              MOVE DAPPL-TIS-PAID-DATE (3:6) TO DATE-ARG
              PERFORM 9999-CONVERT-DATE
              MOVE CONVERT-DATE         TO S1-PAIDDT
              IF DAPPL-PO-13 > SPACES
                 STRING DAPPL-PO-NUM   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RLS   DELIMITED BY SIZE,
                        "-"            DELIMITED BY SIZE,
                        DAPPL-PO-RCVR  DELIMITED BY SIZE INTO S1-PO
              ELSE
                 MOVE SPACES TO S1-PO
              END-IF
              MOVE IO-RECNUM           TO S1-RECNUM
              ADD 1 TO SUBFILE-IX, SUBFILE-REC-CNT, LOAD-LIMIT
              IF SUBFILE-IX > 9000
                 MOVE "SUBFILE TOO SMALL-INCREASE ALSTSFL/ZFREIGHT"
                    TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP
              END-IF
              WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
              END-WRITE
              IF DISPLAY-STATUS NOT = "00"
                 MOVE "PROBLEM ON LOAD SFL WRITE -- #6"
                                                  TO BU-DISPLAY-MSG
                 MOVE SUBFILE-IX TO BU-DISPLAY-FLD (1)
                 MOVE S1-CARRIER TO BU-DISPLAY-FLD (2)
                 MOVE S1-PRONUM  TO BU-DISPLAY-FLD (3)
                 MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (4)
                 MOVE S1-RECNUM TO BU-DISPLAY-FLD (5)
                 GO TO 9999-BLOWUP
              END-IF
              PERFORM 9999-READ-NEXT-DAPPLFRT-RPRO-I
              ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
           END-PERFORM.

       621-CALL-SFRTINQ.

      *----FIND FIRST SUBFILE REC TO INQUIRE.

           PERFORM UNTIL S1-OPTION = "X" OR DISPLAY-STATUS NOT = ZERO
              READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
                   INTO BUF-SCREEN1
                   FORMAT IS "ALSTSFL"
           END-PERFORM

           IF S1-OPTION = "X"
              MOVE SUBFILE-IX TO S2-DSPREC
           ELSE
              MOVE S2-RELRCD TO S2-DSPREC.
           IF S2-DSPREC < 1
              MOVE 1 TO S2-DSPREC.

           PERFORM UNTIL DISPLAY-STATUS NOT = ZERO

              CALL "SFRTINQ" USING S1-RECNUM, RTN-CODE,
                                   BU-DISPLAY-MSG, BU-DISPLAY-FLDS

              IF RTN-CODE NOT = 0
                 GO TO 9999-BLOWUP
              END-IF

      *-------UPDATE THE SUBFILE RECORD

              MOVE "2" TO S1-ACTION
              INITIALIZE S1-OPTION

              REWRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN1
                 FORMAT IS "ALSTSFL"
                 INDICATORS ARE SRF-INDICATORS
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-REWRITE

      *-------GET NEXT SUBFILE RECORD TO INQUIRE

              PERFORM UNTIL S1-OPTION = "X" OR DISPLAY-STATUS NOT = ZERO
                 READ SUBFILE DISPLAY-FILE NEXT MODIFIED RECORD
                      INTO BUF-SCREEN1
                      FORMAT IS "ALSTSFL"
                 END-READ
              END-PERFORM

           END-PERFORM.

       6-LOOP-X.
           EXIT.

      *-----------------------------------------------------------------
       9999-UTILITY SECTION.
      *-----------------------------------------------------------------

       9999-BLOWUP.
           MOVE "TFRTINQ" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

       9999-CONVERT-DATE.
           INITIALIZE CONVERT-DATE, FLD-LEN.
           INSPECT DATE-ARG TALLYING FLD-LEN
              FOR CHARACTERS BEFORE INITIAL SPACE.
           IF FLD-LEN = 8
              STRING DATE-ARG (1:4) DELIMITED BY SIZE,
                     "-"            DELIMITED BY SIZE,
                     DATE-ARG (5:2) DELIMITED BY SIZE,
                     "-"            DELIMITED BY SIZE,
                     DATE-ARG (7:2) DELIMITED BY SIZE
                     INTO CONVERT-DATE.
           IF FLD-LEN = 6
              STRING DATE-ARG (1:2) DELIMITED BY SIZE,
                     "-"            DELIMITED BY SIZE,
                     DATE-ARG (3:2) DELIMITED BY SIZE,
                     "-"            DELIMITED BY SIZE,
                     DATE-ARG (5:2) DELIMITED BY SIZE
                     INTO CONVERT-DATE.
           IF FLD-LEN = 0
              MOVE SPACES TO CONVERT-DATE.

       9999-WRITE-SCREEN.
           WRITE DISPLAY-REC FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
      *??? MOVE ALL B"0" TO SRF-INDICATORS.

       9999-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
              INDIC ARE SRF-INDICATORS.
      *??? MOVE ALL B"0" TO SRF-INDICATORS.

      *--- A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *--- IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.

           IF DISPLAY-STATUS NOT = "00"
               MOVE "03" TO FUNCTION-KEY.

       9999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

      *---------------------------------
      * DAPPLFRT
      *---------------------------------

       9999-START-DAPPLFRT-I-GE-PO.
           MOVE PO-14-ARG TO PORCVNO OF DAPPLFRT-PO-REC-I.
           START DAPPLFRT-PO-I KEY >= PORCVNO OF DAPPLFRT-PO-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-PO*9999-SDIGP" TO BU-DISPLAY-MSG
                 MOVE PO-14-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-PO-I.
           READ DAPPLFRT-PO-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-START-DAPPLFRT-I-GE-VS.
           MOVE RAIL-CAR-ARG TO FRTRAILCAR OF DAPPLFRT-VS-REC-I.
           START DAPPLFRT-VS-I KEY >= FRTRAILCAR OF DAPPLFRT-VS-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-VS*9999-SDIGV" TO BU-DISPLAY-MSG
                 MOVE RAIL-CAR-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-VS-I.
           READ DAPPLFRT-VS-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-START-DAPPLFRT-I-GE-PCP.
           MOVE CARRIER-ARG TO PDCARRIER OF DAPPLFRT-PCP-REC-I.
           MOVE PRO-NO-ARG  TO PDPRONO   OF DAPPLFRT-PCP-REC-I.
           START DAPPLFRT-PCP-I KEY >= EXTERNALLY-DESCRIBED-KEY
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-PCP*9999-SDIGP" TO BU-DISPLAY-MSG
                 MOVE CARRIER-ARG TO BU-DISPLAY-FLD (1)
                 MOVE PRO-NO-ARG  TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-PCP-I.
           READ DAPPLFRT-PCP-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-START-DAPPLFRT-I-GE-RCP.
           MOVE CARRIER-ARG TO RTCARRIER OF DAPPLFRT-RCP-REC-I.
           MOVE PRO-NO-ARG  TO RTPRONO   OF DAPPLFRT-RCP-REC-I.
           START DAPPLFRT-RCP-I KEY >= EXTERNALLY-DESCRIBED-KEY
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-RCP*9999-SDIGR" TO BU-DISPLAY-MSG
                 MOVE CARRIER-ARG TO BU-DISPLAY-FLD (1)
                 MOVE PRO-NO-ARG  TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-RCP-I.
           READ DAPPLFRT-RCP-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-START-DAPPLFRT-I-GE-RPRO.
           MOVE PRO-NO-ARG  TO RTPRONO   OF DAPPLFRT-RPRO-REC-I.
           START DAPPLFRT-RPRO-I KEY >= EXTERNALLY-DESCRIBED-KEY
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-RPRO*9999-SDIGR" TO BU-DISPLAY-MSG
                 MOVE PRO-NO-ARG  TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-RPRO-I.
           READ DAPPLFRT-RPRO-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-START-DAPPLFRT-I-GE-PPRO.
           MOVE PRO-NO-ARG  TO PDPRONO   OF DAPPLFRT-PPRO-REC-I.
           START DAPPLFRT-PPRO-I KEY >= EXTERNALLY-DESCRIBED-KEY
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DAPPLFRT-PPRO*9999-SDIGP" TO BU-DISPLAY-MSG
                 MOVE PRO-NO-ARG  TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-NEXT-DAPPLFRT-PPRO-I.
           READ DAPPLFRT-PPRO-I NEXT INTO BUF-DAPPLFRT
              AT END MOVE "Y" TO DAPPLFRT-EOF.

       9999-READ-DAPPLFRT-O.
           MOVE RECNUM-ARG TO DAPPLFRT-IX.
           READ DAPPLFRT-O INTO BUF-DAPPLFRT
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ DAPPLFRT*9999-RDO" TO BU-DISPLAY-MSG
              MOVE RECNUM-ARG TO BU-DISPLAY-FLD (1)
              GO TO 9999-BLOWUP.

       9999-READ-DAPPLFRT-I.
           MOVE RECNUM-ARG TO DAPPLFRT-IX.
           READ DAPPLFRT-I INTO BUF-DAPPLFRT
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ DAPPLFRT*9999-RDI" TO BU-DISPLAY-MSG
              MOVE RECNUM-ARG TO BU-DISPLAY-FLD (1)
              GO TO 9999-BLOWUP.

       9999-REWRITE-DAPPLFRT-O.
           REWRITE DAPPLFRT-REC-O FROM BUF-DAPPLFRT
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "REWRITE DAPPLFRT*9999-RDO" TO BU-DISPLAY-MSG
              MOVE DAPPL-PO-14 TO BU-DISPLAY-FLD (1)
              MOVE DAPPL-TIS-SHIP-DATE TO BU-DISPLAY-FLD (2)
              MOVE DAPPL-RAIL-CAR TO BU-DISPLAY-FLD (3)
              MOVE RECNUM-ARG TO BU-DISPLAY-FLD (4)
              GO TO 9999-BLOWUP.
