001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TFRTDEL.
001300 AUTHOR.         BARBARA WINTER.
001400*INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500*DATE-WRITTEN.   MAY 1989.
001600*REMARKS.        THIS PROGRAM DELETES ENTRIES OUT OF THE FILE
001700*                'KFRTERMS' THAT ARE OLDER THAN A CERTAIN DATE.
001800*                THE NUMBER OF DAYS TO GO BACKWARDS IS FOUND IN
001900*                CSAS DATASET MACTINFO, KEY=FRT.  IF NOT FOUND,
002000*                60 DAYS IS USED.
002100*
      *C   10FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C  OCTOBER 30, 1997   CA YODER
      *C     ADDED CENTURY FOR DATABASE CHANGE TO MCFPCSTERM.
      *C     CHANGED DATE CALCULATION TO USE "JULGREG" ROUTINE.
      *C
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.    HP-3000.
002500 OBJECT-COMPUTER.    HP-3000.
002500 SPECIAL-NAMES. C01 IS NEW-PAGE.
002700
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
003300     SELECT KFRTERMS-FILE   ASSIGN TO DATABASE-MCFLCSTERM
003400                            ORGANIZATION IS INDEXED
003500                            ACCESS MODE IS DYNAMIC
003600                            RECORD KEY IS KFRTERMS-DATE
003700                                STATUS IS FILE-STATUS.
003800
            SELECT MACCOUNT
              ASSIGN TO DATABASE-MCFLCA0101
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  KFRTERMS-FILE.
004000 01  KFRTERMS-RECORD.
           05  KFRTERMS-DATE.
               07  KFRTERMS-CC        PIC X(2).
004100         07  KFRTERMS-DATE-YMD.
004200             09  DATE1          PIC X(6).
004300         07  KFRTERMS-TIME      PIC X(6).
004400     05  KFRTERMS-VENDOR        PIC X(10).
004500     05  KFRTERMS-PO.
004600         07  FILLER             PIC X.
004700         07  KFRT-PO            PIC X(7).
004800         07  FILLER             PIC X(6).
004900     05  KFRTERMS-PO-TERM       PIC X.
005000     05  KFRTERMS-RCVR-TERM     PIC X.
005100
       FD  MACCOUNT
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.
008800
005200 WORKING-STORAGE SECTION.
       77  MCXCBLERR-SCOPE            PIC X(1)  VALUE "C".
       01  DAY-DIGIT                  PIC X.
       01  GREG-DATE.
           05  GREG-CC                PIC XX.
           05  GREG-YMD.
               10  GREG-YY            PIC XX.
               10  GREG-MM            PIC XX.
               10  GREG-DD            PIC XX.
       01  LEAP-YEAR-FLAG             PIC X.

       01  TODAYS-DATE-CN.
           05  CC                       PIC XX.
           05  TODAYS-DATE.
               10  YY                   PIC XX.
               10  MM                   PIC XX.
               10  DD                   PIC XX.

       01 TODAYS-DATE-9 REDEFINES TODAYS-DATE-CN.
           05  CC-9                     PIC 99.
           05  YY-9                     PIC 99.
           05  MM-9                     PIC 99.
           05  DD-9                     PIC 99.

006700 01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
       01  PAST-DATE-CN.
           05  CC-PAST-DATE           PIC 9(2).
005300     05  PAST-DATE.
005400         10  YY-PAST-DATE       PIC 9(2).
005500         10  MM-PAST-DATE       PIC 9(2).
005600         10  DD-PAST-DATE       PIC 9(2).
005700 01  KFRTERMS-STATUS           PIC X(2).
005900 01  NO-OF-PAST-DAYS            PIC 9(3)  VALUE ZEROES.
022500 01  TODAYS-JULIAN.
           05  TJ-CC                  PIC 9(2).
           05  TJ-YY                  PIC S9(2).
           05  TJ-DDD                 PIC S9(3).
       01  TODAYS-JULIAN9 REDEFINES TODAYS-JULIAN   PIC S9(7).

       01  J-JULIAN                   PIC 9(7).
       01  J-JULIANX                  PIC X(7).
006000 01  ALL-ITEMS                  PIC X(2)  VALUE "@;".
006100 01  MACCT-KEY                  PIC X(4)  VALUE SPACES.
006200 01  DATES-AND-TIMES.
006300     05  CUR-DATE.
006400         10  YY               PIC XX.
006500         10  MM               PIC XX.
006600         10  DD               PIC XX.
006700     05  CUR-DATE-9  REDEFINES  CUR-DATE.
006800         10  YY-9             PIC 99.
006900         10  MM-9             PIC 99.
007000         10  DD-9             PIC 99.
007800 COPY TDATECHK IN COPYLIB.
007900 COPY TBLOWUP  IN COPYLIB.
008000
008100 01  SWITCH-AREA.
008200     05  END-OF-INPUT-FILE      PIC X VALUE "N".
008300         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
008400     05  END-OF-SORT-FILE       PIC X VALUE "N".
008500         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
008900
009000 01  ACCTG-BASE                 PIC X(10) VALUE "  CSACCT;".
009100 01  ACCTG-PASSWORD             PIC X(8)  VALUE "ACTION; ".
009200 COPY DATAB     IN COPYLIB.
009300 COPY MACTINFO  IN COPYLIB.
009400
009500 PROCEDURE DIVISION.
009600 BEGIN-SORT.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
009700
009800     OPEN INPUT MACCOUNT.
010400     MOVE "FRT" TO MACCT-KEY.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-REC.
           READ MACCOUNT INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
010700     IF NOT GOOD-CALL
010800        MOVE 60 TO NO-OF-PAST-DAYS
010900     ELSE
011000        MOVE MACCT-FRT-TERM-DAYS TO NO-OF-PAST-DAYS.
011100
011110     DISPLAY "PAST DAYS=", NO-OF-PAST-DAYS.
011200     MOVE 1 TO DATE-MODE.
011300     CALL "TDATECHK" USING DATE-CHECK-AREA.
012400
           MOVE DATE-YMD-OUT             TO TODAYS-DATE.
           IF YY OF TODAYS-DATE > "70"
               MOVE "19"                 TO CC
           ELSE
           MOVE "20"                     TO CC.
           MOVE TODAYS-DATE-CN           TO GREG-DATE.

           MOVE SPACES                   TO TODAYS-JULIAN.

           CALL "JULGREG" USING GREG-DATE, TODAYS-JULIAN,
                            DAY-DIGIT, LEAP-YEAR-FLAG.

           DISPLAY "TODAY'S JULIAN = " TODAYS-JULIAN9.
           DISPLAY "TODAY'S DATE   = " GREG-DATE.

218300**** MOVE ZEROS                    TO TODAYS-JULIAN9.
049100
049200**** CALL "JULIANDATE" USING DATE-YMD-OUT J-JULIANX.
      **** MOVE J-JULIANX TO J-JULIAN.
      **** MOVE J-JULIAN TO TODAYS-JULIAN9.
012310**** DISPLAY "TODAYS-JULIAN=j", TODAYS-JULIAN.
012500     IF TJ-DDD > NO-OF-PAST-DAYS
012600        NEXT SENTENCE
012700     ELSE
012800        ADD 365 TO TJ-DDD
012900        SUBTRACT 1 FROM TJ-YY.
013100     SUBTRACT NO-OF-PAST-DAYS FROM TODAYS-JULIAN9.
013000
           MOVE SPACES TO GREG-DATE.
           CALL "JULGREG" USING GREG-DATE, TODAYS-JULIAN,
                            DAY-DIGIT, LEAP-YEAR-FLAG.

           MOVE GREG-YMD    TO  PAST-DATE.
           IF YY-PAST-DATE > "70"
               MOVE "19"    TO  CC-PAST-DATE
           ELSE
               MOVE "20"    TO  CC-PAST-DATE.

013110**** DISPLAY "NOW TODAYS-JULIAN=", TODAYS-JULIAN.
050500**** CALL "GREGDATE" USING TODAYS-JULIAN, PAST-DATE.
013820     DISPLAY "PAST-DATE=", PAST-DATE-CN.
013900
014000     PERFORM 200-INPUT-RECORDS THRU 299-EXIT.
014100     CLOSE MACCOUNT.
014200     GOBACK.
014300
014400********************************************************************
014500*    INPUT SECTION:  RETRIEVE VENDOR RECORDS FOR SORTING           *
014600********************************************************************
014700 200-INPUT-RECORDS.
014800     OPEN I-O   KFRTERMS-FILE.
014900     MOVE SPACES TO KFRTERMS-DATE.
015000     START KFRTERMS-FILE
015100           KEY IS GREATER OR EQUAL KFRTERMS-DATE
015200           INVALID KEY MOVE "Y" TO END-OF-INPUT-FILE.
015300     PERFORM 210-PROCESS-INPUT-RECORDS THRU 290-EXIT UNTIL
015400             ALL-INPUT-RECORDS-PROCESSED.
015500     CLOSE KFRTERMS-FILE.
015600     GO TO 299-EXIT.
015700
015800 210-PROCESS-INPUT-RECORDS.
015900     READ KFRTERMS-FILE NEXT RECORD
016000          AT END MOVE "Y" TO END-OF-INPUT-FILE
016100          GO TO 290-EXIT.
016200
016210     IF KFRTERMS-DATE < PAST-DATE-CN
016230        DELETE KFRTERMS-FILE.

016300 290-EXIT.  EXIT.
016400 299-EXIT.  EXIT.
016500
016600*************************************************************
016700*                    BLOWUP   ROUTINE                       *
016800*************************************************************
016900 990-BLOWUP.
017000
017100     MOVE "TFRTERMS" TO BU-PGM-NAME.
017200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
017300           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
017400           BU-DISPLAY-AREA.
017500
017600 999-EXIT.  EXIT.
