       IDENTIFICATION DIVISION.
       PROGRAM-ID.       TFRTRPT.
       AUTHOR.           JEFF BUNGO.
      *INSTALLATION.     GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.     AUGUST 1, 1997.
       DATE-COMPILED.
      *REMARKS.
      *

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       SPECIAL-NAMES. C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-FILE      ASSIGN TO DISK-SORT.
           SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
           SELECT DFREIGHT
               ASSIGN TO DATABASE-MCFLCS2401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DFREIGHT-H
               ASSIGN TO DATABASE-MCFLST0701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DPORECDH
               ASSIGN TO DATABASE-MCFLST0301
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RECORD.
       01  PRINT-RECORD.
           05  PRINT-LINE               PIC X(132).

       SD SORT-FILE
           RECORD CONTAINS 64 CHARACTERS
           DATA RECORD IS SORT-RECORD.
       01  SORT-RECORD.
           05  SRT-PO-RCV-NO.
               10  SRT-PO-RLSE.
                   15  SRT-PO           PIC X(7).
                   15  SRT-RLSE-NO      PIC X(3).
               10  SRT-RCV-NO           PIC X(3).
           05  SRT-DATE-RCVD.
               10  SRT-DATE-RCVD-CC     PIC X(2).
               10  SRT-DATE-YMD         PIC X(6).
           05  SRT-TYPE                 PIC X(1).
           05  SRT-CARRIER              PIC X(4).
           05  SRT-BILL-NO              PIC X(16).
           05  SRT-CHARGES              PIC 9(11)V99.
           05  SRT-CARR-WT              PIC 9(8).
           05  SRT-HISTORY              PIC X(1).

       FD  DFREIGHT
           LABEL RECORDS ARE STANDARD.
       01  DFREIGHT-REC.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.
       FD  DFREIGHT-H
           LABEL RECORDS ARE STANDARD.
       01  DFREIGHTH-REC.
           COPY DDS-MCRPST0700  OF MCFLST0701.
       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.
       FD  DPORECDH
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC.
           COPY DDS-MCRPST0300  OF MCFLST0301.
       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       WORKING-STORAGE SECTION.
      **************************************************************
      *           W O R K I N G         S T O R A G E              *
      **************************************************************
       77  MCXCBLERR-SCOPE              PIC X(1)  VALUE "C".
       77  LOW-HISTORY                  PIC S9(8) COMP-4.
       77  HIGH-HISTORY                 PIC S9(8) COMP-4.
       77  NUMERIC-DATE                 PIC 9(8).
       77  HISTORY                      PIC X(1) VALUE "N".
       77  SORT-RECORDS                 PIC 9(8).

       01  LOW-DATE-CN.
           05  LOW-DATE-CC              PIC X(2).
           05  LOW-DATE-YMD             PIC X(6).
       01  HIGH-DATE-CN.
           05  HIGH-DATE-CC             PIC X(2).
           05  HIGH-DATE-YMD            PIC X(6).

       01  PO-ARG.
           05  FILLER                   PIC X(1) VALUE "P".
           05  PO-NUMBER                PIC X(10).
           05  FILLER                   PIC X(3) VALUE "000".
       01  PO-ARG-H.
           05  PO-NUMBER-H.
               10  PO-H                 PIC X(7).
               10  PO-RLSE-H            PIC X(3).
           05  FILLER                   PIC X(3) VALUE "000".
           05  FILLER                   PIC X(1).
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X.
           05  FILE-STATUS-2            PIC X.

       01  SAVE-DATE                    PIC X(8).

       01  COUNTERS.
           05  LINE-CTR                 PIC 9(4)  VALUE 99.
           05  PAGE-CTR                 PIC 9(4)  VALUE 0.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************
       COPY OVRPFDATA OF COPYLIB.
       COPY DFREIGHT OF COPYLIB.
       COPY DPOFRTH  OF COPYLIB.
       COPY DPORECD  OF COPYLIB.
       COPY DPORECDH OF COPYLIB.
       COPY DVENDOR OF COPYLIB.
       COPY CCHKOBJ  OF COPYLIB.
      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DATAB OF COPYLIB.


       COPY TDATECHK OF COPYLIB.
       COPY THDPRTA  OF COPYLIB.
       COPY TBLOWUP  OF COPYLIB.

      ************************************************************
      *                 P R I N T   A R E A
      ************************************************************

       01  PRT-LINE.
           05  PRT-DATE-RCVD            PIC X(8).
           05  FILLER                   PIC X(2).
           05  PRT-PO                   PIC X(8).
           05  PRT-RLSE-NO              PIC X(3).
           05  PRT-DASH                 PIC X.
           05  PRT-RCV-NO               PIC X(3).
           05  PRT-HIST                 PIC X(1).
           05  FILLER                   PIC X(1).
           05  PRT-VEND-NAME            PIC X(44).
           05  PRT-CARRIER              PIC X(4).
           05  FILLER                   PIC X(3).
           05  PRT-TYPE                 PIC X(1).
           05  FILLER                   PIC X(5).
           05  PRT-CARR-WT              PIC Z(7)9.
           05  FILLER                   PIC X(2).
           05  PRT-BILL-NO              PIC X(16).
           05  FILLER                   PIC X(2).
           05  PRT-CHARGES              PIC -(11)9.99.

       01  HEADER-1.
           05  FILLER                   PIC X(9) VALUE "PAGE NO.".
           05  PAGE-NO                  PIC ZZZ9  VALUE ZERO.
           05  FILLER                   PIC X(6) VALUE SPACE.
           05  FILLER                   PIC X(49)
            VALUE "                R E C E I V I N G   F R E I G H T".
           05  FILLER                   PIC X(25)
            VALUE "   R E P O R T".
           05  FILLER                   PIC X(26) VALUE SPACES.
           05  PRT-DATE                PIC X(10).
       01  HEADER-1B.
           05  FILLER                   PIC X(46) VALUE SPACES.
           05  FILLER                   PIC X(4)  VALUE "FROM".
           05  FILLER                   PIC X(1)  VALUE SPACES.
           05  PRT-LOW-RANGE            PIC X(8)  VALUE SPACES.
           05  FILLER                   PIC X(1)  VALUE SPACES.
           05  FILLER                   PIC X(2)  VALUE "TO".
           05  FILLER                   PIC X(1)  VALUE SPACES.
           05  PRT-HIGH-RANGE           PIC X(8)  VALUE SPACES.
           05  PRT-HISTORY-LIT          PIC X(26) VALUE SPACES.
           05  FILLER                   PIC X(35) VALUE SPACES.
       01  HEADER-2.
           05  FILLER                PIC X(8)  VALUE "  DATE  ".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(15) VALUE "   RECEIVER    ".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(42)
            VALUE "VENDOR NAME                               ".
           05  FILLER                PIC X(7)  VALUE "CARRIER".
           05  FILLER                PIC X(1)  VALUE SPACES.
           05  FILLER                PIC X(4)  VALUE "TYPE".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(9)  VALUE "   WEIGHT".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(16) VALUE "PRO NUMBER      ".
           05  FILLER                PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(15) VALUE "        CHARGES".
       01  HEADER-3                  PIC X(132) VALUE ALL "-".
       01  HEADER-4.
           05  FILLER                   PIC X(132) VALUE SPACE.

      **************************************************************
      **                                                          **
      **            E S C A P E   S E Q U E N C E S               **
      **                                                          **
      **************************************************************

       COPY ESCNAM2 OF COPYLIB.

       01  COMPRESS-PRINT             PIC X(8).

       01  NORMAL-PRINT               PIC X(8).

       01  ESC-TEXT-61                PIC X(8).

       01  ESC-TEXT-60                PIC X(8).

       LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.
       01  USER-OPTIONS.
           05  LOW-DATE.
               10  LOW-DATE-YY        PIC X(2).
               10  FILLER             PIC X(4).
           05  HIGH-DATE.
               10  HIGH-DATE-YY       PIC X(2).
               10  FILLER             PIC X(4).
           05  HIST-FLAG              PIC X(1).
           05  FILLER                 PIC X(63).

      ********************************************************************
      *
      *            P R O C E D U R E   D I V I S I O N
      ********************************************************************

       PROCEDURE DIVISION USING HD-ROUTE-DATA USER-OPTIONS.
       0-BEGIN.
           PERFORM 1-HSK  THRU  1-HSK-X.

           PERFORM 6-SORT-PROCEDURE  THRU  6-SORT-PROCEDURE-X.

           PERFORM 2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.

           GOBACK.

       1-HSK.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.
           MOVE TEXT-LENGTH-61 TO ESC-TEXT-61.
           MOVE TEXT-LENGTH-60 TO ESC-TEXT-60.

           OPEN INPUT DFREIGHT
                      DVENDOR
                      DPORECD
           IF HIST-FLAG = "X"
               OPEN INPUT DFREIGHT-H
                          DPORECDH
               MOVE "Y" TO HISTORY
               MOVE ", * INDICATES FROM HISTORY" TO PRT-HISTORY-LIT
           ELSE
               MOVE SPACES TO PRT-HISTORY-LIT
               MOVE "N" TO HISTORY.

           MOVE 1                       TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT          TO  SAVE-DATE.

           MOVE LOW-DATE                TO  DATE-VALIDATE-IN.
           MOVE 4                       TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT          TO  PRT-LOW-RANGE.
           MOVE HIGH-DATE               TO  DATE-VALIDATE-IN.
           MOVE 4                       TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT          TO  PRT-HIGH-RANGE.

           MOVE LOW-DATE TO LOW-DATE-YMD.
           IF LOW-DATE-YY > "90"
               MOVE "19" TO LOW-DATE-CC
           ELSE
               MOVE "20" TO LOW-DATE-CC.
           MOVE HIGH-DATE TO HIGH-DATE-YMD.
           IF HIGH-DATE-YY > "90"
               MOVE "19" TO HIGH-DATE-CC
           ELSE
               MOVE "20" TO HIGH-DATE-CC.
           MOVE 0 TO SORT-RECORDS.
       1-HSK-X.
           EXIT.

       6-SORT-PROCEDURE.
           SORT SORT-FILE ON ASCENDING KEY SRT-DATE-RCVD
                                           SRT-PO-RCV-NO
               INPUT PROCEDURE IS THE-INPUT THRU INPUT-EXIT
               OUTPUT PROCEDURE IS THE-OUTPUT THRU OUTPUT-EXIT.
       6-SORT-PROCEDURE-X.
           EXIT.

       2-CLOSE-FILES.
           CLOSE DFREIGHT
                 DPORECD
                 DVENDOR.
           IF HIST-FLAG = "X"
              CLOSE DFREIGHT-H
                    DPORECDH.
       2-CLOSE-FILES-X.
           EXIT.

      ******************************************************
      **                                                  **
      **   BLOWUP ROUTINE                                 **
      **                                                  **
      ******************************************************

       2-BLOWUP.
           MOVE "TFRTRPT"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                   BU-DISPLAY-FLDS.

       THE-INPUT.
           IF HISTORY = "Y"
               MOVE LOW-VALUES TO PORCVNO OF DFREIGHTH-REC
               START DFREIGHT-H KEY  >=  PORCVNO OF DFREIGHTH-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
            ELSE
               MOVE LOW-VALUES TO PORCVNO OF DFREIGHT-REC
               START DFREIGHT KEY  >=  PORCVNO OF DFREIGHT-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
            END-IF.
       6-MAIN.
           IF HISTORY = "Y"
               READ DFREIGHT-H NEXT INTO BUF-DPOFREIGHT-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
           ELSE
               READ DFREIGHT NEXT INTO BUF-DPOFREIGHT
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
           END-IF.
           IF FILE-STATUS NOT = "00"
              IF HISTORY = "Y"
                  MOVE "N" TO HISTORY
                  GO TO THE-INPUT
              ELSE
                  GO TO INPUT-EXIT.

           IF HISTORY = "Y"
              MOVE LOW-DATE-CN TO NUMERIC-DATE
              MOVE NUMERIC-DATE TO LOW-HISTORY
              MOVE HIGH-DATE-CN TO NUMERIC-DATE
              MOVE NUMERIC-DATE TO HIGH-HISTORY
              IF FRTH-DATE-RCVD < LOW-HISTORY OR
                 FRTH-DATE-RCVD > HIGH-HISTORY
                  GO TO 6-MAIN
              END-IF
           ELSE
              IF FRT-DATE-RCVD-CN < LOW-DATE-CN OR
                 FRT-DATE-RCVD-CN > HIGH-DATE-CN
                  GO TO 6-MAIN
              END-IF
           END-IF.

       4-WRITE-TO-SORT.
           IF HISTORY = "Y"
               MOVE FRTH-PO-NUM             TO  SRT-PO
               MOVE FRTH-PO-RLSE            TO  SRT-RLSE-NO
               MOVE FRTH-PO-RS              TO  SRT-RCV-NO
               MOVE FRTH-DATE-RCVD          TO  NUMERIC-DATE
               MOVE NUMERIC-DATE            TO  SRT-DATE-RCVD
               MOVE FRTH-TYPE               TO  SRT-TYPE
               MOVE FRTH-CARRIER            TO  SRT-CARRIER
               MOVE FRTH-BILL-NO            TO  SRT-BILL-NO
               IF FRTH-CHARGES < 0
                  MOVE ZEROES               TO  SRT-CHARGES
               ELSE
                   MOVE FRTH-CHARGES        TO  SRT-CHARGES
               END-IF
               MOVE FRTH-CARRIER-WT         TO  SRT-CARR-WT
               MOVE "*"                     TO  SRT-HISTORY
           ELSE
               MOVE FRT-PO-NUM              TO  SRT-PO
               MOVE FRT-PO-RLSE             TO  SRT-RLSE-NO
               MOVE FRT-PO-RS               TO  SRT-RCV-NO
               MOVE FRT-DATE-RCVD-CN        TO  SRT-DATE-RCVD
               MOVE FRT-TYPE                TO  SRT-TYPE
               MOVE FRT-CARRIER             TO  SRT-CARRIER
               MOVE FRT-BILL-NO             TO  SRT-BILL-NO
               IF FRT-CHARGES-9 < 0
                  MOVE ZEROES               TO  SRT-CHARGES
               ELSE
                   MOVE FRT-CHARGES-9       TO  SRT-CHARGES
               END-IF
               MOVE FRT-CARRIER-WT          TO  SRT-CARR-WT
               MOVE SPACES                  TO  SRT-HISTORY
           END-IF
           RELEASE SORT-RECORD.
           ADD 1 TO SORT-RECORDS.
           GO TO 6-MAIN.

       6-M-X.
           EXIT.
       INPUT-EXIT.
           EXIT.

       THE-OUTPUT.

           MOVE "DHDR102.PUB"            TO  HD-FILE-NAME.
      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
                 HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERR 1-HSK" TO BU-DISPLAY-MSG
               MOVE HD-RET-CODE       TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           IF PAPER-IS-132-COLS
                NEXT SENTENCE
           ELSE
               WRITE PRINT-RECORD FROM COMPRESS-PRINT AFTER ADVANCING 0
               WRITE PRINT-RECORD  FROM ESC-TEXT-61 AFTER ADVANCING 0.

           IF SORT-RECORDS = 0
               PERFORM 701-CHECK-PAGE
               MOVE SPACES TO PRT-LINE
               MOVE "NO RECORDS FOUND FOR THE REPORT" TO PRT-LINE
               WRITE PRINT-RECORD FROM PRT-LINE AFTER ADVANCING 1
               GO TO 70-FINISH-REPORT.

       70-READ-SORT-RECORD.
           RETURN SORT-FILE   AT END
               GO TO 70-FINISH-REPORT.

           PERFORM 701-CHECK-PAGE.
           MOVE SPACES                  TO  PRT-LINE.
           MOVE SRT-DATE-YMD            TO  DATE-VALIDATE-IN.
           MOVE 4                       TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT          TO  PRT-DATE-RCVD.
           MOVE SRT-PO                  TO  PRT-PO.
           MOVE SRT-RLSE-NO             TO  PRT-RLSE-NO.
           MOVE "-"                     TO  PRT-DASH.
           MOVE SRT-RCV-NO              TO  PRT-RCV-NO.
           MOVE SRT-HISTORY             TO  PRT-HIST.
           PERFORM 702-GET-VENDOR THRU 702-EXIT.
           MOVE SRT-CARRIER             TO  PRT-CARRIER.
           MOVE SRT-TYPE                TO  PRT-TYPE.
           MOVE SRT-CARR-WT             TO  PRT-CARR-WT.
           MOVE SRT-BILL-NO             TO  PRT-BILL-NO.
           MOVE SRT-CHARGES             TO  PRT-CHARGES.
           WRITE PRINT-RECORD FROM PRT-LINE AFTER ADVANCING 1.
           ADD 1                        TO  LINE-CTR.
           GO TO 70-READ-SORT-RECORD.


       701-CHECK-PAGE.
      *------CHECK FOR TOP OF PAGE
           IF LINE-CTR > 45
               MOVE ZERO                TO  LINE-CTR
               ADD 1                    TO  PAGE-CTR
               ADD 6                    TO  LINE-CTR
               MOVE PAGE-CTR            TO  PAGE-NO
               MOVE SAVE-DATE           TO  PRT-DATE
               WRITE PRINT-RECORD FROM HEADER-1 AFTER
                    ADVANCING NEW-PAGE
               WRITE PRINT-RECORD FROM HEADER-1B AFTER
                    ADVANCING 1
               WRITE PRINT-RECORD FROM HEADER-4 AFTER
                    ADVANCING 2
               WRITE PRINT-RECORD FROM HEADER-2 AFTER
                    ADVANCING 1
               WRITE PRINT-RECORD FROM HEADER-3 AFTER
                    ADVANCING 1.


       702-GET-VENDOR.
           IF SRT-HISTORY = "*"
               MOVE SRT-PO-RLSE TO PO-NUMBER-H
               MOVE PO-ARG-H TO PORCVNO OF DPORECDH
               START DPORECDH KEY >= EXTERNALLY-DESCRIBED-KEY
               READ DPORECDH NEXT INTO BUF-DPORECD-H
               IF FILE-STATUS NOT = "00"
                  MOVE SPACES TO PRT-VEND-NAME
               ELSE
                  IF POH-POH-NO NOT = PO-H OR
                     POH-RLS-NO NOT = PO-RLSE-H
                      MOVE SPACES TO PRT-VEND-NAME
                  ELSE
                      MOVE POH-VEN-CODE TO VENCDE OF DVENDOR
                      MOVE "00" TO VENITMNO
                      READ DVENDOR INTO BUF-DVENDOR
                      IF FILE-STATUS NOT = "00"
                         MOVE SPACES TO PRT-VEND-NAME
                      ELSE
                         MOVE VEN-NAME TO PRT-VEND-NAME
                      END-IF
                  END-IF
               END-IF
           ELSE
               MOVE SRT-PO-RLSE TO PO-NUMBER
               MOVE PO-ARG TO PORCVNO OF DPORECD
               READ DPORECD INTO BUF-DPORECD
               IF FILE-STATUS NOT = "00"
                  MOVE SPACES TO PRT-VEND-NAME
               ELSE
                  MOVE PO-VEN-CODE TO VENCDE OF DVENDOR
                  MOVE "00" TO VENITMNO
                  READ DVENDOR INTO BUF-DVENDOR
                  IF FILE-STATUS NOT = "00"
                     MOVE SPACES TO PRT-VEND-NAME
                  ELSE
                     MOVE VEN-NAME TO PRT-VEND-NAME
               END-IF
           END-IF.

       702-EXIT.
           EXIT.

       70-FINISH-REPORT.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRINT-RECORD FROM NORMAL-PRINT AFTER ADVANCING 0
               WRITE PRINT-RECORD FROM ESC-TEXT-60 AFTER ADVANCING 0.
           CLOSE PRINT-FILE.

       OUTPUT-EXIT.
           EXIT.
       COPY OVRPFCALL OF COPYLIB.
