       IDENTIFICATION DIVISION.
       PROGRAM-ID.        TFRTSTAT.
       AUTHOR.            DAVE PLUM.
       DATE-WRITTEN.      JUNE 1993.
      *INSTALLATION.      THE GOODYEAR TIRE AND RUBBER COMPANY.
      *D************************************************************************
      *D REMARKS.          THIS PROGRAM PRODUCES A FREIGHT STATUS REPORT
      *D                   USING DATA PRIMARILY OBTAINED FROM THE DATASET
      *D                   DAPPLFRT (MCFPCA1100).  THE REPORT IS SORTED BY
      *D                   FREIGHT CARRIER CODE, AND BY THE CARRIER'S FREIGHT
      *D                   BILL NUMBER (PRO NUMBER) WITHIN CARRIER.
      *D************************************************************************
      *C CHANGES.
      *C
      *C 05OCT1993        DAVE PLUM
      *C MADE THE FOLLOWING CHANGES:
      *C    1) REVISED THE PROGRAM TO RELY ON THE FIELDS:
      *C          - MACCT-FRT-FIRST-DATE-PROCESSED
      *C          - MACCT-FRT-FIRST-TIME-PROCESSED
      *C          - MACCT-FRT-LAST-DATE-PROCESSED
      *C          - MACCT-FRT-LAST-TIME-PROCESSED
      *C       FROM KEY=FRT OF MACCOUNT-INFO.
      *C       INSTEAD OF THE PREVIOUS (PREV) AND NEXT MONTH-END DATE AND
      *C       TIME FIELDS FROM KEY=MTED, TO DETERMINE WHAT TIME PERIOD IS
      *C       TO BE INCLUDED IN THE "CURRENT MONTH".
      *C    2) ADDED THE GRAND TOTAL OF ALL "FRT" ENTRIES FOUND IN THE
      *C       DTRANS DATASET TO THE END OF THIS REPORT (THIS IS EFFECTIVELY
      *C       THE SAME AS THE CSAS TRANSACTIONS REPORT, TCSASTRN, SELECTING
      *C       ONLY "FRT" RECORDS.)  THIS VALUE IS THEN ALSO COMPARED TO THE
      *C       TOTAL DOLLARS APPLIED FOR THE CURRENT MONTH, AND A MESSAGE IS
      *C       PRINTED INDICATING WHETHER OR NOT THESE TWO VALUES ARE IN
      *C       BALANCE (THEY ALWAYS SHOULD BE).
      *C    3) REVISED THE REPORT HEADINGS TO INCLUDE:
      *C          - THE NAME OF THE CURRENT ACCOUNTING MONTH ABOVE THE
      *C            HEADING "APPLIED AMOUNT".
      *C          - THE SEQUENCE NUMBER OF THE LAST TIS FILE PROCESSED INTO
      *C            CSAS.
      *C
      *C OCT 29, 1993     CR KALMAN
      *C CHANGED THE DESCRIPTION OF "**MANUAL**" TO "  *MANUAL*" SO IT
      *C WILL BE INDENTED AND THEREFORE, EASIER TO IDENTIFY. REQUESTED
      *C BY GADSDEN.
      *C
      *C 10FEB1994    DAVE PLUM
      *C   ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
DP9404*C 11APR1994    DAVE PLUM      REQUEST #6492
DP9404*C   REVISED THE PROGRAM TO PLACE " **** " IN THE TIS PAID DATE
DP9404*C   COLUMN FOR THOSE FREIGHT BILLS WHICH THE USER HAS UPDATED TO
DP9404*C   HAVE PAID AMOUNT = $0.  THESE FREIGHT BILLS CAN BE IDENTIFIED
DP9404*C   BY THE PRESENCE OF A PAID APPLIED DATE GREATER THAN SPACES
DP9404*C   AND A TIS PAID DATE OF SPACES.
DP9404*C
CY9511*C 01NOV1995    CA YODER
CY9511*C   IF NO RECORDS FOUND IN DAPPLFRT, A MESSAGE WILL NOW PRINT OUT
CY9511*C   ON THE FREIGHT STATUS REPORT INSTEAD OF BLOWING UP.
CY9511*C
CY9606*C 19JUN1996    CA YODER
CY9606*C   MODIFIED FOR CENTURY DATABASE CHANGES.
      *C
      *C 30OCT2001    CA YODER
      *C   INCREASED RATED AND PAID AMOUNT FIELD SIZE TO 7 PLACES BEFORE
      *C   DECIMAL POINT.  DANVILLE HAD RECORDS FOR $4M, WHICH WAS NOT
      *C   DISPLAYING ON THE REPORT.
      *C
      **********************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.      C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ONLINE-PRT     ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE      ASSIGN TO DISK-SORT.

           SELECT CARRIER-FILE
              ASSIGN TO DATABASE-MCFLCACARR
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

            SELECT DAPPLFRT
              ASSIGN TO DATABASE-MCFLCA1101
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

            SELECT MACCOUNT
              ASSIGN TO DATABASE-MCFLCA0101
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.

            SELECT DTRANS
              ASSIGN TO DATABASE-MCFLCA0701
              ORGANIZATION IS INDEXED
              ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                    PIC X(132).

       SD  SORT-FILE
           RECORD CONTAINS 121 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-CARRIER             PIC X(4).
           05  SORT-PRO-NO              PIC X(16).
           05  FILLER                   PIC X(101).

       FD  CARRIER-FILE
           LABEL RECORDS ARE STANDARD.
       01  CARRIER-REC.
           COPY DDS-MCRPCACARR  OF MCFLCACARR.

       FD  DAPPLFRT
           LABEL RECORDS ARE STANDARD.
       01  DAPPLFRT-REC.
           COPY DDS-MCRPCA1100  OF MCFLCA1101.

       FD  MACCOUNT
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-REC.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

      ******************************************************************
      *                                                                *
      *  W O R K I N G   -   S T O R A G E   S E C T I O N             *
      *                                                                *
      ******************************************************************

       WORKING-STORAGE SECTION.

       01  COUNTERS              COMP-3.
           05  LINE-COUNT              PIC S9(3) VALUE 0.
           05  PAGE-COUNT              PIC S9(3) VALUE 0.
           05  CNTL-RECS-TO-SORT       PIC S9(7) VALUE 0.
           05  CNTL-RECS-FROM-SORT     PIC S9(7) VALUE 0.
           05  CNTL-DAPPLFRT-RECS-READ PIC S9(7) VALUE 0.
           05  CNTL-DTRANS-RECS-READ   PIC S9(7) VALUE 0.

       01  DISPLAY-FIELDS.
           05  DISPLAY-COUNT       PIC Z,ZZZ,ZZ9-          VALUE ZEROES.
           05  DISPLAY-AMOUNT      PIC ZZZ,ZZZ,ZZZ,ZZ9.99- VALUE ZEROES.

       01  FLAGS.
           05  EOF-DAPPLFRT-FILE       PIC X(1) VALUE "N".
           05  EOF-SORT-FILE           PIC X(1) VALUE "N".
           05  EOF-DTRANS-FILE         PIC X(1) VALUE "N".

       01  SAVE-CARRIER                PIC X(4) VALUE SPACES.

       01  SAVE-CURR-DATE.
           05  SAVE-CURR-DATE-CC                  PIC X(2) VALUE SPACES.
           05  SAVE-CURR-DATE-YYMMDD.
               10 SAVE-CURR-DATE-YY               PIC X(2) VALUE SPACES.
               10 SAVE-CURR-DATE-MM               PIC X(2) VALUE SPACES.
               10 SAVE-CURR-DATE-DD               PIC X(2) VALUE SPACES.

       01  SAVE-ACCTG-MONTH-YEAR.
           05  SAVE-ACCTG-MONTH                   PIC X(2) VALUE SPACES.
           05  SAVE-ACCTG-CC                      PIC X(2) VALUE SPACES.
           05  SAVE-ACCTG-YEAR                    PIC X(2) VALUE SPACES.

       01  SAVE-FIRST-DATE-TIME.
           05  SAVE-FIRST-DATE.
               10  SAVE-FIRST-DATE-CC             PIC X(2) VALUE SPACES.
               10  SAVE-FIRST-DATE-YY             PIC X(2) VALUE SPACES.
               10  SAVE-FIRST-DATE-MM             PIC X(2) VALUE SPACES.
               10  SAVE-FIRST-DATE-DD             PIC X(2) VALUE SPACES.
           05  SAVE-FIRST-TIME.
               10  SAVE-FIRST-TIME-HH             PIC X(2) VALUE SPACES.
               10  SAVE-FIRST-TIME-MM             PIC X(2) VALUE SPACES.
               10  SAVE-FIRST-TIME-SS             PIC X(2) VALUE SPACES.

       01  SAVE-LAST-DATE-TIME.
           05  SAVE-LAST-DATE.
               10  SAVE-LAST-DATE-CC              PIC X(2) VALUE SPACES.
               10  SAVE-LAST-DATE-YY              PIC X(2) VALUE SPACES.
               10  SAVE-LAST-DATE-MM              PIC X(2) VALUE SPACES.
               10  SAVE-LAST-DATE-DD              PIC X(2) VALUE SPACES.
           05  SAVE-LAST-TIME.
               10  SAVE-LAST-TIME-HH              PIC X(2) VALUE SPACES.
               10  SAVE-LAST-TIME-MM              PIC X(2) VALUE SPACES.
               10  SAVE-LAST-TIME-SS              PIC X(2) VALUE SPACES.

       COPY MONTHS OF COPYLIB.

       01  MONTH-SUB                              PIC 9(2) VALUE 0.

       01  WS-TOTALS             COMP-3.
           05  WS-TOT-RATED-AMT        PIC S9(13)V9(2) VALUE 0.
           05  WS-TOT-TAX              PIC S9(13)V9(2) VALUE 0.
           05  WS-TOT-PAID-AMT         PIC S9(13)V9(2) VALUE 0.
           05  WS-TOT-APPLIED-AMT      PIC S9(13)V9(2) VALUE 0.
           05  FIN-TOT-RATED-AMT       PIC S9(13)V9(2) VALUE 0.
           05  FIN-TOT-TAX             PIC S9(13)V9(2) VALUE 0.
           05  FIN-TOT-PAID-AMT        PIC S9(13)V9(2) VALUE 0.
           05  FIN-TOT-APPLIED-AMT     PIC S9(13)V9(2) VALUE 0.
           05  DTRANS-TOT-APPLIED-AMT  PIC S9(13)V9(2) VALUE 0.

      ******************************************************************
      *  R E P O R T   H E A D I N G S                                 *
      ******************************************************************

       01  HEADING1.
           05  FILLER                PIC X(8)  VALUE "TFRTSTAT".
           05  FILLER                PIC X(41) VALUE SPACES.
           05  FILLER                PIC X(34)
                VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
           05  FILLER                PIC X(34) VALUE SPACES.
           05  FILLER                PIC X(5)  VALUE "DATE ".
           05  HEADING1-DATE.
               10 HEADING1-DATE-MM   PIC X(2)  VALUE SPACES.
               10 FILLER             PIC X(1)  VALUE "/".
               10 HEADING1-DATE-DD   PIC X(2)  VALUE SPACES.
               10 FILLER             PIC X(1)  VALUE "/".
               10 HEADING1-DATE-CC   PIC X(2)  VALUE SPACES.
               10 HEADING1-DATE-YY   PIC X(2)  VALUE SPACES.

       01  HEADING2.
           05  FILLER                PIC X(6)  VALUE "PAGE  ".
           05  HEADING2-PAGE-NO      PIC Z(2)9 VALUE ZEROES.
           05  FILLER                PIC X(46) VALUE SPACES.
           05  FILLER                PIC X(21)
                VALUE "FREIGHT STATUS REPORT".
           05  FILLER                PIC X(41) VALUE SPACES.
           05  FILLER                PIC X(7)  VALUE "TIME   ".
           05  HEADING2-TIME         PIC X(8)  VALUE SPACES.

       01  HEADING3.
           05  FILLER                PIC X(5)  VALUE "FILE ".
           05  HEADING3-LAST-FILE    PIC X(4)  VALUE SPACES.
           05  FILLER                PIC X(50) VALUE SPACES.
           05  HEADING3-MONTH-NAME   PIC X(9)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE SPACES.
           05  HEADING3-DATE-CC      PIC X(2)  VALUE SPACES.
           05  HEADING3-DATE-YY      PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(59) VALUE SPACES.

       01  HEADING4.
           05  FILLER                PIC X(44) VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE "(".
           05  HEADING4-DATE1-MM     PIC Z9    VALUE ZEROES.
           05  FILLER                PIC X(1)  VALUE "/".
           05  HEADING4-DATE1-DD     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE "/".
           05  HEADING4-DATE1-CC     PIC X(2)  VALUE SPACES.
           05  HEADING4-DATE1-YY     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE SPACES.
           05  HEADING4-TIME1-HH     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE ":".
           05  HEADING4-TIME1-MM     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE ":".
           05  HEADING4-TIME1-SS     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(3)  VALUE " - ".
           05  HEADING4-DATE2-MM     PIC Z9    VALUE ZEROES.
           05  FILLER                PIC X(1)  VALUE "/".
           05  HEADING4-DATE2-DD     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE "/".
           05  HEADING4-DATE2-CC     PIC X(2)  VALUE SPACES.
           05  HEADING4-DATE2-YY     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE SPACES.
           05  HEADING4-TIME2-HH     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE ":".
           05  HEADING4-TIME2-MM     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE ":".
           05  HEADING4-TIME2-SS     PIC X(2)  VALUE SPACES.
           05  FILLER                PIC X(1)  VALUE ")".
           05  FILLER                PIC X(45) VALUE SPACES.

       01  SUB-HEADING1.
           05  FILLER  PIC X(108) VALUE SPACES.
           05  SUBHEAD1-MONTH-NAME   PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(15) VALUE SPACES.

       01  SUB-HEADING2.
           05  FILLER  PIC X(25) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "SHIP   VEHICLE".
           05  FILLER  PIC X(26) VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE "RATED".
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE "PAID   TIS PAID     ".
           05  FILLER  PIC X(22) VALUE "APPLIED  APPLIED  DLVR".

       01  SUB-HEADING3.
           05  FILLER  PIC X(16) VALUE "CARR  PRO NUMBER".
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(19) VALUE "DATE   NUMBER      ".
           05  FILLER  PIC X(20) VALUE "PO NUMBER  RCVR     ".
           05  FILLER  PIC X(24) VALUE "AMOUNT         TAX      ".
           05  FILLER  PIC X(29) VALUE "AMOUNT     DATE        AMOUNT".
           05  FILLER  PIC X(15) VALUE "    DATE   CARR".

       01  SUB-HEADING4.
           05  FILLER  PIC X(20) VALUE "____  ______________".
           05  FILLER  PIC X(20) VALUE "__  ______  ________".
           05  FILLER  PIC X(20) VALUE "__  __________ ____ ".
           05  FILLER  PIC X(20) VALUE " _________   _______".
           05  FILLER  PIC X(20) VALUE "__   _________   ___".
           05  FILLER  PIC X(20) VALUE "_____   _________  _".
           05  FILLER  PIC X(12) VALUE "______  ____".

      ******************************************************************
      *  R E P O R T   P R I N T   R E C O R D S                       *
      ******************************************************************

       01  BLANK-LINE                    PIC X(132) VALUE SPACES.

       01  DETAIL-LINE.
           05  DL-CARRIER                PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-PRO-NO                 PIC X(16) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-SHIP-DATE              PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-VEHICLE                PIC X(10) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-PO-NUMBER              PIC X(10) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-RCVR-NUMBER            PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-RATED-AMT              PIC Z(5)9.99-  VALUE ZEROES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-TAX                    PIC Z(5)9.99-  VALUE ZEROES.
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  DL-PAID-AMT               PIC Z(6)9.99-  VALUE ZEROES.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  DL-PAID-DATE              PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  DL-APPLIED-AMT            PIC Z(6)9.99-  VALUE ZEROES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-APPLIED-DATE           PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  DL-DLVR-CARRIER           PIC X(4)  VALUE SPACES.

       01  DETAIL-LINE2.
           05  DL2-CARRIER               PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE " - ".
           05  DL2-CARRIER-NAME          PIC X(30) VALUE SPACES.
           05  FILLER                    PIC X(95) VALUE SPACES.

       01  TOTALS-LINE.
           05  TL-TEXT                   PIC X(60) VALUE SPACES.
           05  TL-RATED-AMT              PIC Z(6)9.99-  VALUE ZEROES.
           05  TL-RATED-AMT-X   REDEFINES TL-RATED-AMT
                                         PIC X(11).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  TL-TAX                    PIC Z(6)9.99-  VALUE ZEROES.
           05  TL-TAX-X         REDEFINES TL-TAX
                                         PIC X(11).
           05  FILLER                    PIC X(1)  VALUE SPACES.
           05  TL-PAID-AMT               PIC Z(6)9.99-  VALUE ZEROES.
           05  TL-PAID-AMT-X    REDEFINES TL-PAID-AMT
                                         PIC X(11).
           05  FILLER                    PIC X(12) VALUE SPACES.
           05  TL-APPLIED-AMT            PIC Z(6)9.99-  VALUE ZEROES.
           05  TL-APPLIED-AMT-X REDEFINES TL-APPLIED-AMT
                                         PIC X(11).
           05  FILLER                    PIC X(14) VALUE SPACES.

       01  ERROR-LINE.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER                    PIC X(47) VALUE
                     "*** NO FREIGHT RECORDS QUALIFIED FOR REPORT ***".
           05  FILLER                    PIC X(80) VALUE SPACES.

      ******************************************************************
      *  S O R T   R E C O R D                                         *
      ******************************************************************

       01  WS-S-REC.
           05  WS-S-CARRIER             PIC X(4)  VALUE SPACES.
           05  WS-S-PRO-NO              PIC X(16) VALUE SPACES.
           05  WS-S-SHIP-DATE           PIC X(6)  VALUE SPACES.
           05  WS-S-VEHICLE             PIC X(10) VALUE SPACES.
           05  WS-S-PO-NUMBER           PIC X(10) VALUE SPACES.
           05  WS-S-RCVR-NUMBER         PIC X(3)  VALUE SPACES.
           05  WS-S-RATED-AMT           PIC S9(12)V9(2) VALUE 0.
           05  WS-S-TAX                 PIC S9(12)V9(2) VALUE 0.
           05  WS-S-PAID-AMT            PIC S9(12)V9(2) VALUE 0.
           05  WS-S-PAID-DATE           PIC X(6)  VALUE SPACES.
           05  WS-S-APPLIED-AMT         PIC S9(12)V9(2) VALUE 0.
           05  WS-S-APPLIED-DATE        PIC X(6)  VALUE SPACES.
           05  WS-S-DLVR-CARRIER        PIC X(4)  VALUE SPACES.

      ******************************************************************
      *  D A T A B A S E   B U F F E R S                               *
      ******************************************************************

       COPY DAPPLFRT OF COPYLIB.

       COPY MACTINFO OF COPYLIB.

       COPY DTRANS OF COPYLIB.

       01  WS-CARRIER-REC.
           05  WS-C-CARRIER             PIC X(4)  VALUE SPACES.
           05  WS-C-CARRIER-NAME        PIC X(30) VALUE SPACES.
           05  WS-C-CARRIER-EXPEDITE    PIC X(1)  VALUE SPACES.
           05  FILLER                   PIC X(1)  VALUE SPACES.

      ******************************************************************
      *  D A T A B A S E   W O R K                                     *
      ******************************************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X(1) VALUE SPACES.
           05  FILE-STATUS-2             PIC X(1) VALUE SPACES.

       COPY DBCSACCT OF COPYLIB.
       COPY DBSTAT   OF COPYLIB.

      ******************************************************************
      *  C A L L E D   R O U T I N E S                                 *
      ******************************************************************

       01  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".

       COPY TDATECHK OF COPYLIB.

       COPY TBLOWUP OF COPYLIB.

      ******************************************************************
      *                                                                *
      *  P R O C E D U R E   D I V I S I O N                           *
      *                                                                *
      ******************************************************************

       PROCEDURE DIVISION.

       MAINLINE SECTION.
       MAINLINE-PARAGRAPH.
           PERFORM 1-HSK.

           SORT SORT-FILE
              ON ASCENDING KEY SORT-CARRIER
                               SORT-PRO-NO
              INPUT  PROCEDURE IS 7-PROCESS-DAPPLFRT
              OUTPUT PROCEDURE IS 8-PRINT-REPORT.

       1-END-PGM.

           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           MOVE SPACES TO BU-DISPLAY-AREA.

           OPEN INPUT  CARRIER-FILE
                       DAPPLFRT
                       MACCOUNT
                       DTRANS.
           OPEN OUTPUT ONLINE-PRT.

      *----- GET THE CURRENT DATE AND TIME USING TDATECHK
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT            TO SAVE-CURR-DATE-YYMMDD.

      *----- DETERMINE THE CENTURY FOR THE CURRENT DATE
           IF SAVE-CURR-DATE-YY < "70"
               MOVE "20" TO SAVE-CURR-DATE-CC
           ELSE
               MOVE "19" TO SAVE-CURR-DATE-CC.

           MOVE SAVE-CURR-DATE-MM       TO HEADING1-DATE-MM.
           MOVE SAVE-CURR-DATE-DD       TO HEADING1-DATE-DD.
           MOVE SAVE-CURR-DATE-CC       TO HEADING1-DATE-CC.
           MOVE SAVE-CURR-DATE-YY       TO HEADING1-DATE-YY.
           MOVE DATE-FORMATTED-TIME-OUT TO HEADING2-TIME.
           DISPLAY "SAVE-CURR-DATE = ", SAVE-CURR-DATE.

           MOVE "00" TO FILE-STATUS.
           MOVE "MY  " TO INFOKEY OF MACCOUNT-REC.
           READ MACCOUNT INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MACCOUNT KEY=MY * 1-HSK"
                 TO BU-DISPLAY-MSG
               MOVE "MY  " TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE MACCT-MONTH TO SAVE-ACCTG-MONTH.
           MOVE MACCT-YEAR  TO SAVE-ACCTG-YEAR.

      *----- VALIDATE THE ACCTG MONTH AND YEAR
           IF   SAVE-ACCTG-MONTH > "00"
            AND SAVE-ACCTG-MONTH < "13"
            AND SAVE-ACCTG-YEAR  IS NUMERIC
               NEXT SENTENCE
           ELSE
               MOVE "INVALID ACCTG MONTH AND/OR YEAR * 1-HSK"
                 TO BU-DISPLAY-MSG
               MOVE "MY  "      TO BU-DISPLAY-FLD (1)
               MOVE MACCT-MONTH TO BU-DISPLAY-FLD (2)
               MOVE MACCT-YEAR  TO BU-DISPLAY-FLD (3)
               PERFORM 2-BLOWUP.

           MOVE SAVE-ACCTG-MONTH      TO MONTH-SUB.
           MOVE MONTH-T (MONTH-SUB)   TO HEADING3-MONTH-NAME
           MOVE MONTH-T-R (MONTH-SUB) TO SUBHEAD1-MONTH-NAME.

      *---- DETERMINE THE CENTURY FOR THE ACCTG MONTH AND YEAR
           IF SAVE-ACCTG-YEAR < "70"
               MOVE "20" TO SAVE-ACCTG-CC
           ELSE
               MOVE "19" TO SAVE-ACCTG-CC.

           MOVE SAVE-ACCTG-CC       TO HEADING3-DATE-CC.
           MOVE SAVE-ACCTG-YEAR     TO HEADING3-DATE-YY.
           DISPLAY "SAVE-ACCTG-MONTH-YEAR = ", SAVE-ACCTG-MONTH-YEAR.

           MOVE "00" TO FILE-STATUS.
           MOVE "FRT " TO INFOKEY OF MACCOUNT-REC.
           READ MACCOUNT INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MACCOUNT KEY=FRT * 1-HSK"
                 TO BU-DISPLAY-MSG
               MOVE "FRT " TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.

           MOVE MACCT-FRT-LAST-FILE-PROCESSED  TO HEADING3-LAST-FILE.

           MOVE MACCT-FRT-FIRST-DATE-PROCESSED TO SAVE-FIRST-DATE.
           MOVE MACCT-FRT-FIRST-TIME-PROCESSED TO SAVE-FIRST-TIME.
           MOVE MACCT-FRT-LAST-DATE-PROCESSED  TO SAVE-LAST-DATE.
           MOVE MACCT-FRT-LAST-TIME-PROCESSED  TO SAVE-LAST-TIME.

           MOVE SAVE-FIRST-DATE-MM        TO HEADING4-DATE1-MM.
           MOVE SAVE-FIRST-DATE-DD        TO HEADING4-DATE1-DD.
           MOVE SAVE-FIRST-DATE-CC        TO HEADING4-DATE1-CC.
           MOVE SAVE-FIRST-DATE-YY        TO HEADING4-DATE1-YY.
           MOVE SAVE-FIRST-TIME-HH        TO HEADING4-TIME1-HH.
           MOVE SAVE-FIRST-TIME-MM        TO HEADING4-TIME1-MM.
           MOVE SAVE-FIRST-TIME-SS        TO HEADING4-TIME1-SS.
           MOVE SAVE-LAST-DATE-MM         TO HEADING4-DATE2-MM.
           MOVE SAVE-LAST-DATE-DD         TO HEADING4-DATE2-DD.
           MOVE SAVE-LAST-DATE-CC         TO HEADING4-DATE2-CC.
           MOVE SAVE-LAST-DATE-YY         TO HEADING4-DATE2-YY.
           MOVE SAVE-LAST-TIME-HH         TO HEADING4-TIME2-HH.
           MOVE SAVE-LAST-TIME-MM         TO HEADING4-TIME2-MM.
           MOVE SAVE-LAST-TIME-SS         TO HEADING4-TIME2-SS.

           DISPLAY "FIRST DATE/TIME = ", SAVE-FIRST-DATE, " ",
              SAVE-FIRST-TIME.
           DISPLAY "LAST DATE/TIME  = ", SAVE-LAST-DATE, " ",
              SAVE-LAST-TIME.

       2-EOJ.
           CLOSE CARRIER-FILE
                 DAPPLFRT
                 MACCOUNT
                 DTRANS
                 ONLINE-PRT.

       2-BLOWUP.
           MOVE "TFRTSTAT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
                 DUMMY-VIEW-AREA, FILE-STATUS  BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.

      ******************************************************************
      *  I N P U T   P R O C E D U R E                                 *
      ******************************************************************

       7-PROCESS-DAPPLFRT SECTION.
       7-PROCESS-DAPPLFRT-PARA.
           PERFORM 7-1-BEGIN.
           PERFORM 7-6-PROCESS-A-REC
              UNTIL EOF-DAPPLFRT-FILE = "Y".
           PERFORM 7-2-END.
           GO TO 7-PROCESS-DAPPLFRT-X.

       7-1-BEGIN.
      *---- READ THE FIRST DAPPLFRT RECORD INTO BUF-DAPPLFRT
           MOVE SPACES TO PORCVNO OF DAPPLFRT-REC.
           START DAPPLFRT KEY >= PORCVNO OF DAPPLFRT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
CY9511         IF FILE-STATUS = "23"
CY9511             PERFORM 8-11-PRINT-HEADINGS
CY9511             WRITE PRINT-REC FROM ERROR-LINE   AFTER ADVANCING 2
CY9511             GO TO 1-END-PGM
               ELSE
                   MOVE "BAD STATUS ON START * 7-1-BEGIN"
                       TO BU-DISPLAY-MSG
               END-IF
               PERFORM 2-BLOWUP.
           PERFORM 7-3-READ-DAPPLFRT.

           IF EOF-DAPPLFRT-FILE = "Y"
               MOVE "FIRST READ OF DAPPLFRT FAILED * 7-1-B"
                 TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

       7-2-END.
           MOVE CNTL-DAPPLFRT-RECS-READ TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF DAPPLFRT RECS READ      = " DISPLAY-COUNT.
           MOVE CNTL-RECS-TO-SORT       TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF RECS RELEASED TO SORT   = " DISPLAY-COUNT.

       7-3-READ-DAPPLFRT.
           MOVE "00" TO FILE-STATUS.
           READ DAPPLFRT NEXT INTO BUF-DAPPLFRT
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               ADD +1 TO CNTL-DAPPLFRT-RECS-READ
           ELSE
               IF FILE-STATUS = "10"
                   MOVE "Y" TO EOF-DAPPLFRT-FILE
               ELSE
                   MOVE "UNEXPECTED STATUS * 7-3-READ"
                     TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       7-4-RELEASE-REC-TO-SORT.
           RELEASE SORT-REC FROM WS-S-REC.
           ADD +1 TO CNTL-RECS-TO-SORT.

      ******************************************************************
      * PARAGRAPH 7-6-PROCESS-A-REC IS USED TO PROCESS A SINGLE        *
      * DAPPLFRT RECORD.  THIS PARAGRAPH DETERMINES WHAT GENERAL TYPE  *
      * OF FREIGHT RECORD WE ARE DEALING WITH.                         *
      *                                                                *
      * IT SEPERATES DAPPLFRT RECORDS INTO THE FOLLOWING BASIC TYPES:  *
      *   1)CANCELLED RECORDS                                          *
      *        - NOT INCLUDED ON THE FREIGHT STATUS REPORT             *
      *   2)"MANUAL" RECORDS                                           *
      *        - FREIGHT BILLS WHICH DO NOT HAVE PURCHASE ORDER DATA   *
      *        - (PO NUMBER FIELD IS EQUAL TO SPACES)                  *
      *   3)RATED RECORDS                                              *
      *        - FRT BILLS WHICH HAVE "RATED" DATA, BUT NO "PAID" DATA *
      *   4)PAID RECORDS                                               *
      *        - FRT BILLS WHICH HAVE "PAID" DATA, BUT NO "RATED" DATA *
      *   5)RATED & PAID RECORDS                                       *
      *        - FRT BILLS WHICH HAVE BOTH "RATED" AND "PAID" DATA     *
      *   6) "BLANK" RECORDS                                           *
      *        - FRT BILLS WHICH LACK BOTH "RATED" AND "PAID" DATA     *
      *        - RECORDS OF THIS TYPE SHOULD NOT EXIST IN THE FILE     *
      *                                                                *
      * WE WILL CHECK FOR TYPES 1) AND 2) FIRST, AND ONLY IF A RECORD  *
      * IS NOT "CANCELLED" OR A "MANUAL" WILL WE CHECK TO SEE IF IT IS *
      * ONE OF THE OTHER TYPES.                                        *
      ******************************************************************

       7-6-PROCESS-A-REC.

           IF DAPPL-STAT-IS-CANCELLED
               NEXT SENTENCE
           ELSE
               IF DAPPL-PO-13 = SPACES
                   PERFORM 7-61-PROC-A-MANUAL-REC
               ELSE
                   IF DAPPL-RATED-APPL-DATE-TIME > SPACES
                       IF DAPPL-PAID-APPL-DATE-TIME > SPACES
                           PERFORM 7-62-PROC-A-RATED-PAID-REC
                       ELSE
                           PERFORM 7-63-PROC-A-RATED-REC
                   ELSE
                       IF DAPPL-PAID-APPL-DATE-TIME > SPACES
                           PERFORM 7-64-PROC-A-PAID-REC
                       ELSE
                           PERFORM 7-65-PROC-A-BLANK-REC.

           PERFORM 7-3-READ-DAPPLFRT.

       7-61-PROC-A-MANUAL-REC.
           MOVE DAPPL-PAID-CARRIER         TO WS-S-CARRIER.
           MOVE DAPPL-PAID-PRO-NO          TO WS-S-PRO-NO.
           MOVE DAPPL-TIS-SHIP-YYMMDD      TO WS-S-SHIP-DATE.
           MOVE DAPPL-RAIL-CAR             TO WS-S-VEHICLE.
9310CK     MOVE "  *MANUAL*"               TO WS-S-PO-NUMBER.
           MOVE SPACES                     TO WS-S-RCVR-NUMBER.
           MOVE ZEROES                     TO WS-S-RATED-AMT.
           MOVE ZEROES                     TO WS-S-TAX.
           MOVE DAPPL-PAID-AMT             TO WS-S-PAID-AMT.
           MOVE DAPPL-TIS-PAID-YYMMDD      TO WS-S-PAID-DATE.
           MOVE ZEROES                     TO WS-S-APPLIED-AMT.
           MOVE SPACES                     TO WS-S-APPLIED-DATE.
           MOVE SPACES                     TO WS-S-DLVR-CARRIER.

           PERFORM 7-4-RELEASE-REC-TO-SORT.

       7-62-PROC-A-RATED-PAID-REC.
      *----- FIRST OF ALL, WE MUST DECIDE IF THIS RECORD EVEN NEEDS TO
      *----- BE INCLUDED ON THE REPORT.  IF THE PAID AMOUNT WAS APPLIED
      *----- DURING THIS ACCTG MONTH (FIRST DATE/TIME THROUGH THE LAST
      *----- DATE/TIME),
      *-----    - INCLUDE THE RECORD ON THE REPORT (CREATE A SORT REC)
      *----- OTHERWISE WE DON'T NEED THIS RECORD, SINCE NO DOLLARS HAVE
      *----- BEEN APPLIED DURING THE CURRENT ACCTG MONTH.
      *-----
      *----- WE ARE ASSUMMING THAT THE RATED APPLIED DATE WILL NEVER BE
      *----- GREATER THAN THE PAID APPLIED DATE.  THIS IS VALID SINCE
      *----- PGM TFRTPROC WILL NOT UPDATE A FREIGHT BILL'S RATED DATA
      *----- IF THE PAID AMOUNT (AND ANY TAX) HAS ALREADY BEEN APPLIED.

           IF   (DAPPL-PAID-APPL-DATE-TIME >= SAVE-FIRST-DATE-TIME)
            AND (DAPPL-PAID-APPL-DATE-TIME <= SAVE-LAST-DATE-TIME)
               PERFORM 7-621-REL-RATED-PAID-SORT-REC.

       7-621-REL-RATED-PAID-SORT-REC.
           MOVE DAPPL-PAID-CARRIER         TO WS-S-CARRIER.
           MOVE DAPPL-PAID-PRO-NO          TO WS-S-PRO-NO.
           MOVE DAPPL-TIS-SHIP-YYMMDD      TO WS-S-SHIP-DATE.
           MOVE DAPPL-RAIL-CAR             TO WS-S-VEHICLE.
           MOVE DAPPL-PO-10                TO WS-S-PO-NUMBER.
           MOVE DAPPL-PO-RCVR              TO WS-S-RCVR-NUMBER.
           MOVE DAPPL-RATED-AMT            TO WS-S-RATED-AMT.
           MOVE DAPPL-PAID-TAX             TO WS-S-TAX.
           MOVE DAPPL-PAID-AMT             TO WS-S-PAID-AMT.

DP9404*----- WE HAVE ALREADY ESTABLISHED THAT THIS FREIGHT BILL HAS
DP9404*----- BOTH A RATED APPLIED DATE AND A PAID APPLIED DATE.  IF
DP9404*----- THE TIS PAID DATE IS BLANK, THEN THE USER MUST HAVE USED
DP9404*----- AN AVAILABLE FUNCTION TO UPDATE THE PAID AMOUNT TO ZERO.
DP9404*----- THESE RECORDS SHOULD BE IDENTIFED WITH " **** " IN THE
DP9404*----- TIS PAID DATE COLUMN OF THE REPORT.
DP9404     IF (DAPPL-TIS-PAID-YYMMDD = SPACES AND DAPPL-PAID-AMT = 0)
DP9404          MOVE " **** "              TO WS-S-PAID-DATE
DP9404     ELSE
DP9404         MOVE DAPPL-TIS-PAID-YYMMDD  TO WS-S-PAID-DATE.

      *----- HERE WE MUST COMPUTE THE AMOUNT APPLIED DURING THIS
      *----- ACCTG MONTH (FIRST DATE/TIME THROUGH THE LAST DATE/TIME).
      *-----
      *----- WE HAVE ALREADY ESTABLISHED THAT THE PAID APPLIED DATE
      *----- FALLS WITHIN THE CURRENT MONTH ABOVE.  NOW WE MUST CONSIDER
      *----- THE RATED APPLIED DATE:
      *-----
      *----- IF RATED APPLIED DATE/TIME FALLS WITHIN THIS ACCTG MONTH,
      *-----    - THIS FRT BILL WAS BOTH RATED AND PAID DURING THIS
      *-----      MONTH, THEREFORE THE APPLIED AMOUNT = (PAID AMT + TAX)
      *-----    - MORE PRECISELY,
      *-----       1. WHEN THE RATED DATA WAS RECEIVED, THE RATED AMT
      *-----          WOULD HAVE BEEN APPLIED
      *-----       2. WHEN THE PAID DATA WAS RECEIVED LATER, THE AMOUNT
      *-----          APPLIED ON THAT DATE =(PAID AMT - RATED AMT) + TAX
      *-----      SO THE TOTAL AMOUNT APPLIED ON DATES 1 AND 2 WAS:
      *-----         (RATED AMT) + ((PAID AMT - RATED AMT) + TAX)
      *-----      WHICH IS MATHEMATICALLY THE SAME AS (PAID AMT + TAX).
      *-----
      *----- IF THE RATED APPLIED DATE/TIME FALLS OUTSIDE THIS ACCTG MONTH
      *-----    - (IT SHOULD BE SOME DATE/TIME PRIOR TO THE FIRST DATE/TIME
      *-----      SINCE A FRT BILL IS NOT EVER RATED AFTER THE PAID AMOUNT
      *-----      (AND ANY TAX) HAS BEEN APPLIED.
      *-----      SEE TFRTPROC FOR MORE SPECIFIC INFORMATION.)
      *-----    - THE AMOUNT APPLIED THIS MONTH = (PAID - RATED) + TAX

           IF   (DAPPL-RATED-APPL-DATE-TIME >= SAVE-FIRST-DATE-TIME)
            AND (DAPPL-RATED-APPL-DATE-TIME <= SAVE-LAST-DATE-TIME)
               COMPUTE WS-S-APPLIED-AMT =
                  DAPPL-PAID-AMT + DAPPL-PAID-TAX
           ELSE
               COMPUTE WS-S-APPLIED-AMT =
                  (DAPPL-PAID-AMT - DAPPL-RATED-AMT) + DAPPL-PAID-TAX.

           MOVE DAPPL-PAID-APPL-YYMMDD     TO WS-S-APPLIED-DATE.

           IF DAPPL-RATED-CARRIER = DAPPL-PAID-CARRIER
               MOVE SPACES                 TO WS-S-DLVR-CARRIER
           ELSE
               MOVE DAPPL-RATED-CARRIER    TO WS-S-DLVR-CARRIER.

           PERFORM 7-4-RELEASE-REC-TO-SORT.

       7-63-PROC-A-RATED-REC.
           MOVE DAPPL-RATED-CARRIER        TO WS-S-CARRIER.
           MOVE DAPPL-RATED-PRO-NO         TO WS-S-PRO-NO.
           MOVE DAPPL-TIS-SHIP-YYMMDD      TO WS-S-SHIP-DATE.
           MOVE DAPPL-RAIL-CAR             TO WS-S-VEHICLE.
           MOVE DAPPL-PO-10                TO WS-S-PO-NUMBER.
           MOVE DAPPL-PO-RCVR              TO WS-S-RCVR-NUMBER.
           MOVE DAPPL-RATED-AMT            TO WS-S-RATED-AMT.
           MOVE ZEROES                     TO WS-S-TAX.
           MOVE ZEROES                     TO WS-S-PAID-AMT.
           MOVE SPACES                     TO WS-S-PAID-DATE.

      *----- IF THE RATED AMOUNT WAS APPLIED BETWEEN THE FIRST DATE/TIME
      *----- AND THE LAST DATE/TIME,
      *-----    - SET THE APPLIED AMOUNT EQUAL TO THE RATED AMOUNT
      *----- OTHERWISE, THE APPLIED AMOUNT (THIS ACCTG MONTH) IS ZERO.

           IF   (DAPPL-RATED-APPL-DATE-TIME >= SAVE-FIRST-DATE-TIME)
            AND (DAPPL-RATED-APPL-DATE-TIME <= SAVE-LAST-DATE-TIME)
               MOVE DAPPL-RATED-AMT        TO WS-S-APPLIED-AMT
           ELSE
               MOVE ZEROES                 TO WS-S-APPLIED-AMT.

           MOVE DAPPL-RATED-APPL-YYMMDD    TO WS-S-APPLIED-DATE.
           MOVE SPACES                     TO WS-S-DLVR-CARRIER.

           PERFORM 7-4-RELEASE-REC-TO-SORT.

       7-64-PROC-A-PAID-REC.
      *----- FIRST OF ALL, WE MUST DECIDE IF THIS RECORD EVEN NEEDS TO
      *----- BE INCLUDED ON THE REPORT.  IF THE PAID AMOUNT WAS APPLIED
      *----- DURING THIS ACCTG MONTH (FIRST DATE/TIME THROUGH THE LAST
      *----- DATE/TIME),
      *-----    - INCLUDE THE RECORD ON THE REPORT (CREATE A SORT REC)
      *----- OTHERWISE WE DON'T NEED THIS RECORD.

           IF   (DAPPL-PAID-APPL-DATE-TIME >= SAVE-FIRST-DATE-TIME)
            AND (DAPPL-PAID-APPL-DATE-TIME <= SAVE-LAST-DATE-TIME)
               PERFORM 7-641-REL-PAID-SORT-REC.

       7-641-REL-PAID-SORT-REC.
           MOVE DAPPL-PAID-CARRIER         TO WS-S-CARRIER.
           MOVE DAPPL-PAID-PRO-NO          TO WS-S-PRO-NO.
           MOVE DAPPL-TIS-SHIP-YYMMDD      TO WS-S-SHIP-DATE.
           MOVE DAPPL-RAIL-CAR             TO WS-S-VEHICLE.
           MOVE DAPPL-PO-10                TO WS-S-PO-NUMBER.
           MOVE DAPPL-PO-RCVR              TO WS-S-RCVR-NUMBER.
           MOVE ZEROES                     TO WS-S-RATED-AMT.
           MOVE DAPPL-PAID-TAX             TO WS-S-TAX.
           MOVE DAPPL-PAID-AMT             TO WS-S-PAID-AMT.
           MOVE DAPPL-TIS-PAID-YYMMDD      TO WS-S-PAID-DATE.

           COMPUTE WS-S-APPLIED-AMT = DAPPL-PAID-AMT + DAPPL-PAID-TAX.

           MOVE DAPPL-PAID-APPL-YYMMDD     TO WS-S-APPLIED-DATE.
           MOVE SPACES                     TO WS-S-DLVR-CARRIER.

           PERFORM 7-4-RELEASE-REC-TO-SORT.

       7-65-PROC-A-BLANK-REC.
      *----- THIS PARAGRAPH SHOULD NEVER BE EXECUTED.  IT WILL ONLY BE
      *----- EXECUTED WHEN A NON-CANCELLED, NON-MANUAL FREIGHT BILL IS
      *----- FOUND THAT HAS NO APPLIED DATE/TIME DATA.
      *-----
      *-----   - RATED APPLIED DATE AND TIME = SPACES
      *-----                 AND
      *-----   - PAID APPLIED DATE AND TIME = SPACES
      *-----
      *----- ALL THAT WE CAN REALLY DO IS DISPLAY A SERIES OF MESSAGES
      *----- TO THE JOBLOG.

           DISPLAY "###################################################".
           DISPLAY "# DAPPLFRT REC FOUND WITH NO RATED OR PAID".
           DISPLAY "# APPLIED DATE/TIME INFORMATION.".
           DISPLAY "#  DAPPL-PO-14          = ", DAPPL-PO-14.
           DISPLAY "#  DAPPL-TIS-PAID-DATE  = " DAPPL-TIS-PAID-DATE.
           DISPLAY "#  DAPPL-TIS-SHIP-DATE  = " DAPPL-TIS-SHIP-DATE.
           DISPLAY "#  DAPPL-RAIL-CAR       = " DAPPL-RAIL-CAR.
           DISPLAY "#  DAPPL-TERMS          = " DAPPL-TERMS.
           DISPLAY "#  DAPPL-RATED-RCV-DATE = " DAPPL-RATED-RCV-DATE.
           DISPLAY "#  DAPPL-RATED-CARRIER  = " DAPPL-RATED-CARRIER.
           DISPLAY "#  DAPPL-RATED-PRO-NO   = " DAPPL-RATED-PRO-NO.
           MOVE DAPPL-RATED-AMT   TO DISPLAY-AMOUNT.
           DISPLAY "#  DAPPL-RATED-AMT      = " DISPLAY-AMOUNT.
           DISPLAY "#  DAPPL-RATED-APPL-DATE= " DAPPL-RATED-APPL-DATE.
           DISPLAY "#  DAPPL-RATED-APPL-TIME= " DAPPL-RATED-APPL-TIME.
           DISPLAY "#  DAPPL-PAID-RCV-DATE  = " DAPPL-PAID-RCV-DATE.
           DISPLAY "#  DAPPL-PAID-CARRIER   = " DAPPL-PAID-CARRIER.
           DISPLAY "#  DAPPL-PAID-PRO-NO    = " DAPPL-PAID-PRO-NO.
           MOVE DAPPL-PAID-AMT    TO DISPLAY-AMOUNT.
           DISPLAY "#  DAPPL-PAID-AMT       = " DISPLAY-AMOUNT.
           MOVE DAPPL-PAID-TAX    TO DISPLAY-AMOUNT.
           DISPLAY "#  DAPPL-PAID-TAX       = " DISPLAY-AMOUNT.
           DISPLAY "#  DAPPL-PAID-APPL-DATE = " DAPPL-PAID-APPL-DATE.
           DISPLAY "#  DAPPL-PAID-APPL-TIME = " DAPPL-PAID-APPL-TIME.
           DISPLAY "#  DAPPL-MULTI-PO-FLAG  = " DAPPL-MULTI-PO-FLAG.
           DISPLAY "#  DAPPL-STATUS         = " DAPPL-STATUS.
           DISPLAY "##################################################".

       7-PROCESS-DAPPLFRT-X.
           EXIT.

      ******************************************************************
      *  O U T P U T   P R O C E D U R E                               *
      ******************************************************************

       8-PRINT-REPORT SECTION.
       8-PRINT-REPORT-PARA.
           PERFORM 8-1-BEGIN.
           PERFORM 8-6-PROCESS-CARRIERS
              UNTIL EOF-SORT-FILE = "Y"
           PERFORM 8-2-END.
           GO TO 8-PRINT-REPORT-X.

       8-1-BEGIN.
           PERFORM 8-11-PRINT-HEADINGS.
      *----- RETURN THE FIRST RECORD FROM THE SORT
           PERFORM 8-3-RETURN-SORT-REC THRU 8-3-RETURN-SORT-REC-X.

           IF EOF-SORT-FILE = "Y"
              MOVE "ZERO RECORDS RETURNED FROM SORT * 8-1-BEGIN"
                TO BU-DISPLAY-MSG
              PERFORM 2-BLOWUP.

       8-11-PRINT-HEADINGS.
           ADD +1 TO PAGE-COUNT.
           MOVE PAGE-COUNT TO HEADING2-PAGE-NO.
           WRITE PRINT-REC FROM HEADING1     AFTER ADVANCING NEW-PAGE.
           WRITE PRINT-REC FROM HEADING2     AFTER ADVANCING 1.
           WRITE PRINT-REC FROM HEADING3     AFTER ADVANCING 1.
           WRITE PRINT-REC FROM HEADING4     AFTER ADVANCING 1.
           WRITE PRINT-REC FROM SUB-HEADING1 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM SUB-HEADING2 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM SUB-HEADING3 AFTER ADVANCING 1.
           WRITE PRINT-REC FROM SUB-HEADING4 AFTER ADVANCING 0.
           WRITE PRINT-REC FROM BLANK-LINE   AFTER ADVANCING 1.
           MOVE +8 TO LINE-COUNT.

       8-2-END.
           MOVE CNTL-RECS-FROM-SORT     TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF RECS RETURNED FROM SORT = " DISPLAY-COUNT.

           IF LINE-COUNT > 45
               PERFORM 8-11-PRINT-HEADINGS.

           MOVE "***** TOTAL FREIGHT ACCOUNT *****" TO TL-TEXT.
           MOVE FIN-TOT-RATED-AMT                   TO TL-RATED-AMT.
           MOVE FIN-TOT-TAX                         TO TL-TAX.
           MOVE FIN-TOT-PAID-AMT                    TO TL-PAID-AMT.
           MOVE FIN-TOT-APPLIED-AMT                 TO TL-APPLIED-AMT.
           WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 3.

           PERFORM 8-21-PROCESS-DTRANS.
           MOVE "***** TOTAL 'FRT' FROM CSAS TRANSACTIONS REPORT *****"
                                                    TO TL-TEXT.
           MOVE SPACES                              TO TL-RATED-AMT-X
                                                       TL-TAX-X
                                                       TL-PAID-AMT-X.
           MOVE DTRANS-TOT-APPLIED-AMT              TO TL-APPLIED-AMT.
           WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 2.

           MOVE SPACES                              TO TL-APPLIED-AMT-X.

           IF FIN-TOT-APPLIED-AMT = DTRANS-TOT-APPLIED-AMT
             MOVE "********************************************"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 2
             MOVE "* THE TOTAL APPLIED AMOUNT SHOWN ON THIS   *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* REPORT IS IN BALANCE WITH THE TOTAL OF   *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* ALL 'FRT' CHARGES SHOWN ON THE CSAS      *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* TRANSACTIONS REPORT (SR24).              *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "********************************************"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
           ELSE
             MOVE "********************************************"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 2
             MOVE "*  W A R N I N G : THE TOTAL APPLIED       *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* AMOUNT SHOWN ON THIS REPORT IS  N O T    *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* IN BALANCE WITH THE TOTAL OF ALL 'FRT'   *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* CHARGES SHOWN ON THE CSAS TRANSACTIONS   *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* REPORT (SR24).                           *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "*                                          *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* PLEASE RUN THE SR24 REPORT FOR ALL 'FRT' *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* CHARGES, AND IDENTIFY ANY DISCREPANCIES  *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* BETWEEN THE TWO REPORTS.  THEN CONTACT   *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "* THE CSIS/MMIS STAFF FOR ASSISTANCE.      *"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1
             MOVE "********************************************"
                                                              TO TL-TEXT
             WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 1.

       8-21-PROCESS-DTRANS.
           MOVE 0 TO DTRANS-TOT-APPLIED-AMT.

      *----- GET POSITIONED AT THE START OF THE DTRANS FILE
           MOVE SPACES TO MATLCODE OF DTRANS-REC.
           START DTRANS KEY >= MATLCODE OF DTRANS-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

      *----- READ THE FIRST DTRANS RECORD INTO WORKING-STORAGE
           PERFORM 8-211-READ-DTRANS.
           IF EOF-DTRANS-FILE = "Y"
               DISPLAY
                "*** FIRST READ OF DTRANS FILE RESULTED IN EOF ***".

           PERFORM 8-212-HANDLE-A-REC
              UNTIL EOF-DTRANS-FILE = "Y".

           MOVE CNTL-DTRANS-RECS-READ TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF DTRANS RECS READ        = " DISPLAY-COUNT.

       8-211-READ-DTRANS.
           MOVE "00" TO FILE-STATUS.
           READ DTRANS NEXT INTO BUF-DTRANS
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               ADD +1 TO CNTL-DTRANS-RECS-READ
           ELSE
               IF FILE-STATUS = "10"
                   MOVE "Y" TO EOF-DTRANS-FILE
               ELSE
                   MOVE "UNEXPECTED STATUS * 8-211-READ"
                     TO BU-DISPLAY-MSG
                   PERFORM 2-BLOWUP.

       8-212-HANDLE-A-REC.
           IF TRANS-CODE = "FRT "
               ADD TRANS-VALUE TO DTRANS-TOT-APPLIED-AMT.
           PERFORM 8-211-READ-DTRANS.

       8-3-RETURN-SORT-REC.
           RETURN SORT-FILE INTO WS-S-REC
             AT END
               MOVE "Y" TO EOF-SORT-FILE
               GO TO 8-3-RETURN-SORT-REC-X.
           ADD +1 TO CNTL-RECS-FROM-SORT.

       8-3-RETURN-SORT-REC-X.
           EXIT.

       8-3-READ-CARRIER-FILE.
           MOVE "00" TO FILE-STATUS.
           MOVE WS-S-CARRIER TO KCARCDE OF CARRIER-REC
                                DL2-CARRIER.
           READ CARRIER-FILE INTO WS-CARRIER-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF WS-C-CARRIER-NAME = SPACES
                   DISPLAY "NO NAME ON FILE FOR CARRIER =",
                     WS-C-CARRIER
               END-IF
           ELSE
               IF FILE-STATUS = "23"
                   DISPLAY "NO REC ON FILE FOR CARRIER  =",
                      WS-S-CARRIER
               ELSE
                   MOVE "READ CARRIER ERROR * 8-3-RCF"
                     TO BU-DISPLAY-MSG
                   MOVE WS-S-CARRIER TO BU-DISPLAY-FLD (1)
                   PERFORM 2-BLOWUP.

       8-6-PROCESS-CARRIERS.
           PERFORM 8-61-BEGIN-CARRIER.
           PERFORM 8-62-PROCESS-RECS
             UNTIL WS-S-CARRIER NOT = SAVE-CARRIER
                OR EOF-SORT-FILE = "Y".
           PERFORM 8-63-END-CARRIER.

       8-61-BEGIN-CARRIER.
           MOVE WS-S-CARRIER TO SAVE-CARRIER
                                DL2-CARRIER.

           PERFORM 8-3-READ-CARRIER-FILE.

           IF FILE-STATUS = "00"
               MOVE WS-C-CARRIER-NAME TO DL2-CARRIER-NAME
           ELSE
               MOVE SPACES TO            DL2-CARRIER-NAME.

           IF LINE-COUNT > 56
               PERFORM 8-11-PRINT-HEADINGS.

           WRITE PRINT-REC FROM DETAIL-LINE2 AFTER ADVANCING 2.
           WRITE PRINT-REC FROM BLANK-LINE   AFTER ADVANCING 1.
           ADD +3 TO LINE-COUNT.

           MOVE 0 TO WS-TOT-APPLIED-AMT
                     WS-TOT-TAX
                     WS-TOT-RATED-AMT
                     WS-TOT-PAID-AMT.

       8-62-PROCESS-RECS.
           MOVE WS-S-CARRIER         TO DL-CARRIER.
           MOVE WS-S-PRO-NO          TO DL-PRO-NO.
           MOVE WS-S-SHIP-DATE       TO DL-SHIP-DATE.
           MOVE WS-S-VEHICLE         TO DL-VEHICLE.
           MOVE WS-S-PO-NUMBER       TO DL-PO-NUMBER.
           MOVE WS-S-RCVR-NUMBER     TO DL-RCVR-NUMBER.
           MOVE WS-S-RATED-AMT       TO DL-RATED-AMT.
           MOVE WS-S-TAX             TO DL-TAX.
           MOVE WS-S-PAID-AMT        TO DL-PAID-AMT.
           MOVE WS-S-PAID-DATE       TO DL-PAID-DATE.
           MOVE WS-S-APPLIED-AMT     TO DL-APPLIED-AMT.
           MOVE WS-S-APPLIED-DATE    TO DL-APPLIED-DATE.
           MOVE WS-S-DLVR-CARRIER    TO DL-DLVR-CARRIER.

           IF LINE-COUNT > 61
               PERFORM 8-11-PRINT-HEADINGS.

           WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
           ADD +1 TO LINE-COUNT.

           ADD WS-S-RATED-AMT        TO WS-TOT-RATED-AMT,
           ADD WS-S-TAX              TO WS-TOT-TAX.
           ADD WS-S-PAID-AMT         TO WS-TOT-PAID-AMT.
           ADD WS-S-APPLIED-AMT      TO WS-TOT-APPLIED-AMT.

           PERFORM 8-3-RETURN-SORT-REC THRU 8-3-RETURN-SORT-REC-X.

       8-63-END-CARRIER.
           MOVE "TOTAL FOR CARRIER"  TO TL-TEXT.
           MOVE WS-TOT-RATED-AMT     TO TL-RATED-AMT.
           MOVE WS-TOT-TAX           TO TL-TAX.
           MOVE WS-TOT-PAID-AMT      TO TL-PAID-AMT.
           MOVE WS-TOT-APPLIED-AMT   TO TL-APPLIED-AMT.
           WRITE PRINT-REC FROM TOTALS-LINE AFTER ADVANCING 2.
           WRITE PRINT-REC FROM BLANK-LINE  AFTER ADVANCING 2.
           ADD +4 TO LINE-COUNT.

           IF LINE-COUNT > 59
               PERFORM 8-11-PRINT-HEADINGS.

           ADD WS-TOT-RATED-AMT      TO FIN-TOT-RATED-AMT.
           ADD WS-TOT-TAX            TO FIN-TOT-TAX.
           ADD WS-TOT-PAID-AMT       TO FIN-TOT-PAID-AMT.
           ADD WS-TOT-APPLIED-AMT    TO FIN-TOT-APPLIED-AMT.

       8-PRINT-REPORT-X.
           EXIT.
