       IDENTIFICATION DIVISION.
       PROGRAM-ID. TGENHELP.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZGENHELP-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       WORKING-STORAGE SECTION.

       01  BU-DISPLAY-AREA               PIC X(110).
       01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
           05  BU-DSIPLAY-LINE OCCURS 5 TIMES.
               10  BU-DISPLAY-FLD        PIC X(14).
               10  BU-DISPLAY-FLD9       PIC S9(8).

       01  BU-DISPLAY-MSG.
           05  BU-DISPLAY-MSG-1          PIC X.
           05  BU-DISPLAY-MSG-2          PIC X(57).
           05  BU-DISPLAY-PARA           PIC X(2).

       COPY CGENHELP   OF COPYLIB.
       COPY CPYIND     OF COPYLIB.
       COPY IOFEEDBACK OF COPYLIB.
       COPY WSCONTROL  OF COPYLIB.

       01  DSPLY-STATUS.
           05  DSPLY-STATUS-1            PIC X     VALUE "0".
           05  DSPLY-STATUS-2            PIC X     VALUE "0".

       01  FHELPSC1.
           COPY DD-FHELPSC1 OF ZGENHELP.

       COPY VCOMLINK   OF COPYLIB.

       01  WS-SCREEN.
           05  WS-TYPE                   PIC X(6).
           05  WS-BU-DISPLAY-MSG         PIC X(60).
           05  WS-CODE                   PIC X(12).

       PROCEDURE DIVISION.

       START-PROGRAM.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           PERFORM 6-MAIN         THRU 6-EXIT
           PERFORM 2-END-OF-JOB   THRU 2-EXIT.
           GOBACK.

       1-HOUSEKEEPING.
           OPEN I-O DISPLAY-FILE.

           MOVE SPACES       TO BU-DISPLAY-MSG.

       1-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE DISPLAY-FILE.
           GOBACK.

       2-EXIT.
           EXIT.

       6-MAIN.
           MOVE "FHELPSC1" TO VIEW-CFNAME.
           MOVE SPACES TO WS-SCREEN, CGENHELP-CODE.

       6-PUT-BUFFER.
           MOVE WS-SCREEN TO FHELPSC1.
           MOVE FHELPSC1 TO DSPLY-REC.

       6-SHOW.
           PERFORM 99-SCREEN-WRITE THRU 99-EXIT.

       6-READ.
           PERFORM 98-SCREEN-READ  THRU 98-EXIT.

       6-PROCESS.
           IF VIEW-LASTKEY = 3
             GO TO 6-EXIT.

           MOVE DSPLY-REC TO WS-SCREEN.

           IF WS-TYPE       = SPACES
             GO TO 6-PUT-BUFFER.

           MOVE WS-TYPE TO CGENHELP-TYPE.

           CALL "CGENHELP" USING BU-DISPLAY-AREA, BU-DISPLAY-MSG,
               CGENHELP-PARMS,  VIEW-COMAREA.

           MOVE BU-DISPLAY-MSG TO WS-BU-DISPLAY-MSG.
           MOVE CGENHELP-KEY   TO WS-CODE.
           GO TO 6-PUT-BUFFER.

       6-EXIT.
           EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDICATORS ARE  INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF DSPLY-STATUS NOT = "00"
             DISPLAY "DSPLY-STATUS = " DSPLY-STATUS
             MOVE 3 TO VIEW-LASTKEY
           ELSE
             MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98-EXIT.
           EXIT.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDICATORS ARE INDICS
                   NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.

       98A-EXIT.
           EXIT.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDICATORS ARE INDICS.

       99-EXIT.
           EXIT.
