       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TGENPREV.
       AUTHOR.        R L ENSMINGER.
       INSTALLATION.  GTR.
       DATE-COMPILED.
      *C
      *C 09/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON DATE SCHEDULED, REQUIRED,
      *C   AND RECEIVED AND PASS AS PARAMETERS.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT FILE1
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE2
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE3
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE5
               ASSIGN TO DATABASE-MCFLCS1701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE7
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE8
               ASSIGN TO DATABASE-MCFLMM3501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT FILE9
               ASSIGN TO DATABASE-MCFLMM3701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  FILE2
           LABEL RECORDS ARE STANDARD.
       01  REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  FILE3
           LABEL RECORDS ARE STANDARD.
       01  REC3.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
       FD  FILE5
           LABEL RECORDS ARE STANDARD.
       01  REC5.
           COPY DDS-ALL-FORMATS OF MCFLCS1701.
       FD  FILE7
           LABEL RECORDS ARE STANDARD.
       01  REC7.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  FILE8
           LABEL RECORDS ARE STANDARD.
       01  REC8.
           COPY DDS-ALL-FORMATS OF MCFLMM3501.
       FD  FILE9
           LABEL RECORDS ARE STANDARD.
       01  REC9.
           COPY DDS-ALL-FORMATS OF MCFLMM3701.
       WORKING-STORAGE SECTION.
       01  BUD-NUM                            PIC X(16).
       COPY CATREAD OF COPYLIB.
       01  CDATE.
           05 YY                              PIC 99.
           05 MM                              PIC 99.
           05 DD                              PIC 99.
       01  COND-CODE                          PIC X.
       COPY CPYIND  OF COPYLIB.
       01  CTIME.
           05 HH                              PIC 99.
           05 MN                              PIC 99.
           05 FILLER                          PIC X(4).
       01  CURLIB                             PIC X(10).
       COPY TDATESUB  OF COPYLIB.
       01  DATE-SCHD-SAVE                     PIC X(6).
       01  DATE-REQD-SAVE                     PIC X(6).
       01  DBPARAMETERS.
           COPY DBPARMS OF COPYLIB.
       01  DSPLY-STATUS                       PIC XX.
       01  ERROR-SW                           PIC X.
       01  ERROR-SWITCH                       PIC S9(4) COMP-4.
       01  EXPCLASS1.
           05 EX1                             PIC X.
           05 EX2                             PIC X.
           05 FILLER                          PIC X(8).
       01  EXPCLASS2                          PIC X(8).
       01  EQP-RIME.
           05 FILLER                          PIC X.
           05 RIME-NO                         PIC 9.
       01  FIELDNUM                           PIC 99.
       01  FILE-STATUS                        PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
       01  JOBLIBX                            PIC X.
       01  PLANT-DATA.
           COPY MLASTWO  OF COPYLIB.
       COPY LANGSUB    OF COPYLIB.
       01  NAME-FIELD                         PIC 99.
       01  PFKEY                              PIC 9(9).
       01  RIME-CALC                          PIC 99.
       01  REQD-TIME.
           05 HR-REQD                         PIC XX.
           05 MN-REQD                         PIC XX.
       01  SCHD-TIME.
           05 HR-SCHD                         PIC XX.
           05 MN-SCHD                         PIC XX.
       01  SCREEN-BUFFER.
           05  SCREEN-DATA.
               10  SCREEN-REQUESTER           PIC X(16).
               10  SCREEN-PRTY                PIC X.
               10  SCREEN-EQPNUM              PIC X(6).
               10  SCREEN-EXPCLASS            PIC X(8).
               10  SCREEN-SCHDDATE            PIC X(6).
               10  SCREEN-SCHDTIME            PIC X(4).
               10  SCREEN-REQDDATE            PIC X(6).
               10  SCREEN-REQDTIME            PIC X(4).
               10  SCREEN-BUD-1-3             PIC XXX.
               10  SCREEN-BUD-4-5             PIC XX.
               10  SCREEN-BUD-6-7             PIC XX.
               10  SCREEN-BUD-8-10            PIC XXX.
               10  SCREEN-BUD-REVNO           PIC XX.
               10  SCREEN-REQUEST             PIC X(12).
               10  SCREEN-PLNR                PIC X(4).
               10  SCREEN-ENGR                PIC X(4).
               10  SCREEN-SCHR                PIC X(4).
               10  SCREEN-DESC1               PIC X(30).
               10  SCREEN-DESC2               PIC X(66).
               10  SCREEN-DESC3               PIC X(66).
               10  SCREEN-JOBSW               PIC X.
               10  SCREEN-PRTSW               PIC X.
           05  SCREEN-CMD-LINE                PIC X(79).
           05  SCREEN-ERR-LINE                PIC X(79).
       01  SCREEN-BUFFER-4.
           05  SCREEN-DATA-4.
               10  SCREEN-PMASTER-4           PIC X(10).
               10  SCREEN-INTVL-4             PIC XX.
               10  SCREEN-MASTER-NAMES-4.
                   15  SCREEN-MASTER-NAME-4 OCCURS 15  PIC X(10).
           05  SCREEN-CMD-LINE-4              PIC X(79).
           05  SCREEN-ERR-LINE-4              PIC X(79).
       01  SCREEN4-SAVE.
           05 FILLER                          PIC X(12).
           05 MASTER-NAMES-4.
              10 MASTER-NAME-4   OCCURS 15 TIMES  PIC X(10).
           05 FILLER                          PIC X(158).
       01  SCREEN-BUFFER-6.
       05  SCREEN-DATA-6.
               10  SCREEN-PMASTER-6           PIC X(10).
               10  SCREEN-MASTER-NAMES-6.
                   15  SCREEN-MASTER-NAME-6 OCCURS 15  PIC X(10).
           05  SCREEN-CMD-LINE-6              PIC X(79).
           05  SCREEN-ERR-LINE-6              PIC X(79).
       01  SCREEN6-SAVE.
           05 FILLER                          PIC X(10).
           05 MASTER-NAMES-6.
              10 MASTER-NAME-6    OCCURS 15 TIMES  PIC X(10).
           05 FILLER                          PIC X(158).
       01  SAVE-CC                            PIC X(4).
       COPY DBSTAT    OF COPYLIB.
       01  S3                                 PIC 99.
       01  SEQ-INT                            PIC X(2).
       01  TIME-SW                            PIC X.
       01  TRUE-VAL                           PIC 1 VALUE B"1".
       01  TERMID                             PIC X(10).
       01  USERNAME                           PIC X(10).
       COPY VCOMLINK     OF COPYLIB.
       01  WO-TRACK-DATA.
           COPY DWOTRACK OF COPYLIB.
       01  WO-PLANNED-DATA.
           COPY DWOPLAN  OF COPYLIB.
       COPY WSCONTROL OF COPYLIB.
       PROCEDURE DIVISION.
       OPEN-PAR.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT FILE1 FILE2 FILE3 FILE5 FILE7 FILE8 FILE9.
           MOVE 1 TO PFKEY.
           READ FILE7 INTO PLANT-DATA.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           CALL "CLWHO" USING USERNAME TERMID CURLIB JOBLIBX.
           MOVE SPACES TO SCREEN-BUFFER SCREEN-BUFFER-4
               SCREEN-BUFFER-6.
           MOVE "Y" TO SCREEN-JOBSW SCREEN-PRTSW.
           MOVE SPACES TO WO-TRACK-DATA.
           MOVE "TGENPREV" TO PROGRAM-NAME.
           MOVE "OO" TO WO-STATUS-TRACK.
           MOVE "AA" TO WO-TYPE-STATUS.
           MOVE USERNAME TO USER-NAME.
           MOVE TERMID TO USER-TERM.
           MOVE 0 TO VIEW-LASTKEY.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.

       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE FILE1 FILE2 FILE3 FILE5 FILE7 FILE8 FILE9.
           GOBACK.

       6-MAIN.
           MOVE "FGENPRE1" TO VIEW-CFNAME.
           MOVE 66353 TO CATREAD-MSG-NUMBER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
           IF SCREEN-REQUESTER = SPACES
             MOVE 66115 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (01) INDS (99)
             GO TO 6-MAIN.

           IF SCREEN-PRTY = "1" OR "2" OR "3" OR "4" OR "5"
             NEXT SENTENCE
           ELSE
             MOVE 35080 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (02) INDS (99)
             GO TO 6-MAIN.

           IF SCREEN-EQPNUM = SPACES
             MOVE 00030 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (03) INDS (99)
             GO TO 6-MAIN.

           MOVE SPACES TO REC1.
           MOVE SCREEN-EQPNUM TO EQPNUM OF REC1.
           READ FILE1.
           IF FILE-STATUS NOT = "00"
             MOVE 00030 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (03) INDS (99)
             GO TO 6-MAIN
           ELSE
             MOVE SPACES TO ZONEPRTY OF REC3
             STRING EQPZONE SCREEN-PRTY
              DELIMITED BY SIZE INTO ZONEPRTY OF REC3
             READ FILE3
             IF FILE-STATUS NOT = "00"
               MOVE 00016 TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (02) INDS (99)
               GO TO 6-MAIN.

           IF SCREEN-EXPCLASS = SPACES
             MOVE EQPEXCLASS OF REC1 TO SCREEN-EXPCLASS.
           MOVE SCREEN-EXPCLASS TO EXPCLASS1 EXPCLASS2.
           MOVE "E" TO EX1.
           MOVE "C" TO EX2.
           MOVE EXPCLASS1 TO VALDTAKEY.
           READ FILE5.
           IF FILE-STATUS NOT = "00"
             MOVE "N" TO EX1
             MOVE "W" TO EX2
             MOVE EXPCLASS1 TO VALDTAKEY
             READ FILE5
             IF FILE-STATUS NOT = "00"
               MOVE 00032 TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (04) INDS (99)
               GO TO 6-MAIN.

           MOVE "N" TO TIME-SW.

           IF SCREEN-SCHDDATE = SPACES
             MOVE "Y" TO TIME-SW
             MOVE SPACES TO SCREEN-SCHDTIME DATE-SCHD-SAVE
           ELSE
             MOVE DATE-FLAG TO DATE-CODE
             MOVE 3         TO DATE-MODE
             MOVE SCREEN-SCHDDATE TO DATE-VALIDATE-IN
             CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS
             IF DATE-RET-CODE = 1
               MOVE DATE-MSG TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (05) INDS (99)
               GO TO 6-MAIN
             ELSE
               MOVE DATE-DB TO DATE-SCHD-SAVE
               MOVE SCREEN-SCHDTIME TO SCHD-TIME
               IF (HR-SCHD > "00" OR HR-SCHD = "00") AND HR-SCHD < "24"
               IF (MN-SCHD > "00" OR MN-SCHD = "00") AND MN-SCHD < "60"
                 MOVE "Y" TO TIME-SW.

           IF TIME-SW = "N"
             MOVE 35029 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (06) INDS (99)
             GO TO 6-MAIN.

           MOVE "N" TO TIME-SW.

           IF SCREEN-REQDDATE = SPACES
             MOVE "Y" TO TIME-SW
             MOVE SPACES TO SCREEN-REQDTIME DATE-REQD-SAVE
           ELSE
             MOVE DATE-FLAG TO DATE-CODE
             MOVE 3         TO DATE-MODE
             MOVE SCREEN-REQDDATE TO DATE-VALIDATE-IN
             CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS
             IF DATE-RET-CODE = 1
               MOVE DATE-MSG TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (07) INDS (99)
               GO TO 6-MAIN
             ELSE
               MOVE DATE-DB TO DATE-REQD-SAVE
               MOVE SCREEN-REQDTIME TO REQD-TIME
               IF (HR-REQD > "00" OR HR-REQD = "00") AND HR-REQD < "24"
               IF (MN-REQD > "00" OR MN-REQD = "00") AND MN-REQD < "60"
                 MOVE "Y" TO TIME-SW.

           IF TIME-SW = "N"
             MOVE 35029 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (08) INDS (99)
             GO TO 6-MAIN.

           STRING SCREEN-BUD-1-3
                  "-"
                  SCREEN-BUD-4-5
                  "-"
                  SCREEN-BUD-6-7
                  "-"
                  SCREEN-BUD-8-10
                  "R"
                  SCREEN-BUD-REVNO
            DELIMITED BY SIZE INTO BUD-NUM.

           IF SCREEN-PLNR = SPACES AND
              SCREEN-ENGR = SPACES
             MOVE 31013 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (15) INDS (99)
             GO TO 6-MAIN.

           IF SCREEN-PLNR NOT = SPACES
             IF SCREEN-ENGR NOT = SPACES
               MOVE 31013 TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (15) INDS (99)
               GO TO 6-MAIN.

           IF SCREEN-PLNR NOT = SPACES
             MOVE SCREEN-PLNR TO SAVE-CC
             MOVE 15 TO FIELDNUM
           ELSE
             MOVE SCREEN-ENGR TO SAVE-CC
             MOVE 16 TO FIELDNUM.

           MOVE SAVE-CC TO PERCCNUM.
           READ FILE2.
           IF FILE-STATUS NOT = "00"
             MOVE 35047 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (FIELDNUM) INDS (99)
             GO TO 6-MAIN.

           IF SCREEN-DESC1 = SPACES
             MOVE 66115 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE
             MOVE TRUE-VAL TO INDS (18) INDS (99)
             GO TO 6-MAIN.

           PERFORM 61-ADD-MASTER.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       61-ADD-MASTER.
           MOVE SPACES TO WO-PLANNED-DATA.
           CALL "TNEWWONU" USING DBPARAMETERS
                                 STATUS-AREA
                                 WO-NUM-PLANNED
                                 ERROR-SWITCH.
           MOVE "000" TO WO-NUM-SUFF-P.
           MOVE "OO" TO WO-STATUS-P.
           ACCEPT CDATE FROM DATE.
           ACCEPT CTIME FROM TIME.
           MOVE CDATE TO DATE-RECD-P.
           IF DATE-RECD-P-YY > 70
               MOVE 19 TO DATE-RECD-P-CC
           ELSE
               MOVE 20 TO DATE-RECD-P-CC.
           MOVE CTIME TO TIME-RECD-P.
           MOVE "U" TO APPROVAL-CODE-P.
           MOVE SCREEN-REQUESTER TO REQUESTER-P.
           MOVE EQPNUM OF REC1 TO EQUIP-NUM-P.
           MOVE EQPNAME OF REC1 TO EQUIP-NAME-P.
           MOVE EQPTYPE OF REC1 TO TYPE-NUM-P.
           MOVE EQPDEPT OF REC1 TO DEPT-P.
           MOVE EQPZONE OF REC1 TO ZONE-P.
           MOVE SCREEN-PRTY TO PRIORITY-P.
           MOVE EQPLOC OF REC1 TO LOCATION-P.
           MOVE "N" TO EQUIP-DOWN-P.
           MOVE SCREEN-EXPCLASS TO EXP-CLASS-P.
           MOVE EQPRIME TO EQP-RIME.
           IF RIME-NO NUMERIC
             MOVE RIME-NO TO RIME-CALC
           ELSE
             MOVE 1 TO RIME-CALC.
           IF SCREEN-PRTY = "1"
             COMPUTE RIME-CALC = RIME-CALC * 9.
           IF SCREEN-PRTY = "2"
             COMPUTE RIME-CALC = RIME-CALC * 6.
           IF SCREEN-PRTY = "3"
             COMPUTE RIME-CALC = RIME-CALC * 4.
           IF SCREEN-PRTY = "4"
             COMPUTE RIME-CALC = RIME-CALC * 2.
           IF SCREEN-PRTY = "5"
             COMPUTE RIME-CALC = RIME-CALC * 1.
           MOVE RIME-CALC TO RIME-P.
           MOVE DATE-REQD-SAVE TO DATE-REQD.
           IF DATE-REQD = SPACES
               NEXT SENTENCE
           ELSE
           IF DATE-REQD-P-YY > 70
              MOVE 19 TO DATE-REQD-P-CC
           ELSE
              MOVE 20 TO DATE-REQD-P-CC.
           MOVE SCREEN-REQDTIME TO TIME-REQD.
           MOVE SCREEN-DESC1 TO DESCRIPTION-1-P.
           MOVE SCREEN-DESC2 TO DESCRIPTION-2-1-P.
           MOVE SCREEN-DESC3 TO DESCRIPTION-2-2-P.
           MOVE SCREEN-PLNR TO PLANNER-P OF WO-PLANNED-DATA.
           MOVE SCREEN-ENGR TO ENGINEER-P OF WO-PLANNED-DATA.
           MOVE SCREEN-SCHR TO SCHEDULER-P OF WO-PLANNED-DATA.
           IF SCREEN-PLNR NOT = SPACES
             MOVE "R" TO PLNR-RESP-IND
           ELSE
           MOVE "R" TO ENGR-RESP-IND.
           MOVE DATE-SCHD-SAVE TO DATE-SCHD.
           IF DATE-SCHD = SPACES
               NEXT SENTENCE
           ELSE
           IF DATE-SCHD-P-YY > 70
               MOVE 19 TO DATE-SCHD-P-CC
           ELSE
               MOVE 20 TO DATE-SCHD-P-CC.
           MOVE SCREEN-SCHDTIME TO TIME-SCHD.
           MOVE BUD-NUM TO BUDGET-NO.
           MOVE SCREEN-REQUEST TO REQUEST-NO.
           MOVE "AA" TO WO-START-STATUS.
           CALL "TADDWOII" USING DBPARAMETERS
                                 STATUS-AREA
                                 WO-PLANNED-DATA
                                 COND-CODE
                                 ERROR-SWITCH.
           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           MOVE CDATE TO DATE-STAMP.
           IF DATE-STAMP-YY > "70"
               MOVE "19" TO DATE-STAMP-CC
           ELSE
           MOVE "20"     TO DATE-STAMP-CC.
           MOVE CTIME TO TIME-STAMP.
           CALL "TWOTRACK" USING WO-TRACK-DATA.
           MOVE 39009 TO CATREAD-MSG-NUMBER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE SPACES TO SCREEN-CMD-LINE.
           STRING WO-NUM-PLANNED " - " CATREAD-MSG-TEXT
            DELIMITED BY SIZE INTO SCREEN-CMD-LINE.
           MOVE SCREEN-CMD-LINE TO SCREEN-CMD-LINE-4
               SCREEN-CMD-LINE-6.
           MOVE TRUE-VAL TO INDS (98).
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
      *** COPY GENERIC JOBPLANS TO WORK ORDER ***
           IF SCREEN-JOBSW NOT = SPACE
             MOVE SPACES TO SCREEN-DATA-4
             MOVE WO-NUM-PLANNED TO SCREEN-PMASTER-4
             MOVE "01" TO SCREEN-INTVL-4
             PERFORM COPY-JOBPLANS THRU C-J-E.
      *** COPY GENERIC PRTPLANS TO WORK ORDER ***
           IF SCREEN-PRTSW NOT = SPACE
             MOVE SPACES TO SCREEN-DATA-6
             MOVE WO-NUM-PLANNED TO SCREEN-PMASTER-6
             PERFORM COPY-MATPLANS THRU C-M-E.
           MOVE SPACES TO SCREEN-BUFFER SCREEN-BUFFER-4
               SCREEN-BUFFER-6.
           MOVE "Y" TO SCREEN-JOBSW SCREEN-PRTSW.

       COPY-JOBPLANS.
           MOVE "FGENPRE2" TO VIEW-CFNAME.
           MOVE SCREEN-BUFFER-4 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER-4.
           IF VIEW-LASTKEY = 3 GO TO C-J-E.
           IF SCREEN-INTVL-4 NUMERIC
             IF SCREEN-INTVL-4 > "00"
               NEXT SENTENCE
             ELSE
               MOVE 66118 TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE-4
               MOVE TRUE-VAL TO INDS (02) INDS (99)
               GO TO COPY-JOBPLANS
           ELSE
             MOVE 66118 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE-4
             MOVE TRUE-VAL TO INDS (02) INDS (99)
             GO TO COPY-JOBPLANS.
           MOVE "N" TO ERROR-SW.
           MOVE 3 TO NAME-FIELD.
           MOVE SCREEN-BUFFER-4 TO SCREEN4-SAVE.
           MOVE SCREEN-INTVL-4 TO SEQ-INT.
           PERFORM CHECK-NAMES THRU NAME-EXIT VARYING S3 FROM 1 BY 1
            UNTIL S3 > 15 OR
                  MASTER-NAME-4 (S3) = SPACES OR
                  ERROR-SW = "Y".
           IF ERROR-SW = "Y" GO TO COPY-JOBPLANS.
           CALL "TSJOBCPM" USING DBPARAMETERS
                                 SEQ-INT
                                 MASTER-NAMES-4
                                 WO-NUM-PLANNED.

       C-J-E.    EXIT.

       CHECK-NAMES.
           MOVE MASTER-NAME-4 (S3) TO GJOBPNAME.

           READ FILE8.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO ERROR-SW
             MOVE 35135 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE-4
             MOVE TRUE-VAL TO INDS (NAME-FIELD) INDS (99).

           ADD 1 TO NAME-FIELD.

       NAME-EXIT.    EXIT.

       COPY-MATPLANS.
           MOVE "FGENPRE3" TO VIEW-CFNAME.
           MOVE SCREEN-BUFFER-6 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER-6.
           IF VIEW-LASTKEY = 3 GO TO C-M-E.
           MOVE "N" TO ERROR-SW.
           MOVE 3 TO NAME-FIELD.
           MOVE SCREEN-BUFFER-6 TO SCREEN6-SAVE.
           PERFORM CHECK-NAMES2 THRU NAME-EXIT2 VARYING S3 FROM 1 BY 1
            UNTIL S3 > 15 OR
                  MASTER-NAME-6 (S3) = SPACES OR
                  ERROR-SW = "Y".
           IF ERROR-SW = "Y" GO TO COPY-MATPLANS.
           CALL "TSPRTCPM" USING DBPARAMETERS
                                 MASTER-NAMES-6
                                 WO-NUM-PLANNED.

       C-M-E.    EXIT.

       CHECK-NAMES2.
           MOVE MASTER-NAME-6 (S3) TO GPRTPNAME.

           READ FILE9.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO ERROR-SW
             MOVE 35135 TO CATREAD-MSG-NUMBER
             CALL "CCATREAD" USING CATREAD-PARMS
             MOVE CATREAD-MSG-TEXT TO SCREEN-ERR-LINE-6
             MOVE TRUE-VAL TO INDS (NAME-FIELD) INDS (99).

           ADD 1 TO NAME-FIELD.

       NAME-EXIT2.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.
