       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TGETCCWO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZGETCCWO-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT WO-LABOR-FILE
                  ASSIGN       TO DATABASE-MCFLMM1302
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  WO-LABOR-FILE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1302.

       WORKING-STORAGE SECTION.
       77  SUB                 PIC S9(04) COMP-4.
       77  SUBC                PIC S9(04) COMP-4.
       77  TRUE-VAL            PIC 1      VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TGETCCWO".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER  PIC X(17) VALUE " FINDS ALL W/O'S ".
                   15  FILLER  PIC X(16) VALUE "THAT A SPECIFIC ".
                   15  FILLER  PIC X(16) VALUE "CC# IS RECORDED ".
                   15  FILLER  PIC X(11) VALUE "AGAINST  ".
               10  PROG-DESC-B PIC X(60) VALUE SPACES.
               10  PROG-FUNC   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  SCREEN-DATA.
           05  INPUT-CC        PIC X(04).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  WO-DATA.
           05  WO-CC-NO        PIC X(04).
           05  WO-CC-NAME      PIC X(16).
           05  WO-LINE.
               10  WO-LINES    OCCURS 18 TIMES.
                   15  WONM    PIC X(10).
                   15  WOSD    PIC X(06).
                   15  WOST    PIC X(04).
                   15  WOCD    PIC X(06).
                   15  WOCT    PIC X(04).
           05  DECISION-MSG    PIC X(79).
           05  CMDMSGO         PIC X(79).
           05  ERRMSGO         PIC X(79).

           COPY SCREENIO       OF COPYLIB.

       01  WO-LABOR-DATA.
           COPY DWOLABOR       OF COPYLIB.

       PROCEDURE DIVISION.
       START-PGM.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-LABOR-FILE.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       6-MAIN.
           MOVE "FGETCCWO"     TO SCREEN-NAME.
           MOVE 0              TO SUB SUBC.
           MOVE SPACES         TO WO-DATA SCREEN-DATA DISPLAY-REC.

       6-SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           MOVE INPUT-CC       TO LBRCCNUM OF WLFREC.
           START WO-LABOR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "CANNOT LOCATE REQUESTED CLOCK CARD"
                               TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 6-SHOWFORM.

           MOVE INPUT-CC       TO WO-CC-NO.

       6-MAIN-LOOP.
           READ WO-LABOR-FILE  NEXT INTO WO-LABOR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   MOVE 20     TO SUB
               ELSE
                   MOVE 0      TO SUB
                   MOVE SPACES TO WO-DATA SCREEN-DATA
                   GO TO 6-MAIN.

           IF INPUT-CC NOT = LBRCCNUM OF WLFREC
               MOVE 20         TO SUB.

           ADD 1               TO SUB.
           IF SUB > 18         GO TO 7-MAIN.

           MOVE LBR-EMPL-NAME  TO WO-CC-NAME.
           MOVE LBR-WO-NUM     TO WONM(SUB).
           MOVE LBR-START-DATE TO WOSD(SUB).
           MOVE LBR-START-TIME TO WOST(SUB).
           MOVE LBR-COMPL-DATE TO WOCD(SUB).
           MOVE LBR-COMPL-TIME TO WOCT(SUB).
           GO TO 6-MAIN-LOOP.

       61-CHECK-NUM.

       7-MAIN.
           MOVE "FCCWOLST"     TO SCREEN-NAME.

       7-SHOWFORM.
           MOVE "DEPRESS F1 TO CONTINUE, F3 TO END PROGRAM"
                               TO DECISION-MSG.
           MOVE WO-DATA        TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO 6-MAIN.

           IF SUB > 20
               GO TO 6-MAIN
           ELSE
               MOVE 0              TO SUB
               MOVE SPACES         TO WO-LINE
               GO TO 6-MAIN-LOOP.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-LABOR-FILE.
           GOBACK.

