       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TGETZONE.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER COMPANY.
       DATE-WRITTEN.           SEPTEMBER  1985.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-ZONE-PRTY
                  ASSIGN TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZGETSCRNS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-ZONE-PRTY
           LABEL RECORDS ARE STANDARD.
       01  CR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TRUE-VAL            PIC 1   VALUE B"1".

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  ZONE-BUF               PIC XXXX.
           05  SCRN-MSGS.
               10  CMDMSG             PIC X(79).
               10  ERRMSG             PIC X(79).

       01  ZONE-ARGUMENT.
           05  Z-ARG          PIC X(4).
           05  FILLER         PIC XX   VALUE "1 ".

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-PROC.
           OPEN INPUT          WO-ZONE-PRTY.
           OPEN I-O            DISPLAY-FILE.

       6-MAIN.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE "VGETZONE"     TO SCREEN-NAME.
           MOVE SPACES         TO MESSAGE-BUFFER.
      **********************************************************************
      **    MESSAGE 042/071:
      ** PRESS 'ENTER' TO CONTINUE
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  71            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.
           IF MESSAGE-BUFFER = SPACES
               MOVE "PRESS `ENTER' TO CONTINUE"
                               TO MESSAGE-BUFFER.

       61-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF ZONE-BUF = SPACES
      **********************************************************************
      **    MESSAGE 035/044:
      ** INVALID ZONE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 61-SHOWFORM.

           MOVE ZONE-BUF       TO Z-ARG.
           MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-ZONE-PRTY.
           START WO-ZONE-PRTY  KEY = EXTERNALLY-DESCRIBED-KEY.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/044:
      ** INVALID ZONE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 61-SHOWFORM.

           MOVE ZONE-BUF       TO JCW-ZJCW-269 SETJCW-VALUE.
           MOVE 269            TO SETJCW-STARTING-POS.
           MOVE 4              TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "    "     TO JCW-ZJCW-269.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-ZONE-PRTY.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

