       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TGETSHFT.
       AUTHOR.                 W. ROXBURY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SHIFT-STRUCTURE
                  ASSIGN TO DATABASE-MCFLMM2501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  SHIFT-STRUCTURE
           LABEL RECORDS ARE STANDARD.
       01  SS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2501.

       WORKING-STORAGE SECTION.
       77  FILE-STAT                 PIC XX.

       01  SIGNED-DATA.
           05  S-SHIFTS.
               10  SS-1       PIC S9999.
               10  SE-1       PIC S9999.
               10  SS-2       PIC S9999.
               10  SE-2       PIC S9999.
               10  SS-3       PIC S9999.
               10  SE-3       PIC S9999.
               10  SS-4       PIC S9999.
               10  SE-4       PIC S9999.
           05  S-PADS.
               10  STIME      PIC S9999.
               10  CALC-1     PIC S9999.
               10  CALC-2     PIC S9999.

       01  TIME-CALC.
           05  TC-HR          PIC S99.
           05  TC-MN          PIC 99.

       01  TIME-CHECK.
           05  T-HR           PIC 99.
           05  T-MN           PIC 99.

       01  SHIFT-STRUCT-DATA.
           COPY  MSHFTSTR      IN COPYLIB.

       LINKAGE SECTION.
       01  LINK-DATA.
           05  ZONE-BUF       PIC X(04).
           05  TIME-IN.
               10  HRS-IN.
                   15  H1     PIC 9.
                   15  H2     PIC 9.
               10  MIN-IN.
                   15  M1     PIC 9.
                   15  M2     PIC 9.
           05  CODE-BUF       PIC X.
           05  SHIFTS.
               10  S-1        PIC 9999.
               10  E-1        PIC 9999.
               10  S-2        PIC 9999.
               10  E-2        PIC 9999.
               10  S-3        PIC 9999.
               10  E-3        PIC 9999.
               10  S-4        PIC 9999.
               10  E-4        PIC 9999.
           05  CURR-SHIFT     PIC 9.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION USING LINK-DATA
                                DBPARAMETERS.

       START-PROCESSING.
           OPEN INPUT          SHIFT-STRUCTURE.
           MOVE ZEROS          TO SHIFTS SIGNED-DATA.
           MOVE SPACE          TO RETURN-BYTE.
           IF TIME-IN = "    " MOVE "0000" TO TIME-IN.
           IF H1 NOT NUMERIC   MOVE 0 TO H1.
           IF H2 NOT NUMERIC   MOVE 0 TO H2.
           IF M1 NOT NUMERIC   MOVE 0 TO M1.
           IF M2 NOT NUMERIC   MOVE 0 TO M2.
           MOVE ZONE-BUF       TO SHIFTZONE OF SHIFT-STRUCTURE.
           READ  SHIFT-STRUCTURE INTO SHIFT-STRUCT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               IF ZONE-BUF = "MAST" OR "CLRL"
                   MOVE SPACES TO LINK-DATA
                   GO TO RETURN-FUNCTION
               ELSE
                   MOVE "X"    TO RETURN-BYTE
                   MOVE "3"    TO CODE-BUF
                   MOVE 0700   TO S-1 SS-1
                   MOVE 1500   TO S-2 SS-2
                   MOVE 2300   TO S-3 SS-3
                   GO TO CALC-SHIFT-ENDS.

           MOVE CODE-VALUE     TO CODE-BUF.
           MOVE FRST-SHIFT     TO S-1 SS-1.
           MOVE SCND-SHIFT     TO S-2 SS-2.
           IF CODE-BUF = "2" GO TO CALC-SHIFT-ENDS.
           MOVE THRD-SHIFT     TO S-3 SS-3.
           IF CODE-BUF = "3" GO TO CALC-SHIFT-ENDS.
           MOVE FRTH-SHIFT     TO S-4 SS-4.

       CALC-SHIFT-ENDS.
           IF CODE-BUF = "2"
               COMPUTE E-2 = S-1 - 1
               COMPUTE E-1 = S-2 - 1
               GO TO CALC-2-SHIFTS
           ELSE
           IF CODE-BUF = "3"
               COMPUTE E-3 = S-1 - 1
               COMPUTE E-1 = S-2 - 1
               COMPUTE E-2 = S-3 - 1
               GO TO CALC-3-SHIFTS
           ELSE
               COMPUTE E-4 = S-1 - 1
               COMPUTE E-1 = S-2 - 1
               COMPUTE E-2 = S-3 - 1
               COMPUTE E-3 = S-4 - 1
               GO TO CALC-4-SHIFTS.

       CALC-2-SHIFTS.
           IF S-1 = 0 MOVE 2359 TO E-2.
           IF S-2 = 0 MOVE 2359 TO E-1.
           MOVE E-1            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-1 SE-1.
           MOVE E-2            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-2 SE-2.
           MOVE 0              TO STIME.

           IF SS-1 > SE-1
               MOVE SS-1       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-1
               IF TIME-IN = S-1 AND > E-1
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-1 AND > E-1
                   MOVE TIME-IN TO STIME.

           IF STIME NOT = 0
               MOVE STIME      TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO STIME.

           IF STIME = 0 MOVE TIME-IN TO STIME.
           SUBTRACT 1          FROM SS-1.
           ADD 1               TO SE-1.

           IF STIME > SS-1 AND < SE-1
               MOVE 1          TO CURR-SHIFT
           ELSE
               MOVE 2          TO CURR-SHIFT.

           GO TO RETURN-FUNCTION.

       CALC-3-SHIFTS.
           IF S-1 = 0 MOVE 2359 TO E-3.
           IF S-2 = 0 MOVE 2359 TO E-1.
           IF S-3 = 0 MOVE 2359 TO E-2.
           MOVE E-1            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-1 SE-1.
           MOVE E-2            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-2 SE-2.
           MOVE E-3            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-3 SE-3.
           MOVE 0              TO STIME.

           IF SS-1 > SE-1
               MOVE SS-1       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-1
               IF TIME-IN = S-1 AND > E-1
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-1 AND > E-1
                   MOVE TIME-IN TO STIME.

           IF SS-2 > SE-2
               MOVE SS-2       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-2
               IF TIME-IN = S-2 AND > E-2
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-2 AND > E-2
                   MOVE TIME-IN TO STIME.

           IF STIME NOT = 0
               MOVE STIME      TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO STIME.

           IF STIME = 0 MOVE TIME-IN TO STIME.
           SUBTRACT 1          FROM SS-1.
           ADD 1               TO SE-1.
           SUBTRACT 1          FROM SS-2.
           ADD 1               TO SE-2.

           IF STIME > SS-1 AND < SE-1
               MOVE 1          TO CURR-SHIFT
           ELSE
           IF STIME > SS-2 AND < SE-2
               MOVE 2          TO CURR-SHIFT
           ELSE
               MOVE 3          TO CURR-SHIFT.

           GO TO RETURN-FUNCTION.

       CALC-4-SHIFTS.
           IF S-1 = 0 MOVE 2359 TO E-4.
           IF S-2 = 0 MOVE 2359 TO E-1.
           IF S-3 = 0 MOVE 2359 TO E-2.
           IF S-4 = 0 MOVE 2359 TO E-3.
           MOVE E-1            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-1 SE-1.
           MOVE E-2            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-2 SE-2.
           MOVE E-3            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-3 SE-3.
           MOVE E-4            TO TIME-CHECK.
           IF T-MN = 99 MOVE 59 TO T-MN.
           MOVE TIME-CHECK     TO E-4 SE-4.
           MOVE 0              TO STIME.

           IF SS-1 > SE-1
               MOVE SS-1       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-1
               IF TIME-IN = S-1 AND > E-1
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-1 AND > E-1
                   MOVE TIME-IN TO STIME.

           IF SS-2 > SE-2
               MOVE SS-2       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-2
               IF TIME-IN = S-2 AND > E-2
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-2 AND > E-2
                   MOVE TIME-IN TO STIME.

           IF SS-3 > SE-3
               MOVE SS-3       TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO SS-3
               IF TIME-IN = S-3 AND > E-3
                   MOVE TIME-IN TO STIME
               ELSE
               IF TIME-IN > S-3 AND > E-3
                   MOVE TIME-IN TO STIME.

           IF STIME NOT = 0
               MOVE STIME      TO TIME-CALC
               MOVE TC-HR      TO CALC-1
               COMPUTE CALC-2 = 60 * CALC-1
               SUBTRACT 1440   FROM CALC-2
               ADD TC-MN       TO CALC-2
               MOVE CALC-2     TO STIME.

           IF STIME = 0 MOVE TIME-IN TO STIME.
           SUBTRACT 1          FROM SS-1.
           ADD 1               TO SE-1.
           SUBTRACT 1          FROM SS-2.
           ADD 1               TO SE-2.
           SUBTRACT 1          FROM SS-3.
           ADD 1               TO SE-3.

           IF STIME > SS-1 AND < SE-1
               MOVE 1          TO CURR-SHIFT
           ELSE
           IF STIME > SS-2 AND < SE-2
               MOVE 2          TO CURR-SHIFT
           ELSE
           IF STIME > SS-3 AND < SE-3
               MOVE 3          TO CURR-SHIFT
           ELSE
               MOVE 4          TO CURR-SHIFT.

       RETURN-FUNCTION.
           CLOSE               SHIFT-STRUCTURE.
           GOBACK.

