000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TGETTERM.
000400 AUTHOR.         CA YODER.
000500 DATE-WRITTEN.   AUGUST 1996.
000600 DATE-COMPILED.
000700*INSTALLATION.   THE GOODYEAR TIRE & RUBBER COMPANY.
000800*REMARKS.
000900*
001000*********************************************************
001100*D  T G E T T E R M                                     *
001200*D                                                      *
001300*D    THIS PROGRAM COPIES PAYMENT TERM RECORDS FROM     *
001400*D    MVALIDTYPE & DVALIDDATA TO A FLAT FILE. THIS      *
001500*D    FILE CAN THEN BE SENT TO OTHER PLANTS AND USED BY *
001600*D    "TLOADVAL" TO LOAD DEFAULT VALUES FOR PAYMENT     *
001700*D    TERMS HELP SCREEN.                                *
001800*********************************************************
001900
002000 ENVIRONMENT DIVISION.
002100 CONFIGURATION SECTION.
002200 SOURCE-COMPUTER.
002300 OBJECT-COMPUTER.
002400 INPUT-OUTPUT SECTION.
002500 FILE-CONTROL.
002600     SELECT PAY-FILE
               ASSIGN TO DISK-TERMFILE.

           SELECT MVALID-I
               ASSIGN TO DATABASE-MCFLCS5101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DVALID-I
               ASSIGN TO DATABASE-MCFLCS5201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
002700
002800 DATA DIVISION.
002900 FILE SECTION.
003000 FD  PAY-FILE
003100     LABEL RECORDS ARE OMITTED
003200     RECORD CONTAINS 80 CHARACTERS
003300     DATA RECORD IS PAY-REC.
003400 01  PAY-REC.
003500     05  PAY-CODE              PIC X(6).
003600     05  PAY-DESC              PIC X(30).
003700     05  FILLER                PIC X(20).
003800     05  PAY-ERR-NUM           PIC X(6).
003900     05  FILLER                PIC X(18).

       FD  MVALID-I
           LABEL RECORDS ARE STANDARD.
       01  MVALID-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5101.

       FD  DVALID-I
           LABEL RECORDS ARE STANDARD.
       01  DVALID-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5201.
004000
004100 WORKING-STORAGE SECTION.
004200
004300 01  FILE-STATUS.
004400     05  FILE-STATUS-1         PIC X     VALUE "0".
004500     05  FILE-STATUS-2         PIC X     VALUE "0".
004600
004700 01  PAYCOD-EOF-SW             PIC X     VALUE "N".
004800 01  RECORD-WRITTEN-SW         PIC X     VALUE "N".
004900
005000 01  HOLD-CODE-KEY.
005100     05  FILLER                PIC X(6).
005200     05  HOLD-TERM             PIC X(6).
005300
005400*-------------------------------------------------------------*
005500*                U T I L I T Y   A R E A                      *
005600*-------------------------------------------------------------*
005700
005800 COPY TBLOWUP IN COPYLIB.
005900
006000*-------------------------------------------------------------*
006100*               D A T A B A S E   W O R K                     *
006200*-------------------------------------------------------------*
006300
006400 COPY DVLDDATA IN COPYLIB.

006500 COPY MVLDTYPE IN COPYLIB.
006600
       COPY DATAB IN COPYLIB.
007300
007400 01  DUMMY-ARG                 PIC X(2)  VALUE SPACES.
007500 01  TYPE-CODE-ARG             PIC X(6)  VALUE "PAYCOD".
008400
008500 PROCEDURE DIVISION.
008600
008700 0-BEGIN.
008800     PERFORM 1-HSK.
008900     PERFORM 6-MAIN UNTIL PAYCOD-EOF-SW = "Y".
009000     PERFORM 2-EOJ.
009100     GOBACK.
009200
009300 1-HSK.
009400     OPEN OUTPUT  PAY-FILE
                INPUT   MVALID-I
                        DVALID-I.
009700
009800*----------- GET & WRITE MVALIDTYPE HEADER RECORD.
           MOVE TYPE-CODE-ARG TO VLDCODETYP OF MVALID-I-REC.
           READ MVALID-I INTO BUF-MVALIDTYPE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
010100     IF FILE-STATUS = "00"
010200         PERFORM 10-WRITE-HEADER
010300     ELSE
010400     IF FILE-STATUS-1 = "2"
010500         MOVE "NO MVALIDTYPE RECORD EXISTS--FILE NOT CREATED"
010600                                  TO  BU-DISPLAY-MSG
010700         GO TO 2-BLOWUP
010800     ELSE
010900     IF FILE-STATUS NOT = "00"
011000         MOVE "READ ERROR IN MVALIDTYPE*6-MAIN"
011100                                  TO  BU-DISPLAY-MSG
011200         GO TO 2-BLOWUP.
011300
011400*----------- GET FIRST DVALIDDATA RECORD.
           MOVE TYPE-CODE-ARG TO VLDCODETYP OF DVALID-I-REC.
           START DVALID-I KEY = VLDCODETYP OF DVALID-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
011700     IF FILE-STATUS-1 = "2"
011800         DISPLAY "** NO PAYCOD RECORDS FOUND FOR FILE **"
011900         MOVE "Y"                 TO  PAYCOD-EOF-SW
012000     ELSE
012100     IF FILE-STATUS NOT = "00"
012200         MOVE "START ERROR IN 1-HSK"
012300                                  TO  BU-DISPLAY-MSG
012400         GO TO 2-BLOWUP
012500     ELSE
               READ DVALID-I INTO BUF-DVALIDDATA
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
012900         IF FILE-STATUS-1 = "2"
013000             DISPLAY "** NO PAY TERMS RECORDS EXIST **"
013100             MOVE "Y"             TO  PAYCOD-EOF-SW
013200         ELSE
013300         IF FILE-STATUS NOT = "00"
013400             MOVE "READ ERROR IN DVALIDDATA: 1-HSK"
013500                                  TO  BU-DISPLAY-MSG
013600             GO TO 2-BLOWUP.
013700
013800 10-WRITE-HEADER.
013900     MOVE SPACES                  TO  PAY-REC.
014000     MOVE "PAYCOD"                TO  PAY-CODE.
014100     MOVE VALID-TYPE-DESC         TO  PAY-DESC.
014200     MOVE VALID-TYPE-ERR-NO       TO  PAY-ERR-NUM.
014300     WRITE PAY-REC.
014400
014500 2-EOJ.
014600     CLOSE PAY-FILE
                 MVALID-I
                 DVALID-I.
015200
015300 2-BLOWUP.
015400     MOVE "TGETTERM"              TO BU-PGM-NAME.
015500     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
015600           DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
015700               BU-DISPLAY-AREA.
015800
015900*-------------------------------------------------------------*
016000*                M A I N   P A R A G R A P H                  *
016100*-------------------------------------------------------------*
016200
016300 6-MAIN.
016400     MOVE SPACES                  TO  PAY-REC.
016500     MOVE VALID-CODE-KEY          TO  HOLD-CODE-KEY.
016600     MOVE HOLD-TERM               TO  PAY-CODE.
016700     MOVE VALID-CODE-DESC         TO  PAY-DESC.
016800     WRITE PAY-REC.
016900
           READ DVALID-I NEXT INTO BUF-DVALIDDATA
               AT END MOVE "Y"     TO  PAYCOD-EOF-SW.

           IF PAYCOD-EOF-SW NOT = "Y"
               IF VALID-CODE-TYPE NOT = "PAYCOD"
                   MOVE "Y"        TO  PAYCOD-EOF-SW.

