       IDENTIFICATION DIVISION.
       PROGRAM-ID.     THAMMRPO.
       AUTHOR.         C.I.HILLES.
       DATE-WRITTEN.   06/26/91.
       DATE-COMPILED.
      *INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
      *REMARKS.
      *D   HAMMERS POS GIVEN A DATE RANGE.
      *D   USED TO DELETE POS WITHOUT GOING TO HISTORY AND WITHOUT THE TIES
      *D   VARIOUS CRITERIA REQUIRED TO DELETE A PO BY AUTO PO DELETE.
      *C
      *C 09/12/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON START AND END DATE AND
      *C   ON COMPARISON WITH PO DATE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPORECD-PO-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  DPORECD-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  PRINT-FILE
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                PIC X(132).

       WORKING-STORAGE SECTION.
       01  WORK-STRING                   PIC X(132).
       01  TOTAL-PO-COUNT                PIC 9(5).
       01  IN-RANGE-COUNT                PIC 9(5).
       01  POS-DELETED-COUNT             PIC 9(5).
       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.

      ******************************************************************
      **          S U B P R O G R A M   A R E A S                     **
      ******************************************************************
       COPY TBLOWUP    IN COPYLIB.

      *************************************************************
      **           D A T A B A S E   W O R K                     **
      *************************************************************
       COPY DATAB OF COPYLIB.
       01  PO-SEARCH                     PIC X(16) VALUE "PO-RCV-NO;".
       01  PO-ARG.
           05  PO-ARG-PO                 PIC X(8).
           05  PO-ARG-REL                PIC X(3).
           05  PO-ARG-RS                 PIC X(3).

       COPY DPORECD    IN COPYLIB.

       01  START-DATE-CN.
           05  START-CC                  PIC X(2).
           05  START-DATE.
               10  START-DATE-YY         PIC X(2).
               10  FILLER                PIC X(4).
       01  END-DATE-CN.
           05  END-CC                  PIC X(2).
           05  END-DATE.
               10  END-DATE-YY         PIC X(2).
               10  FILLER                PIC X(4).
       01  UPDATE-FLAG                   PIC X(1).
       01  GO-FLAG                       PIC X(1).
       01  COMPANY-SAVE                  PIC X(3).

       PROCEDURE DIVISION.

       0000-START.
           DISPLAY "INPUT START DATE FOR P.O.S TO DELETE".
           DISPLAY "YYMMDD".
           ACCEPT START-DATE.
           IF START-DATE-YY > "70"
               MOVE "19" TO START-CC
           ELSE
               MOVE "20" TO START-CC.
           DISPLAY "INPUT END DATE FOR P.O.S TO DELETE".
           DISPLAY "YYMMDD".
           ACCEPT END-DATE.
           IF END-DATE-YY > "70"
               MOVE "19" TO END-CC
           ELSE
               MOVE "20" TO END-CC.
           DISPLAY "INPUT COMPANY CODE".
           ACCEPT COMPANY-SAVE.
           DISPLAY "UPDATE DATABASE?".
           ACCEPT UPDATE-FLAG.
           IF UPDATE-FLAG = "Y"
               DISPLAY "WILL DELETE ALL POS FROM ",
                  START-DATE-CN, "          TO  ", END-DATE-CN
               DISPLAY "OK               TO  CONTINUE?"
               ACCEPT GO-FLAG
               IF GO-FLAG NOT = "Y"
                   DISPLAY "NO PROCESSING DONE"
                   GOBACK.

           MOVE ZERO TO TOTAL-PO-COUNT, IN-RANGE-COUNT,
              POS-DELETED-COUNT.

           PERFORM 9999-OPEN-STUFF.

           PERFORM 9999-BEGFIL-DPORECD-PO-I.
           PERFORM 9999-GETSER-DPORECD-PO-I.
           PERFORM UNTIL NOT GOOD-CALL
               ADD 1                     TO  TOTAL-PO-COUNT
               IF PO-DATE-CN >= START-DATE-CN AND
                  PO-DATE-CN <= END-DATE-CN
                   ADD 1                 TO  IN-RANGE-COUNT
      *            DISPLAY PO-RCV-NO, " DATE ", PO-DATE-CN,
      *               " WAS IN SELECTED RANGE"
                   IF UPDATE-FLAG = "Y"
                       CALL "SDELTPO" USING BASE, PO-RCV-NO,
                         COMPANY-SAVE
                       ADD 1             TO  POS-DELETED-COUNT
                   END-IF
               END-IF
               PERFORM 9999-GETSER-DPORECD-PO-I
           END-PERFORM.

           PERFORM 9999-CLOSE-STUFF.

           DISPLAY "THERE WERE ", TOTAL-PO-COUNT,
             " PURCHASE ORDERS IN THE SYSTEM".
           DISPLAY IN-RANGE-COUNT, " WERE IN THE SPECIFIED RANGE".
           DISPLAY POS-DELETED-COUNT, " P.O.S WERE DELETED".
           DISPLAY "HIT 'ENTER' TO EXIT PROGRAM".
           ACCEPT GO-FLAG.

           GOBACK.

       2100-BLOWUP.
           MOVE "THAMMRPO"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.

       9999-GETSER-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DPORECD-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DPORECD-PO-I.
           MOVE SPACES TO PORCVNO OF DPORECD-PO-REC-I.
           START DPORECD-PO-I KEY >= PORCVNO OF DPORECD-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-CLOSE-STUFF.
           CLOSE DPORECD-PO-I.

       9999-OPEN-STUFF.
           OPEN INPUT DPORECD-PO-I.
