       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THCDISP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-HOT-CODE
                  ASSIGN TO DATABASE-MCFLMM2001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT EQP-HOT-CODE-SEQ
                  ASSIGN TO DATABASE-MCFPMM2000
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS SEQUENTIAL
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT WO-ZONE-PRTY
                  ASSIGN TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN TO DISK-OUTFILE
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN TO DISK-SORTFILE.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZHOTCODE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-HOT-CODE
           LABEL RECORDS ARE STANDARD.
       01  HC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2001.

       FD  EQP-HOT-CODE-SEQ
           LABEL RECORDS ARE STANDARD.
       01  HC-REC-SEQ.
           COPY DDS-ALL-FORMATS OF MCFPMM2000.

       FD  WO-ZONE-PRTY
           LABEL RECORDS ARE STANDARD.
       01  ZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD CONTAINS 56 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  LINE-OUT.
               10  EQP-NUM-OUT        PIC X(06).
               10  S-DATE-OUT.
                   15  S-MM-OUT       PIC XX.
                   15  S-DD-OUT       PIC XX.
                   15  S-YY-OUT       PIC XX.
               10  S-TIME-OUT.
                   15  S-HH-OUT       PIC XX.
                   15  S-MN-OUT       PIC XX.
               10  E-DATE-OUT.
                   15  E-MM-OUT       PIC XX.
                   15  E-DD-OUT       PIC XX.
                   15  E-YY-OUT       PIC XX.
               10  E-TIME-OUT.
                   15  E-HH-OUT       PIC XX.
                   15  E-MN-OUT       PIC XX.
               10  REM-OUT            PIC X(30).

       SD  SORT-FILE RECORD CONTAINS 56 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  LINE-SORT.
               10  EQP-NUM-SORT.
                   15  SORT-EQ1       PIC X.
                   15  SORT-EQ2       PIC X.
                   15  SORT-EQ3       PIC X.
                   15  SORT-EQ4       PIC X.
                   15  SORT-EQ5       PIC X.
                   15  SORT-EQ6       PIC X.
               10  S-DATE-SORT.
                   15  S-MM-SORT      PIC XX.
                   15  S-DD-SORT      PIC XX.
                   15  S-YY-SORT      PIC XX.
               10  S-TIME-SORT.
                   15  S-HH-SORT      PIC XX.
                   15  S-MN-SORT      PIC XX.
               10  E-DATE-SORT.
                   15  E-MM-SORT      PIC XX.
                   15  E-DD-SORT      PIC XX.
                   15  E-YY-SORT      PIC XX.
               10  E-TIME-SORT.
                   15  E-HH-SORT      PIC XX.
                   15  E-MN-SORT      PIC XX.
               10  REM-SORT           PIC X(30).

       WORKING-STORAGE SECTION.
       77  ACT-KEY   VALUE 0         PIC 9999.
       77  MAX-KEY   VALUE 0         PIC 9999.
       77  EOF-SW    VALUE 0         PIC 9999.
       77  TRUE-VAL  VALUE B"1"      PIC 1.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "THCDISP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "DISPLAYS MMIS HOT CODE ENTRIES FOR THE HOT CODE MAINTENANCE ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "PROGRAM.                                                    ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM THE f4 KEY OF THE HOT CODE MAINTENANCE MENU.      ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SELECT-BUFFER.
           05  ZONE-BUF               PIC XXXX.
           05  EQUIP-BUF.
               10  EQ1                PIC X.
               10  EQ2                PIC X.
               10  EQ3                PIC X.
               10  EQ4                PIC X.
               10  EQ5                PIC X.
               10  EQ6                PIC X.
           05  CMDMSG                 PIC X(79).
           05  ERRMSG                 PIC X(79).

       01  SCREEN-DATA.
           05  LINE-1.
               10  EQP-NUM-1          PIC X(06).
               10  S-DATE-1.
                   15  S-MM-1         PIC XX.
                   15  S-DD-1         PIC XX.
                   15  S-YY-1         PIC XX.
               10  S-TIME-1.
                   15  S-HH-1         PIC XX.
                   15  S-MN-1         PIC XX.
               10  E-DATE-1.
                   15  E-MM-1         PIC XX.
                   15  E-DD-1         PIC XX.
                   15  E-YY-1         PIC XX.
               10  E-TIME-1.
                   15  E-HH-1         PIC XX.
                   15  E-MN-1         PIC XX.
               10  REM-1              PIC X(30).
           05  LINE-2.
               10  EQP-NUM-2          PIC X(06).
               10  S-DATE-2.
                   15  S-MM-2         PIC XX.
                   15  S-DD-2         PIC XX.
                   15  S-YY-2         PIC XX.
               10  S-TIME-2.
                   15  S-HH-2         PIC XX.
                   15  S-MN-2         PIC XX.
               10  E-DATE-2.
                   15  E-MM-2         PIC XX.
                   15  E-DD-2         PIC XX.
                   15  E-YY-2         PIC XX.
               10  E-TIME-2.
                   15  E-HH-2         PIC XX.
                   15  E-MN-2         PIC XX.
               10  REM-2              PIC X(30).
           05  LINE-3.
               10  EQP-NUM-3          PIC X(06).
               10  S-DATE-3.
                   15  S-MM-3         PIC XX.
                   15  S-DD-3         PIC XX.
                   15  S-YY-3         PIC XX.
               10  S-TIME-3.
                   15  S-HH-3         PIC XX.
                   15  S-MN-3         PIC XX.
               10  E-DATE-3.
                   15  E-MM-3         PIC XX.
                   15  E-DD-3         PIC XX.
                   15  E-YY-3         PIC XX.
               10  E-TIME-3.
                   15  E-HH-3         PIC XX.
                   15  E-MN-3         PIC XX.
               10  REM-3              PIC X(30).
           05  LINE-4.
               10  EQP-NUM-4          PIC X(06).
               10  S-DATE-4.
                   15  S-MM-4         PIC XX.
                   15  S-DD-4         PIC XX.
                   15  S-YY-4         PIC XX.
               10  S-TIME-4.
                   15  S-HH-4         PIC XX.
                   15  S-MN-4         PIC XX.
               10  E-DATE-4.
                   15  E-MM-4         PIC XX.
                   15  E-DD-4         PIC XX.
                   15  E-YY-4         PIC XX.
               10  E-TIME-4.
                   15  E-HH-4         PIC XX.
                   15  E-MN-4         PIC XX.
               10  REM-4              PIC X(30).
           05  LINE-5.
               10  EQP-NUM-5          PIC X(06).
               10  S-DATE-5.
                   15  S-MM-5         PIC XX.
                   15  S-DD-5         PIC XX.
                   15  S-YY-5         PIC XX.
               10  S-TIME-5.
                   15  S-HH-5         PIC XX.
                   15  S-MN-5         PIC XX.
               10  E-DATE-5.
                   15  E-MM-5         PIC XX.
                   15  E-DD-5         PIC XX.
                   15  E-YY-5         PIC XX.
               10  E-TIME-5.
                   15  E-HH-5         PIC XX.
                   15  E-MN-5         PIC XX.
               10  REM-5              PIC X(30).
           05  LINE-6.
               10  EQP-NUM-6          PIC X(06).
               10  S-DATE-6.
                   15  S-MM-6         PIC XX.
                   15  S-DD-6         PIC XX.
                   15  S-YY-6         PIC XX.
               10  S-TIME-6.
                   15  S-HH-6         PIC XX.
                   15  S-MN-6         PIC XX.
               10  E-DATE-6.
                   15  E-MM-6         PIC XX.
                   15  E-DD-6         PIC XX.
                   15  E-YY-6         PIC XX.
               10  E-TIME-6.
                   15  E-HH-6         PIC XX.
                   15  E-MN-6         PIC XX.
               10  REM-6              PIC X(30).
           05  LINE-7.
               10  EQP-NUM-7          PIC X(06).
               10  S-DATE-7.
                   15  S-MM-7         PIC XX.
                   15  S-DD-7         PIC XX.
                   15  S-YY-7         PIC XX.
               10  S-TIME-7.
                   15  S-HH-7         PIC XX.
                   15  S-MN-7         PIC XX.
               10  E-DATE-7.
                   15  E-MM-7         PIC XX.
                   15  E-DD-7         PIC XX.
                   15  E-YY-7         PIC XX.
               10  E-TIME-7.
                   15  E-HH-7         PIC XX.
                   15  E-MN-7         PIC XX.
               10  REM-7              PIC X(30).
           05  CMDMSG2                PIC X(79).
           05  ERRMSG2                PIC X(79).

       01  ZONE-ARGUMENT.
           05  Z-ARG           PIC X(4).
           05  FILLER          PIC XX   VALUE "1 ".

       01  ZONE-DATA.
           05  ZONE-FIELD      PIC X(4).
           05  PRTY-FIELD      PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  HOT-CODE-DATA.
           COPY DHOTCODE       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.
       MAIN-PROCESSING SECTION 01.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "Y"
               GO TO OPEN-FILES.
           GOBACK.

       OPEN-FILES.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-ZONE-PRTY.
           OPEN INPUT          EQP-HOT-CODE.

       CLEAR-BUFFERS.
           MOVE SPACES         TO SELECT-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE 0              TO EOF-SW.

       1-SHOWFORM.
           MOVE "VHCSELECT"    TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SELECT-BUFFER  TO DISPLAY-REC.
           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SELECT-BUFFER.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 0
               NEXT SENTENCE
           ELSE
               GO TO 1-SHOWFORM.

           IF ZONE-BUF = SPACES GO TO 6-MAIN.
           MOVE ZONE-BUF       TO Z-ARG.
           MOVE ZONE-ARGUMENT  TO ZP-REC.
           READ WO-ZONE-PRTY   INTO ZONE-DATA.
           IF FILE-STAT NOT = "00"
               MOVE 35044      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (1) IND (99)
               GO TO 1-SHOWFORM.

       6-MAIN.
           MOVE 0              TO ACT-KEY.
           MOVE SPACES         TO HOT-CODE-DATA.
           MOVE ZONE-DATA      TO HC-ZONE-PRTY OF HOT-CODE-DATA.
           MOVE HOT-CODE-DATA  TO HC-REC.
           SORT SORT-FILE ASCENDING KEY EQP-NUM-SORT
               INPUT PROCEDURE SORT-INPUT-RECORDS
               OUTPUT PROCEDURE SORT-WRITE-FILE.

           IF ACT-KEY = 0
               MOVE 40011      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (1) IND (99)
               GO TO 1-SHOWFORM.

           MOVE 0              TO ACT-KEY.
           OPEN INPUT          OUT-FILE.

       61-RESET-SCREEN.
           MOVE SPACES         TO SCREEN-DATA.
           PERFORM 62-FILL-SCREEN THRU 62-FS-EXIT.

       61-SHOWFORM.
           MOVE "VDISPHC"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 12
               CLOSE           OUT-FILE
               GO TO CLEAR-BUFFERS.

           IF KEY-HIT NOT = 0
               IF EOF-SW = 1
                   CLOSE       OUT-FILE
                   GO TO CLEAR-BUFFERS
               ELSE
                   MOVE "00"   TO KEY-HIT-X
                   GO TO 61-SHOWFORM.

           IF EOF-SW = 1
               MOVE 0          TO EOF-SW
               MOVE 0          TO ACT-KEY.

           GO TO 61-RESET-SCREEN.

       62-FILL-SCREEN.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-1.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-2.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-3.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-4.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-5.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.

           MOVE OUT-REC        TO LINE-6.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO OUT-REC.
           READ OUT-FILE INVALID KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               GO TO 62-FS-EXIT.
           MOVE OUT-REC        TO LINE-7.

       62-FS-EXIT.    EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               OUT-FILE.
           CLOSE               WO-ZONE-PRTY.
           CLOSE               EQP-HOT-CODE.
           GOBACK.

       SORT-INPUT-RECORDS SECTION 02.
           IF ZONE-BUF NOT = SPACES
               START EQP-HOT-CODE KEY NOT < EXTERNALLY-DESCRIBED-KEY
               PERFORM SORT-MAIN THRU SORT-M-EXIT
           ELSE
               OPEN INPUT      EQP-HOT-CODE-SEQ
               MOVE 0          TO ACT-KEY
               PERFORM SORT-CLEAR THRU SORT-C-EXIT
               CLOSE EQP-HOT-CODE-SEQ.

           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE SPACES         TO SORT-REC.
           READ EQP-HOT-CODE NEXT
               AT END GO TO SORT-M-EXIT.
           IF ZONE-ARGUMENT NOT = ZONEPRTY OF EQP-HOT-CODE
               GO TO SORT-M-EXIT.

           MOVE HC-REC         TO HOT-CODE-DATA.
           MOVE HC-EQUIP-NUM   TO EQP-NUM-SORT.
           IF EQ1 = SORT-EQ1 OR SPACES
             IF EQ2 = SORT-EQ2 OR SPACES
               IF EQ3 = SORT-EQ3 OR SPACES
                 IF EQ4 = SORT-EQ4 OR SPACES
                   IF EQ5 = SORT-EQ5 OR SPACES
                     IF EQ6 = SORT-EQ6 OR SPACES
                         NEXT SENTENCE
                     ELSE
                         GO TO SORT-MAIN
                   ELSE
                       GO TO SORT-MAIN
                 ELSE
                     GO TO SORT-MAIN
               ELSE
                   GO TO SORT-MAIN
             ELSE
                 GO TO SORT-MAIN
           ELSE
               GO TO SORT-MAIN.

           MOVE HC-STRT-DATE-YY TO S-YY-SORT.
           MOVE HC-STRT-DATE-MM TO S-MM-SORT.
           MOVE HC-STRT-DATE-DD TO S-DD-SORT.
           IF DATE-FLAG = 3
               MOVE HC-STRT-DATE-MM TO S-DD-SORT
               MOVE HC-STRT-DATE-DD TO S-MM-SORT.
           MOVE HC-STRT-TIME    TO S-TIME-SORT.
           MOVE HC-END-DATE-YY  TO E-YY-SORT.
           MOVE HC-END-DATE-MM  TO E-MM-SORT.
           MOVE HC-END-DATE-DD  TO E-DD-SORT.
           IF DATE-FLAG = 3
               MOVE HC-END-DATE-MM  TO E-DD-SORT
               MOVE HC-END-DATE-DD  TO E-MM-SORT.
           MOVE HC-END-TIME     TO E-TIME-SORT.
           MOVE HC-REMARKS      TO REM-SORT.
           RELEASE SORT-REC.
           GO TO SORT-MAIN.

       SORT-M-EXIT.    EXIT.

       SORT-CLEAR.
           ADD 1               TO ACT-KEY.
           MOVE SPACES         TO SORT-REC.
           READ EQP-HOT-CODE-SEQ INTO HOT-CODE-DATA
               AT END GO TO SORT-C-EXIT.
           IF FILE-STAT NOT = "00"
               DISPLAY "READ EQP-HOT-CODE-SEQ ERR:  " FILE-STAT
               GO TO SORT-C-EXIT.

           MOVE HC-EQUIP-NUM   TO EQP-NUM-SORT.
           IF EQ1 = SORT-EQ1 OR SPACES
             IF EQ2 = SORT-EQ2 OR SPACES
               IF EQ3 = SORT-EQ3 OR SPACES
                 IF EQ4 = SORT-EQ4 OR SPACES
                   IF EQ5 = SORT-EQ5 OR SPACES
                     IF EQ6 = SORT-EQ6 OR SPACES
                         NEXT SENTENCE
                     ELSE
                         GO TO SORT-CLEAR
                   ELSE
                       GO TO SORT-CLEAR
                 ELSE
                     GO TO SORT-CLEAR
               ELSE
                   GO TO SORT-CLEAR
             ELSE
                 GO TO SORT-CLEAR
           ELSE
               GO TO SORT-CLEAR.


           MOVE HC-STRT-DATE-YY TO S-YY-SORT.
           MOVE HC-STRT-DATE-MM TO S-MM-SORT.
           MOVE HC-STRT-DATE-DD TO S-DD-SORT.
           IF DATE-FLAG = 3
               MOVE HC-STRT-DATE-MM TO S-DD-SORT
               MOVE HC-STRT-DATE-DD TO S-MM-SORT.
           MOVE HC-STRT-TIME    TO S-TIME-SORT.
           MOVE HC-END-DATE-YY  TO E-YY-SORT.
           MOVE HC-END-DATE-MM  TO E-MM-SORT.
           MOVE HC-END-DATE-DD  TO E-DD-SORT.
           IF DATE-FLAG = 3
               MOVE HC-END-DATE-MM  TO E-DD-SORT
               MOVE HC-END-DATE-DD  TO E-MM-SORT.
           MOVE HC-END-TIME     TO E-TIME-SORT.
           MOVE HC-REMARKS      TO REM-SORT.
           RELEASE SORT-REC.
           GO TO SORT-CLEAR.

       SORT-C-EXIT.    EXIT.

       SORT-IP-EXIT.    EXIT.

       SORT-WRITE-FILE SECTION 03.
           MOVE 0              TO ACT-KEY.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-WF-MAIN THRU SORT-WF-EXIT.
           CLOSE               OUT-FILE.
           GO TO SORT-EXIT.

       SORT-WF-MAIN.
           RETURN SORT-FILE AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO SORT-WF-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC.
           IF FILE-STAT NOT = "00"
               DISPLAY "WRITE OUT-FILE ERR:  " FILE-STAT
               GO TO SORT-WF-EXIT.
           GO TO SORT-WF-MAIN.

       SORT-WF-EXIT.   EXIT.

       SORT-EXIT.    EXIT.

