       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THCDEL.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-HOT-CODE
                  ASSIGN TO DATABASE-MCFLMM2002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT EQP-EQUIPMENT
                  ASSIGN TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZHOTCODE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-HOT-CODE
           LABEL RECORDS ARE STANDARD.
       01  HC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2002.

       FD  EQP-EQUIPMENT
           LABEL RECORDS ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  DATA-SW                 PIC 9        VALUE 0.
       77  FIELD-NUMBER            PIC S9(4)    VALUE 1    COMP-4.
       77  TRUE-VAL  VALUE B"1"    PIC 1.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "THCDEL  ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "ALLOWS DELETIONS OF HOT-CODE RECORDS FROM THE MMIS HOT CODE ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "FILE FOR WORKORDER QUEUE FACTOR CALCULATIONS.               ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM THE f3 KEY OF THE MMIS HOT CODE MAINTENANCE MENU. ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  EQP-NUM                PIC X(06).
           05  S-DATE.
               10  S-MM               PIC XX.
               10  S-DD               PIC XX.
               10  S-YY               PIC XX.
           05  S-TIME.
               10  S-HH               PIC XX.
               10  S-MN               PIC XX.
           05  E-DATE.
               10  E-MM               PIC XX.
               10  E-DD               PIC XX.
               10  E-YY               PIC XX.
           05  E-TIME.
               10  E-HH               PIC XX.
               10  E-MN               PIC XX.
           05  REM                    PIC X(30).
           05  MSG-LINE               PIC X(70).
           05  CMDMSG                 PIC X(79).
           05  ERRMSG                 PIC X(79).

           COPY SCREENIO         IN COPYLIB.

           COPY CATREAD          IN COPYLIB.

       01  HOT-CODE-DATA.
           COPY DHOTCODE         IN COPYLIB.

       01  EQP-EQUIP-DATA.
           COPY MEQPFILE         IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS         IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.

       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "Y"
               GO TO BEGIN-PROC.
           GOBACK.

       BEGIN-PROC.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-EQUIPMENT.
           OPEN I-O            EQP-HOT-CODE.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE "VHCDELETE"    TO SCREEN-NAME.

       6-MAIN.
           MOVE 0              TO DATA-SW.
           MOVE SPACES         TO SCREEN-DATA.

       61-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 12
               GO TO 6-MAIN.

           IF KEY-HIT NOT = 0
               GO TO 61-SHOWFORM.

           IF DATA-SW = 1
               GO TO 62-UPDATE.

           IF EQP-NUM = SPACES
               GO TO 61-SHOWFORM.

           MOVE EQP-NUM        TO EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT  INTO EQP-EQUIP-DATA.
           IF FILE-STAT NOT = "00"
               MOVE 35004      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (1) IND (99)
               GO TO 61-SHOWFORM.

           MOVE EQP-NUM        TO EQPNUM OF EQP-HOT-CODE.
           READ EQP-HOT-CODE   INTO HOT-CODE-DATA.
           IF FILE-STAT NOT = "00"
               MOVE 31040      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (1) IND (99)
               GO TO 61-SHOWFORM.

           MOVE HC-STRT-DATE-YY TO S-YY.
           MOVE HC-STRT-DATE-MM TO S-MM.
           MOVE HC-STRT-DATE-DD TO S-DD.
           IF DATE-FLAG = 3
               MOVE HC-STRT-DATE-MM TO S-DD
               MOVE HC-STRT-DATE-DD TO S-MM.
           MOVE HC-STRT-TIME    TO S-TIME.
           MOVE HC-END-DATE-YY  TO E-YY.
           MOVE HC-END-DATE-MM  TO E-MM.
           MOVE HC-END-DATE-DD  TO E-DD.
           IF DATE-FLAG = 3
               MOVE HC-END-DATE-MM TO E-DD
               MOVE HC-END-DATE-DD TO E-MM.
           MOVE HC-END-TIME     TO E-TIME.
           MOVE HC-REMARKS      TO REM.

           MOVE 42059           TO CATREAD-MSG-NUMBER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MSG-LINE.
           MOVE 1               TO DATA-SW.
           GO TO 61-SHOWFORM.

       62-UPDATE.
           MOVE 0              TO DATA-SW.
           DELETE EQP-HOT-CODE.
           IF FILE-STAT NOT = "00"
               DISPLAY "  DELETE EQP-HOT-CODE ERROR:  " FILE-STAT
               GO TO 61-SHOWFORM.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               EQP-HOT-CODE.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               DISPLAY-FILE.
           GOBACK.
