       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THCEXEC.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.           **** HOT CODE MAINTENANCE EXECUTIVE PROGRAM
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZHOTCODE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WO-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "THCEXEC ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "PRIMARY MODULE FOR HOT CODE MAINTENANCE PROGRAMS.  ALLOWS".
               10  PROG-DESC-B     PIC X(60) VALUE
           "ENTRY, DELETION, AND MODIFICATIONS OF HOT CODE MACHINES  ".
               10  PROG-FUNCTION   PIC X(60) VALUE
           "FOR WORKORDER QUEUE-FACTOR CALCULATION.                  ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       COPY SCREENIO           IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

      *01  LAST-WO-USED-DATA.  COPY P 4 7 0 0 2 4 IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM 1-HSK.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       1-HSK.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-LAST-NUM-USED.
           MOVE 1              TO DATE-FLAG-SW ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               DISPLAY "UNABLE TO GET LAST-WO-USED DATA."
                       "    FILE-STATUS = " FILE-STAT
               CLOSE           WO-LAST-NUM-USED
               GO TO END-OF-JOB.

           MOVE DATE-FLAG-SW   TO DATE-FLAG.
           CLOSE               WO-LAST-NUM-USED.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       6-MAIN.
           MOVE "VHCEXEC"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 6
               CALL "THCINIT"  USING DBPARAMETERS
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 7
               CALL "THCUPDT"  USING DBPARAMETERS
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 8
               CALL "THCDEL"   USING DBPARAMETERS
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 9
               CALL "CLHCDISP" USING DBPARAMETERS
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
               GO TO 6-MAIN.

