       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THELPSUB.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.            ****THIS IS THE CRAFTSMAN'S FUNCTIONS
      *                        SUB-EXECUTIVE PROGRAM - GENERATES
      *                        AND RUNS SECONDARY MENU
      *                        ****.
      ***************************************************************
      * 05/02/95  JEFF BUNGO
      *       ADDED CALL TO MPLTINFO TO RETRIEVE ST00 KEY FOR THE
      *       STOREROOM PRINTER TO PASS TO THE SUBROUTINE SIRMULT.
      ***************************************************************
      * 11/27/95  BILL ROXBURY
      *       ADDED CALL TO "SPWOQUE" FOR PLANNED WORKORDER BACKLOG
      *       INQUIRY FOR NAPANEE.
      ***************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCFTHELP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT MPLTINFO
                 ASSIGN        TO DATABASE-MCFLCS0501
                 ORGANIZATION  IS INDEXED
                 ACCESS        IS DYNAMIC
                 RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                 FILE STATUS   IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  RETURN-COD          PIC S9(4)  COMP-4 VALUE 0.
       77  FUNCTION-SW         PIC  9(4)         VALUE 0.
       77  RESERVATIONS        PIC  9(4)         VALUE 0.
       77  QUEUE-RECORDS       PIC X(280)        VALUE SPACES.
       77  PLANT-DATA          PIC X(04).
       77  AUTOQ-SW            PIC X             VALUE "Q".
       77  Q1REPT-SW           PIC X             VALUE "N".
       77  MULTISRW-SW         PIC X             VALUE "N".
       77  CRFTWS-SW           PIC X             VALUE "N".
       77  STORES-BASE         PIC X(24) VALUE "  STORES".
       77  MMISA-BASE          PIC X(24) VALUE "  MMISA ".
       77  BASE1               PIC X(10) VALUE "  STORES".
       77  BASE2               PIC X(13) VALUE "  MMISA ".
       77  ERROR-SWITCH        PIC S9(4) COMP-4.
       77  FILE-STATUS         PIC X(2)  VALUE SPACES.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "THELPSUB".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                   "SECONDARY MENU FROM THE CRAFTS".
               10  PROG-DESC-A2    PIC X(30) VALUE
                   "MAN's EXECUTIVE PROGRAM.      ".
               10  PROG-DESC-B1    PIC X(30) VALUE
                   "ALLOWS ALL SECONDARY FUNCTIONS".
               10  PROG-DESC-B2    PIC X(30) VALUE
                   " FROM THE FLOOR.              ".
               10  PROG-FUNCTION1  PIC X(30) VALUE
                   "RUNS FROM THE F6 KEY OF THE EX".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                   "ECUTIVE PRIMARY MENU.         ".
           05  PASSWORD-FLAG       PIC X.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

           COPY ESCNAM2        IN COPYLIB.

           COPY DBSTAT         IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

           COPY STCOM          IN COPYLIB.

           COPY TSHWRDFM       IN COPYLIB.

           COPY MULTSTR        IN COPYLIB.

           COPY TSPLPRT        IN COPYLIB.

           COPY MPLT0          IN COPYLIB.
           COPY MPLTST         IN COPYLIB.

       LINKAGE SECTION.
       01  EXECUTIVE-DATA.
           05  X-WO-NUM        PIC X(10).
           05  X-CC-NUM        PIC X(04).
           05  X-EQUIP-NUM     PIC X(06).
           05  X-PARTS.
               10  PART-1      PIC X(07).
               10  PART-2      PIC X(07).
               10  PART-3      PIC X(07).
               10  PART-4      PIC X(07).
               10  PART-5      PIC X(07).
               10  PART-6      PIC X(07).
               10  PART-7      PIC X(07).
               10  PART-8      PIC X(07).

       01  PLANT-ID            PIC X(04).

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  CNUM-BUFFER.
           05  CNUM-BUF        PIC X(04).
           05  CNAM-BUF        PIC X(16).

       PROCEDURE DIVISION      USING EXECUTIVE-DATA
                               PLANT-ID
                               WO-TRACK-DATA
                               DBPARAMETERS
                               CNUM-BUFFER.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          MPLTINFO.
           CALL "TESCSEQ"      USING ESC-NAME.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.

      *********************************************************
      **  IF JCW `AUTOQSW' IS SET TO BLANK, THE EXECUTIVE    **
      **  WILL RUN THE AUTO-ZONE VERSION (TAUTOQZ) AT THE    **
      **  SELECTION OF `f1'.  IF THE JCW IS SET TO ANY OTHER **
      **  VALUE, THE AUTO-CRAFT VERSION (TAUTOQC) OF `f1'    **
      **  WILL BE EXECUTED.                                  **
      *********************************************************

           IF JCW-AUTOQSW-266 = " "
               NEXT SENTENCE
           ELSE
               MOVE "C"        TO AUTOQ-SW.

           MOVE "N"            TO Q1REPT-SW.
           IF JCW-Q1REPT-302 NOT = " "
               MOVE "Y"        TO Q1REPT-SW.

           MOVE "N"            TO MULTISRW-SW.
           IF JCW-MULTISRW-303 NOT = " "
               MOVE "Y"        TO MULTISRW-SW.

           MOVE "N"            TO CRFTWS-SW.
           IF JCW-CRWKSHT-304 NOT = " "
               MOVE "Y"        TO CRFTWS-SW.

       6-MAIN.
           MOVE "VCFTMENU"     TO SCREEN-NAME.

           MOVE SPACES         TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               IF AUTOQ-SW = "Q"
                   CALL "CLAUTOQZ" USING DBPARAMETERS
                                   FUNCTION-SW
                                   CNUM-BUFFER
                                   QUEUE-RECORDS
                                   RESERVATIONS
                   GO TO 6-MAIN
               ELSE
                   CALL "CLAUTOQC" USING DBPARAMETERS
                                   FUNCTION-SW
                                   CNUM-BUFFER
                                   QUEUE-RECORDS
                                   RESERVATIONS
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 2
               CALL "TMESSAGE" USING DBPARAMETERS
                               CNUM-BUFFER
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 8
               MOVE PLANT-ID   TO DBPARM-PAD
               CALL "TEQRFINQ" USING EXECUTIVE-DATA
                               DBPARAMETERS
               MOVE SPACES     TO X-PARTS
               GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 4
               MOVE PLANT-ID   TO PLANT-DATA
               MOVE 0          TO RETURN-COD
               CALL "TSUBCRWS" USING RETURN-COD
                               STORES-BASE
                               MMISA-BASE
                               STATUS-AREA
                               VIEW-COMAREA
                               LANGUAGE-PARMS
                               EXECUTIVE-DATA
                               PLANT-DATA
                               ESC-NAME
               MOVE "Y"        TO SCREEN-SW
               MOVE SPACES     TO X-PARTS
               GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 5
               CALL "TXINITWO" USING WO-TRACK-DATA
                               DBPARAMETERS
               GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 6
               GO TO INQUIRY-FUNCTION
           ELSE
           IF KEY-HIT = 7
               CALL "SWOIPINQ" USING DBPARAMETERS
               GO TO 6-MAIN
           ELSE
               GO TO 6-MAIN.

       INQUIRY-FUNCTION.
           MOVE "VINQMENU"     TO SCREEN-NAME.
           IF MULTISRW-SW = "Y" AND CRFTWS-SW = "N"
               MOVE "VINQMENU2" TO SCREEN-NAME.
           IF MULTISRW-SW = "N" AND CRFTWS-SW = "Y"
               MOVE "VINQMENU3" TO SCREEN-NAME.
           IF MULTISRW-SW = "Y" AND CRFTWS-SW = "Y"
               MOVE "VINQMENU4" TO SCREEN-NAME.
           MOVE SPACES         TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO 6-MAIN.

           IF KEY-HIT = 1
               IF Q1REPT-SW = "N"
                   CALL "CLOOIPINQ" USING DBPARAMETERS
                   GO TO INQUIRY-FUNCTION
               ELSE
                   MOVE LOW-VALUES TO VIEW-COMAREA
                   CALL "CLQ1INQ" USING DBPARAMETERS
                                  VIEW-COMAREA
                                  CATREAD-PARMS
                   GO TO INQUIRY-FUNCTION
           ELSE
           IF KEY-HIT = 2
               CALL "THISTSUB" USING DBPARAMETERS
               GO TO INQUIRY-FUNCTION
           ELSE
           IF KEY-HIT = 4
               CALL "TCCURRWO" USING DBPARAMETERS
               GO TO INQUIRY-FUNCTION
           ELSE
           IF KEY-HIT = 5
               IF CRFTWS-SW = "Y"
                   MOVE SPACES TO WO-PLANNED-DATA CATREAD-PARMS
                   MOVE LOW-VALUES TO VIEW-COMAREA
                   CALL "TPRINTWS" USING DBPARAMETERS
                                   WO-PLANNED-DATA
                                   ERROR-SWITCH
                                   VIEW-COMAREA
                   GO TO INQUIRY-FUNCTION
               ELSE
                   GO TO INQUIRY-FUNCTION
           ELSE
           IF KEY-HIT = 7
               CALL "SPWOQUE"
           ELSE
           IF KEY-HIT = 8
               CALL "SPMLISTQ" USING DBPARAMETERS
           ELSE
           IF KEY-HIT = 6
             IF MULTISRW-SW = "Y"
               MOVE "ST00" TO PLTINFOKEY OF MPLTINFO-REC
               READ MPLTINFO INTO BUF-MPLTINFO
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               MOVE MPLTINFO-STR-PRT TO SRF-SPOOL-PRT-NO
               CALL "TSPLPRT" USING SP-RET-CODE SP-AREA
               MOVE SP-USERNAME TO SRF-USERNAME
               MOVE PLANT-ID   TO SRF-MPLTINFO-COMPANY
               MOVE SPACES     TO MULTIPLE-STR-DATA
               MOVE "SW6"      TO SCOM-PGM-KEY
               CALL "SIRMULT"  USING BASE1
                               BASE2
                               STATUS-AREA
                               VIEW-COMAREA
                               STORES-COMAREA
                               SRF-COMAREA
                               SRF-SPOOLER-REC
                               LANGUAGE-PARMS
                               MULTIPLE-STR-DATA
                               ESC-NAME,
                               EXECUTIVE-DATA.

           GO TO INQUIRY-FUNCTION.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               MPLTINFO.
           GOBACK.

