       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THISTSUB.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
      *C****************************************************************
      *C  2/10/98  WDR
      *C  CHANGED PROGRAM TO ALLOW SELECTION OF EQUIPMENT GROUPS BY
      *C  PARTIAL EQUIPMENT NUMBER.
      *C****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-ZONE-PRTY
                  ASSIGN       TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZHISTSUB-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-ZONE-PRTY
           LABEL RECORDS       ARE STANDARD.
       01  ZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  EQP-EQUIPMENT
           LABEL RECORDS       ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  SORT-FLAG           PIC 9  VALUE 0.
       77  FILE-STAT           PIC XX.
       77  TRUE-VAL            PIC 1  VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "THISTSUB".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(30) VALUE
                   "SUBROUTINE TO ALLOW INPUT OF E".
               10  PROG-DESC-A     PIC X(30) VALUE
                   "QUIPMENT HISTORY PARAMETERS   ".
               10  PROG-DESC-B     PIC X(60) VALUE
                   "FOR THE PROGRAM TDISHIST.     ".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "RUNS FROM TEQPHIST OR FROM f2 ".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "OF WO INQUIRY OF CF PROGRAM.  ".
           05  PASSWORD-FLAG       PIC X.

       01  SCREEN-DATA.
           05  EQP-INPUT.
               10  EQP-NUM-BUF PIC X(06).
               10  EQP-TYP-BUF PIC X(08).
               10  EQP-ZON-BUF PIC X(04).
               10  EQP-DEP-BUF PIC X(04).
               10  EQP-SUB-BUF PIC X(04).
           05  SORT-SELECT.
               10  FC-SORT-BUF PIC X.
               10  WO-SORT-BUF PIC X.
               10  CD-SORT-BUF PIC X.
           05  PLANNED-SW      PIC X.
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  LINKAGE-DATA.
           05  EQP-NUM-L       PIC X(06).
           05  EQP-TYP-L       PIC X(08).
           05  EQP-ZON-L       PIC X(04).
           05  EQP-DEP-L       PIC X(04).
           05  EQP-SUB-L       PIC X(04).
           05  SORT-SEL.
               10  FC-SORT-L   PIC X.
               10  WO-SORT-L   PIC X.
               10  CD-SORT-L   PIC X.
           05  PLN-SW          PIC X.
           05  CALL-SW         PIC X.

       01  ZONE-ARGUMENT.
           05  Z-ARG           PIC X(4).
           05  FILLER          PIC XX   VALUE "1 ".

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  ZONE-DATA.
           COPY MZONPRTY       IN COPYLIB.

       01  EQP-EQUIP-DATA.
           COPY MEQPFILE       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS.
       CHECK-PASSWORD.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO WRITE-SCREEN.
           GOBACK.

       WRITE-SCREEN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-EQUIPMENT.
           OPEN INPUT          WO-ZONE-PRTY.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE "VEQPHIST"     TO SCREEN-NAME.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       SHOWFORM.
           MOVE 0              TO SORT-FLAG.
           MOVE "N"            TO PLANNED-SW.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           IF EQP-INPUT = SPACES
               GO TO SHOWFORM.

           IF EQP-NUM-BUF = SPACES
               GO TO EDIT-SECONDARY.

      *    MOVE EQP-NUM-BUF    TO EQPNUM OF EQP-EQUIPMENT.
      *    READ EQP-EQUIPMENT  INTO EQP-EQUIP-DATA
      *        INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
      *    IF FILE-STAT NOT = ZEROS
      **********************************************************************
      **    MESSAGE 035/004:
      **  INVALID EQUIPMENT NUMBER
      **********************************************************************
      *        MOVE  35        TO CATREAD-MSG-SET
      *        MOVE   4        TO CATREAD-MSG-NUM
      *        CALL "CCATREAD" USING CATREAD-PARMS
      *        MOVE CATREAD-MSG-TEXT TO ERRMSG
      *        MOVE TRUE-VAL   TO IND(1)  IND(99)
      *        GO TO SHOWFORM.

           MOVE SPACES         TO EQP-TYP-BUF
                                  EQP-ZON-BUF
                                  EQP-DEP-BUF.
           GO TO EDIT-CONTINUED.

       EDIT-SECONDARY.
           MOVE EQP-ZON-BUF    TO Z-ARG.
           MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-ZONE-PRTY.
           READ WO-ZONE-PRTY   INTO ZONE-DATA
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/044:
      ** INVALID ZONE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND(3)  IND(99)
               GO TO SHOWFORM.

       EDIT-CONTINUED.
           IF SORT-SELECT = SPACES
      **********************************************************************
      **    MESSAGE 041/025:
      **  ONE FIELD MUST BE SELECTED
      **********************************************************************
               MOVE  41        TO CATREAD-MSG-SET
               MOVE  25        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND(6)  IND(99)
               GO TO SHOWFORM.

           IF FC-SORT-BUF NOT = SPACE ADD 1 TO SORT-FLAG.
           IF WO-SORT-BUF NOT = SPACE ADD 1 TO SORT-FLAG.
           IF CD-SORT-BUF NOT = SPACE ADD 1 TO SORT-FLAG.

           IF SORT-FLAG > 1
      **********************************************************************
      **    MESSAGE 041/026:
      **  ONLY ONE FIELD MAY BE SELECTED
      **********************************************************************
               MOVE  41        TO CATREAD-MSG-SET
               MOVE  26        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND(6) IND(99)
               GO TO SHOWFORM.

           MOVE SCREEN-DATA    TO LINKAGE-DATA.
           MOVE " "            TO CALL-SW.
           IF PLANNED-SW NOT = "N" MOVE "Y" TO PLANNED-SW.

           CALL "CLEQPHIST"    USING DBPARAMETERS
                               LINKAGE-DATA.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
               GO TO WRITE-SCREEN.

       END-OF-JOB.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               WO-ZONE-PRTY.
           CLOSE               DISPLAY-FILE.
           GOBACK.

