       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THISTORY.
       AUTHOR.                 R L ENSMINGER.
       INSTALLATION.           GTR.
       DATE-COMPILED.
      *C
      *C 09/17/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.  NO
      *C   CENTURIES ARE WRITTEN TO THE HISTORY FILE
      *C   TO BE SENT TO THE MAINFRAME.
      *C
      *C 10/15/96  WL   MCINTYRE
      *C   USE REFERENCE MODIFICATION TO MOVE 6-BYTE DATE FROM LABOR
      *C   AND MATERIAL DATABASE FILE TO HISTORY FILE.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          C01              IS NEW-PAGE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT HISTORY
                  ASSIGN TO DISK-MCFPMMHIST
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

           SELECT MATERIAL
                  ASSIGN TO DATABASE-MCFLMM1201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT LABOR
                  ASSIGN TO DATABASE-MCFLMM1301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE
                  ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  HISTORY
           LABEL RECORDS ARE STANDARD.
       01  HREC                PIC X(80).

       FD  MATERIAL
           LABEL RECORDS ARE STANDARD.
       01  MREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       FD  LABOR
           LABEL RECORDS ARE STANDARD.
       01  LREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC           PIC X(80).

       WORKING-STORAGE SECTION.
       77  FILE-STATUS         PIC XX.
       77  ERROR-DATA          PIC X(40).
       77  STOP-READ           PIC X.
       77  S-WONUM             PIC X(10).
       77  S1                  PIC 9.

       01  COUNTS.
           05 V-COUNT          PIC 9(4).
           05 P-COUNT          PIC 9(4).
           05 M-COUNT          PIC 9(4).
           05 L-COUNT          PIC 9(4).
           05 R-COUNT          PIC 9(6).

       01  COST1.
           05 C1               PIC S9(12)V9(4).

       01  COST2.
           05 C2               PIC S9(14)V9(2).

       01  CDATE.
           05 YY               PIC 99.
           05 MM               PIC 99.
           05 DD               PIC 99.

       01  CTIME.
           05 HH               PIC 99.
           05 MN               PIC 99.
           05 FILLER           PIC X(4).

       01  FIRST-REC.
           05 REC-ID           PIC X(3).
           05 REC-INDICATOR    PIC X.
           05 REC-ORDER        PIC 9(3).
           05 REC-COUNT        PIC 9(6).
           05 REC-SEQUENCE     PIC 9(4).
           05 FILLER           PIC X(12).
           05 REC-SENT-FLAG    PIC 9.
           05 REC-CREATION     PIC X(10).
           05 REC-VERBAL       PIC 9(4).
           05 REC-PLANNED      PIC 9(4).
           05 REC-MATERIAL     PIC 9(4).
           05 REC-LABOR        PIC 9(4).
           05 REC-TYPE         PIC 99.
           05 FILLER           PIC X(22).

       01  H-RECORD.
           05 H-REC OCCURS 9 TIMES PIC X(73).

       01  V-RECORD REDEFINES H-RECORD.
           05 V-WONUM          PIC X(10).
           05 V-WOSTATUS       PIC X(2).
           05 V-DATERECD       PIC X(6).
           05 V-TIMERECD       PIC X(4).
           05 V-EQPNUM         PIC X(6).
           05 V-EQPNAME        PIC X(50).
           05 V-EQPTYPE        PIC X(8).
           05 V-EQPDEPT        PIC X(4).
           05 V-ZONE           PIC X(4).
           05 V-EQPLOC         PIC X(8).
           05 V-PRTY           PIC X.
           05 V-EQPDOWN        PIC X.
           05 V-EXPCLASS       PIC X(8).
           05 V-DESCRIPT1      PIC X(30).
           05 V-DESCRIPT2      PIC X(132).
           05 V-TYPENUM-DESC   PIC X(34).
           05 V-STRTSTATUS     PIC X(2).
           05 V-CRAFTREQD1     PIC X(2).
           05 V-CRAFTREQD2     PIC X(2).
           05 V-CRAFTREQD3     PIC X(2).
           05 V-CRAFTSMEN1     PIC X(4).
           05 V-CRAFTSMEN2     PIC X(4).
           05 V-CRAFTSMEN3     PIC X(4).
           05 V-DATESTRT       PIC X(6).
           05 V-TIMESTRT       PIC X(4).
           05 V-FAILCODE       PIC X(6).
           05 V-DATECOMP       PIC X(6).
           05 V-TIMECOMP       PIC X(4).

       01  P-RECORD REDEFINES H-RECORD.
           05 P-WONUM          PIC X(10).
           05 P-WOSTATUS       PIC X(2).
           05 P-DATERECD       PIC X(6).
           05 P-TIMERECD       PIC X(4).
           05 P-APPRVLCOD      PIC X.
           05 P-REQUESTER      PIC X(16).
           05 P-EQPNUM         PIC X(6).
           05 P-EQPNAME        PIC X(50).
           05 P-EQPTYPE        PIC X(8).
           05 P-EQPDEPT        PIC X(4).
           05 P-ZONE           PIC X(4).
           05 P-PRTY           PIC X.
           05 P-EQPLOC         PIC X(8).
           05 P-EQPDOWN        PIC X.
           05 P-EXPCLASS       PIC X(8).
           05 P-RIME           PIC X(2).
           05 P-DATEREQD       PIC X(6).
           05 P-TIMEREQD       PIC X(4).
           05 P-DESCRIPT1      PIC X(30).
           05 P-DESCRIPT2      PIC X(132).
           05 P-DESCRIPT3      PIC X(98).
           05 P-TYPENUM-DESC   PIC X(34).
           05 P-ENGINEER       PIC X(4).
           05 P-ENGRIND        PIC X.
           05 P-PLANNER        PIC X(4).
           05 P-PLNRIND        PIC X.
           05 P-SCHEDULER      PIC X(4).
           05 P-SCHDIND        PIC X.
           05 P-DATESCHD       PIC X(6).
           05 P-TIMESCHD       PIC X(4).
           05 P-BUDGETNO       PIC X(14).
           05 P-REQUESTNO      PIC X(12).
           05 P-DATESTRT       PIC X(6).
           05 P-TIMESTRT       PIC X(4).
           05 P-FAILCODE       PIC X(6).
           05 P-DATECOMP       PIC X(6).
           05 P-TIMECOMP       PIC X(4).
           05 P-STRTSTATUS     PIC X(2).
           05 P-LASTSUFFIX     PIC X(4).

       01  M-RECORD REDEFINES H-RECORD.
           05 M-WONUM          PIC X(10).
           05 M-PRTESTQTY      PIC X(8).
           05 M-PRTNUMBER      PIC X(8).
           05 M-PRTUNITCST     PIC 9(13)V9(4).
           05 M-PRTESTCST      PIC 9(15)V9(2).
           05 M-PRTACTQTY      PIC X(8).
           05 M-PRTACTCST      PIC 9(15)V9(2).
           05 M-PRTDESC1       PIC X(50).
           05 M-PRTDATE        PIC X(6).
           05 M-PRTUM          PIC X(2).
           05 M-PRTREQNO       PIC X(6).
           05 M-PRTPONO        PIC X(10).
           05 M-PRTCCNUM       PIC X(4).
           05 M-PRTSTATUS      PIC X(2).

       01  L-RECORD REDEFINES H-RECORD.
           05 L-WONUM          PIC X(10).
           05 L-LBRCCNUM       PIC X(4).
           05 L-LBRNAME        PIC X(16).
           05 L-LBRCRAFT       PIC X(2).
           05 L-LBRHOURS       PIC X(4).
           05 L-LBRSHIFT       PIC X(2).
           05 L-LBRCREW        PIC X(2).
           05 L-LBRCOST        PIC X(12).
           05 L-LBRSTDATE      PIC X(6).
           05 L-LBRSTTIME      PIC X(4).
           05 L-LBRCPDATE      PIC X(6).
           05 L-LBRCPTIME      PIC X(4).

       01  T-BUDGETNO.
           05 B1               PIC XXX.
           05 FILLER           PIC X.
           05 B2               PIC XX.
           05 FILLER           PIC X.
           05 B3               PIC XX.
           05 FILLER           PIC X.
           05 B4               PIC XXX.
           05 FILLER           PIC X.
           05 B5               PIC XX.

       01  ZONE-PRTY-BUF.
           05 ZONE-BUF         PIC X(4).
           05 PRTY-BUF         PIC X(2).

       01  WO-VERBAL.          COPY DWOBASIC OF COPYLIB.

       01  WO-PLANNED.         COPY DWOPLAN  OF COPYLIB.

       LINKAGE SECTION.
       01  RECORD-TYPE         PIC X.
       01  WO-DATA             PIC X(850).
       01  PLANT               PIC X(4).
       01  SEQ                 PIC X(4).

       PROCEDURE DIVISION USING RECORD-TYPE
                                WO-DATA
                                PLANT
                                SEQ.
       INIT-PAR.
           IF RECORD-TYPE = "V"
             PERFORM WRITE-VERBAL
           ELSE
           IF RECORD-TYPE = "P"
             PERFORM WRITE-PLANNED
           ELSE
           IF RECORD-TYPE = "F"
             PERFORM OPEN-PAR
           ELSE
           IF RECORD-TYPE = "L"
             PERFORM END-PAR
           ELSE
             MOVE "THISTORY ERROR: INVALID RECORD TYPE" TO PRINT-REC
             WRITE PRINT-REC   AFTER ADVANCING 3.
           GOBACK.

       OPEN-PAR.
           OPEN OUTPUT         HISTORY.
           OPEN INPUT          MATERIAL.
           OPEN INPUT          LABOR.
           MOVE 0              TO V-COUNT P-COUNT M-COUNT L-COUNT.
           MOVE 1              TO R-COUNT.
           MOVE "BAD"          TO FIRST-REC.
           MOVE SEQ            TO REC-SEQUENCE.

           WRITE HREC          FROM FIRST-REC.
           IF FILE-STATUS NOT = "00"
             MOVE " ON ADD TO HISTORY FILE" TO ERROR-DATA
             PERFORM ERROR-ROUTINE
             STOP RUN.

           MOVE PLANT          TO REC-ID.

       END-PAR.
           MOVE SPACES         TO HREC.
           WRITE HREC.
           IF FILE-STATUS NOT = "00"
             MOVE " ON WRITE TO HISTORY FILE" TO ERROR-DATA
             PERFORM ERROR-ROUTINE
             STOP RUN.

           CLOSE               HISTORY.

           MOVE SPACES         TO FIRST-REC.
           MOVE PLANT          TO REC-ID.
           MOVE "I"            TO REC-INDICATOR.
           MOVE 1              TO REC-ORDER.
           MOVE R-COUNT        TO REC-COUNT.
           MOVE SEQ            TO REC-SEQUENCE.
           MOVE 0              TO REC-SENT-FLAG.
           ACCEPT CDATE        FROM DATE.
           ACCEPT CTIME        FROM TIME.
           STRING YY MM DD HH MN DELIMITED BY SIZE INTO REC-CREATION.
           MOVE V-COUNT        TO REC-VERBAL.
           MOVE P-COUNT        TO REC-PLANNED.
           MOVE M-COUNT        TO REC-MATERIAL.
           MOVE L-COUNT        TO REC-LABOR.
           MOVE 1              TO REC-TYPE.
           OPEN OUTPUT         PRINT-FILE.

           MOVE SPACES         TO PRINT-REC.
           STRING "      TOTAL RECORDS IN HISTORY FILE " R-COUNT
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 4.
           MOVE SPACES         TO PRINT-REC.
           STRING "      VERBAL  WORK ORDER RECORDS    " V-COUNT
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE               PRINT-REC.
           MOVE SPACES         TO PRINT-REC.
           STRING "      PLANNED WORK ORDER RECORDS    " P-COUNT
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE               PRINT-REC.
           MOVE SPACES         TO PRINT-REC.
           STRING "                MATERIAL RECORDS    " M-COUNT
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE               PRINT-REC.
           MOVE SPACES         TO PRINT-REC.
           STRING "                   LABOR RECORDS    " L-COUNT
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE               PRINT-REC.

           OPEN I-O            HISTORY.

           READ                HISTORY.
           IF FILE-STATUS NOT = "00"
             MOVE " ON READ OF HISTORY FILE" TO ERROR-DATA
             PERFORM ERROR-ROUTINE
             STOP RUN.

           REWRITE HREC        FROM FIRST-REC.
           IF FILE-STATUS NOT = "00"
             MOVE " ON MODIFY OF HISTORY FILE" TO ERROR-DATA
             PERFORM ERROR-ROUTINE
             STOP RUN.

           CLOSE               HISTORY.
           CLOSE               MATERIAL.
           CLOSE               LABOR.
           CLOSE               PRINT-FILE.

       ERROR-ROUTINE.
           MOVE SPACES         TO PRINT-REC.
           STRING "########################################"
                  "########################################"
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING NEW-PAGE.
           MOVE SPACES         TO PRINT-REC.
           STRING "    THISTORY ERROR:  FILE STATUS = "
                               FILE-STATUS ERROR-DATA
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE PRINT-REC.
           MOVE SPACES         TO PRINT-REC.
           STRING "########################################"
                  "########################################"
                               DELIMITED BY SIZE
                               INTO PRINT-REC.
           WRITE PRINT-REC.

       WRITE-VERBAL.
           MOVE WO-DATA        TO WO-VERBAL.
           MOVE SPACES         TO H-RECORD.

           MOVE WO-NUM         TO V-WONUM.
           MOVE WO-STATUS      TO V-WOSTATUS.
           MOVE DATE-RECD      TO V-DATERECD.
           MOVE TIME-RECD      TO V-TIMERECD.
           MOVE EQUIP-NUM      TO V-EQPNUM.
           MOVE EQUIP-NAME     TO V-EQPNAME.
           MOVE TYPE-NUM       TO V-EQPTYPE.
           MOVE DEPT           TO V-EQPDEPT.
           MOVE ZONE-PRIORITY  TO ZONE-PRTY-BUF.
           MOVE ZONE-BUF       TO V-ZONE.
           MOVE PRTY-BUF       TO V-PRTY.
           MOVE LOCATION       TO V-EQPLOC.

           IF EQUIP-DOWN = "Y" AND EQUIP-DOWN-CW = "Y" OR " "
               MOVE "Y"        TO V-EQPDOWN
           ELSE
           IF EQUIP-DOWN = "Y" AND EQUIP-DOWN-CW = "N"
               MOVE "A"        TO V-EQPDOWN
           ELSE
           IF EQUIP-DOWN = "N" AND EQUIP-DOWN-CW = "Y"
               MOVE "B"        TO V-EQPDOWN
           ELSE
               MOVE "N"        TO V-EQPDOWN.

           MOVE EXP-CLASS      TO V-EXPCLASS.
           MOVE DESCRIPTION-1  TO V-DESCRIPT1.
           MOVE DESCRIPTION-2  TO V-DESCRIPT2.
           MOVE SPACES         TO V-TYPENUM-DESC.
           MOVE WO-STRT-STATUS TO V-STRTSTATUS.
           MOVE CRAFTS-REQD-1  TO V-CRAFTREQD1.
           MOVE CRAFTS-REQD-2  TO V-CRAFTREQD2.
           MOVE CRAFTS-REQD-3  TO V-CRAFTREQD3.
           MOVE CRAFTSMEN-1    TO V-CRAFTSMEN1.
           MOVE CRAFTSMEN-2    TO V-CRAFTSMEN2.
           MOVE CRAFTSMEN-3    TO V-CRAFTSMEN3.
           MOVE DATE-STRT      TO V-DATESTRT.
           MOVE TIME-STRT      TO V-TIMESTRT.
           MOVE FAILURE-CODE   TO V-FAILCODE.
           MOVE DATE-COMP      TO V-DATECOMP.
           MOVE TIME-COMP      TO V-TIMECOMP.

           MOVE 0              TO REC-ORDER.
           MOVE 0              TO S1.
           MOVE "B"            TO REC-INDICATOR.
           PERFORM WRITE-HISTORY 5 TIMES.
           ADD 1               TO V-COUNT.
           ADD 5               TO R-COUNT.
           MOVE V-WONUM        TO S-WONUM.

           MOVE V-WONUM        TO WONUM OF MREC.
           START               MATERIAL
            KEY IS = WONUM OF MREC.
           IF FILE-STATUS = "00"
             MOVE 0            TO REC-ORDER
             MOVE "N"          TO STOP-READ
             PERFORM WRITE-MATERIAL THRU WRITE-MATERIAL-EXIT
                               UNTIL STOP-READ = "Y".

           MOVE V-WONUM        TO WONUM OF LREC.
           START               LABOR
            KEY IS = WONUM OF LREC.
           IF FILE-STATUS = "00"
             MOVE 0            TO REC-ORDER
             MOVE "N"          TO STOP-READ
             PERFORM WRITE-LABOR THRU WRITE-LABOR-EXIT
                               UNTIL STOP-READ = "Y".

       WRITE-PLANNED.
           MOVE WO-DATA        TO WO-PLANNED.
           MOVE SPACES         TO H-RECORD.

           MOVE WO-NUM-PLANNED TO P-WONUM.
           MOVE WO-STATUS-P    TO P-WOSTATUS.
           MOVE DATE-RECD-P    TO P-DATERECD.
           MOVE TIME-RECD-P    TO P-TIMERECD.
           MOVE APPROVAL-CODE-P TO P-APPRVLCOD.
           MOVE REQUESTER-P    TO P-REQUESTER.
           MOVE EQUIP-NUM-P    TO P-EQPNUM.
           MOVE EQUIP-NAME-P   TO P-EQPNAME.
           MOVE TYPE-NUM-P     TO P-EQPTYPE.
           MOVE DEPT-P         TO P-EQPDEPT.
           MOVE ZONE-PRIORITY-P TO ZONE-PRTY-BUF.
           MOVE ZONE-BUF       TO P-ZONE.
           MOVE PRTY-BUF       TO P-PRTY.
           MOVE LOCATION-P     TO P-EQPLOC.

           IF EQUIP-DOWN-P = "Y" AND EQUIP-DOWN-CW-P = "Y" OR " "
               MOVE "Y"        TO P-EQPDOWN
           ELSE
           IF EQUIP-DOWN-P = "Y" AND EQUIP-DOWN-CW-P = "N"
               MOVE "A"        TO P-EQPDOWN
           ELSE
           IF EQUIP-DOWN-P = "N" AND EQUIP-DOWN-CW-P = "Y"
               MOVE "B"        TO P-EQPDOWN
           ELSE
               MOVE "N"        TO P-EQPDOWN.

           MOVE EXP-CLASS-P    TO P-EXPCLASS.
           MOVE RIME-P         TO P-RIME.
           MOVE DATE-REQD      TO P-DATEREQD.
           MOVE TIME-REQD      TO P-TIMEREQD.
           MOVE DESCRIPTION-1-P TO P-DESCRIPT1.
           MOVE DESCRIPTION-2-P TO P-DESCRIPT2.
           MOVE DESCRIPTION-3-P TO P-DESCRIPT3.
           MOVE SPACES         TO P-TYPENUM-DESC.
           MOVE ENGINEER-P     TO P-ENGINEER.
           MOVE ENGR-RESP-IND  TO P-ENGRIND.
           MOVE PLANNER-P      TO P-PLANNER.
           MOVE PLNR-RESP-IND  TO P-PLNRIND.
           MOVE SCHEDULER-P    TO P-SCHEDULER.
           MOVE SCHD-RESP-IND  TO P-SCHDIND.
           MOVE DATE-SCHD      TO P-DATESCHD.
           MOVE TIME-SCHD      TO P-TIMESCHD.
           MOVE BUDGET-NO      TO T-BUDGETNO.
           STRING "**" B1 B2 B3 B4 B5
            DELIMITED BY SIZE INTO P-BUDGETNO.
           MOVE REQUEST-NO     TO P-REQUESTNO.
           MOVE DATE-STRT-P    TO P-DATESTRT.
           MOVE TIME-STRT-P    TO P-TIMESTRT.
           MOVE FAILURE-CODE-P TO P-FAILCODE.
           MOVE DATE-COMP-P    TO P-DATECOMP.
           MOVE TIME-COMP-P    TO P-TIMECOMP.
           MOVE WO-START-STATUS TO P-STRTSTATUS.
           MOVE LAST-SUFFIX-INIT TO P-LASTSUFFIX.

           MOVE 0              TO REC-ORDER.
           MOVE 0              TO S1.
           MOVE "P"            TO REC-INDICATOR.
           PERFORM WRITE-HISTORY 9 TIMES.
           ADD 1               TO P-COUNT.
           ADD 9               TO R-COUNT.
           MOVE P-WONUM        TO S-WONUM.

           MOVE P-WONUM        TO WONUM OF MREC.
           START               MATERIAL
            KEY IS = WONUM OF MREC.
           IF FILE-STATUS = "00"
             MOVE 0            TO REC-ORDER
             MOVE "N"          TO STOP-READ
             PERFORM WRITE-MATERIAL THRU WRITE-MATERIAL-EXIT
                               UNTIL STOP-READ = "Y".

           MOVE P-WONUM        TO WONUM OF LREC.
           START               LABOR
            KEY IS = WONUM OF LREC.
           IF FILE-STATUS = "00"
             MOVE 0            TO REC-ORDER
             MOVE "N"          TO STOP-READ
             PERFORM WRITE-LABOR THRU WRITE-LABOR-EXIT
                               UNTIL STOP-READ = "Y".

       WRITE-MATERIAL.
           READ MATERIAL       NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO STOP-READ
             GO TO WRITE-MATERIAL-EXIT.

           IF WONUM OF MREC NOT = S-WONUM
             MOVE "Y"          TO STOP-READ
             GO TO WRITE-MATERIAL-EXIT.

           MOVE SPACES         TO H-RECORD.
           MOVE WONUM OF MREC  TO M-WONUM.
           MOVE PRTESTQTY      TO M-PRTESTQTY.
           MOVE PRTNUMBER      TO M-PRTNUMBER.
           MOVE PRTUNITCST     TO COST1.
           IF C1 NUMERIC
             MOVE C1           TO M-PRTUNITCST.
           MOVE PRTESTCST      TO COST2.
           IF C2 NUMERIC
             MOVE C2           TO M-PRTESTCST.
           MOVE PRTACTQTY      TO M-PRTACTQTY.
           MOVE PRTACTCST      TO COST2.
           IF C2 NUMERIC
             MOVE C2           TO M-PRTACTCST.
           MOVE PRTDESC1       TO M-PRTDESC1.
           MOVE PRTDATE(3:6)   TO M-PRTDATE.
           MOVE PRTUM          TO M-PRTUM.
           MOVE PRTREQNO       TO M-PRTREQNO.
           MOVE PRTPONO        TO M-PRTPONO.
           MOVE PRTCCNUM       TO M-PRTCCNUM.
           MOVE PRTSTATUS      TO M-PRTSTATUS.

           MOVE 0              TO S1.
           MOVE "M"            TO REC-INDICATOR.
           PERFORM WRITE-HISTORY 3 TIMES.
           ADD 1               TO M-COUNT.
           ADD 3               TO R-COUNT.

       WRITE-MATERIAL-EXIT.
           EXIT.

       WRITE-LABOR.
           READ LABOR          NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO STOP-READ
             GO TO WRITE-LABOR-EXIT.

           IF WONUM OF LREC NOT = S-WONUM
             MOVE "Y"          TO STOP-READ
             GO TO WRITE-LABOR-EXIT.

           MOVE SPACES         TO H-RECORD.
           MOVE WONUM OF LREC  TO L-WONUM.
           MOVE LBRCCNUM       TO L-LBRCCNUM.
           MOVE LBRNAME        TO L-LBRNAME.
           MOVE LBRCRAFT       TO L-LBRCRAFT.
           MOVE LBRHOURS       TO L-LBRHOURS.
           MOVE LBRSHIFT       TO L-LBRSHIFT.
           MOVE LBRCREW        TO L-LBRCREW.
           MOVE LBRCOST        TO L-LBRCOST.
           MOVE LBRSTDATE(3:6) TO L-LBRSTDATE.
           MOVE LBRSTTIME      TO L-LBRSTTIME.
           MOVE LBRCPDATE(3:6) TO L-LBRCPDATE.
           MOVE LBRCPTIME      TO L-LBRCPTIME.
           MOVE 0              TO S1.
           MOVE "L"            TO REC-INDICATOR.
           PERFORM WRITE-HISTORY.
           ADD 1               TO L-COUNT.
           ADD 1               TO R-COUNT.

       WRITE-LABOR-EXIT.
           EXIT.

       WRITE-HISTORY.
           MOVE SPACES         TO HREC.
           ADD 1               TO REC-ORDER.
           ADD 1               TO S1.
           STRING REC-ID REC-INDICATOR REC-ORDER H-REC (S1)
            DELIMITED BY SIZE INTO HREC.

           WRITE HREC.
           IF FILE-STATUS NOT = "00"
             MOVE " ON WRITE TO HISTORY FILE" TO ERROR-DATA
             PERFORM ERROR-ROUTINE
             STOP RUN.
