       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TH01HIST.
       AUTHOR.                 J.S. BUNGO.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.
      *
      *   DPOITEM
      *       SHIFT SUB-DETL AND ADDL-DATA IN THE ACCOUNTING DATA
      *       ON BYTE TO THE RIGHT.
      *
      *C 06/12/96   JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       COPY SPECIALN OF COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPOITEM-ST
                  ASSIGN TO DATABASE-MCFLST0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DPOITEM-ST
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-ST-REC.
           COPY DDS-ALL-FORMATS OF MCFLST0401.

       WORKING-STORAGE SECTION.
       77  ACT-KEY             PIC 9(4)  VALUE 0.
       77  BASE                PIC X(24) VALUE SPACES.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  OLD-ITMH-ACCTG-DATA.
           05  OLD-ITMH-SUB       PIC X(3).
           05  OLD-ITMH-SUB-DETL  PIC X(4).
           05  OLD-ITMH-ADDL-DATA PIC X(8).

       COPY DBSTAT             IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

           COPY TBLOWUP        IN COPYLIB.

           COPY DPOITEMH       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            DPOITEM-ST.

       RESET-DPOITEM.
           MOVE LOW-VALUES TO PORCVNO OF DPOITEM-ST.
           START DPOITEM-ST KEY NOT < PORCVNO OF DPOITEM-ST
               INVALID KEY MOVE FILE-STAT TO FILE-STAT
           END-START.
       READ-DPOITEM.
           READ DPOITEM-ST NEXT INTO BUF-DPOITEM-H
               AT END GO TO END-OF-JOB.

           MOVE ITMH-ACCTG-DATA TO OLD-ITMH-ACCTG-DATA.
           MOVE SPACES TO ITMH-ACCTG-DATA.
           MOVE OLD-ITMH-SUB TO ITMH-SUB.
           MOVE OLD-ITMH-SUB-DETL TO ITMH-SUB-DETL.
           MOVE OLD-ITMH-ADDL-DATA TO ITMH-ADDL-DATA.

           REWRITE DPOITEM-ST-REC FROM BUF-DPOITEM-H
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.

           IF FILE-STAT NOT = "00"
               MOVE "REWRITE ERROR, DPOITEM-ST" TO BU-DISPLAY-MSG
               MOVE FILE-STAT TO BU-DISPLAY-FLD (2)
               MOVE ITMH-PO-RCV-NO TO BU-DISPLAY-FLD (3)
               PERFORM 999-BLOWUP.

           GO TO READ-DPOITEM.

       END-OF-JOB.
           CLOSE               DPOITEM-ST.
           GOBACK.

       999-BLOWUP.
           MOVE "THPHIST" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
               VIEW-COMAREA COND-WORD BU-DISPLAY-MSG
               BU-DISPLAY-FLDS.
