       IDENTIFICATION DIVISION.
       PROGRAM-ID.             THUSGVAL.
       AUTHOR.                 ANNETTE TREUDLER.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.           NOV. 1987.
      ***************************************************************
      **   CORPORATE CODE HIGH USAGE INVENTORY VALUATION PROGRAM.  **
      **                                                           **
      **   THIS PROGRAM ALLOWS THE USER TO ENTER HIGH USAGE CODES  **
      **   ALONG WITH THEIR INVENTORY LEVELS AND WILL THEN PRODUCE **
      **   A REPORT SHOWING EACH CODE AND ITS INVENTORY VALUE.     **
      **                                                           **
      ***************************************************************
      **                                                           **
      ** 10/21/1994        CA ZUBEK                                **
      **  ADDED LOGIC TO MOVE ZEROS TO THE INVENTORY QUANTITY      **
      **  OUTPUT FIELD IF NO QUANTITY WAS ENTERED ON THE SCREEN.   **
      **  THIS WILL PREVENT THE PROGRAM FROM BLOWING UP ON A DATA  **
      **  DECIMAL ERROR.                                           **
      **                                                           **
      *C 09/12/96  JEFF BUNGO
      *C  EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C  RECOMPILE TO PICK UP COPYLIB CHANGES.
      ***************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZHUSGVAL-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT MSTORERM
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT HUSGFILE
                  ASSIGN TO DISK-MCFPHUSGVL
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  HUSGFILE
           RECORD CONTAINS 18 CHARACTERS
           DATA RECORD IS HUSG-REC.
       01  HUSG-REC.
           05  HUSG-CODE       PIC X(7).
           05  HUSG-QTY        PIC 9(11).

       WORKING-STORAGE SECTION.
       77  INDX                PIC 9(2)  VALUE 1.
       77  INDY                PIC 9     VALUE 1.
       77  FILE-SW             PIC X     VALUE "N".
           88  FILE-DOES-NOT-EXIST       VALUE "N".
           88  FILE-EXISTS               VALUE "Y".

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  CODE-LOAD-AREA  PIC X(540).
           05  CODE-LOAD-RDF REDEFINES CODE-LOAD-AREA.
               10  CODE-QTY-ROW OCCURS 10 TIMES.
                   15  CODE-QTY-COLUMN      OCCURS  3 TIMES.
                       20  CS-CODE
                               PIC X(7).
                       20  CS-QTY
                               PIC 9(11).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  ROUTE-DATA.
           05  PASSED-RPT-NUM  PIC S9(4) COMP-4.
           05  BASE-PARM       PIC X(12).

           COPY DBSTAT         IN COPYLIB.

       01 MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

           COPY TBLOWUP        IN COPYLIB.

           COPY MSTORERM       IN COPYLIB.

           COPY VCOMLINK       IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-PROC.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          MSTORERM.
           PERFORM MAIN        THRU MAIN-EXIT.
           IF FILE-EXISTS AND KEY-HIT = 2
               PERFORM WRITE-RPT THRU WRITE-RPT-EXIT.

           IF KEY-HIT = 8
               CLOSE           HUSGFILE
               OPEN OUTPUT     HUSGFILE
               CLOSE           HUSGFILE.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               MSTORERM.
           GOBACK.

       MAIN.
           OPEN INPUT          HUSGFILE.
           READ HUSGFILE       AT END
               MOVE FILE-STAT  TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "Y"        TO FILE-SW
               PERFORM DISPLAY-FILE-EXISTS THRU DFE-EXIT
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
               CLOSE           HUSGFILE
               IF KEY-HIT = 1
                   OPEN EXTEND HUSGFILE
               ELSE
               IF KEY-HIT = 8
                   OPEN OUTPUT HUSGFILE
               ELSE
               GO TO MAIN-EXIT
           ELSE
           CLOSE               HUSGFILE
           OPEN OUTPUT         HUSGFILE.

           MOVE 1              TO INDX INDY.
           MOVE "CODETABLE"    TO SCREEN-NAME.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3
               CLOSE           HUSGFILE
               GO TO MAIN-EXIT.

           IF KEY-HIT = 2 AND FILE-DOES-NOT-EXIST
      *    MSG-32016:  FILE DOES NOT EXIST - PRESS RESET AND CONTINUE TO
      *    MSG-32016:  ENTER DATA
               MOVE 32         TO CATREAD-MSG-SET
               MOVE 16         TO CATREAD-MSG-NUM
               PERFORM 99-CATREAD THRU 99-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE B"1"       TO IND(99)
               GO TO SHOWFORM

           IF KEY-HIT = 1 OR 4 OR 5 OR 6 OR 7
               GO TO SHOWFORM.

       EDIT-CHECKS.
           IF CS-CODE (INDX INDY) NOT = SPACES
               MOVE CS-CODE (INDX INDY) TO CORPCDE OF MSTORERM
               READ MSTORERM
               IF FILE-STAT NOT = "00"
                   IF FILE-STAT-1 = "2"
      *    MSG-19009:  STORES CODE DOES NOT EXIST
                       MOVE 19 TO CATREAD-MSG-SET
                       MOVE  9 TO CATREAD-MSG-NUM
                       PERFORM 99-CATREAD THRU 99-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERRMSG
                       PERFORM SET-FIELD-NUMBER THRU SFN-EXIT
                       MOVE B"1" TO IND(99) IND(FIELD-NUMBER)
                       GO TO SHOWFORM
                   ELSE
                       MOVE "DBGET MSTORERM ERROR * EDIT-CHECKS"
                               TO BU-DISPLAY-MSG
                       MOVE CS-CODE (INDX INDY) TO BU-DISPLAY-FLD (1)
                       PERFORM 99-BLOWUP.

           IF INDX < 11
               IF INDY = 3
                   IF INDX NOT = 10
                       ADD  1  TO INDX
                       MOVE 1  TO INDY
                       GO TO EDIT-CHECKS
                   ELSE
                       NEXT SENTENCE
               ELSE
                   ADD  1      TO INDY
                   GO TO EDIT-CHECKS.

           MOVE 1              TO INDX INDY.

       WRITE-CODES.
           IF CS-CODE (INDX INDY) NOT = SPACES
               MOVE CS-CODE (INDX INDY) TO HUSG-CODE

      *--------------------------------------------------------------*
      *  10/21/1994        CA ZUBEK                                  *
      *   ADDED LOGIC TO MOVE ZEROS TO OUTPUT QUANTITY FIELD IF NO   *
      *   VALUE IS ENTERED ON SCREEN.                                *
      *--------------------------------------------------------------*

               IF CS-QTY (INDX INDY) EQUAL SPACES
                   MOVE ZERO TO HUSG-QTY
               ELSE
                   MOVE CS-QTY (INDX INDY)  TO HUSG-QTY
               END-IF

               MOVE "Y"        TO FILE-SW
               WRITE HUSG-REC.

           IF INDX < 10 OR INDX = 10
               IF INDY = 3
                   IF INDX NOT = 10
                       ADD  1  TO INDX
                       MOVE 1  TO INDY
                       GO TO WRITE-CODES
                   ELSE
                       NEXT SENTENCE
               ELSE
                   ADD  1      TO INDY
                   GO TO WRITE-CODES.

           IF KEY-HIT = 0
               MOVE SPACES     TO SCREEN-DATA
               GO TO SHOWFORM.

           CLOSE HUSGFILE.

       MAIN-EXIT.    EXIT.

       SET-FIELD-NUMBER.
           IF INDY = 1
               IF INDX = 1
                   MOVE  1     TO FIELD-NUMBER
               ELSE
               IF INDX = 2
                   MOVE  7     TO FIELD-NUMBER
               ELSE
               IF INDX = 3
                   MOVE 13     TO FIELD-NUMBER
               ELSE
               IF INDX = 4
                   MOVE 19     TO FIELD-NUMBER
               ELSE
               IF INDX = 5
                   MOVE 25     TO FIELD-NUMBER
               ELSE
               IF INDX = 6
                   MOVE 31     TO FIELD-NUMBER
               ELSE
               IF INDX = 7
                   MOVE 37     TO FIELD-NUMBER
               ELSE
               IF INDX = 8
                   MOVE 43     TO FIELD-NUMBER
               ELSE
               IF INDX = 9
                   MOVE 49     TO FIELD-NUMBER
               ELSE
               IF INDX = 10
                   MOVE 55     TO FIELD-NUMBER.

           IF INDY = 2
               IF INDX = 1
                   MOVE  3     TO FIELD-NUMBER
               ELSE
               IF INDX = 2
                   MOVE  9     TO FIELD-NUMBER
               ELSE
               IF INDX = 3
                   MOVE 15     TO FIELD-NUMBER
               ELSE
               IF INDX = 4
                   MOVE 21     TO FIELD-NUMBER
               ELSE
               IF INDX = 5
                   MOVE 27     TO FIELD-NUMBER
               ELSE
               IF INDX = 6
                   MOVE 33     TO FIELD-NUMBER
               ELSE
               IF INDX = 7
                   MOVE 39     TO FIELD-NUMBER
               ELSE
               IF INDX = 8
                   MOVE 45     TO FIELD-NUMBER
               ELSE
               IF INDX = 9
                   MOVE 51     TO FIELD-NUMBER
               ELSE
               IF INDX = 10
                   MOVE 57     TO FIELD-NUMBER.

           IF INDY = 3
               IF INDX = 1
                   MOVE  5     TO FIELD-NUMBER
               ELSE
               IF INDX = 2
                   MOVE 11     TO FIELD-NUMBER
               ELSE
               IF INDX = 3
                   MOVE 17     TO FIELD-NUMBER
               ELSE
               IF INDX = 4
                   MOVE 23     TO FIELD-NUMBER
               ELSE
               IF INDX = 5
                   MOVE 29     TO FIELD-NUMBER
               ELSE
               IF INDX = 6
                   MOVE 35     TO FIELD-NUMBER
               ELSE
               IF INDX = 7
                   MOVE 41     TO FIELD-NUMBER
               ELSE
               IF INDX = 8
                   MOVE 47     TO FIELD-NUMBER
               ELSE
               IF INDX = 9
                   MOVE 53     TO FIELD-NUMBER
               ELSE
               IF INDX = 10
                   MOVE 59     TO FIELD-NUMBER.

       SFN-EXIT.    EXIT.

       DISPLAY-FILE-EXISTS.
           MOVE "FILETHERE"    TO SCREEN-NAME.
           MOVE SPACES         TO MESSAGE-BUFFER.

       SHOWFORM2.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 0 OR 4 OR 5 OR 6 OR 7
               GO TO SHOWFORM2.

       DFE-EXIT.    EXIT.

       WRITE-RPT.
           MOVE SPACES         TO BASE-PARM.
           MOVE 89             TO PASSED-RPT-NUM.

           CALL "SRSCRNS2" USING BASE-PARM
                                 VIEW-COMAREA
                                 LANGUAGE-PARMS
                                 PASSED-RPT-NUM.

       WRITE-RPT-EXIT.    EXIT.

       99-BLOWUP.
           MOVE "THUSGVAL"     TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE-PARM
                                BU-PGM-NAME
                                STATUS-AREA
                                VIEW-COMAREA
                                FILE-STAT
                                BU-DISPLAY-MSG
                                BU-DISPLAY-AREA.
           GO TO END-OF-JOB.

       99-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       99-CATREAD-EXIT.    EXIT.

