       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TIEROPSC.
      *REMARKS.                THIS PROGRAM MODIFIES THE
      *                        OPERATIONS DATASET OF THE
      *                        EQUIPMENT REFERENCE FILE
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZIEQPREF-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT EQP-OPERATIONS
                  ASSIGN TO DATABASE-MCFLER0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS EO-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC              PIC X(2000).

       FD  EQP-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EOREC.
       01  EOREC.
           COPY DDS-ALL-FORMATS OF MCFLER0501.

       WORKING-STORAGE SECTION.
       77  ADD-SW              PIC X(01).
       77  DEL-SW              PIC X(01).
       77  BLOWUP-BASE         PIC X(16).
       77  TRUE-VAL            PIC 1 VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIEROPSC".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(15) VALUE "CHANGE PROGRAM ".
                   15  FILLER      PIC X(15) VALUE "FOR OPERATIONS ".
                   15  FILLER      PIC X(13) VALUE "AND SETTINGS ".
                   15  FILLER      PIC X(17) VALUE "COMMENTS OF THE".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(50) VALUE "REFERENCE FILE ".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F4".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(16) VALUE "REFERENCE RECORD".
                   15  FILLER      PIC X(20) VALUE " CHANGE SCREEN".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STATUSES.
           05  DSPLY-STATUS    PIC XX.
           05  EO-STATUS       PIC XX.

       01  SCREEN-BUFFER.
           05  ACD-DISP                  PIC X(06).
           05  EQP-SUB-BUF.
               10  EQP-KEY-BUF.
                   15  EQP-NUM-BUFFER    PIC X(06).
                   15  SUB-SYS-BUFFER    PIC X(04).
               10  EQP-SUB-DESC          PIC X(40).
           05  REM-VALUES.
               10  REM-1           PIC X(66).
               10  REM-2           PIC X(66).
               10  REM-3           PIC X(66).
               10  REM-4           PIC X(66).
               10  REM-5           PIC X(66).
               10  REM-6           PIC X(66).
               10  REM-7           PIC X(66).
               10  REM-8           PIC X(66).
               10  REM-9           PIC X(66).
               10  REM-10          PIC X(66).
               10  REM-11          PIC X(66).
               10  REM-12          PIC X(66).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).

       01  EQP-OPERS-DATA.
           05  EQP-SUB-KEY.
               10  EQP-SUB-NUMBER  PIC X(06).
               10  SUB-SYS-NUMBER  PIC X(04).
           05  OPERS-12.
               10  EQP-REM-1       PIC X(66).
               10  EQP-REM-2       PIC X(66).
               10  EQP-REM-3       PIC X(66).
               10  EQP-REM-4       PIC X(66).
               10  EQP-REM-5       PIC X(66).
               10  EQP-REM-6       PIC X(66).
               10  EQP-REM-7       PIC X(66).
               10  EQP-REM-8       PIC X(66).
               10  EQP-REM-9       PIC X(66).
               10  EQP-REM-10      PIC X(66).
               10  EQP-REM-11      PIC X(66).
               10  EQP-REM-12      PIC X(66).

       01  MESSAGE-BUFFER.
           05  MESSAGE-LIT1        PIC X(38).
           05  MESSAGE-EQPNUM      PIC X(6).
           05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC X(4).
           05  MESSAGE-LIT3        PIC X(19).

       COPY IOFEEDBACK         IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY CPYIND             IN COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       COPY WSCONTROL          IN COPYLIB.

       COPY DBSTAT    IN COPYLIB.

       LINKAGE SECTION.
       COPY VCOMLINK  IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF         PIC X(06).
           05  SUB-SYS-BUF         PIC X(04).
           05  EQP-SUB-DESC-BUF    PIC X(40).
           05  EQP-TYPE-BUF        PIC X(08).
           05  ACD-FUNCTION        PIC X(06).
           05  ACD-SW              PIC X(01).

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                EQP-SUB-BUFFER.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.

       2-EOJ.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-OPERATIONS.
           GOBACK.

       1-HSK.
           MOVE LOW-VALUES     TO STATUS-AREA.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            EQP-OPERATIONS.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0              TO VIEW-LASTKEY.

       6-MAIN.
           MOVE "FIEROPSC"     TO VIEW-CFNAME.
           MOVE SPACES         TO SCREEN-BUFFER.
           MOVE " "            TO ADD-SW DEL-SW.
           MOVE EQP-NUM-BUF    TO EQP-NUM-BUFFER.
           MOVE SUB-SYS-BUF    TO SUB-SYS-BUFFER.
           MOVE EQP-SUB-DESC-BUF TO EQP-SUB-DESC.
           MOVE ACD-FUNCTION   TO ACD-DISP.

           PERFORM 69-START-EQP-OPERATIONS.
           IF COND-WORD = 17
               MOVE SPACES     TO REM-VALUES
               MOVE 66307      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE 2          TO VIEW-LASTKEY
               GO TO 6-MAIN-LOOP.

       6-MAIN-READ.
           PERFORM 69-READ-EQP-OPERATIONS
           IF COND-WORD = 0
               IF EQP-SUB-KEY = EQP-KEY-BUF
                   MOVE OPERS-12   TO REM-VALUES
                   MOVE 66308      TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE SCREEN-BUFFER  TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98-SCREEN-READ
               ELSE
                   GO TO 6-MAIN
           ELSE
           MOVE SPACES         TO REM-VALUES
           MOVE 66307          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
           MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
           MOVE TRUE-VAL       TO INDS (98)
           MOVE SCREEN-BUFFER  TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE 2              TO VIEW-LASTKEY.

       6-MAIN-LOOP.
           IF VIEW-LASTKEY = 1 OR 2 OR 3 OR 4 GO TO 6-MAIN-EXIT.

           IF VIEW-LASTKEY = 5
               MOVE 0          TO VIEW-LASTKEY
               GO TO 6-MAIN-READ.

           IF VIEW-LASTKEY = 6
               MOVE "X"        TO ADD-SW.

           IF VIEW-LASTKEY = 7
               MOVE "X"        TO DEL-SW.

           MOVE DSPLY-REC      TO SCREEN-BUFFER.
           MOVE EQP-KEY-BUF    TO EQP-SUB-KEY.
           MOVE REM-VALUES     TO OPERS-12.

           IF DEL-SW NOT = " " MOVE SPACES TO OPERS-12.

           IF ADD-SW NOT = " " AND OPERS-12 NOT = SPACES
               PERFORM 69-WRITE-EQP-OPERATIONS
               MOVE SPACES     TO REM-VALUES
               IF COND-WORD = 0
                   MOVE 66296  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
                   MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE TRUE-VAL       TO INDS (98)
                   MOVE SCREEN-BUFFER  TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO REM-VALUES
                   MOVE 0      TO VIEW-LASTKEY
                   GO TO 6-MAIN
               ELSE
               MOVE 66298      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-NUM-BUFFER TO MESSAGE-BUFFER
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER  TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               GO TO 6-MAIN.

           IF OPERS-12 NOT = SPACES
               PERFORM 69-REWRITE-EQP-OPERATIONS
               IF COND-WORD = 17
                   MOVE "ERROR REWRITING OP-SETS" TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               MOVE SPACES     TO REM-VALUES
               MOVE 66306      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-BUFFER  TO DSPLY-REC
               MOVE TRUE-VAL   TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES     TO REM-VALUES
               GO TO 6-MAIN
           ELSE
           MOVE "X"            TO DEL-SW
           PERFORM 69-DELETE-EQP-OPERATIONS
           IF COND-WORD = 17
               MOVE "ERROR DELETING OP-SETS" TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       69-DELETE-EQP-OPERATIONS.
           MOVE 0              TO COND-WORD.
           DELETE EQP-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-OPERATIONS.
           MOVE 0              TO COND-WORD.
           READ EQP-OPERATIONS NEXT INTO EQP-OPERS-DATA
               AT END          MOVE "00"   TO EO-STATUS
                               MOVE SPACES TO EQP-SUB-KEY.
           IF EO-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-EQP-OPERATIONS.
           MOVE 0              TO COND-WORD.
           REWRITE EOREC FROM EQP-OPERS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-EQP-OPERATIONS.
           MOVE 0              TO COND-WORD.
           MOVE EQP-KEY-BUF    TO EQRSUBKEY OF EOREC.
           START EQP-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-EQP-OPERATIONS.
           MOVE 0              TO COND-WORD.
           WRITE EOREC FROM EQP-OPERS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"       TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM   TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0"       TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0"       TO INDICS.

       998-BLOWUP.
           MOVE "TIEROPSC"     TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

