000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TIERDEL2.
000600*REMARKS.  ***  THIS PROGRAM DELETES ALL RECORDS
000700*               OF A GIVEN EQUIPMENT NUMBER FROM
000800*               THE EQUIPMENT REFERENCE FILE
001100*                   ****.
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-OPERATIONS
               ASSIGN TO DATABASE-MCFLER0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS EO-STATUS.
           SELECT EQP-REFERENCE
               ASSIGN TO DATABASE-MCFLER0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS ER-STATUS.
           SELECT EQP-REMARKS
               ASSIGN TO DATABASE-MCFLER0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS ERK-STATUS.
002200 DATA DIVISION.
       FILE SECTION.
       FD  EQP-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EOREC.
       01  EOREC.
           COPY DDS-ALL-FORMATS OF MCFLER0501.
       FD  EQP-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERREC.
       01  ERREC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.
       FD  EQP-REMARKS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERKREC.
       01  ERKREC.
           COPY DDS-ALL-FORMATS OF MCFLER0301.
001800 WORKING-STORAGE SECTION.
       77  DEL-SW                  PIC S9(4) COMP-4.

       01  BLOWUP-BASE             PIC X(16).

003900 01  EQP-SUB-KEY.
004000     05  EQP-EQUIP-NUM       PIC X(06).
004100     05  SUB-SYS-NUM         PIC X(04).
004200
003900 01  EQP-SUB-KEY-0.
004000     05  EQP-EQUIP-NUM-0     PIC X(06).
004100     05  SUB-SYS-NUM-0       PIC X(04).

004300 01  EQP-REF-DATA.
004400     05  EQP-SUB-KEY-REF.
004500         10  EQP-NUM-REF     PIC X(06).
004600         10  SUB-SYS-REF     PIC X(04).
004700     05  EQP-REF-VALUES.
004800         10  EQP-CORP-TYPE   PIC X(08).
004900         10  EQP-MFG         PIC X(16).
005000         10  EQP-MOD         PIC X(16).
005100         10  EQP-SER         PIC X(16).
005200         10  EQP-PROP-NUM    PIC X(08).
005300         10  EQP-NAME-1      PIC X(16).
005400         10  EQP-FIELD-1     PIC X(16).
005500         10  EQP-NAME-2      PIC X(16).
005600         10  EQP-FIELD-2     PIC X(16).
005700         10  EQP-NAME-3      PIC X(16).
005800         10  EQP-FIELD-3     PIC X(16).
005900         10  EQP-NAME-4      PIC X(16).
006000         10  EQP-FIELD-4     PIC X(16).
006100         10  EQP-NAME-5      PIC X(16).
006200         10  EQP-FIELD-5     PIC X(16).
006300         10  EQP-NAME-6      PIC X(16).
006400         10  EQP-FIELD-6     PIC X(16).
006500         10  EQP-NAME-7      PIC X(16).
006600         10  EQP-FIELD-7     PIC X(16).
006700         10  EQP-NAME-8      PIC X(16).
006800         10  EQP-FIELD-8     PIC X(16).
006900
007000 01  EQP-REMARKS-DATA.
007100     05  EQP-SUB-KEY-REM.
007200         10  EQP-NUM-REM     PIC X(06).
007300         10  SUB-SYS-REM     PIC X(04).
007400     05  REMARKS-12.
007500         10  EQP-REM-1       PIC X(66).
007600         10  EQP-REM-2       PIC X(66).
007700         10  EQP-REM-3       PIC X(66).
007800         10  EQP-REM-4       PIC X(66).
007900         10  EQP-REM-5       PIC X(66).
008000         10  EQP-REM-6       PIC X(66).
008100         10  EQP-REM-7       PIC X(66).
008200         10  EQP-REM-8       PIC X(66).
008300         10  EQP-REM-9       PIC X(66).
008400         10  EQP-REM-10      PIC X(66).
008500         10  EQP-REM-11      PIC X(66).
008600         10  EQP-REM-12      PIC X(66).
008700
008800 01  EQP-OPER-DATA.
008900     05  EQP-SUB-KEY-OPS.
009000         10  EQP-NUM-OPS     PIC X(06).
009100         10  SUB-SYS-OPS     PIC X(04).
009200     05  OPS-COR-12.
009300         10  EQP-OPS-1       PIC X(66).
009400         10  EQP-OPS-2       PIC X(66).
009500         10  EQP-OPS-3       PIC X(66).
009600         10  EQP-OPS-4       PIC X(66).
009700         10  EQP-OPS-5       PIC X(66).
009800         10  EQP-OPS-6       PIC X(66).
009900         10  EQP-COR-1       PIC X(66).
010000         10  EQP-COR-2       PIC X(66).
010100         10  EQP-COR-3       PIC X(66).
010200         10  EQP-COR-4       PIC X(66).
010300         10  EQP-COR-5       PIC X(66).
010400         10  EQP-COR-6       PIC X(66).
010500
       01  FILE-STATUSES.
           05  EO-STATUS           PIC XX.
           05  ER-STATUS           PIC XX.
           05  ERK-STATUS          PIC XX.

002100 01  PASSWORD-INFORMATION.
002200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIERDEL2".
002300     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002500     05  PROGRAM-DESCRIPTION.
002600         10  PROG-DESC-A.
                   15  FILLER      PIC X(16) VALUE "ALLOWS DELETION ".
                   15  FILLER      PIC X(15) VALUE "OF ALL RECORDS ".
                   15  FILLER      PIC X(16) VALUE "OF THE SELECTED ".
                   15  FILLER      PIC X(13) VALUE "EQUIPMENT ".
002800         10  PROG-DESC-B.
                   15  FILLER      PIC X(07) VALUE "NUMBER ".
                   15  FILLER      PIC X(16) VALUE "(ALL SUBSYSTEMS ".
                   15  FILLER      PIC X(11) VALUE ") FROM THE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(16) VALUE "REFERENCE FILE ".
003000         10  PROG-FUNCTION.
                   15  FILLER      PIC X(14) VALUE "RUNS FROM THE ".
                   15  FILLER      PIC X(14) VALUE "F2 KEY OF THE ".
                   15  FILLER      PIC X(16) VALUE "REFERENCE RECORD".
                   15  FILLER      PIC X(16) VALUE " DELETE SCREEN  ".
003200     05  PASSWORD-FLAG       PIC X.
003300
012900 COPY DBSTAT   IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.
012600 LINKAGE SECTION.
012700 COPY VCOMLINK IN COPYLIB.
012800 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
013100 01  EQP-SUB-BUFFER.
013200     05  EQP-NUM-BUF         PIC X(06).
013300     05  SUB-SYS-BUF         PIC X(04).
013400     05  EQP-SUB-DESC-BUF    PIC X(40).
013500     05  EQP-TYPE-BUF        PIC X(08).
013600     05  ACD-FUNCTION        PIC X(06).
013700     05  ACD-SW              PIC X(01).
013800
013900 PROCEDURE DIVISION USING VIEW-COMAREA
014000                          DBPARAMETERS
014300                          EQP-SUB-BUFFER.
014400 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.
       2-EOJ.
           CLOSE EQP-OPERATIONS.
           CLOSE EQP-REFERENCE.
           CLOSE EQP-REMARKS.
           GOBACK.
       1-HSK.
015500     MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O    EQP-OPERATIONS.
           OPEN I-O    EQP-REFERENCE.
           OPEN I-O    EQP-REMARKS.
014600     CALL "TPWORD" USING PASSWORD-INFORMATION.
015000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
015600     MOVE EQP-NUM-BUF TO EQP-EQUIP-NUM EQP-EQUIP-NUM-0.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE 0 TO DEL-SW.
           MOVE "0000" TO SUB-SYS-NUM SUB-SYS-NUM-0.
           PERFORM 69-START-EQP-REFERENCE.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-EQP-REFERENCE
           IF COND-WORD = 15
               NEXT SENTENCE
           ELSE
           PERFORM 61-DEL-REM THRU 61-DR-EXIT
                            UNTIL DEL-SW = 1
           PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                            UNTIL DEL-SW = 2.
           MOVE 0 TO DEL-SW.
016000
016100 6-MAIN.
           PERFORM 69-START-EQP-REFERENCE-2.
           IF COND-WORD = 17
               MOVE 3 TO VIEW-LASTKEY
               GO TO 6-MAIN-EXIT.
           PERFORM 69-READ-EQP-REFERENCE.
           IF COND-WORD = 0
               MOVE SUB-SYS-REF TO SUB-SYS-NUM
016700         PERFORM 61-DEL-REM THRU 61-DR-EXIT
016800                          UNTIL DEL-SW = 1
016900         PERFORM 61-DEL-OPS THRU 61-DO-EXIT
017000                           UNTIL DEL-SW = 2
               PERFORM 69-DELETE-EQP-REFERENCE
               MOVE 0 TO DEL-SW
               GO TO 6-MAIN
           ELSE
           MOVE SUB-SYS-REF TO SUB-SYS-NUM
           PERFORM 61-DEL-REM THRU 61-DR-EXIT
                            UNTIL DEL-SW = 1
           PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                            UNTIL DEL-SW = 2
           MOVE 3 TO VIEW-LASTKEY.
020800
       6-MAIN-EXIT.    EXIT.

020900 61-DEL-REM.
           PERFORM 69-START-EQP-REMARKS.
021500     IF COND-WORD = 0
021600         PERFORM 61-GET-REM UNTIL COND-WORD = 15
021800         MOVE 1 TO DEL-SW
021900         GO TO 61-DR-EXIT
022000     ELSE
022200     MOVE 1 TO DEL-SW
022300     GO TO 61-DR-EXIT.
022400
022500 61-GET-REM.
           PERFORM 69-READ-EQP-REMARKS.
022800     IF COND-WORD = 0
022900         PERFORM 69-DELETE-EQP-REMARKS
023000         IF COND-WORD = 17
023500             MOVE "ERROR DETECTED DELETING REMARKS * TIERDEL2 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP.
024500
024600 61-DR-EXIT.    EXIT.
024700
024800 61-DEL-OPS.
           PERFORM 69-START-EQP-OPERATIONS.
025400     IF COND-WORD = 0
025500         PERFORM 61-GET-OPS UNTIL COND-WORD = 15
025700         MOVE 2 TO DEL-SW
025800         GO TO 61-DO-EXIT
025900     ELSE
026100     MOVE 2 TO DEL-SW
026200     GO TO 61-DO-EXIT.
026300
026400 61-GET-OPS.
           PERFORM 69-READ-EQP-OPERATIONS.
026700     IF COND-WORD = 0
026800         PERFORM 69-DELETE-EQP-OPERATIONS
026900         IF COND-WORD = 17
027400             MOVE "ERROR DETECTED DELETING OP-SET * TIERDEL2 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP.
028400
028500 61-DO-EXIT.    EXIT.
031200
       69-DELETE-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           DELETE EQP-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           READ EQP-OPERATIONS NEXT INTO EQP-OPER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-NUM-OPS NOT = EQP-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY TO EQRSUBKEY OF EOREC.
           START EQP-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
029600     DELETE EQP-REFERENCE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.
029700     IF COND-WORD = 17
               MOVE "ERROR DETECTED DELETING REF. RECORD * TIERDEL2 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.

       69-START-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY-0 TO EQRSUBKEY OF ERREC.
           START EQP-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-EQP-REFERENCE-2.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY-0 TO EQRSUBKEY OF ERREC.
           START EQP-REFERENCE KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           READ EQP-REFERENCE NEXT INTO EQP-REF-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-NUM-REF NOT = EQP-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-DELETE-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
           DELETE EQP-REMARKS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
022600     READ EQP-REMARKS NEXT INTO EQP-REMARKS-DATA
022700         AT END    MOVE 15 TO COND-WORD.
           IF EQP-NUM-REM NOT = EQP-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY TO EQRSUBKEY OF ERKREC.
           START EQP-REMARKS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 17 TO COND-WORD.

076200 998-BLOWUP.
076300     MOVE "TIERDEL2" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
