000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TIERDEL4.
000600*REMARKS.  ***  THIS PROGRAM ALLOWS MASS CHANGES OF
000700*               ALL RECORDS OF SOME EQUIPMENT NUMBER
000800*               TO A NEW EQUIPMENT NUMBER IN THE
000900*               EQUIPMENT REFERENCE FILE.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.    AS400.
001600 OBJECT-COMPUTER.    AS400.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-OPERATIONS
               ASSIGN TO DATABASE-MCFLER0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS EO-STATUS.
           SELECT EQP-REFERENCE
               ASSIGN TO DATABASE-MCFLER0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS ER-STATUS.
           SELECT EQP-REMARKS
               ASSIGN TO DATABASE-MCFLER0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS ERK-STATUS.
002200 DATA DIVISION.
       FILE SECTION.
       FD  EQP-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EOREC.
       01  EOREC.
           COPY DDS-ALL-FORMATS OF MCFLER0501.
       FD  EQP-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERREC.
       01  ERREC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.
       FD  EQP-REMARKS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERKREC.
       01  ERKREC.
           COPY DDS-ALL-FORMATS OF MCFLER0301.
001900 WORKING-STORAGE SECTION.
002000 77  DEL-SW                  PIC S9(4)  COMP-4.

       01  BLOWUP-BASE             PIC X(16).

009400 01  EQP-OPER-DATA.
009500     05  EQP-SUB-KEY-OPS.
009600         10  EQP-SUB-OPS     PIC X(06).
009700         10  SUB-SYS-OPS     PIC X(04).
009800     05  OPS-COR-12.
009900         10  EQP-OPS-1       PIC X(66).
010000         10  EQP-OPS-2       PIC X(66).
010100         10  EQP-OPS-3       PIC X(66).
010200         10  EQP-OPS-4       PIC X(66).
010300         10  EQP-OPS-5       PIC X(66).
010400         10  EQP-OPS-6       PIC X(66).
010500         10  EQP-COR-1       PIC X(66).
010600         10  EQP-COR-2       PIC X(66).
010700         10  EQP-COR-3       PIC X(66).
010800         10  EQP-COR-4       PIC X(66).
010900         10  EQP-COR-5       PIC X(66).
011000         10  EQP-COR-6       PIC X(66).
011100
004900 01  EQP-REF-DATA.
005000     05  EQP-SUB-KEY-REF.
005100         10  EQP-NUM-REF     PIC X(06).
005200         10  SUB-SYS-REF     PIC X(04).
005300     05  EQP-REF-VALUES.
005400         10  EQP-CORP-TYPE   PIC X(08).
005500         10  EQP-MFG         PIC X(16).
005600         10  EQP-MOD         PIC X(16).
005700         10  EQP-SER         PIC X(16).
005800         10  EQP-PROP-NUM    PIC X(08).
005900         10  EQP-NAME-1      PIC X(16).
006000         10  EQP-FIELD-1     PIC X(16).
006100         10  EQP-NAME-2      PIC X(16).
006200         10  EQP-FIELD-2     PIC X(16).
006300         10  EQP-NAME-3      PIC X(16).
006400         10  EQP-FIELD-3     PIC X(16).
006500         10  EQP-NAME-4      PIC X(16).
006600         10  EQP-FIELD-4     PIC X(16).
006700         10  EQP-NAME-5      PIC X(16).
006800         10  EQP-FIELD-5     PIC X(16).
006900         10  EQP-NAME-6      PIC X(16).
007000         10  EQP-FIELD-6     PIC X(16).
007100         10  EQP-NAME-7      PIC X(16).
007200         10  EQP-FIELD-7     PIC X(16).
007300         10  EQP-NAME-8      PIC X(16).
007400         10  EQP-FIELD-8     PIC X(16).
007500
007600 01  EQP-REMARKS-DATA.
007700     05  EQP-SUB-KEY-REM.
007800         10  EQP-SUB-REM     PIC X(06).
007900         10  SUB-SYS-REM     PIC X(04).
008000     05  REMARKS-12.
008100         10  EQP-REM-1       PIC X(66).
008200         10  EQP-REM-2       PIC X(66).
008300         10  EQP-REM-3       PIC X(66).
008400         10  EQP-REM-4       PIC X(66).
008500         10  EQP-REM-5       PIC X(66).
008600         10  EQP-REM-6       PIC X(66).
008700         10  EQP-REM-7       PIC X(66).
008800         10  EQP-REM-8       PIC X(66).
008900         10  EQP-REM-9       PIC X(66).
009000         10  EQP-REM-10      PIC X(66).
009100         10  EQP-REM-11      PIC X(66).
009200         10  EQP-REM-12      PIC X(66).
009300
004500 01  EQP-SUB-KEY-0.
004600     05  EQP-EQUIP-NUM-0     PIC X(06).
004700     05  SUB-SYS-NUM-0       PIC X(04).
004800
004500 01  EQP-SUB-KEY.
004600     05  EQP-EQUIP-NUM       PIC X(06).
004700     05  SUB-SYS-NUM         PIC X(04).
004800
       01  FILE-STATUSES.
           05  EO-STATUS           PIC XX.
           05  ER-STATUS           PIC XX.
           05  ERK-STATUS          PIC XX.

002200 01  PASSWORD-INFORMATION.
002300     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIERDEL4".
002400     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002500     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002600     05  PROGRAM-DESCRIPTION.
002700         10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "ALLOWS MASS ".
                   15  FILLER      PIC X(15) VALUE "CHANGES OF ALL ".
                   15  FILLLER     PIC X(15) VALUE "RECORDS OF ONE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(08) VALUE "NUMBER ".
002900         10  PROG-DESC-B.
                   15  FILLER      PIC X(11) VALUE "TO ANOTHER ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(14) VALUE "NUMBER IN THE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(15) VALUE "REFERENCE FILE ".
003100         10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F4".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(16) VALUE "REFERENCE RECORD".
                   15  FILLER      PIC X(16) VALUE " DELETE SCREEN ".
003300     05  PASSWORD-FLAG       PIC X.
003400
014300 COPY DBSTAT   IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.
014000 LINKAGE SECTION.
014100 COPY VCOMLINK IN COPYLIB.
014200 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
014500 01  EQP-SUB-BUFFER.
014600     05  EQP-NUM-BUF         PIC X(06).
014700     05  SUB-SYS-BUF         PIC X(04).
014800     05  EQP-SUB-DESC-BUF    PIC X(40).
014900     05  EQP-TYPE-BUF        PIC X(08).
015000     05  ACD-FUNCTION        PIC X(06).
015100     05  ACD-SW              PIC X(01).
015200 01  EQUIP-BUFFER.
015300     05  EQUIP-NUMBER        PIC X(06).
015400 PROCEDURE DIVISION USING VIEW-COMAREA,
015500                          DBPARAMETERS,
015800                          EQP-SUB-BUFFER,
015900                          EQUIP-BUFFER.
016000 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE EQP-OPERATIONS.
           CLOSE EQP-REFERENCE.
           CLOSE EQP-REMARKS.
           GOBACK.
       1-HSK.
017100     MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   EQP-OPERATIONS.
           OPEN I-O   EQP-REFERENCE.
           OPEN I-O   EQP-REMARKS.
016200     CALL "TPWORD" USING PASSWORD-INFORMATION.
016600     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
017200     MOVE EQP-NUM-BUF TO EQP-EQUIP-NUM EQP-EQUIP-NUM-0.
017300     MOVE 0 TO VIEW-LASTKEY.
           MOVE 0 TO DEL-SW.
           MOVE "0000" TO SUB-SYS-NUM SUB-SYS-NUM-0.
           PERFORM 69-START-EQP-REFERENCE-0.
           IF COND-WORD = 17
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
           ELSE
           PERFORM 69-READ-EQP-REFERENCE
           IF COND-WORD = 15
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
           ELSE
           PERFORM 69-DELETE-EQP-REFERENCE
           IF COND-WORD = 17
               MOVE "DELETE OF REF. RECORD FAILED * TIERDEL4 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP
           ELSE
           MOVE EQUIP-NUMBER TO EQP-NUM-REF
           PERFORM 69-WRITE-EQP-REFERENCE
           IF COND-WORD = 17
               MOVE "ERROR TRYING TO WRITE REF. RECORD * TIERDEL4 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           MOVE 0 TO DEL-SW.
017600
017700 6-MAIN.
           PERFORM 69-START-EQP-REFERENCE.
018000     IF COND-WORD = 17
                MOVE 3 TO VIEW-LASTKEY
                GO TO 6-MAIN-EXIT.
           PERFORM 69-READ-EQP-REFERENCE.
           IF COND-WORD = 0
               MOVE SUB-SYS-REF TO SUB-SYS-NUM
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
               PERFORM 69-DELETE-EQP-REFERENCE
               IF COND-WORD = 17
                   MOVE "TRYING TO DELETE REF. RECORD * TIERDEL4 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               MOVE EQUIP-NUMBER TO EQP-NUM-REF
               PERFORM 69-WRITE-EQP-REFERENCE
               IF COND-WORD = 17
                   MOVE "TRYING TO WRITE REF. RECORD * TIERDEL4 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               MOVE 0 TO DEL-SW
               GO TO 6-MAIN
           ELSE
           MOVE SUB-SYS-REF TO SUB-SYS-NUM
022800     PERFORM 61-DEL-REM THRU 61-DR-EXIT
022900                      UNTIL DEL-SW = 1
023800     PERFORM 61-DEL-OPS THRU 61-DO-EXIT
023900                      UNTIL DEL-SW = 2
           MOVE 3 TO VIEW-LASTKEY.

       6-MAIN-EXIT.    EXIT.
028300
028400 61-DEL-REM.
           PERFORM 69-START-EQP-REMARKS.
028800     IF COND-WORD = 17
               MOVE 1 TO DEL-SW
029300         GO TO 61-DR-EXIT.
029400     PERFORM 69-READ-EQP-REMARKS.
029600     IF COND-WORD = 0
030500         PERFORM 69-DELETE-EQP-REMARKS
030600         IF COND-WORD = 17
                   MOVE "TRYING TO DELETE REMARKS" TO BU-DISPLAY-MSG
031300             PERFORM 998-BLOWUP
031400         ELSE
031500         MOVE EQUIP-BUFFER TO EQP-SUB-REM
031600         PERFORM 69-WRITE-EQP-REMARKS
031800         IF COND-WORD = 17
                   MOVE "TRYING TO WRITE REMARKS" TO BU-DISPLAY-MSG
032500             PERFORM 998-BLOWUP
032600         ELSE
033500         NEXT SENTENCE
033600     ELSE
034400     MOVE 1 TO DEL-SW.
034500
034600 61-DR-EXIT.    EXIT.
034700
034800 61-DEL-OPS.
           PERFORM 69-START-EQP-OPERATIONS.
035200     IF COND-WORD = 17
               MOVE 2 TO DEL-SW
035700         GO TO 61-DO-EXIT.
035800     PERFORM 69-READ-EQP-OPERATIONS.
036000     IF COND-WORD = 0
036900         PERFORM 69-DELETE-EQP-OPERATIONS
037000         IF COND-WORD = 17
                   MOVE "TRYING TO DELETE OP-SETS" TO BU-DISPLAY-MSG
037700             PERFORM 998-BLOWUP
037800         ELSE
037900         MOVE EQUIP-BUFFER TO EQP-SUB-OPS
038000         PERFORM 69-WRITE-EQP-OPERATIONS
038200         IF COND-WORD = 17
                   MOVE "TRYING TO WRITE OP-SETS" TO BU-DISPLAY-MSG
038900             PERFORM 998-BLOWUP
039000         ELSE
039900         NEXT SENTENCE
040000     ELSE
040800     MOVE 2 TO DEL-SW.
040900
041000 61-DO-EXIT.    EXIT.
041100
       69-DELETE-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           DELETE EQP-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           READ EQP-OPERATIONS NEXT INTO EQP-OPER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-SUB-KEY NOT = EQRSUBKEY OF EOREC
               MOVE 15 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY TO EQRSUBKEY OF EOREC.
           START EQP-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-EQP-OPERATIONS.
           MOVE 0 TO COND-WORD.
           WRITE EOREC FROM EQP-OPER-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           DELETE EQP-REFERENCE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           READ EQP-REFERENCE NEXT INTO EQP-REF-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-NUM-REF NOT = EQP-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-EQP-REFERENCE-0.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY-0 TO EQRSUBKEY OF ERREC.
           START EQP-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY TO EQRSUBKEY OF ERREC.
           START EQP-REFERENCE KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-EQP-REFERENCE.
           MOVE 0 TO COND-WORD.
           WRITE ERREC FROM EQP-REF-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
           DELETE EQP-REMARKS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
022600     READ EQP-REMARKS NEXT INTO EQP-REMARKS-DATA
022700         AT END    MOVE 15 TO COND-WORD.
           IF EQRSUBKEY OF ERKREC NOT = EQP-SUB-KEY
               MOVE 15 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
           MOVE EQP-SUB-KEY TO EQRSUBKEY OF ERKREC.
           START EQP-REMARKS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-EQP-REMARKS.
           MOVE 0 TO COND-WORD.
           WRITE ERKREC FROM EQP-REMARKS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ERK-STATUS NOT = "00" MOVE 17 TO COND-WORD.

076200 998-BLOWUP.
076300     MOVE "TIERDEL4" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
