       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TIERREMA.
      *REMARKS.                THIS PROGRAM ADDS RECORDS TO THE
      *                        REMARKS DATASET OF THE
      *                        EQUIPMENT REFERENCE FILE
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZIEQPREF-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT EQP-REMARKS
                  ASSIGN TO DATABASE-MCFLER0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS ER-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).

       FD  EQP-REMARKS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERREC.
       01  ERREC.
           COPY DDS-ALL-FORMATS OF MCFLER0301.

       WORKING-STORAGE SECTION.
       77  RECORD-SW           PIC X(01)  VALUE SPACE.
       77  TRUE-VAL            PIC 1      VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIERREMA".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(14) VALUE "INPUT PROGRAM ".
                   15  FILLER      PIC X(12) VALUE "FOR REMARKS ".
                   15  FILLER      PIC X(16) VALUE "LEVEL RECORDS OF".
                   15  FILLER      PIC X(18) VALUE " THE EQUIPMENT ".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(60) VALUE "REFERENCE FILE ".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F4".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(16) VALUE "REFERENCE RECORD".
                   15  FILLER      PIC X(16) VALUE " ADD SCREEN ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STATUSES.
           05  DSPLY-STATUS    PIC XX.
           05  ER-STATUS       PIC XX.

       01  SCREEN-BUFFER.
           05  ACD-DISP                  PIC X(06).
           05  EQP-SUB-BUF.
               10  EQP-KEY-BUF.
                   15  EQP-NUM-BUFFER    PIC X(06).
                   15  SUB-SYS-BUFFER    PIC X(04).
               10  EQP-SUB-DESC          PIC X(40).
           05  REM-VALUES.
               10  REM-1                 PIC X(66).
               10  REM-2                 PIC X(66).
               10  REM-3                 PIC X(66).
               10  REM-4                 PIC X(66).
               10  REM-5                 PIC X(66).
               10  REM-6                 PIC X(66).
               10  REM-7                 PIC X(66).
               10  REM-8                 PIC X(66).
               10  REM-9                 PIC X(66).
               10  REM-10                PIC X(66).
               10  REM-11                PIC X(66).
               10  REM-12                PIC X(66).
           05  SCREEN-CMD-LINE           PIC X(79).
           05  SCREEN-ERR-LINE           PIC X(79).

       01  EQP-REMARKS-DATA.
           05  EQP-SUB-KEY.
               10  EQP-SUB-NUMBER    PIC X(06).
               10  SUB-SYS-NUMBER    PIC X(04).
           05  REMARKS-12.
               10  EQP-REM-1         PIC X(66).
               10  EQP-REM-2         PIC X(66).
               10  EQP-REM-3         PIC X(66).
               10  EQP-REM-4         PIC X(66).
               10  EQP-REM-5         PIC X(66).
               10  EQP-REM-6         PIC X(66).
               10  EQP-REM-7         PIC X(66).
               10  EQP-REM-8         PIC X(66).
               10  EQP-REM-9         PIC X(66).
               10  EQP-REM-10        PIC X(66).
               10  EQP-REM-11        PIC X(66).
               10  EQP-REM-12        PIC X(66).

       01  MESSAGE-BUFFER.
           05  MESSAGE-LIT           PIC X(30).
           05  MESSAGE-EQPNUM        PIC X(6).
           05  MESSAGE-LIT2          PIC X(13).
           05  MESSAGE-SUBSYS        PIC XXXX.
           05  MESSAGE-LIST3         PIC X(26).

       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY CPYIND             IN COPYLIB.

       COPY WSCONTROL          IN COPYLIB.

       LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF           PIC X(06).
           05  SUB-SYS-BUF           PIC X(04).
           05  EQP-SUB-DESC-BUF      PIC X(40).
           05  EQP-TYPE-BUF          PIC X(08).
           05  ACD-FUNCTION          PIC X(06).
           05  ACD-SW                PIC X(01).

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                EQP-SUB-BUFFER.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.

       2-EOJ.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-REMARKS.
           GOBACK.

       1-HSK.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            EQP-REMARKS.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE "FIERREMA"     TO VIEW-CFNAME.
           MOVE SPACES         TO DSPLY-REC.
           MOVE 0              TO VIEW-LASTKEY.

       6-MAIN.
           MOVE SPACES         TO SCREEN-BUFFER.
           MOVE EQP-NUM-BUF    TO EQP-NUM-BUFFER.
           MOVE SUB-SYS-BUF    TO SUB-SYS-BUFFER.
           MOVE EQP-SUB-DESC-BUF TO EQP-SUB-DESC.
           MOVE ACD-FUNCTION   TO ACD-DISP.
           MOVE 66283          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER  TO DSPLY-REC.

           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.

           MOVE DSPLY-REC      TO SCREEN-BUFFER.
           IF VIEW-LASTKEY = 1 OR 2 OR 3 OR 5 GO TO 6-MAIN-EXIT.

           IF REM-VALUES = SPACES
               MOVE 2          TO VIEW-LASTKEY
               GO TO 6-MAIN-EXIT.

           MOVE EQP-KEY-BUF    TO EQP-SUB-KEY.
           MOVE REM-VALUES     TO REMARKS-12.
           PERFORM 69-WRITE-EQP-REMARKS.
           IF COND-WORD = 0
               MOVE 66286      TO CATREAD-MSG-NUMBER
           ELSE
               MOVE 66287      TO CATREAD-MSG-NUMBER.

           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE EQP-SUB-NUMBER TO MESSAGE-EQPNUM.
           MOVE SUB-SYS-NUMBER TO MESSAGE-SUBSYS.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE TRUE-VAL       TO INDS (98).
           MOVE SCREEN-BUFFER  TO DSPLY-REC.

           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.

           CALL "CLPAUSE2".
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       69-WRITE-EQP-REMARKS.
           MOVE 0              TO COND-WORD.
           WRITE ERREC         FROM EQP-REMARKS-DATA
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"       TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0"       TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0"       TO INDICS.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

