000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TIERTITL.
000600*REMARKS.  ***  THIS PROGRAM MAINTAINS THE
000700*               MASTER FIELD TITLE DATASET
000800*               IN THE EQUIPMENT REFERENCE FILE
000900*          ***  SUBROUTINES CALLED:
001000*               TSCRPRNT
001100*                   ****.
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZIEQPREF-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT FIELD-NAMES
               ASSIGN TO DATABASE-MCFLER0701
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS REL-KEY
               FILE STATUS IS FN-STATUS.
001700 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  FIELD-NAMES
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS FNREC.
       01  FNREC.
           COPY DDS-ALL-FORMATS OF MCFLER0701.
001800 WORKING-STORAGE SECTION.
       77  FNF-SW                      PIC 9.

       COPY CATREAD IN COPYLIB.

       COPY CPYIND  IN COPYLIB.

004200 01  EQP-TITLE-DATA.
004300     05  EQP-TITLE-1             PIC X(16).
004400     05  EQP-TITLE-2             PIC X(16).
004500     05  EQP-TITLE-3             PIC X(16).
004600     05  EQP-TITLE-4             PIC X(16).
004700     05  EQP-TITLE-5             PIC X(16).
004800     05  EQP-TITLE-6             PIC X(16).
004900     05  EQP-TITLE-7             PIC X(16).
005000     05  EQP-TITLE-8             PIC X(16).
           05  EQP-CMD-LINE            PIC X(79).
           05  EQP-ERR-LINE            PIC X(79).
005100
       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  FN-STATUS               PIC XX.

       COPY IOFEEDBACK IN COPYLIB.

005200 01  MESSAGE-BUFFER.
005300     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
005400     05  MSG-FLD               PIC X(8)     VALUE SPACE.
005500     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.

001900 01  PASSWORD-INFORMATION.
002000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIERTITL".
002100     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002200     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002300     05  PROGRAM-DESCRIPTION.
002400         10  PROG-DESC-A.
                   15  FILLER      PIC X(16) VALUE "ALLOWS ENTRY AND".
                   15  FILLER      PIC X(16) VALUE " MODIFICATION OF".
                   15  FILLER      PIC X(15) VALUE " MASTER TITLES ".
                   15  FILLER      PIC X(13) VALUE "FOR DEFAULT ".
002600         10  PROG-DESC-B.
                   15  FILLER      PIC X(16) VALUE "REFERENCE-RECORD".
                   15  FILLER      PIC X(16) VALUE "-INFORMATION IN ".
                   15  FILLER      PIC X(14) VALUE "THE EQUIPMENT ".
                   15  FILLER      PIC X(14) VALUE "REFERENCE FILE".
002800         10  PROG-FUNCTION.
                   15  FILLER      PIC X(14) VALUE "RUNS FROM THE ".
                   15  FILLER      PIC X(14) VALUE "F6 KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "PRIMARY ".
                   15  FILLER      PIC X(24) VALUE "REFERENCE MENU ".
003000     05  PASSWORD-FLAG       PIC X.
003100
       01  REL-KEY                     PIC 9(9).

003200 01  SCREEN-BUFFER.
           05  SCREEN-TITLES.
003300         10  TITLE-1             PIC X(16).
003400         10  TITLE-2             PIC X(16).
003500         10  TITLE-3             PIC X(16).
003600         10  TITLE-4             PIC X(16).
003700         10  TITLE-5             PIC X(16).
003800         10  TITLE-6             PIC X(16).
003900         10  TITLE-7             PIC X(16).
004000         10  TITLE-8             PIC X(16).
           05  SCREEN-CMD-LINE         PIC X(79).
           05  SCREEN-ERR-LINE         PIC X(79).

       COPY DBSTAT IN COPYLIB.

       COPY TBLOWUP   IN COPYLIB.

004100 COPY WSCONTROL IN COPYLIB.
007700 LINKAGE SECTION.
       COPY VCOMLINK IN COPYLIB.
007900 01  DBPARAMETERS.        COPY DBPARMS IN COPYLIB.
008200
008300 PROCEDURE DIVISION USING VIEW-COMAREA
008400                          DBPARAMETERS.
008700
008800 BEGIN-PROGRAM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE FIELD-NAMES.
           GOBACK.
       1-HSK.
           MOVE 0 TO FNF-SW.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   FIELD-NAMES.
008900     CALL "TPWORD" USING PASSWORD-INFORMATION.
009300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
009800
009900 6-MAIN.
010000     MOVE "FIERTITL" TO VIEW-CFNAME.
013300     MOVE SPACES TO SCREEN-BUFFER EQP-TITLE-DATA DSPLY-REC.
           PERFORM 69-READ-FIELD-NAMES.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           MOVE 1 TO FNF-SW.
013800     MOVE EQP-TITLE-DATA TO SCREEN-BUFFER DSPLY-REC.
013900     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
016500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
016900     MOVE DSPLY-REC TO SCREEN-BUFFER EQP-TITLE-DATA.
           IF FNF-SW = 1
               PERFORM 69-DELETE-FIELD-NAMES
               IF COND-WORD = 17
                   GO TO 2-EOJ.
           PERFORM 69-WRITE-FIELD-NAMES.
           IF COND-WORD = 17
               GO TO 2-EOJ
           ELSE
017900     GO TO 6-MAIN.

        69-READ-FIELD-NAMES.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO REL-KEY.
           READ FIELD-NAMES INTO EQP-TITLE-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FN-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-FIELD-NAMES.
           MOVE 0 TO COND-WORD.
           DELETE FIELD-NAMES RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FN-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-FIELD-NAMES.
           MOVE 0 TO COND-WORD.
           WRITE FNREC FROM EQP-TITLE-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF FN-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

058400 999-CATREAD.
058500     MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
059500 999-CATREAD-EXIT.    EXIT.
