000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TIEREXES.
000400*REMARKS.  ***  THIS IS THE EXECUTIVE SUBROUTINE FOR
000500*               THE EQUIPMENT REFERENCE FILE
000600*               DATABASE MAINTENANCE PROGRAM
000700*          ***  SUBROUTINES CALLED:
000800*                   TERRORD
000900*                   TIERREFA
001000*                   TIERREFC
001100*                   TIERDEL
001200*                   TIERTYPE
001300*                   TIERTITL
001400*                   ****.
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.    AS400.
001800 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001900 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT EQPREF-MASTER-RECORD
               ASSIGN TO DATABASE-MCFLER0801
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS EMR-STATUS.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
002000 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  EQPREF-MASTER-RECORD
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EMRREC.
       01  EMRREC.
           COPY DDS-ALL-FORMATS OF MCFLER0801.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
002100 WORKING-STORAGE SECTION.
002300 77  ARG-NO                    PIC 9(9).
       77  SAVE-SCREEN-FILE          PIC X(10).
002500
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.

004700 01  CUR-EQP-DISP.
004800     05  CE-LITERAL            PIC X(28).
004900     05  EQP-NUM               PIC X(06).

       01  ERROR-BUFFER.
007800     05  MESSAGE-LIT           PIC X(28).
007900     05  FILLER                PIC X(52).
005000
008000 01  EQP-EQUIPMENT.         COPY MEQPFILE OF COPYLIB.

005500 01  EQP-SAVE-BUFFER.
005600     05  EQP-NUM-SAVE          PIC X(06) VALUE SPACES.
005700     05  FILLER                PIC X(59) VALUE SPACES.
005800
003900 01  EQP-SUB-BUFFER.
004000     05  EQP-NUM-BUF           PIC X(06) VALUE SPACES.
004100     05  SUB-SYS-BUF           PIC X(04) VALUE SPACES.
004200     05  EQP-SUB-DESC          PIC X(40) VALUE SPACES.
004300     05  EQP-TYPE-BUF          PIC X(08) VALUE SPACES.
004400     05  ACD-FUNCTION          PIC X(06) VALUE SPACES.
004500     05  ACD-SW                PIC X(01) VALUE SPACES.
004600
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  EF-STATUS             PIC XX.
           05  EMR-STATUS            PIC XX.
           05  WLNU-STATUS           PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

008100 01  LAST-WO-USED-DATA.     COPY MLASTWO  OF COPYLIB.

008200 COPY DFMASTER  OF COPYLIB.

002600 01  PASSWORD-INFORMATION.
002700     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIEREXES".
002800     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002900     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003000     05  PROGRAM-DESCRIPTION.
003100         10  PROG-DESC-A.
                   15  FILLER      PIC X(15) VALUE "PRIMARY MODULE ".
                   15  FILLER      PIC X(17) VALUE " OF THE EQUIPMENT".
                   15  FILLER      PIC X(16) VALUE " REFERENCE FILE ".
                   15  FILLER      PIC X(12) VALUE "MAINTENANCE ".
003300         10  PROG-DESC-B.
                   15  FILLER      PIC X(17) VALUE "PROGRAM TO PERMIT".
                   15  FILLER      PIC X(12) VALUE " ADDITIONS, ".
                   15  FILLER      PIC X(15) VALUE "MODIFICATIONS, ".
                   15  FILLER      PIC X(16) VALUE "AND DELETIONS TO".
003500         10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "SPECIFIC (LOCAL ".
                   15  FILLER      PIC X(12) VALUE "NUMBER) AND ".
                   15  FILLER      PIC X(14) VALUE "GENERIC (TYPE ".
                   15  FILLER      PIC X(08) VALUE "NUMBER) ".
                   15  FILLER      PIC X(10) VALUE "RECORDS ".
003700     05  PASSWORD-FLAG       PIC X.
003800
005100 01  SCREEN-DISP.
005200     05  SCREEN-EQP-DISP         PIC X(06).
005300     05  SCREEN-C-E-DISP         PIC X(34).
           05  SCREEN-CMD-LINE         PIC X(79).
           05  SCREEN-ERR-LINE         PIC X(79).
005400
007900 COPY DBSTAT    OF COPYLIB.
008300
005900 01  TEMP-BUFFER.
006000     05  DESC-BUFFER            PIC X(40).
006100     05  FILLER                 PIC X(10).
006200 01  TRUE-VAL                   PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
008400 LINKAGE SECTION.
009100 01  DBPARAMETERS.          COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK  OF COPYLIB.
010200 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA.
010400 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.
041800 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE EQPREF-MASTER-RECORD.
           CLOSE EQUIPMENT-FILE.
           CLOSE WO-LAST-NUM-USED.
042400     GOBACK.
042500 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT EQPREF-MASTER-RECORD.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
010500     MOVE SPACES TO EQP-SUB-BUFFER.
           MOVE 0 TO COND-WORD.
011700     MOVE 1 TO ARG-NO.
011900     READ EQPREF-MASTER-RECORD INTO BUF-DFMASTER
012000         INVALID KEY    MOVE 17 TO COND-WORD.
           IF EMR-STATUS NOT = "00" MOVE 17 TO COND-WORD.
012100     IF COND-WORD = 17 GO TO 2-EOJ.
014000     CALL "TPWORD" USING PASSWORD-INFORMATION.
014400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
015000     MOVE SPACES TO LAST-WO-USED-DATA.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
015100     MOVE 1 TO DATE-FLAG-SW.
017000     MOVE DATE-FLAG-SW TO DATE-FLAG.
019100 6-MAIN.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
               MOVE SPACES         TO ERROR-BUFFER
           ELSE
           MOVE SPACES TO SCREEN-ERR-LINE.
           MOVE 66292 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DISP TO DSPLY-REC.
025900     MOVE "FIEREXES" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-DISP.
           MOVE SCREEN-EQP-DISP TO EQP-NUM-BUF.
032900     IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
033200     IF VIEW-LASTKEY = 6 OR 7 GO TO 6-MAIN-LOOP.
033500     IF VIEW-LASTKEY = 0
033600         MOVE 42017 TO CATREAD-MSG-NUMBER
033800**MESSAGE******************************************************
033900** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE                **
034000***************************************************************
034100         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
034200         MOVE TRUE-VAL TO INDS (98)
               MOVE SCREEN-DISP TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
034400         GO TO 6-MAIN.
029000     MOVE EQP-SUB-BUFFER TO EQP-SAVE-BUFFER.
029100     IF EQP-NUM-BUF = SPACES
029200         MOVE SPACES TO SCREEN-DISP
029300     ELSE
029500     MOVE EQP-NUM-BUF TO EQP-NUM
029600     MOVE SPACES TO CE-LITERAL
029700     MOVE 29063 TO CATREAD-MSG-NUMBER
029900**MESSAGE******************************************************
030000** CURRENT EQUIPMENT NUMBER IS                               **
030100***************************************************************
030200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030300     MOVE MESSAGE-LIT TO CE-LITERAL
030400     MOVE CUR-EQP-DISP TO SCREEN-C-E-DISP.
030500     MOVE SPACES TO EQP-SUB-BUFFER.
034600     IF EQP-NUM-SAVE NOT = SPACES
035200         MOVE SCREEN-EQP-DISP TO EQP-NUM-BUF
035300         IF EQP-NUM-BUF = SPACES
035400             MOVE EQP-SAVE-BUFFER TO EQP-SUB-BUFFER
035500             GO TO 6-MAIN-LOOP.
036300     IF SCREEN-EQP-DISP = SPACES
036400         MOVE 31016 TO CATREAD-MSG-NUMBER
036600**MESSAGE******************************************************
036700** EQUIPMENT NUMBER IS REQUIRED                              **
036800***************************************************************
036900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
037000         MOVE TRUE-VAL TO INDS (1) INDS (99)
037200         GO TO 6-MAIN.
037400     MOVE SCREEN-EQP-DISP TO EQP-NUM-BUF.
037900     PERFORM 69-START-EQUIPMENT-FILE.
           IF COND-WORD = 17
               MOVE 66134 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN.
           PERFORM 69-READ-EQUIPMENT-FILE.
038200     IF COND-WORD = 0
038300         MOVE EQP-TYPE TO EQP-TYPE-BUF
038400         MOVE EQP-EQUIP-NAME TO TEMP-BUFFER
038500         MOVE DESC-BUFFER    TO EQP-SUB-DESC
038600     ELSE
03870      MOVE ZEROS TO EQP-TYPE-BUF
03880      MOVE 30052 TO CATREAD-MSG-NUMBER
039000**MESSAGE******************************************************
039100** DEVICE NOT IN EQUIPMENT FILE                              **
039200***************************************************************
039300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039400     MOVE TRUE-VAL TO INDS (1) INDS (99)
           GO TO 6-MAIN.
039500
039600 6-MAIN-LOOP.
040000     IF VIEW-LASTKEY = 2
040100         MOVE "A" TO ACD-SW
040200         MOVE 27048 TO CATREAD-MSG-NUMBER
040400**MESSAGE******************************************************
040500** ADD                                                       **
040600***************************************************************
040700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040800         MOVE ERROR-BUFFER TO ACD-FUNCTION
040900         CALL "TIERREFA" USING VIEW-COMAREA
                                     DBPARAMETERS
041300                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE 0 TO VIEW-LASTKEY
041800         GO TO 6-MAIN.
041900
042000     IF VIEW-LASTKEY = 4
042100         MOVE "C" TO ACD-SW
042200         MOVE 29061 TO CATREAD-MSG-NUMBER
042400**MESSAGE******************************************************
042500** CHANGE                                                    **
042600***************************************************************
042700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
042800         MOVE ERROR-BUFFER TO ACD-FUNCTION
042900         CALL "TIERREFC" USING VIEW-COMAREA
                                     DBPARAMETERS
043300                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE 0 TO VIEW-LASTKEY
043800         GO TO 6-MAIN.
043900
044000     IF VIEW-LASTKEY = 5
044100         MOVE "D" TO ACD-SW
044200         MOVE 30053 TO CATREAD-MSG-NUMBER
044400**MESSAGE******************************************************
044500** DELETE                                                    **
044600***************************************************************
044700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
044800         MOVE ERROR-BUFFER TO ACD-FUNCTION
044900         CALL "TIERDEL" USING VIEW-COMAREA
                                    DBPARAMETERS
045300                              EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE 0 TO VIEW-LASTKEY
045800         GO TO 6-MAIN.
045900
046000     IF VIEW-LASTKEY = 6
046100         CALL "TIERTYPE" USING VIEW-COMAREA
                                     DBPARAMETERS
046500                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE 0 TO VIEW-LASTKEY
047000         GO TO 6-MAIN.
047100
047200     IF VIEW-LASTKEY = 7
047300         CALL "TIERTITL" USING VIEW-COMAREA
                                     DBPARAMETERS
048000         MOVE SPACES TO EQP-NUM-BUF
               MOVE 0 TO VIEW-LASTKEY
048200         GO TO 6-MAIN.
048300     GO TO 6-MAIN.
041700
       6-MAIN-EXIT.    EXIT.

       69-START-EQUIPMENT-FILE.
           MOVE 0 TO COND-WORD.
           MOVE EQP-NUM-BUF TO EQPNUM OF EFREC.
           START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-EQUIPMENT-FILE.
           MOVE 0 TO COND-WORD.
           READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
               AT END    MOVE 15 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

042600 999-CATREAD.
042700     MOVE SPACES TO ERROR-BUFFER.
042800     CALL "CCATREAD" USING CATREAD-PARMS.
042900     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
043700 999-CATREAD-EXIT.    EXIT.
