000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TIERREFC.
000600*REMARKS.  ***  THIS PROGRAM MODIFIES THE
000700*               REFERENCE DATASET OF THE
000800*               EQUIPMENT REFERENCE FILE
000900*          ***  SUBROUTINES CALLED:
001000*               TIERREMC
001100*               TIEROPSC
001300*                   ****.
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.    AS400.
001700 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZIEQPREF-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT EQUIPMENT-REFERENCE
               ASSIGN TO DATABASE-MCFLER0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS ER-STATUS.
001900 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  EQUIPMENT-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS ERREC.
       01  ERREC.
           COPY DDS-ALL-FORMATS OF MCFLER0101.
002000 WORKING-STORAGE SECTION.
002100 77  RECORD-SW               PIC X(01).
002200 77  TIT-SW                  PIC X(01).
002300
       COPY CATREAD IN COPYLIB.

       COPY CPYIND  IN COPYLIB.

007600 01  EQP-REF-DATA.
007700     05  EQP-SUB-KEY.
007800         10  EQP-NUMBER      PIC X(06).
007900         10  SUB-SYS-NUMBER  PIC X(04).
008000     05  EQP-SCREEN-VALUES.
008100         10  EQP-CORP-TYPE   PIC X(08).
008200         10  EQP-MFG         PIC X(16).
008300         10  EQP-MOD         PIC X(16).
008400         10  EQP-SER         PIC X(16).
008500         10  EQP-PROP-NUM    PIC X(08).
008600         10  EQP-NAME-1      PIC X(16).
008700         10  EQP-FIELD-1     PIC X(16).
008800         10  EQP-NAME-2      PIC X(16).
008900         10  EQP-FIELD-2     PIC X(16).
009000         10  EQP-NAME-3      PIC X(16).
009100         10  EQP-FIELD-3     PIC X(16).
009200         10  EQP-NAME-4      PIC X(16).
009300         10  EQP-FIELD-4     PIC X(16).
009400         10  EQP-NAME-5      PIC X(16).
009500         10  EQP-FIELD-5     PIC X(16).
009600         10  EQP-NAME-6      PIC X(16).
009700         10  EQP-FIELD-6     PIC X(16).
009800         10  EQP-NAME-7      PIC X(16).
009900         10  EQP-FIELD-7     PIC X(16).
010000         10  EQP-NAME-8      PIC X(16).
010100         10  EQP-FIELD-8     PIC X(16).
010200
       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  ER-STATUS           PIC XX.

       COPY IOFEEDBACK IN COPYLIB.

011300 01  MESSAGE-BUFFER.
011400     05  MESSAGE-LIT1        PIC X(38).
011500     05  MESSAGE-EQPNUM      PIC X(6).
011600     05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC X(4).
           05  MESSAGE-LIT3        PIC X(19).

002400 01  PASSWORD-INFORMATION.
002500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TIERREFC".
002600     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002800     05  PROGRAM-DESCRIPTION.
002900         10  PROG-DESC-A.
                   15  FILLER      PIC X(15) VALUE "CHANGE PROGRAM ".
                   15  FILLER      PIC X(14) VALUE "FOR REFERENCE ".
                   15  FILLER      PIC X(14) VALUE "LEVEL RECORDS ".
                   15  FILLER      PIC X(07) VALUE "OF THE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
003100         10  PROG-DESC-B.
                   15  FILLER      PIC X(60) VALUE "REFERENCE FILE".
003300         10  PROG-FUNCTION.
                   15  FILLER      PIC X(14) VALUE "RUNS FROM THE ".
                   15  FILLER      PIC X(14) VALUE "F4 KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "PRIMARY ".
                   15  FILLER      PIC X(24) VALUE "SELECTION MENU".
003500     05  PASSWORD-FLAG       PIC X.
003600
       01  SAVE-CFNAME             PIC X(16).

004200 01  SCREEN-BUFFER.
004300     05  ACD-DISP            PIC X(06).
004400     05  EQP-SUB-BUF.
004500         10  EQP-KEY-BUF.
004600             15  EQP-NUM-BUFFER   PIC X(06).
004700             15  SUB-SYS-BUFFER.
004800                 20  SS-BUF-1     PIC X.
004900                 20  SS-BUF-2     PIC X.
005000                 20  SS-BUF-3     PIC X.
005100                 20  SS-BUF-4     PIC X.
005200         10  EQP-SUB-DESC         PIC X(40).
005300     05  REF-VALUES.
005400         10  TYPE-BUF        PIC X(08).
005500         10  MFG-BUF         PIC X(16).
005600         10  MOD-BUF         PIC X(16).
005700         10  SER-BUF         PIC X(16).
005800         10  PNUM-BUF        PIC X(08).
005900         10  HDR1-BUF        PIC X(16).
006000         10  DES1-BUF        PIC X(16).
006100         10  HDR2-BUF        PIC X(16).
006200         10  DES2-BUF        PIC X(16).
006300         10  HDR3-BUF        PIC X(16).
006400         10  DES3-BUF        PIC X(16).
006500         10  HDR4-BUF        PIC X(16).
006600         10  DES4-BUF        PIC X(16).
006700         10  HDR5-BUF        PIC X(16).
006800         10  DES5-BUF        PIC X(16).
006900         10  HDR6-BUF        PIC X(16).
007000         10  DES6-BUF        PIC X(16).
007100         10  HDR7-BUF        PIC X(16).
007200         10  DES7-BUF        PIC X(16).
007300         10  HDR8-BUF        PIC X(16).
007400         10  DES8-BUF        PIC X(16).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
007500
014300 COPY DBSTAT    IN COPYLIB.

       COPY TBLOWUP   IN COPYLIB.

       01  TRUE-VAL                PIC 1 VALUE B"1".

       COPY WSCONTROL IN COPYLIB.
014000 LINKAGE SECTION.
014100 COPY VCOMLINK  IN COPYLIB.
014200 01  DBPARAMETERS.        COPY DBPARMS IN COPYLIB.
014500 01  EQP-SUB-BUFFER.
014600     05  EQP-NUM-BUF         PIC X(06).
014700     05  SUB-SYS-BUF         PIC X(04).
014800     05  EQP-SUB-DESC-BUF    PIC X(40).
014900     05  EQP-TYPE-BUF        PIC X(08).
015000     05  ACD-FUNCTION        PIC X(06).
015100     05  ACD-SW              PIC X(01).
015200
015300 PROCEDURE DIVISION USING VIEW-COMAREA
015400                          DBPARAMETERS
015700                          EQP-SUB-BUFFER.
015800 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE EQUIPMENT-REFERENCE.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   EQUIPMENT-REFERENCE.
016000     CALL "TPWORD" USING PASSWORD-INFORMATION.
016400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO VIEW-LASTKEY.
017100     MOVE "FIERREFC" TO VIEW-CFNAME.
020500     MOVE SPACES TO SCREEN-BUFFER DSPLY-REC.
           MOVE " " TO RECORD-SW TIT-SW.
016900
017000 6-MAIN.
           IF TRUE-VAL = INDS (99)
               MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE
           ELSE
           MOVE SPACES TO SCREEN-ERR-LINE.
020600     MOVE EQP-NUM-BUF TO EQP-NUM-BUFFER.
020700     MOVE SPACES TO SUB-SYS-BUFFER.
020800     MOVE EQP-SUB-DESC-BUF TO EQP-SUB-DESC.
020900     MOVE ACD-FUNCTION TO ACD-DISP.
           MOVE 66299 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
021000     PERFORM 99-SCREEN-WRITE.
021700     PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
023800     IF VIEW-LASTKEY NOT = 0 GO TO 6-MAIN-LOOP.
024700     PERFORM 62-SS-ADJUST.
           PERFORM 69-START-EQUIPMENT-REFERENCE.
           IF COND-WORD = 17
               MOVE 66300 TO CATREAD-MSG-NUMBER
029200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
029300         MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE "FIERREFC" TO VIEW-CFNAME
029500         GO TO 6-MAIN.
           PERFORM 69-READ-EQUIPMENT-REFERENCE.
025000     IF COND-WORD = 0
               NEXT SENTENCE
025200     ELSE
           MOVE 66300 TO CATREAD-MSG-NUMBER
029200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE EQP-NUM-BUF    TO MESSAGE-EQPNUM
           MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
029300     MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
           MOVE TRUE-VAL TO INDS (98)
           MOVE SCREEN-BUFFER TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE "FIERREFC" TO VIEW-CFNAME
029500     GO TO 6-MAIN.
044500     IF TIT-SW = " "
045000         MOVE "FIERREFC2" TO VIEW-CFNAME
045600     ELSE
046100     MOVE "FIERREFCT" TO VIEW-CFNAME.
       6-MAIN-CONT.
           MOVE 66302 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
020600     MOVE EQP-NUM-BUFFER TO EQP-NUM-BUF.
020700     MOVE SUB-SYS-NUMBER TO SUB-SYS-BUF.
020800     MOVE EQP-SUB-DESC-BUF TO EQP-SUB-DESC.
020900     MOVE ACD-FUNCTION TO ACD-DISP.
           MOVE EQP-SCREEN-VALUES TO REF-VALUES.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
034700
036100 6-MAIN-LOOP.
036200     IF VIEW-LASTKEY = 1 OR 3 GO TO 6-MAIN-EXIT.
036400     IF VIEW-LASTKEY = 2
               MOVE "FIERREFC" TO VIEW-CFNAME
               MOVE SPACES TO REF-VALUES
               MOVE 0 TO VIEW-LASTKEY
               GO TO 6-MAIN.
036600     IF VIEW-LASTKEY = 4
               MOVE DSPLY-REC TO SCREEN-BUFFER
037200         IF SUB-SYS-BUFFER NOT = SPACES
037300             PERFORM 62-SS-ADJUST
037400             MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
                   MOVE VIEW-CFNAME TO SAVE-CFNAME
037500             CALL "TIERREMC" USING VIEW-COMAREA
037600                                  DBPARAMETERS
037900                                  EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
                   MOVE SAVE-CFNAME TO VIEW-CFNAME
038300             GO TO 6-MAIN-LOOP
038400         ELSE
038500         IF SUB-SYS-BUF = SPACES
038600             MOVE 45037 TO CATREAD-MSG-NUMBER
038800**MESSAGE******************************************************
038900** SUBSYSTEM NUMBER REQUIRED                                 **
039000***************************************************************
039100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039200             MOVE TRUE-VAL TO INDS (99)
                   MOVE "FIERREFC" TO VIEW-CFNAME
039400             GO TO 6-MAIN
039500         ELSE
               MOVE VIEW-CFNAME TO SAVE-CFNAME
039600         CALL "TIERREMC" USING VIEW-COMAREA
039700                               DBPARAMETERS
040000                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE SAVE-CFNAME TO VIEW-CFNAME
040100         GO TO 6-MAIN-LOOP.
040500     IF VIEW-LASTKEY = 5
               MOVE DSPLY-REC TO SCREEN-BUFFER
041100         IF SUB-SYS-BUFFER NOT = SPACES
041200             PERFORM 62-SS-ADJUST
041300             MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
                   MOVE VIEW-CFNAME TO SAVE-CFNAME
041400             CALL "TIEROPSC" USING VIEW-COMAREA
041500                                  DBPARAMETERS
041800                                  EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
                   MOVE SAVE-CFNAME TO VIEW-CFNAME
042200             GO TO 6-MAIN-LOOP
042300         ELSE
042400         IF SUB-SYS-BUF = SPACES
042500             MOVE 45037 TO CATREAD-MSG-NUMBER
042700**MESSAGE******************************************************
042800** SUBSYSTEM NUMBER REQUIRED                                 **
042900***************************************************************
043000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043100             MOVE TRUE-VAL TO INDS (99)
                   MOVE "FIERREFC" TO VIEW-CFNAME
043300             GO TO 6-MAIN
043400         ELSE
               MOVE VIEW-CFNAME TO SAVE-CFNAME
043500         CALL "TIEROPSC" USING VIEW-COMAREA
043600                               DBPARAMETERS
043900                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
               MOVE SAVE-CFNAME TO VIEW-CFNAME
044300         GO TO 6-MAIN-LOOP.
044400     IF VIEW-LASTKEY = 7
044500         IF TIT-SW = SPACE
044600             MOVE "X" TO TIT-SW
045000             MOVE "FIERREFCT" TO VIEW-CFNAME
                   GO TO 6-MAIN-CONT
045600         ELSE
046000         MOVE SPACE TO TIT-SW
046100         MOVE "FIERREFC2" TO VIEW-CFNAME
046600         GO TO 6-MAIN-CONT.
047800     MOVE DSPLY-REC TO SCREEN-BUFFER.
048100     MOVE EQP-KEY-BUF TO EQP-SUB-KEY.
048200     MOVE REF-VALUES TO EQP-SCREEN-VALUES.
           PERFORM 69-REWRITE-EQUIPMENT-REFERENCE.
050700     MOVE SPACES TO REF-VALUES.
050800     IF COND-WORD = 0
050900         MOVE 66301 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-NUM-BUFFER TO MESSAGE-EQPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE "FIERREFC" TO VIEW-CFNAME
               GO TO 6-MAIN.
055100
       6-MAIN-EXIT.    EXIT.

055200 62-SS-ADJUST.
055300     IF SS-BUF-1 = SPACE MOVE "0" TO SS-BUF-1.
055400     IF SS-BUF-2 = SPACE MOVE "0" TO SS-BUF-2.
055500     IF SS-BUF-3 = SPACE MOVE "0" TO SS-BUF-3.
055600     IF SS-BUF-4 = SPACE MOVE "0" TO SS-BUF-4.
055700
       69-START-EQUIPMENT-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE EQP-KEY-BUF TO EQRSUBKEY OF ERREC.
           START EQUIPMENT-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

        69-READ-EQUIPMENT-REFERENCE.
            MOVE 0 TO COND-WORD.
            READ EQUIPMENT-REFERENCE NEXT INTO EQP-REF-DATA
                AT END    MOVE 15 TO COND-WORD.
            IF EQP-KEY-BUF NOT = EQRSUBKEY OF ERREC
                MOVE 15 TO COND-WORD.
            IF ER-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-EQUIPMENT-REFERENCE.
           MOVE 0 TO COND-WORD.
           REWRITE ERREC FROM EQP-REF-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF ER-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

056300 999-CATREAD.
056400     MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
057400 999-CATREAD-EXIT.    EXIT.
