000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TINITEXC.
000400*REMARKS.    THIS PROGRAM IS THE EXECUTIVE CONTROLLING PROGRAM
000500*            FOR PLANNED INITIATE PROGRAMS.
000600 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.     AS400.
       OBJECT-COMPUTER.     AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPLANNER-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
000700 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
000800 WORKING-STORAGE SECTION.
000900 01  BLOWUP-BASE                 PIC X(16).
       COPY CATREAD    OF COPYLIB.
       COPY CPYIND     OF COPYLIB.
       01  DSPLY-STATUS                PIC XX.
001000 01  ERROR-BUFFER                PIC X(80).
       COPY IOFEEDBACK OF COPYLIB.
001200 01  PASSWORD-INFORMATION.
001300     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TINITEXC".
001400     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
001500     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
001600     05  PROGRAM-DESCRIPTION.
001700         10  PROG-DESC-A.
                   15  FILLER      PIC X(15) VALUE " INITIATE W/O'S".
                   15  FILLER      PIC X(17) VALUE " EXECUTIVE ALLOWS".
                   15  FILLER      PIC X(17) VALUE " USERS TO SELECT ".
                   15  FILLER      PIC X(11) VALUE "EITHER F1 -".
001900         10  PROG-DESC-B.
                   15  FILLER      PIC X(17) VALUE "SINGLE INITIATE, ".
                   15  FILLER      PIC X(17) VALUE "F2 -CONTINUOUS IN".
                   15  FILLER      PIC X(17) VALUE "ITIATE OR F4 -GEN".
                   15  FILLER      PIC X(09) VALUE "SUFFIXES ".
002100         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002300     05  PASSWORD-FLAG       PIC X.
       01  SCREEN-BUFFER.
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
002400 COPY DBSTAT     OF COPYLIB.
002500 COPY TBLOWUP    OF COPYLIB.
       COPY WSCONTROL  OF COPYLIB.
002600 LINKAGE SECTION.
003300 01  DBPARAMETERS.       COPY DBPARMS  OF COPYLIB.
003500 01  LAST-WO-BUFF.       COPY MLASTWO  OF COPYLIB.
003600 01  ERROR-SWITCH.
003700     05  ERR-SW                   PIC S9(4) COMP.
003400 COPY VCOMLINK   OF COPYLIB.
003900 PROCEDURE DIVISION USING DBPARAMETERS LAST-WO-BUFF
004000                      ERROR-SWITCH VIEW-COMAREA.
004100 BEGIN-PROCESSING.
           PERFORM 1-HSK.
           PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           IF ERROR-SWITCH = "88" MOVE 0 TO ERR-SW.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
004200     CALL "TPWORD" USING PASSWORD-INFORMATION.
004600     IF PASSWORD-FLAG = "N"
004700         MOVE "  PWORD" TO BLOWUP-BASE
004800         MOVE "FAILED PASSWORD CHECK - TINITEXC"
004900             TO BU-DISPLAY-MSG
005000         PERFORM 998-BLOWUP.
           OPEN I-O DISPLAY-FILE.
           MOVE 0 TO VIEW-LASTKEY.
       6-MAIN.
           IF VIEW-LASTKEY = 0
               MOVE "FINITEXC" TO VIEW-CFNAME
               MOVE 66348 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ.
006900     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
007200     IF VIEW-LASTKEY = 1
007300         CALL "TINITPLN" USING DBPARAMETERS
007400                               LAST-WO-BUFF
007500                               ERROR-SWITCH
                                     VIEW-COMAREA
007600         IF VIEW-LASTKEY = 1
007700             GO TO 2-EOJ
007800         ELSE
007900         MOVE 0 TO VIEW-LASTKEY
008000         GO TO 6-MAIN.
008200     IF VIEW-LASTKEY = 2
008300         CALL "TINITWO2" USING DBPARAMETERS
008400                               LAST-WO-BUFF
008500                               ERROR-SWITCH
                                     VIEW-COMAREA
008600         IF VIEW-LASTKEY = 1
008700             GO TO 2-EOJ
008800         ELSE
008900         MOVE 0 TO VIEW-LASTKEY
009000         GO TO 6-MAIN.
009800
008200     IF VIEW-LASTKEY = 4
008300         CALL "TGENWORK"
008900         MOVE 0 TO VIEW-LASTKEY
009000         GO TO 6-MAIN.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

009900 998-BLOWUP.
010000     MOVE "TINITEXC" TO BU-PGM-NAME.
010100     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
010200                      VIEW-COMAREA DUMMY-KSAM-STAT
010300                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
