       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TINQVEND.
       AUTHOR.         FRED HAYNES.
       INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   APRIL 19, 1980.
      *************************************************************
      * THIS IS THE VENDOR INQUIRY PROGRAM                        *
      *************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C   4/11/94.   MARVIN MITCHELL  REQUEST #6490
      *C     COMMENTED EACH OF THE 'COPY' CODE STATEMENTS AT
      *C     THE END OF THIS PROGRAM, AND COPIED THE ACTUAL
      *C     COPYLIB MEMBERS' SOURCE CODE.
      *C
      *C   5/02/95.   WILL MCINTYRE    REQUEST 95-007
      *C     ADDED CALL TO TALTVENK TO ALLOW USER TO ENTER AN
      *C     ALTERNATE KEY, AND HAVE THE LINKED VENDOR CODE
      *C     SUBSTITUTED IN THE ALTERNATE KEY'S PLACE.
      *C
      *C   5/02/96    JIM COFFMAN      REQUEST 96-021
      *C     ADDED THE ABILITY FOR THE USER TO ENTER A GENERIC
      *C     ENTRY AND THEN BRING MULTIPLE SELECTIONS BACK TO
      *C     THE SCREEN ONE AT A TIME UNTIL THE USER KNOWS
      *C     THE VENDOR HE WANTS TO PURSUE. THE USER CYCLES
      *C     THROUGH THE SELECTIONS BY SIMPLY HITTING THE
      *C     'ENTER' KEY.
      *C
      *C   1/27/97     CA YODER    *** NOTE ***
      *C     THE LOGIC TO SHOW THE VENDOR INQUIRY INFORMATION
      *C     WAS COPIED TO "TPOINQH" AND "SPOINQHH".  IF A
      *C     CHANGE IS MADE IN THIS PROGRAM TO THAT LOGIC OR TO
      *C     THE SCREEN, THE SAME CHANGE MAY NEED TO BE ADDED TO
      *C     TO "TPOINQH" AND "SPOINQHH".
      *C
      *C  02/02/98     CA YODER    REQ #97-018
      *C     ADDED LOGIC TO DISPLAY STANDARD INSTRUCTIONS WITH A
      *C     VENDOR CODE.
      *C
      *C  06/05/98     CA YODER
      *C     ADDED SCREEN FOR EDI VENDORS TO SHOW WHICH EDI
      *C     TRANSACTIONS SHOULD BE SENT.
      *C---------------------------------------------------------------
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *C    NEW DISPLAY FILE ZTINQVEND CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DVENDOR-VN-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-UM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZTINQVEND-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  MVALIDUM-UM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-UM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  DVENDOR-VN-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       WORKING-STORAGE SECTION.

       77  SUB                           PIC S9     BINARY.
       77  HANDLE-BLOWUP-FLAG            PIC X      VALUE "Y".
       77  RET-CODE-TALTVENK             PIC X(02)  VALUE "00".
       77  BASE-TALTVENK                 PIC X(20).
       77  ALT-KEY-ARG                   PIC X(10).
       77  ALT-VEND-CODE                 PIC X(10).
       77  VSUB                          PIC 9(2)   VALUE 0 COMP-4.
       77  SAVE-VDE-VENDOR               PIC X(10).
       01  SAVE-TITLE                    PIC X(35)  VALUE SPACES.
       01  SAVE-INSTRUCTION              PIC X(75)  VALUE SPACES.

      *
      * DATABASE STUFF
      *
       COPY FILESTAT IN COPYLIB.
       01  DB-PARAMETERS.
           05  DSET-NAME                 PIC X(16)  VALUE SPACES.
           05  DSET-DVENDOR              PIC X(16)  VALUE "DVENDOR;".
           05  VEN-SEARCH                PIC X(10)  VALUE "VEN-CODE;"  .
           05  VEN-ARG                   PIC X(10)  VALUE SPACES.
           05  DSET-MVALIDUM             PIC X(16)  VALUE "MVALIDUM;"  .
           05  UM-ARG                    PIC X(2)   VALUE SPACES.
           05  ALL-ITEMS                 PIC X(2)   VALUE "@;".

       COPY DBSTAT     IN COPYLIB.
       COPY DBMODES    OF COPYLIB.
       COPY MKWINQ     OF COPYLIB.
       COPY DVENDOR    OF COPYLIB.
       COPY MVALIDUM   OF COPYLIB.

      *
      * SCREEN STUFF
      *
       COPY IOFEEDBACK IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY FUNCTDEF   IN COPYLIB.

       01  DE-FIELDS-1.
           05 VDE-TITLE                  PIC X(35).
           05 VDE-INSTRUCTION            PIC X(75).
           05 VDE-VENDOR.
              10 VDE-VENDOR-1-7          PIC X(07).
              10 VDE-VENDOR-8-10         PIC X(03).
           05 VDE-NAME                   PIC X(44).
           05 VDE-ADDRESS-LINES     OCCURS 6 TIMES.
              10 VDE-ADDRESS             PIC X(44).
           05 VDE-CITY                   PIC X(24).
           05 VDE-STATE                  PIC X(2).
           05 VDE-POSTAL-CODE.
              10 VDE-ZIP                 PIC X(5).
              10 VDE-ZIP-9 REDEFINES VDE-ZIP PIC 9(5).
              10 FILLER                  PIC X(4).
           05 VDE-ZIP-PLACEMENT          PIC X.
           05 VDE-PROVINCE               PIC X(4).
           05 VDE-COUNTRY                PIC X(18).
           05 VDE-CC                     PIC X(2).
           05 VDE-CC-DESC                PIC X(12).
           05 VDE-CONTACT                PIC X(34).
           05 VDE-FAX                    PIC X(24).
           05 VDE-NOTE1                  PIC X(44).
           05 VDE-TELEX                  PIC X(10).
           05 VDE-NOTE2                  PIC X(44).
           05 VDE-PHONE                  PIC X(10).
           05 VDE-FOB                    PIC X(20).
           05 VDE-TERMS.
              10  VDE-TERMS-PCT          PIC X.
              10  VDE-TERMS-DUE-DATE     PIC X.
           05 VDE-MIN-ORDER              PIC X(4).
           05 VDE-INVLESS-IND            PIC X(1).
           05 VDE-EDI-VENDOR             PIC X(1).
           05 VDE-DOLLAR-MAX             PIC X(7).
           05 VDE-EDIFACT-ID             PIC X(1).
           05 VDE-GOODYEAR-CODE          PIC X(17).
           05 VDE-TRADING-ID             PIC X(16).
           05 VDE-STATUS-IND             PIC X.
           05 VDE-EXCODE-IND             PIC X.
           05 VDE-INSTRUCTIONS.
              10 VDE-STD-INST   OCCURS  4 TIMES.
                 15  VDE-STD-INSTR       PIC X(3).
                 15  VDE-BEFORE-AFTER    PIC X.
           05 DE-COMMAND-LINE-1          PIC X(79).

       01  DE-FIELDS-EDI.
           05 VDE-EDI-VENDOR-CODE        PIC X(10).
           05 VDE-EDI-VENDOR-NAME        PIC X(44).
           05 VDE-EDI-FLAGS.
              10  VDE-NEW                PIC X.
              10  VDE-CHANGE             PIC X.
              10  VDE-REPAIR             PIC X.
              10  VDE-CONFIRM            PIC X.
              10  VDE-FOLLOWUP           PIC X.
           05 DE-ERROR-LINE-EDI          PIC X(79).

       COPY HMSGBUF IN COPYLIB.

      *
      * SUBPROGRAM STUFF
      *
       COPY TBLOWUP OF COPYLIB.
       COPY CATREAD IN COPYLIB.

       01  CUSTOM-FKEY-DEFINITIONS.
      *
      *              F1   F2   F3   F4   F5   F6   F7   F8
      *
      *------ FOR HP ONLY ------*
      *    05 FILLER                     PIC X(40)
      *       VALUE "I    I    I    RA   P    I              ".
      *------ FOR HP ONLY ------*
      *------ FOR IBM ONLY ------*
           05 FILLER                     PIC X(40)
      *              F1   F2   F3   F4   F5   F6   F7   F8
              VALUE "I    I         I    I    I         I    ".
      *------ FOR IBM ONLY ------*

       01  CUSTOM-FKEYS-TABLE REDEFINES CUSTOM-FKEY-DEFINITIONS.
           05 CUSTOM-FKEYS OCCURS 1 TIMES PIC X(40).

       COPY TSHWRDFM IN COPYLIB.

       01  VENDOR-TABLE.
           05  VENDOR-CODE-T OCCURS 16.
               10  VC-T                  PIC X(10).

       LINKAGE SECTION.
       01  BASE                          PIC X(10).
       COPY VCOMLINK OF COPYLIB.
       01  SPOOLER-NUMBER                PIC S9(2) BINARY.
       COPY LANGSUB  IN COPYLIB.

       PROCEDURE DIVISION USING BASE, VIEW-COMAREA,
                                SPOOLER-NUMBER,
                                LANGUAGE-PARMS.

       MAIN-LINE-LOGIC.

           PERFORM 1-INIT.
           PERFORM 80-CLEAR-FORM.
           MOVE CUSTOM-FKEYS(1) TO SRF-FKEY-AREA.
           PERFORM 9999-DO-SCREEN-1.

           MOVE VDE-VENDOR TO SAVE-VDE-VENDOR.

           PERFORM UNTIL VIEW-LASTKEY EQUAL EXIT-PROGRAM

             IF VIEW-LASTKEY EQUAL F7-KEY

               PERFORM 80-CLEAR-FORM

             ELSE

               IF VDE-VENDOR EQUAL SPACES

      *
      * T62: THIS FIELD IS REQUIRED
      *
                   MOVE 20 TO LANG-SETNUM
                   MOVE 62 TO LANG-MSGNUM
                   PERFORM 999-CATREAD
                   MOVE 1 TO SRF-ERROR-FLD

               ELSE

                 PERFORM 81-FIND-VENDOR-INFO
                 IF SRF-ERROR-FLD EQUAL ZERO
                   PERFORM 82-GET-VENDOR-INFO
                 END-IF

               END-IF

             END-IF

             MOVE CUSTOM-FKEYS(1) TO SRF-FKEY-AREA
             PERFORM 9999-DO-SCREEN-1
      *------------ SHOW EDI SCREEN.
             IF VIEW-LASTKEY EQUAL ENTER-KEY AND
                VDE-EDI-VENDOR = "Y" AND
                VDE-VENDOR = SAVE-VDE-VENDOR
                 MOVE B"1" TO IND(10)
                 MOVE VDE-VENDOR TO VDE-EDI-VENDOR-CODE
                 PERFORM 9999-DO-SCREEN-2
                 MOVE "INQVEND" TO VIEW-NFNAME
                 PERFORM 9999-GETNEXTFORM
             END-IF

             MOVE VDE-VENDOR TO SAVE-VDE-VENDOR

           END-PERFORM.

           PERFORM 9999-CLOSES.
           GOBACK.

      ***************************************************************
      * PARAGRAPH : 1-INIT                                          *
      * PURPOSE   : TO SETUP FUNCTION KEYS FOR DO-SCREEN PERFORMS   *
      *             , GET FORM, TITLE AND INSTRUCTION.              *
      ***************************************************************
       1-INIT.

           MOVE 0 TO SRF-KEYSET.
           PERFORM 9999-OPENS.

      *
      * MOVE SPOOLER NUMBER OVER FOR DO-SCREEN CALL
      * AND FLAG NO "BEHIND THE BACK PROCESSING"
      *
           MOVE SPOOLER-NUMBER TO SRF-SPOOL-PRT-NO.
           MOVE "NNNN" TO SRF-RET-FLAGS.
           MOVE SPACES TO VENDOR-TABLE.

      *
      * V E N D O R  I N Q U I R Y
      *
           MOVE 22 TO LANG-SETNUM.
           MOVE 18 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-TITLE.

      *
      * E5: ENTER THE VENDOR CODE AND PRESS ENTER
      *
           MOVE 5 TO LANG-SETNUM.
           MOVE 5 TO LANG-MSGNUM.
           PERFORM 999-CATREAD.
           MOVE MESSAGE-BUFFER TO SAVE-INSTRUCTION.

           MOVE "INQVEND" TO VIEW-NFNAME.
           PERFORM 9999-GETNEXTFORM.

      ***************************************************************
      * PARAGRAPH : 2100-BLOWUP                                     *
      * PURPOSE   : TO BLOWUP THE PROGRAM.                          *
      ***************************************************************
       2100-BLOWUP.
           MOVE "TINQVEND"  TO BU-PGM-NAME.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           MOVE VEN-ARG     TO BU-DISPLAY-FLD (2).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.

      ***************************************************************
      * PARAGRAPH : 80-CLEAR-FORM                                   *
      * PURPOSE   : TO CLEAR THE FORM AND MESSAGE AREA.             *
      ***************************************************************
       80-CLEAR-FORM.
           MOVE SPACES TO DE-FIELDS-1
                          VENDOR-TABLE.
           MOVE 0      TO VSUB.
           MOVE SAVE-TITLE TO VDE-TITLE.
           MOVE SAVE-INSTRUCTION TO VDE-INSTRUCTION.
           MOVE SPACES TO MESSAGE-BUFFER.
           PERFORM 9999-RESET-SCREEN.

      ***************************************************************
      * PARAGRAPH : 81-FIND-VENDOR-INFO                             *
      * PURPOSE   : TO FIND VENDOR INFORMATION FOR SELECTED VENDOR. *
      *             IF IT'S NOT FOUND THEN USE KSAM FILE            *
      *             TO GIVE USER CHOICES OF VENDORS.                *
      ***************************************************************
       81-FIND-VENDOR-INFO.

      *
      * CLEAR BUFFER AND MOVE VENDOR CODE TO SEARCH FOR INTO VEN-ARG
      *
           MOVE VDE-VENDOR TO VEN-ARG.
           MOVE SPACES TO DE-FIELDS-1.
           MOVE VEN-ARG TO VDE-VENDOR.
           MOVE SAVE-TITLE TO VDE-TITLE.
           MOVE SAVE-INSTRUCTION TO VDE-INSTRUCTION.

      *
      * SEARCH FOR VENDOR INFORMATION
      *

      *-----  CALL ALT KEY SUB-PGM TO GET ALT KEY IF ONE EXISTS
           MOVE VEN-ARG TO ALT-KEY-ARG.
           CALL "TALTVENK" USING RET-CODE-TALTVENK,
                                 BASE-TALTVENK,
                                 STATUS-AREA,
                                 ALT-KEY-ARG,
                                 ALT-VEND-CODE.
           IF RET-CODE-TALTVENK NOT EQUAL "00"
              MOVE "TALTVENK ERROR 81-FVI" TO BU-DISPLAY-MSG
              PERFORM 2100-BLOWUP.
           MOVE ALT-VEND-CODE   TO VEN-ARG VDE-VENDOR.

           PERFORM 9999-CHAINHD-DVENDOR-VN-I.
           PERFORM 9999-GETNEXT-DVENDOR-VN-I.
           IF END-OF-CHAIN

      *
      * NOT FOUND -- GIVE USER OPTIONS TO SELECT FROM LIST OF VENDORS
      *
             MOVE SPACES TO MANUFACT-KEYWORD-INQUIRY
             MOVE "V" TO MKW-TYPE
             MOVE VEN-ARG TO MKW-PASS-AREA
             CALL "SMKWINQ" USING VIEW-COMAREA,
                                  MANUFACT-KEYWORD-INQUIRY,
                                  BASE, LANGUAGE-PARMS,
                                  VENDOR-TABLE
             MOVE "INQVEND" TO VIEW-NFNAME
             PERFORM 9999-GETNEXTFORM
             MOVE MKW-RETURN-AREA TO VDE-VENDOR, VEN-ARG
             IF MKW-MESSAGE-AREA NOT EQUAL SPACES

      *
      * AN ERROR OCCURED ON THE LIST OF VENDORS
      *
               MOVE MKW-MESSAGE-AREA TO MESSAGE-BUFFER
               MOVE 1 TO SRF-ERROR-FLD

             ELSE

               IF MKW-RETURN-STATUS EQUAL "S"

      *
      * THE USER SELECTED A VENDOR -- CHECK TO SEE IF IT EXISTS
      *
                 PERFORM 9999-CHAINHD-DVENDOR-VN-I
                 PERFORM 9999-GETNEXT-DVENDOR-VN-I
                 IF NOT GOOD-CALL

      *
      * V3: VENDOR CODE DOESN'T EXIST
      *
                   MOVE  22 TO LANG-SETNUM
                   MOVE   3 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 1 TO SRF-ERROR-FLD

                 END-IF
               END-IF
             END-IF
           END-IF.

      ***************************************************************
      * PARAGRAPH : 82-GET-VENDOR-INFO                              *
      * PURPOSE   : TO GET THE VENDORS INFORMATION AND PUT IT IN THE*
      *             SCREEN BUFFER.                                  *
      ***************************************************************
       82-GET-VENDOR-INFO.

           MOVE 0 TO SUB.
           MOVE "N" TO VDE-EDI-VENDOR.
           PERFORM UNTIL END-OF-CHAIN

             EVALUATE VEN-ITM-NO
               WHEN "00"

                 MOVE VEN-NAME TO VDE-NAME
                                  VDE-EDI-VENDOR-NAME

               WHEN "01" THRU "06"

                 ADD 1 TO SUB
                 MOVE VEN-ADDRESS TO VDE-ADDRESS(SUB)

               WHEN "07"

                 MOVE VEN-CITY TO VDE-CITY
                 MOVE VEN-STATE-CODE TO VDE-STATE
                 MOVE VEN-PROV-CODE TO VDE-PROVINCE
                 MOVE VEN-ZIP TO VDE-POSTAL-CODE
                 MOVE VEN-ZIP-BEFORE-CITY TO VDE-ZIP-PLACEMENT

               WHEN "08"

                 MOVE VEN-COUNTRY TO VDE-COUNTRY
                 MOVE VEN-EDI-FLAGS TO VDE-EDI-FLAGS

               WHEN "09"

                 MOVE VEN-CONTACT TO VDE-CONTACT
                 MOVE VEN-CONTACT-PHONE TO VDE-PHONE

               WHEN "10"

                 MOVE VEN-FAX TO VDE-FAX
                 MOVE VEN-MIN-ORDER TO VDE-MIN-ORDER
                 MOVE VEN-INVLESS-IND TO VDE-INVLESS-IND
                 MOVE VEN-TELEX TO VDE-TELEX
                 MOVE VEN-CC TO VDE-CC, UM-ARG
                 PERFORM 9999-GETKEY-MVALIDUM-UM-I
                 IF NO-ENTRY
                   MOVE "????????????" TO VDE-CC-DESC
                 ELSE
                   MOVE VALID-CURRENCY-DESC TO VDE-CC-DESC
                 END-IF

               WHEN "12"

                 MOVE VEN-12-RCD TO VDE-NOTE1

               WHEN "13"

                 MOVE VEN-13-RCD TO VDE-NOTE2

               WHEN "14"

                 MOVE "Y" TO VDE-EDI-VENDOR
                 MOVE VEN-DOLLAR-MAX TO VDE-DOLLAR-MAX
                 MOVE VEN-EDIFACT-ID TO VDE-EDIFACT-ID
                 MOVE VEN-GOODYEAR-CODE TO VDE-GOODYEAR-CODE
                 MOVE VEN-TRADING-ID TO VDE-TRADING-ID
                 MOVE VEN-STATUS-IND TO VDE-STATUS-IND
                 MOVE VEN-EXCODE-IND TO VDE-EXCODE-IND

               WHEN "16"

                 MOVE VEN-PO-FOB     TO VDE-FOB
                 MOVE VEN-PO-TERMS   TO VDE-TERMS

               WHEN "17"

                 MOVE VEN-17-RCD     TO VDE-INSTRUCTIONS

             END-EVALUATE

             PERFORM 9999-GETNEXT-DVENDOR-VN-I

           END-PERFORM.

       9999-OPENS.
           OPEN INPUT MVALIDUM-UM-I.
           OPEN INPUT DVENDOR-VN-I.
           OPEN I-O DISPLAY-FILE.

       9999-CLOSES.
           CLOSE DISPLAY-FILE,
                 MVALIDUM-UM-I,
                 DVENDOR-VN-I.

       9999-GETNEXTFORM.
       9999-PUTWINDOW.
       9999-INITFORM.
       9999-SHOWFORM.
       9999-SETKEYLABEL.
       998-WRITE-SCREEN.
           IF SRF-CURSOR-FLD > ZERO
               MOVE B"1" TO IND (SRF-CURSOR-FLD)
               MOVE ZERO TO SRF-CURSOR-FLD.
           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       998-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE EXIT-PROGRAM TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.
           IF SRF-KEYSET = 1 OR 3 OR 5 OR 7
               MOVE "I" TO SRF-FKEY (7).
           IF SRF-KEYSET > 0
               MOVE "I" TO SRF-FKEY (5).
           IF SRF-KEYSET = 1 OR 2 OR 5 OR 6 OR 7 OR 8
               MOVE "I" TO SRF-FKEY (4).
           IF SRF-KEYSET = 5 OR 6
               MOVE "I" TO SRF-FKEY (8), SRF-FKEY (6)
           ELSE
           IF SRF-KEYSET = 7 OR 8
               MOVE "I" TO SRF-FKEY (1), SRF-FKEY (2), SRF-FKEY (8).
           MOVE SPACES TO MESSAGE-BUFFER-1.
           IF VIEW-LASTKEY = ENTER-KEY
               IF SRF-ENTER-FLAG = "I"
      *            "E28: 'ENTER' NOT VALID HERE"
                   MOVE 5 TO LANG-SETNUM
                   MOVE 28 TO LANG-MSGNUM
                   MOVE 05028 TO CATREAD-MSG-NUMBER
                   MOVE 1 TO SRF-ERROR-FLD
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               ELSE
                   NEXT SENTENCE
           ELSE
           IF SRF-FKEY (VIEW-LASTKEY) = "I"
      *        "I10: INVALID FUNCTION KEY"
               MOVE 9 TO LANG-SETNUM
               MOVE 10 TO LANG-MSGNUM
               MOVE 09010 TO CATREAD-MSG-NUMBER
               MOVE 1 TO SRF-ERROR-FLD
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           IF MESSAGE-BUFFER-1 = SPACES
               MOVE SPACES TO SRF-FKEY-AREA, SRF-ENTER-FLAG.
       9989-WS-X.
           EXIT.

       9999-RESET-SCREEN.
           MOVE B"1" TO IND(97).
           MOVE B"1" TO IND(96).

       9999-GETBUFFER-1.
           MOVE DISPLAY-REC TO DE-FIELDS-1.

       9999-PUTBUFFER-1.
           MOVE DE-FIELDS-1 TO DISPLAY-REC.

       9999-SETERROR-1.
           MOVE MESSAGE-BUFFER TO DE-COMMAND-LINE-1.
           IF SRF-MSG-AND-GO = "Y"
             MOVE "N" TO SRF-MSG-AND-GO
             MOVE B"1" TO IND (98)
             MOVE DE-FIELDS-1 TO DISPLAY-REC
             PERFORM 998-WRITE-SCREEN
             READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
               NO DATA CONTINUE
             END-READ
             MOVE B"0" TO IND(98)
             PERFORM 998-WRITE-SCREEN
             MOVE SPACES TO MESSAGE-BUFFER
           ELSE
             MOVE B"1" TO IND (SRF-ERROR-FLD).

       9999-DO-SCREEN-1.
           MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-1.
           IF SRF-ERROR-FLD > ZERO
               PERFORM 9999-SETERROR-1.
           PERFORM 9999-PUTBUFFER-1.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           PERFORM 9999-GETBUFFER-1.
           IF SRF-LAST-FORM NOT = VIEW-NFNAME
               MOVE VIEW-NFNAME       TO SRF-LAST-FORM
               MOVE DE-COMMAND-LINE-1 TO SRF-SAVE-COMMAND-LINE.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               GO TO 9999-DO-SCREEN-1.
           IF SRF-ERROR-FLD > ZERO
               MOVE ZERO TO SRF-ERROR-FLD
               MOVE SRF-SAVE-COMMAND-LINE TO DE-COMMAND-LINE-1.
           IF VIEW-LASTKEY = 3
               NEXT SENTENCE
           ELSE
           IF VENDOR-TABLE = SPACES
               NEXT SENTENCE
           ELSE
           ADD 1 TO VSUB
           IF VSUB > 16
               MOVE 7      TO VIEW-LASTKEY
           ELSE
           IF VC-T (VSUB) = SPACES
               MOVE 7      TO VIEW-LASTKEY
           ELSE
           MOVE VC-T (VSUB) TO VDE-VENDOR.

       9999-GETBUFFER-2.
           MOVE DISPLAY-REC TO DE-FIELDS-EDI.

       9999-PUTBUFFER-2.
           MOVE DE-FIELDS-EDI TO DISPLAY-REC.

       9999-DO-SCREEN-2.
           MOVE "EDIVEND" TO VIEW-NFNAME.
           PERFORM 9999-PUTBUFFER-2.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           PERFORM 9999-GETBUFFER-2.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
           IF MESSAGE-BUFFER-1  = SPACES
               MOVE "* ERROR ON THIS FIELD *" TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9999-CHAINHD-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-I.
           START DVENDOR-VN-I KEY = VENCDE OF DVENDOR-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.

       9999-GETKEY-MVALIDUM-UM-I.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MVALIDUM-UM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

