       IDENTIFICATION DIVISION.
       PROGRAM-ID. TINQMATL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1202
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
           SELECT WORK-FILE ASSIGN TO DISK-WORKR19.
       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS PRINTF.
       01  PRINTF                           PIC X(132).
       SD  SORT-FILE
           RECORD CONTAINS 220 CHARACTERS
           DATA RECORD IS SORTF.
       01  SORTF.
           05  SORT-WONUM                   PIC X(10).
           05  SORT-EQNUM                   PIC X(6).
           05  SORT-PONUM                   PIC X(10).
           05  SORT-ITEM-NO                 PIC X(4).
           05  SORT-ORIG                    PIC X(4).
           05  SORT-CORPCODE                PIC X(8).
           05  SORT-REQDATE                 PIC X(6).
           05  SORT-DESC1                   PIC X(80).
           05  SORT-DESC2                   PIC X(80).
           05  SORT-REQNO                   PIC X(6).
           05  FILLER                       PIC X(6).
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1202.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       FD  WORK-FILE
           LABEL RECORDS ARE STANDARD
           RECORD CONTAINS 220 CHARACTERS
           DATA RECORD IS WORKF.
       01  WORKF.
           05  WORK-DATA.
               10  WORK-WONUM               PIC X(10).
               10  WORK-EQNUM               PIC X(6).
               10  WORK-PONUM               PIC X(10).
               10  WORK-ITEM-NO             PIC X(4).
               10  WORK-ORIG                PIC X(4).
               10  WORK-CORPCODE            PIC X(8).
               10  WORK-REQDATE.
                   15  WORK-REQDATE-YY      PIC XX.
                   15  WORK-REQDATE-MM      PIC XX.
                   15  WORK-REQDATE-DD      PIC XX.
               10  WORK-DESC1               PIC X(80).
               10  WORK-DESC2               PIC X(80).
               10  WORK-REQNO               PIC X(6).
               10  FILLER                   PIC X(6).
       WORKING-STORAGE SECTION.
       77  EOF-SW                           PIC 9.
       77  LINE-CTR                         PIC 99.
       01  BASE-STORES                      PIC X(24).
       01  BLOWUP-BASE                   PIC X(16).
       COPY CCHKOBJ    IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
       COPY CMANREQ    IN COPYLIB.
       01  COMPRESS-PRINT                PIC X(8).
       01  DATE-WA.
           05  DATE-WA-CC                   PIC XX.
           05  DATE-WA-YY                   PIC XX.
           05  DATE-WA-MM                   PIC XX.
           05  DATE-WA-DD                   PIC XX.
       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  WPFD-STATUS                  PIC XX.
           05  WPF-STATUS                   PIC XX.
           05  WF-STATUS                    PIC XX.
       01  FNUM                             PIC S9(4) COMP-4 VALUE 0.
       01  HD-FILE-NAME PIC X(17) VALUE "HMMISR19.PUB".
       01  HD-RET-CODE                      PIC S9(4) COMP-4 VALUE 0.
       01  H0.
           05  FILLER  PIC X(34) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE "MATERIAL EXPECT DATE".
           05  FILLER  PIC X(35) VALUE SPACES.
       01  H1.
           05  FILLER  PIC X(43) VALUE SPACES.
           05  FILLER  PIC XX    VALUE "VS".
           05  FILLER  PIC X(44) VALUE SPACES.
       01  H2.
           05  FILLER  PIC X(33) VALUE SPACES.
           05  FILLER  PIC X(22) VALUE "MATERIAL REQUIRED DATE".
           05  FILLER  PIC X(34) VALUE SPACES.
       01  H3.
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(7)  VALUE "W/O NUM".
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE "EQ NUM".
           05  FILLER  PIC XXX   VALUE SPACES.
           05  FILLER  PIC X(12) VALUE "PO NUM -RCVR".
           05  FILLER  PIC XXX   VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE "PO ITM".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE "ORIG".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE "REQ DATE".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE "EXP DATE".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE "RCV DATE".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE "QTY RCVD".
       01  H4.
           05  FILLER  PIC X(35) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "(DESCRIPTION)".
           05  FILLER  PIC X(32) VALUE SPACES.
       01  H5.
           05  FILLER  PIC X(89) VALUE ALL "-".
       01  D1.
           05  FILLER  PIC X.
           05  D-WO    PIC X(10).
           05  FILLER  PIC XX.
           05  D-EQ    PIC X(6).
           05  FILLER  PIC XX.
           05  D-PO-RCVR.
               10  D-PO    PIC X(10).
               10  D-DASH  PIC X.
               10  D-RCVR  PIC XXX.
           05  FILLER  PIC XXX.
           05  D-PO-I  PIC X(4).
           05  FILLER  PIC XXX.
           05  D-ORIG  PIC X(4).
           05  FILLER  PIC XX.
           05  D-RDAT.
               10  D-RD-MM  PIC XX.
               10  D-RD-S1  PIC X.
               10  D-RD-DD  PIC XX.
               10  D-RD-S2  PIC X.
               10  D-RD-YY  PIC XX.
           05  FILLER  PIC XX.
           05  D-XDAT.
               10  D-XD-MM  PIC XX.
               10  D-XD-S1  PIC X.
               10  D-XD-DD  PIC XX.
               10  D-XD-S2  PIC X.
               10  D-XD-YY  PIC XX.
           05  FILLER  PIC XX.
           05  D-VDAT.
               10  D-VD-MM  PIC XX.
               10  D-VD-S1  PIC X.
               10  D-VD-DD  PIC XX.
               10  D-VD-S2  PIC X.
               10  D-VD-YY  PIC XX.
           05  FILLER       PIC XX.
           05  D-QD         PIC ZZZZZZZZ.
       01  D2.
           05  FILLER  PIC X     VALUE SPACE.
           05  D-DESC  PIC X(80) VALUE SPACES.
       COPY LANGSUB OF COPYLIB.
       01  LAST-WO-BUFF.        COPY MLASTWO OF COPYLIB.
       01  NORMAL-PRINT                  PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TINQMATL".
           05  PROGRAM-TYPE        PIC X(02) VALUE "RE".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(13) VALUE "R19 REPORT - ".
                   15  FILLER      PIC X(16) VALUE "PRODUCES REPORT ".
                   15  FILLER      PIC X(08) VALUE "SHOWING ".
                   15  FILLER      PIC X(14) VALUE "REQUISITIONED ".
                   15  FILLER      PIC X(09) VALUE "MATERIAL ".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.
       01  RET-CODE                         PIC XX.
       COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP IN COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       01  WO-PARTS-DATA.      COPY DWOPARTS OF COPYLIB.
       01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC            PIC X(80).
       PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-REC.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO PRINTF
           WRITE PRINTF FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE PRINT-FILE.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
           CLOSE WORK-FILE.
           GOBACK.
       1-HSK.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'WORKR19'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "WORKR19"     TO CCRTFILE-FILE.
           MOVE "0220"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'WORKR19' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.

           OPEN INPUT  WO-PARTS-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
           OPEN OUTPUT WORK-FILE.

           MOVE LOW-VALUES TO STATUS-AREA.
           MOVE 0                 TO EOF-SW.
           MOVE 59                TO LINE-CTR.

           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.

           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * TINQMATL" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "           TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE                TO BU-DISPLAY-FLD9 (1)
               PERFORM 998-BLOWUP.

           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRINTF FROM COMPRESS-PRINT AFTER ADVANCING 0 LINES.

       6-MAIN.
           SORT SORT-FILE ON ASCENDING KEY SORT-WONUM
               INPUT PROCEDURE   7-SORT-MATERIAL-RECS
               OUTPUT PROCEDURE  8-WRITE-WORKFILE.
           CLOSE WORK-FILE.
           OPEN INPUT WORK-FILE.
           PERFORM 61-WRITE-DATA THRU 61-WD-EXIT.
       6-MAIN-EXIT.   EXIT.

       61-WRITE-DATA.
           READ WORK-FILE NEXT    AT END GO TO 61-WD-EXIT.
           MOVE SPACES TO D1.
           MOVE WORK-WONUM TO D-WO.
           MOVE WORK-EQNUM TO D-EQ.
           MOVE WORK-PONUM TO D-PO.
           MOVE WORK-ORIG TO D-ORIG.
           MOVE SPACES TO CMR-DATA CMR-DESC CMR-REMARKS
               CMR-RETURNED-DATA CMR-REMARKS BU-DISPLAY-MSG.
           MOVE "IN" TO CMR-CALL-MODE.
           MOVE WORK-WONUM TO CMR-WO-NUMBER.
           MOVE WORK-REQNO TO  CMR-REQ-NUMBER.
           CALL "CMANINQ" USING BASE-STORES
                                CMR-CALL-MODE
                                CMR-DATA
                                CMR-DESC
                                CMR-REMARKS
                                CMR-RETURNED-DATA
                                CMR-MISC-PARMS
                                LANGUAGE-PARMS
                                ESC-NAME
                                STATUS-AREA
                                BU-DISPLAY-MSG.
           IF CMR-RETURN-STATUS NOT = "OK" GO TO 61-WRITE-DATA.
           IF WORK-REQDATE = SPACES
               MOVE SPACES TO D-RDAT
           ELSE
           MOVE WORK-REQDATE-YY TO D-RD-YY
           MOVE "/" TO D-RD-S1
           MOVE WORK-REQDATE-MM TO D-RD-MM
           MOVE "/" TO D-RD-S2
           MOVE WORK-REQDATE-DD TO D-RD-DD.
           IF CMR-PO-EXPECT-DATE-CN NOT = "        "
               MOVE CMR-PO-EXPECT-DATE-CN TO DATE-WA
               MOVE DATE-WA-MM TO D-XD-MM
               MOVE "/" TO D-XD-S1
               MOVE DATE-WA-DD TO D-XD-DD
               MOVE "/" TO D-XD-S2
               MOVE DATE-WA-YY TO D-XD-YY
           ELSE
           MOVE SPACES TO D-XDAT.
           IF CMR-PO-NO-AND-REL = "              "
               MOVE SPACES                    TO  D-PO
                                                  D-DASH
                                                  D-RCVR
                                                  D-VDAT
                                                  D-QD
                                                  D-PO-I
               GO TO 61-WD-CONT.
           MOVE CMR-PO-NO-AND-REL TO D-PO.
           IF CMR-PO-RCVR = "   " OR "000"
               MOVE " " TO D-DASH
               MOVE "   " TO D-RCVR
           ELSE
           MOVE "-" TO D-DASH
           MOVE CMR-PO-RCVR TO D-RCVR.
           IF CMR-PO-DATE-RCVD-CN NOT = "        "
               MOVE CMR-PO-DATE-RCVD-CN TO DATE-WA
               MOVE DATE-WA-MM TO D-VD-MM
               MOVE "/" TO D-VD-S1
               MOVE DATE-WA-DD TO D-VD-DD
               MOVE "/" TO D-VD-S2
               MOVE DATE-WA-YY TO D-VD-YY
           ELSE
           MOVE SPACES TO D-VDAT.
           MOVE CMR-PO-QTY-DLVR TO D-QD.
           MOVE CMR-PO-ITM-NO TO D-PO-I.
       61-WD-CONT.
           IF LINE-CTR > 58 PERFORM 610-WRITE-HEADERS.
           WRITE PRINTF FROM D1 AFTER ADVANCING 1 LINES.
           MOVE CMR-DESC-LINE (1) TO D-DESC.
           WRITE PRINTF FROM D2 AFTER ADVANCING 1 LINES.
           MOVE CMR-DESC-LINE (2) TO D-DESC.
           WRITE PRINTF FROM D2 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING 1 LINES.
           ADD 4 TO LINE-CTR.
           GO TO 61-WRITE-DATA.

       61-WD-EXIT.    EXIT.

       610-WRITE-HEADERS.
           MOVE 0 TO LINE-CTR.
           WRITE PRINTF FROM H0 AFTER ADVANCING NEW-PAGE.
           WRITE PRINTF FROM H1 AFTER ADVANCING 1 LINES.
           WRITE PRINTF FROM H2 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING 1 LINES.
           WRITE PRINTF FROM H3 AFTER ADVANCING 1 LINES.
           WRITE PRINTF FROM H4 AFTER ADVANCING 1 LINES.
           WRITE PRINTF FROM H5 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING 1 LINES.
           ADD 8 TO LINE-CTR.

       COPY OVRPFCALL IN COPYLIB.

       998-BLOWUP.
           MOVE "TVWOREV" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.
       7-SORT-MATERIAL-RECS.
           MOVE 0 TO COND-WORD.
           MOVE "M " TO PRTSTATUS OF WPFDREC.
           START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 2-EOJ.
           PERFORM 7-SMR-LOOP THRU 7-SMR-EXIT
               UNTIL COND-WORD = 15.
       7-SORT-MATERIAL-EXIT.    EXIT.

       7-SMR-LOOP.
           READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
              AT END    MOVE 15 TO COND-WORD.
           IF PRT-STATUS-1 NOT = "M" MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 7-SMR-EXIT.
           IF PRT-REQ-NO = "            " OR "CANCEL      "
               GO TO 7-SMR-LOOP.
           PERFORM 7-RETRIEVE-PLANNED THRU 7-RP-EXIT.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           MOVE 0 TO COND-WORD
           GO TO 7-SMR-LOOP.
           MOVE SPACES TO SORTF.
           MOVE PRT-WO-NU TO SORT-WONUM.
           MOVE EQUIP-NUM-P TO SORT-EQNUM.
           MOVE PRT-DESC TO SORT-DESC1.
           MOVE PRT-DESC-2 TO SORT-DESC2.
           MOVE PRT-PO-NO TO SORT-PONUM.
           MOVE PRT-ORIGINATOR TO SORT-ORIG.
           MOVE PRT-NUM TO SORT-CORPCODE.
           MOVE PRT-ITEM-NO TO SORT-ITEM-NO.
           MOVE PRT-DATE-USED TO SORT-REQDATE.
           MOVE PRT-REQ-NO TO SORT-REQNO.
           RELEASE SORTF.
           GO TO 7-SMR-LOOP.
       7-SMR-EXIT.    EXIT.

       7-RETRIEVE-PLANNED.
           MOVE SPACES TO WO-PLANNED-DATA.
           MOVE 0 TO COND-WORD.
           MOVE PRT-WO-NU TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 7-RP-EXIT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
              AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
       7-RP-EXIT.    EXIT.

       8-WRITE-WORKFILE.
           PERFORM 8-WW-LOOP THRU 8-WW-EXIT.
       8-WW-LOOP.
           RETURN SORT-FILE AT END GO TO 8-WW-EXIT.
           MOVE SORTF TO WORK-DATA.
           WRITE WORKF.
           GO TO 8-WW-LOOP.
       8-WW-EXIT.    EXIT.
