000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TINTMEMP.
000400 AUTHOR.              JIM COFFMAN.
000500 DATE-WRITTEN.        05/21/94.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*D   THIS PROGRAM WILL SET THE APPROVAL BUCKET DOLLAR AMOUNTS IN
001100*D   MEMPL TO ZEROES.
001700 ENVIRONMENT DIVISION.
001800 CONFIGURATION SECTION.
001900 SOURCE-COMPUTER.  AS400.
002000 OBJECT-COMPUTER.  AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL
                  ASSIGN TO DATABASE-MCFPCS4200
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.
002200 DATA DIVISION.
       FILE SECTION.
       FD  MEMPL
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC.
           COPY DDS-MCRPCS4200  OF MCFPCS4200.
002300 WORKING-STORAGE SECTION.
       77  SUB                           PIC S9(4) COMP-4.
       01  BLOWUP-BASE                   PIC X(16).

       01  BUF-MEMPL-NEW.
           05  MEMPL-NEW-EMP             PIC X(4).
           05  MEMPL-NEW-LEVEL           PIC X(2).
           05  MEMPL-NEW-FLAGS OCCURS 16 TIMES.
               10  MEMPL-NEW-FLAG        PIC X.
           05  MEMPL-NEW-TODAY           PIC 9(8).
           05  MEMPL-NEW-TODAY-X REDEFINES MEMPL-NEW-TODAY
                                         PIC X(8).
           05  MEMPL-NEW-WEEKS           PIC 9(8).
           05  MEMPL-NEW-WEEKS-X REDEFINES MEMPL-NEW-WEEKS
                                         PIC X(8).
           05  MEMPL-NEW-TOTAL           PIC 9(8).
           05  MEMPL-NEW-TOTAL-X REDEFINES MEMPL-NEW-TOTAL
                                         PIC X(8).
           05  MEMPL-USERID              PIC X(8).

       COPY DBSTAT     IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       COPY TBLOWUP    IN COPYLIB.

       COPY VCOMLINK   IN COPYLIB.

009400 PROCEDURE DIVISION.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.

       2-EOJ.
           CLOSE MEMPL.
018900     GOBACK.
019000
076200 2-BLOWUP.
076300     MOVE "TINTMEMP" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       1-HSK.
           OPEN I-O MEMPL.

       6-MAIN.
           MOVE 0 TO COND-WORD.
           READ MEMPL NEXT INTO BUF-MEMPL-NEW
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
           IF COND-WORD = 11 GO TO 6-MAIN-X.
           IF MEMPL-NEW-TODAY-X = SPACES
               MOVE ZEROES TO MEMPL-NEW-TODAY.
           IF MEMPL-NEW-WEEKS-X = SPACES
               MOVE ZEROES TO MEMPL-NEW-WEEKS.
           IF MEMPL-NEW-TOTAL-X = SPACES
               MOVE ZEROES TO MEMPL-NEW-TOTAL.
           MOVE 0 TO SUB.
           PERFORM 60-CHECK-FLAGS THRU 60-CF-X.
           REWRITE MEMPL-REC FROM BUF-MEMPL-NEW.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "MEMPL REWRITE ERROR *TINTMEMP*"
                   TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           GO TO 6-MAIN.
       6-MAIN-X.    EXIT.

       60-CHECK-FLAGS.
           ADD 1 TO SUB.
           IF SUB > 16 GO TO 60-CF-X.
           IF MEMPL-NEW-FLAG (SUB) = "Y" GO TO 60-CHECK-FLAGS.
           IF MEMPL-NEW-FLAG (SUB) = "N" GO TO 60-CHECK-FLAGS.
           IF MEMPL-NEW-FLAG (SUB) = " " GO TO 60-CHECK-FLAGS.
           MOVE " " TO MEMPL-NEW-FLAG (SUB).
           GO TO 60-CHECK-FLAGS.
       60-CF-X.    EXIT.
