       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVPRPT.
       AUTHOR.        LS BAKER/A TREUDLER.
       DATE-WRITTEN.  MAY 2, 1984.

      *D REMARKS.       INVOICE PROCESSING.
      *D                THIS PROGRAM READS THE PO-RLSE FILE CREATED IN
      *D                THE PRELIMINARY REPORT FRONT-END PROGRAM (TINVPREP).
      *D                IT SORTS THE PO-RLSE NUMBERS IN ASCENDING ORDER
      *D                AND PRODUCES A REPORT SHOWING PURCHASE ORDER,
      *D                RECEIVING SLIP AND FREIGHT INFORMATION, AND
      *D                INVOICE DATA FOR THOSE PO-RLSE NUMBERS.
      *D
      *C         APRIL 18,1985;  ADDED INVOICE INFORMATION TO THE
      *C                         REPORT.  -B. WINTER.
      *C
      *C         JUNE 25, 1985;  ADDED TAX CODE, NO CHECK INDICATOR,
      *C                         NINTH CE ENTRY, AND INVOICE STATUS
      *C                         TO REPORT.  -B. WINTER.
      *C
      *C  MAY 10, 1994    CR KALMAN        REQUEST # 6502
      *C  ALLOWED PREPAID FREIGHT INFORMATION TO APPEAR ON THE REPORT.
      *C
      *C  JUNE 23, 1994   CR KALMAN
      *C  ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  JULY 11, 1996   CA YODER
      *C  RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.      C01 IS NEWPAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT  SORT-FILE ASSIGN TO DISK-SORT.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-I
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-I-PO
                  ASSIGN TO DATABASE-MCFLCS1201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-I-CDE
                  ASSIGN TO DATABASE-MCFLCS1202
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHT-I-PO
                  ASSIGN TO DATABASE-MCFLCS2401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHT-I-REG
                  ASSIGN TO DATABASE-MCFLCS2404
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCT-I
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITM-I
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS  133  CHARACTERS.
       01  PRINT-RCD                 PIC X(133).

       SD  SORT-FILE
           RECORD CONTAINS  14  CHARACTERS.
       01  SORT-RCD.
           05  SD-PO-RLSE            PIC X(14).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPODATAITM-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-I.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  DRCVITEM-I-PO
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC-I-PO.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  DRCVITEM-I-CDE
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC-I-CDE.
           COPY DDS-MCRPCS1200  OF MCFLCS1202.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DPOFREIGHT-I-PO
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC-I-PO.
           COPY DDS-MCRPCS2400  OF MCFLCS2401.

       FD  DPOFREIGHT-I-REG
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC-I-REG.
           COPY DDS-MCRPCS2400  OF MCFLCS2404.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC-I.
           COPY DDS-MCRPCS2500  OF MCFLCS2502.

       FD  DINVACCT-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-REC-I.
           COPY DDS-MCRPCS2700  OF MCFLCS2701.

       FD  DINVITM-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-REC-I.
           COPY DDS-MCRPCS2600  OF MCFLCS2601.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

9406CK 01  SCOPE                        PIC X.

       01  HOLD-DESC                 PIC X(80) VALUE SPACES.
      *************************************************************
      **                                                         **
      **             S U B S C R I P T   A R E A                 **
      **                                                         **
      *************************************************************

       01  SUBSCRIPTS.
           05  VEN-SUB               PIC S9(4)    VALUE ZERO  COMP-4.
           05  COM-SUB               PIC S9(4)    VALUE ZERO  COMP-4.
           05  RS-SUB                PIC S9(4)    VALUE ZERO  COMP-4.

      *************************************************************
      **                                                         **
      **             R E P O R T   H E A D I N G S               **
      **                                                         **
      *************************************************************

       01  MAJOR-HEAD1.
           05  FILLER                PIC X(8)     VALUE "TINVPRPT".
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(38)
                VALUE "I N V O I C E   P R O C E S S I N G - ".
           05  FILLER                PIC X(18)
                VALUE "PRELIMINARY REPORT".
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(6)     VALUE "DATE  ".
           05  MH1-DATE              PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(5)     VALUE SPACE.
           05  FILLER                PIC X(6)     VALUE "TIME  ".
           05  MH1-TIME              PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(5)     VALUE SPACE.
           05  FILLER                PIC X(5)     VALUE "PAGE ".
           05  MH1-PAGE              PIC ZZZZ9    VALUE ZERO.

       01  MAJOR-HEAD1C.
           05  FILLER                PIC X(8)     VALUE "TINVPRPT".
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(38)
                VALUE "I N V O I C E   P R O C E S S I N G - ".
           05  FILLER                PIC X(18)
                VALUE "PRELIMINARY REPORT".
           05  FILLER                PIC X(25)    VALUE SPACE.
           05  FILLER                PIC X(21)
                VALUE "***  CONTINUATION OF ".
           05  FILLER                PIC X(5)     VALUE "PAGE ".
           05  MH1C-PAGE             PIC ZZZZ9    VALUE ZERO.

       01  MAJOR-HEAD2.
           05  FILLER                PIC 9        VALUE 1.
           05  FILLER                PIC X(132)   VALUE ALL "-".

       01  MAJOR-HEAD3.
           05  FILLER                PIC X(31)
                VALUE "***  PURCHASE ORDER INFORMATION".
           05  FILLER                PIC X(101)   VALUE SPACE.

       01  MAJOR-HEAD4.
           05  FILLER                PIC X(33)    VALUE ALL "-".
           05  FILLER                PIC X(99)    VALUE SPACE.

       01  MAJOR-HEAD5.
           05  FILLER                PIC X(43)
                VALUE "***  RECEIVING SLIP AND FREIGHT INFORMATION".
           05  FILLER                PIC X(89)    VALUE SPACE.

       01  MAJOR-HEAD6.
           05  FILLER                PIC X(45)    VALUE ALL "-".
           05  FILLER                PIC X(87)    VALUE SPACE.

       01  MAJOR-HEAD7.
           05  FILLER                PIC X(26)
                VALUE "***  INVOICING INFORMATION".
           05  FILLER                PIC X(106)   VALUE SPACES.

       01  MAJOR-HEAD8.
           05  FILLER                PIC X(28)    VALUE ALL "-".
           05  FILLER                PIC X(104)   VALUE SPACES.


       01  SUB-HEAD1.
           05  FILLER                PIC X(14)
                VALUE "PO/RLSE       ".
           05  FILLER                PIC X(11)    VALUE "PO DATE    ".
           05  FILLER                PIC X(14)
                VALUE "BUDGET NO     ".
           05  FILLER                PIC X(13)
                VALUE "  BUDGET AMT ".
           05  FILLER                PIC X(11)    VALUE "PO TERMS   ".
           05  FILLER                PIC X(13)
                VALUE "SUB   SUBD   ".
           05  FILLER                PIC X(12)
                VALUE "ADDL DATA   ".
           05  FILLER                PIC X(23)
                VALUE "FOB                    ".
           05  FILLER                PIC X(21)
                VALUE "BUYER                ".

       01  SUB-HEAD2.
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(24)
                VALUE "REMIT VENDOR INFORMATION".
           05  FILLER                PIC X(37)    VALUE SPACE.
           05  FILLER                PIC X(24)
                VALUE "ORDER VENDOR INFORMATION".
           05  FILLER                PIC X(39)    VALUE SPACE.

       01  SUB-HEAD3.
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  FILLER                PIC X(8)     VALUE "COMMENTS".
           05  FILLER                PIC X(116)   VALUE SPACE.

       01  SUB-HEAD4.
           05  FILLER                PIC X(2)     VALUE SPACE.
           05  FILLER                PIC X(6)     VALUE "ITEM  ".
           05  FILLER                PIC X(10)    VALUE "CORPCODE  ".
           05  FILLER                PIC X(7)     VALUE "QTY UM ".
           05  FILLER                PIC X(12)
                VALUE "QTY ORDERED ".
           05  FILLER                PIC X(17)
                VALUE "QTY DELIVERED    ".
           05  FILLER                PIC X(11)
                VALUE "QTY STORED ".
           05  FILLER                PIC X(10)    VALUE "PRC UM    ".
           05  FILLER                PIC X(16)
                VALUE "UNIT PRICE      ".
           05  FILLER                PIC X(14)
                VALUE "PREV QTY PAID ".
           05  FILLER                PIC X(11)    VALUE "SUB  SUBD  ".
           05  FILLER                PIC X(17)
                VALUE "A-DATA  DATE RCVD".

       01  SUB-HEAD5C.
           05  FILLER                PIC X(4)     VALUE SPACE.
           05  FILLER                PIC X(11)    VALUE "DESCRIPTION".
           05  FILLER                PIC X(69)    VALUE SPACE.
           05  FILLER                PIC X(8)     VALUE "STR UM  ".
           05  FILLER                PIC X(9)     VALUE "ALT UM1  ".
           05  FILLER                PIC X(12)
                VALUE "CONV FCTR1  ".
           05  FILLER                PIC X(9)     VALUE "ALT UM2  ".
           05  FILLER                PIC X(10)    VALUE "CONV FCTR2".

       01  SUB-HEAD5N.
           05  FILLER                PIC X(4)     VALUE SPACE.
           05  FILLER                PIC X(11)    VALUE "DESCRIPTION".
           05  FILLER                PIC X(117)   VALUE SPACE.

       01  SUB-HEAD6.
           05  FILLER                PIC X(6)     VALUE SPACE.
           05  FILLER                PIC X(26)
                VALUE "THIS ITEM IS FOUND ON THE ".
           05  FILLER                PIC X(26)
                VALUE "FOLLOWING RECEIVING SLIPS:".
           05  FILLER                PIC X(74)    VALUE SPACE.

       01  SUB-HEAD7.
           05  FILLER                PIC X(18)
                VALUE "PO-RLSE-RS        ".
           05  FILLER                PIC X(16)
                VALUE "ITEM  CORPCODE  ".
           05  FILLER                PIC X(10)    VALUE "RCVD UM   ".
           05  FILLER                PIC X(18)
                VALUE "QTY DELIVERED     ".
           05  FILLER                PIC X(13)
                VALUE "QTY STORED   ".
           05  FILLER                PIC X(21)
                VALUE "DATE RCVD   DATE STRD".
           05  FILLER                PIC X(36)    VALUE SPACE.

       01  SUB-HEAD8.
           05  FILLER                PIC X(20)    VALUE SPACE.
           05  FILLER                PIC X(10)    VALUE "CARRIER   ".
           05  FILLER                PIC X(15)
                VALUE "PACKING SLIP   ".
           05  FILLER                PIC X(19)
                VALUE "PRO NUMBER         ".
           05  FILLER                PIC X(16)
                VALUE "PRO DATE        ".
           05  FILLER                PIC X(10)    VALUE "CHARGES   ".
           05  FILLER                PIC X(13)
                VALUE "SPLC         ".
           05  FILLER                PIC X(9)
                VALUE "RAILCAR  ".
           05  FILLER                PIC X(19)
                VALUE "CARRIER WT   OUT WT".

      *************************************************************
      **                                                         **
      **                   P R I N T   A R E A                   **
      **                                                         **
      *************************************************************

       01  PRINT-RCD-WS.
           05  PRINT-LINE            PIC X(132)   VALUE SPACE.

           05  PO-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  PPRT-PO           PIC X(7).
               10  PPRT-H            PIC X.
               10  PPRT-RLSE         PIC X(3).
               10  FILLER            PIC X(3).
               10  PPRT-PO-DATE      PIC X(8).
               10  FILLER            PIC X(3).
               10  PPRT-BUDGET-NO    PIC X(12).
               10  FILLER            PIC X(3).
               10  PPRT-BUDGET-AMT   PIC ZZZZZZZZZZ9.
               10  FILLER            PIC X(4).
               10  PPRT-PO-TERMS     PIC X(2).
               10  FILLER            PIC X(6).
               10  PPRT-SUB          PIC X(3).
               10  FILLER            PIC X(3).
               10  PPRT-SUBD         PIC X(4).
               10  FILLER            PIC X(3).
               10  PPRT-ADDL-DATA    PIC X(9).
               10  FILLER            PIC X(3).
               10  PPRT-FOB          PIC X(20).
               10  FILLER            PIC X(3).
               10  PPRT-BUYER        PIC X(15).
               10  FILLER            PIC X(6).

           05  VENDOR-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(8).
               10  VPRT-REMIT-VC.
                   15  VPRT-RVC7     PIC X(7).
                   15  VPRT-RH       PIC X.
                   15  VPRT-RVC3     PIC X(3).
               10  FILLER            PIC X(3).
               10  VPRT-REMIT-INFO   PIC X(44).
               10  FILLER            PIC X(3).
               10  VPRT-ORDER-VC.
                   15  VPRT-OVC7     PIC X(7).
                   15  VPRT-OH       PIC X.
                   15  VPRT-OVC3     PIC X(3).
               10  FILLER            PIC X(3).
               10  VPRT-ORDER-INFO   PIC X(44).
               10  FILLER            PIC X(5).

           05  COMMENT-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(8).
               10  CPRT-COMMENT      PIC X(72).
               10  FILLER            PIC X(52).

           05  ITEM-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(2).
               10  IPRT-ITEM-NO      PIC ZZZ9.
               10  FILLER            PIC X(2).
               10  IPRT-CORPCODE     PIC X(7).
               10  FILLER            PIC X(5).
               10  IPRT-QTY-UM       PIC X(2).
               10  FILLER            PIC X(1).
               10  IPRT-QTY-ORD      PIC ZZZZZZZ9.9999.
               10  FILLER            PIC X(1).
               10  IPRT-QTY-DEL      PIC ZZZZZZZ9.9999.
               10  FILLER            PIC X.
               10  IPRT-QTY-STR      PIC ZZZZZZZ9.9999.
               10  FILLER            PIC X(3).
               10  IPRT-PRC-UM       PIC X(2).
               10  IPRT-UNIT-PRC     PIC ZZZZZZZZZZ9.9999.
               10  FILLER            PIC X(3).
               10  IPRT-PREV-QTY-PD  PIC ZZZZZZZZZZ9.9999.
               10  FILLER            PIC X(1).
               10  IPRT-SUB          PIC X(3).
               10  FILLER            PIC X(2).
               10  IPRT-SUBD         PIC X(4).
               10  FILLER            PIC X(2).
               10  IPRT-ADATA        PIC X(6).
               10  FILLER            PIC X(2).
               10  IPRT-DATE-RCVD    PIC X(8).

           05  DESC-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(4).
               10  DPRT-DESC         PIC X(80).
               10  FILLER            PIC X(2).
               10  DPRT-STR-UM       PIC X(2).
               10  FILLER            PIC X(6).
               10  DPRT-ALT-UM1      PIC X(2).
               10  FILLER            PIC X(4).
               10  DPRT-CONV1        PIC ZZZZZ9.9999.
               10  FILLER            PIC X(4).
               10  DPRT-ALT-UM2      PIC X(2).
               10  FILLER            PIC X(4).
               10  DPRT-CONV2        PIC ZZZZZ9.9999.

           05  LIST-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(6).
               10  LPRT-TABLE  OCCURS  7  TIMES.
                   15  LPRT-PO       PIC X(7).
                   15  LPRT-H1       PIC X.
                   15  LPRT-RLSE     PIC X(3).
                   15  LPRT-H2       PIC X.
                   15  LPRT-RS       PIC X(3).
                   15  FILLER        PIC X(3).

           05  RS-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  RSPRT-PO          PIC X(7).
               10  RSPRT-H1          PIC X.
               10  RSPRT-RLSE        PIC X(3).
               10  RSPRT-H2          PIC X.
               10  RSPRT-RS          PIC X(3).
               10  FILLER            PIC X(3).
               10  RSPRT-ITEM-NO     PIC ZZZ9.
               10  FILLER            PIC X(2).
               10  RSPRT-CORPCODE    PIC X(7).
               10  FILLER            PIC X(5).
               10  RSPRT-RCVD-UM     PIC X(2).
               10  FILLER            PIC X(6).
               10  RSPRT-QTY-DLVR    PIC ZZZZZZZ9.9999.
               10  FILLER            PIC X(2).
               10  RSPRT-QTY-STOR    PIC ZZZZZZZ9.9999.
               10  FILLER            PIC X(3).
               10  RSPRT-DATE-RCVD   PIC X(8).
               10  FILLER            PIC X(4).
               10  RSPRT-DATE-STRD   PIC X(8).
               10  FILLER            PIC X(37).

           05  FREIGHT-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  FILLER            PIC X(20).
               10  FPRT-CARRIER      PIC X(4).
               10  FILLER            PIC X(6).
               10  FPRT-PACK-SLIP    PIC X(12).
               10  FILLER            PIC X(3).
               10  FPRT-PRO-NUMBER   PIC X(16).
               10  FILLER            PIC X(3).
               10  FPRT-PRO-DATE     PIC X(8).
               10  FILLER            PIC X.
               10  FPRT-CHARGES      PIC ZZZZZZZZZZ9.99.
               10  FILLER            PIC X(3).
               10  FPRT-SPLC         PIC X(10).
               10  FILLER            PIC X(3).
               10  FPRT-RAILCAR      PIC X(10).
               10  FILLER            PIC X(1).
               10  FPRT-CARRIER-WT   PIC ZZZZZZZ9.
               10  FILLER            PIC X.
               10  FPRT-OUR-WT       PIC ZZZZZZZ9.
               10  FILLER            PIC X.

           05  ERROR-PRINT-LINE  REDEFINES  PRINT-LINE.
               10  EPRT-PO           PIC X(7).
               10  EPRT-H            PIC X.
               10  EPRT-RLSE         PIC X(3).
               10  FILLER            PIC X(3).
               10  EPRT-MESSAGE      PIC X(118).
           05  HEAD2 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  HEAD2-REGISTER          PIC X(8).
               10  FILLER                  PIC X(3).
               10  HEAD2-INVOICE           PIC X(14).
               10  FILLER                  PIC X(3).
             10  HEAD2-STATUS              PIC X(6).
             10  FILLER                    PIC X(3).
               10  HEAD2-INV-DATE          PIC X(12).
               10  FILLER                  PIC X(3).
               10  HEAD2-ENTRY-DATE        PIC X(10).
               10  FILLER                  PIC X(3).
               10  HEAD2-DUE-DATE          PIC X(8).
               10  FILLER                  PIC X(3).
               10  HEAD2-TERMS             PIC X(5).
               10  FILLER                  PIC X(3).
               10  HEAD2-PO                PIC X(9).
               10  FILLER                  PIC X(4).
               10  HEAD2-ID                PIC X(12).
               10  HEAD2-ADD               PIC X(10).
               10  FILLER                  PIC X(12).

           05  LINE1 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(2).
               10  LINE1-REG               PIC X(5).
               10  FILLER                  PIC X(5).
               10  LINE1-INV-NO            PIC X(14).
               10  FILLER                  PIC X(5).
               10  LINE1-STATUS            PIC X(2).
               10  FILLER                  PIC X(6).
               10  LINE1-INV-DATE          PIC X(8).
               10  FILLER                  PIC X(6).
               10  LINE1-ENTRY-DATE        PIC X(8).
               10  FILLER                  PIC X(4).
               10  LINE1-DUE-DATE          PIC X(8).
               10  FILLER                  PIC X(4).
               10  LINE1-TERMS             PIC X(2).
               10  FILLER                  PIC X(5).
               10  LINE1-PO                PIC X(10).
               10  FILLER                  PIC X(9).
               10  LINE1-ID                PIC X(4).
               10  LINE1-SLASH             PIC X.
               10  LINE1-ADD               PIC X(4).
               10  FILLER                  PIC X(20).

            05  LINE2 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  LINE2-VENDOR            PIC X(8).
               10  FILLER                  PIC X(5).
               10  LINE2-NAME              PIC X(6).
               10  FILLER                  PIC X(39).
               10  LINE2-CHECK             PIC X(19).
               10  FILLER                  PIC X(54).

           05  LINE2A REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  LINE2A-VENDOR-CODE      PIC X(7).
               10  FILLER                  PIC X(6).
               10  LINE2A-NAME-OUT         PIC X(44).
               10  FILLER                  PIC X(10).
               10  LINE2A-CHECK-IND        PIC X.
               10  FILLER                  PIC X(13).
               10  LINE2A-VERBAGE          PIC X(20).
               10  FILLER                  PIC X(30).

           05  LINE2B REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  LINE2B-MAN              PIC X(9).
               10  LINE2B-MAN-NO           PIC X(3).
               10  LINE2B-MAN-YY           PIC X(2).
               10  FILLER                  PIC X(2).
               10  LINE2B-CHECK            PIC X(7).
               10  LINE2B-CHECK-NO         PIC X(8).
               10  FILLER                  PIC X(4).
               10  LINE2B-CHECKD           PIC X(11).
               10  LINE2B-CHECK-DATE       PIC X(8).
               10  FILLER                  PIC X(77).

           05 LINE3 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  LINE3-PO                PIC X(17).
               10  LINE3-PO-EXT            PIC $$$$$$$$$$$.9999CR.
               10  FILLER                  PIC X.
               10  LINE3-INV-FRT           PIC X(15).
               10  LINE3-FRT-AMT           PIC $$$$$$$$$$$.99CR.
               10  LINE3-CE                PIC X(4).
               10  LINE3-CE-CODE           PIC X(2).
               10  LINE3-CE-AMOUNT         PIC X(12).
               10  LINE3-CE-AMT            PIC $$$$$$$$$$$.99CR.
               10  LINE3-NET               PIC X(14).
               10  LINE3-NET-AMT           PIC $$$$$$$$$$$.99CR.

           05 LINE4 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X.
               10  LINE4-INV               PIC X(17).
               10  LINE4-INV-EXT           PIC $$$$$$$$$$$.9999CR.
               10  FILLER                  PIC X.
               10  LINE4-INV-TAX           PIC X(15).
               10  LINE4-TAX-AMT           PIC $$$$$$$$$$$.99CR.
               10  LINE4-CE3               PIC X(18).
               10  LINE4-AMT               PIC $$$$$$$$$$$.99CR.
               10  LINE4-FRT               PIC X(14).
               10  LINE4-FRT-AMT           PIC $$$$$$$$$$$.99CR.
           05 LINE5 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(38).
               10  LINE5-INV-CON           PIC X(14).
               10  LINE5-CON-AMT           PIC $$$$$$$$$$$.99CR.
               10  LINE5-CE4               PIC X(18).
               10  LINE5-AMT               PIC $$$$$$$$$$$.99CR.
               10  LINE5-TAX               PIC X(14).
               10  LINE5-TAX-AMT           PIC $$$$$$$$$$$.99CR.

           05 LINE6 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(3).
               10  LINE6-PAY-IND           PIC X(18).
               10  LINE6-IND               PIC X.
               10  FILLER                  PIC X(16).
               10  LINE6-OTH               PIC X(14).
               10  LINE6-OTH-AMT           PIC $$$$$$$$$$$.99CR.
               10  LINE6-CE5               PIC X(18).
               10  LINE6-AMT               PIC $$$$$$$$$$$.99CR.
               10  LINE6-OTHER             PIC X(14).
               10  LINE6-OTHER-AMT         PIC $$$$$$$$$$$.99CR.

           05 LINE7 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(38).
               10  LINE7-INS               PIC X(14).
               10  LINE7-INS-AMT           PIC $$$$$$$$$$$.99CR.
               10  LINE7-CE6               PIC X(18).
               10  LINE7-AMT               PIC $$$$$$$$$$$.99CR.
               10  FILLER                  PIC X(30).

           05  LINE8 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(3).
               10  LINE8-ZBILL-NO          PIC X(15).
               10  LINE8-NUMBER            PIC X(6).
               10  FILLER                  PIC X(14).
               10  LINE8-CALC-AMT          PIC X(14).
               10  LINE8-CALC-AMOUNT       PIC $$$$$$$$$$$.99CR.
               10  LINE8-CE7               PIC X(18).
               10  LINE8-AMT               PIC $$$$$$$$$$$.99CR.
               10  LINE8-COST              PIC X(14).
               10  LINE8-COST-AMT          PIC $$$$$$$$$$$.99CR.
           05  LINE9 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(6).
               10  LINE9-ZBILL             PIC X(15).
               10  LINE9-ZBILL-AMT         PIC $$$$$$$$.99.
               10  FILLER                  PIC X(38).
               10  LINE9-CE8               PIC X(16).
               10  LINE9-AMT               PIC $$$$$$$$$$$.99CR.
               10  FILLER                  PIC X(30).

           05 LINE10 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(70).
               10  LINE10-CE9              PIC X(16).
               10  LINE10-AMT              PIC $$$$$$$$$$$.99CR.
               10  FILLER                  PIC X(30).

           05 LINE10A REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(3).
               10  LINE10-TAX              PIC X(8).
               10  FILLER                  PIC X(7).
               10  LINE10-TAX-CODE         PIC X(2).
               10  FILLER                  PIC X(45).
               10  LINE10A-CE              PIC X(3).
               10  LINE10A-CODE            PIC X.
               10  FILLER                  PIC X.
               10  LINE10A-ACCTG           PIC X(9).
               10  FILLER                  PIC X(7).
               10  LINE10A-VALUE           PIC $$$$$$$$$$$.99CR.
               10  FILLER                  PIC X(30).

           05  HEAD3 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(16).
               10  HEAD3-COLLECT           PIC X(15).
               10  FILLER                  PIC X(4).
               10  HEAD3-PRO               PIC X(10).
               10  FILLER                  PIC X(10).
               10  HEAD3-CARRIER           PIC X(7).
               10  FILLER                  PIC X(4).
               10  HEAD3-FREIGHT           PIC X(14).
               10  FILLER                  PIC X(52).

           05  LINE11 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(35).
               10  LINE11-PRO              PIC X(16).
               10  FILLER                  PIC X(6).
               10  LINE11-CARRIER          PIC X(4).
               10  FILLER                  PIC X(8).
               10  LINE11-CHARGE           PIC $$$$$$$$.99.
               10  FILLER                  PIC X(52).
           05  HEAD4 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(6).
               10  HEAD4-ITEM              PIC X(15).
               10  FILLER                  PIC X(18).
               10  HEAD4-QTY               PIC X(13).
               10  FILLER                  PIC X(8).
               10  HEAD4-PRICE-UM          PIC X(13).
               10  HEAD4-ITEM-EXT          PIC X(14).
               10  FILLER                  PIC X(4).
               10  HEAD4-DATA              PIC X(15).
               10  FILLER                  PIC X(26).

           05  LINE12 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(6).
               10  LINE12-ITEM             PIC ZZZ9.
               10  FILLER                  PIC X(3).
               10  LINE12-CORP             PIC X(7).
               10  LINE12-PO               PIC X(5).
               10  FILLER                  PIC X(14).
               10  LINE12-QTY              PIC ZZZZZZZZ.9999.
               10  FILLER                  PIC X(3).
               10  LINE12-PRICE            PIC $$$$$$$$.9999.
               10  FILLER                  PIC X.
               10  LINE12-UM               PIC X(2).
               10  FILLER                  PIC X(2).
               10  LINE12-EXT              PIC $$$$$$$$.9999CR.
               10  FILLER                  PIC X(3).
               10  LINE12-PRIME            PIC X(3).
               10  FILLER                  PIC X.
               10  LINE12-SUB              PIC X(3).
               10  FILLER                  PIC X.
               10  LINE12-SUBD             PIC X(4).
               10  FILLER                  PIC X.
               10  LINE12-DATA             PIC X(6).
               10  FILLER                  PIC X(4).
               10  LINE12-TAX              PIC X(2).
               10  FILLER                  PIC X(16).
           05  LINE13 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(23).
               10  LINE13-INV              PIC X(5).
               10  LINE13-MEMO             PIC X(11).
               10  LINE13-QTY              PIC ZZZZZZZZ.9999.
               10  FILLER                  PIC X(3).
               10  LINE13-PRICE            PIC $$$$$$$$.9999.
               10  FILLER                  PIC X.
               10  LINE13-UM               PIC X(2).
               10  FILLER                  PIC X(2).
               10  LINE13-EXT              PIC $$$$$$$$.9999CR.
               10  FILLER                  PIC X(3).
               10  LINE13-PRIME            PIC X(3).
               10  FILLER                  PIC X.
               10  LINE13-SUB              PIC X(3).
               10  FILLER                  PIC X.
               10  LINE13-SUBD             PIC X(4).
               10  FILLER                  PIC X.
               10  LINE13-DATA             PIC X(6).
               10  FILLER                  PIC X(22).

           05  LINE14 REDEFINES PRINT-LINE.
               10  FILLER                  PIC X(91).
               10  LINE14-PRIME            PIC X(3).
               10  FILLER                  PIC X.
               10  LINE14-SUB              PIC X(3).
               10  FILLER                  PIC X.
               10  LINE14-SUBD             PIC X(4).
               10  FILLER                  PIC X.
               10  LINE14-DATA             PIC X(6).
               10  FILLER                  PIC X(22).

      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DATAB IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-NAME             PIC X(16)    VALUE SPACE.
           05  DSET-MPLTINFO         PIC X(16)    VALUE "MPLTINFO;".
           05  DSET-MPORCV           PIC X(16)    VALUE "MPORCV;".
           05  DSET-DPORECD          PIC X(16)    VALUE "DPORECD;".
           05  DSET-DPOITEM          PIC X(16)    VALUE "DPOITEM;".
           05  DSET-DRCVITEM         PIC X(16)    VALUE "DRCVITEM;".
           05  DSET-DPODATAITM       PIC X(16)    VALUE "DPODATAITM;".
           05  DVENDOR               PIC X(16)    VALUE "DVENDOR;".
           05  DSET-MSTORERM         PIC X(16)    VALUE "MSTORERM;".
           05  DSET-DDESC            PIC X(16)    VALUE "DDESC;".
           05  DPOFREIGHT            PIC X(16)    VALUE "DPOFREIGHT;".
           05  DINVRCD               PIC X(16)    VALUE "DINVRCD;".
           05  DINVACCT              PIC X(16)    VALUE "DINVACCT;".
           05  DINVITM               PIC X(16)    VALUE "DINVITM;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS             PIC X(2)     VALUE "@;".
           05  PO-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
           05  VEN-KEY-NAME          PIC X(10)    VALUE "VEN-CODE;".
           05  CODE-KEY-NAME         PIC X(10)    VALUE "CORP-CODE;".
           05  RS-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
           05  REG-SEARCH            PIC X(16)
                                         VALUE "REGISTER-NUMBER;".
           05  VENDOR-SEARCH           PIC X(10)  VALUE "VEN-CODE;".

       01  ARGUMENT-VALUES.
           05  PLT-ARG               PIC X(4)     VALUE SPACE.
           05  REG-ARG               PIC X(6)     VALUE SPACES.
           05  PO-ARG.
               10  PO-NO-RLSE.
                   15  PO-PREFIX     PIC X        VALUE SPACE.
                   15  PO-NO         PIC X(7)     VALUE SPACE.
                   15  PO-RLSE       PIC X(3)     VALUE SPACE.
               10  PO-RS             PIC X(3)     VALUE SPACE.
           05  VEN-ARG.
               10  VEN-ARG1-7        PIC X(7)     VALUE SPACE.
               10  VEN-ARG8-10       PIC X(3)     VALUE SPACE.
           05  CORPCODE-ARG          PIC X(8)     VALUE SPACE.
           05  RS-ARG                PIC X(14)    VALUE SPACE.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

      ************************
      **      MPLTINFO      **
      ************************

       COPY MPLTINFO IN COPYLIB.
       COPY MPORCV   IN COPYLIB.
       COPY DPORECD  OF COPYLIB.
       COPY DPOITEM  OF COPYLIB.
       COPY DRCVITEM OF COPYLIB.
       COPY DPODATA  OF COPYLIB.
       COPY DVENDOR  OF COPYLIB.
       COPY DDESC    OF COPYLIB.
       COPY MSTORERM OF COPYLIB.
      ************************
      **     DPOFREIGHT     **
      ************************
       COPY DFREIGHT IN COPYLIB.

       COPY DINVRCD  IN COPYLIB.
       COPY DINVACCT IN COPYLIB.
       COPY DINVITM  IN COPYLIB.
      *************************************************************
      **                                                         **
      **                    W O R K   A R E A                    **
      **                                                         **
      *************************************************************

       01  WORK-VENDOR.
           05  WORK-VEN              PIC X(7).
           05  FILLER                PIC X(3).

       01  PO-ENTRY.
           05  FILLER                PIC X       VALUE "P".
           05  PO-NUM                PIC X(10)   VALUE SPACES.
           05  PO-NUM-R REDEFINES PO-NUM.
               10  FILLER            PIC X(7).
               10  PO-NUM-RLSE       PIC X(3).
           05  FILLER                PIC X(3)    VALUE "000".

       01  X                         PIC 9 VALUE ZEROES.

       01  ORDER-VEN-TABLE.
           05  O-VEN-ADDR  OCCURS  3  TIMES
                                     PIC X(44).
       01  REMIT-VEN-TABLE.
           05  R-VEN-ADDR  OCCURS  3  TIMES
                                     PIC X(44).


       01  SAVE-COMPANY              PIC X(4)     VALUE SPACE.
       01  LINE-CTR                  PIC S9(4)    VALUE ZERO.
       01  PAGE-CTR                  PIC S9(4)    VALUE ZERO.
       01  CODED-ITEM-CTR            PIC S9(4)    VALUE ZERO.
       01  RCV-SLIP-CTR              PIC S9(4)    VALUE ZERO.
       01  RS-CALL-CTR               PIC S9(4)    VALUE ZERO.
       01  RS-PRT-CTR                PIC S9(4)    VALUE ZERO.
       01  NEW-RS-NO-SW              PIC X        VALUE SPACE.
       01  SAVE-NS-ITEM-NO           PIC 9(4)     VALUE ZERO.
       01  NEED-DESC-SW              PIC X        VALUE SPACE.
       01  GOOD-ITEM-SW              PIC X        VALUE SPACE.
       01  MORE-NS-ITEMS-SW          PIC X        VALUE SPACE.

       01  ALTER-PO-ARG.
           05  FILLER                PIC X(11)    VALUE SPACE.
           05  A-RS                  PIC 9(3)     VALUE ZERO.

       01  RCV-SLIP-TABLE.
           05  RCV-SLIP-NO  OCCURS  7  TIMES.
               10  RS-PREFIX         PIC X.
               10  RS-PO-NO          PIC X(7).
               10  RS-PO-RLSE        PIC X(3).
               10  RS-PO-RS          PIC X(3).

       COPY CDESC  IN COPYLIB.
       COPY CNDESC IN COPYLIB.
       COPY TDATECHK IN COPYLIB.
       COPY TBLOWUP  IN COPYLIB.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP VALUE 9999.
       01  KSAM-STATUS                 PIC X(2)    VALUE SPACES.

      *---------- PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       01  HD-RET-CODE                 PIC S9(4) COMP VALUE 0.
       01  HD-FILE-NAME                PIC X(17) VALUE "DHDR20.PUB".
       01  FNUM                        PIC S9(4) COMP VALUE 0.

       COPY ESCNAM2 IN COPYLIB.

       COPY CCHKOBJ   IN COPYLIB.
       COPY CCRTFILE  IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.

       LINKAGE SECTION.

       COPY THDPRTB IN COPYLIB.

       01  DATA-LINE                 PIC X(112).
       01  DATA-ENTRIES REDEFINES DATA-LINE.
           05  PO-ENTRY-WS OCCURS 8 TIMES  PIC X(10).
           05  FILLER                PIC X(32).

       PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
       0-BEGIN SECTION 01.
           PERFORM  1-HSK  THRU  1-HSK-X.
           PERFORM  6-MAIN  THRU  6-MAIN-X.
           PERFORM  2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.

           GOBACK.


       1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT MPLTINFO-I, MPORCV-I, MSTORERM-I,
                      DPORECD-I, DPOITEM-I, DRCVITEM-I-PO,
                      DRCVITEM-I-CDE, DVENDOR-I, DPOFREIGHT-I-PO,
                      DPOFREIGHT-I-REG, DINVRCD-I, DINVACCT-I,
                      DINVITM-I, DPODATAITM-I.

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-COMPANY  TO  SAVE-COMPANY
           ELSE
               MOVE "DBGET MPLTINFO*1-HSK"  TO  BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE 1                       TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT          TO  MH1-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO  MH1-TIME.

           MOVE "TINVPRPT"              TO  BU-PGM-NAME.

       1-HSK-X.
           EXIT.

       2-CLOSE-FILES.
           CLOSE  PRINT-FILE.

           CLOSE MPLTINFO-I, MPORCV-I, MSTORERM-I,
                 DPORECD-I, DPOITEM-I, DRCVITEM-I-PO,
                 DRCVITEM-I-CDE, DVENDOR-I, DPOFREIGHT-I-PO,
                 DPOFREIGHT-I-REG, DINVRCD-I, DINVACCT-I,
                 DINVITM-I, DPODATAITM-I.

       2-CLOSE-FILES-X.
           EXIT.


       6-MAIN.
           SORT SORT-FILE
               ASCENDING KEY  SD-PO-RLSE
               INPUT PROCEDURE IS  60-ACCEPT-PO-REQUESTS
               OUTPUT PROCEDURE IS  61-BUILD-REPORT.

       6-MAIN-X.
           EXIT.


       60-ACCEPT-PO-REQUESTS SECTION 02.

       60-ACCEPT-ENTRIES.
           MOVE 1 TO X.
           PERFORM 60-MOVE-ENTRIES 8 TIMES.
           GO TO 60-ACCEPT-ENTRIES-X.

       60-MOVE-ENTRIES.
           IF PO-ENTRY-WS (X) NOT = SPACES
              MOVE PO-ENTRY-WS (X) TO PO-NUM
              IF PO-NUM-RLSE = SPACES
                  MOVE ZEROS       TO PO-NUM-RLSE
              END-IF
              MOVE PO-ENTRY        TO SORT-RCD
              RELEASE SORT-RCD.
           ADD 1 TO X.

       60-ACCEPT-ENTRIES-X.
           EXIT.



       61-BUILD-REPORT SECTION 03.
       61-HEADER.
           IF HD-ROUTE-DATA = SPACES
              GO TO 61-REPORT.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.

           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
             HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               PERFORM 990-BLOWUP THRU 999-EXIT.

       61-REPORT.
           RETURN  SORT-FILE
               AT END  GO TO 61-REPORT-X.

           MOVE ZERO  TO  LINE-CTR.
           ADD +1     TO  PAGE-CTR.
           MOVE PAGE-CTR  TO  MH1-PAGE.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD1
                AFTER ADVANCING NEWPAGE.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD2
                AFTER ADVANCING 1 LINES.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD3
                AFTER ADVANCING 2 LINES.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD4
                AFTER ADVANCING 1 LINES.
           WRITE  PRINT-RCD  FROM  SUB-HEAD1
                AFTER ADVANCING 2 LINES.
           ADD +7  TO  LINE-CTR.

           MOVE SD-PO-RLSE  TO  PO-ARG.
           MOVE PO-ARG      TO  PORCVNO OF MPORCV-REC-I.
           READ MPORCV-I INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE SPACE    TO  PRINT-RCD-WS
               MOVE PO-NO    TO  EPRT-PO
               MOVE "-"      TO  EPRT-H
               MOVE PO-RLSE  TO  EPRT-RLSE
               MOVE "***  PO DOES NOT EXIST  ***"  TO  EPRT-MESSAGE
               WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
                   AFTER ADVANCING 1 LINES
               ADD +1  TO  LINE-CTR
               GO TO  61-REPORT
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPORCV*61-REPORT"  TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           IF M-PO-BLK-INDIC = "B" OR " "
              MOVE ZEROES TO RCV-SLIP-CTR
           ELSE
              MOVE M-PO-LAST-RCVR  TO  RCV-SLIP-CTR.

       611-FIND-DPORECD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           READ DPORECD-I INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD*611-FD"  TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE SPACE              TO  PRINT-RCD-WS.
           MOVE PO-NO              TO  PPRT-PO.
           MOVE "-"                TO  PPRT-H.
           MOVE PO-RLSE            TO  PPRT-RLSE.
           IF PO-DATE NOT = SPACE
               MOVE 4              TO  DATE-MODE
               MOVE PO-DATE        TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT TO  PPRT-PO-DATE.
           MOVE PO-BUDGET-NUMBER   TO  PPRT-BUDGET-NO.
           MOVE PO-BUDGET-AMT      TO  PPRT-BUDGET-AMT.
           MOVE PO-TERMS           TO  PPRT-PO-TERMS.
           MOVE PO-SUB             TO  PPRT-SUB.
           MOVE PO-SUB-DET         TO  PPRT-SUBD.
           MOVE PO-ADDL-DATA       TO  PPRT-ADDL-DATA.
           MOVE PO-FOB             TO  PPRT-FOB.
           MOVE PO-BUYER           TO  PPRT-BUYER.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +1  TO  LINE-CTR.

           PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X.
           WRITE  PRINT-RCD  FROM  SUB-HEAD2
              AFTER ADVANCING 2 LINES.
           ADD +2  TO  LINE-CTR.

           MOVE SPACE        TO  PRINT-RCD-WS,
                                 ORDER-VEN-TABLE,
                                 REMIT-VEN-TABLE.
           MOVE PO-VEN-CODE  TO  VEN-ARG.
           MOVE VEN-ARG1-7   TO  VPRT-RVC7,
                                 VPRT-OVC7.
           MOVE "-"          TO  VPRT-RH,
                                 VPRT-OH.
           MOVE "000"        TO  VPRT-RVC3.
           MOVE VEN-ARG8-10  TO  VPRT-OVC3.
           IF VEN-ARG8-10 = "000"
               MOVE "***  SAME AS REMIT VENDOR INFORMATION  ***"
                             TO  O-VEN-ADDR (1)
               GO TO  612-FIND-PAYVEN.


       612-FIND-ORDVEN.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 612-FIND-PAYVEN
               ELSE
               MOVE "DBFIND DVENDOR*612-FO"  TO  BU-DISPLAY-MSG
               MOVE VEN-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZERO  TO  VEN-SUB.

       612-LOAD-ORDVEN-TBL.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 612-FIND-PAYVEN
               ELSE
                   MOVE "DBGET5 DVENDOR*612-LOT"  TO  BU-DISPLAY-MSG
                   MOVE VEN-ARG  TO  BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               GO TO 612-FIND-PAYVEN.

           IF VEN-ITM-NO = 00
               ADD +1  TO  VEN-SUB
               MOVE VEN-NAME  TO  O-VEN-ADDR (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 01
               ADD +1  TO  VEN-SUB
               MOVE VEN-ADDRESS  TO  O-VEN-ADDR (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 07
               ADD +1  TO  VEN-SUB
               MOVE VEN-07-RCD  TO  O-VEN-ADDR (VEN-SUB).

           IF VEN-SUB > +2
               GO TO  612-FIND-PAYVEN
           ELSE
               GO TO  612-LOAD-ORDVEN-TBL.

       612-FIND-PAYVEN.
           MOVE "000"  TO  VEN-ARG8-10.

           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 612-WRITE-VENDOR-LINES
               ELSE
               MOVE "DBFIND DVENDOR*612-FP"  TO  BU-DISPLAY-MSG
               MOVE VEN-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZERO  TO  VEN-SUB.

       612-LOAD-PAYVEN-TBL.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 612-WRITE-VENDOR-LINES
               ELSE
                   MOVE "DBGET5 DVENDOR*612-LPT"  TO  BU-DISPLAY-MSG
                   MOVE VEN-ARG  TO  BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               GO TO 612-WRITE-VENDOR-LINES.

           IF VEN-ITM-NO = 00
               ADD +1  TO  VEN-SUB
               MOVE VEN-NAME  TO  R-VEN-ADDR (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 01
               ADD +1  TO  VEN-SUB
               MOVE VEN-ADDRESS  TO  R-VEN-ADDR (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 07
               ADD +1  TO  VEN-SUB
               MOVE VEN-07-RCD  TO  R-VEN-ADDR (VEN-SUB).

           IF VEN-SUB > +2
               GO TO  612-WRITE-VENDOR-LINES
           ELSE
               GO TO  612-LOAD-PAYVEN-TBL.

       612-WRITE-VENDOR-LINES.
           MOVE R-VEN-ADDR (1)  TO  VPRT-REMIT-INFO.
           MOVE O-VEN-ADDR (1)  TO  VPRT-ORDER-INFO.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACE           TO  PRINT-RCD-WS.
           MOVE R-VEN-ADDR (2)  TO  VPRT-REMIT-INFO.
           MOVE O-VEN-ADDR (2)  TO  VPRT-ORDER-INFO.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACE           TO  PRINT-RCD-WS.
           MOVE R-VEN-ADDR (3)  TO  VPRT-REMIT-INFO.
           MOVE O-VEN-ADDR (3)  TO  VPRT-ORDER-INFO.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +3  TO  LINE-CTR.

       613-INVOICE-COMMENTS.
           PERFORM  6131-FIND-DPODATAITM  THRU
                                          6131-FIND-DPODATAITM-X.

       615-CODED-ITEMS.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START DPOITEM*615-CI"  TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

       615-CODED-ITEM-LOOP.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE PO-ARG  TO  ALTER-PO-ARG
                   MOVE ZERO    TO  RS-CALL-CTR
                   MOVE ZERO    TO  RS-PRT-CTR
                   GO TO  615-RS-INFO-NEXT
               ELSE
                   MOVE "DBGET5 DPOITEM*615-CIL"  TO  BU-DISPLAY-MSG
                   MOVE PO-ARG  TO  BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
                   MOVE PO-ARG  TO  ALTER-PO-ARG
                   MOVE ZERO    TO  RS-CALL-CTR
                   MOVE ZERO    TO  RS-PRT-CTR
                   GO TO  615-RS-INFO-NEXT.

           PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X.
           WRITE  PRINT-RCD  FROM  SUB-HEAD4
              AFTER ADVANCING 2 LINES.
           ADD +2  TO  LINE-CTR.
           MOVE SPACE             TO  PRINT-RCD-WS.
           MOVE ITM-NUMBER        TO  IPRT-ITEM-NO.
           MOVE ITM-CORP-CODE     TO  IPRT-CORPCODE,
                                      CORPCODE-ARG.
           MOVE ITM-UM            TO  IPRT-QTY-UM.
           MOVE ITM-QTY-ORD     TO  IPRT-QTY-ORD.
           MOVE ITM-QTY-DLVR    TO  IPRT-QTY-DEL.
           MOVE ITM-QTY-STORED  TO  IPRT-QTY-STR.
           MOVE ITM-PRICE-UM      TO  IPRT-PRC-UM.
           MOVE ITM-UNIT-PRICE  TO  IPRT-UNIT-PRC.
           MOVE ITM-QTY-PAID      TO  IPRT-PREV-QTY-PD.

           IF ITM-CORP-CODE NOT = "NON-STR"
             MOVE CORPCODE-ARG TO CORPCDE OF MSTORERM-REC-I
             READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-READ
             IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 MSTORERM*615-CIL"  TO  BU-DISPLAY-MSG
               MOVE CORPCODE-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT
             ELSE
               MOVE STR-CLASS      TO  IPRT-SUB.
           MOVE ITM-SUB-DETL       TO  IPRT-SUBD.
           MOVE ITM-ADDL-DATA      TO  IPRT-ADATA.
           IF ITM-DATE-RCVD NOT = SPACE
               MOVE 4              TO  DATE-MODE
               MOVE ITM-DATE-RCVD  TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT TO  IPRT-DATE-RCVD.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +1  TO  LINE-CTR.

       615-CODED-DESC.
           IF ITM-CORP-CODE = "NON-STR"
              MOVE 1 TO CNDESC-LINES-TO-GET
              MOVE SPACES TO CNDESC-LINE
              CALL "CNDESC" USING BASE, PO-ARG, ITM-NUMBER,
                                  CNDESC-DATA
              MOVE CNDESC (1)            TO HOLD-DESC
           ELSE
              MOVE 1                  TO CDESC-LINES-TO-GET
              MOVE SPACES             TO CDESC-DATA
              CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
                   BU-DISPLAY-MSG, ITM-CORP-CODE, CDESC-DATA
              MOVE CDESC (1)          TO HOLD-DESC.
           PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X.
           WRITE  PRINT-RCD  FROM  SUB-HEAD5C
               AFTER ADVANCING 2 LINES.
           ADD +2  TO  LINE-CTR.
           MOVE SPACE  TO  PRINT-RCD-WS.
           MOVE HOLD-DESC  TO  DPRT-DESC.

       615-UNITS-OF-MEASURE.
           IF ITM-CORP-CODE NOT = "NON-STR"
           MOVE STR-UM      TO  DPRT-STR-UM
           MOVE STR-UM1     TO  DPRT-ALT-UM1
           MOVE STR-UM1-CF  TO  DPRT-CONV1
           MOVE STR-UM2     TO  DPRT-ALT-UM2
           MOVE STR-UM2-CF  TO  DPRT-CONV2.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +1  TO  LINE-CTR.

      *---------  LIST RECEIVING SLIP NUMBERS IF CODED ITEM
           IF ITM-CORP-CODE = "NON-STR"
              GO TO 615-CODED-ITEM-LOOP.

       615-LIST-RCV-SLIPS.
           MOVE CORPCODE-ARG TO CORPCDE OF DRCVITEM-REC-I-CDE.
           START DRCVITEM-I-CDE KEY = CORPCDE OF DRCVITEM-REC-I-CDE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE ZERO   TO  RS-SUB
                   MOVE SPACE  TO  PRINT-RCD-WS
                   GO TO  615-WRITE-RS-LIST
               ELSE
               MOVE "DBFIND DRCVITEM*615-LRS"  TO  BU-DISPLAY-MSG
               MOVE CORPCODE-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZERO   TO  RS-SUB.
           MOVE SPACE  TO  RCV-SLIP-TABLE.

       615-LIST-RS-LOOP.
           READ DRCVITEM-I-CDE NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE ZERO   TO  RS-SUB
                   MOVE SPACE  TO  PRINT-RCD-WS
                   GO TO  615-WRITE-RS-LIST
               ELSE
                   MOVE "DBGET5 DRCVITM*615-LRSL"  TO  BU-DISPLAY-MSG
                   MOVE CORPCODE-ARG  TO  BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF CORPCDE OF DRCVITEM-REC-I-CDE NOT = CORPCODE-ARG
               MOVE ZERO       TO  RS-SUB
               MOVE SPACE      TO  PRINT-RCD-WS
               GO TO  615-WRITE-RS-LIST.

           IF RCV-PO-RCV-NO = PO-ARG
               GO TO  615-LIST-RS-LOOP
           ELSE
               IF RCV-PO-REL = PO-NO-RLSE
                   ADD +1  TO  RS-SUB
                   IF RS-SUB > +7
                       MOVE ZERO   TO  RS-SUB
                       MOVE SPACE  TO  PRINT-RCD-WS
                       GO TO  615-WRITE-RS-LIST
                   ELSE
                       MOVE RCV-PO-RCV-NO  TO  RCV-SLIP-NO (RS-SUB)
                       GO TO  615-LIST-RS-LOOP
               ELSE
                   GO TO  615-LIST-RS-LOOP.

       615-WRITE-RS-LIST.
           ADD +1  TO  RS-SUB.

           IF RS-SUB > +7
               PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X
               WRITE  PRINT-RCD  FROM  SUB-HEAD6
                   AFTER ADVANCING 2 LINES
               ADD +2  TO  LINE-CTR
               WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
                   AFTER ADVANCING 1 LINES
               ADD +1  TO  LINE-CTR
               GO TO  615-CODED-ITEM-LOOP.

           IF RCV-SLIP-NO (RS-SUB) = SPACE
               IF RS-SUB > +1
                   PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X
                   WRITE  PRINT-RCD  FROM  SUB-HEAD6
                       AFTER ADVANCING 2 LINES
                   ADD +2  TO  LINE-CTR
                   WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
                       AFTER ADVANCING 1 LINES
                   ADD +1  TO  LINE-CTR
                   GO TO  615-CODED-ITEM-LOOP
               ELSE
                   GO TO  615-CODED-ITEM-LOOP
           ELSE
               MOVE RS-PO-NO (RS-SUB)    TO  LPRT-PO (RS-SUB)
               MOVE "-"                  TO  LPRT-H1 (RS-SUB)
               MOVE RS-PO-RLSE (RS-SUB)  TO  LPRT-RLSE (RS-SUB)
               MOVE "-"                  TO  LPRT-H2 (RS-SUB)
               MOVE RS-PO-RS (RS-SUB)    TO  LPRT-RS (RS-SUB)
               GO TO  615-WRITE-RS-LIST.

       615-RS-INFO-NEXT.
           ADD +1  TO  A-RS.
           ADD +1  TO  RS-CALL-CTR.

           IF RS-CALL-CTR > RCV-SLIP-CTR
               PERFORM 700-INVOICING-INFO THRU 799-EXIT
               GO TO  61-REPORT.

           MOVE "Y"  TO  NEW-RS-NO-SW.

           MOVE ALTER-PO-ARG TO PORCVNO OF DRCVITEM-REC-I-PO.
           START DRCVITEM-I-PO KEY = PORCVNO OF DRCVITEM-REC-I-PO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 615-FRT-INFO-LOOP
               ELSE
               MOVE "DBFIND DRCVITEM*615-RIN"  TO  BU-DISPLAY-MSG
               MOVE ALTER-PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

       615-RS-INFO-LOOP.
           READ DRCVITEM-I-PO NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 615-FRT-INFO-LOOP
               ELSE
                   MOVE "DBGET DRCVITEM*615-RIL"  TO  BU-DISPLAY-MSG
                   MOVE ALTER-PO-ARG  TO  BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF PORCVNO OF DRCVITEM-REC-I-PO NOT = ALTER-PO-ARG
               GO TO 615-FRT-INFO-LOOP.

           ADD +1  TO  RS-PRT-CTR.

           IF RS-PRT-CTR = +1
               PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X
               WRITE  PRINT-RCD  FROM  MAJOR-HEAD5
                    AFTER ADVANCING 2 LINES
               WRITE  PRINT-RCD  FROM  MAJOR-HEAD6
                    AFTER ADVANCING 1 LINES
               ADD +3  TO  LINE-CTR.

           IF NEW-RS-NO-SW = "Y"
               MOVE "N"  TO  NEW-RS-NO-SW
               PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X
               WRITE  PRINT-RCD  FROM  SUB-HEAD7
                   AFTER ADVANCING 2 LINES
               ADD +2                  TO  LINE-CTR
               MOVE SPACE              TO  PRINT-RCD-WS
               MOVE RCV-PO-NO          TO  RSPRT-PO
               MOVE "-"                TO  RSPRT-H1
               MOVE RCV-PO-REL         TO  RSPRT-RLSE
               MOVE "-"                TO  RSPRT-H2
               MOVE RCV-PO-RCVR        TO  RSPRT-RS
           ELSE
               MOVE SPACE              TO  PRINT-RCD-WS.

           MOVE RCV-ITEM-NUMBER        TO  RSPRT-ITEM-NO.
           MOVE RCV-CORP-CODE          TO  RSPRT-CORPCODE.
           MOVE RCV-ITEM-UM            TO  RSPRT-RCVD-UM.
           MOVE RCV-QTY-DLVR           TO  RSPRT-QTY-DLVR.
           MOVE RCV-QTY-STORED         TO  RSPRT-QTY-STOR.
           IF RCV-DATE-RCVD NOT = SPACE
               MOVE 4                  TO  DATE-MODE
               MOVE RCV-DATE-RCVD      TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT     TO  RSPRT-DATE-RCVD.
           IF RCV-DATE-STORED NOT = SPACE
               IF RCV-MM-STORED = "DD"
                   MOVE "*DIRECT*"     TO  RSPRT-DATE-STRD
               ELSE
                   MOVE 4              TO  DATE-MODE
                   MOVE RCV-DATE-STORED TO  DATE-VALIDATE-IN
                   CALL "TDATECHK" USING DATE-CHECK-AREA
                   MOVE DATE-SLASH-OUT  TO  RSPRT-DATE-STRD.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +1  TO  LINE-CTR.
           GO TO  615-RS-INFO-LOOP.

       615-FRT-INFO-LOOP.
           MOVE ALTER-PO-ARG TO PORCVNO OF DPOFREIGHT-REC-I-PO.
           READ DPOFREIGHT-I-PO INTO BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPOFREIGHT*615-FIL"  TO  BU-DISPLAY-MSG
               MOVE ALTER-PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

9405CK*    IF FRT-TYPE = "P"
9405CK*        GO TO  615-RS-INFO-NEXT.

           PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X.
           WRITE  PRINT-RCD  FROM  SUB-HEAD8
               AFTER ADVANCING 2 LINES.
           ADD +2  TO  LINE-CTR.
           MOVE SPACE              TO  PRINT-RCD-WS.
           MOVE FRT-CARRIER        TO  FPRT-CARRIER.
           MOVE FRT-PACK-SLIP      TO  FPRT-PACK-SLIP.
           MOVE FRT-BILL-NO        TO  FPRT-PRO-NUMBER.
           IF FRT-BILL-DATE NOT = SPACE
               MOVE 4              TO  DATE-MODE
               MOVE FRT-BILL-DATE  TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT TO  FPRT-PRO-DATE.
           MOVE FRT-CHARGES-9      TO  FPRT-CHARGES.
           MOVE FRT-SPLC           TO  FPRT-SPLC.
           MOVE FRT-RAIL-CAR       TO  FPRT-RAILCAR.
           MOVE FRT-CARRIER-WT     TO  FPRT-CARRIER-WT.
           MOVE FRT-OUR-WT         TO  FPRT-OUR-WT.
           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD +1  TO  LINE-CTR.
           GO TO  615-RS-INFO-NEXT.



      *************************************************************
      *            CREATE INVOICING INFORMATION SECTION           *
      *************************************************************
       700-INVOICING-INFO.
      *----------  READ EACH INVOICE RECORD
           MOVE PO-ARG TO PORCVNO OF DINVRCD-REC-I.
           START DINVRCD-I KEY = PORCVNO OF DINVRCD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 799-EXIT
               ELSE
                   MOVE "DBFIND DINVRCD * 700"
                        TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.

           IF LINE-CTR > 58
              PERFORM 6111-TOP-CHECK THRU 6111-TOP-CHECK-X.
           WRITE PRINT-RCD FROM MAJOR-HEAD7 AFTER ADVANCING 2 LINES.
           WRITE PRINT-RCD FROM MAJOR-HEAD8 AFTER ADVANCING 1 LINES.
           ADD +3 TO LINE-CTR.

       705-GET-DINVRCD.
           READ DINVRCD-I NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 799-EXIT
               ELSE
                   MOVE "DBGET DINVRCD AT 705 IN TINVPRT"
                       TO BU-DISPLAY-MSG
                   MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.
           IF PORCVNO OF DINVRCD-REC-I NOT = PO-ARG
               GO TO 799-EXIT.

           MOVE INV-REG-NO TO REG-ARG.
      *----------  WRITE FIRST 14 LINES OF DINVRCD DATA
           IF LINE-CTR > 38
              PERFORM 6111-TOP-CHECK2 THRU 6111-TOP-CHECK-X2.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "REGISTER"            TO HEAD2-REGISTER.
           MOVE "INVOICE NUMBER"      TO HEAD2-INVOICE.
           MOVE "STATUS"              TO HEAD2-STATUS.
           MOVE "INVOICE DATE"        TO HEAD2-INV-DATE.
           MOVE "ENTRY DATE"          TO HEAD2-ENTRY-DATE.
           MOVE "DUE-DATE"            TO HEAD2-DUE-DATE.
           MOVE "TERMS"               TO HEAD2-TERMS.
           MOVE "PO NUMBER"           TO HEAD2-PO.
           MOVE "EMPLOYEE ID "        TO HEAD2-ID.
           MOVE "ADD/CHANGE"          TO HEAD2-ADD.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 3 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE INV-REG-NO-9          TO LINE1-REG.
           MOVE INV-NO                TO LINE1-INV-NO.
           MOVE INV-STATUS            TO LINE1-STATUS.
           MOVE INV-DATE              TO DATE-VALIDATE-IN.
           MOVE 4                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT        TO LINE1-INV-DATE.
           MOVE INV-ENTRY-DATE        TO DATE-VALIDATE-IN.
           MOVE 4                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT        TO LINE1-ENTRY-DATE.
           MOVE INV-DUE-DATE          TO DATE-VALIDATE-IN.
           MOVE 4                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT        TO LINE1-DUE-DATE.
           MOVE INV-TERMS             TO LINE1-TERMS.
           MOVE INV-PO-RLSE           TO LINE1-PO.
           MOVE INV-ADD-CLERK         TO LINE1-ID.
           MOVE "/"                   TO LINE1-SLASH.
           MOVE INV-MOD-CLERK         TO LINE1-ADD.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "VENDOR  "            TO LINE2-VENDOR.
           MOVE "NAME  "              TO LINE2-NAME.
           MOVE "NO CHECK INDIC (IT)" TO LINE2-CHECK.

           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 2 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.

      *----------  FILL IN VENDOR NAME
           MOVE INV-VEN-CODE          TO VEN-ARG.
           MOVE VEN-ARG               TO VENCDE OF DVENDOR-REC-I.
           MOVE "00"                  TO VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
              MOVE "***   VENDOR NAME NOT ON FILE   ***"
                  TO LINE2A-NAME-OUT
           ELSE
           IF FILE-STATUS NOT = "00"
             MOVE "DBFIND DVENDOR * 705" TO BU-DISPLAY-MSG
             MOVE VEN-ARG TO BU-DISPLAY-FLD (1)
             PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE VEN-ITM-DATA          TO LINE2A-NAME-OUT.

           MOVE INV-VEN-CODE          TO WORK-VENDOR.
           MOVE WORK-VEN              TO LINE2A-VENDOR-CODE.
           MOVE INV-NO-CHECK-INDIC    TO LINE2A-CHECK-IND.
           MOVE INV-FREE-VERB         TO LINE2A-VERBAGE.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "MANIFEST "           TO LINE2B-MAN.
           MOVE INV-MFEST-NO          TO LINE2B-MAN-NO.
           MOVE INV-MFEST-YY          TO LINE2B-MAN-YY.
           MOVE "CHECK #"             TO LINE2B-CHECK.
           MOVE INV-CHECK-NO          TO LINE2B-CHECK-NO.
           MOVE INV-CHECK-DATE        TO DATE-VALIDATE-IN.
           MOVE 4                     TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT        TO LINE2B-CHECK-DATE.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 2 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "PO MATERIAL EXT  "   TO LINE3-PO.
           MOVE INV-P-MATL-EXT        TO LINE3-PO-EXT.
           MOVE " INV FREIGHT    "    TO LINE3-INV-FRT.
           MOVE INV-ADD-VFRT          TO LINE3-FRT-AMT.
           MOVE "  CE "               TO LINE3-CE.
           MOVE CE1-CODE              TO LINE3-CE-CODE.
           MOVE CE1-ACCTG-DATA        TO LINE3-CE-AMOUNT.
           MOVE CE1-TOTAL             TO LINE3-CE-AMT.
           MOVE " NET DUE VENDOR  "   TO LINE3-NET.
           MOVE INV-NET-DUE-VENDOR    TO LINE3-NET-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "INV MATERIAL EXT "   TO LINE4-INV.
           MOVE INV-I-MATL-EXT        TO LINE4-INV-EXT.
           MOVE " INV TAX        "    TO LINE4-INV-TAX.
           MOVE INV-ADD-TAX           TO LINE4-TAX-AMT.
           MOVE "  CE 3 (FREIGHT)"    TO LINE4-CE3.
           MOVE CE3-FRT               TO LINE4-AMT.
           MOVE " COLLECT FRT"        TO LINE4-FRT.
           MOVE INV-TOTAL-CFRT        TO LINE4-FRT-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE  "INV-CONTAINERS"     TO LINE5-INV-CON.
           MOVE INV-ADD-CTNRS         TO LINE5-CON-AMT.
           MOVE "  CE 4 (INSURANCE)"  TO LINE5-CE4.
           MOVE CE4-INS               TO LINE5-AMT.
           MOVE " ACCRUED TAX   "     TO LINE5-TAX.
           COMPUTE LINE5-TAX-AMT ROUNDED =
             INV-ATAX-AMT (1) + INV-ATAX-AMT (2) + INV-ATAX-AMT (3)
                + INV-ATAX-AMT (4).
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "PAYMENT INDICATOR "  TO LINE6-PAY-IND.
           MOVE INV-PAYMENT-IND       TO LINE6-IND.
           MOVE "INV OTHER     "      TO LINE6-OTH.
           MOVE INV-ADD-OTHER         TO LINE6-OTH-AMT.
           MOVE "  CE 5 (TAX)       " TO LINE6-CE5.
           MOVE CE5-TAX               TO LINE6-AMT.
           MOVE " OTHER ADJUST    "   TO LINE6-OTHER.
           MOVE INV-ADJ-OTHER         TO LINE6-OTHER-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "INV INSURANCE "      TO LINE7-INS.
           MOVE INV-ADD-INS           TO LINE7-INS-AMT.
           MOVE "  CE 6 (EXTND ERR)"    TO LINE7-CE6.
           MOVE CE6-EXT-ERR           TO LINE7-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "Z-BILL NUMBER  "     TO LINE8-ZBILL-NO.
           MOVE "CALC. INV AMT "      TO LINE8-CALC-AMT.
           IF INV-PAYMENT-IND = SPACES
              MOVE ZEROES TO LINE8-CALC-AMOUNT
           ELSE
              IF INV-PAYMENT-IND = "P"
                 COMPUTE LINE8-CALC-AMOUNT = INV-P-MATL-EXT +
                         INV-ADD-VFRT + INV-ADD-TAX + INV-ADD-CTNRS
                         + INV-ADD-INS + INV-ADD-OTHER
           ELSE
              IF INV-PAYMENT-IND = "I"
                 COMPUTE LINE8-CALC-AMOUNT = INV-I-MATL-EXT +
                         INV-ADD-VFRT + INV-ADD-TAX + INV-ADD-CTNRS
                         + INV-ADD-INS + INV-ADD-OTHER.
           MOVE "  CE 7 (PRICE ERR)"   TO LINE8-CE7.
           MOVE CE7-UPRC-ERR          TO LINE8-AMT.
           MOVE " COST DISTRIB"       TO LINE8-COST.
           MOVE INV-DIST-COST         TO LINE8-COST-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "CE 8 (OTHER)      "  TO LINE9-CE8.
           MOVE CE8-OTHER             TO LINE9-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "CE 9 (CASH DSCNT)"    TO LINE10-CE9.
           MOVE CE9-CASH-DSCNT        TO LINE10-AMT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE "TAX CODE"            TO LINE10-TAX.
           MOVE INV-TAX-CODE          TO LINE10-TAX-CODE.

           IF CE-EXT-VALUE-1 NOT = ZEROES
              MOVE "CE " TO LINE10A-CE
              MOVE CE-EXT-CODE-1 TO LINE10A-CODE
              MOVE CE-EXT-ACCTG-DATA-1 TO LINE10A-ACCTG
              MOVE CE-EXT-VALUE-1 TO LINE10A-VALUE.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           ADD 19                     TO LINE-CTR.
      *************************************************************
      *************************************************************
      **       USE REGISTER NUMBER AND RETRIEVE FREIGHT DATA     **
      *************************************************************
      *************************************************************
           MOVE REG-ARG TO REGISTERNO OF DPOFREIGHT-REC-I-REG.
           START DPOFREIGHT-I-REG
                     KEY = REGISTERNO OF DPOFREIGHT-REC-I-REG
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 730-FIND-DINVITM
               ELSE
                   MOVE "FIND DPOFREIGHT AT 705 IN INVPRPT"
                       TO BU-DISPLAY-MSG
                   MOVE REG-ARG      TO  BU-DISPLAY-FLD (1)
                   PERFORM 990-BLOWUP THRU 999-EXIT.

           IF LINE-CTR > 58
              PERFORM 6111-TOP-CHECK THRU 6111-TOP-CHECK-X.

           MOVE "COLLECT FREIGHT"     TO HEAD3-COLLECT.
           MOVE "PRO-NUMBER"          TO HEAD3-PRO.
           MOVE "CARRIER"             TO HEAD3-CARRIER.
           MOVE "FREIGHT CHARGE"      TO HEAD3-FREIGHT.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
                AFTER ADVANCING 1 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           ADD 1                      TO LINE-CTR.


       710-GET-DPOFREIGHT-LOOP.
           READ DPOFREIGHT-I-REG NEXT INTO BUF-DPOFREIGHT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 730-FIND-DINVITM
               ELSE
               MOVE "GET DPOFREIGHT AT 710 IN INVITM" TO BU-DISPLAY-MSG
               MOVE REG-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.
           IF REGISTERNO OF DPOFREIGHT-REC-I-REG NOT = REG-ARG
               GO TO 730-FIND-DINVITM.

           MOVE FRT-BILL-NO           TO LINE11-PRO.
           MOVE FRT-CARRIER           TO LINE11-CARRIER.
           MOVE FRT-CHARGES-9         TO LINE11-CHARGE.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           ADD 1 TO LINE-CTR.
           GO TO 710-GET-DPOFREIGHT-LOOP.
      *************************************************************
      *************************************************************
      **     GET ITEM INFO FROM DINVITM AND DINVACCT.            **
      *************************************************************
      *************************************************************
       730-FIND-DINVITM.
           MOVE REG-ARG TO REGISTERNO OF DINVITM-REC-I.
           START DINVITM-I KEY = REGISTERNO OF DINVITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 705-GET-DINVRCD
               ELSE
               MOVE "FIND DINVITM AT 730 IN INVITM"  TO  BU-DISPLAY-MSG
               MOVE REG-ARG            TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           IF LINE-CTR > 58
              PERFORM 6111-TOP-CHECK THRU 6111-TOP-CHECK-X.

           MOVE "ITEM  CORP CODE"     TO HEAD4-ITEM.
           MOVE "QUANTITY PAID"       TO HEAD4-QTY.
           MOVE "PRICE    UM"         TO HEAD4-PRICE-UM.
           MOVE "ITEM EXTENSION"      TO HEAD4-ITEM-EXT.
           MOVE "ACCOUNTING DATA"     TO HEAD4-DATA.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 2 LINES.
           MOVE SPACES                TO PRINT-RCD-WS.
           ADD 2 TO LINE-CTR.

           MOVE REG-ARG TO REGISTERNO OF DINVACCT-REC-I.
           START DINVACCT-I KEY = REGISTERNO OF DINVACCT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "9999" TO INVACCT-ITEM
               ELSE
               MOVE "FIND DINVACCT-66-PII"  TO  BU-DISPLAY-MSG
               MOVE REG-ARG             TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           PERFORM 760-GET-DINVACCT  THRU  769-EXIT.
       740-GET-DINVITM-LOOP.
           READ DINVITM-I NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 705-GET-DINVRCD
               ELSE
                MOVE "GET DINVRCD AT 740 IN INVPRPT" TO BU-DISPLAY-MSG
                MOVE REG-ARG  TO  BU-DISPLAY-FLD (1)
                PERFORM 990-BLOWUP THRU 999-EXIT.
           IF REGISTERNO OF DINVITM-REC-I NOT = REG-ARG
                GO TO 705-GET-DINVRCD.

           IF LINE-CTR > 58
              PERFORM 6111-TOP-CHECK THRU 6111-TOP-CHECK-X.

           MOVE INVITM-ITEM-NO        TO  LINE12-ITEM.
           MOVE INVITM-CORPCODE       TO  LINE12-CORP.
           MOVE "   PO"               TO  LINE12-PO.
           MOVE INVITM-PO-QTY-PD      TO  LINE12-QTY.
           MOVE INVITM-PO-UPRICE      TO  LINE12-PRICE.
           MOVE INVITM-PO-UM          TO  LINE12-UM.
           IF INVITM-PO-QTY-PD = ZEROES
              MOVE INVITM-PO-UPRICE TO LINE12-EXT
           ELSE
              MULTIPLY INVITM-PO-UPRICE BY INVITM-PO-QTY-PD
                  GIVING LINE12-EXT ROUNDED.
           MOVE INVITM-TAX-CODE       TO  LINE12-TAX.

           IF INVACCT-ITEM = INVITM-ITEM-NO
               MOVE INVACCT-PRIME     TO  LINE12-PRIME
               MOVE INVACCT-SUB       TO  LINE12-SUB
               MOVE INVACCT-SUBD      TO  LINE12-SUBD
               MOVE INVACCT-ADDL-DATA TO  LINE12-DATA
               PERFORM 760-GET-DINVACCT  THRU  769-EXIT.

           ADD 1 TO LINE-CTR.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.

           MOVE SPACES                TO PRINT-RCD-WS.
           MOVE INVITM-INV-QTY-PD     TO  LINE13-QTY.
           MOVE INVITM-INV-UPRICE     TO  LINE13-PRICE.
           MOVE INVITM-PO-UM          TO  LINE13-UM.
           IF INVITM-INV-QTY-PD = ZEROES
              MOVE INVITM-INV-UPRICE TO LINE13-EXT
           ELSE
              MULTIPLY INVITM-INV-UPRICE BY INVITM-INV-QTY-PD
                  GIVING LINE13-EXT ROUNDED.
           IF INVITM-MEMO-INDIC = "X"
               MOVE "MEMO QTY."       TO  LINE13-MEMO.
           MOVE "INV  "               TO LINE13-INV.
           IF INVACCT-ITEM = INVITM-ITEM-NO
               MOVE INVACCT-PRIME     TO  LINE13-PRIME
               MOVE INVACCT-SUB       TO  LINE13-SUB
               MOVE INVACCT-SUBD      TO  LINE13-SUBD
               MOVE INVACCT-ADDL-DATA TO  LINE13-DATA.
           WRITE PRINT-RCD FROM PRINT-RCD-WS
               AFTER ADVANCING 1 LINES.
           ADD 1                      TO  LINE-CTR.
           MOVE SPACES                TO  PRINT-LINE.

       750-CHECK-FOR-MORE-ACCTG.
           IF LINE-CTR > 58
              PERFORM 6111-TOP-CHECK THRU 6111-TOP-CHECK-X.

           IF INVACCT-ITEM = INVITM-ITEM-NO
               PERFORM 760-GET-DINVACCT  THRU  769-EXIT
               IF INVACCT-ITEM  =  INVITM-ITEM-NO
                   MOVE INVACCT-PRIME     TO  LINE14-PRIME
                   MOVE INVACCT-SUB       TO  LINE14-SUB
                   MOVE INVACCT-SUBD      TO  LINE14-SUBD
                   MOVE INVACCT-ADDL-DATA TO  LINE14-DATA
                   WRITE PRINT-RCD FROM PRINT-RCD-WS
                       AFTER ADVANCING 1 LINES
                   MOVE SPACES            TO  PRINT-LINE
                   ADD 1                  TO LINE-CTR
                   GO TO 750-CHECK-FOR-MORE-ACCTG.
           GO TO 740-GET-DINVITM-LOOP.

       760-GET-DINVACCT.
           READ DINVACCT-I NEXT INTO BUF-DINVACCT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "9999" TO INVACCT-ITEM
               ELSE
                MOVE "GET DINVACCT AT 760 IN INVPRPT" TO BU-DISPLAY-MSG
                MOVE REG-ARG  TO  BU-DISPLAY-FLD (1)
                PERFORM 990-BLOWUP THRU 999-EXIT.
           IF REGISTERNO OF DINVACCT-REC-I NOT = REG-ARG
               MOVE "9999"  TO  INVACCT-ITEM.

       769-EXIT.  EXIT.
       799-EXIT.  EXIT.
       61-REPORT-X.
           EXIT.


       61-PERFORMED-LOGIC SECTION 03.
       6111-TOP-CHECK.
           IF LINE-CTR > 58
               MOVE ZERO  TO  LINE-CTR
               MOVE PAGE-CTR  TO  MH1C-PAGE
               WRITE  PRINT-RCD  FROM  MAJOR-HEAD1C
                   AFTER ADVANCING NEWPAGE
               WRITE  PRINT-RCD  FROM  MAJOR-HEAD2
                   AFTER ADVANCING 1 LINES
               ADD +2  TO  LINE-CTR.

       6111-TOP-CHECK-X.
           EXIT.
       6111-TOP-CHECK2.
           MOVE ZERO  TO  LINE-CTR.
           MOVE PAGE-CTR  TO  MH1C-PAGE.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD1C
                   AFTER ADVANCING NEWPAGE.
           WRITE  PRINT-RCD  FROM  MAJOR-HEAD2
                   AFTER ADVANCING 1 LINES.
           ADD +2  TO  LINE-CTR.

       6111-TOP-CHECK-X2.
           EXIT.


       6131-FIND-DPODATAITM.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-I.
           START DPODATAITM-I KEY = PORCVNO OF DPODATAITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 6131-FIND-DPODATAITM-X
               ELSE
               MOVE "DBFIND DPODATAITM*6131-FD"  TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZERO  TO  COM-SUB.

       6131-GET-DPODATAITM-LOOP.
           READ DPODATAITM-I NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 6131-FIND-DPODATAITM-X
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-I NOT = PO-ARG
               GO TO 6131-FIND-DPODATAITM-X.

           IF DATAITM-ITEM-NO = ZERO
               IF DATAITM-LINE-NO > "48" AND DATAITM-LINE-NO < "99"
                   IF COM-SUB = ZERO
                       PERFORM  6111-TOP-CHECK  THRU  6111-TOP-CHECK-X
                       WRITE  PRINT-RCD  FROM  SUB-HEAD3
                           AFTER ADVANCING 2 LINES
                       ADD +2  TO  LINE-CTR
                       ADD +1  TO  COM-SUB
                       MOVE SPACE  TO  PRINT-RCD-WS
                       MOVE DATAITM-INFO  TO  CPRT-COMMENT
                       WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
                           AFTER ADVANCING 1 LINES
                       ADD +1  TO  LINE-CTR
                       GO TO  6131-GET-DPODATAITM-LOOP
                   ELSE
                       IF COM-SUB = +1
                           ADD +1  TO  COM-SUB
                           MOVE SPACE  TO  PRINT-RCD-WS
                           MOVE DATAITM-INFO  TO  CPRT-COMMENT
                           WRITE  PRINT-RCD  FROM  PRINT-RCD-WS
                               AFTER ADVANCING 1 LINES
                           ADD +1  TO  LINE-CTR
                           GO TO  6131-FIND-DPODATAITM-X.

       6131-FIND-DPODATAITM-X.
           EXIT.

       COPY OVRPFCALL IN COPYLIB.

001000************************************************************      XBLOWUP
002000************************************************************      XBLOWUP
003000*                    B L O W U P                           *      XBLOWUP
004000*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *      XBLOWUP
005000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *      XBLOWUP
006000*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *      XBLOWUP
007000*                                                          *      XBLOWUP
008000*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *      XBLOWUP
009000*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *      XBLOWUP
010000*                                                          *      XBLOWUP
011000*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *      XBLOWUP
012000************************************************************      XBLOWUP
013000************************************************************      XBLOWUP
014000 990-BLOWUP.                                                      XBLOWUP
015000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,         XBLOWUP
016000           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,             XBLOWUP
017000           BU-DISPLAY-FLDS.                                       XBLOWUP
018000 999-EXIT.  EXIT.                                                 XBLOWUP
