000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TINVTRN.
000400 AUTHOR.              WILL MCINTYRE.
000500 DATE-WRITTEN.        JUN 1994.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*REMARKS.             INVENTORY TURNOVER PROGRAM.
000900*
001000*    *********************************************************
001100*    **                                                     **
001200*    **                  JUNE 27, 1994                      **
001300*    **  I N V E N T O R Y   T U R N O V E R   R E P O R T  **
001400*    **                                                     **
001500*    *********************************************************
      *C
      *C   12/20/1996  WL MCINTYRE
      *C   REVISED CODE TO CLOSE THE PRINTER AND DAILY TRANSACTION FILE
      *C   DEPENDING UPON THE MODE THE PROGRAM IS IN.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
010400 ENVIRONMENT DIVISION.
010500 CONFIGURATION SECTION.
010600 SOURCE-COMPUTER.  HP-3000.
010700 OBJECT-COMPUTER.  HP-3000.
010800 SPECIAL-NAMES. C01 IS NEW-PAGE.
011000
011100 INPUT-OUTPUT SECTION.
011200 FILE-CONTROL.
011300     SELECT ONLINE-PRT    ASSIGN TO PRINTER-MCPRT.
011500
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MUSAGE-I
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DL-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

011600 DATA DIVISION.
011700 FILE SECTION.
011800
011900 FD  ONLINE-PRT
012000     LABEL RECORDS ARE OMITTED
012100     RECORD CONTAINS 132 CHARACTERS
012200     DATA RECORD IS PRINT-RCD.
012300 01  PRINT-RCD.
012400     05  PRINT-LINE             PIC X(132).
012500
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  MUSAGE-I
           LABEL RECORDS ARE STANDARD.
       01  MUSAGE-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.

       FD  DDAILYTC-DL-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-DL-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

013800 WORKING-STORAGE SECTION.
013900
       77  WORK-CURINV                PIC S9(13)V9(2).
       77  WORK-USGPER                PIC S9(13)V9(2).
       77  WORK-USGPERDOL             PIC S9(13)V9(2).
       77  WORK-USGPER-INTEGER        PIC S9(13).
       77  WORK-DLYUSG                PIC S9(13)V9(2).
       77  WORK-DLYUSG-INTEGER        PIC S9(13).
       77  WORK-INVONH                PIC S9(12).
       77  WORK-INVTRN                PIC S9(11)V9(2).
       77  WORK-CURINVTOT             PIC S9(13)V9(2).
       77  WORK-USGPERTOT             PIC S9(13)V9(2).
       77  WORK-USGPERTOT-INTEGER     PIC S9(13).
       77  WORK-DLYUSGTOT             PIC S9(13)V9(2).
       77  WORK-DLYUSGTOT-INTEGER     PIC S9(13).
       77  WORK-INVONHTOT             PIC S9(12).
       77  WORK-INVTRNTOT             PIC S9(11)V9(2).
       77  WORK-CLASS                 PIC X(04)  VALUE SPACES.
       77  MCXCBLERR-SCOPE            PIC X(1)       VALUE "C".
014900
015000******ARGUMENT VALUES******
015100
015200 77  ITMS-PER-PAGE              PIC 99     VALUE ZEROS.
015300 77  PG-CTR                     PIC 999    VALUE ZEROS.
015300 77  TRANS-WRITE-CTR            PIC 999    VALUE ZEROS.
015400
015700**************************************************************
015800**                                                          **
015900**              A C C E P T    F I E L D S                  **
016000**                                                          **
016100**************************************************************
016200
016300 01  ROUTE-LINE               PIC X(80)  VALUE SPACES.
017500
017600**************************************************************
017700**                                                          **
017800**             D A T E / T I M E   A R E A S                **
017900**                                                          **
018000**************************************************************
018100
018200 01  CODE-ARG.
018300     05  CODE-ARG-1-2           PIC X(2).
018400     05  FILLER                 PIC X(6).
018500
       01  WORK-DATE.
           05  WORK-AMERICAN.
               10  WORK-MONTH          PIC 9(02).
               10  WORK-DAY            PIC 9(02).
               10  WORK-YEAR           PIC 9(02).
           05  WORK-EUROPEAN REDEFINES WORK-AMERICAN.
               10  WORK-EDAY           PIC 9(02).
               10  WORK-EMONTH         PIC 9(02).
               10  WORK-EYEAR          PIC 9(02).

018600 COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.
018700
018800**************************************************************
018900**                                                          **
019000**         E R R O R   M E S S A G E   A R E A S            **
019100**                                                          **
019200**************************************************************
019300
019400 COPY TBLOWUP IN COPYLIB.
019500 01  VIEW-COMAREA.
019600     05  FILLER                 PIC X(118)  VALUE ALL "0".
019700     05  FILLER                 PIC S9(4)   COMP-4 VALUE 9999.
019800 01  KSAM-STATUS                PIC X(2)    VALUE SPACES.
019900
020000*************************************************************
020100**                                                         **
020200**            E S C A P E   S E Q U E N C E S              **
020300**                                                         **
020400*************************************************************
020500
020600 COPY ESCNAM2 IN COPYLIB.
020700
020800 01  COMPRESS-PRINT             PIC X(8).
020900
021000 01  NORMAL-PRINT               PIC X(8).
021100
021400**************************************************************
021500**                                                          **
021600**  P A R M S   F O R   C A L L   T O   "T H D P R T 2"     **
021700**                                                          **
021800**************************************************************
021900
022000  COPY THDPRTA IN COPYLIB.
022100
022200**************************************************************
022300**                                                          **
022400**       C O M M U N I C A T I O N S   A R E A S            **
022500**                                                          **
022600**************************************************************
022700
022800 01  FATAL-ERROR-SW             PIC X(1)  VALUE "N".
022900
023000 COPY TCHKBLKT IN COPYLIB.
023100
023200 COPY CDESC IN COPYLIB.
023300
023400 01  RET-CODE                   PIC X(2)  VALUE SPACES.
023500
023600**************************************************************
023700**                                                          **
023800**           D A T A B A S E   W O R K                      **
023900**                                                          **
024000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
024100
024200 COPY DATAB IN COPYLIB.
024300
024400 01  DSET-NAMES.
024500     05  DSET-NAME              PIC X(16)  VALUE SPACES.
024600     05  DSET-DESC              PIC X(16)  VALUE "DDESC;".
024600     05  DSET-STOREROOM         PIC X(16)  VALUE "MSTORERM;".
024700     05  DSET-CLASS             PIC X(16)  VALUE "MCLASS;".
024800     05  DSET-USAGE             PIC X(16)  VALUE "MCFLUSAG;".
024800     05  DSET-PLTINFO           PIC X(16)  VALUE "MPLTINFO;".
009300     05  DSET-DDAILYTC          PIC X(16)  VALUE "DDAILYTC;".
024900
025000 01  ITEM-LISTINGS.
025100     05  ALL-ITEM-LIST          PIC XX     VALUE "@;".
025200     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
025300
       01  MPLTINFO-LIST.
           05  FILLER                 PIC X(13)  VALUE "PLTINFO-DATA;".

025700 01  PLT-ARG                    PIC X(4)  VALUE "P 01".
025800
025900**************************************************************
026000**                                                          **
026100**           D A T A B A S E   B U F F E R S                **
026200**                                                          **
026300**************************************************************
026400
026500 COPY MSTORERM IN COPYLIB.
026600
026700 01  BUF-DDESC.
026800     05  DESC-CORP-CODE         PIC X(8).
026900     05  DESC-ID-NUM            PIC XX.
027000     05  DESC-DATA              PIC X(80).
027100*        AN 00 ID
027200*           KWRD-ADJ OF 46
027300*           MFR DATA OF 50
027400*        AN 01 ID
027500*           FIRST 96 CHAR OF CATLG

       COPY MCLASS   IN COPYLIB.

       01  WS-MCLASS-CHAR                    PIC X(03)  VALUE ZEROS.
       01  WS-MCLASS-NUM  REDEFINES WS-MCLASS-CHAR  PIC 9(03).

       COPY USAGEFIL IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

       COPY DDAILYTC IN COPYLIB.

       COPY TC390    IN COPYLIB.
027600
028100**************************************************************
028200**                                                          **
028300**       H E A D E R   &   D E T A I L   L I N E S          **
028400**                                                          **
028500**************************************************************
028600
028700 01  DOT-LINE.
028800     05 FILLER              PIC X(132) VALUE ALL "-".
028900
029000 01  REPORT-HEADER.
029100     05  FILLER    PIC X(5)   VALUE "PAGE ".
029200     05  PRT-OVER-PG PIC ZZ9  VALUE ZEROS.
029300     05  FILLER    PIC X(3)   VALUE SPACES.
029400     05  FILLER    PIC X(6)   VALUE "PLANT ".
029500     05  PRT-PLT   PIC X(3)   VALUE SPACES.
029600     05  FILLER    PIC X(25)  VALUE SPACES.
029700     05  FILLER    PIC X(19)  VALUE "I N V E N T O R Y  ".
029800     05  VAL-HD    PIC X(15)  VALUE "T U R N O V E R".
029900     05  FILLER    PIC X(30)  VALUE SPACES.
030000     05  FILLER    PIC X(5)   VALUE "DATE ".
030100     05  PRT-DATE  PIC X(8)   VALUE SPACES.
030200     05  FILLER    PIC XX     VALUE SPACES.
030300     05  PRT-TIME  PIC X(8).
030400
031400 01  INVENTORY-HDR-1.
031600     05  FILLER          PIC X(22)  VALUE SPACES.
031700     05  FILLER          PIC X(07)  VALUE "CURRENT".
031800     05  FILLER          PIC X(04)  VALUE SPACES.
031900     05  FILLER          PIC X(04)  VALUE "DAYS".
032000     05  FILLER          PIC X(17)  VALUE SPACES.
032100     05  FILLER          PIC X(09)  VALUE "USAGE FOR".
032200     05  FILLER          PIC X(14)  VALUE SPACES.
032300     05  FILLER          PIC X(11)  VALUE "DAILY USAGE".
032400     05  FILLER          PIC X(11)  VALUE SPACES.
032500     05  FILLER          PIC X(09)  VALUE "INVENTORY".
032600     05  FILLER          PIC X(15)  VALUE SPACES.
032700     05  FILLER          PIC X(09)  VALUE "INVENTORY".
032800
031400 01  INVENTORY-HDR-2.
           05  FILLER          PIC X(20)  VALUE SPACES.
031600     05  FILLER          PIC X(09)  VALUE "INVENTORY".
031800     05  FILLER          PIC X(04)  VALUE SPACES.
031900     05  FILLER          PIC X(02)  VALUE "IN".
032000     05  FILLER          PIC X(22)  VALUE SPACES.
032100     05  FILLER          PIC X(06)  VALUE "PERIOD".
032200     05  FILLER          PIC X(20)  VALUE SPACES.
032300     05  FILLER          PIC X(05)  VALUE "VALUE".
032400     05  FILLER          PIC X(14)  VALUE SPACES.
032500     05  FILLER          PIC X(06)  VALUE "ONHAND".
032600     05  FILLER          PIC X(15)  VALUE SPACES.
032700     05  FILLER          PIC X(08)  VALUE "TURNOVER".
032600     05  FILLER          PIC X(01)  VALUE SPACES.
032800
031400 01  INVENTORY-HDR-3.
           05  FILLER          PIC X(05)  VALUE "CLASS".
031600     05  FILLER          PIC X(19)  VALUE SPACES.
031700     05  FILLER          PIC X(05)  VALUE "VALUE".
031800     05  FILLER          PIC X(04)  VALUE SPACES.
031900     05  FILLER          PIC X(06)  VALUE "PERIOD".
032000     05  FILLER          PIC X(19)  VALUE SPACES.
032100     05  FILLER          PIC X(05)  VALUE "VALUE".
032200     05  FILLER          PIC X(16)  VALUE SPACES.
032300     05  FILLER          PIC X(09)  VALUE "(PER DAY)".
032400     05  FILLER          PIC X(08)  VALUE SPACES.
032500     05  FILLER          PIC X(12)  VALUE "(NO OF DAYS)".
032600     05  FILLER          PIC X(15)  VALUE SPACES.
032700     05  FILLER          PIC X(05)  VALUE "RATIO".
032700     05  FILLER          PIC X(04)  VALUE SPACES.
032800
032900 01  ITEM-DETAIL.
033000     05  CLASS-OUT      PIC X(04).
033000     05  FILLER         PIC X(04)  VALUE SPACES.
033100     05  CURR-INV-OUT   PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99-.
033100     05  CURR-INV-0OUT  REDEFINES CURR-INV-OUT
                 PIC Z,ZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
033000     05  FILLER         PIC X(04)  VALUE SPACES.
033200     05  DAYS-PER-OUT   PIC Z99.
033000     05  FILLER         PIC X(09)  VALUE SPACES.
033300     05  USAGE-PER-OUT  PIC Z,ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(07)  VALUE SPACES.
033400     05  DAILY-USG-OUT  PIC Z,ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(04)  VALUE SPACES.
033500     05  INV-ONHND-OUT  PIC ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(06)  VALUE SPACES.
033600     05  INV-TRNOVR-OUT PIC ZZ,ZZZ,ZZZ,ZZ9.99-.
034100
038900 01  GRAND-TOTAL-LINE.
039000     05  FILLER         PIC X(05)  VALUE "TOTAL".
033000     05  FILLER         PIC X(03)  VALUE SPACES.
033100     05  CURR-INV-TOT   PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.99-.
033100     05  CURR-INV-0TOT REDEFINES CURR-INV-TOT
                 PIC Z,ZZZ,ZZZ,ZZZ,ZZZ.ZZ-.
033000     05  FILLER         PIC X(04)  VALUE SPACES.
033200     05  DAYS-PER-TOT   PIC Z99.
033000     05  FILLER         PIC X(09)  VALUE SPACES.
033300     05  USAGE-PER-TOT  PIC Z,ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(07)  VALUE SPACES.
033400     05  DAILY-USG-TOT  PIC Z,ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(04)  VALUE SPACES.
033500     05  INV-ONHND-TOT  PIC ZZZ,ZZZ,ZZZ,ZZ9-.
033000     05  FILLER         PIC X(06)  VALUE SPACES.
033600     05  INV-TRNOVR-TOT PIC ZZ,ZZZ,ZZZ,ZZ9.99-.
039300
028100**************************************************************
028200**                                                          **
028300**             T A B L E   W O R K   A R E A                **
028400**                                                          **
028500**************************************************************
028600
       01  WS-SUB1                           PIC S9(03) VALUE ZEROS.
       01  WS-SUB2                           PIC S9(03) VALUE ZEROS.
       01  WS-SAVE-SUB                       PIC 9(03)  VALUE ZEROS.
       01  WS-STOP-LOOP                      PIC 9(03)  VALUE ZEROS.
       01  WS-CALC-FACTOR                    PIC 9(03)  VALUE ZEROS.
       01  WS-GOOD-CLS                       PIC X(01)  VALUE SPACES.

      *---CLASS TABLE.  THE STRUCTURE IS AS FOLLOWS:
      *---    << LEVEL 1 >>          << LEVEL 2 >>
      *---     CLASS  CURINV         USGPER1  DLYUSG1  INVONH1  INVTRN1
      *---                           USGPER2  DLYUSG2  INVONH2  INVTRN2
      *---                           USGPER3  DLYUSG3  INVONH3  INVTRN3
      *---                           USGPER4  DLYUSG4  INVONH4  INVTRN4
      *---    WILL HOLD 100 ENTRIES (LEVELS 1 AND 2), I.E.  100 CLASS
      *---    ENTRIES W/ CURRENT INVENTORY VALUE, AS WELL AS 4 SETS
      *---    OF INVENTORY DATA WHICH REPRESENTS 4 TIME PERIODS.  THE
      *---    PERIODS ARE 365 DAYS (1), 180 DAYS (2), 90 DAYS (3) AND
      *---    30 DAYS (4).  THE PERIODS ARE ASSIGNED IN THIS MANNER
      *---    SO TABLE CAN BE READ SEQUENTIALLY AND PRODUCE DETAIL
      *---    IN THE AFOREMENTIONED ORDER.
       01  WS-TABLE.
           05  WS-TABLE-ENTRY OCCURS 100 TIMES.
               10  WS-TBL-CLASS              PIC X(04).
               10  WS-TBL-CURINV             PIC S9(13)V99.
               10  WS-TBL-INVDATA   OCCURS 4 TIMES.
                   15  WS-TBL-USGPER         PIC S9(13)V99.
                   15  WS-TBL-DLYUSG         PIC S9(13)V99.
                   15  WS-TBL-INVONH         PIC S9(12).
                   15  WS-TBL-INVTRN         PIC S9(11)V9999.

      *---CLASS TOTAL TABLE.  THE STRUCTURE IS AS FOLLOWS:
      *---    << LEVEL1 >>    << LEVEL2 >>
      *---    CURINV          USGPER1  DLYUSG1  INVONH1  INVTRN1
      *---                    USGPER2  DLYUSG2  INVONH2  INVTRN2
      *---                    USGPER3  DLYUSG3  INVONH3  INVTRN3
      *---                    USGPER4  DLYUSG4  INVONH4  INVTRN4
      *---    WILL HOLD 1 ENTRIES (LEVELS 1 AND 2), I.E.  1 TOTAL
      *---    ENTRY W/ CURRENT INVENTORY VALUE, AS WELL AS 4 SETS
      *---    OF INVENTORY DATA WHICH REPRESENTS 4 TIME PERIODS.  THE
      *---    PERIODS ARE 365 DAYS (1), 180 DAYS (2), 90 DAYS (3) AND
      *---    30 DAYS (4).  THE PERIODS ARE ASSIGNED IN THIS MANNER
      *---    SO TABLE CAN BE READ SEQUENTIALLY AND PRODUCE TOTAL
      *---    LINES IN THE AFOREMENTIONED ORDER.
       01  WS-TOT-TABLE.
           05  WS-TOT-CURINV                 PIC S9(13)V99.
           05  WS-TOT-TABLE-ENTRY OCCURS 4 TIMES.
               10  WS-TOT-USGPER             PIC S9(13)V99.
               10  WS-TOT-DLYUSG             PIC S9(13)V99.
               10  WS-TOT-INVONH             PIC S9(12).
               10  WS-TOT-INVTRN             PIC S9(11)V99.

      *---INVENTORY TURNOVER RATIO TRANSACTION TABLE.
      *---HOLDS ITR VALUES FOR THE FOUR PERIODS IN THE FOLLOWING
      *---ORDER: 365 DAYS, 180 DAYS, 90 DAYS AND 30 DAYS.
       01  WS-TRANS-TABLE.
           05  WS-TRN-ENTRY OCCURS 4 TIMES.
               10  WS-TRN-INVTRN             PIC S9(11)V99.

       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
016400 01  DATA-LINE                PIC X(80).
016500 01  R34-REC REDEFINES DATA-LINE.
016600     05  R34-BCUTOFF-RUN      PIC X.
017300     05  FILLER               PIC X(79).
017400
039400 PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
039500
       MAIN-LOGIC.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           PERFORM 6-MAIN         THRU 6-EXIT.
           PERFORM 2-END-OF-JOB   THRU 2-EXIT.

039600 1-HOUSEKEEPING.
           MOVE ZERO TO WORK-CURINV, WORK-USGPER, WORK-DLYUSG,
                        WORK-INVONH, WORK-INVTRN, WORK-USGPERDOL,
                        WORK-USGPER-INTEGER, WORK-DLYUSG-INTEGER,
                        WORK-CURINVTOT, WORK-USGPERTOT, WORK-DLYUSGTOT,
                        WORK-USGPERTOT-INTEGER, WORK-DLYUSGTOT-INTEGER,
                        WORK-INVONHTOT, WORK-INVTRNTOT, ITMS-PER-PAGE,
                        PG-CTR, TRANS-WRITE-CTR.
           INITIALIZE WS-TABLE  WS-TOT-TABLE  WS-TRANS-TABLE.
      *-------CHECK BCUTOFF PARM.  IF "Y", THEN PROGRAM WILL RUN IN
      *-------CREATE TRANSACTION RECORDS MODE.  OPEN THE DAILY
      *-------TRANSACTION FILE.
           IF R34-BCUTOFF-RUN = "Y"
              OPEN I-O DDAILYTC-DL-O.
           OPEN INPUT  MSTORERM-I, MCLASS-I, MUSAGE-I, MPLTINFO-I.
039700     MOVE "DHDR83.PUB" TO HD-FILE-NAME.
039800     CALL "TESCSEQ" USING ESC-NAME.
039900     MOVE CHAR-1636PI    TO COMPRESS-PRINT.
040000     MOVE CHAR-10PI      TO NORMAL-PRINT.
040700************************************************
040800**  CALL TO "TDATECHK" RETURNS THE PROPERLY  ***
040900**  FORMATTED DATE AND TIME                  ***
041000************************************************
041100     MOVE 1 TO DATE-MODE.
041200     CALL "TDATECHK" USING DATE-CHECK-AREA.
041300     MOVE DATE-SLASH-OUT TO PRT-DATE.
041400     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
           MOVE DATE-OUT TO WORK-DATE.
041500
042700*    CALL "DBGET" USING BASE DSET-MPLTINFO MODE7 STATUS-AREA
042800*      MPLTINFO-LIST BUF-MPLTINFO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
043000        MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
043100        GO TO 2-BLOWUP.
043300     MOVE MPLTINFO-COMPANY         TO PRT-PLT.

           MOVE SPACES TO ACTGCLASS OF MCLASS-REC-I.
           START MCLASS-I KEY >= ACTGCLASS OF MCLASS-REC-I
             INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
              MOVE "START ERR MCLASS 1-HK" TO BU-DISPLAY-MSG
              PERFORM 2-BLOWUP.

       1-EXIT.
           EXIT.

043900 2-BLOWUP.
044000     MOVE "TINVTRN" TO BU-PGM-NAME.
044100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
044200         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
044300         BU-DISPLAY-AREA.
044400
045200 2-END-OF-JOB.

      *-----  IF PROGRAM IN CREATE TRANSACTION MODE, THEN CLOSE THE
      *-----  TRANSACTION FILE.  IF NOT, THEN CLOSE THE PRINTER FILE.
      *-----  THE TRANSACTION FILE IS ONLY OPENED WHEN THE PROGRAM IN
      *-----  TRANSACTION MODE, PRINT FILE ONLY OPENED IN REPORT MODE.

           IF R34-BCUTOFF-RUN = "Y"
              CLOSE DDAILYTC-DL-O
           ELSE
              CLOSE ONLINE-PRT.
           CLOSE MSTORERM-I, MCLASS-I, MUSAGE-I, MPLTINFO-I.
           IF R34-BCUTOFF-RUN = "Y"
              IF TRANS-WRITE-CTR > 0
                 DISPLAY
                    "*** TRANSACTION RECORDS WRITTEN : " TRANS-WRITE-CTR
                 DISPLAY "*** NORMAL END OF TINVTRN  ***"
              ELSE
                 DISPLAY "*** NO TRANSACTION RECORDS ***"
                 DISPLAY "*** NORMAL END OF TINVTRN  ***".
045300     GOBACK.
045400
       2-EXIT.
           EXIT.

045500 6-MAIN.
           MOVE +1 TO WS-SUB1.
      *-----READ THRU CLASS FILE AND LOAD VALID CLASSES FOR REPORTING
           PERFORM 60-LOAD-CLASS-DATA THRU 60-EXIT.

           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
              MOVE "START ERR MSTORERM 6-MN" TO BU-DISPLAY-MSG
              PERFORM 2-BLOWUP.

           PERFORM 61-LOAD-USGPER-DATA THRU 61-EXIT.
           PERFORM 62-LOAD-INVTRY-DATA THRU 62-EXIT.

           IF R34-BCUTOFF-RUN = "Y"
              PERFORM 63-WRITE-TRANSACTIONS THRU 63-EXIT
           ELSE
              PERFORM 64-WRITE-REPORT       THRU 64-EXIT.

049100 6-EXIT.
049200     EXIT.

       60-LOAD-CLASS-DATA.
049000     READ MCLASS-I NEXT INTO BUF-MCLASS
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                  GO TO 60-EXIT
               ELSE
                  MOVE "DBGET ERR MCLASS 60-LCD" TO BU-DISPLAY-MSG
                  MOVE MCLASS-CLS                TO BU-DISPLAY-FLD (1)
                  MOVE "LAST CLASS READ"         TO BU-DISPLAY-FLD (2)
                  PERFORM 2-BLOWUP.

      *-----CHECK FLAG FOR CLASS.  IF EQUALS "Y ", THEN PLACE THIS
      *-----CLASS IN THE TABLE, SPACE PERMITTING.
           IF MCLASS-INVTRN-RPTFLG EQUAL "Y "
              PERFORM 600-CHECK-TABLE THRU 600-EXIT
              MOVE MCLASS-CLS TO WS-TBL-CLASS (WS-SUB1)
              ADD +1 TO WS-SUB1.

           GO TO 60-LOAD-CLASS-DATA.

       60-EXIT.
           EXIT.

       600-CHECK-TABLE.
      *-------TABLE IS SET FOR ONLY 100 CLASS CODES.  STOP PROGRAM
      *-------IF ANOTHER ELIGIBLE CODE READ FROM DATABASE AND
      *-------TABLE IS ALREADY FULL
           IF WS-SUB1 > 100
              MOVE "CLASS TABLE FULL" TO BU-DISPLAY-MSG
              MOVE MCLASS-CLS         TO BU-DISPLAY-FLD (1)
              MOVE "CODE REMAINING"   TO BU-DISPLAY-FLD (2)
              PERFORM 2-BLOWUP.

       600-EXIT.
           EXIT.

       61-LOAD-USGPER-DATA.
049000     READ MSTORERM-I NEXT INTO BUF-MSTORERM
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                  GO TO 61-EXIT
               ELSE
                  MOVE "DBGET ERR MCLASS 61-LUD" TO BU-DISPLAY-MSG
                  MOVE MCLASS-CLS                TO BU-DISPLAY-FLD (1)
                  MOVE "LAST CLASS READ"         TO BU-DISPLAY-FLD (2)
                  PERFORM 2-BLOWUP.
           MOVE 1 TO WS-SUB1.
           IF WS-TBL-CLASS (WS-SUB1) = SPACES
              GO TO 61-EXIT.
           MOVE "N" TO WS-GOOD-CLS.
      *------CHECK TO SEE IF CLASS FOR THIS CORPCODE IS IN VALID
      *------CLASS TABLE.
           PERFORM 610-CHECK-CLASS THRU 610-EXIT.
           IF WS-GOOD-CLS = "N"
              GO TO 61-LOAD-USGPER-DATA.
           COMPUTE WORK-CURINV  ROUNDED = STR-AVG-COST * STR-ONHAND
             ON SIZE ERROR MOVE 999999999999999999 TO WORK-CURINV.
           ADD WORK-CURINV TO WS-TBL-CURINV (WS-SAVE-SUB).
      *-----READ USAGE FILE TO CHECK FOR USAGE ON THIS CODE
           MOVE CORP-CODE TO CORPCDE OF MUSAGE-REC-I.
           START MUSAGE-I KEY = CORPCDE OF MUSAGE-REC-I
             INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
              MOVE "DBFIND ERR MUSAGE 61-LUD" TO BU-DISPLAY-MSG
              MOVE CORP-CODE                  TO BU-DISPLAY-FLD (1)
              MOVE "CODE READ TRY"            TO BU-DISPLAY-FLD (2)
              PERFORM 2-BLOWUP.
           MOVE 0 TO COND-WORD.

           PERFORM 611-CALC-USGPER THRU 611-EXIT.
           GO TO 61-LOAD-USGPER-DATA.

       61-EXIT.
           EXIT.

       610-CHECK-CLASS.
      *------READ THRU VALID CLASS TABLE FOR A MATCH ON CORPCODE CLASS
           IF WS-TBL-CLASS (WS-SUB1) = SPACES
           OR WS-SUB1 > 100
              GO TO 610-EXIT.
      *------IF MATCH, SAVE THE SUBSCRIPT VALUE FOR THE CORRESPONDING
      *------CLASS ENTRY IN THE CLASS TABLE SO SUBSEQUENT VALUES CAN BE
      *------PLACED IN THE PROPER CELLS IN THE TABLE
           IF WS-TBL-CLASS (WS-SUB1) = STR-CLASS
              MOVE WS-SUB1 TO WS-SAVE-SUB
              MOVE "Y" TO WS-GOOD-CLS
              GO TO 610-EXIT.
           ADD 1 TO WS-SUB1.
           GO TO 610-CHECK-CLASS.

       610-EXIT.
           EXIT.

       611-CALC-USGPER.
           READ MUSAGE-I NEXT INTO BUF-USAGEFIL
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 MOVE 15 TO COND-WORD
              ELSE
                 MOVE 99 TO COND-WORD.
           IF CORPCDE OF MUSAGE-REC-I NOT = CORP-CODE
              MOVE 15 TO COND-WORD.
           IF COND-WORD NOT = 0
              IF COND-WORD = 15
                  GO TO 611-EXIT
              ELSE
                  MOVE "DBGET ERR MUSAGE 611-CU" TO BU-DISPLAY-MSG
                  MOVE CORP-CODE TO BU-DISPLAY-FLD (1)
                  PERFORM 2-BLOWUP.
      *------THE FOLLOWING THREE PERFORMED PARAGRAPHS WILL LOOP THROUGH
      *------THE USAGE FILE FOR THE CORPCDE AND TALLY THE USAGE UNITS
      *------AND CALCULATE THE USAGE FOR THE 4 DIFFERENT PERIODS, I.E.
      *------365 DAYS, 180 DAYS, 90 DAYS AND 30 DAYS.  MOVE THE USAGE
      *------VALUE TO THE APPROPRIATE USAGE PERIOD ENTRY, FOR THE
      *------CLASS ENTRY, WHOSE POSITION IN THE TABLE WAS SAVED IN THE
      *------SAVE-SUB FIELD.
           MOVE 12 TO WS-STOP-LOOP.
           MOVE 365 TO WS-CALC-FACTOR.
           PERFORM 6110-SETUP-USGPER THRU 6110-EXIT.
           PERFORM 6111-FILL-USGPER THRU 6111-EXIT.
           PERFORM 6112-CALC-USGPER-DOLLAR THRU 6112-EXIT.
           ADD WORK-USGPER TO
             WS-TBL-USGPER (WS-SAVE-SUB, 1).
           MOVE 06 TO WS-STOP-LOOP.
           MOVE 180 TO WS-CALC-FACTOR.
           PERFORM 6110-SETUP-USGPER THRU 6110-EXIT.
           PERFORM 6111-FILL-USGPER THRU 6111-EXIT.
           PERFORM 6112-CALC-USGPER-DOLLAR THRU 6112-EXIT.
           ADD WORK-USGPER TO
             WS-TBL-USGPER (WS-SAVE-SUB, 2).
           MOVE 03 TO WS-STOP-LOOP.
           MOVE 090 TO WS-CALC-FACTOR.
           PERFORM 6110-SETUP-USGPER THRU 6110-EXIT.
           PERFORM 6111-FILL-USGPER THRU 6111-EXIT.
           PERFORM 6112-CALC-USGPER-DOLLAR THRU 6112-EXIT.
           ADD WORK-USGPER TO
             WS-TBL-USGPER (WS-SAVE-SUB, 3).
           MOVE 01 TO WS-STOP-LOOP.
           MOVE 030 TO WS-CALC-FACTOR.
           PERFORM 6110-SETUP-USGPER THRU 6110-EXIT.
           PERFORM 6111-FILL-USGPER THRU 6111-EXIT.
           PERFORM 6112-CALC-USGPER-DOLLAR THRU 6112-EXIT.
           ADD WORK-USGPER TO
             WS-TBL-USGPER (WS-SAVE-SUB, 4).

       611-EXIT.
           EXIT.

       6110-SETUP-USGPER.
           MOVE 0 TO WS-SUB2.
      *---IF THE CALCULATIONS FOR THIS EXECUTION OF THE PARAGRPAH ARE
      *---FOR 365 DAY PERIOD, START SUB1 AT 13.
           IF WS-CALC-FACTOR = 365
              MOVE 13 TO WS-SUB1
           ELSE
      *---MOVE CURRENT MONTH TO SUB1.  MONTH WILL BE IN ONE OF TWO
      *---LOCATIONS IN WORK-DATE FIELD DEPENDING ON IF EUROPEAN
      *---(DATE-CODE=0) OR NON-EUROPEAN PLANT (DATE-CODE=1).
              IF DATE-CODE = 1
                 MOVE WORK-MONTH TO WS-SUB1
              ELSE
                 IF DATE-CODE = 0
                    MOVE WORK-EMONTH TO WS-SUB1.
           MOVE ZEROS TO WORK-USGPER.

       6110-EXIT.
           EXIT.

       6111-FILL-USGPER.
      *---STOP-LOOP CONTROLS ITERATIONS OF THIS LOGIC.  WILL
      *---EXECUTE LOGIC X TIMES, CORRESPONDING TO NO OF MONTHS
      *---IN PERIOD.  I.E. 365 DAY PERIOD = 12 MOS = STOP-LOOP = 12.
           IF WS-SUB2 = WS-STOP-LOOP
              GO TO 6111-EXIT.
           ADD 1 TO WS-SUB2.
      *---READS USAGE TABLE BACKWARDS, ONE ENTRY AT A TIME.
           SUBTRACT 1 FROM WS-SUB1.
      *---SUB1 CANNOT BE LESS THAN 1.  MAKING SUB1 EQUAL TO 12 WILL
      *---SET THE USAGE DATA TO THE DECEMBER SLOT, EFFECTIVELY
      *---"WRAPPING" BACK TO THE LAST MONTH (DECEMBER) OF THE
      *---PREVIOUS YEAR.  THIS GIVES ACTUAL LAST 1-MONTH, 3-MONTH,
      *---6-MONTH, 12-MONTH ACCUMULATED DATA FROM ANY GIVEN CURR MONTH.
           IF WS-SUB1 < 1
              ADD +12 TO WS-SUB1.
      *---SUM USAGE FIGURES INTO WORK FILED
           ADD K-MTH-USAGE (WS-SUB1) TO WORK-USGPER.
           GO TO 6111-FILL-USGPER.

       6111-EXIT.
           EXIT.

       6112-CALC-USGPER-DOLLAR.
      *---GET USAGE PERIOD VALUE BY MULTIPLYING USAGE TOTAL FOR CORPCDE
      *---AGAINST THE AVERAGE COST FOR THE CORPCDE.
           COMPUTE WORK-USGPERDOL  ROUNDED = WORK-USGPER * STR-AVG-COST
             ON SIZE ERROR MOVE 999999999999999999 TO WORK-USGPERDOL.
           MOVE    WORK-USGPERDOL TO WORK-USGPER.

       6112-EXIT.
           EXIT.

061900 62-LOAD-INVTRY-DATA.
           MOVE 1 TO WS-SUB1.
           IF WS-TBL-CLASS (WS-SUB1) = SPACES
              GO TO 62-EXIT.

      *---AT THIS POINT, ALL CLASSES THAT ARE IN THE TABLE WILL HAVE A
      *---CURRENT INVENTORY VALUE AND USAGE VALUES FOR THE 4 PERIODS
      *---STORED IN THE TABLE.  THE FOLLOWING PERFORMED PARAGRAPH WILL
      *---CALCULATE AND PLACE THE REMAINING FIGURES IN THE TABLE FOR
      *---EACH CLASS.
           PERFORM 620-PROCESS-INVENTORY THRU 620-EXIT.

      *---THE FOLLOWING ITERATIONS OF THE PERFORMED PARAGRAPH WILL
      *---CALCULATE THE INVENTORY DAYS ON HAND AND INVENTORY TURNOVER
      *---RATIO TOTAL FIGURES BASED ON THE ACCUMULATED INVENTORY TOTALS
      *---FOR ALL OF THE CLASSES.
           MOVE 1 TO WS-SUB1.
           PERFORM 621-CALC-INVONH-INVTRN-TOTAL THRU 621-EXIT.
           MOVE 2 TO WS-SUB1.
           PERFORM 621-CALC-INVONH-INVTRN-TOTAL THRU 621-EXIT.
           MOVE 3 TO WS-SUB1.
           PERFORM 621-CALC-INVONH-INVTRN-TOTAL THRU 621-EXIT.
           MOVE 4 TO WS-SUB1.
           PERFORM 621-CALC-INVONH-INVTRN-TOTAL THRU 621-EXIT.

       62-EXIT.
           EXIT.

066400 620-PROCESS-INVENTORY.
067900     PERFORM 6200-CALC-INVENTORY THRU 6200-EXIT.
           ADD 1 TO WS-SUB1.
           IF WS-SUB1 > 100
              GO TO 620-EXIT.
068100     IF WS-TBL-CLASS (WS-SUB1) = SPACES
              GO TO 620-EXIT.
068300     GO TO 620-PROCESS-INVENTORY.

       620-EXIT.
           EXIT.

071100 6200-CALC-INVENTORY.
           MOVE WS-TBL-CLASS  (WS-SUB1) TO WORK-CLASS.
           MOVE WS-TBL-CURINV (WS-SUB1) TO WORK-CURINV.
      *---ACCUMULATE CURRENT INVENTORY TOTAL FOR ALL CLASSES INTO THE
      *---CLASS TOTAL TABLE.
           ADD  WORK-CURINV TO WS-TOT-CURINV.
      *---SUBSEQUENT EXECUTIONS OF PERFORMED PARAGRAPH WILL CALCULATE
      *---THE USAGE PERIOD TOTALS, THE DAILY USAGE FOR THE PERIOD DETAIL
      *---AND TOTAL FIGURES, AND THE INVENTORY ON HAND AND INVENTORY
      *---TURNOVER RATIO DETAIL, FOR EACH CLASS, FOR THE RESPECTIVE
      *---TIME PERIOD, IN THE CORRESPONDING TABLE ENTRIES.  THE DETAIL
      *---WILL BE PLACED IN THE CLASS TABLE, WHILE TOTALS WILL BE PLACED
      *---IN THE CLASS TOTAL TABLE.
           MOVE 365 TO WS-CALC-FACTOR.
           MOVE 1   TO WS-SUB2.
           PERFORM 62000-CALC-INV-DET-TOT THRU 62000-EXIT.
           MOVE 180 TO WS-CALC-FACTOR.
           MOVE 2   TO WS-SUB2.
           PERFORM 62000-CALC-INV-DET-TOT THRU 62000-EXIT.
           MOVE 090 TO WS-CALC-FACTOR.
           MOVE 3   TO WS-SUB2.
           PERFORM 62000-CALC-INV-DET-TOT THRU 62000-EXIT.
           MOVE 030 TO WS-CALC-FACTOR.
           MOVE 4   TO WS-SUB2.
           PERFORM 62000-CALC-INV-DET-TOT THRU 62000-EXIT.
073300
082600 6200-EXIT.
082700     EXIT.

       62000-CALC-INV-DET-TOT.
           MOVE ZEROS TO WORK-DLYUSG WORK-INVONH WORK-INVTRN.
           MOVE WS-TBL-USGPER (WS-SUB1, WS-SUB2) TO WORK-USGPER.
      *---ACCUMULATE USAGE FOR PERIOD VALUE FOR THE SELECTED PERIOD
      *---INTO CLASS TOTAL TABLE.
           ADD WORK-USGPER TO WS-TOT-USGPER (WS-SUB2).
      *---CALCULATE DAILY USAGE FOR THE PERIOD.
           COMPUTE WORK-DLYUSG  ROUNDED = WORK-USGPER / WS-CALC-FACTOR
            ON SIZE ERROR MOVE 999999999999999999 TO WORK-DLYUSG.
      *---ACCUMULATE DAILY USAGE VALUE FOR THE SELECTED PERIOD
      *---INTO CLASS TOTAL TABLE.
           ADD WORK-DLYUSG TO WS-TOT-DLYUSG (WS-SUB2).
      *---CALCULATE INVENTORY DAYS ON HAND FOR THE SELCTED PERIOD. ON
      *---HAND WILL BE ZERO IF DAILY USAGE FOR PERIOD IS ZERO, SINCE
      *---DIVISION BY ZERO WILL RESULT IN ERROR.
           IF WORK-DLYUSG = ZEROS
              MOVE 0 TO WORK-INVONH
           ELSE
             COMPUTE WORK-INVONH  ROUNDED = WORK-CURINV / WORK-DLYUSG
               ON SIZE ERROR MOVE 99999999999999 TO WORK-INVONH.
      *---CALCULATE INVENTORY TURNOVER RATIO FOR THE SELCTED PERIOD.
      *---ITR WILL BE ZERO IF ON HAND FOR PERIOD IS ZERO, SINCE
      *---DIVISION BY ZERO WILL RESULT IN ERROR.
           IF WORK-INVONH = ZEROS
              MOVE 0 TO WORK-INVTRN
           ELSE
              COMPUTE WORK-INVTRN  ROUNDED = 365 / WORK-INVONH
                ON SIZE ERROR MOVE 999999999999999999 TO WORK-INVTRN.

      *---MOVE THE CALCULATED FIGURES FOR EACH CLASS INTO THE
      *---APPROPRIATE ENTRIES IN THE CLASS TABLE.
           MOVE WORK-DLYUSG TO WS-TBL-DLYUSG (WS-SUB1, WS-SUB2).
           MOVE WORK-INVONH TO WS-TBL-INVONH (WS-SUB1, WS-SUB2).
           MOVE WORK-INVTRN TO WS-TBL-INVTRN (WS-SUB1, WS-SUB2).

       62000-EXIT.
           EXIT.

       621-CALC-INVONH-INVTRN-TOTAL.
      *---CALCULATE INVENTORY DAYS ON HAND AND INVENTORY TURNOVER RATIO
      *---TOTALS FOR ALL CLASSES FOR THE SELCTED PERIOD. THESE TOTALS
      *---WILL BE ZERO IF THE CORRESPONDING INVENTORY TOTAL
      *---DENOMINATOR (DLYUSG TOTAL FOR ONHAND AND THE RESULT OF ONHAND
      *---TOTAL CALCULATION) IS ZERO SINCE DIVISION BY ZERO IS AN ERROR.
           IF WS-TOT-DLYUSG (WS-SUB1) = ZEROS
              MOVE ZEROS TO WS-TOT-INVONH (WS-SUB1)
           ELSE
              COMPUTE WS-TOT-INVONH (WS-SUB1) ROUNDED =
                WS-TOT-CURINV / WS-TOT-DLYUSG (WS-SUB1)
                ON SIZE ERROR  MOVE 999999999999
                  TO WS-TOT-INVONH (WS-SUB1).
           IF WS-TOT-INVONH (WS-SUB1) = ZEROS
              MOVE ZEROS TO WS-TOT-INVTRN (WS-SUB1)
           ELSE
              COMPUTE WS-TOT-INVTRN (WS-SUB1) ROUNDED =
                365 / WS-TOT-INVONH (WS-SUB1)
                ON SIZE ERROR  MOVE 999999999999999
                  TO WS-TOT-INVTRN (WS-SUB1).

       621-EXIT.
           EXIT.

061900 63-WRITE-TRANSACTIONS.
           MOVE 1 TO WS-SUB1.
           IF WS-TBL-CLASS (WS-SUB1) = SPACES
              GO TO 63-EXIT.

      *---FOLLOWING LOGIC WILL CREATE TRANSACTION RECORDS CONTAINING
      *---INVENTORY TURNOVER TOTALS FOR THE FOUR PERIODS FOR EACH
      *---CLASS, AS WELL AS ITR TOTALS FOR THE FOUR PERIODS FOR ALL
      *---CLASSES.
           PERFORM 630-PROCESS-TRANSACTIONS THRU 630-EXIT.

       63-EXIT.
           EXIT.

066400 630-PROCESS-TRANSACTIONS.
067900     PERFORM 6300-CREATE-DETAIL-TRANS THRU 6300-EXIT.
           ADD 1 TO WS-SUB1.
           IF WS-SUB1 > 100
              GO TO 630-EXIT.
068100     IF WS-TBL-CLASS (WS-SUB1) = SPACES
              PERFORM 6301-CREATE-TOTAL-TRANS THRU 6301-EXIT
              GO TO 630-EXIT.
068300     GO TO 630-PROCESS-TRANSACTIONS.

       630-EXIT.
           EXIT.

071100 6300-CREATE-DETAIL-TRANS.
           MOVE WS-TBL-CLASS  (WS-SUB1) TO WORK-CLASS.
      *---FOLLOWING ITERATIONS OF PARAGRAPH WILL MOVE ITR VALUE FOR
      *---THE FOUR PERIODS INTO CORRESPONDING ENTRIES INTO THE ITR
      *---TRANSACTION TABLE.
           MOVE 1   TO WS-SUB2.
           PERFORM 63000-MOVE-DETAIL-TRANS THRU 63000-EXIT.
           MOVE 2   TO WS-SUB2.
           PERFORM 63000-MOVE-DETAIL-TRANS THRU 63000-EXIT.
           MOVE 3   TO WS-SUB2.
           PERFORM 63000-MOVE-DETAIL-TRANS THRU 63000-EXIT.
           MOVE 4   TO WS-SUB2.
           PERFORM 63000-MOVE-DETAIL-TRANS  THRU 63000-EXIT.
      *---MOVE FIGURES TO FILE BUFFER AND WRITE TRANSACTION RECORD.
           PERFORM 63001-WRITE-TRANS-REC    THRU 63001-EXIT.
073300
082600 6300-EXIT.
082700     EXIT.

       63000-MOVE-DETAIL-TRANS.
           MOVE ZEROS TO WS-TRN-INVTRN (WS-SUB2).
           MOVE WS-TBL-INVTRN (WS-SUB1, WS-SUB2)
             TO WS-TRN-INVTRN (WS-SUB2).

       63000-EXIT.
           EXIT.

       63001-WRITE-TRANS-REC.
100800     MOVE SPACES                    TO   BUF-DDAILYTC.
101000     MOVE DATE-YMD-OUT              TO   DDAILYTC-DATE.
101100     MOVE DATE-UNFORMATTED-TIME-OUT TO   DDAILYTC-TIME.
101200     MOVE "390"                     TO   DDAILYTC-TC.
101300     MOVE MPLTINFO-COMPANY          TO   DDAILYTC-PLT.
           MOVE WORK-CLASS        TO TC390-CLASS.
           MOVE WS-TRN-INVTRN (1) TO TC390-INVTRN365.
           MOVE WS-TRN-INVTRN (2) TO TC390-INVTRN180.
           MOVE WS-TRN-INVTRN (3) TO TC390-INVTRN090.
           MOVE WS-TRN-INVTRN (4) TO TC390-INVTRN030.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DL-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 633001-WRITE-TRANS-REC"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2-BLOWUP.
           ADD 1 TO TRANS-WRITE-CTR.

       63001-EXIT.
           EXIT.

071100 6301-CREATE-TOTAL-TRANS.
           MOVE "TOT " TO WORK-CLASS.
      *---FOLLOWING ITERATIONS OF PARAGRAPH WILL MOVE ITR TOTALS FOR
      *---THE FOUR PERIODS INTO CORRESPONDING ENTRIES INTO THE ITR
      *---TRANSACTION TABLE.
           MOVE 1   TO WS-SUB2.
           PERFORM 63010-MOVE-TOTAL-TRANS THRU 63010-EXIT.
           MOVE 2   TO WS-SUB2.
           PERFORM 63010-MOVE-TOTAL-TRANS THRU 63010-EXIT.
           MOVE 3   TO WS-SUB2.
           PERFORM 63010-MOVE-TOTAL-TRANS THRU 63010-EXIT.
           MOVE 4   TO WS-SUB2.
           PERFORM 63010-MOVE-TOTAL-TRANS  THRU 63010-EXIT.
      *---MOVE FIGURES TO FILE BUFFER AND WRITE TRANSACTION RECORD.
           PERFORM 63001-WRITE-TRANS-REC   THRU 63001-EXIT.
073300
082600 6301-EXIT.
082700     EXIT.

       63010-MOVE-TOTAL-TRANS.
           MOVE ZEROS TO WS-TRN-INVTRN (WS-SUB2).
           MOVE WS-TOT-INVTRN (WS-SUB2)
             TO WS-TRN-INVTRN (WS-SUB2).

       63010-EXIT.
           EXIT.

061900 64-WRITE-REPORT.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
062000     OPEN OUTPUT ONLINE-PRT.
062200
062300     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
062400         HD-ROUTE-DATA, ESC-NAME.
062500     IF HD-RET-CODE NOT = 0
062600         MOVE "THDPRT2 ERR 64-WRITE-RPT" TO BU-DISPLAY-MSG
062700         MOVE HD-RET-CODE  TO BU-DISPLAY-FLD (1)
062800         PERFORM 2-BLOWUP.
062900     IF PAPER-IS-132-COLS
063000         NEXT SENTENCE
063100     ELSE
063200         WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
063400
066300     PERFORM 640-PAGE-HDR THRU 640-EXIT.

           MOVE 1 TO WS-SUB1.
      *---IF CLASS ENTRY IS BLANKS, THEN NO MORE CLASSES, PRINT TOTALS.
           IF WS-TBL-CLASS (WS-SUB1) = SPACES
              PERFORM 641-FINAL-PROCEDURE THRU 641-EXIT
              GO TO 64-EXIT.

           PERFORM 642-PROCESS-TABLE THRU 642-EXIT.

       64-EXIT.
           EXIT.

082800 640-PAGE-HDR.
082900     MOVE SPACES         TO PRINT-LINE.
083000     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
083100     ADD 1               TO PG-CTR.
083200     MOVE PG-CTR         TO PRT-OVER-PG.
083300     MOVE REPORT-HEADER          TO PRINT-RCD.
083400     WRITE PRINT-RCD AFTER  ADVANCING 1 LINES.
083500
085200     MOVE INVENTORY-HDR-1  TO PRINT-RCD.
085300     WRITE PRINT-RCD AFTER  ADVANCING 2 LINES.
085400
086500     MOVE INVENTORY-HDR-2  TO PRINT-RCD.
086700     WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
086600
086500     MOVE INVENTORY-HDR-3  TO PRINT-RCD.
086700     WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
086600
086800     WRITE PRINT-RCD FROM DOT-LINE AFTER  ADVANCING 1 LINES.
086900     MOVE SPACES       TO PRINT-LINE.
087000     WRITE PRINT-RCD AFTER ADVANCING 1 LINES.

       640-EXIT.
           EXIT.

068400 641-FINAL-PROCEDURE.
068800     MOVE WS-TOT-CURINV TO CURR-INV-TOT.
      *---FOLLOWING ITERATIONS OF PARAGRAPH WILL MOVE TOTALS FOR
      *---THE FOUR PERIODS INTO CORRESPONDING ENTRIES TO THE TOTAL
      *---PRINT LINE AND PRINT TO REPORT.
           MOVE 1 TO WS-SUB1.
           MOVE 365 TO DAYS-PER-TOT.
068900     PERFORM 6410-WRITE-TOTAL-LINE THRU 6410-EXIT.
           MOVE ZEROS TO CURR-INV-0TOT.
           MOVE 2 TO WS-SUB1.
           MOVE 180 TO DAYS-PER-TOT.
068900     PERFORM 6410-WRITE-TOTAL-LINE THRU 6410-EXIT.
           MOVE 3 TO WS-SUB1.
           MOVE 090 TO DAYS-PER-TOT.
068900     PERFORM 6410-WRITE-TOTAL-LINE THRU 6410-EXIT.
           MOVE 4 TO WS-SUB1.
           MOVE 030 TO DAYS-PER-TOT.
068900     PERFORM 6410-WRITE-TOTAL-LINE THRU 6410-EXIT.
087600
069800     WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.
070000
       641-EXIT.
           EXIT.

       6410-WRITE-TOTAL-LINE.
      *---INTEGER FIELDS FOR USGPER AND DLYUSG ARE CALCULATED PER
      *---REQUEST OF NAPANEE.
           MOVE ZEROS TO WORK-USGPERTOT, WORK-USGPERTOT-INTEGER,
                         WORK-DLYUSGTOT, WORK-DLYUSGTOT-INTEGER.
           MOVE WS-TOT-USGPER (WS-SUB1) TO WORK-USGPERTOT.
           COMPUTE WORK-USGPERTOT-INTEGER ROUNDED =
             WORK-USGPERTOT * 1.
           MOVE WS-TOT-DLYUSG (WS-SUB1) TO WORK-DLYUSGTOT.
           COMPUTE WORK-DLYUSGTOT-INTEGER ROUNDED =
             WORK-DLYUSGTOT * 1.
           MOVE WORK-USGPERTOT-INTEGER  TO USAGE-PER-TOT.
           MOVE WORK-DLYUSGTOT-INTEGER  TO DAILY-USG-TOT.
           MOVE WS-TOT-INVONH (WS-SUB1) TO INV-ONHND-TOT.
           MOVE WS-TOT-INVTRN (WS-SUB1) TO INV-TRNOVR-TOT.
087300     MOVE SPACES                  TO PRINT-LINE.
087400     WRITE PRINT-RCD FROM GRAND-TOTAL-LINE
087500         AFTER ADVANCING 1 LINES.

       6410-EXIT.
           EXIT.

066400 642-PROCESS-TABLE.
067900     PERFORM 6420-CREATE-REPORT THRU 6420-EXIT.
           ADD 1 TO WS-SUB1.
           IF WS-SUB1 > 100
              PERFORM 640-PAGE-HDR        THRU 640-EXIT
              PERFORM 641-FINAL-PROCEDURE THRU 641-EXIT
              GO TO 642-EXIT.
068100     IF WS-TBL-CLASS (WS-SUB1) = SPACES
              PERFORM 640-PAGE-HDR        THRU 640-EXIT
068200        PERFORM 641-FINAL-PROCEDURE THRU 641-EXIT
              GO TO 642-EXIT.
068300     GO TO 642-PROCESS-TABLE.

       642-EXIT.
           EXIT.

070500*******************************************
070600*                                         *
070700*        INVENTORY TURNOVER REPORT        *
070800*                                         *
070900*******************************************
071000
071100 6420-CREATE-REPORT.
071200     IF ITMS-PER-PAGE >= 50
071300          MOVE 1 TO ITMS-PER-PAGE
071400          PERFORM 640-PAGE-HDR THRU 640-EXIT.
071500
      *---ON FIRST LINE OF DETAIL FOR CLASS, PRINT CLASS AND CURRENT
      *---INVENTORY VALUE AS WELL AS TABLE DETAIL (DAYS IN PERIOD,
      *---USAGE FOR PERIOD VALUE, DAILY USAGE VALUE, INVENTORY ON HAND
      *---AND INVENTORY TURNOVER RATIO) FOR THE FIRST PERIOD TO APPEAR,
      *---WHICH WILL BE THE 365 DAY PERIOD.  THE NEXT THREE PERIODS WILL
      *---BE PRINTED WITH ONLY THE TABLE DETAIL (THE CLASS AND CURINV
      *---WILL BE BLANKS ON THESE LINES.)  THE LAST LINE FOR THE CLASS
      *---WILL BE BLANK, FOR SPACING AND SEPARATION.  CACL-FACTOR AND
      *---SUB1 AND SUB2 CONTROL THE PRINTING.
           MOVE WS-TBL-CLASS  (WS-SUB1) TO WORK-CLASS.
           MOVE WS-TBL-CURINV (WS-SUB1) TO WORK-CURINV.
           MOVE 365 TO WS-CALC-FACTOR.
           MOVE 1   TO WS-SUB2.
           PERFORM 64200-MOVE-DETAIL THRU 64200-EXIT.
           MOVE WORK-CLASS  TO CLASS-OUT.
           MOVE WORK-CURINV TO CURR-INV-OUT.
           PERFORM 64201-WRITE-DETAIL THRU 64201-EXIT.
           MOVE SPACES TO CLASS-OUT.
           MOVE ZEROES TO CURR-INV-0OUT.
           MOVE 180 TO WS-CALC-FACTOR.
           MOVE 2   TO WS-SUB2.
           PERFORM 64200-MOVE-DETAIL THRU 64200-EXIT.
           PERFORM 64201-WRITE-DETAIL THRU 64201-EXIT.
           MOVE 090 TO WS-CALC-FACTOR.
           MOVE 3   TO WS-SUB2.
           PERFORM 64200-MOVE-DETAIL THRU 64200-EXIT.
           PERFORM 64201-WRITE-DETAIL THRU 64201-EXIT.
           MOVE 030 TO WS-CALC-FACTOR.
           MOVE 4   TO WS-SUB2.
           PERFORM 64200-MOVE-DETAIL THRU 64200-EXIT.
           PERFORM 64201-WRITE-DETAIL THRU 64201-EXIT.
           MOVE SPACES TO PRINT-LINE.
           WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
           ADD 1 TO ITMS-PER-PAGE.
073300
082600 6420-EXIT.
082700     EXIT.

       64200-MOVE-DETAIL.
           MOVE ZEROS TO WORK-USGPER  WORK-DLYUSG WORK-USGPER-INTEGER
                         WORK-DLYUSG-INTEGER WORK-INVONH  WORK-INVTRN.
      *---INTEGER FIELDS FOR USGPER AND DLYUSG ARE CALCULATED PER
      *---REQUEST OF NAPANEE.
           MOVE WS-TBL-USGPER (WS-SUB1, WS-SUB2) TO WORK-USGPER.
           COMPUTE WORK-USGPER-INTEGER ROUNDED = WORK-USGPER * 1.
           MOVE WS-TBL-DLYUSG (WS-SUB1, WS-SUB2) TO WORK-DLYUSG.
           COMPUTE WORK-DLYUSG-INTEGER ROUNDED = WORK-DLYUSG * 1.
           MOVE WS-TBL-INVONH (WS-SUB1, WS-SUB2) TO WORK-INVONH.
           MOVE WS-TBL-INVTRN (WS-SUB1, WS-SUB2) TO WORK-INVTRN.

       64200-EXIT.
           EXIT.

       64201-WRITE-DETAIL.
      *---INTEGER FIELDS FOR USGPER AND DLYUSG ARE CALCULATED PER
      *---REQUEST OF NAPANEE.
           MOVE WS-CALC-FACTOR TO DAYS-PER-OUT.
           MOVE WORK-USGPER-INTEGER    TO USAGE-PER-OUT.
           MOVE WORK-DLYUSG-INTEGER    TO DAILY-USG-OUT.
           MOVE WORK-INVONH            TO INV-ONHND-OUT.
           MOVE WORK-INVTRN            TO INV-TRNOVR-OUT.
075100     WRITE PRINT-RCD   FROM ITEM-DETAIL
075200        AFTER ADVANCING 1 LINES.
075300     ADD 1 TO ITMS-PER-PAGE.

       64201-EXIT.
           EXIT.

       COPY OVRPFCALL IN COPYLIB.
