001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    TINVPSWD.
001300 AUTHOR.        LS BAKER.
001500 INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001400 DATE-WRITTEN.  APRIL 4, 1984.
001600
001700*REMARKS.       INVOICE PROCESSING.
001800*               THIS IS THE MAINTENANCE PROGRAM FOR INVOICE
001900*               PROCESSING EMPLOYEE PASSWORDS.  IT DOES THE
002000*               FOLLOWING:
002100*                    1.  ADDS A PASSWORD ENTRY.
002200*                    2.  CHANGES A PASSWORD ENTRY.
002300*                    3.  DELETES A PASSWORD ENTRY.
002400*                    4.  INQUIRES ABOUT A PASSWORD ENTRY.
002410*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  11/17/1997     CA YODER
      *C     INCREASED PASSWORD SIZE FROM 6 TO 7 SO THAT USERS CAN USE
      *C     THEIR 7-CHARACTER MAINFRAME PASSWORD.
      *C
      *C  03/12/1998     CA YODER
      *C     INCREASED PASSWORD SIZE FROM 7 TO 8 AFTER FINDING OUT THAT
      *C     THE MAINFRAME PASSWORD IS 8 CHARACTERS.

002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.    HP-3000.
002900 OBJECT-COMPUTER.    HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVPWFIL-I
                  ASSIGN TO DATABASE-MCFL000201
                  ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT INVPWFIL-O
                  ASSIGN TO DATABASE-MCFL000201
                  ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003000
003100 DATA DIVISION.
003200 FILE SECTION.
       FD  INVPWFIL-I
           LABEL RECORDS ARE STANDARD.
       01  INVPWFIL-REC-I.
           COPY DDS-ALL-FORMATS OF MCFL000201.
       FD  INVPWFIL-O
           LABEL RECORDS ARE STANDARD.
       01  INVPWFIL-REC-O.
           COPY DDS-ALL-FORMATS OF MCFL000201.
003300
003400 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X VALUE SPACES.
           05  FILE-STATUS-2             PIC X VALUE SPACES.
9406CK 01  SCOPE   PIC X.

       COPY DATAB   IN COPYLIB.
       COPY CATREAD IN COPYLIB.
004500*************************************************************
004600**                                                         **
004700**               S U B S C R I P T   A R E A               **
004800**                                                         **
004900*************************************************************
005000
005100 01  SUBSCRIPTS.
005200     05  PSWD-SUB              PIC S9(4)    VALUE ZERO  COMP.
005300     05  TABLE-SUB             PIC S9(4)    VALUE ZERO  COMP.
       01  EMPID-EDIT.
           05  EMPID-BYTE            PIC X OCCURS 4 TIMES.
       01  AUTHID-EDIT.
           05  AUTHID-BYTE           PIC X OCCURS 4 TIMES.
005400
006000 COPY VCOMAREA IN COPYLIB.
       COPY TSHWRDFM IN COPYLIB.
       01   SCREEN-BUFFER               PIC X(2000).
011100 01  FORM-NAMES.
011200     05  F-SELECT              PIC X(8)     VALUE "INVPSWD1".
011300     05  F-KEY                 PIC X(8)     VALUE "INVPSWD2".
011400     05  F-ADD                 PIC X(8)     VALUE "INVPSWD3".
011500     05  F-CHANGE              PIC X(8)     VALUE "INVPSWD4".
011600     05  F-DELETE              PIC X(8)     VALUE "INVPSWD5".
011700     05  F-INQUIRE             PIC X(8)     VALUE "INVPSWD6".
011800
012100 01  MESSAGE-BUFFER.
012200     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
012300     05  MSG-FLD               PIC X(8)     VALUE SPACE.
012400     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
013100
013200*************************************************************
013300**                                                         **
013400**           D A T A   E N T R Y   B U F F E R S           **
013500**                                                         **
013600*************************************************************
013700
013800 01  DE-BUFFER1.
013900     05  DE1-DUMMY             PIC X.
           05  DE1-COMMAND-LINE      PIC X(79).
           05  DE1-MSG-LINE          PIC X(79).
014000
014100 01  DE-BUFFER2.
014200     05  DE2-EMPLOYEE-ID       PIC X(4).
           05  DE2-COMMAND-LINE      PIC X(79).
           05  DE2-MSG-LINE          PIC X(79).
014300
014400 01  DE-BUFFER3.
014500     05  DE3-EMPLOYEE-ID       PIC X(4).
014600     05  DE3-NEW-PSWD          PIC X(8).
014700     05  DE3-LENGTH-VALID      PIC X(2).
014800     05  DE3-AUTH-ID           PIC X(4).
           05  DE3-COMMAND-LINE      PIC X(79).
           05  DE3-MSG-LINE          PIC X(79).
014900
015000 01  DE-BUFFER4.
015100     05  DE4-EMPLOYEE-ID       PIC X(4).
015200     05  DE4-CURRENT-PSWD      PIC X(8).
015300     05  DE4-NEW-PSWD          PIC X(8).
015400     05  DE4-LENGTH-VALID      PIC X(2).
015500     05  DE4-AUTH-ID           PIC X(4).
           05  DE4-COMMAND-LINE      PIC X(79).
           05  DE4-MSG-LINE          PIC X(79).
015600
015700 01  DE-BUFFER5.
015800     05  DE5-EMPLOYEE-ID       PIC X(4).
015900     05  DE5-CURRENT-PSWD      PIC X(8).
016000     05  DE5-AUTH-ID           PIC X(4).
           05  DE5-COMMAND-LINE      PIC X(79).
           05  DE5-MSG-LINE          PIC X(79).
016100
016200 01  DE-BUFFER6.
016300     05  DE6-EMPLOYEE-ID       PIC X(4).
016400     05  DE6-CURRENT-PSWD      PIC X(8).
016500     05  DE6-DATE-ADDED        PIC X(8).
016600     05  DE6-DATE-CHANGED      PIC X(8).
016700     05  DE6-DATE-ACTIVITY     PIC X(8).
016800     05  DE6-LAST-FUNCTION     PIC X.
016900     05  DE6-LENGTH-VALID      PIC X(2).
           05  DE6-COMMAND-LINE      PIC X(79).
           05  DE6-MSG-LINE          PIC X(79).
016910**********************************
016920*                                *
016930*  NATIVE LANGUAGE SUPPORT AREA  *
016940*                                *
016950**********************************
016960
016970 COPY LANGUAGE IN COPYLIB.
017000
       COPY TBLOWUP  IN COPYLIB.
017100*************************************************************
017200**                                                         **
017300**               F I L E   W O R K   A R E A               **
017400**                                                         **
017500*************************************************************
017600
017700 01  PASSWORD-RCD.
017900     05  PW-EMPLOYEE-ID        PIC X(4).
018000     05  PW-CURRENT-PSWD       PIC X(8).
018100     05  PW-OLD-PSWD  OCCURS  12  TIMES
018200                               PIC X(8).
018300     05  PW-DATE-ADDED         PIC X(6).
018400     05  PW-DATE-CHANGED       PIC X(6).
018500     05  PW-DATE-AP-ACT        PIC X(6).
018600     05  PW-AP-FUNCTION        PIC X.
018700     05  PW-LENGTH-VALID       PIC S9(2).
018800     05  PW-AUTHORIZATION-ID   PIC X(4).
018900
021200*************************************************************
021300**                                                         **
021400**     D A T E   A N D   T I M E   W O R K   A R E A S     **
021500**                                                         **
021600*************************************************************
021700
021800 01  DATES-AND-TIMES.
021900     05  REFORMAT-DATE.
022000         10  RFMT-MM           PIC X(2).
022100         10  FILLER            PIC X        VALUE "/".
022200         10  RFMT-DD           PIC X(2).
022300         10  FILLER            PIC X        VALUE "/".
022400         10  RFMT-YY           PIC X(2).
022500     05  HP-CURRENT-DATE.
022600         10  HP-MM             PIC X(2).
022700         10  FILLER            PIC X.
022800         10  HP-DD             PIC X(2).
022900         10  FILLER            PIC X.
023000         10  HP-YY             PIC X(2).
023100     05  YMD-DATE.
023200         10  YMD-YY            PIC X(2).
023300         10  YMD-MM            PIC X(2).
023400         10  YMD-DD            PIC X(2).
023500     05  YMD-DATE-9  REDEFINES  YMD-DATE.
023600         10  YMD-YY-9          PIC 9(2).
023700         10  YMD-MM-9          PIC 9(2).
023800         10  YMD-DD-9          PIC 9(2).
023900     05  HP-TIME.
024000         10  HOUR              PIC X(2).
024100         10  MIN               PIC X(2).
024200         10  SEC               PIC X(2).
024300
029000 PROCEDURE DIVISION.
029100 0-BEGIN.
029200     PERFORM  1-HSK  THRU  1-HSK-X.
029300     PERFORM  6-MAIN THRU  6-MAIN-X.
030400     PERFORM  2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.
030800     GOBACK.
031000
031100 1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT  INVPWFIL-I.
           OPEN I-O    INVPWFIL-O.
           MOVE "ZINVPSWD" TO VIEW-CFNAME.
           ACCEPT YMD-DATE FROM DATE.
034200
034300 1-HSK-X.
034400     EXIT.
034500
034600
034700 2-CLOSE-FILES.
034710     CLOSE INVPWFIL-I, INVPWFIL-O.
037600 2-CLOSE-FILES-X.
037700     EXIT.
037800
037900
038000 2-BLOWUP.
           MOVE VIEW-NFNAME    TO  BU-DISPLAY-FLD (1).
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
            CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                  VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                  BU-DISPLAY-FLDS.
042000 2-BLOWUP-X.
042100     EXIT.
042200
042300
042400 6-MAIN.
042500     MOVE ZERO         TO  PSWD-SUB,
042600                           TABLE-SUB.
042700     MOVE SPACE        TO  DE-BUFFER1.
           MOVE F-SELECT     TO  VIEW-NFNAME.

042800 6-SHOWFORM1.
           MOVE 3            TO  SRF-MODE.
           MOVE DE-BUFFER1   TO  SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
                 VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
                 LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER TO DE-BUFFER1.
047000
047100     IF VIEW-LASTKEY = 1
047200         PERFORM  61-ADD  THRU  61-ADD-X
047700     ELSE
047800     IF VIEW-LASTKEY = 2
047900         PERFORM  62-CHANGE  THRU  62-CHANGE-X
048400     ELSE
048500     IF VIEW-LASTKEY = 5
048600         PERFORM  63-DELETE  THRU  63-DELETE-X
049100     ELSE
049200     IF VIEW-LASTKEY = 4
049300         PERFORM  64-INQUIRE  THRU  64-INQUIRE-X
049800     ELSE
049900     IF VIEW-LASTKEY = 6  OR
050000        VIEW-LASTKEY = 7  OR
050100        VIEW-LASTKEY = 8
050300         MOVE   9 TO LANG-SETNUM
050310         MOVE  10 TO LANG-MSGNUM
050320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1"           TO IND(99)
               GO TO 6-SHOWFORM1
051000     ELSE
051100     IF VIEW-LASTKEY = 3
051200         GO TO  6-MAIN-X
051300     ELSE
      *SELECT THE APPROPRIATE FUNCTION KEY
051500         MOVE  19 TO LANG-SETNUM
051510         MOVE  13 TO LANG-MSGNUM
051520         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
051700         MOVE MESSAGE-BUFFER TO   DE1-MSG-LINE
               MOVE B"1" TO IND(99)
               GO TO 6-SHOWFORM1.
052000
052100     GO TO  6-MAIN.
052200
052300
052400 6-MAIN-X.
052500     EXIT.
052600
052700
052800 61-ADD.
052900     MOVE SPACE  TO  DE-BUFFER3.
053000     MOVE "30"   TO  DE3-LENGTH-VALID.
053200     MOVE F-ADD  TO  VIEW-NFNAME.
053300
       61-SHOWFORM3.
           MOVE 3            TO  SRF-MODE.
           MOVE DE-BUFFER3   TO  SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
                 VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
                 LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER TO DE-BUFFER3.
057200     IF VIEW-LASTKEY = 3
057300         GO TO  61-ADD-X.
057400
057500     IF VIEW-LASTKEY = 1  OR
057600        VIEW-LASTKEY = 2  OR
057700        VIEW-LASTKEY = 4  OR
057800        VIEW-LASTKEY = 5  OR
057900        VIEW-LASTKEY = 6  OR
058000        VIEW-LASTKEY = 7  OR
058100        VIEW-LASTKEY = 8
058300         MOVE   9 TO LANG-SETNUM
058310         MOVE  10 TO LANG-MSGNUM
058320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(99)
058900         GO TO  61-SHOWFORM3.
059000
           IF DE3-EMPLOYEE-ID = SPACES
      *EMPLOYEE ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  58 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(1), IND(99)
               GO TO 61-SHOWFORM3.
      **   MOVE DE3-EMPLOYEE-ID TO EMPID-EDIT.
      **   IF ( EMPID-BYTE (1) = SPACES OR EMPID-BYTE (1) NUMERIC ) OR
      **      ( EMPID-BYTE (2) = SPACES OR EMPID-BYTE (2) NUMERIC ) OR
      *       ( EMPID-BYTE (3) = SPACES OR EMPID-BYTE (3) NUMERIC ) OR
      *       ( EMPID-BYTE (4) = SPACES OR EMPID-BYTE (4) NUMERIC )
      *EMPLOYEE ID MUST BE ALPHABETIC WITH NO EMPEDDED BLANKS
      *        MOVE  66 TO LANG-SETNUM
      *        MOVE  59 TO LANG-MSGNUM
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
      *        MOVE B"1"           TO IND(1), IND(99)
      *        GO TO 61-SHOWFORM3.
           IF DE3-NEW-PSWD = SPACES
      *EMPLOYEE PASSWORD IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  60 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(2), IND(99)
               GO TO 61-SHOWFORM3.
           IF DE3-LENGTH-VALID = SPACES
      *TIME LENGTH OF PASSWORD VALIDITY IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  61 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(5), IND(99)
               GO TO 61-SHOWFORM3.
           IF DE3-LENGTH-VALID NOT NUMERIC
      *TIME LENGTH OF VALIDITY MUST BE NUMERIC
               MOVE  66 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(5), IND(99)
               GO TO 61-SHOWFORM3.
           IF DE3-AUTH-ID = SPACES
      *AUTHORIZATION ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  63 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(4), IND(99)
               GO TO 61-SHOWFORM3.
           MOVE DE3-AUTH-ID TO AUTHID-EDIT.
           IF ( AUTHID-BYTE (1) = SPACES OR AUTHID-BYTE (1) NUMERIC )
           OR ( AUTHID-BYTE (2) = SPACES OR AUTHID-BYTE (2) NUMERIC )
           OR ( AUTHID-BYTE (3) = SPACES OR AUTHID-BYTE (3) NUMERIC )
           OR ( AUTHID-BYTE (4) = SPACES OR AUTHID-BYTE (4) NUMERIC )
      *AUTHORIZATION ID MUST BE ALPHABETIC WITH NO EMBEDDED BLANKS
               MOVE  66 TO LANG-SETNUM
               MOVE  64 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1"           TO IND(4), IND(99)
               GO TO 61-SHOWFORM3.
061200     MOVE SPACE             TO  PASSWORD-RCD.
061300     MOVE DE3-EMPLOYEE-ID   TO  PW-EMPLOYEE-ID.
061400     MOVE DE3-NEW-PSWD      TO  PW-CURRENT-PSWD.
061900     MOVE YMD-DATE          TO  PW-DATE-ADDED.
062000     MOVE DE3-LENGTH-VALID  TO  PW-LENGTH-VALID.
062100     MOVE DE3-AUTH-ID       TO  PW-AUTHORIZATION-ID.
062200
062300     WRITE INVPWFIL-REC-O FROM  PASSWORD-RCD.
062400     IF FILE-STATUS-1 = "2"
063000         MOVE   5 TO LANG-SETNUM
063010         MOVE  18 TO LANG-MSGNUM
063020         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
058900         GO TO  61-SHOWFORM3
           ELSE
           IF FILE-STATUS NOT = "00"
063900         MOVE "WRITE ERROR*61-ADD"  TO  BU-DISPLAY-MSG
064100         MOVE PW-EMPLOYEE-ID  TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           GO TO 61-ADD.
       61-ADD-X.
           EXIT.

       62-CHANGE.
           MOVE SPACE TO DE-BUFFER2.
           MOVE F-KEY TO VIEW-NFNAME.

       62-SHOWFORM2.
           MOVE 3            TO  SRF-MODE.
           MOVE DE-BUFFER2   TO  SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
                 VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
                 LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER TO DE-BUFFER2.
057200     IF VIEW-LASTKEY = 3
057300         GO TO  62-CHANGE-X.

069600     IF VIEW-LASTKEY = 1  OR
069700        VIEW-LASTKEY = 2  OR
069800        VIEW-LASTKEY = 4  OR
069900        VIEW-LASTKEY = 5  OR
070000        VIEW-LASTKEY = 6  OR
070100        VIEW-LASTKEY = 7  OR
070200        VIEW-LASTKEY = 8
070400         MOVE   9 TO LANG-SETNUM
070410         MOVE  10 TO LANG-MSGNUM
058320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99)
058900         GO TO  62-SHOWFORM2.
           IF DE2-EMPLOYEE-ID = SPACES
      *EMPLOYEE ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  58 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1"           TO IND(1), IND(99)
               GO TO 62-SHOWFORM2.
073300     MOVE DE2-EMPLOYEE-ID  TO  INVEMPID OF INVPWFIL-REC-O.
073400     READ INVPWFIL-O INTO PASSWORD-RCD
                INVALID KEY
074400             MOVE   5 TO LANG-SETNUM
074410             MOVE  17 TO LANG-MSGNUM
074420             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
074600             MOVE B"1" TO IND(99), IND(1)
075000             GO TO  62-SHOWFORM2.
075800
075900 62-FILLBUFF4.
076000     MOVE SPACE            TO  DE-BUFFER4.
076100     MOVE PW-EMPLOYEE-ID   TO  DE4-EMPLOYEE-ID.
076200     MOVE PW-CURRENT-PSWD  TO  DE4-CURRENT-PSWD.
076300     MOVE PW-LENGTH-VALID  TO  DE4-LENGTH-VALID.
076400
076500     MOVE F-CHANGE         TO  VIEW-NFNAME.
076600
       62-SHOWFORM4.
           MOVE 3            TO  SRF-MODE.
           MOVE DE-BUFFER4   TO  SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
                 VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
                 LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER TO DE-BUFFER4.
057200     IF VIEW-LASTKEY = 3
057300         GO TO  62-CHANGE-X.

069600     IF VIEW-LASTKEY = 1  OR
069700        VIEW-LASTKEY = 2  OR
069800        VIEW-LASTKEY = 4  OR
069900        VIEW-LASTKEY = 5  OR
070000        VIEW-LASTKEY = 6  OR
070100        VIEW-LASTKEY = 7  OR
070200        VIEW-LASTKEY = 8
070400         MOVE   9 TO LANG-SETNUM
070410         MOVE  10 TO LANG-MSGNUM
058320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99)
058900         GO TO  62-SHOWFORM4.
           MOVE B"0" TO SRF-INDICATORS.
           IF DE4-NEW-PSWD = SPACES
      *EMPLOYEE PASSWORD IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  60 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(3), IND(99)
               GO TO 62-SHOWFORM4.
           IF DE4-LENGTH-VALID = SPACES
      *TIME LENGTH OF PASSWORD VALIDITY IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  61 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(6), IND(99)
               GO TO 62-SHOWFORM4.
           IF DE4-LENGTH-VALID NOT NUMERIC
      *TIME LENGTH OF VALIDITY MUST BE NUMERIC
               MOVE  66 TO LANG-SETNUM
               MOVE  62 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(6), IND(99)
               GO TO 62-SHOWFORM4.
           IF DE4-AUTH-ID = SPACES
      *AUTHORIZATION ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  63 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(5), IND(99)
               GO TO 62-SHOWFORM4.
           MOVE DE4-AUTH-ID TO AUTHID-EDIT.
           IF ( AUTHID-BYTE (1) = SPACES OR AUTHID-BYTE (1) NUMERIC )
           OR ( AUTHID-BYTE (2) = SPACES OR AUTHID-BYTE (2) NUMERIC )
           OR ( AUTHID-BYTE (3) = SPACES OR AUTHID-BYTE (3) NUMERIC )
           OR ( AUTHID-BYTE (4) = SPACES OR AUTHID-BYTE (4) NUMERIC )
      *AUTHORIZATION ID MUST BE ALPABETIC WITH NO EMBEDDED BLANKS
               MOVE  66 TO LANG-SETNUM
               MOVE  64 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(5), IND(99)
               GO TO 62-SHOWFORM4.
084500 62-VALIDATE-PSWD.
084600     IF DE4-NEW-PSWD = PW-CURRENT-PSWD
      *THE NEW PASSWORD MUST BE DIFFERENT FROM THE CURRENT PASSWORD
084800         MOVE  20 TO LANG-SETNUM
084810         MOVE  16 TO LANG-MSGNUM
084820         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO  IND(99), IND(3)
               GO TO 62-SHOWFORM4.
085500
085600 62-VALIDATE-LOOP.
085700     ADD +1  TO  PSWD-SUB.
085800
085900     IF PSWD-SUB > 12
086000         MOVE +12  TO  PSWD-SUB
086100         MOVE +13  TO  TABLE-SUB
086200         GO TO  62-UPDT-OPW-TABLE.
086300
086400     IF PW-OLD-PSWD (PSWD-SUB) = SPACE
086500         MOVE +12  TO  PSWD-SUB
086600         MOVE +13  TO  TABLE-SUB
086700         GO TO  62-UPDT-OPW-TABLE.
086800
086900     IF DE4-NEW-PSWD = PW-OLD-PSWD (PSWD-SUB)
087100         MOVE  20 TO LANG-SETNUM
087110         MOVE  17 TO LANG-MSGNUM
087120         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
087700         GO TO  62-SHOWFORM4
087800     ELSE
087900         GO TO  62-VALIDATE-LOOP.
088000
088100 62-UPDT-OPW-TABLE.
088200     SUBTRACT +1  FROM  PSWD-SUB.
088300     SUBTRACT +1  FROM  TABLE-SUB.
088400
088500     IF TABLE-SUB = 1
088600         GO TO  62-REWRITE.
088700
           MOVE PW-OLD-PSWD (PSWD-SUB)  TO  PW-OLD-PSWD (TABLE-SUB).
088900     GO TO  62-UPDT-OPW-TABLE.
089000
089100 62-REWRITE.
089200     MOVE PW-CURRENT-PSWD   TO  PW-OLD-PSWD (TABLE-SUB).
089300     MOVE DE4-NEW-PSWD      TO  PW-CURRENT-PSWD.
089800     MOVE YMD-DATE          TO  PW-DATE-CHANGED.
089900     MOVE DE4-LENGTH-VALID  TO  PW-LENGTH-VALID.
090000     MOVE DE4-AUTH-ID       TO  PW-AUTHORIZATION-ID.
090100
090200     REWRITE INVPWFIL-REC-O FROM PASSWORD-RCD
090300        INVALID KEY
090800         MOVE "REWRITE ERROR*62-REWRITE"  TO  BU-DISPLAY-MSG
091100         GO TO  62-CHANGE-X.
091200
091300     GO TO  62-CHANGE.
091400
091500 62-CHANGE-X.
091600     EXIT.
091700
091800
091900 63-DELETE.
092000     MOVE SPACE  TO  DE-BUFFER2.
092200     MOVE F-KEY  TO  VIEW-NFNAME.
092300
       63-SHOWFORM2.
           MOVE 3            TO  SRF-MODE.
           MOVE DE-BUFFER2   TO  SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
                 VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
                 LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER TO DE-BUFFER2.
057200     IF VIEW-LASTKEY = 3
057300         GO TO  63-DELETE-X.

069600     IF VIEW-LASTKEY = 1  OR
069700        VIEW-LASTKEY = 2  OR
069800        VIEW-LASTKEY = 4  OR
069900        VIEW-LASTKEY = 5  OR
070000        VIEW-LASTKEY = 6  OR
070100        VIEW-LASTKEY = 7  OR
070200        VIEW-LASTKEY = 8
070400         MOVE   9 TO LANG-SETNUM
070410         MOVE  10 TO LANG-MSGNUM
058320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99)
058900         GO TO  63-SHOWFORM2.
100100
           IF DE2-EMPLOYEE-ID = SPACES
      *EMPLOYEE ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  58 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1"           TO IND(1), IND(99)
               GO TO 63-SHOWFORM2.
073300     MOVE DE2-EMPLOYEE-ID  TO  INVEMPID OF INVPWFIL-REC-O.
073400     READ INVPWFIL-O INTO PASSWORD-RCD
                INVALID KEY
074400             MOVE   5 TO LANG-SETNUM
074410             MOVE  17 TO LANG-MSGNUM
074420             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
074600             MOVE B"1" TO IND(99), IND(1)
075000             GO TO  63-SHOWFORM2.
           IF FILE-STATUS NOT = ZERO
102200             MOVE "READ ERROR*63-DELETE"
102300                       TO  BU-DISPLAY-MSG
102600             GO TO  2-BLOWUP.
102700
102800 63-FILLBUFF5.
102900     MOVE SPACE             TO  DE-BUFFER5.
103000     MOVE PW-EMPLOYEE-ID    TO  DE5-EMPLOYEE-ID.
103100     MOVE PW-CURRENT-PSWD   TO  DE5-CURRENT-PSWD.
103300     MOVE F-DELETE          TO  VIEW-NFNAME.
103400 63-SHOWFORM5.
           MOVE 3              TO SRF-MODE.
           MOVE DE-BUFFER5     TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER  TO DE-BUFFER5.
107300     IF VIEW-LASTKEY = 3
107400         GO TO  63-DELETE-X.
107500
107600     IF VIEW-LASTKEY = 1  OR
107700        VIEW-LASTKEY = 2  OR
107800        VIEW-LASTKEY = 4  OR
107900        VIEW-LASTKEY = 5  OR
108000        VIEW-LASTKEY = 6  OR
108100        VIEW-LASTKEY = 7  OR
108200        VIEW-LASTKEY = 8
108400         MOVE   9 TO LANG-SETNUM
108410         MOVE  10 TO LANG-MSGNUM
108420         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99)
109000         GO TO  63-SHOWFORM5.
           IF DE5-AUTH-ID = SPACES
      *AUTHORIZATION ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  63 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1"           TO IND(4), IND(99)
               GO TO 63-SHOWFORM5.
           MOVE DE5-AUTH-ID TO AUTHID-EDIT.
           IF ( AUTHID-BYTE (1) = SPACES OR AUTHID-BYTE (1) NUMERIC )
           OR ( AUTHID-BYTE (2) = SPACES OR AUTHID-BYTE (2) NUMERIC )
           OR ( AUTHID-BYTE (3) = SPACES OR AUTHID-BYTE (3) NUMERIC )
           OR ( AUTHID-BYTE (4) = SPACES OR AUTHID-BYTE (4) NUMERIC )
      *AUTHORIZATION ID MUST BE ALPHABETIC WITH NO EMBEDDED BLANKS
               MOVE  66 TO LANG-SETNUM
               MOVE  64 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1"           TO IND(4), IND(99)
               GO TO 63-SHOWFORM5.
109100
           DELETE INVPWFIL-O INVALID KEY MOVE "2" TO FILE-STATUS-1.
           IF FILE-STATUS NOT = "00"
111700         MOVE "DELETE ERROR*63-DELETE"  TO  BU-DISPLAY-MSG
112000         GO TO  2-BLOWUP.
112100
112200     GO TO  63-DELETE.
112300
112400 63-DELETE-X.
112500     EXIT.
112600
112700
112800 64-INQUIRE.
112900     MOVE SPACE  TO  DE-BUFFER2.
113100     MOVE F-KEY  TO  VIEW-NFNAME.
113200
       64-SHOWFORM2.
           MOVE 3              TO SRF-MODE.
           MOVE DE-BUFFER2     TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER  TO DE-BUFFER2.
117100     IF VIEW-LASTKEY = 3
117200         GO TO  64-INQUIRE-X.
117300
117400     IF VIEW-LASTKEY = 1  OR
117500        VIEW-LASTKEY = 2  OR
117600        VIEW-LASTKEY = 4  OR
117700        VIEW-LASTKEY = 5  OR
117800        VIEW-LASTKEY = 6  OR
117900        VIEW-LASTKEY = 7  OR
118000        VIEW-LASTKEY = 8
118200         MOVE   9 TO LANG-SETNUM
118210         MOVE  10 TO LANG-MSGNUM
118220         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99)
118800         GO TO  64-SHOWFORM2.
118900
           IF DE2-EMPLOYEE-ID = SPACES
      *EMPLOYEE ID IS REQUIRED
               MOVE  66 TO LANG-SETNUM
               MOVE  58 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1"           TO IND(1), IND(99)
               GO TO 64-SHOWFORM2.
073300     MOVE DE2-EMPLOYEE-ID  TO  INVEMPID OF INVPWFIL-REC-I.
073400     READ INVPWFIL-I INTO PASSWORD-RCD
                INVALID KEY
074400             MOVE   5 TO LANG-SETNUM
074410             MOVE  17 TO LANG-MSGNUM
074420             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
074600             MOVE B"1" TO IND(99), IND(1)
075000             GO TO  64-SHOWFORM2.
121900     IF FILE-STATUS NOT = ZERO
122200         MOVE   5 TO LANG-SETNUM
122210         MOVE  17 TO LANG-MSGNUM
122220         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
123600         GO TO 64-SHOWFORM2.

123700  64-FILLBUFF6.
123800     MOVE SPACE                TO  DE-BUFFER6.
123900     MOVE PW-EMPLOYEE-ID       TO  DE6-EMPLOYEE-ID.
124000     MOVE PW-CURRENT-PSWD      TO  DE6-CURRENT-PSWD.
124100     IF PW-DATE-ADDED NOT = SPACE
124200         MOVE PW-DATE-ADDED    TO  YMD-DATE
124300         MOVE YMD-MM           TO  RFMT-MM
124400         MOVE YMD-DD           TO  RFMT-DD
124500         MOVE YMD-YY           TO  RFMT-YY
124600         MOVE REFORMAT-DATE    TO  DE6-DATE-ADDED.
124700     IF PW-DATE-CHANGED NOT = SPACE
124800         MOVE PW-DATE-CHANGED  TO  YMD-DATE
124900         MOVE YMD-MM           TO  RFMT-MM
125000         MOVE YMD-DD           TO  RFMT-DD
125100         MOVE YMD-YY           TO  RFMT-YY
125200         MOVE REFORMAT-DATE    TO  DE6-DATE-CHANGED.
125300     IF PW-DATE-AP-ACT NOT = SPACE
125400         MOVE PW-DATE-AP-ACT   TO  YMD-DATE
125500         MOVE YMD-MM           TO  RFMT-MM
125600         MOVE YMD-DD           TO  RFMT-DD
125700         MOVE YMD-YY           TO  RFMT-YY
125800         MOVE REFORMAT-DATE    TO  DE6-DATE-ACTIVITY.
125900     MOVE PW-AP-FUNCTION       TO  DE6-LAST-FUNCTION.
126000     MOVE PW-LENGTH-VALID      TO  DE6-LENGTH-VALID.
126200     MOVE F-INQUIRE            TO  VIEW-NFNAME.
126300
128900 64-SHOWFORM6.
           MOVE 3              TO SRF-MODE.
           MOVE DE-BUFFER6     TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER  TO DE-BUFFER6.

130200     IF VIEW-LASTKEY = 3
130300         GO TO  64-INQUIRE-X.
130400
130500     IF VIEW-LASTKEY = 1  OR
130600        VIEW-LASTKEY = 2  OR
130700        VIEW-LASTKEY = 4  OR
130800        VIEW-LASTKEY = 5  OR
130900        VIEW-LASTKEY = 6  OR
131000        VIEW-LASTKEY = 7  OR
131100        VIEW-LASTKEY = 8
131300         MOVE   9 TO LANG-SETNUM
131310         MOVE  10 TO LANG-MSGNUM
131320         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99)
131900         GO TO  64-SHOWFORM6.
132000
132100     GO TO  64-INQUIRE.
132200
132300 64-INQUIRE-X.
132400     EXIT.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
141700 999-CATREAD-EXIT.
141800     EXIT.
141900
