000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     TINVTC.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000700*REMARKS.
000800*
000900**************************************************************
001000*                                                            *
001100*   T I N V T C        THIS PROGRAMS CREATES INVOICE         *
001200*     TRANSACTIONS '490' AND '492' AND IS EXECUTED IN THE    *
001300*     MANIFEST JOB WHENEVER A RELEASE IS DONE.  THE          *
001400*     TRANACTIONS ARE PUT INTO THE 'DDAILYTC' DATA SET       *
001500*     AND ARE SENT UP WITH ALL THE OTHER 'CSIS' TRANACTIONS  *
001600*                                                            *
001700*     THIS PROGRAM IS EXECUTED IN THE TEMPORARY JOB STREAM   *
001800*     'BXMANJOB.PUB' WHICH IS CREATED BY 'TINVMAN'           *
001900*                                                            *
002000*     FILE DEFINITIONS (INPUTS/OUTPUTS)                      *
002100*        1) MANSTFLnn- THE LOCAL STORES FILE USED BY THE SUB *
002200*                     PLANTS FOR THEIR LOCAL STORES ACCTG.   *
002300*                     SYSTEMS.  THIS FILE IS ONLY CREATED    *
002400*                     WHEN THE 'RLSE' MANIFEST OPTION IS     *
002500*                     SELECTED.                              *
002600*                                                            *
002700**************************************************************
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  JULY 3, 1996    CA YODER
      *C   RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
002800
002900
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.  IBM-AS400.
003300 OBJECT-COMPUTER.  IBM-AS400.
012800
012900 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
007500     SELECT MAN-STORES-FILE
                  ASSIGN TO DATABASE-MANSTR.

           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2501.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1601.

004200 FD  MAN-STORES-FILE
004300     LABEL RECORDS ARE OMITTED
004400     RECORD CONTAINS 80 CHARACTERS
004500     DATA RECORDS ARE STORES-ID1-RCD,
004600                      STORES-ID5-RCD.
004700 01  STORES-ID1-RCD.
004800     05  RECORD-ID1            PIC X.
004900     05  STORES-REG-NO-ID1     PIC X(5).
005000     05  STORES-INVOICE-TYPE   PIC X.
005100     05  STORES-PO-NUMBER      PIC X(10).
005200     05  STORES-VENDOR-CODE    PIC X(7).
005300     05  STORES-BUDGT-NO       PIC X(12).
005400     05  STORES-DIST-COST      PIC S9(8)V99.
005500     05  STORES-DISCOUNT       PIC S9(8)V99.
005600     05  STORES-TERMS          PIC X(2).
005700     05  STORES-TOTAL-TAX      PIC S9(8)V99.
005800     05  STORES-TAX-CODE       PIC X(2).
005900     05  STORES-NO-CHECK       PIC X.
006000     05  FILLER                PIC X(9).
006100 01  STORES-ID5-RCD.
006200     05  RECORD-ID5            PIC X.
006300     05  STORES-REG-NO-ID5     PIC X(5).
006400     05  STORES-CORP-CODE      PIC X(7).
006500     05  STORES-CLASS          PIC X(3).
006600     05  STORES-ITEM-NO        PIC 9(3).
006700     05  STORES-QTY            PIC S9(8)V99.
006800     05  STORES-UM             PIC X(2).
006900     05  STORES-VALUE          PIC S9(8)V99.
007000     05  STORES-ITM-FRT        PIC S9(8)V99.
007100     05  STORES-ITM-TAX        PIC S9(8)V99.
007200     05  STORES-ITM-ACCOUNTING.
007300         10  STORES-PRIME      PIC X(3).
007400         10  STORES-SUB        PIC X(3).
007500         10  STORES-SUBD       PIC X(4).
007600         10  STORES-ADDL-DATA  PIC X(6).
007700     05  STORES-ITM-MEMO-INDIC PIC X.
007800     05  FILLER                PIC X(2).
007900
008000
008100 WORKING-STORAGE SECTION.
008200 77  COMPANY-SAVE                 PIC X(3)  VALUE SPACES.
008300 77  TOTAL-ITEM-CHARGES           PIC S9(11)V9(2) VALUE ZEROS.
008400 77  TOTAL-ITEM-QTY               PIC S9(8)V9(2)  VALUE ZEROS.
008500 77  DDAILYTC-TC-CTR              PIC S9(4) COMP-4  VALUE ZEROS.
9406CK 01  SCOPE   PIC X.
008600
008700 01  SAVE-ITEM-DATA.
008800     05  SAVE-ITEM-NO             PIC 9(4)       VALUE ZEROS.
008900     05  SAVE-CORP-CODE           PIC X(7)       VALUE SPACES.
009000     05  SAVE-ITEM-QTY-UM         PIC X(2)       VALUE SPACES.
009100
009200**************************************
009300*                                    *
009400*   SWITCHES                         *
009500*                                    *
009600**************************************
009700
009800 01  SWITCH-AREA.
009900     05  PREVIOUS-ITEM-SW         PIC X     VALUE "N".
010000     05  DDAILYTC-LOCKED-SW       PIC X     VALUE "N".
010100         88  DDAILYTC-LOCKED                VALUE "Y".
010200
010300
010400 01  COMMAND-AREA.
           05  QCMDEXC-MANSTR.
               10  OVRDBF-MANSTR      PIC X(70) VALUE SPACES.
               10  DBF-MANSTR-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 70.
       COPY CCHKOBJ  IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.

       01  MAN-STR-LIT.
           05  FILLER                 PIC X(6)  VALUE "MANSTR".
           05  MAN-STR-FILE-NO        PIC 99    VALUE ZEROS.

012800**************************************************************
012900**************************************************************
013000**                                                          **
013100**                DATABASE I/O BUFFER AREA                  **
013200**                                                          **
013300**************************************************************
013400**************************************************************
013500
013600 COPY DINVRCD   IN COPYLIB.
013700
013800 COPY DDAILYTC  IN COPYLIB.
013900
014000 COPY TC490     IN COPYLIB.
014100
014200 COPY MPLTINFO  IN COPYLIB.
014500
014600 COPY DATAB     IN COPYLIB.
014700
014800
014900*********************
015000*                   *
015100*   DATA SET NAMES  *
015200*                   *
015300*********************
015400
015500 01  DSET-NAMES.
015600     05  DSET-NAME                PIC X(16)  VALUE SPACES.
015700     05  DSET-DINVRCD             PIC X(16)  VALUE "DINVRCD;".
015800     05  DSET-DDAILYTC            PIC X(16)  VALUE "DDAILYTC;".
015900     05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
016000
016100 01 ITEMS-LISTING.
016200     05  ALL-ITEMS                PIC XX    VALUE "@;".
016300     05  REG-SEARCH          PIC X(16) VALUE "REGISTER-NUMBER;".
016400
016500 01  ARG-VALUES.
016600     05  REGISTER-ARG             PIC X(6)  VALUE SPACES.
016700     05  PLT-ARG                  PIC X(4)  VALUE SPACES.
016800
016900
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X(1)  VALUE SPACES.
           05  FILE-STATUS-2            PIC X(1)  VALUE SPACES.
017000**************************************************
017100**                DATE AREAS                    **
017200**************************************************
017300
017400 COPY TDATECHK  IN COPYLIB.
017600
017700 COPY TBLOWUP   IN COPYLIB.
017800
017900 COPY VIEWDUM   IN COPYLIB.
018000
018100
018200 PROCEDURE DIVISION.
018300
018400 PROC-DIV SECTION 01.
018600
018700 1-BEGIN.
018800     PERFORM 1-HSK THRU 1-H-X.
018900
019000     PERFORM 6-MAIN THRU 6-M-X.
019100
019200     PERFORM 2-EOJ  THRU 2-EOJ-X.
019300
019400     GOBACK.
019500
019600
019700 1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT DINVRCD-I, MPLTINFO-I.
           OPEN I-O   DDAILYTC-O.
020300**************************************************
020400*                                                *
020500*   GET CO. AND PRIME FROM MPLTINFO              *
020600*   USING 'P 01' AS THE ARGUMENT                 *
020700*                                                *
020800**************************************************
020900
021000     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
021400         MOVE "READ MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
021500         MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (1)
021600         GO TO 2-BLOWUP.
021700     MOVE MPLTINFO-COMPANY     TO  COMPANY-SAVE.
021800
021900 1-H-X.
022000     EXIT.
022100
022200 2-EOJ.
           CLOSE DINVRCD-I, MPLTINFO-I, DDAILYTC-O.
022700
022800 2-EOJ-X.
022900     EXIT.
023000
023100*********************************************
023200*                                           *
023300*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
023400*  FATAL ERROR OCCURS                       *
023500*                                           *
023600*********************************************
023700
023800 2-BLOWUP.
           MOVE "MNACTIVE" TO CCRTFILE-FILE.
           MOVE 1 TO CCRTFILE-RECORD-LENGTH,
                     CCRTFILE-NO-RECORDS,
                     CCRTFILE-INCREMENT-AMT,
                     CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CREATE COMMAND FAILED"  TO  BU-DISPLAY-MSG
               MOVE CCRTFILE-STATUS TO BU-DISPLAY-FLD (1).
024100     MOVE "TINVTC"                TO  BU-PGM-NAME.
024200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
024300         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
024400                 BU-DISPLAY-FLDS.
024500
024600
024700**************************************************
024800*                                                *
024900*     6 - M A I N                                *
025000*                                                *
025100**************************************************
025200
025300
025400 6-MAIN.
025500     PERFORM 61-WRITE-TCS  THRU  61-WT-X.
025600
025700 6-M-X.
025800     EXIT.
025900
026000
026100 61-WRITE-TCS.
026200     PERFORM 611-FIND-LATEST-STORES  THRU  611-FLS-X.
026300
026400     OPEN INPUT  MAN-STORES-FILE.
026500     MOVE "N"                     TO  PREVIOUS-ITEM-SW,
026600                                      DDAILYTC-LOCKED-SW.
026700     MOVE ZEROS                   TO  SAVE-ITEM-NO,
026800                                      TOTAL-ITEM-CHARGES,
026900                                      TOTAL-ITEM-QTY,
027000                                      DDAILYTC-TC-CTR.
027100 61-READ-STORES-FILE.
027200     READ MAN-STORES-FILE
027300         AT END
027400             GO TO 61-CLOSE-FILES.
027500
027600     IF RECORD-ID1 = "1"
027700         PERFORM 611-PROCESS-RECORD-ID1  THRU  611-PRI-X
027800     ELSE
027900     IF RECORD-ID1 = "5"
028000         PERFORM 611-CUT-TC492  THRU  611-CUT-TC492-X.
028100
028200     GO TO 61-READ-STORES-FILE.
028300
028400 61-CLOSE-FILES.
028500     IF PREVIOUS-ITEM-SW = "Y"
028600         PERFORM 611-CUT-TC490  THRU  611-CUT-TC490-X.
028700
028800*    IF DDAILYTC-LOCKED
028900*        PERFORM 62-UNLOCK-DDAILYTC  THRU  62-UD-X.
029000*
029100     CLOSE MAN-STORES-FILE.
029200
029300 61-WT-X.
029400     EXIT.
029500
029600
029700 611-PROCESS-RECORD-ID1.
029800     IF PREVIOUS-ITEM-SW = "Y"
029900         PERFORM 611-CUT-TC490  THRU  611-CUT-TC490-X.
030000     MOVE STORES-REG-NO-ID1       TO  REGISTER-ARG.
030100     PERFORM 62-GET-DINVRCD  THRU  62-GD-X.
030200
030300 611-PRI-X.
030400     EXIT.
030500
030600**********************************************************
030700**   THIS ROUTINE CUTS TC 492 TCs. ONE TRANACTION IS CUT
030800**   FOR EVERY ACCOUNT BREAKDOWN OF A ITEM ON AN INVOICE.
030900**   ONE ITEM INVOICE CHARGE CAN BE SPREAD OUT INTO A
031000**   MAXIMUM OF 5 ACCOUNTS (PRIME,SUB,SUBD,ADDTL) AND A
031100**   MINIMUM OF 1 ACCOUNT.  ONE 492 TC IS CUT FOR EVERY
031200**   ACCOUNT CHARGE PER ITEM.
031300**********************************************************
031400
031500 611-CUT-TC492.
031600     IF SAVE-ITEM-NO = STORES-ITEM-NO
031700         NEXT SENTENCE
031800     ELSE
031900         IF PREVIOUS-ITEM-SW = "Y"
032000             PERFORM 611-CUT-TC490  THRU  611-CUT-TC490-X.
032500     MOVE SPACES                  TO  BUF-DDAILYTC.
032600     CALL "TDATECHK" USING DATE-CHECK-AREA.
032700     MOVE DATE-YMD-OUT            TO  DDAILYTC-DATE.
032800     MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.
032900     MOVE COMPANY-SAVE            TO  DDAILYTC-PLT.
033000     MOVE "492"                   TO  DDAILYTC-TC.
033100     MOVE STORES-CORP-CODE        TO  TC492-CORP-CODE,
033200                                      SAVE-CORP-CODE.
033300     MOVE INV-PO-RLSE             TO  TC492-PO-NO.
033400     MOVE STORES-ITEM-NO          TO  TC492-ITEM-NO,
033500                                      SAVE-ITEM-NO.
033600********************************************************
033700**  IF THE ITEM IS A MEMO QUANTITY THEN MOVE ZEROS
033800**  TO STORES-QTY.  A MEMO QUANTITY IS AN ADJUSTMENT TYPE
033900**  TRANSACTION WHEN UNDER OF OVERPAYING A PREVIOUS
034000**  INVOICE.  THE QUANTITY ENTERED DOES NOT AFFECT TOTAL
034100**  QUANTITY PAID FOR THE ITEM.
034200********************************************************
034300     IF STORES-ITM-MEMO-INDIC  NOT = SPACES
034400         MOVE ZEROS               TO  STORES-QTY.
034500     MOVE STORES-QTY              TO  TC492-ITEM-QTY.
034600     MOVE STORES-UM               TO  TC492-ITEM-QTY-UM,
034700                                      SAVE-ITEM-QTY-UM.
034800     ADD STORES-VALUE, STORES-ITM-FRT, STORES-ITM-TAX
034900         GIVING TC492-ITEM-TOT-AMT.
035000     ADD TC492-ITEM-TOT-AMT       TO  TOTAL-ITEM-CHARGES.
035100     ADD TC492-ITEM-QTY           TO  TOTAL-ITEM-QTY.
035200     MOVE STORES-ITM-ACCOUNTING   TO  TC492-ACCTG-INFO.
           WRITE DDAILYTC-O-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
035600         MOVE "WRT2 DDAILYTC * 611-CT492" TO BU-DISPLAY-MSG
035700         MOVE REGISTER-ARG        TO  BU-DISPLAY-FLD (1)
035800         MOVE STORES-ITEM-NO      TO  BU-DISPLAY-FLD (2)
035900         MOVE STORES-CORP-CODE    TO  BU-DISPLAY-FLD (3)
036000         GO TO 2-BLOWUP.
036100
036200     MOVE "Y"                     TO  PREVIOUS-ITEM-SW.
036300*    ADD 1                        TO  DDAILYTC-TC-CTR.
040700*    IF DDAILYTC-TC-CTR > 9
040800*        PERFORM 62-UNLOCK-DDAILYTC  THRU  62-UD-X.
036600
036700 611-CUT-TC492-X.
036800     EXIT.
036900
037000******************************************************
037100**   THIS ROUTINE CUTS THE TC 490.  ONE TRANSACTION
037200**   IS CUT FOR EVERY ITEM ON EVERY INVOICE.
037300******************************************************
037400
037500 611-CUT-TC490.
038000     MOVE SPACES                  TO  BUF-DDAILYTC.
038100     CALL "TDATECHK" USING DATE-CHECK-AREA.
038200     MOVE DATE-YMD-OUT            TO  DDAILYTC-DATE.
038300     MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.
038400     MOVE COMPANY-SAVE            TO  DDAILYTC-PLT.
038500     MOVE "490"                   TO  DDAILYTC-TC.
038600     MOVE INV-NO                  TO  TC490-INV-NO.
038700     MOVE INV-VEN-CODE-1-7        TO  TC490-VEN-CODE.
038800     MOVE INV-DATE                TO  TC490-INV-DATE.
038900     MOVE SAVE-CORP-CODE          TO  TC490-CORP-CODE.
039000     MOVE SAVE-ITEM-NO            TO  TC490-ITEM-NO.
039100     MOVE TOTAL-ITEM-QTY          TO  TC490-ITEM-QTY.
039200     MOVE SAVE-ITEM-QTY-UM        TO  TC490-ITEM-QTY-UM.
039300     MOVE TOTAL-ITEM-CHARGES      TO  TC490-ITEM-TOT-AMT.
           WRITE DDAILYTC-O-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
035600         MOVE "WRT DDAILYTC * 611-CT490" TO BU-DISPLAY-MSG
035700         MOVE REGISTER-ARG        TO  BU-DISPLAY-FLD (1)
035800         MOVE STORES-ITEM-NO      TO  BU-DISPLAY-FLD (2)
035900         MOVE STORES-CORP-CODE    TO  BU-DISPLAY-FLD (3)
036000         GO TO 2-BLOWUP.
040200
040300     MOVE "N"                     TO  PREVIOUS-ITEM-SW.
040400     MOVE ZEROS                   TO  TOTAL-ITEM-CHARGES,
040500                                      TOTAL-ITEM-QTY.
040600*    ADD 1                        TO  DDAILYTC-TC-CTR.
040700*    IF DDAILYTC-TC-CTR > 9
040800*        PERFORM 62-UNLOCK-DDAILYTC  THRU  62-UD-X.
040900
041000 611-CUT-TC490-X.
041100     EXIT.
041200
041300*******************************************************
041400**   THIS ROUTINE FINDS THE LATEST GENERATION OF THE
041500**   STORES ACCOUNTING FILE CREATED BY 'XMANCRTE'
041600**   (MANIFEST CREATE).  THE LATEST GENERATION OF
041700**   MANSTRnn WILL BE THE FILE WITH THE HIGHEST
041800**   nn VALUE.  THIS FILE IS USED AS INPUT
041900**   TO CREATE THE '490' AND '492' TCs.
042000*******************************************************
042100
042200 611-FIND-LATEST-STORES.
042300     IF MAN-STR-FILE-NO = 99
042400         MOVE "MANIFEST STORES FILE GENS = 99" TO BU-DISPLAY-MSG
042500         GO TO 2-BLOWUP.
042600
042700     ADD 1             TO  MAN-STR-FILE-NO.
280100     MOVE MAN-STR-LIT  TO  CHKOBJ-FILE-NAME.
280200     CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
280300                          CHKOBJ-RETURN-STATUS.
280400     IF CHKOBJ-RETURN-STATUS  NOT = "00"
043300             SUBTRACT 1           FROM MAN-STR-FILE-NO
043400             IF MAN-STR-FILE-NO < 1
043500                 MOVE "NO STORES FILE FOUND MANSTRnn"
043600                     TO BU-DISPLAY-MSG
043700                 GO TO 2-BLOWUP
043800             ELSE
043900                 NEXT SENTENCE
044000     ELSE
044500          GO TO 611-FIND-LATEST-STORES.
           STRING "OVRDBF FILE(MANSTR) TOFILE(",
             MAN-STR-LIT, ")",
             DELIMITED BY SIZE INTO OVRDBF-MANSTR.
           CALL "QCMDEXC" USING OVRDBF-MANSTR, DBF-MANSTR-PARM2.
045400
045500 611-FLS-X.
045600     EXIT.
045700
045800 62-GET-DINVRCD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVRCD-I-REC.
           READ DINVRCD-I INTO BUF-DINVRCD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
046800         MOVE "READ DINVRCD 62-GD" TO BU-DISPLAY-MSG
046900         MOVE REGISTER-ARG  TO  BU-DISPLAY-FLD (1)
047000         GO TO 2-BLOWUP.
047100
047200 62-GD-X.
047300     EXIT.
047500*62-LOCK-DDAILYTC.
047600*    CALL "DBLOCK" USING BASE, DSET-DDAILYTC, MODE3,
047700*        STATUS-AREA.
047800*    IF COND-WORD NOT = ZEROS
047900*        MOVE "LOCK DDAILYTC * 62-LD"  TO BU-DISPLAY-MSG
048000*        MOVE REGISTER-ARG        TO  BU-DISPLAY-FLD (1)
048100*        MOVE STORES-ITEM-NO      TO  BU-DISPLAY-FLD (2)
048200*        GO TO 2-BLOWUP.
048300*
048400*    MOVE "Y"                     TO  DDAILYTC-LOCKED-SW.
048500*    MOVE ZEROS                   TO  DDAILYTC-TC-CTR.
048600*
048700*62-LD-X.
048800*    EXIT.
      *
049000*62-UNLOCK-DDAILYTC.
049100*    CALL "DBUNLOCK" USING BASE, DSET-DDAILYTC, MODE1,
049200*        STATUS-AREA.
049300*    IF COND-WORD NOT = ZEROS
049400*        MOVE "LOCK DDAILYTC * 62-LD"  TO BU-DISPLAY-MSG
049500*        MOVE REGISTER-ARG        TO  BU-DISPLAY-FLD (1)
049600*        MOVE STORES-ITEM-NO      TO  BU-DISPLAY-FLD (2)
049700*        GO TO 2-BLOWUP.
049800*
049900*    MOVE "N"                     TO  DDAILYTC-LOCKED-SW.
050000*
050100*62-UD-X.
050200*    EXIT.
