       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVCOM.
       AUTHOR.        LS BAKER/A TREUDLER.
       DATE-WRITTEN.  NOV 30, 1983.

      *REMARKS.       INVOICE PROCESSING.
      *
      *         SUB-ROUTINE THAT SHOWS AND UPDATES
      *                PO/INVOICE COMMENTS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.
          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.


       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVOICE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                  PIC X(1000).
       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.

       WORKING-STORAGE SECTION.
      *************************************************************
      **                                                         **
      **                    W O R K   A R E A                    **
      **                                                         **
      *************************************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X        VALUE SPACES.
           05  FILE-STATUS-2         PIC X        VALUE SPACES.
       01  LINE-SUB                  PIC S9(4)    VALUE ZERO  COMP-4.
       01  TOP-CURRENT               PIC S9(2)    VALUE ZERO.
       01  TOP-NEXT                  PIC S9(2)    VALUE ZERO.
       01  SAVE-LAST-LINE            PIC S9(2)    VALUE 48    COMP-3.
       01  MORE-COM-SW               PIC X        VALUE "N".
       01  SAVE-TOP-SW               PIC X        VALUE "N".
       01  ADD-ONLY-SW               PIC X        VALUE "N".
       01  BLOWUP-SW                 PIC X        VALUE "N".
       01  LIMIT-SW                  PIC X        VALUE "N".

       01  ITEM-SAVE-NO.
           05  ITEM-NO               PIC 9(4)     VALUE ZEROS.
           05  SEQ-NO                PIC 99       VALUE ZEROS.
       01  SAVE-ITEM-LINE.
           05  SAVE-ITEM-NO          PIC 9(4)     VALUE ZERO.
           05  SAVE-LINE-NO          PIC X(2)     VALUE SPACE.

      *************************************************************
      **                                                         **
      **               V I E W   W O R K   A R E A               **
      **                                                         **
      *************************************************************

       01  FORM-NAMES.
           05  INVCOM                PIC X(7)     VALUE "FINV02A".

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.



      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  DE-BUFFER1.
           05  DE1-PO-INV-COM  OCCURS  10  TIMES
                                     PIC X(79).
           05  DE1-ADDL-COM          PIC X.
           05  DE1-CMDLINE           PIC X(79).
           05  DE1-MSGLINE           PIC X(79).


      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DBMODES IN COPYLIB.


      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY DPODATA IN COPYLIB.
       COPY TBLOWUP IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY DISPDATA   IN COPYLIB.
       COPY CATREAD    IN COPYLIB.

       LINKAGE SECTION.

       01  BASE                      PIC X(10).

      *************************************************************
      **                                                         **
      **      S C R E E N   P R I N T   P A R A M E T E R S      **
      **                                                         **
      *************************************************************

       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL             PIC S9(4)    COMP-4.
           05  PAGE-CTL              PIC S9(4)    COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X.

       01  PASS-SPOOL-PRT-NO         PIC S9(2)    COMP-4.

       COPY VCOMLINK IN COPYLIB.

      *************************************************************
      **                                                         **
      **           D A T A B A S E   W O R K   A R E A           **
      **                                                         **
      *************************************************************

       COPY DBSTAT IN COPYLIB.

       01  PO-ARG                       PIC X(14).

       COPY LANGSUB IN COPYLIB.

       PROCEDURE DIVISION USING  BASE,
                                 SCREEN-PRINT-PARMS,
                                 PASS-SPOOL-PRT-NO,
                                 VIEW-COMAREA,
                                 STATUS-AREA,
                                 PO-ARG,
                                 LANGUAGE-PARMS.

       MAIN-LINE-LOGIC.
           OPEN I-O DISPLAY-FILE,
                    DPODATAITM-O.
           MOVE ZEROS TO LINE-SUB,
                         TOP-CURRENT,
                         TOP-NEXT,
                         ITEM-SAVE-NO,
                         SAVE-ITEM-NO.
           MOVE 48 TO SAVE-LAST-LINE.
           MOVE "N" TO MORE-COM-SW,
                       SAVE-TOP-SW,
                       ADD-ONLY-SW,
                       BLOWUP-SW,
                       LIMIT-SW.
           MOVE SPACES TO FILE-STATUS, SAVE-LINE-NO, DE-BUFFER1.
           PERFORM 61-INVOICE-COMMENTS THRU 61-INVOICE-COMMENTS-X.
           CLOSE DISPLAY-FILE, DPODATAITM-O.
           GOBACK.

       2100-BLOWUP.
           MOVE "TINVCOM" TO BU-PGM-NAME.
           MOVE PO-ARG TO BU-DISPLAY-FLD(1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       61-INVOICE-COMMENTS.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-O-REC.
           MOVE 49 TO SEQ-NO.
           MOVE ITEM-SAVE-NO TO ITEMSEQNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY >= EXTERNALLY-DESCRIBED-KEY
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             IF FILE-STATUS-1 = "2"
               MOVE "N" TO MORE-COM-SW
               GO TO 61-INITIATE-FORM1
             ELSE
               MOVE "TINVCOM START1DPODATATITM" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           MOVE "Y" TO SAVE-TOP-SW.
           MOVE "N" TO ADD-ONLY-SW, BLOWUP-SW, LIMIT-SW, MORE-COM-SW.
           MOVE 48 TO SAVE-LAST-LINE.
           MOVE SPACE TO DE-BUFFER1, SAVE-LINE-NO.
           MOVE ZEROS TO LINE-SUB.

       61-GET-DPODATAITM-LOOP.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             IF FILE-STATUS = "10" OR "14" OR "46"
               MOVE "N" TO MORE-COM-SW
               GO TO 61-INITIATE-FORM1
             ELSE
               MOVE "TINVCOM GETNEXT DPODATAITM" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           IF PORCVNO OF DPODATAITM-O-REC NOT EQUAL PO-ARG  OR
              DATAITM-ITEM-NO NOT EQUAL "0000"
             MOVE "N" TO MORE-COM-SW
             PERFORM 612-UNLOCK-DPODATAITM
             GO TO 61-INITIATE-FORM1.

       61-LOAD-FORM1.
           IF DATAITM-LINE-NO > "48" AND DATAITM-LINE-NO < "98"
             IF LINE-SUB < 10
               IF SAVE-TOP-SW = "Y"
                 MOVE "N"  TO  SAVE-TOP-SW
                 MOVE DATAITM-LINE-NO TO SAVE-LINE-NO, TOP-CURRENT
                 ADD 1 TO LINE-SUB
                 MOVE DATAITM-INFO TO DE1-PO-INV-COM(LINE-SUB)
                 GO TO  61-GET-DPODATAITM-LOOP
               ELSE
                 ADD 1 TO LINE-SUB
                 MOVE DATAITM-INFO TO DE1-PO-INV-COM(LINE-SUB)
                 GO TO  61-GET-DPODATAITM-LOOP
             ELSE
               MOVE DATAITM-LINE-NO TO TOP-NEXT
               MOVE "Y" TO MORE-COM-SW
               PERFORM 612-UNLOCK-DPODATAITM
               GO TO  61-INITIATE-FORM1
           ELSE
             IF DATAITM-LINE-NO = "98"
               MOVE "R" TO LIMIT-SW
               ADD 1 TO LINE-SUB
               MOVE DATAITM-INFO TO DE1-PO-INV-COM(LINE-SUB)
               GO TO  61-GET-DPODATAITM-LOOP
             ELSE
               GO TO 61-GET-DPODATAITM-LOOP.

       61-INITIATE-FORM1.
           MOVE INVCOM TO VIEW-NFNAME.

       61-SHOW-FORM1.
           MOVE DE-BUFFER1 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO DE-BUFFER1.
           IF VIEW-LASTKEY = 3
             GO TO 61-INVOICE-COMMENTS-X
           ELSE
             IF VIEW-LASTKEY = 1 OR 2 OR 4 OR 5 OR 6 OR 7 OR 8
      *
      * ***  INVALID FUNCTION KEY ENTERED  ***
      *
               MOVE 9 TO LANG-SETNUM
               MOVE 10 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE MESSAGE-BUFFER TO DE1-MSGLINE
               MOVE B"1" TO IND(99)
               GO TO 61-SHOW-FORM1.

       61-PROCESS-FORM1-CONT.
           IF LIMIT-SW = "M"
             GO TO 61-INVOICE-COMMENTS-X.

           MOVE ZERO TO LINE-SUB.
           IF SAVE-LINE-NO = SPACE OR ADD-ONLY-SW = "Y"
             GO TO 61-PUT-DPODATAITM.

       61-UPDATE-DPODATAITM.
           MOVE TOP-CURRENT TO SEQ-NO.
           PERFORM 611-CALC-DPODATAITM.

       61-COMPARE-LOOP.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             IF FILE-STATUS = "10" OR "14" OR "46"
               GO TO 61-PUT-DPODATAITM
             ELSE
               MOVE "TINVCOM GET5 DPODATAITM" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           IF PORCVNO OF DPODATAITM-O-REC NOT = PO-ARG OR
              DATAITM-ITEM-NO NOT EQUAL "0000"         OR
              DATAITM-LINE-NO < 49                     OR
              DATAITM-LINE-NO > 98
             PERFORM 612-UNLOCK-DPODATAITM
             GO TO 61-PUT-DPODATAITM.

       61-COMPARE-DATA.
           ADD 1 TO LINE-SUB.
           IF LINE-SUB > 10
             PERFORM 612-UNLOCK-DPODATAITM
             GO TO 61-CONTINUE-PROCESSING.

           IF DE1-PO-INV-COM(LINE-SUB) = DATAITM-INFO
             MOVE DATAITM-LINE-NO TO SAVE-LAST-LINE
             GO TO 61-COMPARE-LOOP
           ELSE
             IF DE1-PO-INV-COM(LINE-SUB) = SPACE
               MOVE DATAITM-LINE-NO TO SAVE-LAST-LINE
               DELETE DPODATAITM-O
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-DELETE
               IF FILE-STATUS = "00"
                 GO TO 61-COMPARE-LOOP
               ELSE
                 MOVE "TINVCOM D DPODATAITM" TO BU-DISPLAY-MSG
                 GO TO 2100-BLOWUP
             ELSE
               MOVE DE1-PO-INV-COM(LINE-SUB) TO DATAITM-INFO
               MOVE DATAITM-LINE-NO TO SAVE-LAST-LINE
               REWRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS = "00"
                 GO TO 61-COMPARE-LOOP
               ELSE
                 MOVE "TINVCOM U DPODATAITM" TO BU-DISPLAY-MSG
                 GO TO 2100-BLOWUP.

       61-PUT-DPODATAITM.
           ADD 1 TO LINE-SUB.
           IF LINE-SUB > 10
             GO TO 61-CONTINUE-PROCESSING.
           IF DE1-PO-INV-COM(LINE-SUB) = SPACE
             GO TO 61-PUT-DPODATAITM.
           MOVE PO-ARG TO DATAITM-PO-RCV-NO.
           MOVE ZERO TO SAVE-ITEM-NO.
           ADD 1 TO SAVE-LAST-LINE.
           MOVE SAVE-LAST-LINE TO SAVE-LINE-NO.
           MOVE SAVE-ITEM-LINE TO DATAITM-LINE.
           MOVE DE1-PO-INV-COM(LINE-SUB) TO DATAITM-INFO.
           IF DATAITM-LINE-NO > "48" AND DATAITM-LINE-NO < "98"
             WRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
             END-WRITE
             IF FILE-STATUS = "00"
               GO TO 61-PUT-DPODATAITM
             ELSE
               MOVE "TINVCOM PUT DPODATAITM" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP
           ELSE
             IF DATAITM-LINE-NO = "98"
               WRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS = "00"
                 MOVE "R"  TO  LIMIT-SW
                 GO TO 61-PUT-DPODATAITM
               ELSE
                 MOVE "TINVCOM PUT* DPODATAITM" TO BU-DISPLAY-MSG
                 GO TO 2100-BLOWUP
             ELSE
               MOVE "E" TO LIMIT-SW.

       61-CONTINUE-PROCESSING.
           IF DE1-ADDL-COM = "X"
             IF MORE-COM-SW = "Y"
               MOVE SPACE TO DE-BUFFER1
               MOVE ZERO TO LINE-SUB
               MOVE "Y" TO SAVE-TOP-SW
               MOVE TOP-NEXT TO SEQ-NO
               PERFORM 611-CALC-DPODATAITM
               GO TO 61-GET-DPODATAITM-LOOP
             ELSE
               IF LIMIT-SW = "R" OR "E"
                 MOVE "M" TO LIMIT-SW
                 MOVE SPACE TO DE-BUFFER1

      *
      * ***  INVOICE COMMENT LIMIT OF 50 EXCEEDED ***
      *
                 MOVE 9 TO LANG-SETNUM
                 MOVE 34 TO LANG-MSGNUM
                 PERFORM 999-CATREAD
                 MOVE MESSAGE-BUFFER TO DE1-PO-INV-COM(5)
                 GO TO 61-SHOW-FORM1
               ELSE
                 MOVE SPACE TO DE-BUFFER1
                 MOVE "Y" TO ADD-ONLY-SW
                 GO TO 61-SHOW-FORM1
           ELSE
             IF LIMIT-SW = "E"
               MOVE "M" TO LIMIT-SW
               MOVE SPACE TO DE-BUFFER1

      *
      * ***  INVOICE COMMENT LIMIT OF 50 EXCEEDED ***
      *
               MOVE 9 TO LANG-SETNUM
               MOVE 34 TO LANG-MSGNUM
               PERFORM 999-CATREAD
               MOVE MESSAGE-BUFFER TO DE1-PO-INV-COM(5)
               GO TO 61-SHOW-FORM1.

       61-INVOICE-COMMENTS-X.
           EXIT.

       611-CALC-DPODATAITM.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-O-REC.
           MOVE ITEM-SAVE-NO TO ITEMSEQNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY = EXTERNALLY-DESCRIBED-KEY
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "TINVCOM START2DPODATATITM" TO BU-DISPLAY-MSG
             GO TO 2100-BLOWUP.

       612-UNLOCK-DPODATAITM.
           MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY > PORCVNO OF DPODATAITM-O-REC
             INVALID KEY MOVE "00" TO FILE-STATUS.

       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
             MOVE LANG-SETNUM TO CATREAD-MSG-SET
             MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
