       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVDIAG.
       AUTHOR.        CR KALMAN.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  JUNE 1992.

      *D* * * * * * * * * * * * * * * * * * * *
      *D*     INVOICE DIAGNOSTIC PROGRAM.     *
      *D*                                     *
      *D*     THIS PROGRAM WILL MATCH         *
      *D*                                     *
      *D*     - DINVRCD     TO     DINVITM    *
      *D*                   AND    DPORECD    *
      *D*     - DINVITM     TO     DINVACCT   *
      *D*                   AND    DINVRCD    *
      *D*                   AND    DPOITEM    *
      *D*     - DINVACCT    TO     DINVITM    *
      *D*                                     *
      *D*     IT WILL PRINT OUT MESSAGES      *
      *D*     LISTING THE MISMATCHED RECORDS. *
      *D* * * * * * * * * * * * * * * * * * * *
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  JULY 03, 1996   CA YODER
      *C   RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

      ******************************************************************
       INPUT-OUTPUT SECTION.
      ******************************************************************

       FILE-CONTROL.
           SELECT DINVACCT-I
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVACCT-O
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-I
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-O
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-O
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-O
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-O
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT REPORT-O
                  ASSIGN TO DISK-DIAGRPT.

      ******************************************************************
       DATA DIVISION.
      ******************************************************************

       FILE SECTION.
       FD  DINVACCT-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2701.

       FD  DINVACCT-O
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2701.

       FD  DINVITM-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2601.

       FD  DINVITM-O
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2601.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2501.

       FD  DINVRCD-O
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2501.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1002.

       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1002.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       FD  DPORECD-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  REPORT-O
           DATA RECORD IS REPORT-REC
           RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS ARE OMITTED.
       01  REPORT-REC.
           05  RPT-CTL       PIC X.
           05  RPT-LINE      PIC X(132).

      ******************************************************************
       WORKING-STORAGE SECTION.
      ******************************************************************

      *-----------------------------------------------------------------
      *  A R G U M E N T   V A L U E S
      *-----------------------------------------------------------------

       01  ITEM-LINE-ARG.
           05  ITEM-ARG          PIC X(4).
           05  LINE-ARG          PIC X(2).
       01  PLT-ARG               PIC X(4).
       01  PO-ARG                PIC X(14).
       01  REG-ARG               PIC X(5).

      *-----------------------------------------------------------------
      *  S W I T C H E S
      *-----------------------------------------------------------------

       01  ACCT-DELETED-FLAG         PIC X.
           88  ALL-ACCT-DELETED      VALUE "Y".
       01  CHECK-DINVACCT            PIC X(1).
       01  CHECK-DINVITM             PIC X(1).
       01  CHECK-DINVRCD             PIC X(1).
       01  CURRENT-DATE.
           05  CURRENT-YY            PIC X(2).
           05  CURRENT-MM            PIC X(2).
           05  CURRENT-DD            PIC X(2).
       01  CURRENT-TIME.
           05  CURRENT-HR            PIC X(2).
           05  CURRENT-MIN           PIC X(2).
           05  CURRENT-SEC           PIC X(2).
       01  DELETE-FLAG               PIC X(1).
       01  EOF-DINVACCT              PIC X.
       01  EOF-DINVITM               PIC X.
       01  EOF-DINVRCD               PIC X.
       01  HDR-FLAG                  PIC X.
           88  HDR-MISSING           VALUE "Y".
       01  ITEM-FLAG                 PIC X.
           88  ITEM-MISSING          VALUE "Y".
       01  ITEMS-DELETED-FLAG        PIC X.
           88  ALL-ITEMS-DELETED     VALUE "Y".
       01  PO-FLAG                   PIC X.
           88  PO-MISSING            VALUE "Y".
       01  PO-ITEM-FLAG              PIC X.
           88 PO-ITEM-MISSING        VALUE "Y".
       01  PREV-LINE-WRITTEN         PIC X.
9406CK 01  SCOPE   PIC X.

      *-----------------------------------------------------------------
      *  A C C U M U L A T O R S
      *-----------------------------------------------------------------

       01  CURRENT-REG               PIC 9(5).
       01  DLT-DINVRCD-CNT           PIC 999.
       01  DLT-DINVITM-CNT           PIC 999.
       01  DLT-DINVACCT-CNT          PIC 999.
       01  INVOICE-REG.
           05  INVOICE-REG-9         PIC 9(5).
           05                        PIC X.
       01  LINE-COUNT                PIC 99.
       01  PAGE-COUNT                PIC 999.
       01  PRT-LOOP                  PIC 9.
       01  REG-DIFF                  PIC S9(5).

      *-----------------------------------------------------------------
      *  D A T A B A S E   A N D   F I L E   B U F F E R S
      *-----------------------------------------------------------------

       COPY DINVACCT IN COPYLIB.

       COPY DINVITM  IN COPYLIB.

       COPY DINVRCD  IN COPYLIB.

       COPY DPOITEM  IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

      *-----------------------------------------------------------------
      *  D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       COPY DATAB IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       COPY VCOMAREA IN COPYLIB.

      *-----------------------------------------------------------------
      *  U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP IN COPYLIB.

      *-----------------------------------------------------------------
      *  R E P O R T   P R I N T   L I N E S
      *-----------------------------------------------------------------

      *--PRINT LINES FOR REPORT-----------------------------------------

       01  PRT-HDG-1.
           05            PIC X(6).
           05  HDG-1-MM  PIC X(2).
           05            PIC X(1) VALUE "/".
           05  HDG-1-DD  PIC X(2).
           05            PIC X(1) VALUE "/".
           05  HDG-1-YY  PIC X(2).
           05            PIC X(39).
           05            PIC X(26)
               VALUE "INVOICE DIAGNOSTICS REPORT".
           05                PIC X(39).
           05                PIC X(8) VALUE "TINVDIAG".
           05                PIC X(6).

       01  PRT-HDG-2.
           05            PIC X(6).
           05  HDG-2-HR  PIC X(2).
           05            PIC X(1) VALUE ":".
           05  HDG-2-MIN PIC X(2).
           05            PIC X(1) VALUE ":".
           05  HDG-2-SEC PIC X(2).
           05            PIC X(42).
           05            PIC X(4) VALUE "FOR ".
           05  HDG-2-PLT PIC X(15).
           05            PIC X(43).
           05            PIC X(5) VALUE "PAGE ".
           05  HDG-2-PG  PIC ZZ9.
           05            PIC X(6).

       01  PRT-HDG-3.
           05                PIC X(20).
           05                PIC X(16) VALUE "ERRORS FOUND IN ".
           05  HDG-3-TITLE   PIC X(8).
           05                PIC X(5).
           05  HDG-3-MSG     PIC X(20) VALUE SPACES.
           05                PIC X(88).

       01  PRT-HDG-4.
           05                PIC X(20).
           05                PIC X(08) VALUE "REGISTER".
           05                PIC X(5).
           05                PIC X(4)  VALUE "ITEM".
           05                PIC X(5).
           05                PIC X(14) VALUE "PURCHASE ORDER".
           05                PIC X(5).
           05                PIC X(13) VALUE "ERROR MESSAGE".
           05                PIC X(58).

       01  PRT-HDG-4U.
           05                PIC X(20).
           05                PIC X(08) VALUE ALL "-".
           05                PIC X(5).
           05                PIC X(4)  VALUE ALL "-".
           05                PIC X(5).
           05                PIC X(14) VALUE ALL "-".
           05                PIC X(5).
           05                PIC X(50) VALUE ALL "-".
           05                PIC X(30).

       01  PRT-DTL-1.
           05                     PIC X(21).
           05  DTL-1-REG          PIC X(5).
           05                     PIC X(7).
           05  DTL-1-ITEM         PIC X(4).
           05                     PIC X(5).
           05  DTL-1-PO           PIC X(14).
           05                     PIC X(5).
           05  DTL-1-MSG          PIC X(50).
           05                     PIC X(21).

       01  PRT-DTL-2.
           05                     PIC X(8) VALUE "DELETED ".
           05  DTL-2-DLT          PIC ZZ9.
           05  DTL-2-FILE         PIC X(9).

       01  PRT-DTL-3.
           05  DTL-3-MSG1         PIC X(20).
           05  DTL-3-MSG2         PIC X(30).
      ******************************************************************
       PROCEDURE DIVISION.
      ******************************************************************
      *----------------------------------------------------------------
       MAIN SECTION.
      *----------------------------------------------------------------

       MAINLINE.
           PERFORM 1-HSK.

           DISPLAY "1 (OF 4) CHECK DINVRCD?  (Y/N):".
           ACCEPT CHECK-DINVRCD.
           DISPLAY "2 (OF 4) CHECK DINVITM?  (Y/N):".
           ACCEPT CHECK-DINVITM.
           DISPLAY "3 (OF 4) CHECK DINVACCT? (Y/N):".
           ACCEPT CHECK-DINVACCT.
           DISPLAY "4 (OF 4) DELETE BAD RECORDS? (Y/N):".
           ACCEPT DELETE-FLAG

           IF DELETE-FLAG  = "Y" OR "y"
              MOVE "DELETE IN EFFECT    " TO HDG-3-MSG
           ELSE
              MOVE "DELETE NOT IN EFFECT" TO HDG-3-MSG.

           IF CHECK-DINVRCD  = "Y" OR "y"
              PERFORM 6-DINVRCD.
           IF CHECK-DINVITM  = "Y" OR "y"
              PERFORM 6-DINVITM.
           IF CHECK-DINVACCT = "Y" OR "y"
              PERFORM 6-DINVACCT.

           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT   DINVACCT-I     DINVITM-I    DINVRCD-I
                        DPOITEM-I      DPORECD-I    MPLTINFO-I.
           OPEN I-O     DINVACCT-O     DINVITM-O    DINVRCD-O.
           OPEN OUTPUT  REPORT-O.

           ACCEPT CURRENT-DATE FROM DATE.
           ACCEPT CURRENT-TIME FROM TIME.

           MOVE CURRENT-MM TO HDG-1-MM.
           MOVE CURRENT-DD TO HDG-1-DD.
           MOVE CURRENT-YY TO HDG-1-YY.
           MOVE CURRENT-HR TO HDG-2-HR.
           MOVE CURRENT-MIN TO HDG-2-MIN.
           MOVE CURRENT-SEC TO HDG-2-SEC.

           MOVE "P 01" TO PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           IF MPLTINFO-COMPANY = "126"
              MOVE "DANVILLE" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "129"
              MOVE "UNION CITY" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "153"
              MOVE "LAWTON" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "131"
              MOVE "GADSDEN" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "133"
              MOVE "TOPEKA" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "629"
              MOVE "VALLEYFIELD" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "155"
              MOVE "ASHEBORO" TO HDG-2-PLT.
           IF MPLTINFO-COMPANY = "120"
              MOVE "SPARTANBURG" TO HDG-2-PLT.

           MOVE "PREG" TO PLT-ARG.
           PERFORM 9999-READ-MPLTINFO-I.
           MOVE MPLTINFO-REGNUM TO CURRENT-REG.

           MOVE "N" TO EOF-DINVACCT.
           MOVE "N" TO EOF-DINVITM.
           MOVE "N" TO EOF-DINVRCD.

       2-EOJ.
           CLOSE   DINVACCT-I   DINVACCT-O     DINVITM-I
                   DINVITM-O    DINVRCD-I      DINVRCD-O
                   DPOITEM-I    DPORECD-I      REPORT-O.

       4-WRITE-HDGS.
           ADD 1 TO PAGE-COUNT.
           MOVE PAGE-COUNT TO HDG-2-PG.

           MOVE 0 TO RPT-CTL.
           MOVE PRT-HDG-1 TO RPT-LINE.
           WRITE REPORT-REC.

           MOVE 1 TO RPT-CTL.
           MOVE PRT-HDG-2 TO RPT-LINE.
           WRITE REPORT-REC.

           MOVE 3 TO RPT-CTL.
           MOVE PRT-HDG-3 TO RPT-LINE.
           WRITE REPORT-REC.

           MOVE 1 TO RPT-CTL.
           MOVE PRT-HDG-4 TO RPT-LINE.
           WRITE REPORT-REC.

           MOVE 1 TO RPT-CTL.
           MOVE PRT-HDG-4U TO RPT-LINE.
           WRITE REPORT-REC.

           MOVE 7 TO LINE-COUNT.

       6-DINVRCD.
           MOVE "DINVRCD " TO HDG-3-TITLE.
           MOVE 60 TO LINE-COUNT.

           PERFORM 9999-START-DINVRCD-I.
           PERFORM 9999-READ-NEXT-DINVRCD-I.
           PERFORM UNTIL EOF-DINVRCD = "Y"

              INITIALIZE PO-FLAG  ITEM-FLAG
                 DLT-DINVRCD-CNT  DLT-DINVITM-CNT  DLT-DINVACCT-CNT
              MOVE "N" TO PREV-LINE-WRITTEN
              MOVE INV-REG-NO TO REG-ARG
              MOVE INV-PO-RCV-NO TO PO-ARG

              PERFORM 9999-READ-DPORECD-I
              IF FILE-STATUS-1 = "2"
                 SET PO-MISSING TO TRUE
                 IF LINE-COUNT > 59
                    PERFORM 4-WRITE-HDGS
                 END-IF
                 MOVE "1" TO RPT-CTL
                 MOVE SPACES TO PRT-DTL-1
                 MOVE INV-REG-NO TO DTL-1-REG
                 MOVE PO-ARG TO DTL-1-PO
                 MOVE "NO PO FOUND" TO DTL-1-MSG
                 MOVE PRT-DTL-1 TO RPT-LINE
                 WRITE REPORT-REC
                 ADD 1 TO LINE-COUNT
                 MOVE "Y" TO PREV-LINE-WRITTEN
              END-IF

              IF INV-STATUS NOT = "H " AND NOT = "I "
                 AND CE1-CODE NOT = "A"
                 MOVE REG-ARG TO REGISTERNO OF DINVITM-I-REC
                 START DINVITM-I KEY = REGISTERNO OF DINVITM-I-REC
                 INVALID KEY
                    IF FILE-STATUS-1 = "2"
                       SET ITEM-MISSING TO TRUE
                       IF LINE-COUNT > 59
                          PERFORM 4-WRITE-HDGS
                       END-IF
                       MOVE "1" TO RPT-CTL
                       MOVE SPACES TO PRT-DTL-1
                       IF PREV-LINE-WRITTEN = "N"
                          MOVE REG-ARG TO DTL-1-REG
                          MOVE PO-ARG TO DTL-1-PO
                       END-IF
                       MOVE "NO DINVITM FOUND" TO DTL-1-MSG
                       MOVE PRT-DTL-1 TO RPT-LINE
                       WRITE REPORT-REC
                       ADD 1 TO LINE-COUNT
                    END-IF
                 END-START
              END-IF

              IF DELETE-FLAG = "Y" OR "y"

              IF PO-MISSING OR ITEM-MISSING

                 PERFORM 9999-READ-DINVRCD-O
                 DELETE DINVRCD-O
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-DELETE
                 IF FILE-STATUS NOT = "00"
                    MOVE "DELETE DINVRCD*6-DINVRCD" TO BU-DISPLAY-MSG
                    MOVE REG-ARG TO BU-DISPLAY-FLD(1)
                    GO TO 9999-BLOWUP
                 END-IF
                 ADD 1 TO DLT-DINVRCD-CNT

                 IF NOT ITEM-MISSING
                    MOVE REG-ARG TO REGISTERNO OF DINVITM-O-REC
                    START DINVITM-O KEY = REGISTERNO OF DINVITM-O-REC
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                    END-START
                    INITIALIZE ITEMS-DELETED-FLAG
                    READ DINVITM-O NEXT INTO BUF-DINVITM
                       AT END SET ALL-ITEMS-DELETED TO TRUE
                    END-READ
                    PERFORM UNTIL ALL-ITEMS-DELETED
                       IF INVITM-REG-NO = REG-ARG
                          DELETE DINVITM-O
                             INVALID KEY
                             MOVE "DELETE DINVITM*6-DINVRCD"
                                TO BU-DISPLAY-MSG
                             MOVE INVITM-REG-NO TO BU-DISPLAY-FLD(1)
                             MOVE INVITM-ITEM-NO TO BU-DISPLAY-FLD(2)
                             GO TO 9999-BLOWUP
                          END-DELETE
                          ADD 1 TO DLT-DINVITM-CNT
                       ELSE
                          SET ALL-ITEMS-DELETED TO TRUE
                       END-IF
                       READ DINVITM-O NEXT INTO BUF-DINVITM
                          AT END SET ALL-ITEMS-DELETED TO TRUE
                       END-READ
                    END-PERFORM
                 END-IF

                 MOVE REG-ARG TO REGISTERNO OF DINVACCT-O-REC
                 START DINVACCT-O KEY = REGISTERNO OF DINVACCT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
                 INITIALIZE ACCT-DELETED-FLAG
                 READ DINVACCT-O NEXT INTO BUF-DINVACCT
                    AT END SET ALL-ACCT-DELETED TO TRUE
                 END-READ
                 PERFORM UNTIL ALL-ACCT-DELETED
                    IF INVACCT-REG-NO = REG-ARG
                       DELETE DINVACCT-O
                          INVALID KEY
                          MOVE "DELETE DINVACCT*6-DINVRCD"
                             TO BU-DISPLAY-MSG
                          MOVE INVACCT-REG-NO TO BU-DISPLAY-FLD(1)
                          MOVE INVACCT-ITEM-LINE TO BU-DISPLAY-FLD(2)
                          GO TO 9999-BLOWUP
                       END-DELETE
                       ADD 1 TO DLT-DINVACCT-CNT
                    ELSE
                       SET ALL-ACCT-DELETED TO TRUE
                    END-IF
                    READ DINVACCT-O NEXT INTO BUF-DINVACCT
                       AT END SET ALL-ACCT-DELETED TO TRUE
                    END-READ
                 END-PERFORM

                 INITIALIZE PRT-LOOP
                 PERFORM UNTIL PRT-LOOP = 3
                    ADD 1 TO PRT-LOOP
                    IF LINE-COUNT > 59
                       PERFORM 4-WRITE-HDGS
                    END-IF
                    MOVE "1" TO RPT-CTL
                    MOVE SPACES TO PRT-DTL-1
                    IF PRT-LOOP = 1
                       MOVE " DINVRCD " TO DTL-2-FILE
                       MOVE DLT-DINVRCD-CNT TO DTL-2-DLT
                    END-IF
                    IF PRT-LOOP = 2
                       MOVE " DINVITM " TO DTL-2-FILE
                       MOVE DLT-DINVITM-CNT TO DTL-2-DLT
                    END-IF
                    IF PRT-LOOP = 3
                       MOVE " DINVACCT" TO DTL-2-FILE
                       MOVE DLT-DINVACCT-CNT TO DTL-2-DLT
                    END-IF
                    MOVE PRT-DTL-2 TO DTL-1-MSG
                    MOVE PRT-DTL-1 TO RPT-LINE
                    WRITE REPORT-REC
                    ADD 1 TO LINE-COUNT
                 END-PERFORM

              END-IF
              END-IF

              PERFORM 9999-READ-NEXT-DINVRCD-I
           END-PERFORM.

       6-DINVITM.
           MOVE "DINVITM " TO HDG-3-TITLE.
           MOVE 60 TO LINE-COUNT.

           PERFORM 9999-START-DINVITM-I.
           PERFORM 9999-READ-NEXT-DINVITM-I.

           PERFORM UNTIL EOF-DINVITM = "Y"

              MOVE INVITM-REG-NO TO REG-ARG INVOICE-REG
              MOVE INVITM-ITEM-NO TO ITEM-ARG
              MOVE "N" TO PREV-LINE-WRITTEN
              INITIALIZE  PO-ITEM-FLAG  HDR-FLAG
                 DLT-DINVITM-CNT  DLT-DINVACCT-CNT

              PERFORM 9999-READ-DINVRCD-I
              IF FILE-STATUS-1 = "2"
                 IF LINE-COUNT > 59
                    PERFORM 4-WRITE-HDGS
                 END-IF
                 MOVE "1" TO RPT-CTL
                 MOVE SPACES TO PRT-DTL-1
                 MOVE SPACES TO PRT-DTL-3
                 MOVE REG-ARG TO DTL-1-REG
                 MOVE INVITM-ITEM-NO TO DTL-1-ITEM
                 MOVE "UNKNOWN" TO DTL-1-PO
                 MOVE "NO DINVRCD FOUND" TO DTL-3-MSG1
                 SUBTRACT CURRENT-REG FROM INVOICE-REG-9 GIVING REG-DIFF
                 IF REG-DIFF < 0
                    MULTIPLY -1 BY REG-DIFF
                 END-IF
                 IF REG-DIFF < 10
                    MOVE "MAYBE IN PROCESS--NO DELETE"
                       TO DTL-3-MSG2
                 ELSE
                    SET HDR-MISSING TO TRUE
                 END-IF
                 MOVE PRT-DTL-3 TO DTL-1-MSG
                 MOVE PRT-DTL-1 TO RPT-LINE
                 WRITE REPORT-REC
                 ADD 1 TO LINE-COUNT
                 MOVE "Y" TO PREV-LINE-WRITTEN
              ELSE

                 MOVE INV-PO-RCV-NO TO PO-ARG
                 PERFORM 9999-READ-DPOITEM-I
                 IF FILE-STATUS-1 = "2"
                    SET PO-ITEM-MISSING TO TRUE
                    IF LINE-COUNT > 59
                       PERFORM 4-WRITE-HDGS
                    END-IF
                    MOVE "1" TO RPT-CTL
                    MOVE SPACES TO PRT-DTL-1
                    MOVE REG-ARG TO DTL-1-REG
                    MOVE ITEM-ARG TO DTL-1-ITEM
                    MOVE PO-ARG TO DTL-1-PO
                    MOVE "NO DPOITEM FOUND" TO DTL-1-MSG
                    MOVE PRT-DTL-1 TO RPT-LINE
                    WRITE REPORT-REC
                    ADD 1 TO LINE-COUNT
                    MOVE "Y" TO PREV-LINE-WRITTEN
                 ELSE

                    IF INVITM-CORPCODE NOT = ITM-CORP-CODE
                       IF LINE-COUNT > 59
                          PERFORM 4-WRITE-HDGS
                       END-IF
                       MOVE "1" TO RPT-CTL
                       MOVE SPACES TO PRT-DTL-1
                       MOVE REG-ARG TO DTL-1-REG
                       MOVE ITEM-ARG TO DTL-1-ITEM
                       MOVE PO-ARG TO DTL-1-PO
                       MOVE "DPOITEM CORP CODE DOESN'T MATCH--CHECK MANU
      -                     "ALLY" TO DTL-1-MSG
                       MOVE PRT-DTL-1 TO RPT-LINE
                       WRITE REPORT-REC
                       ADD 1 TO LINE-COUNT
                       MOVE "Y" TO PREV-LINE-WRITTEN
                    END-IF
                 END-IF
              END-IF

              MOVE REG-ARG TO REGISTERNO OF DINVACCT-I-REC
              MOVE SPACES TO ITEMSEQNO OF DINVACCT-I-REC
              MOVE ITEM-ARG TO ITEMSEQNO OF DINVACCT-I-REC
              START DINVACCT-I KEY > REGISTERNO OF DINVACCT-I-REC,
                                     ITEMSEQNO  OF DINVACCT-I-REC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-START
              PERFORM 9999-READ-NEXT-DINVACCT-I
              IF INVACCT-REG-NO NOT = REG-ARG OR
                 INVACCT-ITEM   NOT = ITEM-ARG
                 IF LINE-COUNT > 59
                    PERFORM 4-WRITE-HDGS
                 END-IF
                 MOVE "1" TO RPT-CTL
                 MOVE SPACES TO PRT-DTL-1
                 IF PREV-LINE-WRITTEN = "N"
                    MOVE REG-ARG TO DTL-1-REG
                    MOVE ITEM-ARG TO DTL-1-ITEM
                    MOVE PO-ARG TO DTL-1-PO
                 END-IF
                 MOVE "NO DINVACCT FOUND--ADD MANUALLY IF NEEDED"
                    TO DTL-1-MSG
                 MOVE PRT-DTL-1 TO RPT-LINE
                 WRITE REPORT-REC
                 ADD 1 TO LINE-COUNT
              END-IF

              IF DELETE-FLAG = "Y" OR "y"

              IF HDR-MISSING OR PO-ITEM-MISSING

                 PERFORM 9999-READ-DINVITM-O
                 DELETE DINVITM-O INVALID KEY
                    MOVE "DELETE DINVITM*6-DINVITM" TO BU-DISPLAY-MSG
                    MOVE REG-ARG TO BU-DISPLAY-FLD(1)
                    MOVE ITEM-ARG TO BU-DISPLAY-FLD(2)
                    GO TO 9999-BLOWUP
                 END-DELETE
                 ADD 1 TO DLT-DINVITM-CNT

                 MOVE REG-ARG TO REGISTERNO OF DINVACCT-O-REC
                 START DINVACCT-O KEY = REGISTERNO OF DINVACCT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
                 INITIALIZE ACCT-DELETED-FLAG
                 READ DINVACCT-O NEXT INTO BUF-DINVACCT
                    AT END SET ALL-ACCT-DELETED TO TRUE
                 END-READ
                 PERFORM UNTIL ALL-ACCT-DELETED
                    IF INVACCT-REG-NO = REG-ARG
                       AND INVACCT-ITEM = ITEM-ARG
                       DELETE DINVACCT-O    INVALID KEY
                          MOVE "DELETE DINVACCT*6-DINVRCD"
                             TO BU-DISPLAY-MSG
                          MOVE INVACCT-REG-NO TO BU-DISPLAY-FLD(1)
                          MOVE INVACCT-ITEM-LINE TO BU-DISPLAY-FLD(2)
                          GO TO 9999-BLOWUP
                       END-DELETE
                       ADD 1 TO DLT-DINVACCT-CNT
                    ELSE
                       SET ALL-ACCT-DELETED TO TRUE
                    END-IF
                    READ DINVACCT-O NEXT INTO BUF-DINVACCT
                       AT END SET ALL-ACCT-DELETED TO TRUE
                    END-READ
                 END-PERFORM

                 INITIALIZE PRT-LOOP
                 PERFORM UNTIL PRT-LOOP = 2
                    ADD 1 TO PRT-LOOP
                    IF LINE-COUNT > 59
                       PERFORM 4-WRITE-HDGS
                    END-IF
                    MOVE "1" TO RPT-CTL
                    MOVE SPACES TO PRT-DTL-1
                    IF PRT-LOOP = 1
                       MOVE " DINVITM " TO DTL-2-FILE
                       MOVE DLT-DINVITM-CNT TO DTL-2-DLT
                    END-IF
                    IF PRT-LOOP = 2
                       MOVE " DINVACCT" TO DTL-2-FILE
                       MOVE DLT-DINVACCT-CNT TO DTL-2-DLT
                    END-IF
                    MOVE PRT-DTL-2 TO DTL-1-MSG
                    MOVE PRT-DTL-1 TO RPT-LINE
                    WRITE REPORT-REC
                    ADD 1 TO LINE-COUNT
                 END-PERFORM

              END-IF
              END-IF

      * PUT IF STATMENT HERE TO ADD MISSING DINVACCT

              PERFORM 9999-READ-NEXT-DINVITM-I
           END-PERFORM.

       6-DINVACCT.
           MOVE "DINVACCT" TO HDG-3-TITLE.
           MOVE 60 TO LINE-COUNT.

           PERFORM 9999-START-DINVACCT-I.
           PERFORM 9999-READ-NEXT-DINVACCT-I.

           PERFORM UNTIL EOF-DINVACCT = "Y"

              INITIALIZE ITEM-FLAG  DLT-DINVACCT-CNT
              MOVE INVACCT-REG-NO TO REG-ARG
              MOVE INVACCT-ITEM TO ITEM-ARG
              MOVE INVACCT-LINE TO LINE-ARG

              PERFORM 9999-READ-DINVITM-I
              IF FILE-STATUS-1 = "2"
                 SET ITEM-MISSING TO TRUE
                 IF LINE-COUNT > 59
                    PERFORM 4-WRITE-HDGS
                 END-IF
                 MOVE "1" TO RPT-CTL
                 MOVE SPACES TO PRT-DTL-1
                 MOVE REG-ARG TO DTL-1-REG
                 MOVE ITEM-ARG TO DTL-1-ITEM
                 MOVE LINE-ARG TO DTL-1-PO
                 MOVE "NO DINVITM FOUND" TO DTL-1-MSG
                 MOVE PRT-DTL-1 TO RPT-LINE
                 WRITE REPORT-REC
                 ADD 1 TO LINE-COUNT
              END-IF

              IF DELETE-FLAG = "Y" OR "y"

              IF ITEM-MISSING

                 PERFORM 9999-READ-DINVACCT-O
                 DELETE DINVACCT-O INVALID KEY
                    MOVE "DELETE DINVACCT*6-DINVACCT" TO BU-DISPLAY-MSG
                    MOVE REG-ARG TO BU-DISPLAY-FLD(1)
                    MOVE ITEM-LINE-ARG TO BU-DISPLAY-FLD(2)
                    GO TO 9999-BLOWUP
                 END-DELETE
                 ADD 1 TO DLT-DINVACCT-CNT

                 IF LINE-COUNT > 59
                    PERFORM 4-WRITE-HDGS
                 END-IF
                 MOVE "1" TO RPT-CTL
                 MOVE SPACES TO PRT-DTL-1
                 MOVE " DINVACCT" TO DTL-2-FILE
                 MOVE DLT-DINVACCT-CNT TO DTL-2-DLT
                 MOVE PRT-DTL-2 TO DTL-1-MSG
                 MOVE PRT-DTL-1 TO RPT-LINE
                 WRITE REPORT-REC
                 ADD 1 TO LINE-COUNT

              END-IF
              END-IF

              PERFORM 9999-READ-NEXT-DINVACCT-I
           END-PERFORM.

       6-MAIN-X.
           EXIT.

       9999-UTILITY SECTION.

       9999-BLOWUP.
           MOVE "TINVGEN" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-FLDS.

       9999-READ-DINVACCT-O.
           MOVE REG-ARG TO REGISTERNO OF DINVACCT-O-REC.
           MOVE ITEM-LINE-ARG TO ITEMSEQNO OF DINVACCT-O-REC.
           READ DINVACCT-O INTO BUF-DINVACCT
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DINVACCT*9999-RDO" TO BU-DISPLAY-MSG
                 MOVE REG-ARG TO BU-DISPLAY-FLD (1)
                 MOVE ITEM-ARG TO BU-DISPLAY-FLD (2)
                 MOVE LINE-ARG TO BU-DISPLAY-FLD (3)
                 GO TO 9999-BLOWUP.

       9999-READ-DINVITM-I.
           MOVE REG-ARG TO REGISTERNO OF DINVITM-I-REC.
           MOVE ITEM-ARG TO ITEMNO OF DINVITM-I-REC.
           READ DINVITM-I INTO BUF-DINVITM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DINVITM*9999-RDI" TO BU-DISPLAY-MSG
                 MOVE REG-ARG TO BU-DISPLAY-FLD (1)
                 MOVE ITEM-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-DINVITM-O.
           MOVE REG-ARG TO REGISTERNO OF DINVITM-O-REC.
           MOVE ITEM-ARG TO ITEMNO OF DINVITM-O-REC.
           READ DINVITM-O INTO BUF-DINVITM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DINVITM*9999-RDO" TO BU-DISPLAY-MSG
                 MOVE REG-ARG TO BU-DISPLAY-FLD (1)
                 MOVE ITEM-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-DINVRCD-I.
           MOVE REG-ARG TO REGISTERNO OF DINVRCD-I-REC.
           READ DINVRCD-I INTO BUF-DINVRCD
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DINVRCD*9999-RDI" TO BU-DISPLAY-MSG
                 MOVE REG-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-DINVRCD-O.
           MOVE REG-ARG TO REGISTERNO OF DINVRCD-O-REC.
           READ DINVRCD-O INTO BUF-DINVRCD
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DINVRCD*9999-RDO" TO BU-DISPLAY-MSG
                 MOVE REG-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-DPOITEM-I.
           MOVE PO-ARG   TO PORCVNO OF DPOITEM-I-REC.
           MOVE ITEM-ARG TO ITEMNO  OF DPOITEM-I-REC.
           READ DPOITEM-I INTO BUF-DPOITEM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DPOITEM*9999-RDI" TO BU-DISPLAY-MSG
                 MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                 MOVE ITEM-ARG TO BU-DISPLAY-FLD (2)
                 GO TO 9999-BLOWUP.

       9999-READ-DPORECD-I.
           MOVE PO-ARG      TO PORCVNO OF DPORECD-I-REC.
           READ DPORECD-I INTO BUF-DPORECD
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "READ DPORECD*9999-RDI" TO BU-DISPLAY-MSG
                 MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 9999-BLOWUP.

       9999-READ-MPLTINFO-I.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ MPLTINFO*9999-RMI" TO BU-DISPLAY-MSG
              MOVE PLT-ARG TO BU-DISPLAY-FLD (1)
              GO TO 9999-BLOWUP.

       9999-READ-NEXT-DINVACCT-I.
           READ DINVACCT-I NEXT INTO BUF-DINVACCT
              AT END MOVE "Y" TO EOF-DINVACCT.

       9999-READ-NEXT-DINVITM-I.
           READ DINVITM-I NEXT INTO BUF-DINVITM
              AT END MOVE "Y" TO EOF-DINVITM.

       9999-READ-NEXT-DINVRCD-I.
           READ DINVRCD-I NEXT INTO BUF-DINVRCD
              AT END MOVE "Y" TO EOF-DINVRCD.

       9999-START-DINVACCT-I.
           MOVE LOW-VALUES TO REGISTERNO OF DINVACCT-I-REC.
           START DINVACCT-I KEY > REGISTERNO OF DINVACCT-I-REC
              INVALID KEY
                 MOVE "START DINVACCT*6-M" TO BU-DISPLAY-MSG
                 MOVE FILE-STATUS TO BU-DISPLAY-FLD(1).

       9999-START-DINVITM-I.
           MOVE LOW-VALUES TO REGISTERNO OF DINVITM-I-REC.
           START DINVITM-I KEY > REGISTERNO OF DINVITM-I-REC
              INVALID KEY
                 MOVE "START DINVITM*6-M" TO BU-DISPLAY-MSG
                 MOVE FILE-STATUS TO BU-DISPLAY-FLD(1).

       9999-START-DINVRCD-I.
           MOVE LOW-VALUES TO REGISTERNO OF DINVRCD-I-REC.
           START DINVRCD-I KEY > REGISTERNO OF DINVRCD-I-REC
              INVALID KEY
                 MOVE "START DINVRCD*6-M" TO BU-DISPLAY-MSG
                 MOVE FILE-STATUS TO BU-DISPLAY-FLD(1).

       9999-UTILITY-X.
           EXIT.
