       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVOICE.
       AUTHOR.        LS BAKER/ KURT MOVSESIAN.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  APRIL 19, 1983.

      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*     INVOICE PROCESSING.                                     *
      *D*                                                             *
      *D*     THIS PROGRAM IS THE INVOICE CREATE PROGRAM THAT ACCEPTS *
      *D*     INVOICE DATA AND USES PO AND RECEIVING SLIP INFORMATION *
      *D*     TO VERIFY THE INVOICE INFORMATION.                      *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C* CHANGES
      *C*
      *C* JUNE 1992   CR KALMAN
      *C* ADDED A WARNING MESSAGE THAT REQUIRES THE USER TO CONFIRM
      *C* THEY WANT TO MANUALY ENTER AN INVOICE AGAINST AN
      *C* INVOICELESS PO.
      *C*
      *C* JULY 21, 1992  CR KALMAN   REQUEST: 6195
      *C* ADDED EDIT TO MAKE SURE THAT AN ITEM IS NOT ENTERED
      *C* WITH ZERO DOLLARS.
      *C*
      *C* JULY 22, 1992  CR KALMAN   REQUEST:
      *C* ADDED CODE TO STOP THE USER FROM PAYING AN INVOICE AGAINST
      *C* A REQUIREMENT ORDER.  THIS CAN BE OVERRIDDEN BY SETTING
      *C* MPLTINFO-INV-REQ-PO TO "X" (ON "PREG"). CHANGING IT TO "X"
      *C* WILL ALLOW THE PLANT TO PAY INVOICES AGAINST REQUIREMENT
      *C* ORDERS.
      *C*
      *C* NOVEMBER 6, 1992  CR KALMAN  REQUEST: 6268
      *C* ADDED CODE TO LOWER ACCRUED TAXES BY THE DISCOUNT AMOUNT
      *C* IF THE DISCOUNT TAX SWITCH IN MPLTINFO IS EQUAL TO "Y".
      *C* THE DISCOUNTED ACCRUED TAX AMOUNTS WILL SHOW UP ON INV-8.
      *C*
      *C* NOVEMBER 25, 1992    CR  KALMAN   REQ: 6195
      *C* MODIFIED THE EDIT MADE JULY 1, 1992 TO JUST GIVE USER
      *C* A WARNING THAT AN ITEM IS BEING ENTERED WITH ZERO DOLLARS
      *C* INSTEAD OF TOTALLY STOPPING THEM FROM CONTINUING. CAN
      *C* OVERRIDE WARNING BY PRESSING F2.
      *C*
      *C* DECEMBER 04, 1992    CR  KALMAN   NO REQ (AS/400 ONLY)
      *C* LOCKING PROBLEM WAS OCCURING WHEN TRYING TO RESTART AN
      *C* ALREADY PROCESSED INVOICE AND THEN ENTERING TINVMOD
      *C* IMMEDIATELY AFTER.  ADDED HIGH-VALUE START IN
      *C* 631-GET-DINVRCD-LOOP TO FIX PROBLEM.
      *C*
      *C* FEBRUARY 22, 1993    CR  KALMAN   NO REQ (AS/400 ONLY)
      *C* (SEE CHANGE 11/6/92) ACCRUED TAXES WERE BEING LOWERED BY
      *C* THE DISCOUNT AMOUNT FROM THE PO TERMS ONLY. IF USER CHANGED
      *C* TERMS ON INVOICE, THE PO TERMS WERE STILL BEING USED TO
      *C* DISCOUNT ACCRUED TAXES. CHANGED THE PROGRAM TO USE THE TERMS
      *C* IN INV-TERMS FIELD AT THE TIME OF TAX CALCULATION.
      *C*
      *C* CR KALMAN        4/26/94            REQUEST 6490
      *C* REMOVED PORTABLILITY COPYLIBS.
      *C*
      *C* CR KALMAN        5/02/94
      *C* (SEE CHANGE 11/6/92) ACCRUED TAXES WERE NOT BEING PROPERLY
      *C* CALCULATED BECAUSE OF A ROUNDING ERROR. ADDED "ROUNDED"
      *C* PARM TO DISCOUNTED TAX CALCUATION IN 681-GET-ACCRUED-TAX.
      *C*
      *C* CA YODER        12/20/95
      *C* ADDED LOGIC TO AUTOMATICALLY RESET MPLTINFO REGISTER NUMBER
      *C* TO 00001 WHEN THE MAXIMUM NUMBER (99999) IS REACHED.
      *C*
      *C* CA YODER        05/08/96       REQ #94-005
      *C* ALLOWED FOR THE CURRENCY CODE TO BE CHANGED FROM THE PO
      *C* CURRENCY CODE.  THIS IS ONLY PERMITTED IF THE NEW CURRENCY
      *C* IS THE HOME CURRENCY CODE AND THE INVOICE IS A NO-CHECK
      *C* INVOICE.
      *C*
      *C* CA YODER        07/12/96
      *C* MODIFIED FOR CENTURY DATABASE CHANGES.
      *C*
      *C* CA YODER        11/13/96
      *C* IF THE PO FIELD WAS LEFT BLANK ON THE "INV-1" SCREEN,
      *C* THE PROGRAM WOULD BLOW UP.  CORRECTED TO DISPLAY A
      *C* MESSAGE INSTEAD.
      *C*
      *C* CA YODER        03/18/97
      *C* DUPLICATE INVOICES WERE NOT BEING CAUGHT IF THE USER WAS
      *C* CONTINUING AN INVOICE ON HOLD.  ADDED LOGIC TO CHECK FOR
      *C* DUPLICATES IN THIS SITUATION.
      *C*
      *C* CA YODER        05/15/97
      *C* ADDED LOGIC TO NOT ALLOW PAYMENT FOR A NON-PAYABLE PO
      *C* (PO FOR STOREROOM ITEMS FOR A FRANCHISE VENDOR).
      *C*
      *C* 06/02/99   CA YODER   (DECATUR REQUEST)
      *C*   EXPANDED TAX RATE PERCENTAGE FROM 2 DECIMAL
      *C*   PLACES TO 4, SO SEVERAL FIELDS HAD TO BE ADJUSTED
      *C*   TO ACCOMMODATE THE CHANGE.
      *C*
      *C* 06/14/99   CA YODER
      *C*   CHANGED OVERRIDE VENDOR SCREEN TO ACCEPT ALPHANUMERIC
      *C*   VENDOR CODES SINCE SYNERGY SAP R/3 NOW GENERATING
      *C*   REMIT-TO VENDOR CODES PREFIXED WITH AN "S".
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
          I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TAXGST-FILE        ASSIGN TO DISK-TAXGST
                                     FILE STATUS IS FILE-STATUS.
           SELECT  SORT-FILE  ASSIGN TO  DISK-SORT.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVOICE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-PK-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MPORCV-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-O
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOITEM-O
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-O-REG
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-O-PO
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-O-INV
                  ASSIGN TO DATABASE-MCFLCS2504
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-O
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-I
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVACCT-O
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOFREIGHT-O
                  ASSIGN TO DATABASE-MCFLCS2401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MTAX-I
                  ASSIGN TO DATABASE-MCFLCS3701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MVALIDPLTDTA-I
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  TAXGST-FILE
           RECORD CONTAINS 80 CHARACTERS.
       01  TAXGST-RECORD             PIC X(80).
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC          PIC X(1000).
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0101.
       FD  DPORECD-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0901.
       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1002.
       FD  DPOITEM-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1002.
       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.
       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0701.
       FD  DINVRCD-O-REG
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-O-REC-REG.
           COPY DDS-ALL-FORMATS OF MCFLCS2501.
       FD  DINVRCD-O-PO
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-O-REC-PO.
           COPY DDS-ALL-FORMATS OF MCFLCS2502.
       FD  DINVRCD-O-INV
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-O-REC-INV.
           COPY DDS-ALL-FORMATS OF MCFLCS2504.
       FD  DINVITM-O
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2601.
       FD  DINVITM-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2601.
       FD  DINVACCT-O
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2701.
       FD  MVALIDPLTDTA-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDTA-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1701.
       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0401.
       FD  MTAX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS3701.
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.
       FD  DPOFREIGHT-O
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2401.
       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1601.
       SD  SORT-FILE
           RECORD CONTAINS  4  CHARACTERS.
       01  SORT-RCD.
           05  SD-ITEM-NO            PIC 9(4).

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X   VALUE "0".
       77  DBOPEN-SW            PIC X           VALUE "N".
       77  CALC-ADDRESS         PIC S9(9)       VALUE ZERO COMP-4.
       77  INVITM-ADDR          PIC S9(9)       VALUE ZERO COMP-4.
       77  READ-CTR             PIC S9(4)       VALUE ZERO COMP-4.
       77  GST-ENTRY            PIC S9          VALUE ZERO BINARY.
       77  SUB                  PIC S9(3)       VALUE ZERO BINARY.
       77  INV-GST-TAX          PIC S9(11)V9(4) VALUE ZERO BINARY.
       77  PO-GST-TAX           PIC S9(11)V9(4) VALUE ZERO BINARY.
       77  GST-AMOUNT           PIC S9(11)V9(2) VALUE ZERO BINARY.
       01  SAVE-TAX-CODE             PIC X(2)     VALUE SPACES.
       01  SAVE-HOME-CUR-CODE        PIC X(2)     VALUE SPACES.
       01  SAVE-CURRENCY-DESC        PIC X(12)    VALUE SPACES.
       01  SAVE-PO-STRT-DATE-CN.
           05  SAVE-PO-STRT-CC       PIC X(2)     VALUE SPACES.
           05  SAVE-PO-STRT-DATE.
               10  SAVE-PO-STRT-YY   PIC X(2)     VALUE SPACES.
               10  FILLER            PIC X(4)     VALUE SPACES.
       01  S-DEPT-STR                PIC X(4)     VALUE SPACES.
       01  KSAM-KEY-VALUE.
           05  KS-EMPLOYEE-ID        PIC X(4)     VALUE SPACE.
       01  ITEM-SEQ-SAVE-NO.
           05  ITEM-NO               PIC 9(4)     VALUE ZEROS.
           05  SEQ-NO                PIC 9(2)     VALUE ZEROS.
       01  PGM-FUNCTION              PIC X        VALUE SPACE.
       01  PREPAY-SW                 PIC X        VALUE "N".
           88  ALLOW-PREPAYS                      VALUE "Y".
9207CK 01  PAY-REQ-SW                PIC X        VALUE SPACES.
       01  COMMAND-AREA.
           05  OVERRIDE-ZINVOICE     PIC X(34)    VALUE
               "OVRDSPF FILE(ZINVOICE) SHARE(*YES)".
           05  OVERRIDE-PARM2        PIC S9(10)V9(5) COMP-3 VALUE 34.
       01  INDX                      PIC 99       VALUE ZERO.
       01  PRIME-REDEFINED.
           05  PRIME-BYTE            PIC X(1)     OCCURS 3 TIMES.
       01  SUB-REDEFINED.
           05  SUB-BYTE              PIC X(1)     OCCURS 3 TIMES.
       01  CONT-SW                   PIC X.
       01  DUMMY-BUYER               PIC X(4)     VALUE SPACES.
      *************************************************************
      **                                                         **
      **                  S W I T C H   A R E A                  **
      **                                                         **
      *************************************************************

       01  SWITCHES.
           05  BLOWUP-SW             PIC X        VALUE "N".
           05  OPENTERM-ERROR        PIC X        VALUE "N".
           05  TAX-ERROR-SW          PIC X        VALUE "N".
           05  HANDLE-BLOWUP-FLAG    PIC X       VALUE "Y".
       01  GST-TAX-SW                PIC X(1).
           88  DONT-TAX-ON-GST                       VALUE "1".
           88  TAX-ON-GST                            VALUE "2".

      *************************************************************
      **                                                         **
      **               S U B S C R I P T   A R E A               **
      **                                                         **
      *************************************************************

       01  SUBSCRIPTS.
           05  VEN-SUB               PIC S9(4)    VALUE ZERO  COMP-4.
           05  LINE-SUB              PIC S9(4)    VALUE ZERO  COMP-4.
           05  DE-ITEM-SUB           PIC S9(4)    VALUE ZERO  COMP-4.
           05  DESC-SUB              PIC S9(4)    VALUE ZERO  COMP-4.
           05  ADDR-SUB              PIC S9(4)    VALUE ZERO  COMP-4.
           05  ACCT-SUB              PIC S9(2)    VALUE ZERO  COMP-4.
           05  FRT-SUB               PIC S9(4)    VALUE ZERO  COMP-4.
           05  CE-SUB                PIC S9(4)    VALUE ZERO  COMP-4.
           05  SUB1                  PIC S9(4)    VALUE ZERO  COMP-4.

       COPY VCOMAREA   IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FINVOICE".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  FORMFILE-INVINQ.
           05  FORM-FNAME-B              PIC X(7)  VALUE "FINVINQ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME-B.
               10  FORM-GNAME1-B         PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2-B         PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  FORMFILE-CSISINQ.
           05  FORM-FNAME-C              PIC X(8)  VALUE "FCSISINQ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME-C.
               10  FORM-GNAME1-C         PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2-C         PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  FORM-NAMES.
           05  REQUEST               PIC X(6)     VALUE "FINV01".
           05  PODATA                PIC X(6)     VALUE "FINV02".
           05  OVENDOR               PIC X(7)     VALUE "FINV02B".
           05  OVENDORD              PIC X(8)     VALUE "FINV02BD".
           05  INVENTRY              PIC X(6)     VALUE "FINV03".
           05  INVTERMS              PIC X(7)     VALUE "FINV03A".
           05  INVMATCH              PIC X(6)     VALUE "FINV04".
           05  INVPAY                PIC X(6)     VALUE "FINV05".
           05  INVINCLUDE            PIC X(6)     VALUE "FINV06".
           05  INVDEDUCT             PIC X(6)     VALUE "FINV07".
           05  INVDEDUCTA            PIC X(7)     VALUE "FINV07A".
           05  INVADJUST             PIC X(6)     VALUE "FINV08".
           05  INVGPF                PIC X(7)     VALUE "FINV08A".


      *01  OVERRIDE-VENDOR-COMLINE.
      *    05  FILLER                PIC X(38)
      *         VALUE "*** IF THE NEW VENDOR INFO. IS CORRECT".
      *    05  FILLER                PIC X(37)
      *         VALUE ",  PRESS  'Enter'  TO CONTINUE ***   ".

       01  VENDOR-NOT-FOUND-MSG1.
           05  FILLER  PIC X(20) VALUE "THIS VENDOR CODE IS ".
           05  FILLER  PIC X(18) VALUE "NOT IN YOUR LOCAL ".
           05  FILLER  PIC X(4)  VALUE "CSIS".

       01  VENDOR-NOT-FOUND-MSG2.
           05  FILLER  PIC X(22) VALUE "VENDOR FILE.  HOWEVER ".
           05  FILLER  PIC X(19) VALUE "TO USE THIS VENDOR ".

       01  VENDOR-NOT-FOUND-MSG3.
           05  FILLER  PIC X(18) VALUE "CODE IT MUST BE A ".
           05  FILLER  PIC X(20) VALUE "VALID VENDOR CODE IN".

       01  VENDOR-NOT-FOUND-MSG4.
           05  FILLER  PIC X(19) VALUE "THE AKRON ACCOUNTS ".
           05  FILLER  PIC X(19) VALUE "PAYABLE VENDOR FILE".

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.

       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.

       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO  COMP-4.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.

       01  WHICH-LABELS              PIC S9(4)    VALUE 1     COMP-4.

       01  LABEL-NUMBER              PIC S9(4)    VALUE 3     COMP-4.

       01  FIELD-LENGTH              PIC S9(4)    VALUE ZERO  COMP-4.

       01  NEXT-FIELD-NUMBER         PIC S9(4)    VALUE ZERO  COMP-4.

       01  SAVE-VIEW-LASTKEY         PIC S9(4)    VALUE ZERO  COMP-4.


       01  SEE-LABEL-NAME.
           05  FILLER                PIC X(16).
      *         VALUE "SEE/ADD COMMENTS".

       01  ADD-LABEL-NAME.
           05  FILLER                PIC X(79)
                VALUE "f6-ADD COMMENTS f6-RCVR INQUIRY".

      *************************************************************
      **                                                         **
      **      S C R E E N   P R I N T   P A R A M E T E R S      **
      **                                                         **
      *************************************************************

       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL             PIC S9(4)    VALUE ZERO  COMP-4.
           05  PAGE-CTL              PIC S9(4)    VALUE 49    COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".

       01  PASS-SPOOL-PRT-NO         PIC S9(2)    VALUE ZERO  COMP-4.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  DE-BUFFER1.
           05  DE1-PO-RLSE.
               10  DE1-PO            PIC X(7).
               10  DE1-RLSE          PIC 9(3).
           05  DE1-CMD-LINE          PIC X(79).
           05  DE1-MSG-LINE          PIC X(79).

       01  DE-BUFFER2.
           05  DE2-PO-RLSE.
               10  DE2-PO            PIC X(7).
               10  DE2-RLSE          PIC X(3).
           05  DE2-PO-FOR-DEPT       PIC X(6).
           05  DE2-PO-BUDGET-NO      PIC X(12).
           05  DE2-PO-DATE           PIC X(8).
           05  DE2-PO-ITEM-COUNT     PIC ---9.
           05  DE2-PO-BUDGET-AMT     PIC Z(10)9.
           05  DE2-PO-BUYER          PIC X(16).
           05  DE2-PO-REQ-NUMBER     PIC X(12).
           05  DE2-INV-PAYMENTS      PIC Z(10)9.
           05  DE2-ADDL-INFO         PIC X(16).
           05  DE2-OPEN-BUDGET-AMT   PIC -(11)9.
           05  DE2-CPW-DEDUCTS       PIC Z(10)9.99.
           05  DE2-PO-TYPE           PIC X(14).
           05  DE2-CPW-PAYMENTS      PIC Z(10)9.99.
           05  DE2-CUR-CODE          PIC X(2).
           05  DE2-CUR-CODE-DESC     PIC X(12).
           05  DE2-CPW-BALANCE       PIC -(11)9.99.
           05  DE2-STD-INST-LIST.
               10  DE2-STD-INST-NO  OCCURS 12 TIMES  PIC X(3).
           05  DE2-COMMENT-TABLE.
               10  DE2-PO-INV-COM  OCCURS  2  TIMES
                                     PIC X(79).
           05  DE2-PAY-VENDOR-CODE.
               10  DE2-PAY-VC        PIC X(7).
               10  DE2-PAY-IND       PIC X(3).
           05  DE2-PAY-VEN-DATA  OCCURS  4  TIMES
                                     PIC X(44).
           05  DE2-ORD-VENDOR-CODE.
               10  DE2-ORD-VC        PIC X(7).
               10  DE2-ORD-IND       PIC X(3).
           05  DE2-ORD-VEN-DATA  OCCURS  4  TIMES
                                     PIC X(44).
           05  DE2-CMD-LINE1         PIC X(79).
           05  DE2-CMD-LINE          PIC X(79).
           05  DE2-MSG-LINE          PIC X(79).

       01  DE-BUFFER2B.
           05  DE2B-PO-RLSE.
               10  DE2B-PO           PIC X(7).
               10  DE2B-RLSE         PIC X(3).
           05  DE2B-OLD-PAY-VC       PIC X(7).
           05  DE2B-OLD-PAY-IND      PIC X(3).
           05  DE2B-OLD-PAY-VEN-DATA  OCCURS  4  TIMES
                                     PIC X(44).
           05  DE2B-NEW-PAY-VC       PIC X(7).
           05  DE2B-NEW-PAY-VEN-DATA  OCCURS  4  TIMES
                                     PIC X(44).
           05  DE2B-COMLINE          PIC X(78).
           05  DE2B-CMD-LINE         PIC X(79).
           05  DE2B-MSG-LINE         PIC X(79).

       01  DE-BUFFER3.
           05  DE3-PO-RLSE.
               10  DE3-PO                PIC X(7).
               10  DE3-RLSE              PIC X(3).
           05  DE3-CUR-CODE              PIC X(2).
           05  DE3-CUR-CODE-DESC         PIC X(12).
           05  DE3-INV-NUM               PIC X(14).
           05  DE3-INV-DATE.
               10  DE3-INV-DATE-MM       PIC X(2).
               10  DE3-INV-DATE-DD       PIC X(2).
               10  DE3-INV-DATE-YY       PIC X(2).
           05  DE3-INV-CE                PIC X.
           05  DE3-INV-AMT               PIC 9(11)V9(2).
           05  DE3-INV-ACCTG.
               10  DE3-INV-ACCTG-PR      PIC X(3).
               10  DE3-INV-ACCTG-SB      PIC X(3).
               10  DE3-INV-ACCTG-SD      PIC X(3).
           05  DE3-INV-ACCTG-RDF  REDEFINES DE3-INV-ACCTG.
               10  DE3-INV-ACCTG-BYTE    PIC X(1)
                    OCCURS 9 TIMES.
           05  DE3-INV-NO-CHECK-INDIC    PIC X.
           05  DE3-TAX-CODE              PIC X(2).
           05  DE3-PO-TERMS              PIC X(2).
           05  DE3-INV-TERMS-DESC.
               10  DE3-PO-TERMS-PERCENT  PIC X(5).
               10  DE3-PO-TERMS-DUE      PIC X(18).
           05  DE3-INV-TERMS.
               10  DE3-INV-PCT           PIC X.
               10  DE3-INV-DUE           PIC X.
           05  DE3-INV-DESC              PIC X(55).
           05  DE3-PO-ITEM-COUNT         PIC ZZZ9.
           05  DE3-SELECT-ITEM-TABLE.
               10  DE3-ITEM-NO  OCCURS  24  TIMES
                                         PIC X(4).
           05  DE3-CMD-LINE              PIC X(79).
           05  DE3-MSG-LINE              PIC X(79).

       01  DE-BUFFER4.
           05  DE4-PO-RLSE.
               10  DE4-PO            PIC X(7).
               10  DE4-RLSE          PIC X(3).
           05  DE4-INV-NUM           PIC X(14).
           05  DE4-REG-NUM           PIC ZZZZ9.
           05  DE4-ITEM-INFORMATION.
               10  DE4-ITEM-NO       PIC ZZZ9.
               10  DE4-CORPCODE      PIC X(7).
               10  DE4-PO-UNPD-QTY   PIC --------9.9(4).
               10  DE4-PO-UM         PIC X(2).
               10  DE4-PO-UPRICE     PIC -(11)9.9(4).
               10  DE4-PO-ITEM-EXT   PIC -(11)9.9(2).
               10  DE4-PO-QTY-SIGN         PIC X.
               10  DE4-INV-UNPD-QTY        PIC 9(8)V9(4).
               10  DE4-INV-UM              PIC X(2).
               10  DE4-INV-UPRICE          PIC 9(11)V9(4).
               10  DE4-INV-ITEM-EXT        PIC 9(11)V9(2).
               10  DE4-INV-QTY-SIGN        PIC X.
               10  DE4-INV-ITEM-TAX-CODE   PIC X(2).
               10  DE4-INV-MEMO-INDIC      PIC X.
               10  DE4-DESC-TABLE.
                   15  DE4-DESC-LINE  OCCURS  4  TIMES
                                           PIC X(79).
               10  DE4-HOLD-VERBAGE        PIC X(20).
               10  DE4-ACCOUNTING-TABLE.
                 12  DE4-ACCTG-TBL-ENTRIES OCCURS 5 TIMES.
                   15  DE4-ACCTG-ENTRY.
                       20  DE4-PRIME     PIC X(3).
                       20  DE4-SUB       PIC X(3).
                       20  DE4-SUBD      PIC X(4).
                       20  DE4-ADDL-DATA PIC X(6).
                   15  DE4-PERCENT   PIC X(5).
                   15  DE4-PERCENT-9  REDEFINES  DE4-PERCENT
                                     PIC 9(3)V9(2).
           05  DE4-CMD-LINE              PIC X(79).
           05  DE4-MSG-LINE              PIC X(79).

       01  DE-BUFFER5.
           05  DE5-PO-RLSE.
               10  DE5-PO            PIC X(7).
               10  DE5-RLSE          PIC X(3).
           05  DE5-INV-NUM           PIC X(14).
           05  DE5-REG-NUM           PIC ZZZZ9.
           05  DE5-PO-MTL-EXT        PIC -(11)9.9(2).
           05  DE5-INV-MTL-EXT       PIC -(11)9.9(2).
           05  DE5-EXT-DIFF          PIC -(11)9.9(2).
           05  DE5-PAY-FLAG          PIC X.
           05  DE5-HOLD-FLAG         PIC X.
           05  DE5-HOLD-VERBAGE      PIC X(20).
           05  DE5-CMD-LINE          PIC X(79).
           05  DE5-MSG-LINE          PIC X(79).

       01  DE-BUFFER6.
           05  DE6-PO-RLSE.
               10  DE6-PO            PIC X(7).
               10  DE6-RLSE          PIC X(3).
           05  DE6-INV-NUM           PIC X(14).
           05  DE6-REG-NUM           PIC ZZZZ9.
           05  DE6-MATL-EXT          PIC -(11)9.9(2).
           05  DE6-VEN-FRT           PIC 9(11)V9(2).
           05  DE6-FRT-SIGN          PIC X.
           05  DE6-FOB               PIC X(20).
           05  DE6-VEN-TAX           PIC 9(11)V9(2).
           05  DE6-TAX-SIGN          PIC X.
           05  DE6-TAX-CODE          PIC X(2).
           05  DE6-VEN-CTNRS         PIC 9(11)V9(2).
           05  DE6-CTNR-SIGN         PIC X.
           05  DE6-CUR-CODE          PIC X(2).
           05  DE6-VEN-INS           PIC 9(11)V9(2).
           05  DE6-INS-SIGN          PIC X.
           05  DE6-CUR-CODE-DESC     PIC X(12).
           05  DE6-VEN-OTHER         PIC 9(11)V9(2).
           05  DE6-OTHER-SIGN        PIC X.
           05  DE6-GST-HEADER        PIC X(10).
           05  DE6-GST-AMOUNT        PIC 9(10)V9(2).
           05  DE6-GST-SIGN          PIC X.
           05  DE6-AMT-TO-BE-PAID    PIC -(11)9.9(2).
           05  DE6-INV-AMT           PIC -(11)9.9(2).
           05  DE6-INV-CE            PIC X.
           05  DE6-INV-ACCTG         PIC X(9).
           05  DE6-HOLD-VERBAGE      PIC X(20).
           05  DE6-CMD-LINE          PIC X(79).
           05  DE6-MSG-LINE          PIC X(79).

       01  DE-BUFFER7.
           05  DE7-PO-RLSE.
               10  DE7-PO            PIC X(7).
               10  DE7-RLSE          PIC X(3).
           05  DE7-INV-NUM           PIC X(14).
           05  DE7-REG-NUM           PIC ZZZZ9.
           05  DE7-ORIG-INV-AMT      PIC -(11)9.9(2).
           05  DE7-INV-CE            PIC X.
           05  DE7-INV-ACCTG         PIC X(9).
           05  DE7-CE6-EXT-ERR       PIC Z(10)9.9(2).
           05  DE7-CE6-SIGN          PIC X.
           05  DE7-CE7-UP-ERR        PIC Z(10)9.9(2).
           05  DE7-CE7-SIGN          PIC X.
           05  DE7-CE8-OTHER         PIC Z(10)9.9(2).
           05  DE7-CE8-SIGN          PIC X.
           05  DE7-AMT-TO-BE-PAID    PIC -(11)9.9(2).
           05  DE7-CE3-FRT           PIC 9(11)V9(2).
           05  DE7-CE3-SIGN          PIC X.
           05  DE7-CE4-INS           PIC 9(11)V9(2).
           05  DE7-CE4-SIGN          PIC X.
           05  DE7-CE5-TAX           PIC 9(11)V9(2).
           05  DE7-CE5-SIGN          PIC X.
           05  DE7-CE9-CASHD         PIC 9(11)V9(2).
           05  DE7-CE9-SIGN          PIC X.
           05  DE7-TERMS.
               10  DE7-TERMS-DUE-PCT PIC X.
               10  DE7-TERMS-DUE-DATE PIC X.
           05  DE7-CPW               PIC 9(11)V9(2).
           05  DE7-CPW-SIGN          PIC X.
           05  DE7-CPW-CODE          PIC X(4).
           05  DE7-EXT-CE            PIC X.
           05  DE7-EXT-CE-AMT        PIC 9(11)V9(2).
           05  DE7-EXT-CE-SIGN       PIC X.
           05  DE7-EXT-CE-ACCTG      PIC X(9).
           05  DE7-EXT-CE-ACCTG-RDF  REDEFINES DE7-EXT-CE-ACCTG.
               10  DE7-EXT-CE-ACCTG-BYTE PIC X(1)
                    OCCURS 9 TIMES.
           05  DE7-NET-DUE-VENDOR    PIC -(11)9.9(2).
           05  DE7-HOLD-VERBAGE      PIC X(20).
           05  DE7-CMD-LINE          PIC X(79).
           05  DE7-MSG-LINE          PIC X(79).

       01  DE-BUFFER8.
           05  DE8-PO-RLSE.
               10  DE8-PO            PIC X(7).
               10  DE8-RLSE          PIC X(3).
           05  DE8-INV-NUM           PIC X(14).
           05  DE8-REG-NUM           PIC ZZZZ9.
           05  DE8-NET-DUE-VENDOR    PIC -(11)9.9(2).
           05  DE8-CASH-DSCNT        PIC -(11)9.9(2).
           05  DE8-CASHD-SIGN        PIC X.
           05  DE8-CTNRS             PIC -(11)9.9(2).
           05  DE8-CTNR-SIGN         PIC X.
           05  DE8-CPW               PIC -(11)9.9(2).
           05  DE8-CPW-SIGN          PIC X.
           05  DE8-TOTAL-GDYR-FRT    PIC -(11)9.9(2).
           05  DE8-TOTAL-FRT-SIGN    PIC X.
           05  DE8-FRT-MSG           PIC X(20).
           05  DE8-OTHER             PIC 9(11)V9(2).
           05  DE8-OTHER-SIGN        PIC X.
           05  DE8-ACCRUED-TAX-ENTRY  OCCURS 4 TIMES.
               10  DE8-ACCRUED-TAX   PIC 9(11)V9(2).
               10  DE8-ATAX-SIGN     PIC X.
               10  DE8-ATAX-DESC     PIC X(15).
               10  DE8-ATAX-CE-ACCTG PIC X(9).
           05  DE8-DIST-COST         PIC -(11)9.9(2).
           05  DE8-HOLD-VERBAGE      PIC X(20).
           05  DE8-CMD-LINE          PIC X(79).
           05  DE8-MSG-LINE          PIC X(79).

       01  DE-BUFFER8A.
           05  DE8A-PO-RLSE.
               10  DE8A-PO           PIC X(7).
               10  DE8A-RLSE         PIC X(3).
           05  DE8A-INV-NUM          PIC X(14).
           05  DE8A-REG-NUM          PIC ZZZZ9.
           05  DE8A-DB-FRT-DATA  OCCURS  10 TIMES.
               10  DE8A-SELECT-FRT   PIC X.
               10  DE8A-RECEIVING-SLIP  PIC X(3).
               10  DE8A-CARRIER-CODE PIC X(4).
               10  DE8A-PRO-NUMBER   PIC X(16).
               10  DE8A-CAR-NO       PIC X(10).
               10  DE8A-FRT-AMOUNT   PIC 9(11)V9(2).
               10  DE8A-FRT-AMT-SIGN PIC X.
           05  DE8A-CMD-LINE         PIC X(79).
           05  DE8A-MSG-LINE         PIC X(79).


       COPY DATAB      IN COPYLIB.

       COPY DBSTHIST   IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-NAME             PIC X(16)    VALUE SPACE.
           05  DSET-MPLTINFO         PIC X(16)    VALUE "MPLTINFO;".
           05  DSET-MPORCV           PIC X(16)    VALUE "MPORCV;".
           05  DSET-DPORECD          PIC X(16)    VALUE "DPORECD;".
           05  DSET-DPOITEM          PIC X(16)    VALUE "DPOITEM;".
           05  DSET-DPODATAITM       PIC X(16)    VALUE "DPODATAITM;".
           05  DSET-DVENDOR          PIC X(16)    VALUE "DVENDOR;".
           05  DSET-DINVRCD          PIC X(16)    VALUE "DINVRCD;".
           05  DSET-MSTORERM         PIC X(16)    VALUE "MSTORERM;".
           05  DSET-DINVITM          PIC X(16)    VALUE "DINVITM;".
           05  DSET-DINVACCT         PIC X(16)    VALUE "DINVACCT;".
           05  DSET-MTAX             PIC X(16)    VALUE "MTAX;".
           05  DSET-DPOFREIGHT       PIC X(16)    VALUE "DPOFREIGHT;".
           05  DSET-DDAILYTC         PIC X(16)    VALUE "DDAILYTC;".
           05  DSET-MVALIDPLT     PIC X(16) VALUE "MVALIDPLTDATA;".
           05  DSET-MVALIDUM         PIC X(16)    VALUE "MVALIDUM;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS             PIC X(2)     VALUE "@;".
           05  PO-KEY-NAME           PIC X(10)    VALUE "PO-RCV-NO;".
           05  VEN-KEY-NAME          PIC X(10)    VALUE "VEN-CODE;".
           05  CODE-KEY-NAME         PIC X(10)    VALUE "CORP-CODE;".
           05  REG-KEY-NAME          PIC X(16)
                VALUE "REGISTER-NUMBER;".
           05  INV-KEY-NAME          PIC X(16)
                VALUE "INVOICE-NUMBER;".

       01  PASS-ARG-VALUES.
           05  PLT-ARG               PIC X(4)     VALUE SPACE.
           05  PO-ARG                PIC X(14)    VALUE SPACE.
           05  VEN-ARG.
               10  VEN-ARG1-7.
                   15  VEN-ARG1      PIC X        VALUE SPACE.
                   15  FILLER        PIC X(6)     VALUE SPACE.
               10  VEN-ARG8-10       PIC X(3)     VALUE SPACE.
           05  REQ-ARG               PIC X(12)    VALUE SPACE.
           05  DEPT-ARG              PIC X(10)    VALUE SPACE.

       01  ARGUMENT-VALUES.
           05  NEW-VEN-ARG.
               10  NVEN-ARG1-7       PIC X(7)     VALUE SPACE.
               10  NVEN-ARG8-10      PIC X(3)     VALUE SPACE.
           05  CODE-ARG              PIC X(8)     VALUE SPACE.
           05  REGISTER-ARG          PIC X(6)     VALUE SPACE.
           05  TAX-ARG               PIC X(2)     VALUE SPACE.
           05  INV-ARG               PIC X(14)    VALUE SPACE.

       01  MISC-SWITCHES.
           05  EOJ-SW                PIC X        VALUE SPACE.
           05  MORE-COM-MSW          PIC X        VALUE SPACE.
           05  ALL-ITEMS-MSW         PIC X        VALUE SPACE.
           05  CALC-ERROR-SW         PIC X        VALUE SPACE.
           05  TERMS-OK-SW           PIC X        VALUE SPACES.
           05  AT-LEAST-ONE-ITEM-SW  PIC X        VALUE SPACE.
           05  END-INV-ENTRY-SW      PIC X        VALUE SPACE.
           05  POSSIBLE-PUT-SW       PIC X        VALUE SPACE.
           05  ERR-SW                PIC X        VALUE "N".
           05  OVERRIDE-DATE-CHK-SW  PIC X        VALUE SPACE.
           05  CALC-TAX-FRT-SW       PIC X        VALUE SPACE.
           05  RESTART-INV-SW        PIC X        VALUE SPACE.

       01  MISC-SAVE-AREAS.
           05  S-NEW-REGNUM          PIC 9(5)     VALUE ZEROS.
           05  S-HOLD-FLAG           PIC X        VALUE SPACE.
           05  S-ENTRY-DATE-CN.
               10  S-ENTRY-DATE-CC      PIC X(2)  VALUE SPACES.
               10  S-ENTRY-DATE.
                   15  S-ENTRY-DATE-YY  PIC X(2)  VALUE SPACES.
                   15  FILLER           PIC X(4)  VALUE SPACES.
           05  S-INVOICE-DATE-CN.
               10  S-INVOICE-DATE-CC PIC XX       VALUE SPACES.
               10  S-INVOICE-DATE.
                   15  S-INVOICE-DATE-YY  PIC XX  VALUE SPACES.
                   15  FILLER        PIC X(4)     VALUE SPACES.
           05  S-INVOICE-NO          PIC X(14)    VALUE SPACES.
           05  S-INVITM-ITEM-NO      PIC X(4)     VALUE SPACES.
           05  S-INVITM-TAX-CODE     PIC X(2)     VALUE SPACES.
           05  S-INVITM-MEMO-INDIC   PIC X        VALUE SPACES.
           05  S-ITM-SUBD            PIC X(4)     VALUE SPACES.
           05  S-DE4-SUBD-AREA       PIC X(20)    VALUE SPACES.
           05  S-DE4-SUBD-RDF REDEFINES S-DE4-SUBD-AREA.
               10  S-DE4-SUBD OCCURS 5 TIMES
                                     PIC X(4).

9211CK 01  S-DISCOUNT-AMT            PIC V9(5)    VALUE ZEROS.
9211CK 01  S-DISCOUNT-TAX-SW         PIC X        VALUE SPACE.

       01  MISC-SAVE-AREAS-9.
           05  MINUS-6M-DATE-CN.
               10  MINUS-6M-DATE-CC  PIC 9(2)     VALUE ZERO.
               10  MINUS-6M-DATE.
                   15  MINUS-6M-DATE-YY  PIC 9(2) VALUE ZERO.
                   15  MINUS-6M-DATE-MM  PIC 9(2) VALUE ZERO.
                   15  MINUS-6M-DATE-DD  PIC 9(2) VALUE ZERO.
           05  PLUS-1D-DATE-CN.
               10  PLUS-1D-DATE-CC       PIC 9(2) VALUE ZERO.
               10  PLUS-1D-DATE.
                   15  PLUS-1D-DATE-YY   PIC 9(2) VALUE ZERO.
                   15  PLUS-1D-DATE-MM   PIC 9(2) VALUE ZERO.
                   15  PLUS-1D-DATE-DD   PIC 9(2) VALUE ZERO.
           05  S-ITEM-COUNT          PIC S9(4)    VALUE ZERO.
           05  S-BOTH-ITEM-NO        PIC 9(4)     VALUE ZERO.
           05  S-ORIG-INV-AMT        PIC S9(11)V9(2) VALUE ZERO.
           05  S-CALC-INV-AMT        PIC S9(11)V9(2) VALUE ZERO.
           05  S-CALC-FRT-CHARGES    PIC S9(11)V9(2) VALUE ZERO.
           05  S-INVOICE-PAYMENTS-AMT  PIC S9(11)V9(2) VALUE ZERO.
           05  S-INVOICE-PAYMENTS-ROUND  PIC S9(11) VALUE ZERO.
           05  S-OPEN-BUDGET-AMT     PIC S9(11) VALUE ZERO.
           05  S-CPW-DEDUCTS         PIC S9(11)V9(2) VALUE ZEROS.
           05  S-CPW-PAYMENTS        PIC S9(11)V9(2) VALUE ZEROS.
           05  S-NEG-VALUE           PIC S9(11)V9(2) VALUE ZERO.
           05  F-ACCT-PCT            PIC S9(3)V9(2) VALUE ZERO.
           05  S-TAX-TO-VENDOR       PIC S9(11)V9(4) VALUE ZEROS.
           05  S-INVITM-PO-QTY-PD    PIC S9(11)V9(4) VALUE ZEROS.
           05  S-INVITM-PO-UPRICE    PIC S9(11)V9(4) VALUE ZEROS.
           05  S-INVITM-INV-QTY-PD   PIC S9(11)V9(4) VALUE ZEROS.
           05  S-INVITM-INV-UPRICE   PIC S9(11)V9(4) VALUE ZEROS.
           05  CALC-TAX-PERCENT      PIC S9(2)V9(4) VALUE ZEROS.
           05  CALC-ITEM-TAX         PIC S9(11)V9(2) VALUE ZEROS.
           05  CALC-FRT-TAX          PIC S9(11)V9(2) VALUE ZEROS.
           05  CALC-ITEM-FRT-TAX     PIC S9(11)V9(4) VALUE ZEROS.
           05  CALC-TOTAL-FRT-TAX    PIC S9(11)V9(4) VALUE ZEROS.
           05  TOTAL-FRT-CHRGS       PIC S9(11)V9(2) VALUE ZEROS.
           05  S-HOLD-REGNUM         PIC 9(5)        VALUE ZEROS.

       01  KEEP-PO-ITEM-DATA.
           05  K-PO-UNPD-QTY         PIC S9(8)V9(4).
           05  K-PO-QTY-PAID         PIC S9(8)V9(4).
           05  K-PO-UM               PIC X(2).
           05  K-PO-UPRICE           PIC S9(11)V9(4).
           05  K-PO-ITEM-EXT         PIC S9(11)V9(2).

       01  WORK-PO-ITEM-DATA.
           05  W-PO-UNPD-QTY         PIC S9(8)V9(4).
           05  W-PO-UM               PIC X(2).
           05  W-PO-UPRICE           PIC S9(11)V9(4).
           05  W-PO-ITEM-EXT         PIC S9(11)V9(2).

       01  WORK-INV-ITEM-DATA.
           05  W-INV-UNPD-QTY        PIC S9(8)V9(4).
           05  W-INV-UPRICE          PIC S9(11)V9(4).
           05  W-INV-ITEM-EXT        PIC S9(11)V9(2).

       01  VARIABLES.
           05  V-OLD-UM              PIC X(2).
           05  V-NEW-UM              PIC X(2).
           05  V-OLD-QTY             PIC S9(8)V9(4).

       01  ITEM-CALC-AREAS.
           05  C-NEW-QTY             PIC S9(8)V9(4) VALUE ZERO.
           05  C-ALT-CF              PIC S9(6)V9(8) VALUE ZERO.

       01  INV-CALC-AREAS.
           05  C-EXT-DIFF            PIC S9(11)V9(2) VALUE ZERO.
           05  C-CE-DIFF             PIC S9(11)V9(2) VALUE ZERO.
           05  C-CE6-DIFF            PIC S9(11)V9(2) VALUE ZERO.
           05  C-CE7-DIFF            PIC S9(11)V9(2) VALUE ZERO.
           05  C-CE8-DIFF            PIC S9(11)V9(2) VALUE ZERO.

       01  INV-ACCUM-AREAS.
           05  A-PO-EXT              PIC S9(11)V9(2) VALUE ZERO.
           05  A-INV-EXT             PIC S9(11)V9(2) VALUE ZERO.
           05  A-INV-TOTAL           PIC S9(11)V9(2) VALUE ZERO.

       01  COMPARE-FIELDS.
           05  CP-INV-ITEM-EXT       PIC S9(11)V9(2).

       01  REFORM-INV-NO.
           05  R-INV-NO              PIC X       OCCURS 14 TIMES.

       01  SAVE-TAX-DISTRICTS.
           05  TAX-INFO  OCCURS 4 TIMES.
               10  TAX-DISTRICT      PIC X(15).
               10  TAX-DISTRICT-CE-ACCTG   PIC X(9).

       01  ACCOUNT-CE.
           05  ACCOUNT-CE-ENTRY  OCCURS 10 TIMES.
               10  ACCT-CE-PR        PIC X(3).
               10  ACCT-CE-SA        PIC X(3).
               10  ACCT-CE-SD        PIC X(3).

       01  PO-PRICE-TAX-CHARGES.
           05  PO-PAY-TAX-CHRG       PIC S9(11)V9(4) OCCURS 4 TIMES.
           05  PO-ACCRUE-TAX-CHRG    PIC S9(11)V9(4) OCCURS 4 TIMES.

       01  INV-PRICE-TAX-CHARGES.
           05  INV-PAY-TAX-CHRG      PIC S9(11)V9(4) OCCURS 4 TIMES.
           05  INV-ACCRUE-TAX-CHRG   PIC S9(11)V9(4) OCCURS 4 TIMES.

      *01  ITEM-ADDRESS-TABLE.
      *    05  TBL-ITEM-ADDR  OCCURS  1000  TIMES
      *                              PIC S9(9)    COMP.

       01  FREIGHT-ADDRESS-TABLE.
           05  FRT-ADDR  OCCURS  10  TIMES
                                     PIC S9(9)    COMP-4.
       01  STD-INST-SAVED.
           05  SAVE-STD-INST-LIST.
               10  STD-INST-NO  OCCURS 12 TIMES  PIC X(3).
           05  SAVE-CONFIRMING-FLAG    PIC X.
           05  SAVE-CONFIRM-VERBAGE    PIC X(34).


      *01  INCORRECT-EXT-LIT.
      *    05  FILLER                PIC X(44)
      *         VALUE "***  INVOICE QUANTITY X UNIT PRICE DOES NOT ".
      *    05  FILLER                PIC X(22)
      *         VALUE "= EXTENSION PRICE  ***".

       01  SAVE-POINQ-AREA.
           05  SAVE-COMPANY          PIC X(3)     VALUE SPACE.
           05  SAVE-ITEM-NUMBER      PIC X(4)     VALUE SPACE.
           05  SAVE-CORPCODE         PIC X(7)     VALUE SPACE.
           05  SAVE-PO-COUNT         PIC 9(2)     VALUE ZERO.

       01  SAVE-POBV-AREA.
           05  SAVE-PO-VENDOR        PIC X(10)    VALUE SPACE.
           05  SAVE-PO-VENDOR-NAME   PIC X(44)    VALUE SPACE.
           05  SAVE-PO-VENDOR-CSZ    PIC X(44)    VALUE SPACE.

       01  BUILD-PO-KEY-VALUE.
           05  B-PO-PREFIX           PIC X        VALUE "P".
           05  B-PO-NO               PIC X(7)     VALUE SPACE.
           05  B-PO-RLSE             PIC X(3)     VALUE SPACE.
           05  B-PO-RCV              PIC X(3)     VALUE ZERO.

       01  BUILD-DEPT-KEY.
           05  FILLER                PIC X(2)     VALUE "DP".
           05  DEPT-NO               PIC X(4)     VALUE SPACES.
           05  FILLER                PIC X(4)     VALUE SPACES.

       01  BUILD-CE-ACCTG-DATA.
           05  FILLER                PIC X(3)     VALUE SPACES.
           05  BUILD-CE-SB           PIC X(3)     VALUE SPACES.
           05  FILLER                PIC X(3)     VALUE SPACES.

       01  BUILD-TM-DISCOUNT-KEY.
           05  FILLER                PIC X(3)  VALUE "TMP".
           05  BUILD-TM-DISCOUNT-VALUE  PIC X  VALUE SPACES.

       01  BUILD-TM-DUE-DATE-KEY.
           05  FILLER                PIC X(3)  VALUE "TMD".
           05  BUILD-TM-DATE-VALUE   PIC X     VALUE SPACES.

       01  BUILD-CC-KEY.
           05  BUILD-CC-VALUE        PIC X(2)     VALUE SPACES.

       01  ALTER-PO-ARG.
           05  FILLER                PIC X(8)     VALUE SPACE.
           05  A-REL                 PIC 9(3)     VALUE ZEROS.
           05  A-RS                  PIC 9(3)     VALUE ZERO.


       01  DATES-AND-TIMES.
           05  YMD-DATE-CN.
               10  YMD-CC            PIC X(2).
               10  YMD-DATE.
                   15  YMD-YY        PIC X(2).
                   15  YMD-MM        PIC X(2).
                   15  YMD-DD        PIC X(2).
           05  YMD-DATE-9-CN  REDEFINES  YMD-DATE-CN.
               10  YMD-CCYY-9        PIC 9(4).
               10  YMD-MM-9          PIC 9(2).
               10  YMD-DD-9          PIC 9(2).
           05  HP-TIME.
               10  HOUR              PIC X(2).
               10  MIN               PIC X(2).
               10  SEC               PIC X(2).
           05  CURRENT-DATE.
               10  CURRENT-YY        PIC X(2).
               10  CURRENT-MM        PIC X(2).
               10  CURRENT-DD        PIC X(2).

       COPY TDATECHK   IN COPYLIB.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY MPLTINFO   IN COPYLIB.

       COPY MVALIDUM   IN COPYLIB.

       COPY MPORCV     IN COPYLIB.

       COPY DPORECD    IN COPYLIB.

       COPY DPOITEM    IN COPYLIB.

       COPY DPODATA    IN COPYLIB.

       COPY DVENDOR    IN COPYLIB.

       COPY DINVRCD    IN COPYLIB.

       COPY MSTORERM   IN COPYLIB.

       COPY DINVITM    IN COPYLIB.

       COPY DINVACCT   IN COPYLIB.

       COPY DFREIGHT   IN COPYLIB.

       COPY MVALDPLT   IN COPYLIB.

       COPY MTAX       IN COPYLIB.

       COPY DDAILYTC   IN COPYLIB.

       COPY TC350      IN COPYLIB.

       COPY TC352      IN COPYLIB.

       COPY LANGUAGE   IN COPYLIB.


      *******************************
      **  PARAMETERS FOR CALLING
      **  'CDESC'
      *******************************

       COPY CDESC      IN COPYLIB.

       01  RET-CODE                     PIC X(2)  VALUE SPACES.

      *******************************
      **  PARAMETERS FOR CALLING
      **  'CNDESC'
      *******************************

       COPY CNDESC     IN COPYLIB.

      *******************************
      **  PARAMETERS FOR CALLING
      **  'SINVDUED'
      *******************************

       COPY SINVDUED   IN COPYLIB.

      *************************************************************
      **                                                         **
      **          E R R O R   M E S S A G E   A R E A S          **
      **                                                         **
      *************************************************************

       COPY TBLOWUP    IN COPYLIB.

       01  BAD-UM-MSG.
           05  BAD-UM-MSG-A     PIC X(2).
           05  FILLER           PIC X(4) VALUE " TO ".
           05  BAD-UM-MSG-B     PIC X(2).

      *************************************************************
      **    PARAMETER AREA FOR 'TSHWRDFM'                        **
      *************************************************************
      *COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.

       PROCEDURE DIVISION.
       PROC-DIV SECTION 01.
       BEGIN-HERE.
           PERFORM  1-HSK  THRU  1-HSK-X.

           IF EOJ-SW = "Y"
               PERFORM  2-CLOSE-FILES  THRU  2-CLOSE-FILES-X
           ELSE
                   IF BLOWUP-SW = "Y"
                       PERFORM  2100-BLOWUP
                   ELSE
                       PERFORM  6-MAIN  THRU  6-MAIN-X
                       PERFORM  2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.
           GOBACK.


       1-HSK.
           MOVE "A"  TO  PGM-FUNCTION.
           CALL "TINVPASS" USING  KSAM-KEY-VALUE,
                                  PGM-FUNCTION,
                                  SCREEN-PRINT-PARMS,
                                  PASS-SPOOL-PRT-NO,
                                  VIEW-COMAREA,
                                  LANGUAGE-PARMS.
           IF VIEW-LASTKEY = 3
               MOVE "Y"  TO  EOJ-SW
               MOVE "N" TO DBOPEN-SW
               GO TO  1-HSK-X.

           MOVE "Y" TO DBOPEN-SW.
           PERFORM 611-DBOPEN THRU 611-DBOPEN-X.
           CALL "QCMDEXC" USING OVERRIDE-ZINVOICE, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.
           MOVE "ZINVOICE" TO VIEW-CFNAME.
      *    *** SEE/ADD COMMENTS ***
           MOVE  19 TO LANG-SETNUM.
           MOVE  12 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SEE-LABEL-NAME.
      *    *** ADD MORECOMMENTS ***
           MOVE   1 TO LANG-SETNUM.
           MOVE   4 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO ADD-LABEL-NAME.

      *
      * FIND THE HOME CURRENCY CODE.
      *
           MOVE "CCHM"     TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO*63-ECC"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP
           ELSE
               MOVE MPLTINFO-HOME-CUR-CODE  TO  SAVE-HOME-CUR-CODE.

      *
      * FIND THE ENTRY THAT CONTAINS THE GST INFORMATION
      *
           MOVE "Y" TO HANDLE-BLOWUP-FLAG.
           MOVE 0 TO GST-ENTRY.
           MOVE "PTX1" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
             MOVE "GETKEY MPLTINFO 1-INIT" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL GST-ENTRY > 0 OR
                         SUB > 2

             IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
               MOVE SUB TO GST-ENTRY
             END-IF

           END-PERFORM.

           IF GST-ENTRY EQUAL ZERO

             MOVE "PTX2" TO PLT-ARG
             PERFORM 9999-GETKEY-MPLTINFO-PK-I
             IF NOT GOOD-CALL
               MOVE "GETKEY MPLTINFO 1-INIT" TO BU-DISPLAY-MSG
               MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
               PERFORM 2100-BLOWUP
             END-IF
             PERFORM VARYING SUB FROM 1 BY 1
                     UNTIL GST-ENTRY > 0 OR
                           SUB > 2

               IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
                 COMPUTE GST-ENTRY = SUB + 2
               END-IF

             END-PERFORM

           END-IF.

      *
      * CHECK FOR EXISTENCE OF TAXGST FILE
      *  IF IT EXISTS THIS MEANS TO APPLY TAXES OTHER THAN GST
      *  ON BASE + GST ( DOUBLE TAXATION )
      *
           OPEN INPUT TAXGST-FILE.
           IF FILE-STATUS NOT EQUAL ZERO
             SET DONT-TAX-ON-GST TO TRUE
           ELSE
             SET TAX-ON-GST TO TRUE
           END-IF.
           CLOSE TAXGST-FILE.

       1-HSK-X.
           EXIT.


       2-CLOSE-FILES.
           IF DBOPEN-SW = "Y"
               CLOSE  DPORECD-O, DINVITM-O, DPOITEM-O, DINVACCT-O,
                      DINVRCD-O-REG, DINVRCD-O-PO, DINVRCD-O-INV,
                      DPOFREIGHT-O, DDAILYTC-O, MVALIDPLTDTA-I,
                      MPLTINFO-O, MPORCV-I, DVENDOR-I, DPODATAITM-O,
                      MTAX-I, MSTORERM-I, MVALIDUM-I, MPLTINFO-PK-I,
                      DPOITEM-I, DINVITM-I.

           IF EOJ-SW  NOT =  "Y"
               CLOSE DISPLAY-FILE.

      ********************************************
      **  TRY TO CLOSE THE STORES HISTORY DB
      **  'STHIST' IN CASE IT MAY HAVE BEEN OPENED
      **  BY EITHER THE INVOICE INQUIRY 'SINVINQS'
      **  OR THE PO INQUIRY 'SPOINQ' SINCE THEY
      **  CAN ACCESS THE HISTORY DB
      ********************************************

     ***   CALL "DBCLOSE" USING BASE-STHIST,
     ***                        DSET-NAME,
     ***                        MODE1,
     ***                        STATUS-AREA.
     ***

       2-CLOSE-FILES-X.
           EXIT.


       2100-BLOWUP.
           MOVE "TINVOICE"              TO  BU-PGM-NAME.
           IF RESTART-INV-SW = "Y"
               MOVE "RESTARTED"         TO  BU-DISPLAY-FLD (5)
           ELSE
               MOVE SPACES              TO  BU-DISPLAY-FLD (5).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       MAIN-PROCESSING SECTION 02.
       6-MAIN.
           MOVE ZERO   TO  VEN-SUB,
                           LINE-SUB,
                           DE-ITEM-SUB,
                           DESC-SUB,
                           ADDR-SUB,
                           ACCT-SUB,
                           ITEM-CALC-AREAS,
                           INV-CALC-AREAS,
                           INV-ACCUM-AREAS,
                           COMPARE-FIELDS,
                           PO-PRICE-TAX-CHARGES,
                           INV-PRICE-TAX-CHARGES,
                           MISC-SAVE-AREAS-9.

           MOVE SPACE  TO  PASS-ARG-VALUES,
                           ARGUMENT-VALUES,
                           MISC-SWITCHES,
                           MISC-SAVE-AREAS,
      *                    ITEM-ADDRESS-TABLE,
                           SAVE-POBV-AREA.

           PERFORM 611-ZERO-OUT-TAX-TABLE  THRU  611-ZOTT-X
               VARYING SUB1 FROM 1 BY 1
                   UNTIL SUB1 > 4.


      *------- ACCOUNT FOR CENTURY.
           ACCEPT YMD-DATE  FROM  DATE.
           IF YMD-YY > "70"
               MOVE "19"      TO  YMD-CC
           ELSE
               MOVE "20"      TO  YMD-CC.
           MOVE YMD-DATE-CN   TO  S-ENTRY-DATE-CN.
           ADD +1  TO  YMD-DD-9.
           MOVE YMD-DATE-CN   TO  PLUS-1D-DATE-CN.
           SUBTRACT +1  FROM  YMD-DD-9.
           IF YMD-MM-9 < +7
               SUBTRACT +1  FROM  YMD-CCYY-9
               ADD +12  TO  YMD-MM-9.
           SUBTRACT +6  FROM  YMD-MM-9.
           MOVE YMD-DATE-CN    TO  MINUS-6M-DATE-CN.

       61-FILLBUFF1.
           MOVE SPACE          TO  DE-BUFFER1.
           MOVE ZEROS          TO  DE1-RLSE.
           MOVE REQUEST        TO  VIEW-NFNAME.

       61-SHOWFORM1.
           MOVE DE-BUFFER1     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO  DE-BUFFER1.

           IF VIEW-LASTKEY  = 1
               PERFORM 611-CALL-INV-MODIFY  THRU  611-CIM-X
               GO TO 61-FILLBUFF1
           ELSE
           IF VIEW-LASTKEY = 2
               PERFORM 611-CALL-INV-INQUIRY  THRU 611-CII-X
               GO TO 61-FILLBUFF1
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO  6-MAIN-X
           ELSE
           IF VIEW-LASTKEY = 4  OR
9206CK*       VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO   DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  61-SHOWFORM1.

           IF DE1-PO = SPACES
      *        ***  ENTER A PO NUMBER ***
               MOVE   5 TO LANG-SETNUM
               MOVE 104 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO   DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  61-SHOWFORM1.

       61-VERIFY-PO.
           MOVE DE1-PO                TO  B-PO-NO.
           MOVE DE1-RLSE              TO  B-PO-RLSE.
           MOVE ZERO                  TO  B-PO-RCV.
           MOVE BUILD-PO-KEY-VALUE    TO  PO-ARG,
                                          BU-DISPLAY-FLD (2).
           MOVE PO-ARG TO PORCVNO OF MPORCV-I-REC.
           READ MPORCV-I INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
      *            ***  PURCHASE ORDER DOES NOT EXIST ***
               MOVE  16 TO LANG-SETNUM
               MOVE  45 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  61-SHOWFORM1
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPORCV*61-VP"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           MOVE PO-ARG TO PORCVNO OF DPORECD-O-REC.
           READ DPORECD-O INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD*61-VP"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-O-REC.
           START DPORECD-O KEY > PORCVNO OF DPORECD-O-REC
              INVALID KEY MOVE "00" TO FILE-STATUS.

      *-------- ACCOUNT FOR CENTURY.
           IF SAVE-PO-STRT-DATE-CN NOT = SPACES
               IF  PO-DATE-CN < SAVE-PO-STRT-DATE-CN
      **           CANNOT INVOICE THRU CSIS - PO LOADED PRIOR TO PURCHASING STAR
                   MOVE  66179           TO  CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER   TO  DE1-MSG-LINE
                   MOVE B"1" TO IND(1), IND(99)
                   GO TO 61-SHOWFORM1.

9206CK     IF VIEW-LASTKEY NOT = 5
  .           IF PO-INVOICELESS-IND = "X"
  .   *M***      TO CONTINUE MANUAL PAYMENT OF THIS INVOICELESS PO  PRESS F5
  .              MOVE 74940 TO CATREAD-MSG-NUMBER
  .              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
  .              MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
  .              MOVE B"1" TO IND(1), IND(99)
9206CK           GO TO 61-SHOWFORM1.

9207CK     IF PO-RLS-NO = "999"
  .           IF PAY-REQ-SW = "N"
  .   *M***      CAN NOT PAY INVOICES AGAINST A REQUIREMENT ORDER
  .              MOVE 74941 TO CATREAD-MSG-NUMBER
  .              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
  .              MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
  .              MOVE B"1" TO IND(1), IND(99)
9207CK           GO TO 61-SHOWFORM1.

           IF PO-NONPAY-IND = "X"
      *M***      CANNOT PAY INVOICES AGAINST A NON-PAYABLE PO
               MOVE 03628 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(1), IND(99)
               GO TO 61-SHOWFORM1.

       62-FILLBUFF2.
           MOVE SPACE            TO  DE-BUFFER2.
           MOVE B-PO-NO          TO  DE2-PO.
           MOVE B-PO-RLSE        TO  DE2-RLSE.
           MOVE 4                TO  DATE-MODE.
           MOVE PO-DATE          TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT   TO  DE2-PO-DATE.
           MOVE PO-BUYER         TO  DE2-PO-BUYER.
           MOVE PO-REQ-NUMBER    TO  DE2-PO-REQ-NUMBER.
           MOVE PO-FOR-DEPT      TO  DE2-PO-FOR-DEPT.
           MOVE PO-ADDL-INFO     TO  DE2-ADDL-INFO.
           IF PO-CURRENCY-CODE NOT = SPACES
               PERFORM 621B-CUR-CODE     THRU 621B-CC-X
           ELSE
               MOVE SPACES TO SAVE-CURRENCY-DESC.
           IF PO-NON-RCV-INDIC = "X"
      *        *** NON RECEIVABLE ***
               MOVE  14 TO LANG-SETNUM
               MOVE  18 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-PO-TYPE
           ELSE
      *        *** RECEIVABLE ***
               MOVE  18 TO LANG-SETNUM
               MOVE   6 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-PO-TYPE.
           MOVE PO-BUDGET-NUMBER TO  DE2-PO-BUDGET-NO.
           MOVE PO-BUDGET-AMT    TO  DE2-PO-BUDGET-AMT.
           PERFORM 621-CALCULATE-INVOICE-PAYMENTS  THRU  621-CIP-X.
           SUBTRACT S-INVOICE-PAYMENTS-ROUND  FROM  PO-BUDGET-AMT
               GIVING S-OPEN-BUDGET-AMT.
           MOVE S-OPEN-BUDGET-AMT  TO  DE2-OPEN-BUDGET-AMT.

           PERFORM  621A-CNT-ITEMS  THRU  621A-CNT-ITEMS-X.
           IF S-ITEM-COUNT EQUAL ZERO

      *
      * NO ITEMS EXIST ON THIS PO
      *
             MOVE 66123 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
             MOVE B"1" TO IND(99), IND(1)
             GO TO 61-SHOWFORM1.

           MOVE SPACE                TO  SAVE-POBV-AREA.
           MOVE PO-VEN-CODE          TO  VEN-ARG,
                                         SAVE-PO-VENDOR.
           MOVE VEN-ARG1-7           TO  DE2-PAY-VC,
                                         DE2-ORD-VC.

           IF VEN-ARG8-10 = "000"  OR  VEN-ARG1 = "T"
               MOVE VEN-ARG8-10      TO  DE2-ORD-IND,
                                         DE2-PAY-IND
      *        ***  SAME AS ABOVE  ***
               MOVE  19 TO LANG-SETNUM
               MOVE  16 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-ORD-VEN-DATA (1)
               GO TO  62-FIND-PAYVEN.

           MOVE VEN-ARG8-10          TO  DE2-ORD-IND.
           MOVE "000"                TO  DE2-PAY-IND.

       62-FIND-ORDVEN.
           MOVE VEN-ARG TO VENCDE  OF DVENDOR-I-REC.
           START DVENDOR-I KEY = VENCDE  OF DVENDOR-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-FIND-PAYVEN
               ELSE
                   MOVE "START DVENDOR*62-FO"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP
           ELSE
               MOVE ZERO   TO  VEN-SUB.

       62-LOAD-ORDVEN.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO  62-FIND-PAYVEN
               ELSE
                   MOVE "READN DVENDOR*62-LO"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.
           IF VENCDE  OF DVENDOR-I-REC NOT = VEN-ARG
               GO TO  62-FIND-PAYVEN.

           IF VEN-ITM-NO = 00
               IF SAVE-PO-VENDOR-NAME = SPACE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-NAME   TO  DE2-ORD-VEN-DATA (VEN-SUB),
                                       SAVE-PO-VENDOR-NAME
               ELSE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-NAME   TO  DE2-ORD-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 01
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2-ORD-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 02
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2-ORD-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 07
               IF SAVE-PO-VENDOR-CSZ = SPACE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-07-RCD  TO  DE2-ORD-VEN-DATA (VEN-SUB),
                                        SAVE-PO-VENDOR-CSZ
               ELSE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-07-RCD  TO  DE2-ORD-VEN-DATA (VEN-SUB).

           IF VEN-SUB GREATER THAN 3
               GO TO  62-FIND-PAYVEN
           ELSE
               GO TO  62-LOAD-ORDVEN.

       62-FIND-PAYVEN.
           IF VEN-ARG1 NOT = "T"
               MOVE "000"    TO  VEN-ARG8-10.
           MOVE VEN-ARG TO VENCDE  OF DVENDOR-I-REC.
           START DVENDOR-I KEY = VENCDE  OF DVENDOR-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 1  TO  FIELD-NUMBER
      *        *** REMIT TO VENDOR NOT FOUND ON THIS ORDER FOR VENDOR CODE - ***
                   MOVE  18 TO LANG-SETNUM
                   MOVE  33 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE VEN-ARG1-7         TO  MSG-FLD
                   MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
                   MOVE B"1" TO IND(1), IND(99)
                   GO TO 61-SHOWFORM1
               ELSE
                   MOVE "START DVENDOR*62-FP"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP
           ELSE
               MOVE ZERO   TO  VEN-SUB.

       62-LOAD-PAYVEN.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO  62-INVOICE-COMMENTS
               ELSE
                   MOVE "READN DVENDOR*62-LP"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.
           IF VENCDE  OF DVENDOR-I-REC NOT = VEN-ARG
               GO TO  62-INVOICE-COMMENTS.

           IF VEN-ITM-NO = 00
               IF SAVE-PO-VENDOR-NAME = SPACE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-NAME    TO  DE2-PAY-VEN-DATA (VEN-SUB),
                                        SAVE-PO-VENDOR-NAME
               ELSE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-NAME    TO  DE2-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 01
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 02
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 07
               IF SAVE-PO-VENDOR-CSZ = SPACE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-07-RCD  TO  DE2-PAY-VEN-DATA (VEN-SUB),
                                        SAVE-PO-VENDOR-CSZ
               ELSE
                   ADD 1    TO  VEN-SUB
                   MOVE VEN-07-RCD  TO  DE2-PAY-VEN-DATA (VEN-SUB).

           IF VEN-SUB GREATER THAN 3
               GO TO  62-INVOICE-COMMENTS
           ELSE
               GO TO  62-LOAD-PAYVEN.

       62-INVOICE-COMMENTS.
           PERFORM  622-FIND-DPODATAITM  THRU  622-FIND-DPODATAITM-X.

       62-FILLBUFF2-CONT.
           MOVE PODATA  TO  VIEW-NFNAME.
           IF MORE-COM-MSW NOT = "Y"
               MOVE B"1" TO IND(98)
               MOVE ADD-LABEL-NAME TO DE2-CMD-LINE.

       62-SHOWFORM2.
           MOVE DE-BUFFER2     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER2.
           IF VIEW-LASTKEY = 1
               PERFORM 621-CALL-PO-INQUIRY  THRU  621-CPI-X
               GO TO  62-FILLBUFF2-CONT
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE DE2-ORD-VENDOR-CODE TO  VEN-ARG
               CALL  "SINVPOBV"  USING  BASE,
                                        SCREEN-PRINT-PARMS,
                                        PASS-SPOOL-PRT-NO,
                                        VIEW-COMAREA,
                                        PASS-ARG-VALUES,
                                        SAVE-POINQ-AREA,
                                        SAVE-POBV-AREA,
                                        LANGUAGE-PARMS,
                                        FORMFILE
                                        DUMMY-BUYER
               MOVE DE2-PAY-VENDOR-CODE TO  VEN-ARG
               GO TO  62-FILLBUFF2-CONT
           ELSE
           IF VIEW-LASTKEY = 5
               CALL "TINVCOM" USING  BASE,
                                     SCREEN-PRINT-PARMS,
                                     PASS-SPOOL-PRT-NO,
                                     VIEW-COMAREA,
                                     STATUS-AREA,
                                     PO-ARG,
                                     LANGUAGE-PARMS
               IF VIEW-LASTKEY = 3
                   GO TO  62-FILLBUFF2-CONT
               ELSE
                   GO TO  62-INVOICE-COMMENTS
           ELSE
           IF VIEW-LASTKEY = 4
               PERFORM  624-OVERRIDE-VENDOR  THRU  624-OVERRIDE-VENDOR-X
               IF VIEW-LASTKEY = 3
                   GO TO  62-FILLBUFF2-CONT
               ELSE
                   MOVE NEW-VEN-ARG  TO  VEN-ARG
                   GO TO  63-FILLBUFF3
           ELSE
           IF VIEW-LASTKEY = 6
               PERFORM 621-CALL-RSINQ  THRU  621-CR-X
               GO TO 62-FILLBUFF2-CONT
           ELSE
           IF VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  62-SHOWFORM2
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO  6-MAIN.

           IF VEN-ARG1 = "T"
      *        ***  TEMPORARY VENDOR - PRESS  'f4'  TO  PROCEED  ***
               MOVE  20 TO LANG-SETNUM
               MOVE  19 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  62-SHOWFORM2.

       63-FILLBUFF3.
           MOVE SPACES TO SAVE-TAX-CODE.
           MOVE SPACES                  TO  S-INVOICE-NO.
           MOVE SPACE                   TO  DE-BUFFER3.
           MOVE ZEROS                   TO  DE3-INV-AMT,
                                            DE3-SELECT-ITEM-TABLE.
           MOVE B-PO-NO                 TO  DE3-PO.
           MOVE B-PO-RLSE               TO  DE3-RLSE.
           MOVE "120"                   TO  DE3-INV-ACCTG-PR.
           MOVE PO-SUB                  TO  DE3-INV-ACCTG-SB.
           MOVE "000"                   TO  DE3-INV-ACCTG-SD.
           MOVE S-ITEM-COUNT            TO  DE3-PO-ITEM-COUNT.
           MOVE "ALL"                   TO  DE3-ITEM-NO (1).
           MOVE PO-CURRENCY-CODE        TO  DE3-CUR-CODE.

           MOVE  SAVE-CURRENCY-DESC           TO  DE3-CUR-CODE-DESC.

           MOVE PO-TERMS                TO  DE3-PO-TERMS.
           PERFORM 631-GET-TERMS-DESC  THRU  631-GTD-X.
           IF PO-TERMS = "9Z"
               MOVE "1A"                TO  DE3-INV-TERMS.
      *-------- MOVE INDICATOR TO POSITION CURSOR AT INVOICE
      *-------- NUMBER INSTEAD OF CURRENCY CODE.
           MOVE B"1" TO IND(1).

       63-GETFORM3.
           MOVE INVENTRY                TO  VIEW-NFNAME.

       63-SHOWFORM3.
           MOVE "N"             TO  OVERRIDE-DATE-CHK-SW.

       63-SHOWFORM3-CONT.
           MOVE DE-BUFFER3     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.

       63-READFIELDS3.
           PERFORM 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER3.
           IF VIEW-LASTKEY = 1
               PERFORM 631-DISPLAY-PAYMENT-TERMS THRU 631-DPT-X
               GO TO 63-GETFORM3
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE "Y"         TO  OVERRIDE-DATE-CHK-SW
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO  6-MAIN
           ELSE
           IF VIEW-LASTKEY = 5
               IF RESTART-INV-SW = "Y"
                   MOVE 7  TO  VIEW-LASTKEY
               ELSE
                   PERFORM 631-READ-INV-NUM  THRU  631-RIN-X
                   IF ERR-SW = "Y"
                       GO TO 63-SHOWFORM3-CONT
                   ELSE
                       PERFORM 631-VERIFY-INVOICE-QTY THRU 631-VIQ-X
                       GO TO 63-READFIELDS3
           ELSE
           IF VIEW-LASTKEY = 4
               IF RESTART-INV-SW = "Y"
                   MOVE 7        TO  VIEW-LASTKEY
               ELSE
                   NEXT SENTENCE.

           IF VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
               GO TO  63-SHOWFORM3.

       63-FIELDEDIT3.
           IF DE3-INV-NUM = SPACES
      *       ***  INVOICE NUMBER IS REQUIRED ***
               MOVE 66098 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
               GO TO  63-SHOWFORM3.
           IF DE3-INV-DATE = SPACES
      *       ***  INVOICE DATE IS REQUIRED ***
               MOVE 66099 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(4)
               GO TO  63-SHOWFORM3.
           IF DE3-INV-CE = SPACES
      *       ***  CLASS OF ENTRY IS REQUIRED ***
               MOVE 66252 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(9)
               GO TO  63-SHOWFORM3.
           IF DE3-INV-CE = "1" OR "2" OR "3" OR "A" OR "Z"
               NEXT SENTENCE
           ELSE
      *       ***  VALID CLASS OF ENTRY IS 1,2,3,A, OR Z
               MOVE 66253 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(9)
               GO TO  63-SHOWFORM3.
      *    IF DE3-INV-AMT = ZEROS
      *       ***  TOTAL INVOICE AMOUNT IS REQUIRED ***
      *        MOVE 66254 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
      *        MOVE B"1" TO IND(99), IND(7)
      *        GO TO  63-SHOWFORM3.
           IF DE3-INV-ACCTG = SPACES
      *       ***  GENERAL LEDGER ACCOUNTING DATA IS REQUIRED ***
               MOVE 66255 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(41)
               GO TO  63-SHOWFORM3.
           MOVE 1                TO  INDX.
           PERFORM UNTIL INDX > 9 OR CALC-ERROR-SW = "Y"
               IF DE3-INV-ACCTG-BYTE (INDX)  = SPACES
      *       ***  GENERAL LEDGER ACCOUNTING DATA IS 9 DIGITS ***
                   MOVE 66256 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                   MOVE B"1" TO IND(99), IND(41)
                   MOVE "Y"  TO CALC-ERROR-SW
               END-IF
               ADD 1 TO INDX
           END-PERFORM.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACES TO CALC-ERROR-SW
               GO TO  63-SHOWFORM3.

           MOVE 3                TO  DATE-MODE.
           MOVE DE3-INV-DATE     TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           IF DATE-RET-CODE  NOT = 0
               MOVE DATE-MSG     TO  MESSAGE-BUFFER
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(4)
               GO TO 63-SHOWFORM3
           ELSE
               MOVE DATE-YMD-OUT TO  S-INVOICE-DATE
      *------------- ACCOUNT FOR CENTURY.
               IF S-INVOICE-DATE-YY > "70"
                   MOVE "19"     TO  S-INVOICE-DATE-CC
               ELSE
                   MOVE "20"     TO  S-INVOICE-DATE-CC.

           IF VIEW-LASTKEY = 4
               NEXT SENTENCE
           ELSE
           IF S-INVOICE-DATE-CN > MINUS-6M-DATE-CN  AND
              S-INVOICE-DATE-CN < PLUS-1D-DATE-CN
               NEXT SENTENCE
           ELSE
               IF OVERRIDE-DATE-CHK-SW = "Y"
                   NEXT SENTENCE
               ELSE
      *       ***  WARNING:  INVOICE DATE DOES NOT PASS DATE CHECK CRITERIA ***
                   MOVE  23 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                   MOVE B"1" TO IND(99), IND(4)
                   GO TO  63-SHOWFORM3.

           IF DE3-PO-TERMS = "9Z" OR "  "
               IF DE3-INV-TERMS = SPACES
      *            * YOU MUST OVERRIDE PAYMENT TERMS; PO TERMS ARE INVALID *
                   MOVE  25 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                   MOVE B"1" TO IND(99), IND(6)
                   GO TO 63-SHOWFORM3.

      *************************************
      *                                   *
      *   EDIT TAX CODE                   *
      *                                   *
      *************************************

       63-EDIT-TAX-CODE.
           IF DE3-TAX-CODE = SPACES
               GO TO 63-EDIT-PAYMENT-TERMS.
           MOVE DE3-TAX-CODE             TO  TAX-ARG.
           PERFORM 641-EDIT-TAX-CODE THRU 641-ETC-X.
           IF ERR-SW = "Y"
               MOVE MESSAGE-BUFFER       TO  DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(43)
               GO TO 63-SHOWFORM3.

      *************************************
      *                                   *
      *   EDIT PAYMENT TERMS              *
      *                                   *
      *************************************

       63-EDIT-PAYMENT-TERMS.
           IF DE3-INV-TERMS = SPACES
               GO TO 63-EDIT-CURRENCY-CODE.
           MOVE DE3-INV-PCT             TO  BUILD-TM-DISCOUNT-VALUE.
           MOVE DE3-INV-DUE             TO  BUILD-TM-DATE-VALUE.
           PERFORM 631-EDIT-PAYMENT-TERMS  THRU  631-EPT-X.
           IF ERR-SW = "Y"
               MOVE MESSAGE-BUFFER      TO  DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(6)
               GO TO 63-SHOWFORM3.

      *************************************
      *                                   *
      *   EDIT CURRENCY CODE              *
      *                                   *
      *************************************

       63-EDIT-CURRENCY-CODE.
           IF DE3-CUR-CODE = PO-CURRENCY-CODE
               MOVE SPACES         TO INV-CURR-CODE
               GO TO 63-CONTINUE-EDITS.
           IF DE3-CUR-CODE = SPACES
               MOVE "CURRENCY CODE MUST BE ENTERED"
                                   TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(02)
               GO TO  63-SHOWFORM3.
           IF DE3-CUR-CODE NOT =  SAVE-HOME-CUR-CODE
               MOVE "INVOICE CURRENCY CODE MUST BE THE HOME CURRENCY IF
      -             "DIFFERENT THAN PO CURRENCY"
                                   TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(02)
               GO TO  63-SHOWFORM3.
           IF DE3-INV-NO-CHECK-INDIC = SPACES
               MOVE "SINCE INVOICE CURRENCY CODE DIFFERENT THAN PO, MUST
      -             " BE A NO-CHECK INVOICE"
                                   TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(42)
               GO TO  63-SHOWFORM3.

      *------------ VALIDATE CURRENCY CODE.
           IF DE3-CUR-CODE NOT = SPACES
               MOVE DE3-CUR-CODE                TO  BUILD-CC-VALUE
               MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC
               READ MVALIDUM-I INTO BUF-MVALIDUM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE  09107 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                   MOVE B"1" TO IND(99), IND(02)
                   GO TO 63-SHOWFORM3
               ELSE
                   MOVE  VALID-CURRENCY-DESC    TO  DE3-CUR-CODE-DESC.

       63-CONTINUE-EDITS.
           IF DE3-INV-CE = "A"
               PERFORM 631-SUFFIX-INV-NO  THRU  631-SIN-X.

           PERFORM 631-CHECK-DUP-INV  THRU  631-CDI-X.
           IF ERR-SW = "Y"
               GO TO 63-SHOWFORM3.

           IF DE3-ITEM-NO (1) = ZEROS
      *            * YOU MUST ENTER ITEM NUMBER, OR ALL *              LID *
               MOVE  66180 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(11)
               GO TO 63-SHOWFORM3.

           IF RESTART-INV-SW = "Y"
               PERFORM 631-DELETE-OLD-DINVRCD  THRU  631-DOD-X
           ELSE
               PERFORM  631-CREATE-REGNUM  THRU  631-CREATE-REGNUM-X.

       63-BUILD-DINVRCD.
           MOVE SPACE                TO  BUF-DINVRCD.
           MOVE ZERO                 TO  INV-I-MATL-EXT,
                                         INV-P-MATL-EXT,
                                         A-INV-EXT,
                                         A-PO-EXT,
                                         INV-ADD-VFRT,
                                         INV-ADD-INS,
                                         INV-ADD-TAX,
                                         INV-ADD-CTNRS,
                                         INV-ADD-OTHER,
                                         CE3-FRT,
                                         CE4-INS,
                                         CE5-TAX,
                                         CE6-EXT-ERR,
                                         CE7-UPRC-ERR,
                                         CE8-OTHER,
                                         CE9-CASH-DSCNT,
                                         CE-EXT-VALUE-1,
                                         INV-ADD-GST,
                                         INV-NET-DUE-VENDOR,
                                         INV-TOTAL-CFRT,
                                         INV-ATAX-AMT (1),
                                         INV-ATAX-AMT (2),
                                         INV-ATAX-AMT (3),
                                         INV-ATAX-AMT (4),
                                         INV-ADJ-OTHER,
                                         INV-DIST-COST.
           MOVE KS-EMPLOYEE-ID       TO  INV-ADD-CLERK.
           MOVE S-NEW-REGNUM         TO  INV-REG-NO,
                                         REGISTER-ARG,
                                         BU-DISPLAY-FLD (1).
           MOVE PO-ARG               TO  INV-PO-RCV-NO.
           MOVE "P"                  TO  INV-STATUS.
           MOVE VEN-ARG              TO  INV-VEN-CODE.
           MOVE DE3-INV-NUM          TO  INV-NO.
           MOVE S-ENTRY-DATE-CN      TO  INV-ENTRY-CN.
           MOVE S-INVOICE-DATE-CN    TO  INV-DATE-CN.
           MOVE DE3-INV-NO-CHECK-INDIC  TO  INV-NO-CHECK-INDIC.
           IF DE3-CUR-CODE NOT = PO-CURRENCY-CODE
               MOVE DE3-CUR-CODE     TO  INV-CURR-CODE
           ELSE
               MOVE SPACES           TO  INV-CURR-CODE.
           IF DE3-INV-TERMS NOT = SPACE
               MOVE DE3-INV-TERMS    TO  INV-TERMS
           ELSE
               MOVE DE3-PO-TERMS     TO  INV-TERMS.
           PERFORM  632-CALC-DUE-DATE  THRU  632-CALC-DUE-DATE-X.
           MOVE DE3-INV-CE           TO  CE1-CODE.
           IF DE3-INV-CE = "2" OR "Z"
               MULTIPLY  DE3-INV-AMT BY -1 GIVING CE1-TOTAL
           ELSE
               MOVE DE3-INV-AMT      TO  CE1-TOTAL.
           MOVE CE1-TOTAL            TO  S-ORIG-INV-AMT.
           MOVE DE3-INV-ACCTG        TO  CE1-ACCTG-DATA.
           IF DE3-INV-CE = "A"
               MOVE "A"              TO  CE-EXT-CODE-1
               MULTIPLY DE3-INV-AMT  BY -1  GIVING CE-EXT-VALUE-1
               MOVE "116061000"      TO  CE-EXT-ACCTG-DATA-1.

           PERFORM  633-DPODATAITM  THRU  633-DPODATAITM-X.

           IF VIEW-LASTKEY = 4
               MOVE "H"       TO  INV-STATUS
               GO TO 69-PUT-DINVRCD.

           IF DE3-INV-CE = "A"
               GO TO 69-PUT-DINVRCD.

       ITEM-MATCHING SECTION 04.
       64-FILLBUFF4.
           MOVE SPACE            TO  DE-BUFFER4.
           MOVE B-PO-NO          TO  DE4-PO.
           MOVE B-PO-RLSE        TO  DE4-RLSE.
           MOVE DE3-INV-NUM      TO  DE4-INV-NUM.
           MOVE S-NEW-REGNUM     TO  DE4-REG-NUM.
           MOVE ZERO             TO  DE-ITEM-SUB.

           IF DE3-ITEM-NO (1) = "ALL "  OR  " ALL"
               MOVE "Y"  TO  ALL-ITEMS-MSW
           ELSE
               PERFORM  641-SORT-ITEM-NUMBERS  THRU
                        641-SORT-ITEM-NUMBERS-X.

           IF RESTART-INV-SW NOT = "Y"
               GO TO 64A-PO-ITEMS.
           MOVE S-NEW-REGNUM  TO  REGISTER-ARG.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-I-REC.
           START DINVITM-I KEY = REGISTERNO OF DINVITM-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "START" TO  BU-DISPLAY-FLD (3)
                   MOVE SPACES  TO  BUF-DINVITM
                   MOVE "0000"  TO  S-INVITM-ITEM-NO
               ELSE
                   MOVE "START DINVITM 64-F4" TO BU-DISPLAY-MSG
                   GO TO 2100-BLOWUP
           ELSE
               PERFORM 641-GET-DINVITM  THRU  641-GD-X.

       64A-PO-ITEMS.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-I-REC.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START DPOITEM*64A-PI"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       64A-PO-SUB.
           IF ALL-ITEMS-MSW = "Y"
               GO TO  64A-PO-ITEM-LOOP.

           ADD +1  TO  DE-ITEM-SUB.
           IF DE-ITEM-SUB > 24
               IF RESTART-INV-SW = "Y"
                   GO TO 64A-PO-ITEM-LOOP
               ELSE
                   GO TO  65-FILLBUFF5.
           IF DE3-ITEM-NO (DE-ITEM-SUB) = SPACE
               GO TO  64A-PO-SUB.

       64A-PO-ITEM-LOOP.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO  65-FILLBUFF5
               ELSE
                   MOVE "READN DPOITEM*64A-CIL"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.
           IF PORCVNO OF DPOITEM-I-REC NOT = PO-ARG
               GO TO  65-FILLBUFF5.

           IF RESTART-INV-SW = "Y"
              IF ITM-NUMBER = S-INVITM-ITEM-NO
                  PERFORM 641-CALC-EXIST-ITEM-INFO  THRU  641-CEII-X
                  GO TO 64C-EDIT-AND-CALC-TAX
               ELSE
               IF DE-ITEM-SUB > 24
                   GO TO 64A-PO-ITEM-LOOP.

           IF ALL-ITEMS-MSW = "Y"
               NEXT SENTENCE
           ELSE
               IF DE3-ITEM-NO (DE-ITEM-SUB) = ITM-NUMBER
                   NEXT SENTENCE
               ELSE
                   GO TO  64A-PO-ITEM-LOOP.

           MOVE SPACE            TO  ITEM-CALC-AREAS,
                                     KEEP-PO-ITEM-DATA,
                                     DE4-ITEM-INFORMATION,
                                     S-DE4-SUBD-AREA.
           MOVE ZERO             TO  DE4-INV-UNPD-QTY,
                                     DE4-INV-UPRICE,
                                     DE4-INV-ITEM-EXT,
                                     DE4-PERCENT-9 (1),
                                     DE4-PERCENT-9 (2),
                                     DE4-PERCENT-9 (3),
                                     DE4-PERCENT-9 (4),
                                     DE4-PERCENT-9 (5).


           MOVE ITM-NUMBER              TO  DE4-ITEM-NO,
                                            S-BOTH-ITEM-NO.
           IF ITM-CORP-CODE = "NON-STR"
               MOVE "*******"           TO  DE4-CORPCODE
           ELSE
               MOVE ITM-CORP-CODE       TO  DE4-CORPCODE,
                                            CODE-ARG.
           MOVE "+"                     TO  DE4-PO-QTY-SIGN.
           IF DE3-INV-CE = "2" OR "Z"
               MOVE "-"                 TO  DE4-INV-QTY-SIGN
           ELSE
               MOVE "+"                 TO  DE4-INV-QTY-SIGN.
           MOVE ITM-UM                  TO  V-OLD-UM.
           MOVE ITM-PRICE-UM            TO  DE4-PO-UM,
                                            V-NEW-UM,
                                            K-PO-UM.
           MOVE ITM-UNIT-PRICE          TO  DE4-PO-UPRICE,
                                            K-PO-UPRICE.

           SUBTRACT  ITM-QTY-PAID       FROM  ITM-QTY-DLVR
                                              GIVING V-OLD-QTY.
           PERFORM  642-CALC-NEW-QTY  THRU  642-CALC-NEW-QTY-X.
           MOVE C-NEW-QTY               TO  DE4-PO-UNPD-QTY,
                                            K-PO-UNPD-QTY.
           MULTIPLY  C-NEW-QTY          BY  K-PO-UPRICE
                                        GIVING K-PO-ITEM-EXT ROUNDED.
           MOVE K-PO-ITEM-EXT           TO  DE4-PO-ITEM-EXT.

           MOVE ITM-QTY-PAID            TO  V-OLD-QTY.
           PERFORM 642-CALC-NEW-QTY  THRU  642-CALC-NEW-QTY-X.
           MOVE C-NEW-QTY               TO  K-PO-QTY-PAID.
           IF DE3-TAX-CODE NOT = SPACES
               MOVE  DE3-TAX-CODE       TO  DE4-INV-ITEM-TAX-CODE
           ELSE
               MOVE ITM-TAX-CODE        TO  DE4-INV-ITEM-TAX-CODE.
           MOVE PO-PRIME                TO  DE4-PRIME (1).
           MOVE ITM-CLASS               TO  DE4-SUB (1).
           IF ITM-CORP-CODE = "NON-STR"
               NEXT SENTENCE
           ELSE
               IF DE4-SUB (1)  =  SPACES
                   MOVE STR-CLASS       TO  DE4-SUB (1).
           MOVE ITM-SUB-DETL            TO  DE4-SUBD (1), S-ITM-SUBD.
           IF ITM-ADDL-DATA = SPACES
               MOVE "000000"            TO  DE4-ADDL-DATA (1)
           ELSE
               MOVE ITM-ADDL-DATA       TO  DE4-ADDL-DATA (1).
           MOVE "10000"                 TO  DE4-PERCENT (1).

           IF ITM-CORP-CODE = "NON-STR"
               PERFORM 641-GET-NONCODED-DESC  THRU  641-GND-X
           ELSE
               PERFORM 641-GET-CODED-DESC  THRU  641-GCD-X.

       64C-FILLBUFF4-CONT.
           MOVE INVMATCH  TO  VIEW-NFNAME.

       64C-SHOWFORM4.
           MOVE DE-BUFFER4     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER4.
           IF VIEW-LASTKEY = 1
               MOVE "F1"       TO BU-DISPLAY-FLD (3)
               PERFORM  643-CALC-VALUES  THRU  643-CALC-VALUES-X
               MOVE SPACE  TO  CALC-ERROR-SW
               GO TO  64C-SHOWFORM4
           ELSE
           IF VIEW-LASTKEY = 3
               MOVE "F3"       TO BU-DISPLAY-FLD (3)
               IF RESTART-INV-SW = "Y"
                   MOVE 25  TO  DE-ITEM-SUB
                   GO TO 64A-PO-ITEM-LOOP
               ELSE
                   GO TO 65-FILLBUFF5
           ELSE
           IF VIEW-LASTKEY = 4
               MOVE "F4"       TO BU-DISPLAY-FLD (3)
               MOVE "Y"  TO  S-HOLD-FLAG
               PERFORM 661-GET-FREE-VERBAGE  THRU  661-GFV-X
               MOVE DE4-HOLD-VERBAGE TO INV-FREE-VERB
               GO TO  64A-PO-SUB
           ELSE
           IF VIEW-LASTKEY = 5
               MOVE "F5"       TO BU-DISPLAY-FLD (3)
               GO TO 64A-PO-SUB
           ELSE
           IF VIEW-LASTKEY = 6
               MOVE "F6"       TO BU-DISPLAY-FLD (3)
               PERFORM 621-CALL-RSINQ  THRU  621-CR-X
               PERFORM 641-CALC-GET-DPOITEM  THRU
                       641-CALC-GET-DPOITEM-X
               GO TO 64C-FILLBUFF4-CONT
           ELSE
9211CK*    IF VIEW-LASTKEY = 2  OR
           IF VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(67)
               GO TO  64C-SHOWFORM4.

      *    IF DE4-INV-UNPD-QTY = ZERO
      *        ***  INVOICE QUANTITY PAID IS REQUIRED  ***
      *        MOVE  66257 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
      *        MOVE B"1" TO IND(99), IND(67)
      *        GO TO  64C-SHOWFORM4.

           IF DE4-INV-QTY-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(95)
               GO TO  64C-SHOWFORM4.
           IF DE4-INV-QTY-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(95)
               GO TO  64C-SHOWFORM4.

           IF DE4-INV-ITEM-TAX-CODE = SPACES
      *        ***  TAX CODE IS REQUIRED  ***
               MOVE  66260 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(97)
               GO TO  64C-SHOWFORM4.

           IF DE4-INV-MEMO-INDIC = "X" OR SPACES
               NEXT SENTENCE
           ELSE
      *        ***  ENTER AN 'X' TO DENOTE THIS IS A MEMO QUANTITY ***
               MOVE  66261 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(96)
               GO TO  64C-SHOWFORM4.

           MOVE DE4-PRIME (1)    TO  PRIME-REDEFINED.
           MOVE 1                TO  INDX.
           PERFORM UNTIL INDX > 3 OR CALC-ERROR-SW = "Y"
               IF PRIME-BYTE (INDX)  = SPACES
      *       ***  PRIME MUST BE A 3 DIGIT NUMBER  ***
                   MOVE 66262 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(18)
                   MOVE "Y"  TO CALC-ERROR-SW
               END-IF
               ADD 1 TO INDX
           END-PERFORM.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACES TO CALC-ERROR-SW
               GO TO  64C-SHOWFORM4.

           MOVE 1                TO  INDX.
           MOVE DE4-SUB (1)      TO  SUB-REDEFINED.
           PERFORM UNTIL INDX > 3 OR CALC-ERROR-SW = "Y"
               IF SUB-BYTE (INDX)  = SPACES
      *       ***  SUB MUST BE A 3 DIGIT NUMBER  ***
                   MOVE 66263 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(19)
                   MOVE "Y"  TO CALC-ERROR-SW
               END-IF
               ADD 1 TO INDX
           END-PERFORM.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACES TO CALC-ERROR-SW
               GO TO  64C-SHOWFORM4.

           IF DE4-SUBD (1) = SPACES
      *        ***  DEPARTMENT NUMBER IS REQUIRED  ***
               MOVE  66264 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(20)
               GO TO  64C-SHOWFORM4.
           PERFORM  643-CALC-VALUES  THRU  643-CALC-VALUES-X.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACE  TO  CALC-ERROR-SW
               GO TO  64C-SHOWFORM4.


       64C-BUILD-DINVITM.
           MOVE SPACE             TO  BUF-DINVITM.
           MOVE S-NEW-REGNUM      TO  INVITM-REG-NO.
           MOVE S-BOTH-ITEM-NO    TO  INVITM-ITEM-NO.
           IF DE4-CORPCODE = "*******"
               MOVE "NON-STR"     TO  INVITM-CORPCODE
           ELSE
               MOVE DE4-CORPCODE  TO  INVITM-CORPCODE.
           MOVE DE4-INV-MEMO-INDIC  TO  INVITM-MEMO-INDIC.

           MOVE W-PO-UNPD-QTY    TO  INVITM-PO-QTY-PD.
           MOVE W-PO-UM          TO  INVITM-PO-UM.
           MOVE W-PO-UPRICE      TO  INVITM-PO-UPRICE.
           MOVE W-INV-UNPD-QTY   TO  INVITM-INV-QTY-PD.
           MOVE W-INV-UPRICE     TO  INVITM-INV-UPRICE.


           MOVE ZERO  TO  F-ACCT-PCT.
           MOVE 1     TO  ACCT-SUB.

           PERFORM 641-EDIT-DEPT THRU 641-ED-X.
           IF CALC-ERROR-SW = "Y"
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1"           TO IND(99), IND(20)
               MOVE SPACES         TO CALC-ERROR-SW
               GO TO 64C-SHOWFORM4.

           IF DE4-ADDL-DATA (ACCT-SUB) NOT = SPACE
               IF DE4-PERCENT-9 (ACCT-SUB) NOT = ZERO
                   ADD DE4-PERCENT-9 (ACCT-SUB) TO F-ACCT-PCT
                   GO TO 64C-CHECK-ACCTG-ENTRIES.
      *    ***  YOU MUST ENTER AT LEAST ONE LINE OF ACCOUNTING DATA ***
           MOVE  25 TO LANG-SETNUM.
           MOVE   7 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE4-MSG-LINE.
           MOVE B"1" TO IND(99), IND(18).
           GO TO  64C-SHOWFORM4.

       64C-CHECK-ACCTG-ENTRIES.
           ADD 1  TO  ACCT-SUB.
           IF ACCT-SUB > 5
               IF F-ACCT-PCT = 100.00
                   GO TO  64C-EDIT-AND-CALC-TAX
               ELSE
      *            ***  ACCOUNTING PERCENTAGES DO NOT TOTAL 100% ***
                   MOVE   1 TO LANG-SETNUM
                   MOVE   2 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(24)
                   GO TO  64C-SHOWFORM4.

           IF ACCT-SUB = 1
               MOVE 18                 TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 2
               MOVE 26                 TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 3
               MOVE 34                 TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 4
               MOVE 82                 TO  FIELD-NUMBER
           ELSE
               MOVE 88                 TO  FIELD-NUMBER.

           IF DE4-ACCTG-ENTRY (ACCT-SUB) = SPACES
               GO TO 64C-CHECK-ACCTG-ENTRIES.
           IF DE4-PRIME (ACCT-SUB) = SPACES
               MOVE DE4-PRIME (1)      TO  DE4-PRIME (ACCT-SUB)
           ELSE
               MOVE 1   TO  INDX
               MOVE DE4-PRIME (ACCT-SUB) TO PRIME-REDEFINED
               PERFORM UNTIL INDX > 3 OR CALC-ERROR-SW = "Y"
                   IF PRIME-BYTE (INDX)  = SPACES
      *       ***  PRIME MUST BE A 3 DIGIT NUMBER  ***
                       MOVE 66262 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
               END-PERFORM
               IF CALC-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   MOVE SPACES TO CALC-ERROR-SW
                   GO TO 64C-SHOWFORM4.

           IF DE4-SUB (ACCT-SUB) = SPACES
               MOVE DE4-SUB (1)        TO  DE4-SUB (ACCT-SUB)
           ELSE
               MOVE 1   TO  INDX
               MOVE DE4-SUB (ACCT-SUB) TO SUB-REDEFINED
               PERFORM UNTIL INDX > 3 OR CALC-ERROR-SW = "Y"
                   IF SUB-BYTE (INDX)  = SPACES
      *       ***  SUB MUST BE A 3 DIGIT NUMBER  ***
                       MOVE 66263 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD
                              THRU 999-CATREAD-EXIT
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
               END-PERFORM
               IF CALC-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   MOVE SPACES TO CALC-ERROR-SW
                   GO TO 64C-SHOWFORM4.

           IF DE4-SUBD (ACCT-SUB) = SPACES
               MOVE DE4-SUBD (1)       TO  DE4-SUBD (ACCT-SUB)
           ELSE
               PERFORM 641-EDIT-DEPT  THRU  641-ED-X
               IF CALC-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1"           TO IND(99), IND(FIELD-NUMBER)
                   MOVE SPACES         TO  CALC-ERROR-SW
                   GO TO 64C-SHOWFORM4.
           IF DE4-ADDL-DATA (ACCT-SUB) = SPACES
               MOVE DE4-ADDL-DATA (1)  TO  DE4-ADDL-DATA (ACCT-SUB).
           ADD DE4-PERCENT-9 (ACCT-SUB)  TO  F-ACCT-PCT.
           GO TO 64C-CHECK-ACCTG-ENTRIES.

       64C-EDIT-AND-CALC-TAX.
           MOVE DE4-INV-ITEM-TAX-CODE TO  TAX-ARG.
           MOVE 97                    TO  FIELD-NUMBER.
           PERFORM 641-EDIT-TAX-CODE  THRU  641-ETC-X.
           IF ERR-SW = "Y"
               IF RESTART-INV-SW = "Y"
                   IF INVITM-ITEM-NO = S-INVITM-ITEM-NO
                       GO TO 64C-LOCK2
                   ELSE
                       MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                       MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                       GO TO 64C-SHOWFORM4
               ELSE
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 64C-SHOWFORM4.
           MOVE ZEROS                   TO  SUB1.
           MOVE DE4-INV-ITEM-TAX-CODE   TO  INVITM-TAX-CODE.

       64C-CALC-TAX-LOOP.
           IF GST-ENTRY EQUAL ZERO

             MOVE 0 TO INV-GST-TAX, PO-GST-TAX

           ELSE

             COMPUTE PO-GST-TAX ROUNDED =
               (MTAX-PERCENT(GST-ENTRY) / 100.0000000) *
               W-PO-ITEM-EXT
             COMPUTE INV-GST-TAX ROUNDED =
               (MTAX-PERCENT(GST-ENTRY) / 100.0000000) *
               W-INV-ITEM-EXT
             EVALUATE MTAX-PAY-INDIC(GST-ENTRY)
               WHEN "P"

                 ADD PO-GST-TAX TO PO-PAY-TAX-CHRG(GST-ENTRY)
                 ADD INV-GST-TAX TO INV-PAY-TAX-CHRG(GST-ENTRY)

               WHEN "A"

                 ADD PO-GST-TAX TO PO-ACCRUE-TAX-CHRG(GST-ENTRY)
                 ADD INV-GST-TAX TO INV-ACCRUE-TAX-CHRG(GST-ENTRY)

             END-EVALUATE

           END-IF.
           IF TAX-ON-GST

             PERFORM VARYING SUB1 FROM 1 BY 1
                     UNTIL SUB1 > 4

              IF SUB1 NOT EQUAL GST-ENTRY

                 EVALUATE MTAX-PAY-INDIC(SUB1)
                   WHEN "P"

                     COMPUTE PO-PAY-TAX-CHRG(SUB1) ROUNDED =
                       PO-PAY-TAX-CHRG(SUB1) +
                       ((W-PO-ITEM-EXT + PO-GST-TAX) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))
                     COMPUTE INV-PAY-TAX-CHRG(SUB1) ROUNDED =
                       INV-PAY-TAX-CHRG(SUB1) +
                       ((W-INV-ITEM-EXT + INV-GST-TAX) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))

                   WHEN "A"

                     COMPUTE PO-ACCRUE-TAX-CHRG(SUB1) ROUNDED =
                       PO-ACCRUE-TAX-CHRG(SUB1) +
                       ((W-PO-ITEM-EXT + PO-GST-TAX) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))
                     COMPUTE INV-ACCRUE-TAX-CHRG(SUB1) ROUNDED =
                       INV-ACCRUE-TAX-CHRG(SUB1) +
                       ((W-INV-ITEM-EXT + INV-GST-TAX) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))

                 END-EVALUATE

               END-IF

             END-PERFORM

           ELSE

             PERFORM VARYING SUB1 FROM 1 BY 1
                     UNTIL SUB1 > 4

               IF SUB1 NOT EQUAL GST-ENTRY

                 EVALUATE MTAX-PAY-INDIC(SUB1)
                   WHEN "P"

                     COMPUTE PO-PAY-TAX-CHRG(SUB1) ROUNDED =
                       PO-PAY-TAX-CHRG(SUB1) +
                       ((W-PO-ITEM-EXT) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))
                     COMPUTE INV-PAY-TAX-CHRG(SUB1) ROUNDED =
                       INV-PAY-TAX-CHRG(SUB1) +
                       ((W-INV-ITEM-EXT) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))

                   WHEN "A"

                     COMPUTE PO-ACCRUE-TAX-CHRG(SUB1) ROUNDED =
                       PO-ACCRUE-TAX-CHRG(SUB1) +
                       ((W-PO-ITEM-EXT) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))
                     COMPUTE INV-ACCRUE-TAX-CHRG(SUB1) ROUNDED =
                       INV-ACCRUE-TAX-CHRG(SUB1) +
                       ((W-INV-ITEM-EXT) *
                        (MTAX-PERCENT(SUB1) / 100.0000000))

                 END-EVALUATE

               END-IF

             END-PERFORM

           END-IF.

       64C-LOCK2.
           MOVE "Y"                     TO  AT-LEAST-ONE-ITEM-SW.
           ADD C-EXT-DIFF               TO  C-CE8-DIFF.
           ADD W-PO-ITEM-EXT            TO  A-PO-EXT  ROUNDED.
           ADD W-INV-ITEM-EXT           TO  A-INV-EXT  ROUNDED.

           IF RESTART-INV-SW = "Y"
              IF S-INVITM-ITEM-NO = ITM-NUMBER
                 PERFORM 641-GET-DINVITM  THRU  641-GD-X
                 GO TO 64A-PO-ITEM-LOOP.

       64C-PUT-DINVITM.
           MOVE INVITM-REG-NO  TO REGISTERNO OF DINVITM-O-REC.
           MOVE INVITM-ITEM-NO TO ITEMNO     OF DINVITM-O-REC.
           START DINVITM-O KEY = EXTERNALLY-DESCRIBED-KEY
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS  = "00"
               MOVE "DUP ITEM WITH THIS REG-NO FOUND*64C-PUT-DINVITM"
                    TO BU-DISPLAY-MSG
               MOVE INVITM-ITEM-NO TO BU-DISPLAY-FLD (4)
               GO TO  2100-BLOWUP.

           WRITE DINVITM-O-REC FROM BUF-DINVITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DINVITM*64C-PDI"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           MOVE ZERO  TO  ACCT-SUB.

       64C-PUT-DINVACCT.
           ADD 1  TO  ACCT-SUB.
           IF ACCT-SUB > 5
                GO TO  64C-UNLOCK2.
           IF DE4-PRIME (ACCT-SUB) = SPACE
               GO TO  64C-PUT-DINVACCT.

           MOVE SPACE                     TO  BUF-DINVACCT.
           MOVE S-NEW-REGNUM              TO  INVACCT-REG-NO.
           MOVE S-BOTH-ITEM-NO            TO  INVACCT-ITEM.
           MOVE ACCT-SUB                  TO  INVACCT-LINE.
           MOVE DE4-PRIME (ACCT-SUB)      TO  INVACCT-PRIME.
           MOVE DE4-SUB (ACCT-SUB)        TO  INVACCT-SUB.
           MOVE DE4-SUBD (ACCT-SUB)       TO  INVACCT-SUBD.
           MOVE DE4-ADDL-DATA (ACCT-SUB)  TO  INVACCT-ADDL-DATA.
           MOVE DE4-PERCENT-9 (ACCT-SUB)  TO  INVACCT-PCT.

           MOVE INVACCT-REG-NO TO REGISTERNO OF DINVACCT-O-REC.
           MOVE INVACCT-ITEM-LINE TO ITEMSEQNO OF DINVACCT-O-REC.
           START DINVACCT-O KEY = EXTERNALLY-DESCRIBED-KEY
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS  = "00"
               MOVE INVACCT-ITEM-LINE  TO BU-DISPLAY-FLD (4)
               MOVE "START DINVACCT*64C-PDA"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           WRITE DINVACCT-O-REC FROM BUF-DINVACCT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DINVACCT*64C-PDA"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           GO TO  64C-PUT-DINVACCT.

       64C-UNLOCK2.
           GO TO  64A-PO-SUB.


       PAYMENT SECTION 05.
       65-FILLBUFF5.
      *    IF AT-LEAST-ONE-ITEM-SW = "Y"
      *        NEXT SENTENCE
      *    ELSE
      *        PERFORM 651-BACKOUT-REGNUM  THRU  651-BACKOUT-REGNUM-X
      *        GO TO 6-MAIN.

           IF S-HOLD-FLAG = "Y"
               MOVE "I"                 TO  INV-STATUS
               MOVE A-PO-EXT            TO  INV-P-MATL-EXT
               MOVE A-INV-EXT           TO  INV-I-MATL-EXT
               MOVE DE4-INV-ITEM-TAX-CODE    TO  INV-TAX-CODE
               GO TO  69-PUT-DINVRCD.

           IF A-PO-EXT > A-INV-EXT
               SUBTRACT  A-INV-EXT  FROM  A-PO-EXT
                                    GIVING C-EXT-DIFF
           ELSE
               SUBTRACT  A-PO-EXT  FROM  A-INV-EXT
                                   GIVING C-EXT-DIFF.

           IF C-EXT-DIFF = ZERO
               MOVE A-PO-EXT            TO  INV-P-MATL-EXT
               MOVE A-INV-EXT           TO  INV-I-MATL-EXT
               MOVE "P"                 TO  DE5-PAY-FLAG
               GO TO  66-FILLBUFF6.

           MOVE SPACE                   TO  DE-BUFFER5.
           MOVE B-PO-NO                 TO  DE5-PO.
           MOVE B-PO-RLSE               TO  DE5-RLSE.
           MOVE DE3-INV-NUM             TO  DE5-INV-NUM.
           MOVE S-NEW-REGNUM            TO  DE5-REG-NUM.
           MOVE A-PO-EXT                TO  DE5-PO-MTL-EXT,
                                            INV-P-MATL-EXT.
           MOVE A-INV-EXT               TO  DE5-INV-MTL-EXT,
                                            INV-I-MATL-EXT.
           MOVE C-EXT-DIFF              TO  DE5-EXT-DIFF.

           MOVE INVPAY                  TO  VIEW-NFNAME.

       65-SHOWFORM5.
           MOVE DE-BUFFER5     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER5.
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 3  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  65-SHOWFORM5.

            IF DE5-PAY-FLAG = SPACES AND DE5-HOLD-FLAG = SPACES
      *        ***  YOU MUST CHOOSE TO 'PAY' OR 'HOLD' THIS INVOICE
               MOVE  66265 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  65-SHOWFORM5.
            IF DE5-PAY-FLAG NOT = SPACES
                IF DE5-HOLD-FLAG NOT = SPACES
      *        ***  CHOOSE ONLY ONE OPTION TO 'PAY' OR 'HOLD'
               MOVE  66266 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  65-SHOWFORM5.
            IF DE5-PAY-FLAG = "P" OR "I" OR SPACES
               NEXT SENTENCE
            ELSE
      *        ***  VALID PAYMENT CHARACTERS ARE 'P' OR 'I'
               MOVE  66269 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  65-SHOWFORM5.

            IF DE5-HOLD-FLAG = "H"
               NEXT SENTENCE
            ELSE
              IF DE5-HOLD-FLAG = SPACES
               IF DE5-HOLD-VERBAGE NOT = SPACES
      *        ***  CANNOT ENTER HOLD FREE VERBAGE UNLESS HOLD OPTION
                   MOVE  66268 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
                   MOVE B"1" TO IND(99), IND(11)
                   GO TO  65-SHOWFORM5
               ELSE
                   NEXT SENTENCE
              ELSE
      *        ***  VALID HOLD CHARACTER IS AN 'H'
               MOVE  66267 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE5-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  65-SHOWFORM5.

       65-SHOWFORM5-CONT.
           IF DE5-HOLD-FLAG = "H"
               MOVE "H"                 TO  INV-STATUS
               MOVE DE5-HOLD-VERBAGE    TO  INV-FREE-VERB
               MOVE DE4-INV-ITEM-TAX-CODE    TO  INV-TAX-CODE
               GO TO  69-PUT-DINVRCD.

       66-FILLBUFF6.
           IF DE5-PAY-FLAG = "P"
               ADD A-PO-EXT             TO  A-INV-TOTAL
               MOVE "P"                 TO  INV-PAYMENT-IND
           ELSE
           IF DE5-PAY-FLAG = "I"
               ADD A-INV-EXT            TO  A-INV-TOTAL
               MOVE "I"                 TO  INV-PAYMENT-IND.

           MOVE SPACE                   TO  DE-BUFFER6.

      *
      * IF A GST ENTRY WAS FOUND THEN PUT GST INFO ON THE SCREEN
      * OTHERWISE LEAVE IT BLANK
      *
           IF GST-ENTRY = 0

             MOVE 0 TO GST-AMOUNT

           ELSE

             MOVE "GST AMOUNT" TO DE6-GST-HEADER
             EVALUATE DE5-PAY-FLAG
               WHEN "P"

                 IF PO-PAY-TAX-CHRG(GST-ENTRY) >= 0
                   MOVE "+" TO DE6-GST-SIGN
                 ELSE
                   MOVE "-" TO DE6-GST-SIGN
                 END-IF
                 COMPUTE GST-AMOUNT ROUNDED =
                         PO-PAY-TAX-CHRG(GST-ENTRY)

               WHEN "I"

                 IF INV-PAY-TAX-CHRG(GST-ENTRY) > 0
                   MOVE "+" TO DE6-GST-SIGN
                 ELSE
                   MOVE "-" TO DE6-GST-SIGN
                 END-IF
                 COMPUTE GST-AMOUNT ROUNDED =
                         INV-PAY-TAX-CHRG(GST-ENTRY)

             END-EVALUATE

           END-IF.
           MOVE GST-AMOUNT TO DE6-GST-AMOUNT.

           MOVE B-PO-NO                 TO  DE6-PO.
           MOVE B-PO-RLSE               TO  DE6-RLSE.
           MOVE DE3-INV-NUM             TO  DE6-INV-NUM.
           MOVE S-NEW-REGNUM            TO  DE6-REG-NUM.
           MOVE A-INV-TOTAL             TO  DE6-MATL-EXT.
           MOVE "+"                     TO  DE6-FRT-SIGN,
                                            DE6-CTNR-SIGN,
                                            DE6-INS-SIGN,
                                            DE6-OTHER-SIGN.
           MOVE PO-FOB                  TO  DE6-FOB.
           MOVE DE4-INV-ITEM-TAX-CODE   TO  DE6-TAX-CODE,
                                            SAVE-TAX-CODE.
           MOVE CE1-TOTAL               TO  DE6-INV-AMT.
           MOVE DE3-INV-CE              TO  DE6-INV-CE.
           MOVE CE1-ACCTG-DATA          TO  DE6-INV-ACCTG.
           IF INV-CURR-CODE NOT = SPACES
               MOVE INV-CURR-CODE       TO  DE6-CUR-CODE
           ELSE
               MOVE PO-CURRENCY-CODE    TO  DE6-CUR-CODE.

           IF DE3-CUR-CODE NOT = SPACES AND
                              DE3-CUR-CODE NOT = PO-CURRENCY-CODE
               MOVE DE3-CUR-CODE              TO  BUILD-CC-VALUE
           ELSE
               MOVE PO-CURRENCY-CODE          TO  BUILD-CC-VALUE.
           MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MVALIDUM*63F-CUR-CODE" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           MOVE  VALID-CURRENCY-DESC          TO  DE6-CUR-CODE-DESC.

           MOVE ZEROS                   TO  S-TAX-TO-VENDOR,
                                            DE6-VEN-FRT,
                                            DE6-VEN-TAX,
                                            DE6-VEN-CTNRS,
                                            DE6-VEN-INS,
                                            DE6-VEN-OTHER.
           PERFORM VARYING SUB1 FROM 1 BY 1
                   UNTIL SUB1 > 4

             IF SUB1 NOT EQUAL GST-ENTRY

               IF DE5-PAY-FLAG = "P"
                 ADD PO-PAY-TAX-CHRG(SUB1) TO S-TAX-TO-VENDOR
               ELSE
                 IF DE5-PAY-FLAG = "I"
                   ADD INV-PAY-TAX-CHRG(SUB1) TO S-TAX-TO-VENDOR
                 END-IF
               END-IF

             END-IF

           END-PERFORM.

           COMPUTE DE6-VEN-TAX ROUNDED = S-TAX-TO-VENDOR.
           IF S-TAX-TO-VENDOR < ZEROS
               MOVE "-"                 TO  DE6-TAX-SIGN
           ELSE
               MOVE "+"                 TO  DE6-TAX-SIGN.

           MOVE INVINCLUDE              TO  VIEW-NFNAME.

       66-SHOWFORM6.
           IF GST-ENTRY EQUAL ZERO
             MOVE B"0" TO IND(34)
           ELSE
             MOVE B"1" TO IND(34)
           END-IF.
           MOVE "N"                     TO  CALC-TAX-FRT-SW,
                                            TAX-ERROR-SW.
           MOVE DE-BUFFER6              TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  DE-BUFFER6.
           IF VIEW-LASTKEY = 1
               PERFORM 661-VERIFY-TAX-CODE THRU 661-VTC-X
               IF TAX-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 66-SHOWFORM6
               ELSE
               MOVE A-INV-TOTAL  TO  S-CALC-INV-AMT
               PERFORM  661-CALC-VALUES  THRU  661-CALC-VALUES-X
               MOVE SPACE  TO  CALC-ERROR-SW
               GO TO  66-SHOWFORM6
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE "Y"  TO  CALC-TAX-FRT-SW
               PERFORM 661-VERIFY-TAX-CODE THRU 661-VTC-X
               IF TAX-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 66-SHOWFORM6
               ELSE
               MOVE A-INV-TOTAL  TO  S-CALC-INV-AMT
               PERFORM  661-CALC-VALUES  THRU  661-CALC-VALUES-X
               MOVE SPACE  TO  CALC-ERROR-SW
               GO TO  66-SHOWFORM6
           ELSE
           IF VIEW-LASTKEY = 4
               MOVE 32 TO  FIELD-NUMBER
               PERFORM 661-GET-FREE-VERBAGE  THRU  661-GFV-X
               MOVE DE6-HOLD-VERBAGE TO INV-FREE-VERB
               PERFORM 661-VERIFY-TAX-CODE   THRU  661-VTC-X
               IF TAX-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 66-SHOWFORM6
               ELSE
                   GO TO 69-PUT-DINVRCD
           ELSE
           IF VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(6)
               GO TO  66-SHOWFORM6.

           IF DE6-FRT-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  66-SHOWFORM6.
           IF DE6-FRT-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  66-SHOWFORM6.

           IF DE6-TAX-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  66-SHOWFORM6.
           IF DE6-TAX-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  66-SHOWFORM6.

           IF DE6-CTNR-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  66-SHOWFORM6.
           IF DE6-CTNR-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  66-SHOWFORM6.

           IF DE6-INS-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(18)
               GO TO  66-SHOWFORM6.
           IF DE6-INS-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(18)
               GO TO  66-SHOWFORM6.

           IF DE6-OTHER-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(21)
               GO TO  66-SHOWFORM6.
           IF DE6-OTHER-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(21)
               GO TO  66-SHOWFORM6.

           IF GST-ENTRY NOT EQUAL ZERO
             IF DE6-GST-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
                MOVE  66258 TO CATREAD-MSG-NUMBER
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                MOVE B"1" TO IND(99), IND(33)
                GO TO  66-SHOWFORM6
             END-IF
             IF DE6-GST-SIGN = "+" OR "-"
                NEXT SENTENCE
             ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
                MOVE  66259 TO CATREAD-MSG-NUMBER
                PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                MOVE B"1" TO IND(99), IND(33)
                GO TO  66-SHOWFORM6
             END-IF
           END-IF.

           IF DE6-INV-ACCTG = SPACES
      *        ***  ACCOUNTING DATA FOR THE C/E IS REQUIRED  ***
               MOVE  66276 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(31)
               GO TO  66-SHOWFORM6.

      ***************************************************
      **  CHECK FOR AT LEAST ONE INVOICE ITEM IF THERE
      **  ARE NO ITEMS (AT-LEAST-ONE-ITEM-SW ="N") THEN
      **  THEN FORCE THE USER TO PUT THE INVOICE ON
      **  HOLD (PRESS 'f4')
      ***************************************************

           IF AT-LEAST-ONE-ITEM-SW = "Y"
               NEXT SENTENCE
           ELSE
      *        *** NO ITEMS EXIST FOR THE INVOICE; MUST PUT INVOICE ON HOLD ***
               MOVE  14 TO LANG-SETNUM
               MOVE  17 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(6)
               GO TO 66-SHOWFORM6.

           MOVE "N"                     TO  END-INV-ENTRY-SW.
           IF VIEW-LASTKEY = 3
               PERFORM 661-VERIFY-TAX-CODE THRU 661-VTC-X
               IF TAX-ERROR-SW = "Y"
                   MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 66-SHOWFORM6
               ELSE
               MOVE "Y"                 TO  END-INV-ENTRY-SW.

           PERFORM 661-VERIFY-TAX-CODE  THRU 661-VTC-X.
           MOVE A-INV-TOTAL  TO  S-CALC-INV-AMT.
           IF TAX-ERROR-SW = "Y"
               MOVE MESSAGE-BUFFER TO DE6-MSG-LINE
               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
               GO TO 66-SHOWFORM6.
           PERFORM  661-CALC-VALUES  THRU  661-CALC-VALUES-X.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACE               TO  CALC-ERROR-SW
               GO TO  66-SHOWFORM6.
           MOVE S-CALC-INV-AMT          TO  A-INV-TOTAL.
           MOVE DE6-INV-ACCTG           TO  CE1-ACCTG-DATA.

       67-FILLBUFF7.
           MOVE SPACE                   TO  DE-BUFFER7.
           MOVE B-PO-NO                 TO  DE7-PO.
           MOVE B-PO-RLSE               TO  DE7-RLSE.
           MOVE DE3-INV-NUM             TO  DE7-INV-NUM.
           MOVE S-NEW-REGNUM            TO  DE7-REG-NUM.
           MOVE CE1-ACCTG-DATA          TO  DE7-INV-ACCTG.
           MOVE S-ORIG-INV-AMT          TO  DE7-ORIG-INV-AMT.
           MOVE DE3-INV-CE              TO  DE7-INV-CE.
           MOVE A-INV-TOTAL             TO  DE7-AMT-TO-BE-PAID.
           MOVE "-"                     TO  DE7-CE3-SIGN,
                                            DE7-CE4-SIGN,
                                            DE7-CE5-SIGN,
                                            DE7-CE6-SIGN,
                                            DE7-CE7-SIGN,
                                            DE7-CE8-SIGN,
                                            DE7-CE9-SIGN,
                                            DE7-EXT-CE-SIGN,
                                            DE7-CPW-SIGN.

           MOVE ZERO                    TO  DE7-CE6-EXT-ERR,
                                            DE7-CE7-UP-ERR,
                                            DE7-CE8-OTHER,
                                            DE7-CE3-FRT,
                                            DE7-CE4-INS,
                                            DE7-CE5-TAX,
                                            DE7-CE9-CASHD,
                                            DE7-CPW,
                                            DE7-EXT-CE-AMT,
                                            CE6-EXT-ERR,
                                            CE7-UPRC-ERR,
                                            CE8-OTHER,
                                            C-CE-DIFF,
                                            C-CE6-DIFF,
                                            C-CE7-DIFF,
                                            S-NEG-VALUE.

           IF INV-PAYMENT-IND = "P"
               SUBTRACT S-ORIG-INV-AMT  FROM  A-INV-TOTAL
                                        GIVING C-CE6-DIFF
               SUBTRACT INV-I-MATL-EXT  FROM  INV-P-MATL-EXT
                                        GIVING C-CE7-DIFF
               MULTIPLY -1  BY  C-CE8-DIFF
               SUBTRACT C-CE8-DIFF  FROM  C-CE7-DIFF
               SUBTRACT C-CE8-DIFF, C-CE7-DIFF  FROM  C-CE6-DIFF
               MOVE C-CE8-DIFF          TO  CE8-OTHER,
                                            DE7-CE8-OTHER
           ELSE
               SUBTRACT S-ORIG-INV-AMT  FROM  A-INV-TOTAL
                                        GIVING C-CE6-DIFF.
           MOVE C-CE6-DIFF              TO  CE6-EXT-ERR,
                                            DE7-CE6-EXT-ERR.
           MOVE C-CE7-DIFF              TO  CE7-UPRC-ERR,
                                            DE7-CE7-UP-ERR.
           IF C-CE6-DIFF > 0
               MOVE "+"                 TO  DE7-CE6-SIGN.
           IF C-CE7-DIFF > 0
               MOVE "+"                 TO  DE7-CE7-SIGN.

           IF END-INV-ENTRY-SW = "Y"
               IF C-CE6-DIFF = ZEROS  AND
                  C-CE7-DIFF = ZEROS  AND
                  C-CE8-DIFF = ZEROS
                    GO TO 68-FILLBUFF8.

           MOVE INVDEDUCT  TO  VIEW-NFNAME.

       67-SHOWFORM7.
           MOVE DE-BUFFER7     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER7.
           IF VIEW-LASTKEY = 1
               MOVE A-INV-TOTAL  TO  S-CALC-INV-AMT
               PERFORM  671-CALC-VALUES  THRU  671-CALC-VALUES-X
               MOVE SPACE  TO  CALC-ERROR-SW
               GO TO  67-SHOWFORM7
           ELSE
           IF VIEW-LASTKEY = 4
               MOVE 53  TO  FIELD-NUMBER
               PERFORM 661-GET-FREE-VERBAGE  THRU  661-GFV-X
               MOVE DE7-HOLD-VERBAGE TO INV-FREE-VERB
               GO TO 69-PUT-DINVRCD
           ELSE

           IF VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(24)
               GO TO  67-SHOWFORM7.

           MOVE "N"                     TO  END-INV-ENTRY-SW.
           IF VIEW-LASTKEY = 3
               MOVE "Y"                 TO  END-INV-ENTRY-SW.

           IF DE7-INV-ACCTG = SPACES
      *        ***  ACCOUNTING DATA FOR THE C/E IS REQUIRED  ***
               MOVE  66269 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(47)
               GO TO  67-SHOWFORM7.

           IF DE7-CE3-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  67-SHOWFORM7.
           IF DE7-CE3-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  67-SHOWFORM7.

           IF DE7-CE4-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  67-SHOWFORM7.
           IF DE7-CE4-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  67-SHOWFORM7.

           IF DE7-CE5-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  67-SHOWFORM7.
           IF DE7-CE5-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  67-SHOWFORM7.

           IF DE7-CE9-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(35)
               GO TO  67-SHOWFORM7.
           IF DE7-CE9-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(35)
               GO TO  67-SHOWFORM7.

           IF DE7-CPW-CODE NOT = SPACES
               IF DE7-CPW = ZEROS
      *        ***  CPW AMOUNT REQUIRED  ***
               MOVE  66270 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(38)
               GO TO  67-SHOWFORM7.

           IF DE7-CPW-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(40)
               GO TO  67-SHOWFORM7.
           IF DE7-CPW-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(40)
               GO TO  67-SHOWFORM7.

           IF DE7-CPW > ZERO
               IF DE7-CPW-CODE = SPACES
      *        ***  CPW CODE REQUIRED  ***
               MOVE  66271 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(41)
               GO TO  67-SHOWFORM7.

           IF DE7-EXT-CE-AMT > ZERO
               IF DE7-EXT-CE = SPACES
      *        ***  EXTRA CE CODE REQUIRED  ***
               MOVE  66272 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(48)
               GO TO  67-SHOWFORM7.
           IF DE7-EXT-CE NOT = SPACES
               IF DE7-EXT-CE-AMT = ZEROS
      *        ***  EXTRA CE AMOUNT REQUIRED ***
               MOVE  66273 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(49)
               GO TO  67-SHOWFORM7.
           IF DE7-EXT-CE-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(51)
               GO TO  67-SHOWFORM7.
           IF DE7-EXT-CE-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(51)
               GO TO  67-SHOWFORM7.
           IF DE7-EXT-CE-AMT > ZERO
               IF DE7-EXT-CE-ACCTG = SPACES
      *       *** EXTRA CE ACCOUNTING DATA REQUIRED ***
                   MOVE  66274 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
                   MOVE B"1" TO IND(99), IND(52)
                   GO TO  67-SHOWFORM7
               ELSE
                   MOVE 1        TO  INDX
                   PERFORM UNTIL INDX > 9 OR CALC-ERROR-SW = "Y"
                   IF DE7-EXT-CE-ACCTG-BYTE (INDX)  = SPACES
      *       ***  GENERAL LEDGER ACCOUNTING DATA IS 9 DIGITS ***      ERIA ***
                       MOVE 66256 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                       MOVE B"1" TO IND(99), IND(52)
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
                   END-PERFORM
                   IF CALC-ERROR-SW = "Y"
                       MOVE SPACES TO CALC-ERROR-SW
                       GO TO  67-SHOWFORM7.

           MOVE A-INV-TOTAL             TO  S-CALC-INV-AMT.
           PERFORM  671-CALC-VALUES  THRU  671-CALC-VALUES-X.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACE               TO  CALC-ERROR-SW
               GO TO  67-SHOWFORM7.


       68-FILLBUFF8.
           MOVE S-CALC-INV-AMT          TO  A-INV-TOTAL.
           MOVE S-CALC-INV-AMT          TO  INV-NET-DUE-VENDOR.
           MOVE DE7-INV-ACCTG           TO  CE1-ACCTG-DATA.
           IF CE3-FRT  NOT = ZEROS
               MOVE "3"             TO  CE3-CODE
               MOVE ACCOUNT-CE-ENTRY (3)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE3-ACCTG-DATA.
           IF CE4-INS  NOT = ZEROS
               MOVE "4"             TO  CE4-CODE
               MOVE ACCOUNT-CE-ENTRY (4)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE4-ACCTG-DATA.
           IF CE5-TAX  NOT = ZEROS
               MOVE "5"             TO  CE5-CODE
               MOVE ACCOUNT-CE-ENTRY (5)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE5-ACCTG-DATA.
           IF CE6-EXT-ERR  NOT = ZEROS
               MOVE "6"             TO  CE6-CODE
               MOVE ACCOUNT-CE-ENTRY (6)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE6-ACCTG-DATA.
           IF CE7-UPRC-ERR  NOT = ZEROS
               MOVE "7"             TO  CE7-CODE
               MOVE ACCOUNT-CE-ENTRY (7)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE7-ACCTG-DATA.
           IF CE8-OTHER  NOT = ZEROS
               MOVE "8"             TO  CE8-CODE
               MOVE ACCOUNT-CE-ENTRY (8)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE8-ACCTG-DATA.
           IF CE9-CASH-DSCNT  NOT = ZEROS
               MOVE "9"             TO  CE9-CODE
               MOVE ACCOUNT-CE-ENTRY (9)  TO  BUILD-CE-ACCTG-DATA
               PERFORM 681-CHECK-CE-ACCTG  THRU  681-CCA-X
               MOVE BUILD-CE-ACCTG-DATA   TO  CE9-ACCTG-DATA.
           IF DE7-EXT-CE-AMT  NOT = ZEROS
               MOVE DE7-EXT-CE      TO  CE-EXT-CODE-1
               MOVE DE7-EXT-CE-ACCTG  TO  CE-EXT-ACCTG-DATA-1
           ELSE
           IF DE7-CPW  NOT = ZEROS
               MOVE "1"                 TO  CE-EXT-CODE-1
               MOVE "113930000"         TO  CE-EXT-ACCTG-DATA-1.
           MOVE DE7-CPW-CODE            TO  INV-CPW-CODE.
           MOVE SPACE                   TO  DE-BUFFER8.
           MOVE B-PO-NO                 TO  DE8-PO.
           MOVE B-PO-RLSE               TO  DE8-RLSE.
           MOVE DE3-INV-NUM             TO  DE8-INV-NUM.
           MOVE S-NEW-REGNUM            TO  DE8-REG-NUM.
           MOVE A-INV-TOTAL             TO  DE8-NET-DUE-VENDOR.
           MOVE DE7-CE9-CASHD           TO  DE8-CASH-DSCNT.
           MOVE DE6-VEN-CTNRS           TO  DE8-CTNRS.
           MOVE DE7-CPW                 TO  DE8-CPW.
           MOVE ZERO                    TO  DE8-TOTAL-GDYR-FRT,
                                            DE8-OTHER,
                                            DE8-ACCRUED-TAX (1),
                                            DE8-ACCRUED-TAX (2),
                                            DE8-ACCRUED-TAX (3),
                                            DE8-ACCRUED-TAX (4),
                                            S-CALC-FRT-CHARGES.
           IF DE7-CE9-SIGN = "+"
               MOVE "-"                 TO  DE8-CASHD-SIGN
           ELSE
               MOVE "+"                 TO  DE8-CASHD-SIGN.
           IF DE6-CTNR-SIGN = "+"
               MOVE "-"                 TO  DE8-CTNR-SIGN
           ELSE
               MOVE "+"                 TO  DE8-CTNR-SIGN.
           IF DE7-CPW-SIGN = "+"
               MOVE "-"                 TO  DE8-CPW-SIGN
           ELSE
               MOVE "+"                 TO  DE8-CPW-SIGN.
           MOVE "+"                     TO  DE8-TOTAL-FRT-SIGN,
                                            DE8-OTHER-SIGN.
           PERFORM 681-GET-ACCRUED-TAX  THRU  681-GAT-X
               VARYING SUB1  FROM  1 BY 1
                   UNTIL SUB1 > 4.

           PERFORM 682-LOAD-GDYR-PAID-FRT  THRU  682-LGPF-X.
           IF FRT-SUB > 0
      *        *** OPEN COLLECT FREIGHT ***
               MOVE  15 TO LANG-SETNUM
               MOVE  15 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8-FRT-MSG
           ELSE
      *        *** NO COLLECT FREIGHT ***
               MOVE  14 TO LANG-SETNUM
               MOVE  23 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8-FRT-MSG.

           IF END-INV-ENTRY-SW = "Y"
               IF FRT-SUB = ZERO AND
                  DE8-ACCRUED-TAX (1) = ZEROS  AND
                  DE8-ACCRUED-TAX (2) = ZEROS  AND
                  DE8-ACCRUED-TAX (3) = ZEROS  AND
                  DE8-ACCRUED-TAX (4) = ZEROS  AND
                  DE7-CE9-CASHD       = ZEROS  AND
                  DE6-VEN-CTNRS       = ZEROS  AND
                  DE7-CPW             = ZEROS
                   GO TO 68-UPDATE-INV-DIST-COST.

       68-FILLBUFF8-CONT.
           MOVE INVADJUST  TO  VIEW-NFNAME.

       68-SHOWFORM8.
           MOVE "N"  TO  CALC-TAX-FRT-SW.
           MOVE DE-BUFFER8     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER8.
           IF VIEW-LASTKEY = 1
               MOVE A-INV-TOTAL         TO  S-CALC-INV-AMT
               PERFORM  681-CALC-VALUES  THRU  681-CALC-VALUES-X
               MOVE SPACE               TO  CALC-ERROR-SW
               GO TO  68-SHOWFORM8
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE A-INV-TOTAL  TO  S-CALC-INV-AMT
               PERFORM  681-CALC-VALUES  THRU  681-CALC-VALUES-X
               IF CALC-ERROR-SW = "Y"
                   MOVE SPACE  TO  CALC-ERROR-SW
                   GO TO  68-SHOWFORM8
               ELSE
                   PERFORM  682-SELECT-PAID-FREIGHT THRU 682-SPF-X
                   GO TO  68-FILLBUFF8-CONT
           ELSE
           IF VIEW-LASTKEY = 4
               PERFORM 661-GET-FREE-VERBAGE  THRU  661-GFV-X
               MOVE DE8-HOLD-VERBAGE TO INV-FREE-VERB
               GO TO 69-PUT-DINVRCD
           ELSE
           IF VIEW-LASTKEY = 5
               MOVE "Y"                 TO  CALC-TAX-FRT-SW
               MOVE A-INV-TOTAL         TO  S-CALC-INV-AMT
               PERFORM  681-CALC-VALUES  THRU  681-CALC-VALUES-X
               MOVE SPACE               TO  CALC-ERROR-SW
               GO TO  68-SHOWFORM8
           ELSE
           IF VIEW-LASTKEY = 3  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  68-SHOWFORM8.

           IF DE8-OTHER-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
               MOVE B"1" TO IND(99), IND(17)
               GO TO  68-SHOWFORM8.
           IF DE8-OTHER-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
               MOVE B"1" TO IND(99), IND(17)
               GO TO  68-SHOWFORM8.
           MOVE 1        TO  INDX.
           PERFORM UNTIL INDX > 4 OR CALC-ERROR-SW = "Y"
                   IF DE8-ATAX-SIGN (INDX) = "+" OR "-"
                       NEXT SENTENCE
                   ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
                       MOVE  66259 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
                   END-PERFORM
                   IF CALC-ERROR-SW = "Y"
                       IF INDX = 1
                           MOVE 14 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 2
                           MOVE 30 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 3
                           MOVE 35 TO FIELD-NUMBER
                       ELSE
                           MOVE 40 TO FIELD-NUMBER
                       END-IF
                       MOVE SPACES TO CALC-ERROR-SW
                       MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                       GO TO  68-SHOWFORM8.
           MOVE A-INV-TOTAL             TO  S-CALC-INV-AMT.
           PERFORM  681-CALC-VALUES  THRU  681-CALC-VALUES-X.
           IF CALC-ERROR-SW = "Y"
               MOVE SPACE               TO  CALC-ERROR-SW
               GO TO  68-SHOWFORM8.

           PERFORM 682-UPDATE-PAID-FREIGHT  THRU  682-UPF-X.

       68-UPDATE-INV-DIST-COST.
           MOVE S-CALC-INV-AMT          TO  INV-DIST-COST.
           MOVE "P"                     TO  INV-STATUS.
           PERFORM 681-UPDATE-ACCRUED-TAX  THRU  681-UAT-X
               VARYING SUB1  FROM 1 BY 1
                   UNTIL SUB1 > 4.

           PERFORM 662-UPDATE-QTY-PAID  THRU  662-UPDATE-QTY-PAID-X.
           PERFORM 662-UPDATE-MONTH-PAID  THRU  662-UMP-X.

       69-PUT-DINVRCD.
           WRITE DINVRCD-O-REC-REG FROM BUF-DINVRCD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DINVRCD*69-PDR"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           GO TO  6-MAIN.

       6-MAIN-X.
           EXIT.


       611-DBOPEN.
           OPEN I-O  DPORECD-O, DINVITM-O, DPOITEM-O, DINVACCT-O,
                   DINVRCD-O-REG, DINVRCD-O-PO, DINVRCD-O-INV,
                   DPOFREIGHT-O, DDAILYTC-O, MPLTINFO-O, DPODATAITM-O.
           OPEN INPUT MSTORERM-I, MPORCV-I, DVENDOR-I, DPOITEM-I,
                   MTAX-I, MVALIDPLTDTA-I, MVALIDUM-I, MPLTINFO-PK-I,
                   DINVITM-I.
           MOVE "P 01"     TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO*611-DB"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP
           ELSE
               MOVE MPLTINFO-COMPANY  TO  SAVE-COMPANY.

           MOVE "DSTR"     TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO*611-DB"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP
           ELSE
               MOVE MPLTINFO-DEPT-STR (1)    TO  S-DEPT-STR.

           MOVE SPACES              TO  SAVE-TAX-DISTRICTS.
           MOVE "PTX1"              TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO 1-HSK PTX1"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           MOVE MPLTINFO-TAX-DISTRICT (1)   TO  TAX-DISTRICT (1).
           MOVE MPLTINFO-TAX-DISTRICT (2)   TO  TAX-DISTRICT (2).
           MOVE MPLTINFO-TAX-CE-ACCTG (1)
                                   TO  TAX-DISTRICT-CE-ACCTG (1).
           MOVE MPLTINFO-TAX-CE-ACCTG (2)
                                   TO  TAX-DISTRICT-CE-ACCTG (2).

           MOVE "PTX2"                TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 1-HSK PTX2" TO BU-DISPLAY-MSG
               MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-TAX-DISTRICT (1)  TO  TAX-DISTRICT (3)
               MOVE MPLTINFO-TAX-DISTRICT (2)  TO  TAX-DISTRICT (4)
               MOVE MPLTINFO-TAX-CE-ACCTG (1)
                                      TO  TAX-DISTRICT-CE-ACCTG (3)
               MOVE MPLTINFO-TAX-CE-ACCTG (2)
                                      TO  TAX-DISTRICT-CE-ACCTG (4).

           MOVE "PCE1"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 611-DB PCE1"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           MOVE ZEROS  TO  CE-SUB.
           PERFORM 6111-LOAD-CE-TABLE THRU 6111-LCT-X
               VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 5.

           MOVE "PCE2"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 611-DB PCE2"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           MOVE ZEROS  TO  CE-SUB.
           PERFORM 6111-LOAD-CE-TABLE THRU 6111-LCT-X
               VARYING SUB1 FROM 6 BY 1 UNTIL SUB1 > 10.

      *-----* GET DATE OF PURCHASING STARTUP - TO PAY POs THRU CSIS THE
      *-----* THE PO DATE MUST BE AFTER THE PURCHASING STARTUP DATE
           MOVE "POST"      TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE  SPACES          TO  SAVE-PO-STRT-DATE-CN
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO * 61-S1"   TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-PO-STRT-DATE      TO  SAVE-PO-STRT-DATE
      *------------- ACCOUNT FOR CENTURY.
               IF SAVE-PO-STRT-YY > "70"
                   MOVE "19"                   TO  SAVE-PO-STRT-CC
               ELSE
                   MOVE "20"                   TO  SAVE-PO-STRT-CC.

      *-----* DETERMINE WHETHER PREPAYS ARE ALLOWED
           MOVE "PINV"      TO PLTINFOKEY  OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE  "N"             TO  PREPAY-SW
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO * 61-S1"   TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-INV-PREPAY-SW     TO  PREPAY-SW.
9207CK
  .   *-----* DETERMINE IF INVOICES CAN BE PAID AGAINST REQUIRMENT PO'S.
  .        MOVE "PREG" TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
  .        READ MPLTINFO-PK-I INTO BUF-MPLTINFO
  .           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
  .        IF FILE-STATUS NOT = "00"
  .            MOVE "READ MPLTINFO*611-DBOPEN"   TO  BU-DISPLAY-MSG
  .            MOVE "PREG" TO BU-DISPLAY-FLD (1)
  .            GO TO 2100-BLOWUP.
  .        IF MPLTINFO-INV-REQ-PO = SPACES
  .            MOVE "N" TO PAY-REQ-SW
  .        ELSE
9207CK         MOVE "Y" TO PAY-REQ-SW.

9211CK     MOVE MPLTINFO-DISCOUNT-TAX-SW TO S-DISCOUNT-TAX-SW.

      *---- DO A START HIGH-VALUES TO UNLOCK
      *    MOVE HIGH-VALUES TO PLTINFOKEY  OF MPLTINFO-O-REC.
      *    START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
      *         INVALID KEY MOVE "00" TO FILE-STATUS.

       611-DBOPEN-X.
           EXIT.

       6111-LOAD-CE-TABLE.
           ADD 1  TO  CE-SUB.
           MOVE MPLTINFO-ACCT-ENTRYS (CE-SUB)  TO
               ACCOUNT-CE-ENTRY (SUB1).

       6111-LCT-X.
           EXIT.


       611-CALL-INV-MODIFY.
           CALL "TINVMOD" USING BASE,
                                VIEW-COMAREA,
                                KSAM-KEY-VALUE,
                                LANGUAGE-PARMS.

       611-CIM-X.
           EXIT.

       611-CALL-INV-INQUIRY.
           CALL "SINVINQS" USING BASE,
                                 BASE-STHIST,
                                 VIEW-COMAREA,
                                 LANGUAGE-PARMS.
           MOVE "ZINVOICE" TO VIEW-CFNAME.

       611-CII-X.
           EXIT.

       611-ZERO-OUT-TAX-TABLE.
           MOVE ZEROS  TO  PO-PAY-TAX-CHRG (SUB1),
                           PO-ACCRUE-TAX-CHRG (SUB1),
                           INV-PAY-TAX-CHRG (SUB1),
                           INV-ACCRUE-TAX-CHRG (SUB1).

       611-ZOTT-X.
           EXIT.

       621-CALL-PO-INQUIRY.
           CALL "SPOINQ" USING BASE,
                               BASE-STHIST,
                               VIEW-COMAREA,
                               SAVE-COMPANY,
                               LANGUAGE-PARMS.
           MOVE "ZINVOICE" TO VIEW-CFNAME.

       621-CPI-X.
           EXIT.

       621-CALL-RSINQ.
           MOVE "ZCSISINQ" TO VIEW-CFNAME.
           CALL "SRSINQS" USING BASE,
                                VIEW-COMAREA,
                                LANGUAGE-PARMS.
           MOVE "ZINVOICE" TO VIEW-CFNAME.

       621-CR-X.
           EXIT.

       621A-CNT-ITEMS.
           MOVE 0 TO S-ITEM-COUNT.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-I-REC.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *NO ITEMS ON THIS PURCHASE ORDER
                   GO TO 621A-CNT-ITEMS-X
               ELSE
                   MOVE "START DPOITEM*631-GTC" TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

       621A-READ-ALL-ITEMS.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR PORCVNO OF DPOITEM-I-REC NOT = PO-ARG
               IF S-ITEM-COUNT = 0
      *NO ITEMS ON THIS PURCHASE ORDER
                   GO TO 621A-CNT-ITEMS-X
               ELSE
                   MOVE S-ITEM-COUNT TO DE2-PO-ITEM-COUNT
                   GO TO 621A-CNT-ITEMS-X
           ELSE
           IF FILE-STATUS NOT = "00"
                   MOVE "READN DPOITEM*631-GTC"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

           ADD 1 TO S-ITEM-COUNT.
           IF S-ITEM-COUNT < 40
               GO TO 621A-READ-ALL-ITEMS
           ELSE
               MOVE "9999" TO  DE2-PO-ITEM-COUNT.

       621A-CNT-ITEMS-X.
           EXIT.

       621B-CUR-CODE.
           MOVE PO-CURRENCY-CODE              TO  BUILD-CC-VALUE.
           MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MVALIDUM*621B-CUR-CODE" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           MOVE  PO-CURRENCY-CODE             TO  DE2-CUR-CODE.
           MOVE  VALID-CURRENCY-DESC          TO  DE2-CUR-CODE-DESC,
                                                  SAVE-CURRENCY-DESC.
       621B-CC-X.
           EXIT.

       621-CALCULATE-INVOICE-PAYMENTS.
           MOVE ZERO                    TO  S-INVOICE-PAYMENTS-AMT,
                                            S-INVOICE-PAYMENTS-ROUND.
           MOVE PO-ARG TO PORCVNO OF DINVRCD-O-REC-PO.
           START DINVRCD-O-PO  KEY = PORCVNO OF DINVRCD-O-REC-PO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 621-CIP-X
               ELSE
                   MOVE "START DINVRCD*621-CIP"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

       621-GET-DINVRCD.
           READ DINVRCD-O-PO NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR PORCVNO OF DINVRCD-O-REC-PO NOT = PO-ARG
               ADD S-INVOICE-PAYMENTS-AMT  TO
                   S-INVOICE-PAYMENTS-ROUND  ROUNDED
               MOVE S-INVOICE-PAYMENTS-ROUND  TO
                    DE2-INV-PAYMENTS
               MULTIPLY S-CPW-DEDUCTS  BY  -1 GIVING S-CPW-DEDUCTS
               MOVE S-CPW-DEDUCTS  TO  DE2-CPW-DEDUCTS
               MOVE S-CPW-PAYMENTS  TO  DE2-CPW-PAYMENTS
               SUBTRACT S-CPW-PAYMENTS  FROM  S-CPW-DEDUCTS
                   GIVING DE2-CPW-BALANCE
               MOVE HIGH-VALUES TO PORCVNO OF DINVRCD-O-REC-PO
               START DINVRCD-O-PO KEY > PORCVNO OF DINVRCD-O-REC-PO
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               GO TO 621-CIP-X
           ELSE
           IF FILE-STATUS NOT = "00"
                   MOVE "READN DINVRCD*621-GD"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

           IF INV-STATUS = "I" OR "H"
               NEXT SENTENCE
           ELSE
               ADD INV-NET-DUE-VENDOR  TO
                   S-INVOICE-PAYMENTS-AMT
               IF CE-EXT-ACCTG-DATA-1 = "113930000"
                   IF CE-EXT-VALUE-1 < ZEROS
                       ADD CE-EXT-VALUE-1 TO S-CPW-DEDUCTS
                   ELSE
                       ADD CE-EXT-VALUE-1 TO S-CPW-PAYMENTS.

           GO TO 621-GET-DINVRCD.

       621-CIP-X.
           EXIT.


       622-FIND-DPODATAITM.
           MOVE SPACE            TO  MORE-COM-MSW,
                                     DE2-COMMENT-TABLE.
           MOVE PO-ARG           TO PORCVNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY = PORCVNO OF DPODATAITM-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO  622-FIND-DPODATAITM-X
               ELSE
                   MOVE "DBFIND DPODATAITM*622"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

           MOVE ZERO   TO  LINE-SUB.

       622-GET-DPODATAITM-LOOP.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR DATAITM-PO-RCV-NO NOT = PO-ARG
               MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-O-REC
               START DPODATAITM-O KEY > PORCVNO OF DPODATAITM-O-REC
                 INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO  622-FIND-DPODATAITM-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET DPODATAITM*622"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           IF DATAITM-ITEM-NO = ZEROS
               IF DATAITM-LINE-NO > "48" AND DATAITM-LINE-NO < "99"
                   IF LINE-SUB < 2
                       ADD 1  TO  LINE-SUB
                       MOVE DATAITM-INFO  TO
                                DE2-PO-INV-COM (LINE-SUB)
                       GO TO  622-GET-DPODATAITM-LOOP
                   ELSE
                       MOVE "Y"  TO  MORE-COM-MSW
               ELSE
                   IF DATAITM-LINE-NO = "01"
                       MOVE DATAITM-INFO     TO  STD-INST-SAVED
                       MOVE SAVE-STD-INST-LIST TO DE2-STD-INST-LIST
                       GO TO 622-GET-DPODATAITM-LOOP
                   ELSE
                       GO TO 622-GET-DPODATAITM-LOOP.

           MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY > PORCVNO OF DPODATAITM-O-REC
              INVALID KEY MOVE "00" TO FILE-STATUS.

       622-FIND-DPODATAITM-X.
           EXIT.

       624-OVERRIDE-VENDOR.
           MOVE SPACE                 TO  DE-BUFFER2B.
           MOVE B-PO-NO               TO  DE2B-PO.
           MOVE B-PO-RLSE             TO  DE2B-RLSE.
           MOVE DE2-PAY-VC            TO  DE2B-OLD-PAY-VC.
           MOVE DE2-PAY-IND           TO  DE2B-OLD-PAY-IND.
           MOVE DE2-PAY-VEN-DATA (1)  TO  DE2B-OLD-PAY-VEN-DATA (1).
           MOVE DE2-PAY-VEN-DATA (2)  TO  DE2B-OLD-PAY-VEN-DATA (2).
           MOVE DE2-PAY-VEN-DATA (3)  TO  DE2B-OLD-PAY-VEN-DATA (3).
           MOVE DE2-PAY-VEN-DATA (4)  TO  DE2B-OLD-PAY-VEN-DATA (4).
      **** MOVE ZEROS                 TO  DE2B-NEW-PAY-VC.
           MOVE SPACES                TO  DE2B-NEW-PAY-VC.

           MOVE OVENDOR  TO  VIEW-NFNAME.

       624-SHOWFORM2B.
           MOVE DE-BUFFER2B    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER2B.
           IF VIEW-LASTKEY = 3
               GO TO  624-OVERRIDE-VENDOR-X
           ELSE
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2B-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  624-SHOWFORM2B.

           IF DE2B-NEW-PAY-VC = SPACES
      *        ***  NEW VENDOR CODE IS REQUIRED  ***
               MOVE  66250 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2B-MSG-LINE
               MOVE B"1" TO IND(99), IND(1)
               GO TO  624-SHOWFORM2B.
      *------- SAP R/3 VENDOR CODES NOW BEGIN WITH "S" SO THIS
      *------- CHECK IS NO LONGER VALID.
      *    IF DE2B-NEW-PAY-VC NOT NUMERIC
      *        ***  NEW VENDOR CODE MUST BE NUMERIC ***
      *        MOVE  66251 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MESSAGE-BUFFER TO DE2B-MSG-LINE
      *        MOVE B"1" TO IND(99), IND(1)
      *        GO TO  624-SHOWFORM2B.

       624-FILLBUFF2BD.
           MOVE DE2B-NEW-PAY-VC  TO  NVEN-ARG1-7.
           MOVE "000"            TO  NVEN-ARG8-10.
           MOVE NEW-VEN-ARG TO VENCDE  OF DVENDOR-I-REC.
           START DVENDOR-I KEY = VENCDE  OF DVENDOR-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE VENDOR-NOT-FOUND-MSG1  TO
                       DE2B-NEW-PAY-VEN-DATA (1)
                   MOVE VENDOR-NOT-FOUND-MSG2  TO
                       DE2B-NEW-PAY-VEN-DATA (2)
                   MOVE VENDOR-NOT-FOUND-MSG3  TO
                       DE2B-NEW-PAY-VEN-DATA (3)
                   MOVE VENDOR-NOT-FOUND-MSG4  TO
                       DE2B-NEW-PAY-VEN-DATA (4)
      *** IF THE NEW VENDOR INFO. IS CORRECT,  PRESS 'ENTER' TO CONTINUE ***
                    MOVE   9 TO LANG-SETNUM
                    MOVE   4 TO LANG-MSGNUM
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                    MOVE MESSAGE-BUFFER TO DE2B-COMLINE
                    GO TO 624-FILLBUFF2BD-CONT
               ELSE
                   MOVE "START DVENDOR*624-F2BD"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP
           ELSE
               MOVE ZERO    TO  VEN-SUB.

       624-LOAD-NEW-VENDOR.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR VENCDE OF DVENDOR-I-REC NOT = NEW-VEN-ARG
      *** IF THE NEW VENDOR INFO. IS CORRECT,  PRESS 'ENTER' TO CONTINUE ***
               MOVE   9 TO LANG-SETNUM
               MOVE   4 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2B-COMLINE
               GO TO  624-FILLBUFF2BD-CONT
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READN DVENDOR*624-LNV"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           IF VEN-ITM-NO = 00
               ADD 1    TO  VEN-SUB
               MOVE VEN-NAME       TO  DE2B-NEW-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 01
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2B-NEW-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 02
               ADD 1    TO  VEN-SUB
               MOVE VEN-ADDRESS    TO  DE2B-NEW-PAY-VEN-DATA (VEN-SUB)
           ELSE
           IF VEN-ITM-NO = 07
               ADD 1    TO  VEN-SUB
               MOVE VEN-07-RCD     TO  DE2B-NEW-PAY-VEN-DATA (VEN-SUB).

           IF VEN-SUB GREATER THAN 3
      *** IF THE NEW VENDOR INFO. IS CORRECT,  PRESS 'ENTER' TO CONTINUE ***
               MOVE   9 TO LANG-SETNUM
               MOVE   4 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2B-COMLINE
               GO TO  624-FILLBUFF2BD-CONT
           ELSE
               GO TO  624-LOAD-NEW-VENDOR.

       624-FILLBUFF2BD-CONT.
           MOVE HIGH-VALUES TO VENCDE  OF DVENDOR-I-REC.
           START DVENDOR-I KEY > VENCDE  OF DVENDOR-I-REC
              INVALID KEY MOVE "00" TO FILE-STATUS-1.
           MOVE OVENDORD  TO  VIEW-NFNAME.

       624-SHOWFORM2BD.
           MOVE DE-BUFFER2B    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER2B.
           IF VIEW-LASTKEY = 6
               GO TO  624-OVERRIDE-VENDOR
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO  624-OVERRIDE-VENDOR-X
           ELSE
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE2B-MSG-LINE
               MOVE B"1" TO IND(99)
               GO TO  624-SHOWFORM2BD.

       624-OVERRIDE-VENDOR-X.
           EXIT.

       631-GET-TERMS-DESC.
           MOVE PO-TERMS-PCT          TO  BUILD-TM-DISCOUNT-VALUE.
           MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO1 * 631-GTD" TO BU-DISPLAY-MSG
               MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-DISC-AMNT-DESC TO DE3-PO-TERMS-PERCENT.

           MOVE PO-TERMS-DUE-DATE     TO  BUILD-TM-DATE-VALUE.
           MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO2 * 631-GPT" TO BU-DISPLAY-MSG
               MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP
           ELSE
               MOVE MPLTINFO-TMD-DESC       TO DE3-PO-TERMS-DUE.

       631-GTD-X.
           EXIT.

       631-VERIFY-INVOICE-QTY.
           IF DE3-INV-CE = "Z"
              GO TO 631-VIQ-X.
           MOVE S-NEW-REGNUM  TO  REGISTER-ARG.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-O-REC.
           START DINVITM-O KEY = REGISTERNO OF DINVITM-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 = "2"
                 GO TO 631-VIQ-X
              ELSE
                 MOVE "START DINVITM*631-VIQ" TO BU-DISPLAY-MSG
                 MOVE S-NEW-REGNUM TO BU-DISPLAY-FLD (1)
                 GO TO 2100-BLOWUP.

           MOVE PO-ARG TO PORCVNO OF DPOITEM-I-REC.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 NOT = "2"
                 MOVE "START DPOITEM*631-VIQ"  TO  BU-DISPLAY-MSG
                 MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                 GO TO  2100-BLOWUP.

       631-READ-NEXT-DINVITM.
           READ DINVITM-O NEXT INTO BUF-DINVITM
                AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS   = "10" OR "14" OR "46"
                 MOVE HIGH-VALUES TO REGISTERNO OF DINVITM-O-REC
                 START DINVITM-O KEY > REGISTERNO OF DINVITM-O-REC
                    INVALID KEY MOVE "00" TO FILE-STATUS
                 END-START
                 GO TO  631-VIQ-X
              ELSE
                 MOVE "READN DINVITM*631-RND"  TO  BU-DISPLAY-MSG
                 MOVE S-NEW-REGNUM TO BU-DISPLAY-FLD (1)
                 GO TO  2100-BLOWUP.
           IF REGISTERNO OF DINVITM-O-REC NOT = REGISTER-ARG
              MOVE HIGH-VALUES TO REGISTERNO OF DINVITM-O-REC
              START DINVITM-O KEY > REGISTERNO OF DINVITM-O-REC
                 INVALID KEY MOVE "00" TO FILE-STATUS
              END-START
              GO TO  631-VIQ-X.

       631-READ-NEXT-DPOITEM.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS   = "10" OR "14" OR "46"
                 OR PORCVNO OF DPOITEM-I-REC NOT = PO-ARG
                 MOVE HIGH-VALUES TO ITM-NUMBER
              ELSE
                 MOVE "READN DPOITEM*631-RND"  TO  BU-DISPLAY-MSG
                 MOVE PO-ARG TO BU-DISPLAY-FLD (1)
                 GO TO  2100-BLOWUP.
           IF PORCVNO OF DPOITEM-I-REC NOT = PO-ARG
              MOVE HIGH-VALUES TO ITM-NUMBER.

       631-MATCH.
           IF INVITM-ITEM-NO = ITM-NUMBER
              IF INVITM-MEMO-INDIC NOT = "X"
                 AND PO-NON-RCV-INDIC NOT = "X"
                 MOVE ITM-UM       TO V-OLD-UM
                 MOVE ITM-PRICE-UM TO V-NEW-UM
                 SUBTRACT ITM-QTY-PAID FROM ITM-QTY-DLVR
                    GIVING V-OLD-QTY
                 PERFORM 642-CALC-NEW-QTY THRU 642-CALC-NEW-QTY-X
                 IF C-NEW-QTY < INVITM-PO-QTY-PD
                    OR C-NEW-QTY < INVITM-INV-QTY-PD
                    DELETE DINVITM-O
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                    END-DELETE
                    IF FILE-STATUS NOT = "00"
                       MOVE "DELETE DINVITM*631-MATCH" TO BU-DISPLAY-MSG
                       MOVE INVITM-REG-NO  TO BU-DISPLAY-FLD (1)
                       MOVE INVITM-ITEM-NO TO BU-DISPLAY-FLD (2)
                       GO TO 2100-BLOWUP
                    END-IF
                    PERFORM 631-DELETE-DINVACCT THRU 631-DD-X
                 END-IF
              END-IF
              PERFORM 631-READ-NEXT-DINVITM
              PERFORM 631-READ-NEXT-DPOITEM
              GO TO 631-MATCH
           END-IF.

           IF INVITM-ITEM-NO > ITM-NUMBER
              PERFORM 631-READ-NEXT-DPOITEM
              GO TO 631-MATCH
           END-IF.

           IF INVITM-ITEM-NO < ITM-NUMBER
              DELETE DINVITM-O
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-DELETE
              IF FILE-STATUS NOT = "00"
                 MOVE "DELETE DINVITM*631-MATCH" TO BU-DISPLAY-MSG
                 MOVE INVITM-REG-NO  TO BU-DISPLAY-FLD (1)
                 MOVE INVITM-ITEM-NO TO BU-DISPLAY-FLD (2)
                 GO TO 2100-BLOWUP
              END-IF
              PERFORM 631-DELETE-DINVACCT THRU 631-DD-X
              PERFORM 631-READ-NEXT-DINVITM
              GO TO 631-MATCH
           END-IF.


       631-VIQ-X.
           EXIT.

       631-DELETE-DINVACCT.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCT-O-REC.
           START DINVACCT-O KEY = REGISTERNO OF DINVACCT-O-REC
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS-1 = "2"
                 GO TO 631-DD-X
              ELSE
                 MOVE "START DINVACCT*631-DD" TO BU-DISPLAY-MSG
                 MOVE REGISTER-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 2100-BLOWUP.

       631-DELETE-DINVACCT-LOOP.
           READ DINVACCT-O NEXT INTO BUF-DINVACCT
              AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              IF FILE-STATUS = "10" OR "14" OR "46"
                 MOVE HIGH-VALUES TO REGISTERNO OF DINVACCT-O-REC
                 START DINVACCT-O KEY > REGISTERNO OF DINVACCT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
                 GO TO 631-DD-X
              ELSE
                 MOVE "READN DINVACCT*631-DDL" TO BU-DISPLAY-MSG
                 MOVE REGISTER-ARG TO BU-DISPLAY-FLD (1)
                 GO TO 2100-BLOWUP.

           IF REGISTERNO OF DINVACCT-O-REC NOT = REGISTER-ARG
              OR INVACCT-ITEM > INVITM-ITEM-NO
                 MOVE HIGH-VALUES TO REGISTERNO OF DINVACCT-O-REC
                 START DINVACCT-O KEY > REGISTERNO OF DINVACCT-O-REC
                    INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                 END-START
                 GO TO 631-DD-X.

           IF INVACCT-ITEM = INVITM-ITEM-NO
              DELETE DINVACCT-O
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-DELETE
              IF FILE-STATUS NOT = "00"
                 MOVE "DELETE DINVACCT*631-DDL" TO BU-DISPLAY-MSG
                 MOVE INVACCT-REG-NO TO BU-DISPLAY-FLD (1)
                 MOVE INVACCT-ITEM-LINE TO BU-DISPLAY-FLD (2)
                 GO TO 2100-BLOWUP.

           GO TO 631-DELETE-DINVACCT-LOOP.

       631-DD-X.
           EXIT.

       631-READ-INV-NUM.
           MOVE "N"  TO  ERR-SW.
           MOVE "N"  TO  RESTART-INV-SW.
           IF DE3-INV-NUM = SPACES
               MOVE "Y"  TO  ERR-SW
      *       * YOU MUST ENTER THE INVOICE NUMBER YOU WISH TO CONTINUE ENTERING*
               MOVE  25 TO LANG-SETNUM
               MOVE   8 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
               GO TO 631-RIN-X.

           MOVE BUILD-PO-KEY-VALUE  TO  PO-ARG.
           MOVE PO-ARG TO PORCVNO OF DINVRCD-O-REC-PO.
           START DINVRCD-O-PO KEY = PORCVNO OF DINVRCD-O-REC-PO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "START DINVRCD*631-RIN"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       631-GET-DINVRCD-LOOP.
           READ DINVRCD-O-PO NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR PORCVNO OF DINVRCD-O-REC-PO NOT = PO-ARG
               MOVE HIGH-VALUES TO PORCVNO OF DINVRCD-O-REC-PO
               START DINVRCD-O-PO KEY > PORCVNO OF DINVRCD-O-REC-PO
                  INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
      *        * INVOICE DOES NOT EXIST; CANNOT CONTINUE TO ENTER INVOICE *
               MOVE   9 TO LANG-SETNUM
               MOVE  51 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
               MOVE "Y"  TO  ERR-SW
               GO TO 631-RIN-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READN DINVRCD *631-GDL"  TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           IF DE3-INV-NUM  =  INV-NO
               IF INV-STATUS = "H" OR "I"
                   NEXT SENTENCE
               ELSE
      *        * INVOICE HAS ALREADY BEEN PROCESSED CANNOT CONTINUE INVOICE *
               MOVE   9 TO LANG-SETNUM
               MOVE  52 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
               MOVE B"1" TO IND(99), IND(3)
               MOVE "Y"  TO  ERR-SW
9212CK*--------DO A START > HIGH-VALUES TO UNLOCK
  .            MOVE HIGH-VALUES TO PORCVNO OF DINVRCD-O-REC-PO
  .            START DINVRCD-O-PO KEY > PORCVNO OF DINVRCD-O-REC-PO
  .               INVALID KEY MOVE "00" TO FILE-STATUS
9212CK         END-START
               GO TO 631-RIN-X
           ELSE
               GO TO 631-GET-DINVRCD-LOOP.

      **** MOVE DE3-INV-NUM             TO  S-INVOICE-NO.
      ****------ INITIALIZE SAVE FIELD.
           MOVE SPACES                  TO  S-INVOICE-NO.
           MOVE INV-TERMS               TO  DE3-INV-TERMS.
           MOVE CE1-CODE                TO  DE3-INV-CE.
           MOVE CE1-TOTAL               TO  DE3-INV-AMT.
           MOVE CE1-ACCTG-DATA          TO  DE3-INV-ACCTG.
           MOVE INV-DATE                TO  DATE-VALIDATE-IN.
           MOVE 4                       TO  DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-OUT                TO  DE3-INV-DATE.
           MOVE INV-REG-NO              TO  S-NEW-REGNUM
                                            S-HOLD-REGNUM.
           MOVE INV-NO-CHECK-INDIC      TO  DE3-INV-NO-CHECK-INDIC.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PORCVNO OF DINVRCD-O-REC-PO.
           START DINVRCD-O-PO KEY > PORCVNO OF DINVRCD-O-REC-PO
               INVALID KEY MOVE "00" TO FILE-STATUS.

           MOVE DE-BUFFER3     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.

           MOVE "Y"  TO  RESTART-INV-SW.

       631-RIN-X.
           EXIT.

       631-SUFFIX-INV-NO.
           MOVE DE3-INV-NUM  TO  REFORM-INV-NO.
           IF R-INV-NO (14)  NOT = SPACES
               GO TO 631-SIN-X.
           MOVE 15  TO  SUB1.

       631-SUFFIX-INV-LOOP.
           SUBTRACT 1  FROM  SUB1.
           IF SUB1 < 1
              GO TO 631-SIN-X.
           IF R-INV-NO (SUB1) = SPACES
               GO TO 631-SUFFIX-INV-LOOP
           ELSE
           IF R-INV-NO (SUB1) = "A"
               GO TO 631-SIN-X
           ELSE
               ADD 1  TO  SUB1
               MOVE "A"  TO  R-INV-NO (SUB1)
               MOVE REFORM-INV-NO  TO  DE3-INV-NUM.

       631-SIN-X.
           EXIT.

       631-DISPLAY-PAYMENT-TERMS.
      *    IF VIEW-NFNAME = INVENTRY
      *        PERFORM 998-READ-SCREEN
      *        MOVE DISPLAY-REC TO DE-BUFFER3
      *    ELSE
      *    IF VIEW-NFNAME = INVDEDUCTA
      *        PERFORM 998-READ-SCREEN
      *        MOVE DISPLAY-REC TO DE-BUFFER7.

           MOVE INVTERMS TO VIEW-NFNAME.

       631-SHOWFORM3A.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.

       631-DPT-X.
           EXIT.

       631-CHECK-DUP-INV.
           MOVE SPACES         TO  ERR-SW.
           IF S-INVOICE-NO  =  DE3-INV-NUM
               GO TO 631-CDI-X.

           MOVE DE3-INV-NUM         TO  INV-ARG,
                                        S-INVOICE-NO.
           MOVE INV-ARG TO INVOICENO OF DINVRCD-O-REC-INV.
           START DINVRCD-O-INV KEY = INVOICENO OF DINVRCD-O-REC-INV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 631-CDI-X
               ELSE
                   MOVE "START DINVRCD*631-CDI"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.


       631-GET-DINVRCD.
           READ DINVRCD-O-INV NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR INVOICENO OF DINVRCD-O-REC-INV NOT = INV-ARG
               MOVE HIGH-VALUES TO INVOICENO OF DINVRCD-O-REC-INV
               START DINVRCD-O-INV KEY > INVOICENO OF
                                                DINVRCD-O-REC-INV
                  INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO 631-CDI-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READN DINVRCD *631-GD"  TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           IF VEN-ARG = INV-VEN-CODE
      *----------- IF THE USER IS CONTINUING AN INVOICE ON HOLD, THE
      *----------- "S-HOLD-REGNUM" FIELD CONTAINS THE REGISTER NUMBER.
      *----------- THIS REGISTER NUMBER IS CHECKED SO THAT IT DOESN'T
      *----------- FLAG THE CURRENT INVOICE AS A DUPLICATE INVOICE.
      *----------- IF IT'S A NEW INVOICE, THE "S-HOLD-REGNUM" FIELD
      *----------- WILL CONTAIN ZEROES.
             IF S-HOLD-REGNUM = 0   OR
               (S-HOLD-REGNUM > 0 AND INV-REG-NO NOT = S-HOLD-REGNUM)
      **       MOVE INV-DATE             TO DATE-VALIDATE-IN
      **       MOVE 4                    TO DATE-MODE
      **       CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
      **       IF DATE-OUT = DE3-INV-DATE
                   MOVE HIGH-VALUES TO INVOICENO OF DINVRCD-O-REC-INV
                   START DINVRCD-O-INV KEY > INVOICENO OF
                                                    DINVRCD-O-REC-INV
                      INVALID KEY MOVE "00" TO FILE-STATUS
                   END-START
                   MOVE "Y"      TO  ERR-SW
                   MOVE 3        TO  FIELD-NUMBER
      *      WARNING-DUPLICATE INVOICE NO. EXISTS FOR THIS VENDOR;
      *      PRESS 'ENTER' TO PROCEED
                   MOVE  23 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                   MOVE B"1" TO  IND(99), IND(FIELD-NUMBER)
                   GO TO 631-CDI-X.

           GO TO 631-GET-DINVRCD.

       631-CDI-X.
           EXIT.

      *************************************
      *                                   *
      *   EDIT PAYMENT TERMS              *
      *                                   *
      *************************************

       631-EDIT-PAYMENT-TERMS.
           MOVE SPACES                  TO  ERR-SW.
           MOVE BUILD-TM-DISCOUNT-KEY   TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           START MPLTINFO-PK-I KEY = PLTINFOKEY OF MPLTINFO-PK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
                   MOVE   9 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *            PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   MOVE "Y"             TO  ERR-SW
                   GO TO 631-EPT-X
               ELSE
                   MOVE "START MPLTINFO1 * 631-EPT" TO BU-DISPLAY-MSG
                   MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
                   GO TO 2100-BLOWUP.

           MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           START MPLTINFO-PK-I KEY = PLTINFOKEY OF MPLTINFO-PK-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
                   MOVE   9 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *            PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   MOVE "Y"             TO  ERR-SW
                   GO TO 631-EPT-X
               ELSE
                   MOVE "START MPLTINFO2 * 631-EPT" TO BU-DISPLAY-MSG
                   MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
                   GO TO 2100-BLOWUP.

       631-EPT-X.
           EXIT.

       631-DELETE-OLD-DINVRCD.
           MOVE S-NEW-REGNUM TO REGISTERNO OF DINVRCD-O-REC-REG.
           READ DINVRCD-O-REG INTO BUF-DINVRCD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DINVRCD 631-DOD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           DELETE DINVRCD-O-REG INVALID KEY
              MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE DINVRCD 631-DOD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.


       631-DOD-X.
           EXIT.

       631-CREATE-REGNUM.
           MOVE "PREG"  TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO*631-CR"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG             TO  BU-DISPLAY-FLD (4)
               GO TO  2100-BLOWUP.

       631-ADD-ONE-LAST-REGNUM.
      *------- IF MAXIMUM NUMBER OF REGISTER NUMBERS IS REACHED, START
      *------- NUMBERS OVER.
           IF MPLTINFO-REGNUM = 99999
               MOVE +00001    TO  MPLTINFO-REGNUM
           ELSE
               ADD +1         TO  MPLTINFO-REGNUM.
           MOVE MPLTINFO-REGNUM  TO  S-NEW-REGNUM,
                                     REGISTER-ARG.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVRCD-O-REC-REG.
           START DINVRCD-O-REG KEY = REGISTERNO OF DINVRCD-O-REC-REG
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "START DINVRCD * 631-AOLR" TO BU-DISPLAY-MSG
                   MOVE REGISTER-ARG    TO BU-DISPLAY-FLD (4)
                   GO TO 2100-BLOWUP
           ELSE
               GO TO 631-ADD-ONE-LAST-REGNUM.

           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE MPLTINFO*631-AOLR"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG             TO  BU-DISPLAY-FLD (4)
               GO TO  2100-BLOWUP.


       631-CREATE-REGNUM-X.
           EXIT.


       632-CALC-DUE-DATE.
           MOVE INV-TERMS               TO  SINVDUED-INV-TERMS.
           MOVE S-INVOICE-DATE          TO  SINVDUED-INV-DATE.
           CALL "SINVDUED" USING BASE,
                                 SINVDUED-PARMS,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           MOVE SINVDUED-DUE-DATE       TO  INV-DUE-DATE.
      *--------- ACCOUNT FOR CENTURY.
           IF INV-DUE-DATE (1:2) > "70"
               MOVE "19"                TO  INV-DUE-CC
           ELSE
               MOVE "20"                TO  INV-DUE-CC.

       632-CALC-DUE-DATE-X.
           EXIT.


       633-DPODATAITM.
           MOVE PO-ARG   TO PORCVNO OF DPODATAITM-O-REC.
           MOVE "000099" TO ITEMSEQNO OF DPODATAITM-O-REC.
           START DPODATAITM-O KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   PERFORM 6331-PUT THRU 6331-PUT-X
                   GO TO 633-DPODATAITM-X
               ELSE
                   MOVE "START DPODATAITM*633-D"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

       633-GET-DPODATAITM.
           READ DPODATAITM-O NEXT INTO BUF-DPODATAITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READN DPODATAITM*633-D"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           IF DE3-INV-DESC = SPACE
               DELETE DPODATAITM-O
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-DELETE
               IF FILE-STATUS NOT = "00"
                       MOVE "DELETE DPODATAITM*633-GD"
                             TO  BU-DISPLAY-MSG
                       GO TO  2100-BLOWUP
               ELSE
                   NEXT SENTENCE
               END-IF
           ELSE
               MOVE DE3-INV-DESC  TO  DATAITM-INFO
               REWRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DPODATAITM*633-GD"
                         TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

       633-DPODATAITM-X.
           EXIT.

       6331-PUT.
           IF DE3-INV-DESC = SPACE
               GO TO 6331-PUT-X.
           MOVE SPACE         TO  BUF-DPODATAITM.
           MOVE PO-ARG        TO  DATAITM-PO-RCV-NO.
           MOVE ZERO          TO  DATAITM-ITEM-NO.
           MOVE "99"          TO  DATAITM-LINE-NO.
           MOVE DE3-INV-DESC  TO  DATAITM-INFO.
           WRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DPODATAITM*633-GD"
                     TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       6331-PUT-X.
           EXIT.

       641-SORT-ITEM-NUMBERS.
           SORT SORT-FILE
               ASCENDING KEY  SD-ITEM-NO
               INPUT PROCEDURE   641A-RELEASE
               OUTPUT PROCEDURE  641B-RETURN.

       641-SORT-ITEM-NUMBERS-X.
           EXIT.

       641A-RELEASE SECTION 06.
       641A-RLSE-ITEM-NO.
           ADD +1  TO  DE-ITEM-SUB.
           IF DE-ITEM-SUB > 24
               MOVE ZERO  TO  DE-ITEM-SUB
               GO TO  641A-RLSE-ITEM-NO-X.
           IF DE3-ITEM-NO (DE-ITEM-SUB) = SPACE OR ZEROS
               GO TO  641A-RLSE-ITEM-NO.
           MOVE DE3-ITEM-NO (DE-ITEM-SUB)  TO  SD-ITEM-NO.
           RELEASE  SORT-RCD.
           GO TO  641A-RLSE-ITEM-NO.

       641A-RLSE-ITEM-NO-X.
           EXIT.

       641B-RETURN SECTION 06.
       641B-RTRN-ITEM-NO.
           RETURN  SORT-FILE
               AT END  MOVE DE-ITEM-SUB  TO  S-ITEM-COUNT
                       MOVE ZERO         TO  DE-ITEM-SUB
                       GO TO  641B-RTRN-ITEM-NO-X.
           ADD +1  TO  DE-ITEM-SUB.
           MOVE SD-ITEM-NO  TO  DE3-ITEM-NO (DE-ITEM-SUB).
           GO TO  641B-RTRN-ITEM-NO.

       641B-RTRN-ITEM-NO-X.
           EXIT.
       641C-END-SORT SECTION 06.

       641-GET-CODED-DESC.
      **************************************************
      **  CALL CDESC FOR DESCRIPTION LINES. (CODED)   **
      **************************************************
           MOVE 4                       TO  CDESC-LINES-TO-GET.
           CALL "CDESC" USING RET-CODE,
                              BASE,
                              STATUS-AREA,
                              BU-DISPLAY-MSG,
                              CODE-ARG,
                              CDESC-DATA.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               MOVE CODE-ARG            TO  BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           IF CDESC-LINES-GOT  =  0
      *        *** NO DESCRIPTION ON FILE ***
               MOVE  14 TO LANG-SETNUM
               MOVE   3 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-DESC-LINE (1)
               GO TO  641-GCD-X.

           MOVE ZEROS                   TO  DESC-SUB.

       641-GET-DESC-LOOP.
           ADD 1                        TO  DESC-SUB.
           IF DESC-SUB > CDESC-LINES-GOT  OR
              DESC-SUB > 4
               GO TO 641-GCD-X.

           MOVE CDESC (DESC-SUB)        TO  DE4-DESC-LINE (DESC-SUB).
           GO TO  641-GET-DESC-LOOP.

       641-GCD-X.
           EXIT.

       641-GET-NONCODED-DESC.
           MOVE 4                       TO  CNDESC-LINES-TO-GET.
           MOVE 0                       TO  CNDESC-LINES-GOT.
           CALL "CNDESC" USING BASE, PO-ARG, ITM-NUMBER,
               CNDESC-DATA.

           IF CNDESC-LINES-GOT  =  0
      *        *** NO DESCRIPTION ON FILE ***
               MOVE  14 TO LANG-SETNUM
               MOVE   3 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-DESC-LINE (1)
               GO TO  641-GND-X.

           MOVE ZEROS                   TO  DESC-SUB.

       641-GET-NONCODED-LOOP.
           ADD 1                        TO  DESC-SUB.
           IF DESC-SUB > CNDESC-LINES-GOT  OR
              DESC-SUB > 4
               GO TO 641-GND-X.

           MOVE CNDESC (DESC-SUB)       TO  DE4-DESC-LINE (DESC-SUB).
           GO TO  641-GET-NONCODED-LOOP.

       641-GND-X.
           EXIT.

      *************************************************************
      **  THE FOLLOWING PROCEDURE IS EXECUTED WHENEVER
      **  RECEIVING SLIP INQUIRY IS CALLED FROM THE ITEM
      **  SCREEN SINCE A CALL TO RECEIVING SLIP INQUIRY MOVES
      **  THE POINTERS IN THE DATA SET 'DPOITEM' AROUND.  SINCE
      **  THE ITEM PROCESSING OF INVOICING IS DOING A CHAINED
      **  GET 'MODE5' IN DPOITEM THIS CAN CAUSE SEVERE PROBLEMS
      **  SO UPON RETURNING FROM RECEIVING SLIP INQUIRY THE PLACE
      **  IN THE CHAIN THAT INVOICING WAS AT IS RECOVERED BY
      **  DOING A 'MODE4' GET (ADDRESS GET)
      *************************************************************

       641-CALC-GET-DPOITEM.
           MOVE ITM-NUMBER TO ITEMNO  OF DPOITEM-I-REC.
           MOVE PO-ARG     TO PORCVNO OF DPOITEM-I-REC.
           READ DPOITEM-I INTO BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START DPOITEM*641-CGD"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       641-CALC-GET-DPOITEM-X.
           EXIT.

       641-EDIT-DEPT.
           IF ACCT-SUB = 1
               MOVE 20  TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 2
               MOVE 28  TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 3
               MOVE 36  TO  FIELD-NUMBER
           ELSE
           IF ACCT-SUB = 4
               MOVE 84  TO  FIELD-NUMBER
           ELSE
               MOVE 90  TO  FIELD-NUMBER.

           IF DE4-SUBD (ACCT-SUB) = "0000"
               IF DE4-SUBD (ACCT-SUB) = S-DE4-SUBD (ACCT-SUB)
                   NEXT SENTENCE
               ELSE
                   MOVE "VERIFY NWO OR VALID DISTRIBUTION IN ADDL DATA -    "
      -                 " IF VALID DEPRESS 'ENTER'"  TO MESSAGE-BUFFER
                   MOVE "Y"            TO  CALC-ERROR-SW
                   MOVE DE4-SUBD (ACCT-SUB) TO  S-DE4-SUBD (ACCT-SUB)
      *            PERFORM 72-PGM-ERROR THRU 72-PGM-ERROR-X
           ELSE
               MOVE SPACES             TO  S-DE4-SUBD (ACCT-SUB).

      *---- DO NOT DO ANY DEPT EDITING IF NO UNITS ARE INVOLVED
           IF DE4-INV-UNPD-QTY = ZEROS
               NEXT SENTENCE
           ELSE
           IF DE4-SUBD (ACCT-SUB) = S-ITM-SUBD
               NEXT SENTENCE
           ELSE
           IF DE4-SUBD (ACCT-SUB) = S-DEPT-STR
               MOVE "CANNOT CHANGE DIRECT CHARGE DEPT TO STOREROOM DEPT"
                   TO MESSAGE-BUFFER
               MOVE "Y"                  TO   CALC-ERROR-SW
      *        PERFORM 72-PGM-ERROR      THRU 72-PGM-ERROR-X
           ELSE
           IF S-ITM-SUBD = S-DEPT-STR
               MOVE "CANNOT CHANGE STOREROOM DEPT TO DIRECT CHARGE"
                   TO MESSAGE-BUFFER
               MOVE "Y"                  TO   CALC-ERROR-SW.
      *        PERFORM 72-PGM-ERROR      THRU 72-PGM-ERROR-X.

           MOVE DE4-SUBD (ACCT-SUB) TO DEPT-NO.
           MOVE BUILD-DEPT-KEY TO DEPT-ARG.
           MOVE DEPT-ARG       TO VALDTAKEY OF MVALIDPLTDTA-I-REC.
           START MVALIDPLTDTA-I KEY = VALDTAKEY OF MVALIDPLTDTA-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "Y"  TO  CALC-ERROR-SW
      *            *** INVALID SUB DETAIL ACCOUNT ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  53 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *            PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               ELSE
                   MOVE "START MVALIDPLT*641-ED" TO BU-DISPLAY-MSG
                   MOVE BUILD-DEPT-KEY       TO BU-DISPLAY-FLD (4)
                   GO TO 2100-BLOWUP.

       641-ED-X.
           EXIT.

       641-EDIT-TAX-CODE.
           MOVE "N"                    TO  ERR-SW.
           MOVE TAX-ARG TO TAXCDE OF MTAX-I-REC.
           READ MTAX-I INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
      *        *** TAX CODE DOESN'T EXIST ***
               MOVE  20 TO LANG-SETNUM
               MOVE   7 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TAX-ARG  TO  MSG-FLD
      *        PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MTAX * 641-ET" TO BU-DISPLAY-MSG
               MOVE TAX-ARG          TO BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.
       641-ETC-X.
           EXIT.

       641-GET-DINVITM.
           READ DINVITM-I NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS = "10" OR "14" OR "46")
             OR REGISTERNO OF DINVITM-I-REC NOT = REGISTER-ARG
               MOVE "READN" TO  BU-DISPLAY-FLD (3)
               MOVE SPACES  TO  BUF-DINVITM
               MOVE "0000"  TO  S-INVITM-ITEM-NO
               GO TO 641-GD-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READN DINVITM 641-GD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

           MOVE INVITM-ITEM-NO          TO  S-INVITM-ITEM-NO.
           MOVE INVITM-PO-QTY-PD        TO  S-INVITM-PO-QTY-PD.
           MOVE INVITM-PO-UPRICE        TO  S-INVITM-PO-UPRICE.
           MOVE INVITM-INV-QTY-PD       TO  S-INVITM-INV-QTY-PD.
           MOVE INVITM-INV-UPRICE       TO  S-INVITM-INV-UPRICE.
           MOVE INVITM-TAX-CODE         TO  S-INVITM-TAX-CODE.
           MOVE INVITM-MEMO-INDIC       TO  S-INVITM-MEMO-INDIC.

       641-GD-X.
           EXIT.

       641-CALC-EXIST-ITEM-INFO.
           MOVE ZEROS  TO  C-EXT-DIFF.
           IF S-INVITM-INV-QTY-PD = ZEROS
               MOVE S-INVITM-INV-UPRICE  TO  W-INV-ITEM-EXT,
                                             W-PO-ITEM-EXT
           ELSE
               MULTIPLY S-INVITM-INV-QTY-PD BY S-INVITM-INV-UPRICE
                   GIVING W-INV-ITEM-EXT  ROUNDED
               MULTIPLY S-INVITM-PO-QTY-PD BY S-INVITM-PO-UPRICE
                   GIVING W-PO-ITEM-EXT  ROUNDED.

           IF S-INVITM-INV-QTY-PD > S-INVITM-PO-QTY-PD AND
              S-INVITM-MEMO-INDIC = SPACES
               SUBTRACT W-PO-ITEM-EXT  FROM  W-INV-ITEM-EXT
                   GIVING C-EXT-DIFF.

           IF C-EXT-DIFF > ZERO
               NEXT SENTENCE
           ELSE
               MOVE ZERO  TO  C-EXT-DIFF.

           MOVE S-INVITM-TAX-CODE  TO  DE4-INV-ITEM-TAX-CODE.

           IF DE-ITEM-SUB > 24
               NEXT SENTENCE
           ELSE
           IF DE3-ITEM-NO (1) = "ALL " OR " ALL"
               NEXT SENTENCE
           ELSE
           IF DE3-ITEM-NO (DE-ITEM-SUB) = S-INVITM-ITEM-NO
               ADD 1  TO  DE-ITEM-SUB.

       641-CEII-X.
           EXIT.

       642-CALC-NEW-QTY.
           IF ITM-CORP-CODE = "NON-STR"
              MOVE V-OLD-QTY  TO  C-NEW-QTY
              GO TO  642-CALC-NEW-QTY-X.

           MOVE ITM-CORP-CODE       TO  CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-I-REC.
           READ MSTORERM-I INTO BUF-MSTORERM
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "READ MSTORERM*642-CNQ"  TO BU-DISPLAY-MSG
              MOVE CODE-ARG            TO  BU-DISPLAY-FLD (4)
              GO TO  2100-BLOWUP.

           IF V-NEW-UM = V-OLD-UM
              MOVE V-OLD-QTY  TO  C-NEW-QTY
              GO TO 642-CALC-NEW-QTY-X.

           IF V-OLD-UM = STR-UM
              IF V-NEW-UM = STR-UM1
                 IF STR-UM1-CF = ZERO
                    PERFORM 642-ZERO-ERROR
                 END-IF
                 DIVIDE V-OLD-QTY BY STR-UM1-CF GIVING C-NEW-QTY ROUNDED
              ELSE
                 IF STR-UM2-CF = ZERO
                    PERFORM 642-ZERO-ERROR
                 END-IF
                 DIVIDE V-OLD-QTY BY STR-UM2-CF GIVING C-NEW-QTY ROUNDED
              END-IF
              GO TO 642-CALC-NEW-QTY-X
           END-IF.

           IF V-NEW-UM = STR-UM
              IF V-OLD-UM = STR-UM1
                 IF STR-UM1-CF = ZERO
                    PERFORM 642-ZERO-ERROR
                 END-IF
                 MULTIPLY V-OLD-QTY BY STR-UM1-CF
                          GIVING C-NEW-QTY ROUNDED
              ELSE
                 IF STR-UM2-CF = ZERO
                    PERFORM 642-ZERO-ERROR
                 END-IF
                 MULTIPLY V-OLD-QTY BY STR-UM2-CF
                          GIVING C-NEW-QTY ROUNDED
              END-IF
              GO TO 642-CALC-NEW-QTY-X
           END-IF.

           IF V-NEW-UM = STR-UM1
              IF STR-UM1-CF = ZERO
                 PERFORM 642-ZERO-ERROR
              END-IF
              DIVIDE STR-UM2-CF BY STR-UM1-CF GIVING C-ALT-CF ROUNDED
              MULTIPLY V-OLD-QTY BY C-ALT-CF GIVING C-NEW-QTY ROUNDED
           ELSE
              IF STR-UM2-CF = ZERO
                 PERFORM 642-ZERO-ERROR
              END-IF
              DIVIDE STR-UM1-CF BY STR-UM2-CF GIVING C-ALT-CF ROUNDED
              MULTIPLY V-OLD-QTY BY C-ALT-CF GIVING C-NEW-QTY ROUNDED.

       642-CALC-NEW-QTY-X.
           EXIT.

       642-ZERO-ERROR.
           MOVE "UNDEFINED UNIT OF MEASURE (642-CNQ)" TO BU-DISPLAY-MSG.
           MOVE CODE-ARG TO BU-DISPLAY-FLD (1).
           MOVE "CONVERT FROM" TO BU-DISPLAY-FLD (2).
      *----BAD-UM-MSG = "A TO B"
           MOVE V-OLD-UM TO BAD-UM-MSG-A.
           MOVE V-NEW-UM TO BAD-UM-MSG-B.
           MOVE BAD-UM-MSG TO BU-DISPLAY-FLD (3).
           MOVE S-NEW-REGNUM TO BU-DISPLAY-FLD (4).
           GO TO 2100-BLOWUP.

       643-CALC-VALUES.
           MOVE K-PO-UNPD-QTY           TO  W-PO-UNPD-QTY.
           MOVE K-PO-UM                 TO  W-PO-UM.
           MOVE K-PO-UPRICE             TO  W-PO-UPRICE.
           MOVE K-PO-ITEM-EXT           TO  W-PO-ITEM-EXT.

           MOVE DE4-INV-UNPD-QTY        TO  W-INV-UNPD-QTY.
           MOVE DE4-INV-UPRICE          TO  W-INV-UPRICE.
           MOVE DE4-INV-ITEM-EXT        TO  W-INV-ITEM-EXT.

           IF DE3-INV-CE = "2" OR "Z"
               IF W-INV-UPRICE = ZEROS AND
                  W-INV-ITEM-EXT = ZEROS
      *M***            PRICE MUST BE GREATER THAN ZERO FOR CREDIT INVOICES
                       MOVE   16         TO  LANG-SETNUM
                       MOVE  127         TO  LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE "Y"          TO  CALC-ERROR-SW
                       MOVE  67          TO  FIELD-NUMBER
                       MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                       MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                       GO TO 643-CALC-VALUES-X.

9211CK     IF VIEW-LASTKEY NOT = 2
9207CK        IF W-INV-UPRICE = ZEROS AND W-INV-ITEM-EXT = ZEROES
  .   *M***      WARNING: UNIT & EXTENSION PRICE ARE ZERO.
  .   *M***      IF CORRECT, PRESS F2 TO ACCEPT.
  .              MOVE 05061 TO CATREAD-MSG-NUMBER
  .              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
  .              MOVE "Y" TO CALC-ERROR-SW
  .              MOVE 70 TO FIELD-NUMBER
  .              MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
  .              MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
9207CK           GO TO 643-CALC-VALUES-X.

           IF DE4-INV-QTY-SIGN = "-"  AND
              DE4-INV-MEMO-INDIC = SPACES
               IF W-INV-UNPD-QTY > K-PO-QTY-PAID
      *            *** CANNOT ISSUE A CREDIT FOR MORE UNITS THAN PAID FOR ***
                   MOVE   3 TO LANG-SETNUM
                   MOVE  57 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE "Y"   TO  CALC-ERROR-SW
                   MOVE 67    TO  FIELD-NUMBER
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 643-CALC-VALUES-X.

           MOVE ZERO                    TO  C-EXT-DIFF.

           IF W-INV-UNPD-QTY = ZERO
               IF W-INV-UPRICE = ZEROS
                   MOVE W-INV-ITEM-EXT    TO  W-INV-UPRICE
               ELSE
               IF W-INV-ITEM-EXT = ZEROS
                   MOVE W-INV-UPRICE      TO  W-INV-ITEM-EXT
               ELSE
               IF W-INV-ITEM-EXT = W-INV-UPRICE
                   NEXT SENTENCE
               ELSE
      *      *** UNIT PRICE AND EXTENSION PRICE MUST EQUAL FOR ZERO QTY PAID ***
                   MOVE  21 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE "Y"   TO  CALC-ERROR-SW
                   MOVE 70    TO  FIELD-NUMBER
                   MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   GO TO 643-CALC-VALUES-X
           ELSE
               IF W-INV-UNPD-QTY > W-PO-UNPD-QTY  AND
                  DE4-INV-QTY-SIGN = "+"  AND
                  DE4-INV-MEMO-INDIC = SPACES
                   IF W-INV-UPRICE = ZERO
                       DIVIDE W-INV-ITEM-EXT BY W-INV-UNPD-QTY
                                GIVING  W-INV-UPRICE ROUNDED
                       SUBTRACT W-PO-ITEM-EXT FROM W-INV-ITEM-EXT
                                GIVING  C-EXT-DIFF
                   ELSE
                   IF W-INV-ITEM-EXT = ZERO
                       MULTIPLY W-INV-UNPD-QTY BY W-INV-UPRICE
                              GIVING  W-INV-ITEM-EXT ROUNDED
                       SUBTRACT W-PO-ITEM-EXT FROM W-INV-ITEM-EXT
                                  GIVING  C-EXT-DIFF
                   ELSE
                       MULTIPLY W-INV-UNPD-QTY BY W-INV-UPRICE
                              GIVING  CP-INV-ITEM-EXT  ROUNDED
                       IF CP-INV-ITEM-EXT = W-INV-ITEM-EXT
                           SUBTRACT W-PO-ITEM-EXT FROM
                               W-INV-ITEM-EXT GIVING C-EXT-DIFF
                       ELSE
                           MOVE "Y"  TO  CALC-ERROR-SW
                           MOVE 67   TO  FIELD-NUMBER
      ***** INVOICE QUANTITY X UNIT PRICE DOES NOT = EXTENSION PRICE ***
                           MOVE   9 TO LANG-SETNUM
                           MOVE   5 TO LANG-MSGNUM
                           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                           MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                           MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                           GO TO  643-CALC-VALUES-X
               ELSE
                   IF W-INV-UPRICE = ZERO
                       DIVIDE W-INV-ITEM-EXT BY W-INV-UNPD-QTY
                                       GIVING  W-INV-UPRICE ROUNDED
                   ELSE
                       IF W-INV-ITEM-EXT = ZERO
                           MULTIPLY W-INV-UNPD-QTY BY W-INV-UPRICE
                                GIVING  W-INV-ITEM-EXT  ROUNDED
                       ELSE
                           MULTIPLY W-INV-UNPD-QTY BY W-INV-UPRICE
                                GIVING  CP-INV-ITEM-EXT  ROUNDED
                           IF CP-INV-ITEM-EXT = W-INV-ITEM-EXT
                               NEXT SENTENCE
                           ELSE
                               MOVE "Y"  TO  CALC-ERROR-SW
                               MOVE 67   TO  FIELD-NUMBER
      *         *** INVOICE QUANTITY X UNIT PRICE DOES NOT = EXTENSION PRICE ***
                               MOVE   9 TO LANG-SETNUM
                               MOVE   5 TO LANG-MSGNUM
                               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
                               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                               GO TO  643-CALC-VALUES-X.

           IF C-EXT-DIFF > ZERO
               NEXT SENTENCE
           ELSE
               MOVE ZERO  TO  C-EXT-DIFF.

           IF W-INV-UNPD-QTY > W-PO-UNPD-QTY AND
              DE4-INV-QTY-SIGN = "+"  AND
              DE4-INV-MEMO-INDIC = SPACES
      *IF PLANT HAS CHOOSEN VIA PLTSTUP TO ALLOW PREPAYS OR THIS IS
      *A NON-RCVBL PO - SKIP EDIT
              IF ALLOW-PREPAYS OR PO-NON-RCV-INDIC = "X"
               NEXT SENTENCE
              ELSE
      *        *** PREPAYS ARE NOT ALLOWED AT YOUR PLANT ***
               MOVE "Y"   TO  CALC-ERROR-SW
               MOVE 81    TO  FIELD-NUMBER
               MOVE 66249 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE4-MSG-LINE
               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
               GO TO  643-CALC-VALUES-X
           ELSE
               MOVE W-INV-UNPD-QTY    TO  W-PO-UNPD-QTY
               MULTIPLY W-PO-UNPD-QTY BY W-PO-UPRICE
                   GIVING W-PO-ITEM-EXT  ROUNDED
               IF W-PO-UNPD-QTY = ZEROS  OR
                  DE4-INV-MEMO-INDIC = "X"
                   MOVE W-INV-UPRICE    TO  W-PO-UPRICE
                   MOVE W-INV-ITEM-EXT  TO  W-PO-ITEM-EXT.

           IF DE4-INV-QTY-SIGN = "-"
               MULTIPLY -1  BY  W-INV-ITEM-EXT
               MULTIPLY -1  BY  W-PO-ITEM-EXT,
               MULTIPLY -1  BY  W-INV-UPRICE,
               MULTIPLY -1  BY  W-PO-UPRICE.

           MOVE W-INV-UNPD-QTY          TO  DE4-INV-UNPD-QTY.
           MOVE W-PO-UM                 TO  DE4-INV-UM.
           MOVE W-INV-UPRICE            TO  DE4-INV-UPRICE.
           MOVE W-INV-ITEM-EXT          TO  DE4-INV-ITEM-EXT.

           MOVE W-PO-UPRICE             TO  DE4-PO-UPRICE.
           MOVE W-PO-ITEM-EXT           TO  DE4-PO-ITEM-EXT.
           MOVE DE4-INV-QTY-SIGN        TO  DE4-PO-QTY-SIGN.

       643-CALC-VALUES-X.
           EXIT.

       651-BACKOUT-REGNUM.
           MOVE "PREG" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO*651-BR"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG             TO  BU-DISPLAY-FLD (4)
               GO TO  2100-BLOWUP.

           IF S-NEW-REGNUM  =  MPLTINFO-REGNUM
      *----------- IF THE REGISTER NUMBER IS 1, RESET MPLTINFO TO BE
      *----------- 99999 INSTEAD OF 0.
               IF MPLTINFO-REGNUM = 00001
                   MOVE +99999    TO    MPLTINFO-REGNUM
               ELSE
                   SUBTRACT +1    FROM  MPLTINFO-REGNUM
               END-IF
           ELSE
               MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-O-REC
               START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-O-REC
                  INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO 651-BACKOUT-REGNUM-X.

           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE MPLTINFO*651-BR"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG             TO  BU-DISPLAY-FLD (4)
               GO TO  2100-BLOWUP.

       651-BACKOUT-REGNUM-X.
           EXIT.

       661-GET-FREE-VERBAGE.
           MOVE "H"         TO  INV-STATUS.
           MOVE SPACES      TO  INV-PAYMENT-IND.

       661-GFV-X.
           EXIT.

       661-CALC-VALUES.
           IF DE6-FRT-SIGN = "-"
               MULTIPLY  -1  BY  DE6-VEN-FRT  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE    TO  INV-ADD-VFRT
               ADD S-NEG-VALUE     TO  S-CALC-INV-AMT
           ELSE
               MOVE DE6-VEN-FRT  TO  INV-ADD-VFRT
               ADD DE6-VEN-FRT   TO  S-CALC-INV-AMT.

           IF CALC-TAX-FRT-SW = "Y"
               PERFORM 6611-CALC-TAX-ON-FRT  THRU  6611-CTOF-X.

           IF DE6-TAX-SIGN = "-"
               MULTIPLY  -1  BY  DE6-VEN-TAX  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE    TO  INV-ADD-TAX
               ADD S-NEG-VALUE     TO  S-CALC-INV-AMT
           ELSE
               MOVE DE6-VEN-TAX  TO  INV-ADD-TAX
               ADD DE6-VEN-TAX   TO  S-CALC-INV-AMT.

           IF DE6-CTNR-SIGN = "-"
               MULTIPLY  -1  BY  DE6-VEN-CTNRS  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE      TO  INV-ADD-CTNRS
               ADD S-NEG-VALUE       TO  S-CALC-INV-AMT
           ELSE
               MOVE DE6-VEN-CTNRS  TO  INV-ADD-CTNRS
               ADD DE6-VEN-CTNRS   TO  S-CALC-INV-AMT.

           IF DE6-INS-SIGN = "-"
               MULTIPLY  -1  BY  DE6-VEN-INS  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE    TO  INV-ADD-INS
               ADD S-NEG-VALUE     TO  S-CALC-INV-AMT
           ELSE
               MOVE DE6-VEN-INS  TO  INV-ADD-INS
               ADD DE6-VEN-INS   TO  S-CALC-INV-AMT.

           IF DE6-OTHER-SIGN = "-"
               MULTIPLY  -1  BY  DE6-VEN-OTHER  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE      TO  INV-ADD-OTHER
               ADD S-NEG-VALUE       TO  S-CALC-INV-AMT
           ELSE
               MOVE DE6-VEN-OTHER  TO  INV-ADD-OTHER
               ADD DE6-VEN-OTHER   TO  S-CALC-INV-AMT.

           IF GST-ENTRY NOT EQUAL ZERO
             IF DE6-GST-SIGN = "-"
                 MULTIPLY  -1  BY  DE6-GST-AMOUNT GIVING  S-NEG-VALUE
                 MOVE S-NEG-VALUE      TO  INV-ADD-GST
                 ADD S-NEG-VALUE       TO  S-CALC-INV-AMT,
                                           INV-ADD-TAX
             ELSE
                 MOVE DE6-GST-AMOUNT TO  INV-ADD-GST
                 ADD DE6-GST-AMOUNT  TO  S-CALC-INV-AMT,
                                         INV-ADD-TAX
             END-IF
           END-IF.

           MOVE S-CALC-INV-AMT    TO  DE6-AMT-TO-BE-PAID.

       661-CALC-VALUES-X.
           EXIT.

       661-VERIFY-TAX-CODE.
           IF DE6-TAX-CODE = SAVE-TAX-CODE
               NEXT SENTENCE
           ELSE
               MOVE DE6-TAX-CODE    TO  TAX-ARG
               MOVE TAX-ARG TO TAXCDE OF MTAX-I-REC
               START MTAX-I KEY = TAXCDE OF MTAX-I-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS-1 = "2"
      *            * TAX CODE DOESN'T EXIST *
                       MOVE  20 TO LANG-SETNUM
                       MOVE   7 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE DE6-TAX-CODE  TO  MSG-FLD
                       MOVE 29       TO  FIELD-NUMBER
      *                PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                       MOVE "Y"      TO  TAX-ERROR-SW
                       GO TO 661-VTC-X
                   ELSE
                       MOVE "START MTAX * 661-VTC" TO BU-DISPLAY-MSG
                       MOVE TAX-ARG          TO BU-DISPLAY-FLD (4)
                       GO TO 2100-BLOWUP.
      *----- IN CASE THERE HAS BEEN AN INVALID TAX CODE ENTERED
      *----- I WILL CLEAR OUT THE MESSAGE-BUFFER SINCE A VALID
      *----- TAX CODE HAS NOW BEEN ENTERED.
           MOVE SPACE                    TO  MESSAGE-BUFFER.
           MOVE DE6-TAX-CODE             TO  INV-TAX-CODE.

       661-VTC-X.
           EXIT.

       6611-CALC-TAX-ON-FRT.
           MOVE "N"              TO  CALC-TAX-FRT-SW.
           MOVE INV-TAX-CODE     TO  TAX-ARG.
           MOVE TAX-ARG TO TAXCDE OF MTAX-I-REC.
           READ MTAX-I INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MTAX * 6611-CTOF" TO BU-DISPLAY-MSG
               MOVE TAX-ARG          TO BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           IF DE6-TAX-SIGN = "-"
               MULTIPLY -1 BY DE6-VEN-TAX  GIVING S-TAX-TO-VENDOR
           ELSE
               MOVE DE6-VEN-TAX  TO  S-TAX-TO-VENDOR.
           MOVE ZEROS          TO  CALC-TOTAL-FRT-TAX.

       6611-CALC-TAX-FRT-LOOP.
           IF GST-ENTRY EQUAL ZERO

             MOVE 0 TO INV-GST-TAX

           ELSE

             COMPUTE INV-GST-TAX ROUNDED =
               (MTAX-PERCENT(GST-ENTRY) / 100.0000000) *
               INV-ADD-VFRT
             ADD INV-GST-TAX TO GST-AMOUNT ROUNDED
             MOVE GST-AMOUNT TO DE6-GST-AMOUNT
             IF GST-AMOUNT >= 0
               MOVE "+" TO DE6-GST-SIGN
             ELSE
               MOVE "-" TO DE6-GST-SIGN
             END-IF

           END-IF.
           IF TAX-ON-GST

             PERFORM VARYING SUB1 FROM 1 BY 1
                     UNTIL SUB1 > 4

               IF SUB1 NOT EQUAL GST-ENTRY

                 COMPUTE CALC-TOTAL-FRT-TAX ROUNDED =
                   CALC-TOTAL-FRT-TAX +
                   ((INV-ADD-VFRT + INV-GST-TAX) *
                    (MTAX-PERCENT(SUB1) / 100.0000000))

               END-IF

             END-PERFORM

           ELSE

             PERFORM VARYING SUB1 FROM 1 BY 1
                     UNTIL SUB1 > 4

               IF SUB1 NOT EQUAL GST-ENTRY

                 COMPUTE CALC-TOTAL-FRT-TAX ROUNDED =
                   CALC-TOTAL-FRT-TAX +
                   ((INV-ADD-VFRT) *
                    (MTAX-PERCENT(SUB1) / 100.0000000))

               END-IF

             END-PERFORM

           END-IF.

       6611-ADD-ITEM-FRT-TAX.
           ADD S-TAX-TO-VENDOR, CALC-TOTAL-FRT-TAX
               GIVING CALC-ITEM-FRT-TAX.
           COMPUTE DE6-VEN-TAX ROUNDED = CALC-ITEM-FRT-TAX.
           IF CALC-ITEM-FRT-TAX < ZEROS
               MOVE "-"            TO  DE6-TAX-SIGN
           ELSE
               MOVE "+"            TO  DE6-TAX-SIGN.

       6611-CTOF-X.
           EXIT.

       662-UPDATE-QTY-PAID.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-O-REC.
           START DINVITM-O KEY = REGISTERNO OF DINVITM-O-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 662-UPDATE-QTY-PAID-X
               ELSE
                   MOVE "START DINVITM*662-UQP"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.

       662-DINVITM-LOOP.
           READ DINVITM-O NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE HIGH-VALUES TO REGISTERNO OF DINVITM-O-REC
                   START DINVITM-O KEY > REGISTERNO OF DINVITM-O-REC
                      INVALID KEY MOVE "00" TO FILE-STATUS
                   END-START
                   GO TO  662-UPDATE-QTY-PAID-X
               ELSE
                   MOVE "READN DINVITM*662-DL"  TO  BU-DISPLAY-MSG
                   GO TO  2100-BLOWUP.
           IF REGISTERNO OF DINVITM-O-REC NOT = REGISTER-ARG
               MOVE HIGH-VALUES TO REGISTERNO OF DINVITM-O-REC
               START DINVITM-O KEY > REGISTERNO OF DINVITM-O-REC
                  INVALID KEY MOVE "00" TO FILE-STATUS
               END-START
               GO TO  662-UPDATE-QTY-PAID-X.

           IF INVITM-MEMO-INDIC = "X"  OR
              INVITM-HOLD-INDIC = "X"
               GO TO 662-DINVITM-LOOP.

           IF INVITM-PO-UPRICE < ZEROS
               MULTIPLY -1 BY INVITM-PO-QTY-PD.
           IF INVITM-INV-UPRICE < ZEROS
               MULTIPLY -1 BY INVITM-INV-QTY-PD.

       662-UPDATE-DPOITEM.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-O-REC.
           MOVE INVITM-ITEM-NO TO ITEMNO OF DPOITEM-O-REC.
           READ DPOITEM-O INTO BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPOITEM*662-UD"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           IF INVITM-ITEM-NO = ITM-NUMBER  AND
              INV-PO-RCV-NO = ITM-PO-RCV-NO
               NEXT SENTENCE
           ELSE
               MOVE "INVALID DPOITEM RETRIEVAL*662-UD"
                          TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           MOVE ITM-PRICE-UM      TO  V-OLD-UM.
           MOVE ITM-UM            TO  V-NEW-UM.

           IF INV-PAYMENT-IND = "P"
               MOVE INVITM-PO-QTY-PD  TO  V-OLD-QTY
           ELSE
               MOVE INVITM-INV-QTY-PD  TO  V-OLD-QTY.

           PERFORM  642-CALC-NEW-QTY  THRU  642-CALC-NEW-QTY-X.
           ADD C-NEW-QTY          TO  ITM-QTY-PAID.

           REWRITE DPOITEM-O-REC FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE DPOITEM*662-UD"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           GO TO  662-DINVITM-LOOP.

       662-UPDATE-QTY-PAID-X.
           EXIT.

       662-UPDATE-MONTH-PAID.
           MOVE PO-ARG TO PORCVNO OF DPORECD-O-REC.
           READ DPORECD-O INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD*662-UMP"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           ACCEPT CURRENT-DATE FROM DATE.
           MOVE CURRENT-YY    TO  PO-LAST-PAYMENT-YEAR.
           MOVE CURRENT-MM    TO  PO-LAST-PAYMENT-MONTH.
           IF CURRENT-YY > "70"
               MOVE "19"      TO  PO-LAST-PAYMENT-CC
           ELSE
               MOVE "20"      TO  PO-LAST-PAYMENT-CC.

           REWRITE DPORECD-O-REC FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE DPOITEM*662-UMP"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       662-UMP-X.
           EXIT.

       671-CALC-VALUES.
           IF DE7-EXT-CE-AMT NOT = ZEROS
               IF DE7-CPW NOT = ZEROS
      *          *** CAN'T USE BOTH THE EXTRA C/E AND CPW ENTRY ***
                 MOVE   3 TO LANG-SETNUM
                 MOVE  29 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE 49  TO  FIELD-NUMBER
                 MOVE "Y"  TO  CALC-ERROR-SW
                 MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
                 MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                 GO TO 671-CALC-VALUES-X.

           IF DE7-CE9-CASHD NOT = ZEROS
               PERFORM 6711-CHECK-PAYMENT-TERMS  THRU  6711-CPT-X.

           IF DE7-CE3-SIGN = "-"
               MULTIPLY  -1  BY  DE7-CE3-FRT  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE    TO  CE3-FRT
               ADD S-NEG-VALUE     TO  S-CALC-INV-AMT
           ELSE
               MOVE DE7-CE3-FRT  TO  CE3-FRT
               ADD DE7-CE3-FRT   TO  S-CALC-INV-AMT.

           IF DE7-CE4-SIGN = "-"
               MULTIPLY  -1  BY  DE7-CE4-INS  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE      TO  CE4-INS
               ADD S-NEG-VALUE       TO  S-CALC-INV-AMT
           ELSE
               MOVE DE7-CE4-INS    TO  CE4-INS
               ADD DE7-CE4-INS     TO  S-CALC-INV-AMT.

           IF DE7-CE5-SIGN = "-"
               MULTIPLY  -1  BY  DE7-CE5-TAX  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE      TO  CE5-TAX
               ADD S-NEG-VALUE       TO  S-CALC-INV-AMT
           ELSE
               MOVE DE7-CE5-TAX    TO  CE5-TAX
               ADD DE7-CE5-TAX     TO  S-CALC-INV-AMT.

           IF DE7-CE9-SIGN = "-"
               MULTIPLY  -1  BY  DE7-CE9-CASHD  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE       TO  CE9-CASH-DSCNT
               ADD S-NEG-VALUE        TO  S-CALC-INV-AMT
           ELSE
               MOVE DE7-CE9-CASHD   TO  CE9-CASH-DSCNT
               ADD DE7-CE9-CASHD    TO  S-CALC-INV-AMT.

           IF DE7-EXT-CE-SIGN = "-"
               MULTIPLY -1 BY DE7-EXT-CE-AMT  GIVING  S-NEG-VALUE
               ADD S-NEG-VALUE  TO  S-CALC-INV-AMT
               MOVE S-NEG-VALUE      TO  CE-EXT-VALUE-1
           ELSE
               ADD DE7-EXT-CE-AMT  TO  S-CALC-INV-AMT
               MOVE DE7-EXT-CE-AMT   TO  CE-EXT-VALUE-1.

           IF DE7-CPW = ZEROS
               NEXT SENTENCE
           ELSE
           IF DE7-CPW-SIGN = "-"
               MULTIPLY  -1  BY  DE7-CPW  GIVING  S-NEG-VALUE
               MOVE S-NEG-VALUE  TO  CE-EXT-VALUE-1
               ADD S-NEG-VALUE   TO  S-CALC-INV-AMT
           ELSE
               MOVE DE7-CPW    TO  CE-EXT-VALUE-1
               ADD DE7-CPW     TO  S-CALC-INV-AMT.

           MOVE S-CALC-INV-AMT    TO  DE7-NET-DUE-VENDOR.

       671-CALC-VALUES-X.
           EXIT.

       6711-CHECK-PAYMENT-TERMS.
           MOVE SPACES         TO  TERMS-OK-SW.
           IF INV-DUE-PCT NOT = "1"
               NEXT SENTENCE
           ELSE
               GO TO 6711-CPT-X.

       6711-GETFORM.
           MOVE INVDEDUCTA  TO  VIEW-NFNAME.

       6711-DISPLAY-TERM-ERROR.
           MOVE 46  TO  FIELD-NUMBER.
      *YOU MUST ENTER A PAYMENT TERM OF 'NET' WHEN A DISC AMT WAS ENTERED *
           MOVE  25 TO LANG-SETNUM.
           MOVE   5 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE7-MSG-LINE.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).

       6711-SHOWFORM7A.
           MOVE DE-BUFFER7     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER7.
           IF VIEW-LASTKEY = 2
               PERFORM 631-DISPLAY-PAYMENT-TERMS  THRU  631-DPT-X
               GO TO 6711-GETFORM
           ELSE
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 3  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
               MOVE 46  TO  FIELD-NUMBER
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
               GO TO 6711-SHOWFORM7A.

           IF DE7-INV-ACCTG = SPACES
      *        ***  ACCOUNTING DATA FOR THE C/E IS REQUIRED  ***
               MOVE  66269 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(47)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CE3-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  6711-SHOWFORM7A.
           IF DE7-CE3-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(8)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CE4-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  6711-SHOWFORM7A.
           IF DE7-CE4-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(12)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CE5-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  6711-SHOWFORM7A.
           IF DE7-CE5-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(15)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CE9-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(35)
               GO TO  6711-SHOWFORM7A.
           IF DE7-CE9-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(35)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CPW-CODE NOT = SPACES
               IF DE7-CPW = ZEROS
      *        ***  CPW AMOUNT REQUIRED  ***
               MOVE  66270 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(38)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CPW-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(40)
               GO TO  6711-SHOWFORM7A.
           IF DE7-CPW-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(40)
               GO TO  6711-SHOWFORM7A.

           IF DE7-CPW > ZERO
               IF DE7-CPW-CODE = SPACES
      *        ***  CPW CODE REQUIRED  ***
               MOVE  66271 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(41)
               GO TO  6711-SHOWFORM7A.

           IF DE7-EXT-CE-AMT > ZERO
               IF DE7-EXT-CE = SPACES
      *        ***  EXTRA CE CODE REQUIRED  ***
               MOVE  66272 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(48)
               GO TO  6711-SHOWFORM7A.
           IF DE7-EXT-CE NOT = SPACES
               IF DE7-EXT-CE-AMT = ZEROS
      *        ***  EXTRA CE AMOUNT REQUIRED ***
               MOVE  66273 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(49)
               GO TO  6711-SHOWFORM7A.
           IF DE7-EXT-CE-SIGN = SPACES
      *        ***  VALID SIGN CHARACTER '+' OR '-' IS REQUIRED ***
               MOVE  66258 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(51)
               GO TO  6711-SHOWFORM7A.
           IF DE7-EXT-CE-SIGN = "+" OR "-"
               NEXT SENTENCE
           ELSE
      *        ***  VALID SIGN CHARACTERS ARE '+' OR '-' ***
               MOVE  66259 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(51)
               GO TO  6711-SHOWFORM7A.
           IF DE7-EXT-CE-AMT > ZERO
               IF DE7-EXT-CE-ACCTG = SPACES
      *       *** EXTRA CE ACCOUNTING DATA REQUIRED ***
                   MOVE  66274 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
                   MOVE B"1" TO IND(99), IND(52)
                   GO TO  6711-SHOWFORM7A
               ELSE
                   MOVE 1        TO  INDX
                   PERFORM UNTIL INDX > 9 OR CALC-ERROR-SW = "Y"
                   IF DE7-EXT-CE-ACCTG-BYTE (INDX)  = SPACES
      *       ***  GENERAL LEDGER ACCOUNTING DATA IS 9 DIGITS ***      ERIA ***
                       MOVE 66256 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE3-MSG-LINE
                       MOVE B"1" TO IND(99), IND(52)
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
                   END-PERFORM
                   IF CALC-ERROR-SW = "Y"
                       MOVE SPACES TO CALC-ERROR-SW
                       GO TO  6711-SHOWFORM7A.

           IF DE7-CE9-CASHD  NOT = ZEROS
               IF DE7-TERMS-DUE-PCT  NOT = "1"
                   GO TO 6711-DISPLAY-TERM-ERROR
               ELSE
                   MOVE DE7-TERMS  TO  INV-TERMS
                   PERFORM 632-CALC-DUE-DATE  THRU
                           632-CALC-DUE-DATE-X
                   MOVE "Y"        TO  TERMS-OK-SW
           ELSE
               MOVE SPACES         TO  DE7-TERMS
               MOVE "Y"            TO  TERMS-OK-SW.

      *************************************
      *                                   *
      *   EDIT PAYMENT TERMS              *
      *                                   *
      *************************************

           IF DE7-TERMS = SPACES
               GO TO 6711-GET-PRIOR-FORM.
           MOVE 46                      TO  FIELD-NUMBER.
           MOVE DE7-TERMS-DUE-PCT       TO  BUILD-TM-DISCOUNT-VALUE.
           MOVE DE7-TERMS-DUE-DATE      TO  BUILD-TM-DATE-VALUE.
           PERFORM 631-EDIT-PAYMENT-TERMS  THRU  631-EPT-X.
           IF ERR-SW = "Y"
               MOVE MESSAGE-BUFFER TO DE7-MSG-LINE
               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
               GO TO 6711-SHOWFORM7A.

       6711-GET-PRIOR-FORM.
           MOVE INVDEDUCT  TO  VIEW-NFNAME.
           MOVE DE-BUFFER7     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           IF TERMS-OK-SW = "Y"
               NEXT SENTENCE
           ELSE
               MOVE "Y"  TO  CALC-ERROR-SW.

       6711-CPT-X.
           EXIT.

       681-CHECK-CE-ACCTG.
           IF BUILD-CE-SB = SPACES
               MOVE PO-SUB    TO  BUILD-CE-SB.

       681-CCA-X.
           EXIT.


       681-CALC-VALUES.
           PERFORM 6811-EDIT-ATAX  THRU  6811-EA-X
               VARYING SUB1  FROM 1 BY 1
                   UNTIL SUB1 > 4.
           IF CALC-ERROR-SW = "Y"
               GO TO 681-CALC-VALUES-X.

           SUBTRACT CE9-CASH-DSCNT  FROM  S-CALC-INV-AMT.
           SUBTRACT INV-ADD-CTNRS       FROM  S-CALC-INV-AMT.
           IF DE7-CPW NOT = ZEROS
               SUBTRACT CE-EXT-VALUE-1  FROM  S-CALC-INV-AMT.
           ADD S-CALC-FRT-CHARGES   TO  S-CALC-INV-AMT.
           MOVE S-CALC-FRT-CHARGES  TO  INV-TOTAL-CFRT.

           IF DE8-OTHER-SIGN = "-"
               MULTIPLY -1 BY DE8-OTHER GIVING S-NEG-VALUE
               MOVE S-NEG-VALUE  TO  INV-ADJ-OTHER
               ADD S-NEG-VALUE   TO  S-CALC-INV-AMT
           ELSE
               MOVE DE8-OTHER  TO  INV-ADJ-OTHER
               ADD DE8-OTHER   TO  S-CALC-INV-AMT.

           IF CALC-TAX-FRT-SW = "Y"
                PERFORM 6811-CALC-TAX-ON-FRT  THRU  6811-CTOF-X.

           PERFORM 6811-ADD-ATAX  THRU  6811-AT-X
               VARYING SUB1  FROM  1  BY  1
                   UNTIL SUB1 > 4.

           MOVE S-CALC-INV-AMT  TO  DE8-DIST-COST.

       681-CALC-VALUES-X.
           EXIT.

       681-GET-ACCRUED-TAX.
           MOVE TAX-DISTRICT (SUB1)       TO  DE8-ATAX-DESC (SUB1).
           MOVE TAX-DISTRICT-CE-ACCTG (SUB1)
                                          TO  DE8-ATAX-CE-ACCTG (SUB1).
           IF DE5-PAY-FLAG = "P"
      *******  MOVE PO-ACCRUE-TAX-CHRG (SUB1)
      *******                             TO  DE8-ACCRUED-TAX (SUB1)
               COMPUTE DE8-ACCRUED-TAX (SUB1) ROUNDED
                                          = PO-ACCRUE-TAX-CHRG (SUB1)
               IF PO-ACCRUE-TAX-CHRG (SUB1) < ZEROS
                   MOVE "-"               TO  DE8-ATAX-SIGN (SUB1)
               ELSE
                   MOVE "+"               TO  DE8-ATAX-SIGN (SUB1).
9211CK*    ELSE
           IF DE5-PAY-FLAG = "I"
      *******  MOVE INV-ACCRUE-TAX-CHRG (SUB1)
      *******                             TO  DE8-ACCRUED-TAX (SUB1)
               COMPUTE DE8-ACCRUED-TAX (SUB1)
                                          = INV-ACCRUE-TAX-CHRG (SUB1)
               IF INV-ACCRUE-TAX-CHRG (SUB1) < ZEROS
                   MOVE "-"               TO  DE8-ATAX-SIGN (SUB1)
               ELSE
                   MOVE "+"               TO  DE8-ATAX-SIGN (SUB1).

9302CK     MOVE INV-DUE-PCT TO BUILD-TM-DISCOUNT-VALUE.
  .        MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
  .        MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
  .        READ MPLTINFO-PK-I INTO BUF-MPLTINFO
  .            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
  .        IF FILE-STATUS NOT = "00"
  .            MOVE "READ MPLTINFO1 * 681-GAT" TO BU-DISPLAY-MSG
  .            MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
  .            GO TO 2100-BLOWUP
  .        ELSE
9302CK         MOVE MPLTINFO-DISC-AMNT      TO S-DISCOUNT-AMT.

9211CK     IF S-DISCOUNT-TAX-SW = "Y"
9405CK         COMPUTE DE8-ACCRUED-TAX (SUB1) ROUNDED =
9211CK            DE8-ACCRUED-TAX (SUB1) -
9211CK           (DE8-ACCRUED-TAX (SUB1) * S-DISCOUNT-AMT).


       681-GAT-X.
           EXIT.

       681-UPDATE-ACCRUED-TAX.
           IF DE8-ACCRUED-TAX (SUB1) = ZEROS
               NEXT SENTENCE
           ELSE
               MOVE DE8-ATAX-CE-ACCTG (SUB1)
                                          TO  INV-ATAX-ACCTG (SUB1)
               IF DE8-ATAX-SIGN (SUB1) = "-"
                   MULTIPLY -1 BY DE8-ACCRUED-TAX (SUB1)
                           GIVING INV-ATAX-AMT (SUB1)
               ELSE
                   MOVE DE8-ACCRUED-TAX (SUB1)
                                          TO  INV-ATAX-AMT (SUB1).

       681-UAT-X.
           EXIT.

       6811-EDIT-ATAX.
           IF SUB1 = 1
               MOVE 12      TO  FIELD-NUMBER
           ELSE
           IF SUB1 = 2
               MOVE 28      TO  FIELD-NUMBER
           ELSE
           IF SUB1 = 3
               MOVE 33      TO  FIELD-NUMBER
           ELSE
           IF SUB1 = 4
               MOVE 38      TO  FIELD-NUMBER.

           IF DE8-ATAX-DESC (SUB1) = SPACES
               IF DE8-ACCRUED-TAX (SUB1) NOT = ZEROS
      *            *** CAN'T ENTER ACCRUED TAX; NO TAX DISTRICT EXISTS ***
                   MOVE   3 TO LANG-SETNUM
                   MOVE  30 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   MOVE "Y"  TO  CALC-ERROR-SW.

           IF DE3-INV-CE = "2" OR "Z"
               NEXT SENTENCE
           ELSE
               IF DE8-ATAX-SIGN (SUB1) = "-"
      *   *** ACCRUED TAX CANNOT BE NEGATIVE UNLESS THIS IS A CREDIT INVOICE ***
                   MOVE   1 TO LANG-SETNUM
                   MOVE   3 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE8-MSG-LINE
                   MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                   MOVE "Y"  TO  CALC-ERROR-SW.

       6811-EA-X.
           EXIT.

       6811-ADD-ATAX.
           IF DE8-ATAX-SIGN (SUB1) = "-"
               MULTIPLY -1 BY DE8-ACCRUED-TAX (SUB1)
                   GIVING S-NEG-VALUE
               ADD S-NEG-VALUE  TO  S-CALC-INV-AMT
           ELSE
               ADD DE8-ACCRUED-TAX (SUB1)  TO  S-CALC-INV-AMT.

       6811-AT-X.
           EXIT.

       6811-CALC-TAX-ON-FRT.
           ADD INV-ADD-VFRT, CE3-FRT, S-CALC-FRT-CHARGES
               GIVING TOTAL-FRT-CHRGS.
           MOVE INV-TAX-CODE     TO  TAX-ARG.
           MOVE TAX-ARG TO TAXCDE OF MTAX-I-REC.
           READ MTAX-I INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MTAX * 6811-CTOF" TO BU-DISPLAY-MSG
               MOVE TAX-ARG          TO BU-DISPLAY-FLD (4)
               GO TO 2100-BLOWUP.

           MOVE ZEROS   TO  SUB1.

       6811-CALC-TAX-FRT-LOOP.
           ADD 1  TO  SUB1.
           IF SUB1 > 4
               GO TO 6811-CTOF-X.
           IF MTAX-PAY-INDIC (SUB1) = "A"
               NEXT SENTENCE
           ELSE
               GO TO 6811-CALC-TAX-FRT-LOOP.
           IF DE8-ATAX-SIGN (SUB1) = "-"
               MULTIPLY -1 BY DE8-ACCRUED-TAX (SUB1)
                   GIVING CALC-TOTAL-FRT-TAX
           ELSE
               MOVE DE8-ACCRUED-TAX (SUB1)  TO  CALC-TOTAL-FRT-TAX.

           COMPUTE CALC-TAX-PERCENT ROUNDED =
                MTAX-PERCENT (SUB1) / 100.

           COMPUTE CALC-FRT-TAX ROUNDED = CALC-TAX-PERCENT
                                          * TOTAL-FRT-CHRGS.
           ADD CALC-FRT-TAX  TO  CALC-TOTAL-FRT-TAX.
           MOVE CALC-TOTAL-FRT-TAX    TO  DE8-ACCRUED-TAX (SUB1).
           IF CALC-TOTAL-FRT-TAX < 0
               MOVE "-"               TO  DE8-ATAX-SIGN (SUB1)
           ELSE
               MOVE "+"               TO  DE8-ATAX-SIGN (SUB1).
           GO TO 6811-CALC-TAX-FRT-LOOP.

       6811-CTOF-X.
           EXIT.

       682-LOAD-GDYR-PAID-FRT.
           MOVE SPACE                   TO  DE-BUFFER8A.
           MOVE B-PO-NO                 TO  DE8A-PO.
           MOVE B-PO-RLSE               TO  DE8A-RLSE.
           MOVE DE3-INV-NUM             TO  DE8A-INV-NUM.
           MOVE S-NEW-REGNUM            TO  DE8A-REG-NUM.
           MOVE ZEROS                   TO  DE8A-FRT-AMOUNT (1),
                                            DE8A-FRT-AMOUNT (2),
                                            DE8A-FRT-AMOUNT (3),
                                            DE8A-FRT-AMOUNT (4),
                                            DE8A-FRT-AMOUNT (5),
                                            DE8A-FRT-AMOUNT (6),
                                            DE8A-FRT-AMOUNT (7),
                                            DE8A-FRT-AMOUNT (8),
                                            DE8A-FRT-AMOUNT (9),
                                            DE8A-FRT-AMOUNT (10).
           PERFORM 6821-LOAD-PLUS-SIGN  THRU  6821-LPS-X
               VARYING FRT-SUB  FROM 1 BY 1
                 UNTIL FRT-SUB > 10.
           MOVE ZERO                    TO  FRT-SUB.
           MOVE PO-ARG                  TO  ALTER-PO-ARG.
           IF A-REL = 999
               GO TO 682-LGPF-X.
           IF M-PO-RCV-STAT = SPACES
               GO TO 682-LGPF-X
           ELSE
               ADD 1  TO  M-PO-LAST-RCVR
               MOVE M-PO-LAST-RCVR  TO  A-RS.

       682-DPOFREIGHT-LOOP.
           SUBTRACT 1         FROM  A-RS.
           IF A-RS = ZEROS
               GO TO  682-UNLOCK-DPOFREIGHT.

           MOVE ALTER-PO-ARG TO PORCVNO OF DPOFREIGHT-O-REC.
           READ DPOFREIGHT-O INTO BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               GO TO  682-DPOFREIGHT-LOOP
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPOFREIGHT*682-GPF"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           IF FRT-TYPE = "C"  OR  "G"
               IF FRT-PAID-FLAG = SPACES
                   IF FRT-REFERBACK = SPACE
                       NEXT SENTENCE
                   ELSE
                       GO TO 682-DPOFREIGHT-LOOP
               ELSE
                   GO TO 682-DPOFREIGHT-LOOP
           ELSE
               GO TO  682-DPOFREIGHT-LOOP.

       682-FRT-CONT.
           ADD +1                  TO  FRT-SUB.
           MOVE FRT-PO-RS          TO  DE8A-RECEIVING-SLIP (FRT-SUB).
           MOVE FRT-CARRIER        TO  DE8A-CARRIER-CODE (FRT-SUB).
           MOVE FRT-BILL-NO        TO  DE8A-PRO-NUMBER (FRT-SUB).
           MOVE FRT-RAIL-CAR       TO  DE8A-CAR-NO (FRT-SUB).
           MOVE FRT-CHARGES-9      TO  DE8A-FRT-AMOUNT (FRT-SUB).

           IF FRT-SUB > 8
               NEXT SENTENCE
           ELSE
               GO TO  682-DPOFREIGHT-LOOP.

       682-UNLOCK-DPOFREIGHT.
           MOVE HIGH-VALUES TO PORCVNO OF DPOFREIGHT-O-REC.
           START DPOFREIGHT-O KEY > PORCVNO OF DPOFREIGHT-O-REC
              INVALID KEY MOVE "00" TO FILE-STATUS.

       682-LGPF-X.
           EXIT.


       682-SELECT-PAID-FREIGHT.
           SUBTRACT S-CALC-FRT-CHARGES  FROM  S-CALC-INV-AMT.
           MOVE ZEROS                   TO    S-CALC-FRT-CHARGES.

           MOVE INVGPF  TO  VIEW-NFNAME.

       682-SHOWFORM8A.
           MOVE DE-BUFFER8A    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER8A.

           IF VIEW-LASTKEY = 2
               MOVE 69  TO  FIELD-NUMBER
               MOVE SPACE  TO  MESSAGE-BUFFER
               GO TO  682-SHOWFORM8A
           ELSE
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 3  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
               MOVE 5  TO  FIELD-NUMBER
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE8A-MSG-LINE
               MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
               GO TO  682-SHOWFORM8A.

           MOVE 1        TO  INDX.
           PERFORM UNTIL INDX > 10 OR CALC-ERROR-SW = "Y"
                   IF DE8A-SELECT-FRT (INDX) NOT = "X"
      *        ***  ENTER AN 'X' TO SELECT ****
                       MOVE  66275 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE8A-MSG-LINE
                       MOVE "Y"  TO CALC-ERROR-SW
                   END-IF
                   ADD 1 TO INDX
                   END-PERFORM
                   IF CALC-ERROR-SW = "Y"
                       IF INDX = 1
                           MOVE  5 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 2
                           MOVE  8 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 3
                           MOVE 11 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 4
                           MOVE 14 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 5
                           MOVE 17 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 6
                           MOVE 20 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 7
                           MOVE 48 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 8
                           MOVE 55 TO FIELD-NUMBER
                       ELSE
                       IF INDX = 9
                           MOVE 62 TO FIELD-NUMBER
                       ELSE
                           MOVE 69 TO FIELD-NUMBER
                       END-IF
                       MOVE SPACES TO CALC-ERROR-SW
                       MOVE B"1" TO IND(99), IND(FIELD-NUMBER)
                       GO TO  682-SHOWFORM8A.

               IF DE8A-SELECT-FRT (10) NOT = SPACES
                   IF DE8A-CARRIER-CODE (10) = SPACES
      *** ADDITIONAL FREIGHT DATA IS INCOMPLETE
                       MOVE  66357 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE8A-MSG-LINE
                       MOVE B"1" TO IND(99), IND(70)
                       GO TO 682-SHOWFORM8A
                   ELSE
                   IF DE8A-PRO-NUMBER (10) = SPACES
      *** ADDITIONAL FREIGHT DATA IS INCOMPLETE
                       MOVE  66357 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO DE8A-MSG-LINE
                       MOVE B"1" TO IND(99), IND(71)
                       GO TO 682-SHOWFORM8A.

       682-ADD-FRT-CHRGS.
           MOVE ZERO           TO  FRT-SUB.

       682-ADD-FRT-CHRGS-LOOP.
           ADD 1               TO  FRT-SUB.
           IF FRT-SUB > 10
               MOVE S-CALC-FRT-CHARGES   TO  DE8-TOTAL-GDYR-FRT
               MOVE S-CALC-INV-AMT       TO  DE8-DIST-COST
               GO TO 682-SPF-X.
           IF DE8A-SELECT-FRT (FRT-SUB) = "X"
               ADD DE8A-FRT-AMOUNT (FRT-SUB)  TO S-CALC-INV-AMT,
                                                 S-CALC-FRT-CHARGES.

           GO TO 682-ADD-FRT-CHRGS-LOOP.

       682-SPF-X.
           EXIT.

       682-UPDATE-PAID-FREIGHT.
           MOVE ZERO  TO  FRT-SUB.

       682-CHECK-FRT.
           ADD +1  TO  FRT-SUB.
           IF FRT-SUB > 9
               GO TO  682-CHECK-NEW-FRT.
           IF DE8A-SELECT-FRT (FRT-SUB) = "X"   AND
              DE8A-RECEIVING-SLIP (FRT-SUB) NOT = SPACES
               GO TO  682-UPDATE-DPOFREIGHT
           ELSE
               GO TO  682-CHECK-FRT.

       682-UPDATE-DPOFREIGHT.
           MOVE DE8A-RECEIVING-SLIP (FRT-SUB) TO A-RS.
           MOVE ALTER-PO-ARG            TO PORCVNO OF DPOFREIGHT-O-REC.
           READ DPOFREIGHT-O INTO BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPOFREIGHT*682-UD"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           MOVE "Y"                        TO  FRT-PAID-FLAG.
           MOVE DE8A-FRT-AMOUNT (FRT-SUB)  TO  FRT-CHARGES-9.
           MOVE S-NEW-REGNUM               TO  FRT-REG-NO.

           REWRITE DPOFREIGHT-O-REC FROM BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT DPOFREIGHT1*682-UD"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       682-DDAILYTC-351-353.
           MOVE SPACES                  TO  BUF-DDAILYTC.
           ACCEPT DDAILYTC-DATE FROM DATE.
           ACCEPT DDAILYTC-TIME FROM TIME.
           MOVE "351"                   TO  DDAILYTC-TC.
           MOVE SAVE-COMPANY            TO  DDAILYTC-PLT.
           MOVE FRT-PO-RCV-NO           TO  TC350-RS.
           MOVE FRT-CARRIER             TO  TC350-CARRIER.
           MOVE FRT-BILL-NO             TO  TC350-PRO-NUMBER.
           MOVE FRT-BILL-DATE           TO  TC350-PRO-DATE.
           MOVE FRT-PACK-SLIP           TO  TC350-PACK-SLIP.
           MOVE FRT-CHARGES-9           TO  TC350-CHARGES.

           WRITE DDAILYTC-O-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DDAILYTC-351*62"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           MOVE "353"                   TO  DDAILYTC-TC.
           MOVE SPACES                  TO  DDAILYTC-DATA.
           MOVE FRT-PO-RCV-NO           TO  TC352-RS.
           MOVE FRT-ZBILL               TO  TC352-ZBILL.
           MOVE FRT-SPLC                TO  TC352-SPLC.
           IF FRT-CARRIER-WT = ZERO
               MOVE FRT-OUR-WT          TO  TC352-WEIGHT
           ELSE
               MOVE FRT-CARRIER-WT      TO  TC352-WEIGHT.
           MOVE FRT-RAIL-CAR            TO  TC352-CAR.
           MOVE FRT-TYPE                TO  TC352-TYPE.
           WRITE DDAILYTC-O-REC FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DDAILYTC-353*62"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

           GO TO  682-CHECK-FRT.

       682-CHECK-NEW-FRT.
           IF DE8A-SELECT-FRT (FRT-SUB) = "X"
               NEXT SENTENCE
           ELSE
               GO TO  682-UPF-X.

           MOVE SPACE                   TO  BUF-DPOFREIGHT.
           MOVE PO-ARG                  TO  FRT-PO-RCV-NO.
           MOVE "C"                     TO  FRT-TYPE.
           MOVE "Y"                     TO  FRT-PAID-FLAG.
           MOVE DE8A-CARRIER-CODE (FRT-SUB)  TO  FRT-CARRIER.
           MOVE DE8A-PRO-NUMBER (FRT-SUB)    TO  FRT-BILL-NO.
           MOVE DE8A-FRT-AMOUNT (FRT-SUB)    TO  FRT-CHARGES-9.
           MOVE S-NEW-REGNUM            TO  FRT-REG-NO.
           MOVE ZEROS                   TO  FRT-CARRIER-WT,
                                            FRT-OUR-WT.
           WRITE DPOFREIGHT-O-REC FROM BUF-DPOFREIGHT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DPOFREIGHT2*682-CNF"  TO  BU-DISPLAY-MSG
               GO TO  2100-BLOWUP.

       682-UPF-X.
           EXIT.


       6821-LOAD-PLUS-SIGN.
           MOVE "+"  TO  DE8A-FRT-AMT-SIGN (FRT-SUB).
           MOVE ZEROS  TO  FRT-ADDR (FRT-SUB).

       6821-LPS-X.
           EXIT.


       998-WRITE-SCREEN.
           WRITE DISPLAY-REC  FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

       998-READ-SCREEN.
           READ  DISPLAY-FILE FORMAT IS VIEW-NFNAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.

      *------ A BAD STATUS MAY MEAN USER TURNED OFF TERMINAL.
      *------ IF SO, SIMULATE THE F3 KEY TO EXIT PROGRAM.
           IF DISPLAY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
               MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

