000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TINVVAL.
000400 AUTHOR.              KURT MOVSESIAN.
000500 DATE-WRITTEN.        MAR 4,1981.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*REMARKS.             INVENTORY VALUATION PROGRAM.
000900*
001000*    *********************************************************
001100*    **                                                     **
001200*    **                  APRIL 19, 1982                     **
001300*    **  ALL THE PLANTS VERSION (RATHER THAN JUST AKRON)    **
001400*    **                                                     **
001500*    *********************************************************
001600*
001700*    ON MARCH 3, 1982, THIS PROGRAM WAS SPLIT INTO 2 VERSIONS -
001800*    ONE FOR AKRON & ONE FOR THE PLANTS.  THE AKRON VERSION
001900*    ALLOWS THE USER TO CHOOSE BETWEEN SEEING ALL ITEMS, RAW
002000*    MATERIALS ONLY, OR ALL ITEMS EXCEPT RAW MATERIALS.  IT
002100*    ALSO WILL ALLOW THE USER TO OMIT ANY ITEMS WITH 0 ONHAND
002200*    IF HE WISHES.     CIH.
002300*
002400*    ON APRIL 19, 1982, SEVERAL CHANGES WERE MADE.  THE PRIMARY
002500*    BIN LOCATION WAS ADDED TO THE REPORT.  IN ORDER TO ADD
002600*    THIS FIELD, THE CORP CODE DESCRIPTION WAS DECREASED IN SIZE
002700*    FROM 77 TO 60 IN LENGTH.  ALSO, A CORRECTION WAS MADE TO
002800*    THE LOGIC WHEN A USER DEPRESSES THE "f8" KEY WITHOUT COM-
002900*    PLETING ANY PROCESSING.  PREVIOUSLY, THIS ACTION WOULD PRINT
003000*    AN ERROR MESSAGE TO PAPER AS WELL AS TO THE CONSOLE.  LMB.
003100*
003200*    ALSO, ON APRIL 19, 1982, AN INTRISIC "COMMAND" STATEMENT WAS
003300*    ADDED.  THIS DISALLOWS THE USER TO KICK OFF SEVERAL "R11"
003400*    REPORTS IN A ROW (WHICH CAUSED PROBLEMS SINCE EACH STREAM
003500*    CONTAINED A PURGE OF THE FILE STATEMENT NEEDED FROM
003600*    THE MODES PROGRAM.)  THIS STOPS THE PROBLEM OF SEVERAL PARTIAL
003700*    REPORTS.  LMB.
003800*
003900*    IN MAY, 1982, THE FOLLOWING CHANGES WERE MADE:
004000*       1.  THE USER MAY NOW SPECIFY IN THE PRE-PROCESSING PGM
004100*           WHAT SORT KEY HE WANTS.  THESE INCLUDE SORTING BY
004200*           CORPORATE CODE WITHIN CLASS, CORPORATE CODE, KEYWORD/
004300*           ADJECTIVE, OR PRIMARY BIN LOCATION.
004400*
004500*       2.  THE USER MAY NOW ASK FOR A PRINTOUT WITH INVENTORY
004600*           VALUES, OR HE MAY SPECIFY THE REPORT BE AN INV.
004700*           WORKSHEET, WITH DOTTED LINES TO FILL IN INV. VALUES.
004800*           CIH.
004900*
005000*    ON SEPT 26, 1983, CHANGED THE "INVENTORY WORKSHEET" OPTION
005100*    TO PRINT ALL LOCATIONS FOR EACH CODE.  CIH.
005200*
005300*    ON NOV 7, 1983, ADDED A MULTIPLE LINES OF DESCRIPTION
005400*    CAPABILITY TO THE PROGRAM.  THE USER HAS THE CHOICE OF
005500*    MULTIPLE LINES OR ONLY A SINGLE LINE IN THE PRE-PROCESSING
005600*    PROGRAM.  CIH.
005700*
005800*    ON OCT. 25, 1984, ADDED A "MATERIAL OPTION" TO SELECT ONLY
005900*    THOSE ITEMS ON A BLANKET ORDER.  WHILE MAKING THIS CHANGE,
006000*    ALSO PUT IN THE NEW METHOD OF COMMUNICATION BETWEEN THE
006100*    ON-LINE OPTION PROGRAM AND THE BATCH REPORT PROGRAM.
006200*    THIS NEW METHOD HAS THE OPTION PROGRAM CREATING THE JOB
006300*    STREAM INTERACTIVELY AS A TEMPORY FILE, AND THEN STREAMING
006400*    THE JOB USING THE COMMAND INTRINSIC.  THE REPORT PROGRAM
006500*    WILL THEN "ACCEPT" THE OPTION DATA, WHICH IS PUT INTO THE
006600*    JOB STREAM BY THE OPTION PROGRAM.  CIH.
006700*
006800*    ON NOVEMBER 8, 1984, CHANGED THIS REPORT TO USE
006900*    A RANGE OF VALUES ON SELECTION OPTIONS RATHER THAN
007000*    SELECT BY ENTERING UP TO 5 INDIVIDUAL VALUES.  FOR
007100*    EXAMPLE, IN THE OLD VERSION THE USER COULD SELECT UP
007200*    TO 5 ACCOUNTING CLASSES TO APPEAR ON THE REPORT.  NOW,
007300*    THE USER CAN SELECT A RANGE OF ACCOUNTING CLASSES TO
007400*    APPEAR ON THE REPORT.  ALSO, A SELECTION OPTION ON
007500*    KEYWORD ADJECTIVE AND ON MAJOR BIN LOCATION WAS ADDED.
007600*    CIH.
007700*
007800*    ON NOVEMBER 12, 1984, ADD A NEW OPTION FIELD TO ALLOW THE
007900*    USER TO SELECT THE VALUATION USING MARKET COST INSTEAD OF
008000*    AVERAGE COST. IF HE PUTS AN 'X' IN THE FIELD USE THE
008100*    MARKET COST, ELSE USE AVERAGE COST.
008200*    CAK.
008300*
008400*    ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
008500*    MAY 17, 1985.   V.W.D.
008600*
008700*    ON JANUARY 31,1987 THE FOLLOWING HAS BEEN CHANGED OR ADDED:
008800*      1. THE REPORT OPTIONS WILL NOW BE COBOL "ACCEPT"ED FROM
008900*         PROGRAM "TRSCREEN" RATHER THAN READ IN FROM A FILE
009000*         THAT WAS CREATED BY THE PRE-PROCESSING PROGRAM
009100*         "TR11MODE". TR11MODE IS NO LONGER IN USE.
009200*      2. ADDED HEADER PAGE TO THE REPORT USING SUBPROGRAM
009300*         THDPRT2.
009400*      3. A CALL TO SUBPROGRAM "CDESC" TO GET FULL DESCRIPTION
009500*         IF REQUESTED.
009600*      4. ADDED COPYLIB, AS NEEDED, FOR ALL DATA SET BUFFER DESC.
009700*      5. REPLACED CALLS TO DBEXPLAIN WITH CALL TO "TBLOWUP"
009800*      6. CHANGED COPY STATEMENTS TO "IN COPYLIB".
009900*      7. ADDED NON-HP LOGIC.
010000*      8. PRINT COMPRESSION FEATURE.
010100*      9. ADDED REPORT TO DRPTDEF.PUB       C.J.R.
010200*
010300*
      *    IN MARCH 1994 OPTIONS TO RETRIEVE, SORT AND PRINT BY
      *      MANUFACTURER AND DEFAULT DEPARTMENT WERE ADDED PER
      *      REQUEST 6478 AND/OR PROGRAMMING REQUEST 94-003
      *
      *
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  17NOV1995    DAVE PLUM
      *C   N O T E: THERE HAVE BEEN NUMEROUS CHANGES MADE TO THIS
      *C            PROGRAM BETWEEN 23 JUNE 1994 AND 17 NOVEMBER 1995
      *C            WHICH ARE NOT DOCUMENTED HERE FOR SOME REASON.
      *C   ATTEMPTED TO CORRECT A PROBLEM WITH REPORTS USING SORT
      *C   OPTION = "7" (DEFAULT DEPT).  THESE REPORTS WERE PRINTING
      *C   SUBTOTAL LINES READING "TOTAL ITEMS FOR CLASS ...".
      *C   REVISED PARAGRAPH 833-BOTTOM-LINE TO CHECK FOR SORT OPTION
      *C   "7" INSTEAD OF MATERIAL OPTION "7" WHEN IT DETERMINES HOW
      *C   THE THESE SUBTOTAL LINES SHOULD READ.
      *C
      *C  09/12/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C  08/04/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C
      *C  06/05/98     JE COFFMAN
      *C    ADDED LOGIC TO REMOVE FRANCHISED INVENTORIES FROM THE
      *C    ONHAND QUANTITIES AS THESE INVENTORIES ARE NOT REALLY
      *C    GOODYEAR'S UNTIL THEY ARE WITHDRAWN FROM THE STOREROOM.
      *C
      *C  09JUL1998   DAVE PLUM
      *C    RECOMPILED TO PICK UP CHANGES IN COPYLIB MEMBER MTLSINPT.
      *C    THESE COPYLIB CHANGES DEAL WITH NON-GOODYEAR OWNED MATERIALS
      *C    IN THE STOREROOM (ISC OWNED MATERIALS IN DANVILLE FOR EXAMPLE).
      *C
010400 ENVIRONMENT DIVISION.
010500 CONFIGURATION SECTION.
010600 SOURCE-COMPUTER.  HP-3000.
010700 OBJECT-COMPUTER.  HP-3000.
010800 SPECIAL-NAMES. C01 IS NEW-PAGE.
011000
011100 INPUT-OUTPUT SECTION.
011200 FILE-CONTROL.
011300     SELECT ONLINE-PRT    ASSIGN TO PRINTER-MCPRT.
011400     SELECT SORT-FILE     ASSIGN TO DISK-SORT.
011500
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

011600 DATA DIVISION.
011700 FILE SECTION.
011800
011900 FD  ONLINE-PRT
012000     LABEL RECORDS ARE OMITTED
012100     RECORD CONTAINS 132 CHARACTERS
012200     DATA RECORD IS PRINT-RCD.
012300 01  PRINT-RCD.
012400     05  PRINT-LINE             PIC X(132).
012500
       COPY MTLSSORT IN COPYLIB.

012600*SD  SORT-FILE
012700*    RECORD CONTAINS 170 CHARACTERS.
012800*01  SORT-RCD.
012900*    05  SORT-DETAIL.
013000*        10  SORT-CODE          PIC X(8).
013100*        10  SORT-CLASS         PIC X(4).
013200*        10  SORT-UM            PIC XX.
013300*        10  SORT-ONHAND        PIC S9(8).
013400*        10  SORT-AVG-COST      PIC S9(11)V9(4).
013500*        10  SORT-PRIM-LOC      PIC X(12).
013600*        10  SORT-DESC          PIC X(80).
      *        10  SORT-STR           PIC X(2).
      *        10  SORT-MANUFACTURER  PIC X(26).
      *        10  SORT-DFLT-DEPT     PIC X(6).
      *        10  FILLER             PIC X(7).
013700
       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

013800 WORKING-STORAGE SECTION.
013900
014000 77  PROTECT                    PIC X(20)  VALUE SPACES.
014100 77  WS-ITEM-VALUE              PIC S9(14)V9(4) VALUE ZEROS.
014200 77  WS-GRAND-TOT               PIC S9(14)V9(4) VALUE ZEROS.
014300 77  INVENT-GRAND-TOT           PIC 9(14)V9(4)  VALUE ZEROS.
014400 77  TOTAL-ITEMS-CLASS          PIC 9(5)   VALUE 0.
014500 77  TOTAL-ITEMS                PIC 9(5)   VALUE 0.
014600 77  CLASS-PAGE                 PIC XXXX   VALUE ZEROS.
       77  DEPT-PAGE                  PIC X(6)   VALUE ZEROS.
       77  STR-PAGE                   PIC X(2)   VALUE ZEROS.
014700 77  FILE-IS-RETURNED           PIC X      VALUE "N".
014800 77  QUAL-CNT                   PIC 9(6)   VALUE 0.
       77  PAGE-K                     PIC 9(3)  VALUE 0  COMP-4.
9406CK 01  SCOPE   PIC X.
014900
015000******ARGUMENT VALUES******
015100
015200 77  ITMS-PER-PAGE              PIC 99     VALUE ZEROS.
015300*77  PG-CTR                     PIC 999    VALUE ZEROS.
015400
015500 77  SUB                        PIC S9(4)   COMP-4.
       77  SUB1                       PIC S9(4)   COMP-4.
015600
       01  SWITCH-AREA.
           05  END-OF-INPUT-FILE               PIC X VALUE "N".
               88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
           05  END-OF-SORT-FILE                PIC X VALUE "N".
               88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
           05  BLOWUP-SWITCH                   PIC X VALUE "N".
015700**************************************************************
015800**                                                          **
015900**              A C C E P T    F I E L D S                  **
016000**
016100**************************************************************
016200
016300*01  ROUTE-LINE               PIC X(80)  VALUE SPACES.
017500
017600**************************************************************
017700**                                                          **
017800**             D A T E / T I M E   A R E A S                **
017900**                                                          **
018000**************************************************************
018100
018200 01  CODE-ARG.
018300     05  CODE-ARG-1-2           PIC X(2).
018400     05  FILLER                 PIC X(6).
018500
018600 COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.
018700
018800**************************************************************
018900**                                                          **
019000**         E R R O R   M E S S A G E   A R E A S            **
019100**                                                          **
019200**************************************************************
019300
019400 COPY TBLOWUP IN COPYLIB.
019500 01  VIEW-COMAREA.
019600     05  FILLER                 PIC X(118)  VALUE ALL "0".
019700     05  FILLER                 PIC S9(4)   COMP-4 VALUE 9999.
019800 01  KSAM-STATUS                PIC X(2)    VALUE SPACES.
019900
020000*************************************************************
020100**                                                         **
020200**            E S C A P E   S E Q U E N C E S              **
020300**                                                         **
020400*************************************************************
020500
020600 COPY ESCNAM2 IN COPYLIB.
020700
020800 01  COMPRESS-PRINT             PIC X(8).
020900
021000 01  NORMAL-PRINT               PIC X(8).
021100
021400**************************************************************
021500**                                                          **
021600**  P A R M S   F O R   C A L L   T O   "T H D P R T 2"     **
021700**                                                          **
021800**************************************************************
021900
022000 COPY THDPRTA IN COPYLIB.
022100
022200**************************************************************
022300**                                                          **
022400**       C O M M U N I C A T I O N S   A R E A S            **
022500**                                                          **
022600**************************************************************
022700
022800 01  FATAL-ERROR-SW             PIC X(1)  VALUE "N".
022900
023000 COPY TCHKBLKT IN COPYLIB.
023100
023200 COPY CDESC IN COPYLIB.
023300
023400 01  RET-CODE                   PIC X(2)  VALUE SPACES.
023500
023600**************************************************************
023700**                                                          **
023800**           D A T A B A S E   W O R K                      **
023900**                                                          **
024000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
024100
024200 COPY DATAB IN COPYLIB.
024300
024400 01  DSET-NAMES.
024500     05  DSET-NAME              PIC X(16)  VALUE SPACES.
024600     05  DSET-STOREROOM         PIC X(16)  VALUE "MSTORERM;".
024700     05  DSET-DESC              PIC X(16)  VALUE "DDESC;".
024800     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-DMANPART          PIC X(16)  VALUE "DMANPART;".
024900
025000 01  ITEM-LISTINGS.
025100     05  ALL-ITEM-LIST          PIC XX     VALUE "@;".
025200     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
025300
025400 01  MPLTINFO-LIST.
025500     05  FILLER                 PIC X(13) VALUE "PLTINFO-DATA;".
025600
025700 01  PLT-ARG                    PIC X(4)  VALUE "P 01".
025800
025900**************************************************************
026000**                                                          **
026100**           D A T A B A S E   B U F F E R S                **
026200**                                                          **
026300**************************************************************
026400
026500 COPY MSTORERM IN COPYLIB.
026600
026700 01  BUF-DDESC.
026800     05  DESC-CORP-CODE         PIC X(8).
026900     05  DESC-ID-NUM            PIC XX.
027000     05  DESC-DATA              PIC X(80).
027100*        AN 00 ID
027200*           KWRD-ADJ OF 46
027300*           MFR DATA OF 50
027400*        AN 01 ID
027500*           FIRST 96 CHAR OF CATLG
027600
       COPY DMANPART IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

028100**************************************************************
028200**                                                          **
028300**       H E A D E R   &   D E T A I L   L I N E S          **
028400**                                                          **
028500**************************************************************
028600
       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.

028700 01  DOT-LINE.
028800     05 FILLER              PIC X(132) VALUE ALL "-".
028900
029000*01  REPORT-HEADER.
029100*    05  FILLER    PIC X(5)   VALUE "PAGE ".
029200*    05  PRT-OVER-PG PIC ZZ9  VALUE ZEROS.
029300*    05  FILLER    PIC X(3)   VALUE SPACES.
029400*    05  FILLER    PIC X(6)   VALUE "PLANT ".
029500*    05  PRT-PLT   PIC X(3)   VALUE SPACES.
029600*    05  FILLER    PIC X(25)  VALUE SPACES.
029700*    05  FILLER    PIC X(19) VALUE "I N V E N T O R Y  ".
029800*    05  VAL-HD    PIC X(17)  VALUE "V A L U A T I O N".
029900*    05  FILLER    PIC X(28)  VALUE SPACES.
030000*    05  FILLER    PIC X(5)   VALUE "DATE ".
030100*    05  PRT-DATE  PIC X(8) VALUE SPACES.
030200*    05  FILLER    PIC XX     VALUE SPACES.
030300*    05  PRT-TIME  PIC X(8).
030400*
030500*01  REQUIREMENT-HEADER.
030600*    05  FILLER    PIC X(41)  VALUE SPACES.
030700*    05  FILLER    PIC X(14)  VALUE "ITEMS ON A REQ".
030800*    05  FILLER    PIC X(14)  VALUE "UIREMENT ORDER".
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  PO-LOW    PIC X(7)   VALUE SPACES.
      *    05  PO-D      PIC X      VALUE SPACE.
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  PO-HIGH   PIC X(7)   VALUE SPACES.
030900*
      *01  DEPARTMENT-HEADER.
      *    05  FILLER    PIC X(41)  VALUE SPACES.
      *    05  FILLER    PIC X(14)  VALUE "ITEMS IN DEFAU".
      *    05  FILLER    PIC X(14)  VALUE "LT DEPARTMENTS".
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  DEPT-LOW  PIC X(6)   VALUE SPACES.
      *    05  DEPT-D    PIC X      VALUE SPACE.
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  DEPT-HIGH PIC X(6)   VALUE SPACES.
      *
      *01  MANUFACTURER-HEADER.
      *    05  FILLER    PIC X(41)  VALUE SPACES.
      *    05  FILLER    PIC X(14)  VALUE "ITEMS FOR MANU".
      *    05  FILLER    PIC X(14)  VALUE "FACTURERS     ".
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  MAN-LOW   PIC X(26)  VALUE SPACES.
      *    05  MAN-D     PIC X      VALUE SPACE.
      *    05  FILLER    PIC XX     VALUE SPACES.
      *    05  MAN-HIGH  PIC X(26)  VALUE SPACES.

031000 01  INVENTORY-HDR-1.
031100     05  CLASS-HD     PIC X(6)  VALUE "CLASS ".
031200     05  CLASS-CODE-OUT   PIC XXXX  VALUE SPACES.
           05  FILLER       PIC X(84) VALUE SPACES.
           05  INV1-VAR-HDR.
               10  INV1-VH-LIT1 PIC X(19) VALUE SPACES.
               10  FILLER       PIC XX    VALUE SPACES.
               10  INV1-VH-LOW  PIC X(7)  VALUE SPACES.
               10  INV1-VH-LIT2 PIC X(3)  VALUE SPACES.
               10  INV1-VH-HIGH PIC X(7)  VALUE SPACES.
031300
031400 01  INVENTORY-HDR-2.
031500     05  FILLER          PIC X(4)   VALUE "CODE".
031600     05  FILLER          PIC X(4)   VALUE SPACES.
031700     05  FILLER          PIC X(11)  VALUE "DESCRIPTION".
031800     05  FILLER          PIC X(48)  VALUE SPACES.
031900     05  FILLER          PIC X(8)   VALUE "LOCATION".
032000     05  FILLER          PIC X(5)   VALUE SPACES.
032100     05  FILLER          PIC X(8)   VALUE "QUANTITY".
032200     05  FILLER          PIC X      VALUE SPACES.
032300     05  FILLER          PIC X(2)   VALUE "UM".
032400     05  FILLER          PIC X(10)  VALUE SPACES.
032500     05  PRT-COST-LIT    PIC X(12)  VALUE "AVG COST".
032600     05  FILLER          PIC X(8)   VALUE SPACES.
032700     05  FILLER          PIC X(10)  VALUE "TOTAL COST".
032800
032900 01  ITEM-DETAIL.
033000     05  CORP-CODE-OUT  PIC X(8).
033100     05  DESC-OUT       PIC X(58).
033200     05  FILLER         PIC X(1)   VALUE SPACES.
033300     05  PRIM-LOC-OUT   PIC X(12)  VALUE SPACES.
033400     05  QTY-OUT        PIC -(8)9.
033500     05  FILLER         PIC X      VALUE SPACES.
033600     05  UM-OUT         PIC XX.
033700     05  FILLER         PIC X      VALUE SPACES.
033800     05  AVG-COST-OUT   PIC Z(11)9.9(4)-.
033900     05  FILLER         PIC X      VALUE SPACES.
034000     05  TOT-COST-OUT   PIC Z(13)9.9(4)-.
034100
034200 01  INVENTORY-HDR-2A.
034300     05  FILLER          PIC X(4)   VALUE "CODE".
034400     05  FILLER          PIC X(6)   VALUE SPACES.
034500     05  FILLER          PIC X(8)   VALUE "LOCATION".
034600     05  FILLER          PIC X(8)   VALUE SPACES.
034700     05  FILLER          PIC X(8)   VALUE "QUANTITY".
034800     05  FILLER          PIC X(13)  VALUE SPACES.
034900     05  FILLER          PIC X(2)   VALUE "UM".
035000     05  FILLER          PIC X(5)   VALUE SPACES.
035100     05  FILLER          PIC X(11)  VALUE "DESCRIPTION".
035200     05  FILLER          PIC X(52)  VALUE SPACES.
035300
035400 01  ITEM-DETAIL-2.
035500     05  CORP-CODE-OUT2 PIC X(8).
035600     05  FILLER         PIC X(2)   VALUE SPACES.
035700     05  PRIM-LOC-OUT2  PIC X(12)  VALUE SPACES.
035800     05  FILLER         PIC X(2)   VALUE SPACES.
035900     05  FILLER         PIC X(21)  VALUE ALL "_".
036000     05  FILLER         PIC X(2)   VALUE SPACES.
036100     05  UM-OUT2        PIC X(2).
036200     05  FILLER         PIC X(5)   VALUE SPACES.
036300     05  DESC-OUT2      PIC X(60).
036400     05  FILLER         PIC X(3)   VALUE SPACES.
036500
036600 01  DESC-LINE.
036700     05  FILLER         PIC X(8)   VALUE SPACES.
036800     05  DESC-OUT-3     PIC X(80)  VALUE SPACES.
036900     05  FILLER         PIC X(94)  VALUE SPACES.
037000
037100 01  LOC-LINE.
037200     05  FILLER         PIC X(10)  VALUE SPACES.
037300     05  LOC-OUT        PIC X(12).
037400     05  FILLER         PIC X(2)  VALUE SPACES.
037500     05  FILLER         PIC X(21)  VALUE ALL "_".
037600     05  FILLER         PIC X(84)  VALUE SPACES.
037700
037800 01  TOTAL-LINE-HDR.
037900     05  FILLER         PIC X(46)  VALUE SPACES.
038000     05  FILLER         PIC X(16)  VALUE "TOTAL ITEMS FOR ".
           05  TOTAL-LIT1     PIC X(6)   VALUE SPACES.
038100     05  CLASS-OUT1     PIC X(4)   VALUE SPACES.
038200     05  TOTAL-ITEMS-CLASS-OUT PIC ZZZZ9.
038300     05  FILLER         PIC X(10)  VALUE SPACES.
038400     05  FILLER         PIC X(16)  VALUE "TOTAL FOR ".
           05  TOTAL-LIT2     PIC X(6)   VALUE SPACES.
038500     05  CLASS-OUT      PIC X(4)   VALUE SPACES.
038600     05  FILLER         PIC X(4)   VALUE SPACES.
038700     05  GRAND-OUT      PIC Z(13)9.9(4)-.
038800
038900 01  GRAND-TOTAL-LINE.
039000     05  FILLER         PIC X(15)  VALUE "TOTAL INVENTORY".
039100     05  FILLER         PIC X(08)  VALUE " OF ALL ".
           05  GRAND-TOT-LIT  PIC X(09)  VALUE SPACES.
039200     05  INVENT-GRAND-TOT-OUT   PIC ZZZ,ZZZ,ZZZ,ZZ9.9(4).
           05  FILLER         PIC X(08)  VALUE SPACES.
           05  FILLER         PIC X(13)  VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS   PIC Z(4)9  VALUE ZERO.
039300
      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
016400 01  DATA-LINE                PIC X(80).

       COPY MTLSLINK IN COPYLIB.

016500*01  R11-REC REDEFINES DATA-LINE.
016600*    05  R11-MATERIAL-OPTION  PIC X.
016700*    05  R11-SORT-OPTION      PIC X.
016800*    05  R11-INV-OPTION       PIC X.
016900*    05  R11-DESC-OPTION      PIC X.
017000*    05  R11-COST-OPTION      PIC X.
017100*    05  R11-SMALL-VALUE.
      *        10  R11-SV OCCURS 36 PIC X.
017200*    05  R11-LARGE-VALUE.
      *        10  R11-LV OCCURS 36 PIC X.
017300*    05  FILLER               PIC X(3).
017400
039400*PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
       PROCEDURE DIVISION.
039500 START-UP SECTION.
039600 HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.
           ACCEPT MTLS-DATA-LINE-3.

           DISPLAY DATA-LINE.
           MOVE ZERO TO WS-ITEM-VALUE, WS-GRAND-TOT, INVENT-GRAND-TOT,
             TOTAL-ITEMS-CLASS, TOTAL-ITEMS, QUAL-CNT, ITMS-PER-PAGE,
             PAGE-K.
           MOVE "0000" TO CLASS-PAGE.
           OPEN INPUT MSTORERM-I, MPLTINFO-I, DDESC-I,
               DMANPART-I.
039700     MOVE "DHDR35.PUB" TO HD-FILE-NAME.
039800     CALL "TESCSEQ" USING ESC-NAME.
039900     MOVE CHAR-1636PI    TO COMPRESS-PRINT.
040000     MOVE CHAR-10PI      TO NORMAL-PRINT.
040700************************************************
040800**  CALL TO "TDATECHK" RETURNS THE PROPERLY  ***
040900**  FORMATTED DATE AND TIME                  ***
041000************************************************
041100     MOVE 1 TO DATE-MODE.
041200     CALL "TDATECHK" USING DATE-CHECK-AREA.
041300     MOVE DATE-SLASH-OUT TO PRT-DATE.
041400     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
           IF MTLS-INV-WRKSH = "X"
               MOVE "   R11 - INVENTORY WORKSHEET ITEMS REPORT    "
                                   TO PRT-RPT-TITLE
           ELSE
           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.

           MOVE " TINVVAL"         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.
041500
042400*    IF R11-COST-OPTION = "X"
042500*       MOVE "    MKT COST" TO COST-HDR.
042600
042700*    CALL "DBGET" USING BASE DSET-MPLTINFO MODE7 STATUS-AREA
042800*      MPLTINFO-LIST BUF-MPLTINFO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
043000         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
043100         GO TO 2-BLOWUP.
043200
043300*    MOVE MPLTINFO-COMPANY         TO PRT-PLT.
043400
043500     PERFORM 6-MAIN THRU 6-MAIN-X.
043600     IF BU-DISPLAY-MSG = SPACES
043700         GO TO 2-STOP-RUN.
043800
043900 2-BLOWUP.
044000     MOVE "TINVVAL" TO BU-PGM-NAME.
044100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
044200         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
044300         BU-DISPLAY-AREA.
044400
045200 2-STOP-RUN.
           CLOSE MSTORERM-I, MPLTINFO-I, DDESC-I, DMANPART-I.
045300     GOBACK.
045400
045500 6-MAIN.
045600**************************************************************
045700**   R11-SORT-OPTION DETERMINES THE SORT KEY.  THESE ARE... **
045800**      1.  CORPORATE CODE WITHIN CLASS                     **
045900**      2.  CORPORATE CODE                                  **
046000**      3.  KEYWORD-ADJ                                     **
046100**      4.  PRIMARY BIN LOCATION.                           **
      **      5.  MULTIPLE STOREROOM                              **
      **      6.  MANUFACTURER                                    **
      **      7.  DEFAULT DEPARTMENT                              **
046200**************************************************************

       COPY MTLSPROC IN COPYLIB.

046300
046400*    IF R11-SORT-OPTION = "1"
046500*        SORT SORT-FILE
046600*          ON ASCENDING KEY      SORT-CLASS
046700*                                SORT-CODE
046800*             INPUT  PROCEDURE IS  7-ABSTRACT-CODES
046900*             OUTPUT PROCEDURE IS  8-WRITE-REPORT
047000*    ELSE
047100*    IF R11-SORT-OPTION = "2"
047200*        SORT SORT-FILE
047300*          ON ASCENDING KEY      SORT-CODE
047400*             INPUT PROCEDURE IS 7-ABSTRACT-CODES
047500*             OUTPUT PROCEDURE IS 8-WRITE-REPORT
047600*    ELSE
047700*    IF R11-SORT-OPTION = "3"
047800*        SORT SORT-FILE
047900*          ON ASCENDING KEY       SORT-DESC
048000*                                 SORT-CODE
048100*             INPUT PROCEDURE IS 7-ABSTRACT-CODES
048200*             OUTPUT PROCEDURE IS 8-WRITE-REPORT
048300*    ELSE
048400*    IF R11-SORT-OPTION = "4"
048500*        SORT SORT-FILE
048600*          ON ASCENDING KEY       SORT-PRIM-LOC
048700*                                 SORT-CODE
048800*             INPUT PROCEDURE IS 7-ABSTRACT-CODES
048900*             OUTPUT PROCEDURE IS 8-WRITE-REPORT
      *    ELSE
      *    IF R11-SORT-OPTION = "5"
      *        SORT SORT-FILE
      *          ON ASCENDING KEY       SORT-STR
      *                                 SORT-CODE
      *             INPUT PROCEDURE IS 7-ABSTRACT-CODES
      *             OUTPUT PROCEDURE IS 8-WRITE-REPORT
      *    ELSE
      *    IF R11-SORT-OPTION = "6"
      *        SORT SORT-FILE
      *          ON ASCENDING KEY       SORT-MANUFACTURER
      *                                 SORT-CODE
      *             INPUT PROCEDURE IS 7-ABSTRACT-CODES
      *             OUTPUT PROCEDURE IS 8-WRITE-REPORT
      *    ELSE
      *    IF R11-SORT-OPTION = "7"
      *        SORT SORT-FILE
      *          ON ASCENDING KEY       SORT-DFLT-DEPT
      *                                 SORT-CODE
      *             INPUT PROCEDURE IS 7-ABSTRACT-CODES
      *             OUTPUT PROCEDURE IS 8-WRITE-REPORT.
049000
049100 6-MAIN-X.
049200     EXIT.
049300*******************************************
049400*                                         *
049500*    I N P U T    P R O C E D U R E       *
049600*                                         *
049700*******************************************
049800
049900 7-INPUT-RECORDS  SECTION.
       7-ABSTRACT-PARA.

       COPY MTLSINPT IN COPYLIB.

      *    MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "START ERR MSTORERM 7-AP" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
      *
050000*71-ABSTRACT-LOOP.
050100*
050200*** SERIAL GET THRU MSTORERM FOR CODES
050300*
050400*    CALL "DBGET" USING BASE, DSET-STOREROOM, MODE2, STATUS-AREA,
050500*            ALL-ITEM-LIST, BUF-MSTORERM, CODE-ARG.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
050900*    IF FILE-STATUS NOT = "00"
051000*        IF FILE-STATUS-1 = "1"
051100*            GO TO 74-AC-X
051200*        ELSE
051300*            MOVE "DBGET ERR MSTORE AL" TO BU-DISPLAY-MSG
051400*            MOVE CODE-ARG              TO BU-DISPLAY-FLD (1)
051500*            GO TO 2-BLOWUP.
051600*
051700*72-DOES-CODE-QUALIFY.
051800*
051900*---------- FOR THIS REPORT, THIS PROGRAM ALLOWS THE USER
052000*           TO SELECT ITEMS FOR THE REPORT ON A RANGE
052100*           OF ACCOUNTING CLASSES, CORPORATE CODES, BIN
052200*           LOCATIONS, MANUFACTURERS OR DEFAULT DEPARTMENTS.
052300*
052400*    IF CORP-CODE = "NON-STR "
052500*       GO TO 71-ABSTRACT-LOOP.
052600*
052700*    IF R11-MATERIAL-OPTION = "2"
052800*        IF CORP-CODE < R11-SMALL-VALUE
052900*            GO TO 71-ABSTRACT-LOOP
053000*        ELSE
053100*        IF CORP-CODE > R11-LARGE-VALUE
053200*            GO TO 71-ABSTRACT-LOOP
053300*        ELSE
053400*            NEXT SENTENCE
053500*    ELSE
053600*    IF R11-MATERIAL-OPTION = "3"
053700*        IF STR-CLASS < R11-SMALL-VALUE
053800*            GO TO 71-ABSTRACT-LOOP
053900*        ELSE
054000*        IF STR-CLASS > R11-LARGE-VALUE
054100*            GO TO 71-ABSTRACT-LOOP
054200*        ELSE
054300*            NEXT SENTENCE
054400*    ELSE
054500*    IF R11-MATERIAL-OPTION = "5"
054600*        IF STR-LOC (1) < R11-SMALL-VALUE
054700*            GO TO 71-ABSTRACT-LOOP
054800*        ELSE
054900*        IF STR-LOC (1) > R11-LARGE-VALUE
055000*            GO TO 71-ABSTRACT-LOOP
      *        ELSE
      *        NEXT SENTENCE
      *    ELSE
      *    IF R11-MATERIAL-OPTION = "7"
      *        IF STR-DFLT-DEPT < R11-SMALL-VALUE
      *            GO TO 71-ABSTRACT-LOOP
      *        ELSE
      *        IF STR-DFLT-DEPT > R11-LARGE-VALUE
      *            GO TO 71-ABSTRACT-LOOP.
055100*
055200*    MOVE CORP-CODE      TO  CODE-ARG.
055300*
055400*    IF R11-MATERIAL-OPTION = "8"
      *        MOVE SPACES TO R11-SMALL-PO, R11-LARGE-PO
      *        MOVE R11-SMALL-VALUE TO R11-SMALL-PO
      *        MOVE R11-LARGE-VALUE TO R11-LARGE-PO
055500*        CALL "TCHKBLKT" USING BASE, CODE-ARG, CHKBLKT-PARMS
      *        MOVE SPACES TO R11-SMALL-PO, R11-LARGE-PO
055600*        IF FATAL-ERROR-SW = "Y"
055700*            MOVE "TCHKBLKT ERR 72-D-C-Q" TO BU-DISPLAY-MSG
055800*            GO TO 2-BLOWUP
055900*        ELSE
056000*        IF TOTAL-BLANKET-COUNT < 1
056100*            GO TO 71-ABSTRACT-LOOP.
056200*
056300*    ADD 1  TO  QUAL-CNT.
056400*
056500*    CALL "DBFIND" USING BASE, DSET-DESC, MODE1, STATUS-AREA,
056600*            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
056800*        MOVE "DBFIND ERR DDESC AL"  TO BU-DISPLAY-MSG
056900*        MOVE CODE-ARG               TO BU-DISPLAY-FLD (1)
057000*        GO TO 2-BLOWUP.
057100*
057200*    CALL "DBGET" USING BASE, DSET-DESC, MODE5, STATUS-AREA,
057300*            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
057400*    IF COND-WORD NOT = 0
057500*        IF COND-WORD = 15
057600*            MOVE " *NO DESCRIPTION ON FILE *" TO SORT-DESC
057700*        ELSE
057800*            MOVE "DBGET ON DDESC 72-DCQ" TO BU-DISPLAY-MSG
057900*            MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
058000*            GO TO 2-BLOWUP
058100*    ELSE
058200*        MOVE DESC-DATA           TO  SORT-DESC.
058300*
058400*---------- THE USER MAY ALSO SELECT ITEMS TO APPEAR ON THE REPORT
058500*           BY A RANGE OF KEYWORD/ADJECTIVES (IE, SHOW ME ALL
058600*           "O-RINGS".
058700*
058800*    IF R11-MATERIAL-OPTION = "4"
058900*         IF SORT-DESC < R11-SMALL-VALUE
059000*             GO TO 71-ABSTRACT-LOOP
059100*         ELSE
059200*         IF SORT-DESC > R11-LARGE-VALUE
059300*             GO TO 71-ABSTRACT-LOOP.
059400*
059500*73-GET-DESC-CONT.
      *    MOVE SPACES            TO  SORT-STR.
059600*    MOVE STR-CLASS         TO  SORT-CLASS.
059700*    MOVE CORP-CODE         TO  SORT-CODE.
059800*    MOVE STR-UM            TO  SORT-UM.
059900*    MOVE STR-ONHAND        TO  SORT-ONHAND.
060000*    IF R11-COST-OPTION = "X"
060100*        MOVE STR-MKT-COST  TO  SORT-AVG-COST
060200*    ELSE
060300*    MOVE STR-AVG-COST      TO  SORT-AVG-COST.
060400*    MOVE STR-LOC (1)       TO  SORT-PRIM-LOC.
      *    MOVE STR-DFLT-DEPT     TO  SORT-DFLT-DEPT.
      *    MOVE SPACES            TO  SORT-MANUFACTURER.
      *    IF R11-MATERIAL-OPTION = "6"
      *        PERFORM 74-CHECK-DMANPART-VALS
      *        PERFORM 74-START-DMANPART
      *        IF COND-WORD = 17
      *            GO TO 71-ABSTRACT-LOOP
      *        ELSE
      *        PERFORM 74-READ-DMANPART THRU 74-RD-X
      *            UNTIL COND-WORD = 15
      *        GO TO 71-ABSTRACT-LOOP.
      *
      *    IF R11-SORT-OPTION = "5"
      *        MOVE ZERO TO SUB
      *        PERFORM 6 TIMES
      *            ADD 1 TO SUB
      *            IF STR-LOC-1-2 (SUB) > SPACES
      *                MOVE STR-LOC-1-2 (SUB)      TO SORT-STR
      *                MOVE STR-LOC-ONHAND (SUB)   TO SORT-ONHAND
      *                MOVE STR-LOC (SUB)          TO SORT-PRIM-LOC
      *                RELEASE SORT-RCD
      *            END-IF
      *        END-PERFORM
      *    ELSE
      *    RELEASE SORT-RCD.
      *
      *    GO TO 71-ABSTRACT-LOOP.
      *
      *74-CHECK-DMANPART-VALS.
      *    IF R11-SMALL-VALUE = R11-LARGE-VALUE
      *        PERFORM 74-RESET-LARGE-VALUE VARYING SUB1
      *            FROM 1 BY 1 UNTIL SUB1 > 36.
      *
      *74-RESET-LARGE-VALUE.
      *    IF R11-SV (SUB1) = " " MOVE "Z" TO R11-LV (SUB1).
      *
      *74-START-DMANPART.
      *    MOVE 0 TO COND-WORD.
      *    MOVE CODE-ARG TO CORPCDE OF DMANPART-REC-I.
      *    START DMANPART-I KEY = EXTERNALLY-DESCRIBED-KEY
      *        INVALID KEY     MOVE 17 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
      *
      *74-READ-DMANPART.
      *    MOVE 0 TO COND-WORD.
      *    READ DMANPART-I NEXT INTO BUF-DMANPART
      *        AT END    MOVE 15 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
      *    IF MAN-CORPCODE NOT = CODE-ARG MOVE 15 TO COND-WORD.
      *    IF COND-WORD = 15 GO TO 74-RD-X.
      *    IF MAN-NAME = SPACES
      *        GO TO 74-READ-DMANPART
      *    ELSE
      *    IF R11-MATERIAL-OPTION = "8"
      *        NEXT SENTENCE
      *    ELSE
      *    IF MAN-NAME < R11-SMALL-VALUE
      *        GO TO 74-READ-DMANPART
      *    ELSE
      *    IF MAN-NAME > R11-LARGE-VALUE
      *        GO TO 74-READ-DMANPART.
      *    MOVE MAN-NAME TO SORT-MANUFACTURER.
      *    RELEASE SORT-RCD.
      *    GO TO 74-READ-DMANPART.
      *74-RD-X.    EXIT.

060900 7-IR-EXIT.
061000     EXIT.
061100
061200*******************************************
061300*                                         *
061400*    O U T P U T   P R O C E D U R E      *
061500*                                         *
061600*******************************************
061700
061800 8-WRITE-RECORDS SECTION.
061900 81-WRITE-RPT.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
062000     OPEN OUTPUT ONLINE-PRT.
062200
062300     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
062400         HD-ROUTE-DATA, ESC-NAME.
062500     IF HD-RET-CODE NOT = 0
062600         MOVE "THDPRT2 ERR 81-WRITE-RPT" TO BU-DISPLAY-MSG
062700         MOVE HD-RET-CODE  TO BU-DISPLAY-FLD (1)
062800         GO TO 2-BLOWUP.

           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRINT-RCD FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRINT-RCD FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

062900     IF PAPER-IS-132-COLS
063000         NEXT SENTENCE
063100     ELSE
063200         WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
063400
063500*    IF R11-SORT-OPTION = "1"
063600*        MOVE "CLASS " TO CLASS-HD
063700*    ELSE
063800*        MOVE SPACES   TO CLASS-HD.
063900*    IF R11-INV-OPTION = "2"
064000*        MOVE "W O R K S H E E T" TO VAL-HD
064100*    ELSE
064200*        MOVE "V A L U A T I O N" TO VAL-HD.
064300
064400*********************************************************
064500**   IF NO CODES QUALIFIED FOR SELECTION OPTIONS, GIVE **
064600**   A MESSAGE AND QUIT|                               **
064700*********************************************************
064800
064900
065000*    IF QUAL-CNT = 0
065000     IF CODES-RELEASED = 0
               ADD 1               TO PAGE-K
               MOVE PAGE-K         TO PRT-PAGE
               WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE
065200         MOVE
065300         "* NO CORPORATE CODES QUALIFIED FOR SELECTION CRITERIA *"
065400         TO PRINT-RCD
065500         WRITE PRINT-RCD AFTER ADVANCING 2 LINES
065700         WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0
065800         CLOSE ONLINE-PRT
065900         GO TO 84-WR-X.
066000
066100*    PERFORM 813-RETURN-RCD.
           RETURN SORT-FILE
               AT END MOVE "Y" TO FILE-IS-RETURNED.
           PERFORM 9-MOVE-CONTROL-BREAK.
066200     MOVE SRT-CLASS TO CLASS-PAGE.
           MOVE SRT-DFLT-DEPT  TO DEPT-PAGE.
           MOVE SRT-STR   TO STR-PAGE.
066300     PERFORM 831-PAGE-HDR.
           IF FILE-IS-RETURNED = "Y"
               GO TO 812-FINAL-PROCEDURE.
066400 811-LOOP.
066500**************************************************************
066600**   IF WE ARE SORTING ON ANY KEY OTHER THAN CORPORATE CODE **
066700**   WITHIN CLASS, WE DONT WANT TO BREAK ON CLASS.          **
066800**   IF WE ARE PRINTING TOTAL VALUATIONS ONLY, WE DONT      **
066900**   WANT DO A NEW HEADER AFTER EACH CLASS, THUS WE DONT    **
067000**   MOVE 51 TO ITEMS-PER-PAGE.                             **
067100**************************************************************
067200
067300*    IF R11-SORT-OPTION = "1"
      *        IF R11-MATERIAL-OPTION = "7"
      *            IF SORT-DFLT-DEPT NOT = DEPT-PAGE
      *                PERFORM 833-BOTTOM-LINE
      *                MOVE SORT-DFLT-DEPT     TO DEPT-PAGE
      *                IF R11-INV-OPTION NOT = "3"
      *                    MOVE 51 TO ITMS-PER-PAGE
      *                ELSE
      *                NEXT SENTENCE
      *            ELSE
      *            NEXT SENTENCE
      *        ELSE
067400*        IF SORT-CLASS NOT EQUAL TO CLASS-PAGE
067500*            PERFORM 833-BOTTOM-LINE
067600*            MOVE SRT-CLASS     TO CLASS-PAGE
067700*             IF R11-INV-OPTION NOT = "3"
      *             IF MTLS-TOT-VAL NOT = "X"
067800*                 MOVE 51 TO ITMS-PER-PAGE.
      *    IF R11-SORT-OPTION = "5"
      *        IF SRT-STR NOT EQUAL TO STR-PAGE
      *            PERFORM 833-BOTTOM-LINE
      *            MOVE SRT-STR TO STR-PAGE
      *            IF R11-INV-OPTION NOT = "1"
      *            IF MTLS-INV-WRKSH = "X" OR MTLS-TOT-VAL = "X"
      *                MOVE 51 TO ITMS-PER-PAGE.
      *    IF R11-SORT-OPTION = "7"
      *        IF SRT-DFLT-DEPT NOT = DEPT-PAGE
      *            PERFORM 833-BOTTOM-LINE
      *            MOVE SRT-DFLT-DEPT TO DEPT-PAGE
      *            IF R11-INV-OPTION NOT = "3"
      *            IF MTLS-TOT-VAL NOT = "X"
      *                MOVE 51 TO ITMS-PER-PAGE.
067900     PERFORM 82-INVENTORY-REPORT  THRU 827-LOC-LOOP-X.
068000     PERFORM 813-RETURN-RCD.
068100     IF FILE-IS-RETURNED = "Y"
068200         GO TO 812-FINAL-PROCEDURE.
068300     GO TO 811-LOOP.
068400 812-FINAL-PROCEDURE.
068500*    IF R11-SORT-OPTION = "1" OR "7"
068600*        PERFORM 833-BOTTOM-LINE
068700*    ELSE

      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
068800         MOVE WS-GRAND-TOT TO INVENT-GRAND-TOT
068900
069000*    MOVE SPACES       TO PRINT-LINE.
069100*    WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
069200         ADD 1 TO PAGE-K
069300         MOVE PAGE-K         TO PRT-PAGE
               WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE
069400*    MOVE REPORT-HEADER  TO PRINT-RCD.
069500*    WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
069600         PERFORM 832-FINAL-LINE.
069800     WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.
069900     CLOSE ONLINE-PRT.
070000     GO TO 84-WR-X.
070100 813-RETURN-RCD.
070200     RETURN SORT-FILE
070300         AT END MOVE "Y" TO FILE-IS-RETURNED.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF FILE-IS-RETURNED NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF FILE-IS-RETURNED = "Y" OR CNTL-BREAK-SW = "Y"
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRINT-RCD FROM CONTROL-BREAK-LINE
                                   AFTER ADVANCING 2 LINES
                   ADD 2  TO  ITMS-PER-PAGE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF MTLS-TOT-VAL NOT = "X"
                       IF FILE-IS-RETURNED = "N"
                           MOVE 3      TO  ITMS-PER-PAGE
                           PERFORM 831-PAGE-HDR.
070400
070500*******************************************
070600*                                         *
070700*    I N V E N T O R Y   R E P O R T      *
070800*                                         *
070900*******************************************
071000
071100 82-INVENTORY-REPORT.
071200     IF ITMS-PER-PAGE > 50
071300          MOVE 3 TO ITMS-PER-PAGE
071400          PERFORM 831-PAGE-HDR.
071500
071600     COMPUTE  WS-ITEM-VALUE = SRT-ONHAND * SRT-COST.
071700     ADD WS-ITEM-VALUE TO WS-GRAND-TOT.
071800     ADD 1             TO TOTAL-ITEMS-CLASS TOTAL-ITEMS.
071900*    IF R11-INV-OPTION = "2"
           IF MTLS-INV-WRKSH = "X"
072000         MOVE SRT-CORP-CODE    TO CORP-CODE-OUT2
072100         MOVE SRT-UM           TO UM-OUT2
072200         MOVE SRT-PRIM-LOC     TO PRIM-LOC-OUT2
072300         MOVE SRT-KEYWD-MOD    TO DESC-OUT2
072400     ELSE
072500         MOVE SRT-CORP-CODE    TO CORP-CODE-OUT
072600         MOVE SRT-ONHAND       TO QTY-OUT
072700         MOVE SRT-UM           TO UM-OUT
072800         MOVE SRT-COST         TO AVG-COST-OUT
072900         MOVE SRT-PRIM-LOC     TO PRIM-LOC-OUT
073000         MOVE WS-ITEM-VALUE    TO TOT-COST-OUT
073100         MOVE SRT-KEYWD-MOD    TO DESC-OUT.
073200
073300
073400 821-INVENT-CONT.
073500     MOVE SPACES            TO PRINT-LINE.
073600**************************************************************
073700**   IF INV OPTION IS 3 (PRINT VALUATION TOTALS ONLY), WE   **
073800**   SKIP THE WRITE OF THE DETAIL LINE.  IF IT IS 2,        **
073900**   (INVENTORY WORKSHEET), WE DOUBLE SPACE TO GIVE THEM    **
074000**   ROOM TO SCRIBBLE.  OTHERWISE SINGLE SPACE.             **
074100**************************************************************
074200
074300*    IF R11-INV-OPTION = "3"
           IF MTLS-TOT-VAL = "X"
074400         NEXT SENTENCE
074500     ELSE
074600*    IF R11-INV-OPTION = "2"
           IF MTLS-INV-WRKSH = "X"
074700         WRITE PRINT-RCD FROM ITEM-DETAIL-2
074800             AFTER ADVANCING 2 LINES
074900         ADD 2 TO ITMS-PER-PAGE
075000     ELSE
075100         WRITE PRINT-RCD   FROM ITEM-DETAIL
075200             AFTER ADVANCING 1 LINES
075300         ADD 1 TO ITMS-PER-PAGE.
075400
      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X" AND MTLS-TOT-VAL = " "
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO ITMS-PER-PAGE
               WRITE PRINT-RCD FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

075500***************************************************************
075600**   IF MULTIPLE DESCRIPTION IS NOT PICKED, SKIP THE SECTION **
075700**   WHICH PRINTS MULTIPLE LINES.                            **
075800***************************************************************
      *    IF R11-DESC-OPTION NOT = "X"
           IF MTLS-DESC-OPT NOT = "X"
               GO TO 824-LOC-CHECK.
076100 822-MULT-DESC.
076200     MOVE 0 TO SUB.
076300     MOVE SRT-CORP-CODE   TO  CODE-ARG.
076400     CALL "CDESC" USING RET-CODE,
076500                        BASE,
076600                        STATUS-AREA,
076700                        BU-DISPLAY-MSG,
076800                        CODE-ARG,
076900                        CDESC-DATA.
077000     IF BU-DISPLAY-MSG-1  NOT  = SPACES
077100         MOVE CODE-ARG    TO  BU-DISPLAY-FLD (2)
077200         GO TO 2-BLOWUP.
077300     MOVE 1 TO SUB.
077400
077500 823-MULT-PRINT-DESC.
077600      ADD 1 TO SUB.
077700      IF SUB > CDESC-LINES-GOT
077800         GO TO 824-LOC-CHECK.
077900
      **************************************************************
      **   THE FOLLOWING LINES OF CODE WERE INCLUDED 11/16/92     **
      **   TO ALWAYS PUT ONE LINE OF DESCRIPTION ON THE INVENTORY **
      **   VALUATION REPORT PER CPE REQUEST 6314.                 **
      **************************************************************
075900*    IF R11-DESC-OPTION NOT = "X"
           IF MTLS-DESC-OPT NOT = "X"
               IF CDESC-TYPE (SUB) = "K" OR "M"
                   GO TO 823-MULT-PRINT-DESC.

      *     IF R11-MATERIAL-OPTION = "6"
      *         IF CDESC-TYPE (SUB) = "M"
      *             IF CDESC-MFR-NAME (SUB) < R11-SMALL-VALUE
      *                 GO TO 823-MULT-PRINT-DESC
      *             ELSE
      *             IF CDESC-MFR-NAME (SUB) > R11-LARGE-VALUE
      *                 GO TO 823-MULT-PRINT-DESC.

078000      MOVE CDESC (SUB) TO DESC-OUT-3.
078100      IF ITMS-PER-PAGE > 50
078200         MOVE 3   TO   ITMS-PER-PAGE
078300         PERFORM 831-PAGE-HDR.
078400      WRITE PRINT-RCD FROM DESC-LINE AFTER ADVANCING 1.
078500      ADD 2 TO ITMS-PER-PAGE.
078600
      *    IF R11-DESC-OPTION NOT = "X" GO TO 824-LOC-CHECK.
           IF MTLS-DESC-OPT NOT = "X" GO TO 824-LOC-CHECK.

078700     GO TO 823-MULT-PRINT-DESC.
078800
078900 824-LOC-CHECK.
079000**************************************************************
079100**   IF INV OPTION IS OTHER THAN 2 (INVENTORY WORKSHEET),   **
079200**   SKIP THE LOOP WHERE ALL STOREROOM LOCATIONS ARE PRINTED**
079300**   (FOR PURPOSE OF TAKING INVENTORY).                     **
079400**************************************************************
079500
079600*    IF R11-INV-OPTION = "2"
           IF MTLS-INV-WRKSH = "X"
079700         GO TO 825-LOC-ROUTINE
079800     ELSE
079900         GO TO 827-LOC-LOOP-X.
080000 825-LOC-ROUTINE.
080100     MOVE 0  TO SUB.
080200     MOVE SRT-CORP-CODE  TO CODE-ARG.
080300*    CALL "DBGET" USING BASE, DSET-STOREROOM, MODE7,
080400*      STATUS-AREA, ALL-ITEM-LIST, BUF-MSTORERM, CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
077400     IF FILE-STATUS NOT = "00"
080600         MOVE "DBGET ERR LOC-ROUTINE" TO BU-DISPLAY-MSG
080700         GO TO 2-BLOWUP.
080800
080900 826-LOC-LOOP.
081000     ADD 1 TO SUB.
081100     IF SUB > 6
081200         GO TO 827-LOC-LOOP-X.
081300
081400     IF SUB = 1
081500         GO TO 826-LOC-LOOP.
081600
081700     IF STR-LOC (SUB) = SPACES
081800         GO TO 826-LOC-LOOP.
081900
082000     MOVE STR-LOC (SUB)  TO  LOC-OUT.
082100     WRITE PRINT-RCD FROM LOC-LINE
082200         AFTER ADVANCING 2.
082300     ADD 2  TO ITMS-PER-PAGE.
082400     GO TO 826-LOC-LOOP.
082500
082600 827-LOC-LOOP-X.
082700     EXIT.
082800 831-PAGE-HDR.
082900*    MOVE SPACES         TO PRINT-LINE.
083000*    WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
083100     ADD 1               TO PAGE-K.
083200     MOVE PAGE-K         TO PRT-PAGE.
           WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEW-PAGE.
           WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE.
           IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
             MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
             WRITE PRINT-RCD FROM HEADING-2B AFTER ADVANCING 1 LINE
             ADD   1           TO ITMS-PER-PAGE.
083300*    MOVE REPORT-HEADER          TO PRINT-RCD.
083400*    WRITE PRINT-RCD AFTER  ADVANCING 1 LINES.
083500
083600*---------- IF THE MATERIAL OPTION IS 8 (ITEMS ON A BLANKET),
083700*           PRINT A SPECIAL HEADER.
083800
083900*    IF R11-MATERIAL-OPTION = "8"
      *        IF R11-SMALL-VALUE = SPACES
084000*            MOVE REQUIREMENT-HEADER    TO  PRINT-RCD
084100*            WRITE PRINT-RCD AFTER ADVANCING 1 LINES
      *        ELSE
      *        MOVE R11-SMALL-VALUE TO PO-LOW
      *        MOVE "-"             TO PO-D
      *        MOVE R11-LARGE-VALUE TO PO-HIGH
      *        MOVE REQUIREMENT-HEADER TO PRINT-RCD
      *        WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
084200
084300**************************************************************
084400**   IF WE ARE SORTING ON CORPORATE CODE WITHIN CLASS,      **
084500**   CLASS IS PRINTED AT THE TOP OF EACH PAGE.  ELSE,       **
084600**   THIS FIELD REMAINS AT ITS VALUE OF SPACES.             **
084700**************************************************************
084800
      *    IF R11-SORT-OPTION = "5"
      *        IF R11-MATERIAL-OPTION = "7"
      *            MOVE SPACES TO INV1-VAR-HDR
      *            IF R11-SMALL-VALUE = SPACES
      *                MOVE SORT-STR  TO  CLASS-CODE-OUT
      *                MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *                WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *            ELSE
      *            MOVE SORT-STR TO CLASS-CODE-OUT
      *            MOVE "DEPT RANGE SELECTED" TO INV1-VH-LIT1
      *            MOVE R11-SMALL-VALUE TO INV1-VH-LOW
      *            MOVE " - " TO INV1-VH-LIT2
      *            MOVE R11-LARGE-VALUE TO INV1-VH-HIGH
      *            MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *            WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *        ELSE
      *        MOVE SORT-STR   TO CLASS-CODE-OUT
      *        MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *        WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *    ELSE
084900*    IF R11-SORT-OPTION = "1"
      *        IF R11-MATERIAL-OPTION = "7"
      *            MOVE SPACES TO INV1-VAR-HDR
      *            IF R11-SMALL-VALUE = SPACES
      *                MOVE SORT-CLASS TO  CLASS-CODE-OUT
      *                MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *                WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *            ELSE
      *            MOVE SORT-CLASS TO CLASS-CODE-OUT
      *            MOVE "DEPT RANGE SELECTED" TO INV1-VH-LIT1
      *            MOVE R11-SMALL-VALUE TO INV1-VH-LOW
      *            MOVE " - " TO INV1-VH-LIT2
      *            MOVE R11-LARGE-VALUE TO INV1-VH-HIGH
      *            MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *            WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *        ELSE
085000*        MOVE SORT-CLASS TO CLASS-CODE-OUT
      *        MOVE INVENTORY-HDR-1 TO PRINT-RCD
      *        WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *    ELSE
      *    IF R11-MATERIAL-OPTION = "6"
      *        IF R11-SMALL-VALUE = SPACES
      *            MOVE MANUFACTURER-HEADER TO PRINT-RCD
      *        ELSE
      *        MOVE R11-SMALL-VALUE TO MAN-LOW
      *        MOVE "-"             TO MAN-D
      *        MOVE R11-LARGE-VALUE TO MAN-HIGH
      *        MOVE MANUFACTURER-HEADER TO PRINT-RCD
      *        WRITE PRINT-RCD AFTER ADVANCING 2 LINES
      *    ELSE
      *    IF R11-MATERIAL-OPTION = "7"
      *        IF R11-SMALL-VALUE = SPACES
      *            MOVE DEPARTMENT-HEADER TO PRINT-RCD
      *        ELSE
      *        MOVE R11-SMALL-VALUE TO DEPT-LOW
      *        MOVE "-"             TO DEPT-D
      *        MOVE R11-LARGE-VALUE TO DEPT-HIGH
      *        MOVE DEPARTMENT-HEADER TO PRINT-RCD
      *        WRITE PRINT-RCD AFTER ADVANCING 2 LINES.
085400*
085500**************************************************************
085600**   IF INVENTORY WORKSHEET WAS SPECIFIED IN THE PRE-       **
085700**   PROCESSING PGM, WE HAVE A DIFFERENT DETAIL LINE        **
085800**   (DOTTED LINES TO FILL IN QUANTITY, WITH QUANTITY       **
085900**   CLOSER TO CORP-CODE).                                  **
086000**************************************************************
086100
086200*    IF R11-INV-OPTION = "2"
           IF MTLS-INV-WRKSH = "X"
086300         MOVE INVENTORY-HDR-2A TO PRINT-RCD
086400     ELSE
086500         MOVE INVENTORY-HDR-2  TO PRINT-RCD.
086600
086700     WRITE PRINT-RCD AFTER ADVANCING 2 LINES.
086800     WRITE PRINT-RCD FROM DOT-LINE AFTER  ADVANCING 1 LINES.
086900     MOVE SPACES       TO PRINT-LINE.
087000     WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
087100 832-FINAL-LINE.
087200     MOVE INVENT-GRAND-TOT  TO INVENT-GRAND-TOT-OUT.
           MOVE CODES-RELEASED    TO PRT-GRD-ITMS.
087300     MOVE SPACES         TO PRINT-LINE.
087400     WRITE PRINT-RCD FROM GRAND-TOTAL-LINE
087500         AFTER ADVANCING 2 LINES.
087600
087700 833-BOTTOM-LINE.
087800******************************************************
087900**   IF PRINTING TOTALS ONLY, DONT WANT THE DOT     **
088000**   LINE.                                          **
088100******************************************************
088200
088300*    IF R11-INV-OPTION NOT = "3"
           IF MTLS-TOT-VAL NOT = "X"
088400         MOVE DOT-LINE        TO PRINT-RCD
088500         WRITE PRINT-RCD  AFTER  ADVANCING 2 LINES.
      *    IF R11-SORT-OPTION = "5"
      *        MOVE "STORE "    TO TOTAL-LIT1, TOTAL-LIT2
      *        MOVE "STORES   " TO GRAND-TOT-LIT
      *        MOVE STR-PAGE    TO CLASS-OUT, CLASS-OUT1
      *    ELSE
      *****IF R11-MATERIAL-OPTION = "7"    *17NOV1995*
      *    IF R11-SORT-OPTION = "7"
      *        MOVE "DEPT  "    TO TOTAL-LIT1, TOTAL-LIT2
      *        MOVE "DEPTS    " TO GRAND-TOT-LIT
      *        MOVE DEPT-PAGE   TO CLASS-OUT, CLASS-OUT1
      *    ELSE
      *    MOVE "CLASS "        TO TOTAL-LIT1, TOTAL-LIT2
      *    MOVE "CLASSES  "     TO GRAND-TOT-LIT
088600*    MOVE CLASS-PAGE      TO CLASS-OUT CLASS-OUT1.

088700     MOVE WS-GRAND-TOT    TO GRAND-OUT.
088800     MOVE SPACES          TO PRINT-LINE.
088900     MOVE TOTAL-ITEMS-CLASS TO TOTAL-ITEMS-CLASS-OUT.
089000     MOVE 0                 TO TOTAL-ITEMS-CLASS.
089100*    IF R11-INV-OPTION = "3"
           IF MTLS-TOT-VAL = "X"
089200         WRITE PRINT-RCD FROM TOTAL-LINE-HDR
089300           AFTER ADVANCING 1 LINES
089400     ELSE
               MOVE SPACES TO PRINT-LINE
               WRITE PRINT-RCD
                   AFTER ADVANCING 1 LINE
089500         WRITE PRINT-RCD  FROM TOTAL-LINE-HDR
089600             BEFORE ADVANCING 2 LINES.
089700     ADD WS-GRAND-TOT     TO INVENT-GRAND-TOT.
089800     MOVE ZEROS           TO WS-GRAND-TOT.
089900
090000**************************************************************
090100**   IF PRINTING TOTALS ONLY, WE WANT TO ADD TO THE LINE    **
090200**   COUNTER HERE.                                          **
090300**************************************************************
090400
090500*    IF R11-INV-OPTION = "3"
           IF MTLS-TOT-VAL = "X"
090600         ADD 1 TO ITMS-PER-PAGE.
090700
090800 84-WR-X.
090900     EXIT.
       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
