       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TINVFIX.
       AUTHOR.      FRED HAYNES.
      *D************************************************************
      *D*PURPOSE:  THIS PROGRAM RESETS THE STATUS CODE ON          *
      *D*          THE INVOICES ON A GIVEN MANIFEST TO A GIVEN     *
      *D*          STATUS CODE.                                    *
      *D************************************************************
      *C
      *C CR KALMAN        4/26/94            REQUEST 6490
      *C REMOVED PORTABLILITY COPYLIBS.
      *C
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  JULY 03, 1996   CA YODER
      *C   RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DINVRCD-RG-O
               ASSIGN TO DATABASE-MCFLCS2501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DINVRCD-RG-O
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-RG-REC-O.
           COPY DDS-MCRPCS2500  OF MCFLCS2501.

       WORKING-STORAGE SECTION.
       01  HANDLE-BLOWUP-FLAG         PIC X VALUE "Y".
       01  RECORD-COUNTER             PIC 9(5).
       01  MANIFEST-YY                PIC XX.
       01  MANIFEST-NMM               PIC XXX.
       01  SET-STATUS                 PIC XX.
9406CK 01  SCOPE   PIC X.

       COPY FILESTAT IN COPYLIB.

       COPY DATAB    IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-NAME              PIC X(16).
           05  DSET-DINVRCD           PIC X(16)  VALUE "DINVRCD;".

       01  SEARCH-ITEMS.
           05  ALL-ITEMS              PIC X(2)   VALUE "@;".

       01  REGISTER-ARG               PIC X(6).

       COPY DINVRCD IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       PROCEDURE DIVISION.
       MAIN-LINE-LOGIC.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           DISPLAY "MANIFEST YY ? ".
           ACCEPT MANIFEST-YY.
           DISPLAY MANIFEST-YY.
           DISPLAY "MANIFEST NMM ?".
           ACCEPT MANIFEST-NMM.
           DISPLAY MANIFEST-NMM.
           DISPLAY "STATUS TO SET ?"
           ACCEPT SET-STATUS.
           DISPLAY SET-STATUS.

           PERFORM 9999-OPENS.
           MOVE DSET-DINVRCD TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           MOVE 0 TO RECORD-COUNTER.
           PERFORM 9999-BEGFIL-DINVRCD-RG-O.
           PERFORM 9999-GETSER-DINVRCD-RG-O.
           PERFORM UNTIL END-OF-FILE

             IF INV-MFEST-NO = MANIFEST-NMM AND
                INV-MFEST-YY = MANIFEST-YY

               MOVE SET-STATUS TO INV-STATUS
               PERFORM 9999-UPDATE-DINVRCD-RG-O
               ADD 1 TO RECORD-COUNTER

             END-IF

             PERFORM 9999-GETSER-DINVRCD-RG-O

           END-PERFORM.

           PERFORM 9999-UNLOCK.
           DISPLAY "RECORDS CHANGED = " RECORD-COUNTER.
           PERFORM 9999-CLOSES.
           STOP RUN.

       2100-BLOWUP.
           DISPLAY "BLOW UP ".
           DISPLAY "FILE-STATUS = " FILE-STATUS.
           DISPLAY "COND-WORD = " COND-WORD.
           DISPLAY "BU-DISPLAY-MSG = " BU-DISPLAY-MSG.
           STOP RUN.

       9999-OPENS.

      *------ DUMMY ENTRY FOR STORES DATABASE OPEN

           OPEN I-O DINVRCD-RG-O.

       9999-CLOSES.

      *------ DUMMY ENTRY FOR STORES DATABASE CLOSE

           CLOSE DINVRCD-RG-O.

       9999-DSET-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-UNLOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-GETSER-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           READ DINVRCD-RG-O NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DINVRCD-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DINVRCD-RG-O.
           MOVE SPACES TO REGISTERNO OF DINVRCD-RG-REC-O.
           START DINVRCD-RG-O KEY >= REGISTERNO OF DINVRCD-RG-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-UPDATE-DINVRCD-RG-O.
           MOVE 0 TO COND-WORD.
           REWRITE DINVRCD-RG-REC-O FROM BUF-DINVRCD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DINVRCD-RG-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

