       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVMHD.
       AUTHOR.        LS BAKER/KURT MOVSESIAN.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  MAY 22, 1984.

      *REMARKS.        INVOICE PROCESSING.
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                         *
      *D*  T I N V M H D                                          *
      *D*                                                         *
      *D*  THIS SUB PROGRAM MODIFIES INVOICE HEADER INFORMATION   *
      *D*  SUCH AS INVOICE DATE, TERMS, ZBILL, ZBILL AMOUNT AND   *
      *D*  VENDOR CODE.                                           *
      *D*                                                         *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*  NOTE THIS SUBROUTINE IS CALLED BY:                     *
      *D*  1. TINVMOD.SOURCE - INVOICE MODIFICATION.              *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C*  CHANGES
      *C*
      *C*  DECEMBER 01, 1992    CR KALMAN  REQ: 6268
      *C*  CHANGED TERMS TO BE A DISPLAY FIELD ONLY. ACCRUED TAX IS NOW
      *C*  CALCULATED USING THE DISCOUNT AMOUNT IN THE TERMS SO THIS
      *C*  FIELD CAN NO LONGER BE CHANGED OUTSIDE OF INVOICE ENTRY.
      *C*  COMMENTED OUT ALL EDITS OF THIS FIELD.
      *C*
      *C*  MAY 08, 1996         CA YODER    REQ #94-005
      *C*  ADDED CURRENCY CODE AS AN INPUT FIELD TO THE SCREEN.  THE
      *C*  CURRENCY CODE CAN BE CHANGED FROM THE PO CURRENCY ONLY IF
      *C*  IT IS THE HOME CURRENCY AND IF IT IS A NO-CHECK INVOICE.
      *C*
      *C*  JULY 12, 1996        CA YODER
      *C*  MODIFIED FOR CENTURY DATABASE CHANGES.
      *C*
      *C*  NOVEMBER 13, 1996    CA YODER
      *C*  LAWTON IDENTIFIED THE PROBLEM THAT THE PROGRAM WAS NOT
      *C*  CHECKING FOR DUPLICATE INVOICES WHEN THE VENDOR CODE WAS
      *C*  CHANGED.  CORRECTED THE PROBLEM.
      *C*

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVOICE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS IS DYNAMIC
                  RECORD KEY IS VENCDE OF DVENDOR-I-REC
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPODATAITM-I
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPODATAITM-O
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MVALIDUM-I
                 ASSIGN TO DATABASE-MCFLCS0401
                 ORGANIZATION IS INDEXED
                   ACCESS MODE IS DYNAMIC
                 RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DD-INVMOD2-O OF ZINVOICE.
           COPY DD-FINV03-O  OF ZINVOICE.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2502.
       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0701.
       FD  DPODATAITM-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.
       FD  DPODATAITM-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-O-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.
       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0401.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X VALUE "0".
           05  FILE-STATUS-2         PIC X VALUE "0".
       77  CALC-ADDRESS              PIC S9(9)    VALUE ZERO  COMP.
       77  BLOWUP-SW                 PIC X        VALUE SPACE.
       77  READ-CTR                  PIC S9(4)    VALUE ZERO COMP.

       01  BUILD-CC-KEY.
           05  BUILD-CC-VALUE        PIC X(2)     VALUE SPACES.

      *************************************************************
      **                                                         **
      **                     S W I T C H E S                     **
      **                                                         **
      *************************************************************

       01  SWITCHES.
           05  VEN-CHG-SW            PIC X        VALUE SPACE.
           05  INV-CHG-SW            PIC X        VALUE SPACES.
           05  ERR-SW                PIC X        VALUE SPACES.
           05  OVERRIDE-DATE-CHK-SW  PIC X        VALUE SPACE.

      *************************************************************
      **                                                         **
      **                   S A V E   A R E A S                   **
      **                                                         **
      *************************************************************

       01  MISC-SAVE-AREAS-X.
           05  S-INVOICE-DATE-CN.
               10  S-INVOICE-CC      PIC X(2) VALUE SPACE.
               10  S-INVOICE-DATE.
                   15  S-INVOICE-YY  PIC X(2) VALUE SPACES.
                   15  S-INVOICE-MM  PIC X(2) VALUE SPACES.
                   15  S-INVOICE-DD  PIC X(2) VALUE SPACES.
           05  SAVE-NEW-VENDOR-CODE  PIC X(10)    VALUE SPACES.

       01  MISC-SAVE-AREAS-9.
           05  MINUS-6M-DATE-CN.
               10  MINUS-6M-CC       PIC 9(2)     VALUE ZERO.
               10  MINUS-6M-DATE.
                   15  MINUS-6M-YY   PIC 9(2)     VALUE ZERO.
                   15  MINUS-6M-MM   PIC 9(2)     VALUE ZERO.
                   15  MINUS-6M-DD   PIC 9(2)     VALUE ZERO.
           05  PLUS-1D-DATE-CN.
               10  PLUS-1D-CC        PIC 9(2)     VALUE ZERO.
               10  PLUS-1D-DATE.
                   15  PLUS-1D-YY    PIC 9(2)     VALUE ZERO.
                   15  PLUS-1D-MM    PIC 9(2)     VALUE ZERO.
                   15  PLUS-1D-DD    PIC 9(2)     VALUE ZERO.
           05  S-NEG-VALUE           PIC S9(8)V9(2) VALUE ZERO.
           05  S-INV-DESC-ADDR       PIC S9(9)    VALUE ZERO.
           05  S-INVOICE-NO          PIC X(14)    VALUE SPACES.

       01  BUILD-TM-DISCOUNT-KEY.
           05  FILLER                PIC X(3)  VALUE "TMP".
           05  BUILD-TM-DISCOUNT-VALUE  PIC X  VALUE SPACES.

       01  BUILD-TM-DUE-DATE-KEY.
           05  FILLER                PIC X(3)  VALUE "TMD".
           05  BUILD-TM-DATE-VALUE   PIC X     VALUE SPACES.

       01  SAVE-HOME-CUR-CODE        PIC X(2)  VALUE SPACES.

      *************************************************************
      **                                                         **
      **      V I E W   C O M M U N I C A T I O N   A R E A      **
      **                                                         **
      *************************************************************

       01  FORM-NAMES.
           05  HEADER                PIC X(7)     VALUE "INVMOD2".
           05  INVTERMS              PIC X(7)     VALUE "FINV03A".

       01  SAVE-VIEW-STATUS          PIC S9(4)    VALUE ZERO  COMP.
       01  SAVE-COND-WORD            PIC S9(4)    VALUE ZERO  COMP.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.

       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP.

       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO  COMP.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  DE-BUFFER1.
           05  DE1-REG-NUM           PIC ZZZZ9.
           05  DE1-PO-RLSE.
               10  DE1-PO            PIC X(7).
               10  DE1-RLSE          PIC X(3).
           05  DE1-INV-NUM           PIC X(14).
           05  DE1-STATUS            PIC X.
           05  DE1-MFEST-NO          PIC X(8).
           05  DE1-INV-DATE          PIC X(6).
           05  DE1-DUE-DATE          PIC X(8).
           05  DE1-INV-TERMS.
               10  DE1-TERMS-DUE-PCT  PIC X.
               10  DE1-TERMS-DUE-DATE PIC X.
           05  DE1-ENTRY-DATE        PIC X(8).
           05  DE1-MOD-DATE          PIC X(8).
           05  DE1-ADD-CLERK         PIC X(4).
           05  DE1-MOD-CLERK         PIC X(4).
           05  DE1-PO-TERMS-PERCENT  PIC X(5).
           05  DE1-PO-TERMS-DUE      PIC X(18).
           05  DE1-INV-CE            PIC X.
           05  DE1-I-MATL-EXT        PIC -(11)9.99.
           05  DE1-P-MATL-EXT        PIC -(11)9.99.
           05  DE1-PAYMENT-IND       PIC X.
           05  DE1-VEN-CODE.
               10  DE1-VEN7          PIC X(7).
               10  DE1-VEN3          PIC X(3).
           05  DE1-NET-DUE-VENDOR    PIC -(11)9.99.
           05  DE1-DIST-COST         PIC -(11)9.99.
           05  DE1-CUR-CODE          PIC X(2).
           05  DE1-CUR-DESC          PIC X(12).
           05  DE1-NO-CHECK-INDIC    PIC X.
           05  DE1-INV-DESC          PIC X(55).
           05  DE1-COMMAND-LINE      PIC X(79).
           05  DE1-MSG-LINE          PIC X(79).

      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DBMODES IN COPYLIB.

       COPY DBSTAT  IN COPYLIB.

       01  DATES-AND-TIMES.
           05  HP-CURRENT-DATE.
               10  HP-MM             PIC X(2).
               10  FILLER            PIC X.
               10  HP-DD             PIC X(2).
               10  FILLER            PIC X.
               10  HP-YY             PIC X(2).
           05  YMD-DATE-CN.
               10  YMD-CC            PIC X(2).
               10  YMD-DATE.
                   15  YMD-YY        PIC X(2).
                   15  YMD-MM        PIC X(2).
                   15  YMD-DD        PIC X(2).
           05  YMD-DATE-9-CN  REDEFINES  YMD-DATE-CN.
               10  YMD-CC-9          PIC 9(2).
               10  YMD-YY-9          PIC 9(2).
               10  YMD-MM-9          PIC 9(2).
               10  YMD-DD-9          PIC 9(2).

      *******************************
      **  PARAMETERS FOR CALLING
      **  'SINVDUED'
      *******************************

       COPY SINVDUED IN COPYLIB.
       COPY TDATECHK IN COPYLIB.
       COPY DISPDATA IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD  IN COPYLIB.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY DPODATA  IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

       COPY MVALIDUM IN COPYLIB.

      *************************************************************
      **                                                         **
      **                L I N K A G E   A R E A                  **
      **                                                         **
      *************************************************************

       LINKAGE SECTION.

       01  BASE                      PIC X(10).

       COPY VCOMLINK IN COPYLIB.

      *01  SCREEN-PRINT-PARMS.
      *    05  PRINT-CTL             PIC S9(4)    COMP.
      *    05  PAGE-CTL              PIC S9(4)    COMP.
      *    05  SPOOLFIL-OPEN-SW      PIC X.
      *
      *01  PASS-SPOOL-PRT-NO         PIC S9(2)    COMP.

       01  ARGUMENT-VALUES.
           05  PLT-ARG               PIC X(4).
           05  PO-ARG                PIC X(14).
           05  VEN-ARG.
               10  VEN-ARG1-7        PIC X(7).
               10  VEN-ARG8-10       PIC X(3).
           05  CORPCODE-ARG          PIC X(8).
           05  REGISTER-ARG          PIC X(6).

       COPY DINVRCD  IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY LANGSUB  IN COPYLIB.


       PROCEDURE DIVISION USING  BASE,
                                 VIEW-COMAREA,
      *                          SCREEN-PRINT-PARMS,
      *                          PASS-SPOOL-PRT-NO,
                                 ARGUMENT-VALUES,
                                 BUF-DINVRCD,
                                 BUF-DPORECD,
                                 LANGUAGE-PARMS.


       MOD-HEADER SECTION 02.
           OPEN INPUT MPLTINFO-I, DVENDOR-I, DINVRCD-I,
                      DPODATAITM-I, MVALIDUM-I.
           OPEN I-O   DPODATAITM-O, DISPLAY-FILE.
           PERFORM  6-MODIFY-HEADER  THRU  6-MODIFY-HEADER-X.
           CLOSE MPLTINFO-I, DVENDOR-I, DPODATAITM-O,
                 DPODATAITM-I, DINVRCD-I, DISPLAY-FILE, MVALIDUM-I.
           GOBACK.

       2-BLOWUP.
           MOVE "TINVMHD"               TO  BU-PGM-NAME.
           MOVE REGISTER-ARG            TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.


       6-MODIFY-HEADER.
           MOVE SPACE               TO  DE-BUFFER1,
                                        S-INVOICE-NO.
           MOVE INV-REG-NO-9        TO  DE1-REG-NUM.
           MOVE INV-PO-NO           TO  DE1-PO.
           MOVE INV-RLSE            TO  DE1-RLSE.
           MOVE INV-NO              TO  DE1-INV-NUM.
           MOVE INV-STATUS          TO  DE1-STATUS.
           MOVE INV-MFEST-NO        TO  DE1-MFEST-NO.
           MOVE 4                   TO  DATE-MODE.
           MOVE INV-DATE            TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-OUT            TO  DE1-INV-DATE.
           IF INV-DUE-CN NOT = SPACE
               MOVE INV-DUE-DATE    TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE1-DUE-DATE.
           MOVE INV-TERMS           TO  DE1-INV-TERMS.
           PERFORM 61-GET-TERMS-DESC  THRU 61-GTD-X.
           MOVE INV-ENTRY-DATE      TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT      TO  DE1-ENTRY-DATE.
           IF INV-MOD-CN NOT = SPACE
               MOVE INV-MOD-DATE    TO  DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT  TO  DE1-MOD-DATE.
           MOVE INV-ADD-CLERK       TO  DE1-ADD-CLERK.
           MOVE INV-MOD-CLERK       TO  DE1-MOD-CLERK.
           MOVE CE1-CODE            TO  DE1-INV-CE.
           MOVE INV-I-MATL-EXT      TO  DE1-I-MATL-EXT.
           MOVE INV-P-MATL-EXT      TO  DE1-P-MATL-EXT.
           MOVE INV-PAYMENT-IND     TO  DE1-PAYMENT-IND.
           MOVE INV-NET-DUE-VENDOR  TO  DE1-NET-DUE-VENDOR.
           MOVE INV-DIST-COST       TO  DE1-DIST-COST.
           MOVE INV-VEN-CODE        TO  DE1-VEN-CODE,
                                        SAVE-NEW-VENDOR-CODE.
           MOVE INV-NO-CHECK-INDIC  TO  DE1-NO-CHECK-INDIC.

      *-------- FIND THE HOME CURRENCY CODE.
           MOVE "CCHM"     TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO*6MH"     TO  BU-DISPLAY-MSG
               GO TO  2-BLOWUP
           ELSE
               MOVE MPLTINFO-HOME-CUR-CODE  TO  SAVE-HOME-CUR-CODE.

      *-------- DISPLAY CURRENCY CODE.
           IF INV-CURR-CODE NOT = SPACES
               MOVE INV-CURR-CODE             TO  DE1-CUR-CODE
           ELSE
               MOVE PO-CURRENCY-CODE          TO  DE1-CUR-CODE.

           IF DE1-CUR-CODE NOT = SPACES
               MOVE DE1-CUR-CODE              TO  BUILD-CC-VALUE
               MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC
               READ MVALIDUM-I INTO BUF-MVALIDUM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE  SPACES               TO  DE1-CUR-DESC
               ELSE
                   MOVE  VALID-CURRENCY-DESC  TO  DE1-CUR-DESC.

           PERFORM  65-INV-DESC  THRU  65-INV-DESC-X.

       6-FILLBUFF1-CONT.
           MOVE HEADER                  TO  VIEW-NFNAME.
       6-SHOWFORM1.

      *    MOVE 3                       TO  SRF-MODE.
           MOVE DE-BUFFER1              TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  DE-BUFFER1.
           MOVE "N"  TO  OVERRIDE-DATE-CHK-SW.
           IF VIEW-LASTKEY = 1
               PERFORM 61-DISPLAY-PAYMENT-TERMS  THRU  61-DPT-X
               GO TO 6-FILLBUFF1-CONT
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE "Y"  TO  OVERRIDE-DATE-CHK-SW
           ELSE
           IF VIEW-LASTKEY = 6
               GO TO  6-MODIFY-HEADER
           ELSE
           IF VIEW-LASTKEY = 3
               GO TO  6-MODIFY-HEADER-X.

           IF VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(4)
               GO TO  6-SHOWFORM1.

           IF DE1-INV-NUM = SPACES
      * INVOICE NUMBER IS REQUIRED
               MOVE 66098 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(4)
               GO TO 6-SHOWFORM1.

           IF DE1-INV-DATE  = SPACES
      * INVOICE DATE IS REQUIRED
               MOVE 66099 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(7)
               GO TO 6-SHOWFORM1.

9212CK*    IF DE1-INV-TERMS  = SPACES
  .   * INVOICE TERM IS REQUIRED
  .   *        MOVE 66100 TO CATREAD-MSG-NUMBER
  .   *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
  .   *        MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
  .   *        MOVE B"1" TO IND(99), IND(9)
9212CK*        GO TO 6-SHOWFORM1.

           IF DE1-VEN7  = SPACES
      * VENDOR CODE IS REQUIRED
               MOVE 66101 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(28)
               GO TO 6-SHOWFORM1.

       6-EDIT-DATA.
           ACCEPT YMD-DATE     FROM  DATE.
           IF YMD-YY > "70"
               MOVE "19"         TO  YMD-CC
           ELSE
               MOVE "20"         TO  YMD-CC.
           ADD +1  TO  YMD-DD-9.
           MOVE YMD-DATE-CN      TO  PLUS-1D-DATE-CN.
           SUBTRACT +1  FROM  YMD-DD-9.
           IF YMD-MM-9 < +7
               IF YMD-YY-9 = 0
                   MOVE 99       TO  YMD-YY-9
                   MOVE 19       TO  YMD-CC-9
               ELSE
                   SUBTRACT +1  FROM  YMD-YY-9
               END-IF
               ADD +12  TO  YMD-MM-9.
           SUBTRACT +6  FROM  YMD-MM-9.
           MOVE YMD-DATE-CN      TO  MINUS-6M-DATE-CN.

           MOVE 3                TO  DATE-MODE.
           MOVE DE1-INV-DATE     TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           IF DATE-RET-CODE  NOT = ZEROS
               MOVE DATE-MSG     TO  MESSAGE-BUFFER
               MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(7)
               GO TO 6-SHOWFORM1
           ELSE
               MOVE DATE-YMD-OUT TO  S-INVOICE-DATE
      *------------ ACCOUNT FOR CENTURY.
               IF S-INVOICE-YY > "70"
                   MOVE "19"     TO  S-INVOICE-CC
               ELSE
                   MOVE "20"     TO  S-INVOICE-CC.

           IF S-INVOICE-DATE-CN > MINUS-6M-DATE-CN  AND
              S-INVOICE-DATE-CN < PLUS-1D-DATE-CN
               NEXT SENTENCE
           ELSE
               IF OVERRIDE-DATE-CHK-SW = "Y"
                   NEXT SENTENCE
               ELSE
      *   ***  WARNING:  INVOICE DATE DOES NOT PASS DATE CHECK CRITERIA ***
                   MOVE  23 TO LANG-SETNUM
                   MOVE   6 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
                   MOVE B"1" TO IND(99), IND(7)
                   GO TO  6-SHOWFORM1.

9212CK*    IF CE9-CASH-DSCNT NOT = ZEROS
   .  *        IF DE1-TERMS-DUE-PCT NOT = "1"
   .  * *** YOU MUST ENTER A PAYMENT TERM OF 'NET' WHEN A DISC AMT WAS
   .  *            ENTERED ***
   .  *            MOVE  25 TO LANG-SETNUM
   .  *            MOVE   5 TO LANG-MSGNUM
   .  *            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
   .  *            MOVE MESSAGE-BUFFER TO IND(99), IND(9)
   .  *            GO TO 6-SHOWFORM1.
   .  *
   .  *    MOVE DE1-TERMS-DUE-PCT       TO  BUILD-TM-DISCOUNT-VALUE.
   .  *    MOVE BUILD-TM-DISCOUNT-KEY   TO  PLT-ARG.
   .  *    MOVE 0 TO COND-WORD.
   .  *    MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
   .  *    READ MPLTINFO-I INTO BUF-MPLTINFO
   .  *        INVALID KEY MOVE 17 TO COND-WORD.
   .  *    IF FILE-STATUS-1 = "2"
   .  *        MOVE 17 TO COND-WORD
   .  *    ELSE
   .  *    IF FILE-STATUS NOT = "00"
   .  *        MOVE 99 TO COND-WORD.
   .  *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
   .  *        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
   .  *    IF COND-WORD NOT = 0
   .  *        IF COND-WORD = 17
   .  *            "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
   .  *            MOVE   9 TO LANG-SETNUM
   .  *            MOVE   6 TO LANG-MSGNUM
   .  *            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
   .  *            MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
   .  *            MOVE B"1" TO IND(99), IND(9)
   .  *            GO TO 6-SHOWFORM1
   .  *        ELSE
   .  *            MOVE "GET MPLTINFO1 * 6-ED" TO BU-DISPLAY-MSG
   .  *            MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
   .  *            GO TO 2-BLOWUP.
   .  *
   .  *    MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG.
   .  *    MOVE 0 TO COND-WORD.
   .  *    MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
   .  *    READ MPLTINFO-I INTO BUF-MPLTINFO
   .  *        INVALID KEY MOVE 17 TO COND-WORD.
   .  *    IF FILE-STATUS-1 = "2"
   .  *        MOVE 17 TO COND-WORD
   .  *    ELSE
   .  *    IF FILE-STATUS NOT = "00"
   .  *        MOVE 99 TO COND-WORD.
   .  *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
   .  *        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
   .  *    IF COND-WORD NOT = 0
   .  *        IF COND-WORD = 17
   .  *            "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
   .  *            MOVE   9 TO LANG-SETNUM
   .  *            MOVE   6 TO LANG-MSGNUM
   .  *            PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
   .  *            MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
   .  *            MOVE B"1" TO IND(99), IND(9)
   .  *            GO TO 6-SHOWFORM1
   .  *        ELSE
   .  *            MOVE "GET MPLTINFO2 * 61-ED" TO BU-DISPLAY-MSG
   .  *            MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
9212CK*            GO TO 2-BLOWUP.


           IF INV-NO = DE1-INV-NUM AND
              INV-VEN-CODE = DE1-VEN-CODE
               MOVE "N"  TO  INV-CHG-SW
           ELSE
               PERFORM 61-CHECK-DUP-INV  THRU  61-CDI-X
               IF ERR-SW = "Y"
                   GO TO 6-SHOWFORM1
               ELSE
                   MOVE "Y"  TO  INV-CHG-SW.

           MOVE DE1-VEN-CODE     TO  VEN-ARG.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-I-REC.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-I-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING  BASE,
      *                         DSET-DVENDOR,
      *                         MODE1,
      *                         STATUS-AREA,
      *                         VEN-KEY-NAME,
      *                         VEN-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
                   MOVE "DBFIND DVENDOR*6-MH"  TO  BU-DISPLAY-MSG
                   MOVE VEN-ARG  TO  BU-DISPLAY-FLD (2)
                   GO TO  2-BLOWUP.

           IF COND-WORD = 17
               IF DE1-VEN-CODE = SAVE-NEW-VENDOR-CODE
                   NEXT SENTENCE
               ELSE
                   MOVE DE1-VEN-CODE   TO  SAVE-NEW-VENDOR-CODE
      *            *** VENDOR CODE DOES NOT EXIST ***
                   MOVE  22 TO LANG-SETNUM
                   MOVE   3 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
                   MOVE B"1" TO IND(99), IND(28)
                   GO TO  6-SHOWFORM1.

      *--------- EDIT CURRENCY CODE.
           IF DE1-CUR-CODE = PO-CURRENCY-CODE
               MOVE SPACES         TO INV-CURR-CODE
               GO TO 6-UPDATE-DINVRCD.
           IF DE1-CUR-CODE = SPACES
               MOVE "CURRENCY CODE MUST BE ENTERED"
                                   TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(29)
               GO TO  6-SHOWFORM1.
           IF DE1-CUR-CODE NOT =  SAVE-HOME-CUR-CODE
               MOVE "INVOICE CURRENCY CODE MUST BE THE HOME CURRENCY IF
      -             "DIFFERENT THAN PO CURRENCY"
                                   TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(29)
               GO TO  6-SHOWFORM1.
           IF DE1-NO-CHECK-INDIC = SPACES
               MOVE "SINCE INVOICE CURRENCY CODE DIFFERENT THAN PO, MUST
      -             " BE A NO-CHECK INVOICE"
                                   TO DE1-MSG-LINE
               MOVE B"1" TO IND(99), IND(34)
               GO TO  6-SHOWFORM1.

           IF DE1-CUR-CODE NOT = SPACES
               MOVE DE1-CUR-CODE              TO  BUILD-CC-VALUE
               MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC
               READ MVALIDUM-I INTO BUF-MVALIDUM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS NOT = "00"
                   MOVE  09 TO LANG-SETNUM
                   MOVE 107 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
                   MOVE B"1" TO IND(99), IND(29)
               ELSE
                   MOVE  VALID-CURRENCY-DESC  TO  DE1-CUR-DESC.

       6-UPDATE-DINVRCD.
           MOVE DE1-INV-NUM             TO  INV-NO.
9212CK*    MOVE DE1-INV-TERMS           TO  INV-TERMS,
           MOVE DE1-INV-TERMS           TO  SINVDUED-INV-TERMS.
           IF DE1-CUR-CODE NOT = PO-CURRENCY-CODE
               MOVE DE1-CUR-CODE        TO  INV-CURR-CODE
           ELSE
               MOVE SPACES              TO  INV-CURR-CODE.
           MOVE S-INVOICE-DATE-CN       TO  INV-DATE-CN.
           MOVE S-INVOICE-DATE          TO  SINVDUED-INV-DATE.
      **********************************
      * CALL 'SINVDUED' TO CALCULATE
      * DUE DATE
      **********************************
           CALL "SINVDUED" USING BASE,
                                 SINVDUED-PARMS,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           MOVE SINVDUED-DUE-DATE       TO  INV-DUE-DATE.
      *------- ACCOUNT FOR CENTURY.
           IF INV-DUE-DATE (1:2) > "70"
               MOVE "19"     TO  INV-DUE-CC
           ELSE
               MOVE "20"     TO  INV-DUE-CC.


           IF INV-STATUS = "P"
               MOVE "M"  TO  INV-STATUS
           ELSE
               IF INV-STATUS = "1"
                   MOVE "C"  TO  INV-STATUS.


           IF VEN-ARG = INV-VEN-CODE
               NEXT SENTENCE
           ELSE
               MOVE VEN-ARG  TO  INV-VEN-CODE
               MOVE "Y"      TO  VEN-CHG-SW.

           MOVE DE1-NO-CHECK-INDIC   TO  INV-NO-CHECK-INDIC.


           CALL "TFLAGMAN" USING BASE,
                                 ARGUMENT-VALUES,
                                 BUF-DINVRCD.

           PERFORM  67-UPDT-INV-DESC  THRU  67-UPDT-INV-DESC-X.

      *    MOVE 1              TO  NUMBER-OF-DSETS-LOCKED.
      *    MOVE DSET-DINVRCD   TO  DSET-NAME-1.
      *    MOVE REG-KEY-NAME   TO  ITEM-LIST-1.
      *    MOVE REGISTER-ARG   TO  LOCK-VALUE-1.
      *    CALL "DBLOCK" USING  BASE,
      *                         MULTI-LOCK,
      *                         MODE5,
      *                         STATUS-AREA.
      *    IF COND-WORD NOT = ZERO
      *        MOVE "DBLOCK DINVRCD*6-UD"  TO  BU-DISPLAY-MSG
      *        MOVE REGISTER-ARG  TO  BU-DISPLAY-FLD (2)
      *        GO TO  2-BLOWUP.
      *
      *    IF VEN-CHG-SW = "Y"  OR
      *       INV-CHG-SW = "Y"
      *        CALL "DBDELETE" USING  BASE,
      *                               DSET-DINVRCD,
      *                               MODE1,
      *                               STATUS-AREA,
      *        IF COND-WORD NOT = ZERO
      *            MOVE "DBDELETE DINVRCD*6-UD"  TO  BU-DISPLAY-MSG
      *            GO TO  2-BLOWUP
      *        ELSE
      *            CALL "DBPUT" USING  BASE,
      *                                DSET-DINVRCD,
      *                                MODE1,
      *                                STATUS-AREA,
      *                                ALL-ITEMS,
      *                                BUF-DINVRCD,
      *            IF COND-WORD NOT = ZERO
      *                MOVE "DBPUT DINVRCD*6-UD"  TO  BU-DISPLAY-MSG
      *                GO TO  2-BLOWUP
      *            ELSE
      *                NEXT SENTENCE
      *    ELSE
      *        CALL "DBUPDATE" USING  BASE,
      *                               DSET-DINVRCD,
      *                               MODE1,
      *                               STATUS-AREA,
      *                               ALL-ITEMS,
      *                               BUF-DINVRCD,
      *        IF COND-WORD NOT = ZERO
      *            MOVE "DBUPDATE DINVRCD*6-UD"  TO  BU-DISPLAY-MSG
      *            GO TO  2-BLOWUP.
      *
      *    CALL "DBUNLOCK" USING  BASE,
      *                           MULTI-LOCK,
      *                           MODE1,
      *                           STATUS-AREA.
      *    IF COND-WORD NOT = ZERO
      *        MOVE "DBUNLOCK DINVRCD*6-UD"  TO  BU-DISPLAY-MSG
      *        GO TO  2-BLOWUP.
      *
      *    CALL "DBEND" USING BASE, DB-LOG-TEXT, MODE1,
      *        STATUS-AREA, DB-LOG-TEXT-LEN.
      *    IF COND-WORD NOT = 0
      *        MOVE "DBEND FAILED 6-UD" TO BU-DISPLAY-MSG
      *        MOVE REGISTER-ARG         TO BU-DISPLAY-FLD (2)
      *        GO TO 2-BLOWUP.

       6-MODIFY-HEADER-X.
           EXIT.

       61-GET-TERMS-DESC.
           MOVE INV-DUE-PCT           TO  BUILD-TM-DISCOUNT-VALUE.
           MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
                   MOVE "GET MPLTINFO1 * 61-GTD" TO BU-DISPLAY-MSG
                   MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
                   GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-DISC-AMNT-DESC TO DE1-PO-TERMS-PERCENT.

           MOVE INV-DUE-CODE          TO  BUILD-TM-DATE-VALUE.
           MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
      *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
      *        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   NEXT SENTENCE
               ELSE
                   MOVE "GET MPLTINFO2 * 61-GPT" TO BU-DISPLAY-MSG
                   MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
                   GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-TMD-DESC       TO DE1-PO-TERMS-DUE.

       61-GTD-X.
           EXIT.

       61-DISPLAY-PAYMENT-TERMS.
           MOVE INVTERMS  TO  VIEW-NFNAME.
       61-SHOWFORM2A.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
       61-DPT-X.
           EXIT.

       61-CHECK-DUP-INV.
           MOVE SPACES         TO  ERR-SW.
           IF S-INVOICE-NO  =  DE1-INV-NUM
               GO TO 61-CDI-X.

           MOVE DE1-INV-NUM         TO  S-INVOICE-NO.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DINVRCD-I-REC.
           START DINVRCD-I KEY = PORCVNO OF DINVRCD-I-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING  BASE,
      *                         DSET-DINVRCD,
      *                         MODE1,
      *                         STATUS-AREA,
      *                         PO-KEY-NAME,
      *                         PO-ARG.
           IF COND-WORD NOT = ZERO
               MOVE "DBFIND DPORECD*61-CDI"  TO  BU-DISPLAY-MSG
               GO TO  2-BLOWUP.

       61-GET-DINVRCD.
           MOVE 0 TO COND-WORD.
           READ DINVRCD-I NEXT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DINVRCD-I-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING  BASE,
      *                        DSET-DINVRCD,
      *                        MODE5,
      *                        STATUS-AREA,
      *                        ALL-ITEMS,
      *                        BUF-DINVRCD,
      *                        PO-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 15
                   GO TO 61-UNLOCK-CURRENT-RECORD
               ELSE
                   MOVE "GET DINVRCD *61-GD"  TO  BU-DISPLAY-MSG
                   MOVE PO-ARG   TO  BU-DISPLAY-FLD (2)
                   GO TO 2-BLOWUP.

      *------- ADDED CHECK FOR VENDOR CODE.
           IF DE1-INV-NUM  =  INVOICENO OF DINVRCD-I-REC AND
              DE1-VEN-CODE = VENCDE OF DINVRCD-I-REC
                   MOVE "Y"      TO  ERR-SW
      * *** WARNING - DUP INVOICE NO. EXISTS FOR THIS PO; 'ENTER'
      *     TO PROCEED ***
                   MOVE  23 TO LANG-SETNUM
                   MOVE   7 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE1-MSG-LINE
                   MOVE B"1" TO IND(99), IND(4)
           ELSE
               GO TO 61-GET-DINVRCD.

       61-UNLOCK-CURRENT-RECORD.
           MOVE HIGH-VALUES TO PORCVNO OF DINVRCD-I-REC.
           START DINVRCD-I KEY = PORCVNO OF DINVRCD-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    CALL "DBFIND" USING  BASE,
      *                         DSET-DINVRCD,
      *                         MODE1,
      *                         STATUS-AREA,
      *                         REG-KEY-NAME,
      *                         REGISTER-ARG.
      *    IF COND-WORD NOT = ZERO
      *        MOVE "DBFIND DINVRCD*61-RCI"  TO  BU-DISPLAY-MSG
      *        GO TO  2-BLOWUP.
      *
      *    CALL "DBGET" USING  BASE,
      *                        DSET-DINVRCD,
      *                        MODE5,
      *                        STATUS-AREA,
      *                        ALL-ITEMS,
      *                        BUF-DINVRCD,
      *                        REGISTER-ARG.
      *    IF COND-WORD NOT = ZERO
      *        MOVE "DBGET5 DINVRCD*61-RCI"  TO  BU-DISPLAY-MSG
      *        GO TO  2-BLOWUP.

       61-CDI-X.
           EXIT.


       65-INV-DESC.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-I-REC.
           MOVE "000099" TO ITEMSEQNO OF DPODATAITM-I-REC.
           START DPODATAITM-I
              KEY IS EQUAL TO EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
      *    CALL "DBFIND" USING  BASE,
      *                         DSET-DPODATAITM,
      *                         MODE1,
      *                         STATUS-AREA,
      *                         PO-KEY-NAME,
      *                         PO-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 17
                   GO TO 65-INV-DESC-X
               ELSE
                   MOVE "DBFIND DPODATAITM*65-ID"  TO  BU-DISPLAY-MSG
                   MOVE PO-ARG  TO  BU-DISPLAY-FLD (2)
                   GO TO  2-BLOWUP.

       65-GET-DPODATAITM.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-I NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
      *    CALL "DBGET" USING  BASE,
      *                        DSET-DPODATAITM,
      *                        MODE5,
      *                        STATUS-AREA,
      *                        ALL-ITEMS,
      *                        BUF-DPODATAITM,
      *                        PO-ARG.
           IF COND-WORD NOT = ZERO
               IF COND-WORD = 15
                   GO TO  65-INV-DESC-X
               ELSE
                   MOVE "DBGET5 DPODATAITM*65-GD"  TO  BU-DISPLAY-MSG
                   MOVE PO-ARG  TO  BU-DISPLAY-FLD (2)
                   GO TO  2-BLOWUP.

      *    IF DATAITM-ITEM-NO = ZERO  AND  DATAITM-LINE-NO = "99"
           MOVE DATAITM-INFO  TO  DE1-INV-DESC .
      *    ELSE
      *    IF DATAITM-ITEM-NO > ZERO
      *        GO TO  65-INV-DESC-X
      *    ELSE
      *        GO TO  65-GET-DPODATAITM.

       65-INV-DESC-X.
           EXIT.




       67-UPDT-INV-DESC.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-O-REC.
           MOVE "000099" TO ITEMSEQNO OF DPODATAITM-O-REC.
           START DPODATAITM-O
              KEY IS EQUAL TO EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF COND-WORD = 0
      *------------- INSERTED READ SINCE REWRITE BELOW WAS NOT WORKING
      *------------- IF THE "99" RECORD DID EXIST.
               READ DPODATAITM-O INTO BUF-DPODATAITM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               MOVE DE1-INV-DESC  TO  DATAITM-INFO
               MOVE 0 TO COND-WORD
               REWRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
                   INVALID KEY MOVE 99 TO COND-WORD
               END-REWRITE
           ELSE
           IF COND-WORD = 17
             IF DE1-INV-DESC NOT = SPACES
               MOVE SPACE         TO  BUF-DPODATAITM
               MOVE PO-ARG        TO  DATAITM-PO-RCV-NO
               MOVE ZERO          TO  DATAITM-ITEM-NO
               MOVE "99"          TO  DATAITM-LINE-NO
               MOVE DE1-INV-DESC  TO  DATAITM-INFO
               MOVE 0             TO  COND-WORD
               WRITE DPODATAITM-O-REC FROM BUF-DPODATAITM
                   INVALID KEY MOVE 99 TO COND-WORD
             ELSE
               GO TO 67-UPDT-INV-DESC-X.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = ZERO
               MOVE "DPODATAITM*67-UID"
                             TO  BU-DISPLAY-MSG
               MOVE PO-ARG  TO  BU-DISPLAY-FLD (2)
               GO TO  2-BLOWUP.

       67-UPDT-INV-DESC-X.
           EXIT.
       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
