       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TINVMAN.
       AUTHOR.       K. MOVSESIAN.
       INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
       DATE-WRITTEN.  NOV. 21, 1984.

      *REMARKS.       INVOICE MANIFEST SELECTION (ONLINE FRONT-END).

      **************************************************************
      *                                                            *
      *    T I N V M A N                                           *
      *                                                            *
      *      THIS PROGRAM IS THE ONLINE FRONT-END PROGRAM FOR      *
      *      INVOICE MANIFESTING.  THE USER HAS FOUR OPTIONS       *
      *        1) 'NEW'  - CREATE A NEW MANIFEST                   *
      *        2) 'REPR' - REPROCESS THE CURRENT MANIFEST GROUP    *
      *        3) 'RLSE' - RELEASE THE CURRENT MANIFEST FILE       *
      *        4) 'DLET' - DELETE THE CURRENT MANIFEST FILE        *
      *                                                            *
      *      ONCE THE SELECTION IS MADE A JOB STREAM IS CREATED    *
      *      AND LAUNCHED BASED ON THE SELECTION.                  *
      *                                                            *
      *      FILE DEFINITIONS (INPUTS/OUTPUTS)                     *
      *        1) BXMANTOP     - PERMANENT FILE THAT IS THE TOP    *
      *           PORTION OF THE MANIFEST PROCESSING JOB           *
      *        2) BXMANBOT     - PERMANENT FILE THAT IS THE BOTTOM *
      *           PORTION OF THE MANIFEST PROCESSING JOB STREAM    *
      *        3) BXMANJOB     - TEMPORARY JOB STREAM FILE THAT    *
      *           IS CREATED USING 'BXMANTOP', 'BXMANBOT', AND     *
      *           THE SELECTION MADE BY THE USER.                  *
      *                                                            *
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.

       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MANIFEST-CREATE-BEGIN-FILE
                  ASSIGN TO DATABASE-BXMANTOP.

           SELECT MANIFEST-CREATE-END-FILE
                  ASSIGN TO DATABASE-BXMANBOT.

           SELECT MANIFEST-CREATE-JOB-FILE
                  ASSIGN TO DATABASE-BXMANJOB.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZINVMAN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZINVMAN.

       FD  MANIFEST-CREATE-BEGIN-FILE
           RECORD CONTAINS 90 CHARACTERS
           DATA RECORD IS MANIFEST-BEGIN-RCD.
       01  MANIFEST-BEGIN-RCD.
           05  FILLER                    PIC X(90).

       FD  MANIFEST-CREATE-END-FILE
           RECORD CONTAINS 90 CHARACTERS
           DATA RECORD IS MANIFEST-END-RCD.
       01  MANIFEST-END-RCD.
           05  FILLER                    PIC X(90).

       FD  MANIFEST-CREATE-JOB-FILE
           RECORD CONTAINS 90 CHARACTERS
           DATA RECORD IS MANIFEST-CREATE-JOB-RCD.
       01  MANIFEST-CREATE-JOB-RCD.
           05  FILLER                    PIC X(12).
           05  MANIFEST-OPTION-ENTRY     PIC X(4).
           05  FILLER                    PIC X(74).


       WORKING-STORAGE SECTION.

       77  READ-CTR                  PIC S9(4)  COMP-4  VALUE ZEROS.

       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X        VALUE SPACE.
           05  FILE-STATUS-2         PIC X        VALUE SPACE.

       01  KSAM-KEY-VALUE.
           05  KS-EMPLOYEE-ID        PIC X(4)     VALUE SPACE.

       01  PGM-FUNCTION              PIC X        VALUE SPACE.

       01  SAVE-REPORT-1-TITLE       PIC X(30)    VALUE SPACES.
       01  SAVE-REPORT-2-TITLE       PIC X(30)    VALUE SPACES.

       01  BUILD-REPORT-SEL.
           05  REPORT-1              PIC X   VALUE SPACES.
           05  REPORT-2              PIC X   VALUE SPACES.

       COPY CCHKOBJ  IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY CDLTFILE IN COPYLIB.
       01  COMMAND-AREA.
           05  QCMDEXC-BXMANTOP.
               10  OVRDBF-BXMANTOP    PIC X(60) VALUE
           "OVRDBF FILE(BXMANTOP) TOFILE(*LIBL/QJOBSRC) MBR(BXMANTOP)".
               10  DBF-BXMANTOP-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 60.
           05  QCMDEXC-BXMANBOT.
               10  OVRDBF-BXMANBOT    PIC X(60) VALUE
           "OVRDBF FILE(BXMANBOT) TOFILE(*LIBL/QJOBSRC) MBR(BXMANBOT)".
               10  DBF-BXMANBOT-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 60.
           05  QCMDEXC-BXMANJOB.
               10  OVRDBF-BXMANJOB    PIC X(60) VALUE
           "OVRDBF FILE(BXMANJOB) TOFILE(*LIBL/QJOBSRC) MBR(BXMANJOB)".
               10  DBF-BXMANJOB-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 60.
               10  CRTSRCF-BXMANJOB   PIC X(34) VALUE
               "ADDPFM FILE(QJOBSRC) MBR(BXMANJOB)".
               10  CRT-BXMANJOB-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 34.
               10  STRDBRDR-BXMANJOB.
                   15  FILLER         PIC X(36)
                        VALUE "STRDBRDR FILE(QJOBSRC) MBR(BXMANJOB)".
                   15  FILLER         PIC X(07)
                        VALUE " RDR(IM".
                   15  STRDBRDR-TIME  PIC X(08).
                   15  FILLER         PIC X(01)
                        VALUE ")".
               10  DBR-BXMANJOB-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 52.
               10  RMVM-BXMANJOB  PIC X(32) VALUE
               "RMVM FILE(QJOBSRC) MBR(BXMANJOB)".
               10  RMVM-BXMANJOB-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 32.
      *************************************************************
      **                                                         **
      **                  S W I T C H   A R E A                  **
      **                                                         **
      *************************************************************

       01  SWITCHES.
           05  FATAL-ERR-SW          PIC X        VALUE "N".
           05  OPENTERM-ERROR        PIC X        VALUE "N".
           05  EOJ-SW                PIC X        VALUE "N".
           05  ERR-SW                PIC X        VALUE "N".

       COPY VCOMAREA IN COPYLIB.

       01  SAVE-VIEW-LASTKEY         PIC S9(4)    VALUE ZERO  COMP.
       01  FIELD-NUMBER              PIC S9(4)    VALUE ZERO  COMP.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.

      *************************************************************
      **                                                         **
      **      S C R E E N   P R I N T   P A R A M E T E R S      **
      **                                                         **
      *************************************************************

       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL             PIC S9(4)    VALUE ZERO  COMP.
           05  PAGE-CTL              PIC S9(4)    VALUE 49    COMP.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".

       01  PASS-SPOOL-PRT-NO         PIC S9(2)    VALUE ZERO  COMP.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  SCREEN-1.
           05  DISP-MAN-NO            PIC X(3).
           05  DE-MONTH-OVERRIDE      PIC X.
           05  DISP-MAN-STATUS        PIC X(4).
           05  DISP-MAN-DATE          PIC X(8).
           05  DISP-MAN-AMT           PIC -(11)9.99.
           05  DISP-REC-TOTAL         PIC Z(5)9.
           05  DISP-INVOICE-TOTAL     PIC Z(3)9.
           05  DISP-MAN-ID            PIC X(4).
           05  DE-SEL-RPT1            PIC X.
           05  DISP-RPT1-DESC         PIC X(30).
           05  DE-SEL-RPT2            PIC X.
           05  DISP-RPT2-DESC         PIC X(30).
           05  DISP-MSG1              PIC X(51).
           05  DE-MSG-REPLY           PIC X.
           05  DISP-MSG2              PIC X(18).
           05  DE-CMDLINE             PIC X(79).
           05  DE-MSGLINE             PIC X(79).


      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DATAB IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-NAME             PIC X(16)    VALUE SPACE.
           05  DSET-MPLTINFO         PIC X(16)    VALUE "MPLTINFO;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS             PIC X(2)     VALUE "@;".

       01  ARGUMENT-VALUES.
           05  PLT-ARG               PIC X(4)     VALUE SPACE.


       01  PREV-FILE-NOT-SENT-MSG.
           05  FILLER  PIC X(43) VALUE SPACES.
           05  MAN-OPTION-NOT-SENT  PIC X(4) VALUE SPACES.
           05  FILLER  PIC X(25) VALUE SPACES.

       01  PREV-FILE-SEND-FAILED-MSG.
           05  FILLER  PIC X(45) VALUE SPACES.
           05  MAN-OPTION-SEND-FAIL  PIC X(4) VALUE SPACES.
           05  FILLER  PIC X(24) VALUE SPACES.

       01  PROCESS-MSG.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  PROCESS-OPTION-MSG  PIC X(4) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  PROCESS-MAN-NO  PIC X(3)  VALUE SPACES.
           05  FILLER  PIC X(15) VALUE SPACES.

       01  PROCESS-MSG2.
           05  FILLER  PIC X(18) VALUE SPACES.

       01  MANIFEST-OPTION            PIC 9(1) VALUE ZEROS.
           88  NEW-OPTION                      VALUE 1.
           88  REPR-OPTION                     VALUE 2.
           88  RLSE-OPTION                     VALUE 3.
           88  DLET-OPTION                     VALUE 4.

       01  STREAM-COMMAND.
           05  FILLER  PIC X(7)  VALUE "STREAM ".
           05  FILLER  PIC X(8)  VALUE "BXMANJOB".

       01  BUILD-COMMAND.
           05  FILLER  PIC X(6)  VALUE "BUILD ".
           05  FILLER  PIC X(8)  VALUE "MNACTIVE".

       01  PURGE-COMMAND.
           05  FILLER  PIC X(6)  VALUE "PURGE ".
           05  FILLER  PIC X(8)  VALUE "MNACTIVE".

       01  LISTF-STACTIVE-COMMAND.
           05  FILLER  PIC X(6)  VALUE "LISTF ".
           05  FILLER  PIC X(8)  VALUE "STACTIVE".

       01  BUILD-STACTIVE-COMMAND.
           05  FILLER  PIC X(6)  VALUE "BUILD ".
           05  FILLER  PIC X(8)  VALUE "STACTIVE".

       01  PURGE-STACTIVE-COMMAND.
           05  FILLER  PIC X(6)  VALUE "PURGE ".
           05  FILLER  PIC X(8)  VALUE "STACTIVE".


       01  DATES-AND-TIMES.
           05  CUR-DATE.
               10  YY               PIC XX.
               10  MM               PIC XX.
               10  DD               PIC XX.

       COPY TDATECHK IN COPYLIB.

       01  MANIFEST-MM-BUILD.
           05  MAN-MM-1-DIG         PIC X.
           05  MAN-MM-2-DIG         PIC X.

       01  BUILD-MANIFEST-NO.
           05  BUILD-MANIFEST-FIRST-DIG  PIC X.
           05  BUILD-MANIFEST-SEQ-CTR    PIC 99.


      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       COPY CATREAD  IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       PROCEDURE DIVISION.
       PROC-DIV SECTION 01.
       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-HSK-X.

           IF  EOJ-SW = "N"
               PERFORM 6-MAIN THRU 6-MAIN-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.


       1-HSK.

      ****************************************************
      *                                                  *
      *    CALL THE PASSWORD ENTRY SUBROUTINE 'TINVPASS' *
      *    IF VIEW-LASTKEY IS EQUAL TO '8' THEN THE USER *
      *    WAS UNSUCCESSFUL AT KEYING THEIR CORRECT      *
      *    UNEXPIRED 'USER ID' AND 'PASSWORD'            *
      *                                                  *
      ****************************************************

           MOVE "I"  TO  PGM-FUNCTION.

           CALL "TINVPASS" USING KSAM-KEY-VALUE,
                                 PGM-FUNCTION,
                                 SCREEN-PRINT-PARMS,
                                 PASS-SPOOL-PRT-NO,
                                 VIEW-COMAREA,
                                 LANGUAGE-PARMS.
           IF VIEW-LASTKEY = 3
               MOVE "Y"  TO  EOJ-SW
               GO TO 1-HSK-X.


           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MPLTINFO-I.

      **************************************************************
      *                                                            *
      *    USING THE SEARCH KEY 'IMRn' WHERE 'n' IS THE REPORT NO. *
      *    GET THE TITLES OF THE SPECIAL REPORTS THAT A USER CAN   *
      *    SELECT WHEN DOING A RELEASE.  THESE REPORTS ARE NOT     *
      *    HP CREATED REPORTS BUT REPORTS CREATED BY A PLANTS      *
      *    LOCAL ACCOUNTING SYSTEM. ALL WE ARE DOING IS PASSING AN *
      *    INDICATOR IN THE STORES FILE 'MANSTFL1'. THESE          *
      *    INDICATORS CAN BE FOUND IN THE HEADER RECORD ID '0'     *
      *    OF THE STORES FILE 'MANSTFL1'                           *
      *                                                            *
      **************************************************************


           MOVE "IMR1"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES  TO  SAVE-REPORT-1-TITLE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 1-HSK"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG  TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-DATA  TO  SAVE-REPORT-1-TITLE.


           MOVE "IMR2"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES  TO  SAVE-REPORT-2-TITLE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 1-HSK"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG  TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-DATA  TO  SAVE-REPORT-2-TITLE.

      **************************************************************
      *                                                            *
      *    GET INFORMATION ON THE LAST MANIFEST TRANSACTION FROM   *
      *    FROM MPLTINFO USING 'PMAN' AS THE KEY. THIS INFO. WILL  *
      *    WILL BE DISPLAY ON THE SCREEN FOR THE USER              *
      *                                                            *
      **************************************************************

           MOVE "PMAN"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 1-HSK"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                      TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
      *    *** PREVIOUS FILE NOT SENT CANNOT PROCESS A ¢    !
      *    MANIFEST TRANSACTION ***
           MOVE  16 TO LANG-SETNUM.
           MOVE 106 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PREV-FILE-NOT-SENT-MSG.
      *    *** PREVIOUS FILES SEND FAILED CANNOT PROCESS A ¢    !
      *    MANIFEST TRANSACTION ***
           MOVE  16 TO LANG-SETNUM.
           MOVE 107 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PREV-FILE-SEND-FAILED-MSG.
      *    *** PROCESS ¢    ! MANIFEST NUMBER ¢    ! ENTER (Y/N) ***
           MOVE  16 TO LANG-SETNUM.
           MOVE 108 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PROCESS-MSG.
      *    *** THEN PRESS 'enter' ***
           MOVE  20 TO LANG-SETNUM.
           MOVE   9 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PROCESS-MSG2.
       1-HSK-X.
           EXIT.


       2-EOJ.
           IF EOJ-SW  NOT = "Y"
               CLOSE DISPLAY-FILE, MPLTINFO-I.

       2-EOJ-X.
           EXIT.


       2-BLOWUP.
           MOVE "TINVMAN"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.


       6-MAIN.
           PERFORM 61-SELECTION-ROUTINE  THRU  61-SR-X.
           IF EOJ-SW = "Y"
               MOVE "N"  TO  EOJ-SW
               GO TO 6-MAIN-X.

           PERFORM 62-CREATE-LAUNCH-JOB-STREAM  THRU  62-CLJS-X.

       6-MAIN-X.
           EXIT.

       61-SELECTION-ROUTINE.
           MOVE "INVMAN1" TO  VIEW-NFNAME.

           MOVE SPACES  TO  SCREEN-1.
           MOVE MPLTINFO-MAN-NO       TO  DISP-MAN-NO.
           MOVE MPLTINFO-MAN-STATUS   TO  DISP-MAN-STATUS.
           MOVE 4                     TO  DATE-MODE.
           MOVE MPLTINFO-MAN-DATE     TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT        TO  DISP-MAN-DATE.
           MOVE MPLTINFO-MAN-TOTAL    TO  DISP-MAN-AMT.
           MOVE MPLTINFO-RECORD-CTR   TO  DISP-REC-TOTAL.
           MOVE MPLTINFO-INVOICE-CTR  TO  DISP-INVOICE-TOTAL.
           MOVE MPLTINFO-MAN-ID       TO  DISP-MAN-ID.
           MOVE SAVE-REPORT-1-TITLE   TO  DISP-RPT1-DESC.
           MOVE SAVE-REPORT-2-TITLE   TO  DISP-RPT2-DESC.

       61-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC  TO  SCREEN-1.
           IF VIEW-LASTKEY = 1
               MOVE 1              TO  MANIFEST-OPTION
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE 2              TO  MANIFEST-OPTION
           ELSE
           IF VIEW-LASTKEY = 5
               MOVE 3              TO  MANIFEST-OPTION
           ELSE
           IF VIEW-LASTKEY = 4
               MOVE 4              TO  MANIFEST-OPTION
           ELSE
           IF VIEW-LASTKEY = 3
               MOVE "Y"               TO  EOJ-SW
               GO TO  61-SR-X
           ELSE
           IF VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
               MOVE 4  TO  FIELD-NUMBER
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               GO TO  61-SHOWFORM-SCREEN-1
           ELSE
               MOVE 4  TO  FIELD-NUMBER
      *      ***  SELECT THE APPROPRIATE  'FUNCTION KEY'  ***
               MOVE  19 TO LANG-SETNUM
               MOVE  13 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               GO TO  61-SHOWFORM-SCREEN-1.

           IF DE-MONTH-OVERRIDE = "X"
               IF NEW-OPTION
                   NEXT SENTENCE
               ELSE
      * *** MONTH OVERRIDE OPTION IS ONLY AVAILABLE FOR 'NEW' MANIFESTS ***
                   MOVE  13 TO LANG-SETNUM
                   MOVE  27 TO LANG-MSGNUM
                   MOVE 4  TO  FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   GO TO 61-SHOWFORM-SCREEN-1.

           IF DE-SEL-RPT1 = "X" OR
              DE-SEL-RPT2 = "X"
               IF RLSE-OPTION
                   NEXT SENTENCE
               ELSE
      * ***  REPORT SELECTION IS AVAILABLE ONLY WHEN DOING A 'RLSE' ***
                   MOVE  18 TO LANG-SETNUM
                   MOVE  32 TO LANG-MSGNUM
                   MOVE 12  TO  FIELD-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   GO TO 61-SHOWFORM-SCREEN-1.

           IF MPLTINFO-SEND-STATUS = "1"
               MOVE 4                 TO  FIELD-NUMBER
               IF NEW-OPTION
                 MOVE "NEW"           TO MAN-OPTION-NOT-SENT
                 MOVE PREV-FILE-NOT-SENT-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF REPR-OPTION
                 MOVE "REPR"          TO  MAN-OPTION-NOT-SENT
                 MOVE PREV-FILE-NOT-SENT-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF RLSE-OPTION
                 MOVE "RLSE"          TO  MAN-OPTION-NOT-SENT
                 MOVE PREV-FILE-NOT-SENT-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF DLET-OPTION
                 MOVE "DLET"          TO  MAN-OPTION-NOT-SENT
                 MOVE PREV-FILE-NOT-SENT-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1.

           IF MPLTINFO-SEND-STATUS = "2"
               MOVE 4                 TO  FIELD-NUMBER
               IF NEW-OPTION
                 MOVE "NEW"           TO MAN-OPTION-SEND-FAIL
                 MOVE PREV-FILE-SEND-FAILED-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF REPR-OPTION
                 MOVE "REPR"          TO  MAN-OPTION-SEND-FAIL
                 MOVE PREV-FILE-SEND-FAILED-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF RLSE-OPTION
                 MOVE "RLSE"          TO  MAN-OPTION-SEND-FAIL
                 MOVE PREV-FILE-SEND-FAILED-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1
               ELSE
               IF DLET-OPTION
                 MOVE "DLET"          TO  MAN-OPTION-SEND-FAIL
                 MOVE PREV-FILE-SEND-FAILED-MSG  TO  MESSAGE-BUFFER
                 PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                 GO TO 61-SHOWFORM-SCREEN-1.


       61-EDIT-SELECTION.
           MOVE "N"  TO  ERR-SW.
           IF NEW-OPTION
               PERFORM 612-EDIT-NEW-OPTION  THRU  612-ENO-X
           ELSE
           IF REPR-OPTION
               PERFORM 613-EDIT-REPR-OPTION  THRU  613-ERO-X
           ELSE
           IF RLSE-OPTION
               PERFORM 614-EDIT-RLSE-OPTION  THRU  614-ERO-X
           ELSE
           IF DLET-OPTION
               PERFORM 615-EDIT-DLET-OPTION  THRU  615-EDO-X.
           IF ERR-SW = "Y"
               GO TO 61-SHOWFORM-SCREEN-1.

           PERFORM 611-BUILD-MNACTIVE  THRU  611-BUILD-MNACTIVE-X.
           IF ERR-SW = "Y"
               GO TO 61-SHOWFORM-SCREEN-1.

           IF RLSE-OPTION
               PERFORM 611-BUILD-STACTIVE  THRU  611-BUILD-STACTIVE-X
               IF ERR-SW = "Y"
                   GO TO 61-SHOWFORM-SCREEN-1.

       61-VERIFY-REQUEST.
           MOVE "INVMAN1B" TO  VIEW-NFNAME.

           IF NEW-OPTION
               PERFORM 616-ASSIGN-MANIFEST-NUM  THRU  616-AMN-X
               MOVE BUILD-MANIFEST-NO   TO  PROCESS-MAN-NO
           ELSE
               MOVE MPLTINFO-MAN-NO     TO  PROCESS-MAN-NO.
           IF NEW-OPTION
               MOVE "NEW"               TO  PROCESS-OPTION-MSG
           ELSE
           IF REPR-OPTION
               MOVE "REPR"              TO  PROCESS-OPTION-MSG
           ELSE
           IF RLSE-OPTION
               MOVE "RLSE"              TO  PROCESS-OPTION-MSG
           ELSE
           IF DLET-OPTION
               MOVE "DLET"              TO  PROCESS-OPTION-MSG.
           MOVE PROCESS-MSG             TO  DISP-MSG1.
           MOVE PROCESS-MSG2            TO  DISP-MSG2.

       61-SHOWFORM-SCREEN-1B.
           MOVE SCREEN-1    TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC TO SCREEN-1.
           IF VIEW-LASTKEY = 1  OR
              VIEW-LASTKEY = 2  OR
              VIEW-LASTKEY = 3  OR
              VIEW-LASTKEY = 4  OR
              VIEW-LASTKEY = 5  OR
              VIEW-LASTKEY = 6  OR
              VIEW-LASTKEY = 7  OR
              VIEW-LASTKEY = 8
               MOVE 8  TO  FIELD-NUMBER
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM  72-PGM-ERROR  THRU  72-PGM-ERROR-X
               GO TO  61-SHOWFORM-SCREEN-1B.

           IF DE-MSG-REPLY = "Y"
               NEXT SENTENCE
           ELSE
               PERFORM 611-PURGE-MNACTIVE THRU 611-PURGE-MNACTIVE-X
               IF RLSE-OPTION
                   PERFORM 611-PURGE-STACTIVE  THRU
                       611-PURGE-STACTIVE-X
                   GO TO 61-SELECTION-ROUTINE
               ELSE
                   GO TO 61-SELECTION-ROUTINE.

       61-SR-X.
           EXIT.

       611-BUILD-MNACTIVE.
           MOVE "N"  TO  ERR-SW.
      ****************************************************
      **   DO A CCHKOBJ OF 'STACTIVE' TO SEE IF AN 'AP5'
      **   IS ACTIVE.  IF SO DONT LET THEM DO A 'RLSE'
      ****************************************************
           MOVE "MNACTIVE" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS = "00"
      * *** A MANIFEST IS BE PROCESSED NOW; CANNOT PROCESS ANOTHER
      *                 MANIFEST ***
               MOVE  13 TO LANG-SETNUM
               MOVE  23 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 611-BUILD-MNACTIVE-X.
           MOVE "MNACTIVE" TO CCRTFILE-FILE.
           MOVE 1 TO CCRTFILE-RECORD-LENGTH,
                     CCRTFILE-NO-RECORDS,
                     CCRTFILE-INCREMENT-AMT,
                     CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CREATE COMMAND FAILED"  TO  BU-DISPLAY-MSG
               MOVE CCRTFILE-STATUS TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

       611-BUILD-MNACTIVE-X.
           EXIT.

       611-PURGE-MNACTIVE.
           MOVE "MNACTIVE"     TO  DLTFILE-FILE-NAME.
           CALL "CDLTFILE" USING DLTFILE-LIB-NAME,
                                 DLTFILE-FILE-NAME,
                                 DLTFILE-RETURN-STATUS.
           IF DLTFILE-RETURN-STATUS NOT = "00"
               MOVE "DELETE COMMAND FAILED"  TO  BU-DISPLAY-MSG
               MOVE DLTFILE-RETURN-STATUS    TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

       611-PURGE-MNACTIVE-X.
           EXIT.

       611-BUILD-STACTIVE.
           MOVE "N"  TO  ERR-SW.
           MOVE "STACTIVE" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS = "00"
      * *** AN 'AP5' FUNCTION IS ACTIVE NOW; CANNOT PROCESS A 'RLSE'
      *                 MANIFEST ***
               MOVE  1  TO LANG-SETNUM
               MOVE  14 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 611-BUILD-STACTIVE-X.
           MOVE "STACTIVE" TO CCRTFILE-FILE.
           MOVE 1 TO CCRTFILE-RECORD-LENGTH,
                     CCRTFILE-NO-RECORDS,
                     CCRTFILE-INCREMENT-AMT,
                     CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CREATE STACTIVE COMMAND"  TO  BU-DISPLAY-MSG
               MOVE CCRTFILE-STATUS  TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

       611-BUILD-STACTIVE-X.
           EXIT.

       611-PURGE-STACTIVE.
           MOVE "STACTIVE"     TO  DLTFILE-FILE-NAME.
           CALL "CDLTFILE" USING DLTFILE-LIB-NAME,
                                 DLTFILE-FILE-NAME,
                                 DLTFILE-RETURN-STATUS.
           IF DLTFILE-RETURN-STATUS NOT = "00"
               MOVE "DELETE COMMAND FAILED"  TO  BU-DISPLAY-MSG
               MOVE DLTFILE-RETURN-STATUS    TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

       611-PURGE-STACTIVE-X.
           EXIT.

       612-EDIT-NEW-OPTION.
           IF MPLTINFO-MAN-STATUS = "RLSE" OR
                                    "DLET"
               NEXT SENTENCE
           ELSE
      * *** PREVIOUS MANIFEST HAS NOT BEEN RELEASED CANNOT PROCESS A &
      *             'NEW' MANIFEST ***
               MOVE  16 TO LANG-SETNUM
               MOVE 105 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW.

       612-ENO-X.
           EXIT.

       613-EDIT-REPR-OPTION.
           IF MPLTINFO-MAN-STATUS = "NEW " OR
                                    "REPR"
               NEXT SENTENCE
           ELSE
      * *** NEW MANIFEST HAS NOT BEEN CREATED CANNOT RUN A 'REPR'
      *             TRANSACTION ***
               MOVE  14 TO LANG-SETNUM
               MOVE  15 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW.

       613-ERO-X.
           EXIT.

       614-EDIT-RLSE-OPTION.
           IF MPLTINFO-MAN-STATUS = "NEW " OR
                                    "REPR"
               NEXT SENTENCE
           ELSE
      * *** A NEW MANIFEST HAS NOT BEEN CREATED CANNOT RUN A 'RLSE'
      *             TRANSACTION ***
               MOVE  14 TO LANG-SETNUM
               MOVE  16 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 614-ERO-X.

           IF MPLTINFO-MODIFY-SW = "Y"
      ****** THE MANIFEST HAS BEEN MODIFIED YOU MUST DO A 'REPR' TC
               MOVE 20   TO  LANG-SETNUM
               MOVE 14   TO  LANG-MSGNUM
               PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT
               MOVE 4    TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 614-ERO-X.

      ****************************************************
      **   DO A CCHKOBJ OF 'STACTIVE' TO SEE IF AN 'AP5'
      **   IS ACTIVE.  IF SO DONT LET THEM DO A 'RLSE'
      ****************************************************
           MOVE "STACTIVE" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS = "00"
      * *** AN 'AP5' FUNCTION IS ACTIVE NOW; CANNOT PROCESS A 'RLSE'
      *                 MANIFEST ***
               MOVE  1  TO LANG-SETNUM
               MOVE  14 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4  TO  FIELD-NUMBER
               PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
               MOVE "Y"  TO  ERR-SW
               GO TO 614-ERO-X.

       614-ERO-X.
           EXIT.

       615-EDIT-DLET-OPTION.
           IF MPLTINFO-MAN-STATUS = "NEW " OR
                                    "REPR"
               NEXT SENTENCE
           ELSE
               IF MPLTINFO-MAN-STATUS = "RLSE"
      * *** MANIFEST HAS ALREADY BEEN RELEASED CANNOT RUN A 'DLET'
      *                 TRANSACTION ***
                   MOVE  13 TO LANG-SETNUM
                   MOVE  24 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 4  TO  FIELD-NUMBER
                   PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   MOVE "Y"  TO  ERR-SW
               ELSE
               IF MPLTINFO-MAN-STATUS = "DLET"
      * *** MANIFEST HAS ALREADY BEEN DELETED CANNOT RUN ANOTHER 'DLET'
      *                 TRANSACTION ***
                   MOVE  13 TO LANG-SETNUM
                   MOVE  25 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 4  TO  FIELD-NUMBER
                   PERFORM 72-PGM-ERROR  THRU  72-PGM-ERROR-X
                   MOVE "Y"  TO  ERR-SW.

       615-EDO-X.
           EXIT.

       616-ASSIGN-MANIFEST-NUM.
           ACCEPT CUR-DATE FROM DATE.
           MOVE MM                    TO  MANIFEST-MM-BUILD.
           IF MAN-MM-1-DIG = "0"
               MOVE MAN-MM-2-DIG      TO  BUILD-MANIFEST-FIRST-DIG
           ELSE
           IF MAN-MM-2-DIG = "0"
               MOVE "O"               TO  BUILD-MANIFEST-FIRST-DIG
           ELSE
           IF MAN-MM-2-DIG = "1"
               MOVE "N"               TO  BUILD-MANIFEST-FIRST-DIG
           ELSE
           IF MAN-MM-2-DIG = "2"
               MOVE "D"               TO  BUILD-MANIFEST-FIRST-DIG.
           IF DE-MONTH-OVERRIDE = "X"
               IF BUILD-MANIFEST-FIRST-DIG = MPLTINFO-CUR-MAN-PREFIX
                   ADD 1, MPLTINFO-PRIOR-MAN-NO
                       GIVING BUILD-MANIFEST-SEQ-CTR
                   MOVE MPLTINFO-PRIOR-MAN-PREFIX  TO
                        BUILD-MANIFEST-FIRST-DIG
               ELSE
                   ADD 1, MPLTINFO-CUR-MAN-NO
                       GIVING BUILD-MANIFEST-SEQ-CTR
                   MOVE MPLTINFO-CUR-MAN-PREFIX  TO
                        BUILD-MANIFEST-FIRST-DIG
           ELSE
               IF BUILD-MANIFEST-FIRST-DIG = MPLTINFO-CUR-MAN-PREFIX
                   ADD 1, MPLTINFO-CUR-MAN-NO
                       GIVING BUILD-MANIFEST-SEQ-CTR
               ELSE
                   MOVE 1                 TO  BUILD-MANIFEST-SEQ-CTR.

       616-AMN-X.
           EXIT.


       62-CREATE-LAUNCH-JOB-STREAM.
           CALL "QCMDEXC" USING OVRDBF-BXMANTOP, DBF-BXMANTOP-PARM2.
           CALL "QCMDEXC" USING OVRDBF-BXMANBOT, DBF-BXMANBOT-PARM2.
      *    CALL "QCMDEXC" USING CRTSRCF-BXMANJOB, CRT-BXMANJOB-PARM2.
           CALL "QCMDEXC" USING OVRDBF-BXMANJOB, DBF-BXMANJOB-PARM2.
           OPEN INPUT MANIFEST-CREATE-BEGIN-FILE,
                      MANIFEST-CREATE-END-FILE
                OUTPUT MANIFEST-CREATE-JOB-FILE.

       62-WRITE-JOB-CARD.
           READ MANIFEST-CREATE-BEGIN-FILE
               AT END  GO TO 62-WRITE-SELECTION.
           MOVE MANIFEST-BEGIN-RCD    TO  MANIFEST-CREATE-JOB-RCD.
           WRITE MANIFEST-CREATE-JOB-RCD.

       62-READ-MANIFEST-BEGIN-FILE.
           READ MANIFEST-CREATE-BEGIN-FILE
               AT END  GO TO 62-WRITE-SELECTION.
           MOVE MANIFEST-BEGIN-RCD
               TO  MANIFEST-CREATE-JOB-RCD.
           WRITE MANIFEST-CREATE-JOB-RCD.
           GO TO 62-READ-MANIFEST-BEGIN-FILE.

       62-WRITE-SELECTION.
           MOVE SPACES  TO  MANIFEST-CREATE-JOB-RCD.
           IF NEW-OPTION
               MOVE "NEW"             TO  MANIFEST-OPTION-ENTRY
           ELSE
           IF REPR-OPTION
               MOVE "REPR"            TO  MANIFEST-OPTION-ENTRY
           ELSE
           IF RLSE-OPTION
               MOVE "RLSE"            TO  MANIFEST-OPTION-ENTRY
           ELSE
           IF DLET-OPTION
               MOVE "DLET"            TO  MANIFEST-OPTION-ENTRY.
           WRITE MANIFEST-CREATE-JOB-RCD.
           MOVE KS-EMPLOYEE-ID        TO  MANIFEST-OPTION-ENTRY.
           WRITE MANIFEST-CREATE-JOB-RCD.
           IF DE-MONTH-OVERRIDE = "X"
               MOVE "Y"               TO  MANIFEST-OPTION-ENTRY
           ELSE
               MOVE "N"               TO  MANIFEST-OPTION-ENTRY.
           WRITE MANIFEST-CREATE-JOB-RCD.
           MOVE DE-SEL-RPT1           TO  REPORT-1.
           MOVE DE-SEL-RPT2           TO  REPORT-2.
           MOVE BUILD-REPORT-SEL      TO  MANIFEST-OPTION-ENTRY.
           WRITE MANIFEST-CREATE-JOB-RCD.


       62-READ-MANIFEST-END-FILE.
           READ MANIFEST-CREATE-END-FILE
               AT END  GO TO 62-STREAM-JOB.
           MOVE MANIFEST-END-RCD
               TO  MANIFEST-CREATE-JOB-RCD.
           WRITE MANIFEST-CREATE-JOB-RCD.
           GO TO 62-READ-MANIFEST-END-FILE.

       62-STREAM-JOB.
           CLOSE MANIFEST-CREATE-BEGIN-FILE,
                 MANIFEST-CREATE-END-FILE,
                 MANIFEST-CREATE-JOB-FILE.

      *
      * ACCEPT THE CURRENT TIME TO MAKE THE RDR JOB NAME UNIQUE.
      *
           ACCEPT STRDBRDR-TIME FROM TIME.
           CALL "QCMDEXC" USING STRDBRDR-BXMANJOB, DBR-BXMANJOB-PARM2.

      *    CALL "QCMDEXC" USING RMVM-BXMANJOB, RMVM-BXMANJOB-PARM2.
       62-CLJS-X.
           EXIT.

       72-PGM-ERROR.
           MOVE MESSAGE-BUFFER TO DE-MSGLINE.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).
       72-PGM-ERROR-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
