       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TIREDIT.
       AUTHOR.                 C HILLES.
       DATE-WRITTEN.           7/1/83.
       DATE-COMPILED.
      *INSTALLATION.           GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *
      *    ON AUGUST 6, 1984, MADE AN EDITING CHANGE FOR VALLEYFIELD.
      *    FOR VALLEYFIELD, ALL EXPENSE CLASS/NEW WORKS ENTERED
      *    WILL TRANSLATE AS "EXPENSE CLASS".  PREVIOUSLY, ALL
      *    NUMBERS GREATER THAN 10,000 WERE CONSIDERED NEW WORKS.
      *    THIS IS TO GET IN SYNC WITH A CHANGE PREVIOUSLY MADE
      *    FOR THE "UPDATE ACCOUNTING DATA" PROGRAM (MP4). CIH.
      *
      *    ON OCT 8, 1984, CHANGED THIS SUBPROGRAM AS PART OF THE
      *    COMBINATION OF AKRON VERSION AND PLANT VERSION OF THE STORES
      *    PROGRAMS.  MOST OF THE CHANGED LOGIC RESIDES IN THIS SUB-
      *    PROGRAM.  THE CHANGES ARE AS FOLLOWS:
      *
      *    1.  IN AKRON ONLY, J, IT, AND Z BILLS WILL BE DONE THROUGH
      *        THE STORES PROGRAMS.  THE J, IT, OR Z BILL IS ENTERED
      *        IN THE WORKORDER FIELD, WHERE THE 1ST 3 DIGITS OF THE
      *        WORKORDER IS THE PLANT NUMBER, THE 4TH DIGIT IS A J, I,
      *        OR Z, AND THE LAST DIGITS CONTAIN ANY DOCUMENT NUMBER.
      *        IF THESE CASES, ORD DEPT IS NOT REQUIRED, CHARGE DEPT
      *        AND EXP CLASS ARE DISALLOWED, AND CHARGE TYPE IS
      *        DISALLOWED.
      *
      *    2.  IN AKRON ONLY, MT (MATERIAL TRANSFERS) ARE ALSON DONE
      *        THROUGH THE STORES PROGRAMS.  "MT" IS ENTERED IN THE
      *        FIRST 2 DIGITS OF WORKORDER, AND THE DOCUMENT NUMBER IN
      *        THE REST.  IN THIS CASE, CHARGE DEPT IS REQUIRED, ORD
      *        DEPT IS OVERRIDDEN WITH SPACES, CHARGE ACCT AND CHARGE
      *        TYPE IS DISALLOWED.
      *
      *    3.  IN AKRON ONLY, SPECIAL STATIONERY STORES ISSUES ARE DON
      *        TO TERRRITORY NUMBERS, STORE NUMBERS, ETC.  IN THESE
      *        CASES AN "R", "D", "T", OR "S" IS ENTERED IN THE FIRST
      *         DIGIT OF WORKORDER, FOLLOWED BY A DOCUMENT NUMBER.
      *         IN THIS CASE REQESTING DEPT IS OPTIONAL, CHARGE
      *         DEPT IS OVERRIDDEN WITH SPACES, AND CHARGE ACCOUNT AND
      *         CHARGE TYPE ARE DISALLOWED.
      *
      *    4.   IN AKRON ONLY, THE CHARGE TYPE FIELD DESIGNATES WHAT
      *         TYPE OF CHARGE ACCOUNT IS USED. THESE NUMBERS AND
      *         MEANINGS AND REQUIRED FIELDS ARE LISTED IN THE TABLE
      *         BELOW:
      *
      *         -----------------------------------------------------------
      *         :   REQ    :  CHARGE   :  CHARGE   :   LAST    :  CHARGE  :
      *         :   DEPT   :   DEPT    :  ACCOUNT  :   CHARGE  :   TYPE   :
      *--------------------------------------------------------------------
      *IT,J,Z   : OPTIONAL : OVERRIDE- : DISALLOW  :    WO     : DISALLOW :
      *         :          :  I, J, Z  :           :           :          :
      *         :          :           :           :           :          :
      *--------------------------------------------------------------------
      *MT       : OVERRIDE-: REQUIRED  : DISALLOW  :  CHARGE   : DISALLOW :
      *         :  SPACES  : VALIDATED :           :   DEPT    :          :
      *         :          :           :           :           :          :
      *--------------------------------------------------------------------
      *R, D, T, : OPTIONAL : OVERRIDE- : DISALLOW  :   REQ     : DISALLOW :
      *S        :          :  SPACES   :           :   DEPT    :          :
      *         :          :           :           :           :          :
      *--------------------------------------------------------------------
      *CHG TYP1 : REQUIRED : REQUIRED  : REQUIRED  :  CHARGE   : REQUIRED :
      *RSRCH &  : VALIDATE : VALIDATE  :           :   DEPT    :          :
      *DEVELOP  :          :           :           :           :          :
      *--------------------------------------------------------------------
      *CHG TYP2 : REQUIRED : REQUIRED  : REQUIRED  :  CHARGE   : REQUIRED :
      *ENG. EXP : VALIDATE : VALIDATE  : VALIDATE  :   DEPT    :          :
      *         :          :           :           :           :          :
      *--------------------------------------------------------------------
      *CHG TYP3 : REQUIRED : REQUIRED  : REQUIRED  :  CHARGE   : REQUIRED :
      *ENG.     : VALIDATE : VALIDATE  : VALIDATE  :   DEPT    :          :
      *REPAIR   :          :           :           :           :          :
      *--------------------------------------------------------------------
      *CHG TYP4 : REQUIRED : OVERRIDE  : REQUIRED  :   REQ     : REQUIRED :
      *NEW WORK : VALIDATE :  SPACES   :           :   DEPT    :          :
      *         :          :           :           :           :          :
      *--------------------------------------------------------------------
      *CHG TYP5 : REQUIRED : OVERRIDE  : REQUIRED  :   REQ     : REQUIRED :
      *MACHINE  : VALIDATE :  SPACES   :           :   DEPT    :          :
      *DESIGN   :          :           :           :           :          :
      *--------------------------------------------------------------------
      *NO CHARGE: REQUIRED : REQUIRED  : OPTIONAL  :  CHARGE   : DISALLOW :
      *TYPE -   : VALIDATE : VALIDATE  :           :   DEPT    :          :
      *OP. EXP. :          :           :           :           :          :
      *--------------------------------------------------------------------
      *
      *    NOTE THAT OF THE ABOVE FIELDS, THE J, IT, Z, MT, AND STATIONERY
      *    SHOULD BE MOVED INTO ANOTHER PROGRAM SOON.  HOWEVER THE CHARGE
      *    TYPE DIFFERENCES WILL PROBABLY STAY.  CIH.
      *
      *    ON NOVEMBER 26, 1984, CHANGED PROGRAM TO SKIP EDIT CHECKS
      *    ON WO FIELD IF THE CALLING PROGRAM INDICATES THIS EDIT IS
      *    FOR A BANBURY EXPLOSION CORRECTION (INDICATED BY "C" IN
      *    SECOND BYTE OF RETURN CODE).  ALSO, NOW ONLY THE FIRST BYTE
      *    OF RETURN CODE IS CHECKED TO DETERMINE WHETHER THIS IS A
      *    RETURN ("RT" - "R" IS CHECKED) OR ISSUE ("IS" - "I" IS
      *    CHECKED).  CIH.
      *
      *    ON AUGUST 22, 1985, MADE A CHANGE TO MAKE NEW TORONTO
      *    COMPATIBLE WITH THE VALLEFIELD CHANGE MADE ON AUGUST 6,
      *    1984.  IN THIS CHANGE, ALL EXPENSE CLASS/NEW WORKS ENTERED
      *    ENTERED WILL TRANSLATE AS "EXPENSE CLASS" ("EC" PREFIX ON
      *    THE KEY RATHER THAN "NW").  JUST ADDED PLANT CODE 630
      *    (NEW TORONTO) TO THE "IF" STATEMENT.  CIH.
      *
      *    ON AUGUST 22, 1985, MADE A CHANGE TO MAKE NEW TORONTO
      *    AND VALLEYFIELD.  FOR BOTH PLANTS, NON-NUMERIC EXPENSE
      *    CLASSES WILL BE ALLOWED.  CIH.
      *
      *    10/10/85    CHANGED PROGRAM TO BE COMPATIBLE WITH THE
      *                NATIVE LANGUAGE SUPPORT FACILITY.
      *                                          PD RAGLOW.
      *
      *    ON JUNE 12, 1986, FIXED BUG IN THE KELLY LOGIC.  THE
      *    PROGRAM WAS RETURNING THE DEFAULT EXPENSE EVEN IF THE
      *    ENTERED CODE WAS GREATER THAN 300, BUT ONLY FOR
      *    WORKSHEETS.  FIXED THIS.  CIH.
      *
      *C
      *C  08/18/92  BK DISMUKES  REQUEST #6252
      *C    1. ADDED LOGIC TO CHECK DRESTRIC IF A CODE IS FLAGED AS
      *C       RESTRICTED WITHDRAWAL ITEM.  THE LOGIC IS AT
      *C       6450-CHECK-RESTRICTED.
      *C    2. ADDED DRESTRIC, PER-PERSON-PC TO DATASET
      *C       LIST.
      *C    3. THESE CHANGES WILL ONLY AFFECT PLANTS THAT USE THE
      *C       RESTRICTED WITHDRAWAL STOREROOM CAPABILITIES BY DEFINING
      *C       CODES AS RESTRICTED FROM THE MP1 SCREEN.
      *
      *C  09/25/92  BK DISMUKES  REQUEST #6257
      *C    1. ADDED LOGIC TO OVERRIDE CHARGE DEPT AND EXPENSE CLASS
      *C       FROM PLANT STARTUP AND MP1 OPTIONS.
      *
      *C  03/05/93  BK DISMUKES  REQUEST #6380
      *C    1. CHANGED LOGIC TO KEEP CHARGE-TYPE.  IT WAS BEING
      *C       OVERWRITTEN IN THE CHARGE-DEPT EDITS.
      *C
      *C   04/06/93   BK DISMUKES    REQUEST #6392
      *C     1. CHANGED LOGIC IN CHARGE DEPT EDITS TO USE WITHDRAWAL
      *C        SCREEN CHARGE DEPT IF DIRECT CHARGE DEPT IN MP1 IS
      *C        BLANK AND THE OVERRIDE FLAG IN PLANT STARTUP IS SET
      *C        TO USE THE DIRECT CHARGE DEPT FROM MP1.
      *C
      *C   09/22/93   JS BUNGO       REQUEST #6427
      *C     ADDED LOGIC FOR A DEFAULT WORKORDER NUMBER.  IF WO NUMBER
      *C     IS LEFT BLANK THEN LOOK FOR THE CURRENTLY ASSIGNED WO
      *C     NUMBER FOR THE CLOCK CARD THAT WAS ENTERED ON THE SCREEN.
      *C     IF FOUND THEN DEFAULT THE WO TO THE ASSIGNED WORKORDER.
      *C***********************************************************
      *C   05/03/94                                               *
      *C      REMOVED ALL REFERENCES TO PORTABILITY COPYLIB       *
      *C      MEMBERS.                              W.L.M.        *
      *C***********************************************************
      *C
      *C   06/01/94  JEFF BUNGO  REQ #6507, 94-032
      *C     CHANGED THIS PROGRAM TO REVIEW RESTRICTIONS AGAINST THE
      *C     ACCOUNTING CLASS FOR THE PASSED CORPORATE CODE.  THIS
      *C     RESTRICTION IS CHECKED ONLY IF THE CODE IS NOT A
      *C     RESTRICTED WITHDRAWAL CODE.
      *C
      *C   05/14/96  JEFF BUNGO  REQ 96-026
      *C     ADDED NEW TYPE OF RESTRICTION (X), TO RESTRICT BY
      *C     CLOCK CARD WITHIN A DEPARTMENT WITHOUT AFFECTING THE
      *C     ABILITY OF OTHER DEPARTMENTS TO WITHDRAWAL (UNLESS
      *C     SPECIFIED BY THE OTHER RESTRICTIONS.
      *C
      *C   06/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C   08/06/96  JEFF BUNGO
      *C     INCREASE THE TABLE SIZE OF RESTRICTED WITHDRAWAL
      *C     FROM 11 TO 45 TO ALLOW MORE RESTRICTIONS.
      *C
      *C   OCTOBER 1997  JIM COFFMAN
      *C     CHANGED ISSPARTS PARAMETERS TO BE INCLUDED IN A COPYLIB
      *C     MEMBER. THIS WAS NECESSARY TO ALLOW THE AREA TO BE
      *C     EXPANDABLE TO CONTAIN THE LINK TO A WORK ORDER LOGIC
      *C     REQUEST NOW AVAILABLE IN AN E1 REQUISITION CREATE.
      *C
      *C   FEBRUARY 2, 1998  JEFF BUNGO  98-001
      *C     AKRON ONLY.  IF CHARGE TYPE IS "2" THEN ONLY ALLOW ACCOUNTS
      *C     "000450" AND GREATER.  IF CHARGE TYPE IS "3" THEN ONLY ALLOW
      *C     ACCOUNTS LESS THAN "000450".
      *C
      *C   APRIL 3, 1998   DAVE PLUM
      *C    REMOVE JEFF BUNGO'S CHANGES FROM FEBRUARY 2, 1998.  UPON THE
      *C    INSTALLATION OF RELEASE K.01 ON AKRON4 ON MARCH 24, 1998,
      *C    A VARIETY OF NEW ERRORS BEGAN TO APPEAR IN THE AKRON STORES
      *C    ACCOUNTING SYSTEM (A2520).
      *C
      *C   JANUARY 12, 2001  JIM COFFMAN
      *C    ADDED CODE FOR TYLER TO ALLOW THEM TO BE ABLE TO USE THE
      *C    MP1-GENERATED EXPENSE CLASS FOR A STOREROOM WITHDRAWAL.
      *C ****************************************************************
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        HP-3000.
       OBJECT-COMPUTER.        HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MVALIDPLTDATA
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DRESTRIC
                  ASSIGN TO DATABASE-MCFLCS5001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT LABOR-CURR-STAT-I
                  ASSIGN TO DATABASE-MCFLMM1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSON-PC-I
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  MVALIDPLTDATA
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDATA-REC.
           COPY DDS-MCRPCS1700  OF MCFLCS1701.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DRESTRIC
           LABEL RECORDS ARE STANDARD.
       01  DRESTRIC-REC.
           COPY DDS-MCRPCS5000  OF MCFLCS5001.

       FD  LABOR-CURR-STAT-I
           LABEL RECORDS ARE STANDARD.
       01  LCS-REC.
           COPY DDS-MCRPMM1600  OF MCFLMM1601.

       FD  PER-PERSON-PC-I
           LABEL RECORDS ARE STANDARD.
       01  PER-PERSON-PC-REC-I.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       WORKING-STORAGE SECTION.
       77  EMPL-MUST-BE-VALID-SW         PIC X(1).
       77  SAVE-EXP-CLASS                PIC X(6).
       77  HOLD-CHARGE-TYPE              PIC X(1).

       01  AKRON-PLANT-FLAG              PIC X(1)  VALUE "N".
           88  AKRON-PLANT                         VALUE "Y".

       01  SAVE-RET-CODE.
           05  SAVE-RET-CODE-1           PIC X(1).
           05  SAVE-RET-CODE-2           PIC X(2).

       01  HOLD-RESTRICT.
           05  FILLER                    PIC X(7).
           05  HOLD-RESTRICT-8           PIC X(1).

       01  RESTRICT-X-SW                 PIC X(1) VALUE "Y".
           88  RESTRICT-X-ONLY                    VALUE "Y".
           88  RESTRICT-MORE-THAN-X               VALUE "N".

       01  RESTRICT-DEPT-CC-SW           PIC X(1) VALUE "N".
           88  RESTRICT-DEPT-CC-FOUND             VALUE "Y".
           88  RESTRICT-DEPT-CC-NOT-FOUND         VALUE "N".

      *************************************************************
      **                                                          **
      **          C O M M U N I C A T I O N S   A R E A S         **
      **                                                          **
      **************************************************************

       01  BUDGET-MESSAGE                PIC X(80).

       01  ALIGN-WO                      PIC X(10).
       01  ALIGN-RET-CODE                PIC X(2).

       COPY TRSHIFT            IN COPYLIB.
       COPY CATREAD            IN COPYLIB.

      **************************************************************
      **                                                          **
      **           D A T A B A S E   W O R K                      **
      **                                                          **
      **************************************************************

       01  DSET-NAMES.
           05  DSET-MVALIDPLTDATA   PIC X(16) VALUE "MVALIDPLTDATA;".
           05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".
           05  DSET-DRESTRIC             PIC X(16) VALUE "DRESTRIC;".
           05  DSET-LABOR-CURR-STAT PIC X(16) VALUE "LABOR-CURR-STAT;".

       01  MODE-AREA.
           05  MODE7                     PIC S9(4) COMP-4 VALUE 7.

       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".

       01  PLT-ARG                       PIC X(4)  VALUE SPACES.
       01  VALID-ARG.
           05  VALID-ARG-1-2             PIC X(2).
           05  VALID-ARG-3-10            PIC X(8).

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************

       COPY MVALDPLT           IN COPYLIB.
       COPY MPLTINFO           IN COPYLIB.
       COPY MPLTST             IN COPYLIB.
       COPY MSTORERM           IN COPYLIB.

       COPY  DRESTRIC  IN COPYLIB.

       01  LCS-DATA.
           COPY DCURRLBR       IN COPYLIB.

       01  BUF-PER-PERSONNEL.            COPY MPERSONL IN COPYLIB.



      **************************************************************
      **                                                          **
      **            L I N K A G E   S E C T I O N                 **
      **                                                          **
      **************************************************************

       LINKAGE SECTION.
       01  RET-CODE                      PIC X(2).
       01  BASE                          PIC X(10).
       01  MMIS-BASE                     PIC X(13).

       COPY ISSPARTS IN COPYLIB.

      *01  MMIS-WORK.
      *    05  MMIS-WO                   PIC X(10).
      *    05  MMIS-ST-CODE              PIC X(8).
      *    05  MMIS-QTY                  PIC S9(8).
      *    05  MMIS-AVGCST               PIC S9(11)V9(4).
      *    05  MMIS-CHARGE-DEPT          PIC X(4).
      *    05  MMIS-EXP-CLASS.
      *        10  MMIS-EXP-CLASS-1-2    PIC X(2).
      *        10  MMIS-EXP-CLASS-3-8    PIC X(6).
      *    05  MMIS-DESC                 PIC X(46).
      *    05  MMIS-STAT                 PIC XX.
      *    05  MMIS-UM                   PIC XX.
      *    05  MMIS-EMPL-ID-OR-DEPT      PIC X(4).
      *
       01  STATUS-AREA.
           05  COND-WORD                 PIC S9(4) COMP-4.
           05  DATA-LENG                 PIC S9(4) COMP-4.
           05  RCD-NO                    PIC S9(9) COMP-4.
           05  CHAIN-LENG                PIC S9(9) COMP-4.
           05  BKWD-ADDR                 PIC S9(9) COMP-4.
           05  FWRD-ADDR                 PIC S9(9) COMP-4.

       01  EDIT-DATA.
           05  PLANT-CODE.
               10  PLANT-CODE-1-2        PIC X(2).
               10  FILLER                PIC X(1).
           05  DE-CODE                   PIC X(7).
           05  DE-EMPL                   PIC X(4).
           05  DE-WO.
               10  MT-CHECK.
                   15  STATIONERY-CHECK  PIC X(1).
                   15  FILLER            PIC X(1).
               10  FILLER                PIC X(1).
               10  IT-J-Z-CHECK          PIC X(1).
               10  FILLER                PIC X(6).
           05  DE-WORK-CENTER            PIC X(2).
           05  DE-REQ-DEPT               PIC X(4).
           05  DE-CHARGE-DEPT.
               10  DE-CHARGE-DEPT-1-4    PIC X(4).
               10  DE-CHARGE-DEPT-5-6.
                   15  DE-CHARGE-TYPE    PIC X(1).
                   15  FILLER            PIC X(1).
           05  DE-EXP-CLASS.
               10  DE-EXP-CLASS-1-3.
                   15  DE-EXP-CLASS-1-2  PIC X(2).
                   15  FILLER            PIC X(1).
               10  FILLER                PIC X(3).
           05  SUB                       PIC 9(1).
           05  STR-RESTRICTED-FLG-E      PIC X(1).
           05  STR-REQ-CHG-OVERRD-E      PIC X(1).
           05  STR-DIR-CHRG-DEPT-E       PIC X(4).
           05  FILLER                    PIC X(5).

       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1).
               10  FILLER                  PIC X(63).
           05  MSG-FLD                     PIC X(14).
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC Z(13)9.

       COPY MULTSTR            IN COPYLIB.
       COPY STCOM              IN COPYLIB.
       01  STR-EXP-CLASS                 PIC X(6).

      ***********************************
      **  NATIVE LANGUAGE SUPPORT AREA **
      ***********************************

       COPY LANGSUB            IN COPYLIB.

       PROCEDURE DIVISION USING RET-CODE,
                                BASE,
                                MMIS-BASE,
                                PART-WORKAREA,
                                STATUS-AREA,
                                EDIT-DATA,
                                MESSAGE-BUFFER,
                                MULTIPLE-STR-DATA,
                                STORES-COMAREA,
                                STR-EXP-CLASS,
                                LANGUAGE-PARMS.
       6000-MAIN.
           MOVE "N"            TO AKRON-PLANT-FLAG.
           OPEN INPUT          MVALIDPLTDATA,
                               MPLTINFO,
                               DRESTRIC,
                               PER-PERSON-PC-I,
                               LABOR-CURR-STAT-I,
                               MSTORERM-I.

      *------ IF MULT STR DATA NOT ALREADY FOUND, GET IT.
           IF MULT-STR-FLAG = "Y" OR "N"
               NEXT SENTENCE
           ELSE
               MOVE SPACES     TO   BUF-MPLTINFO
               MOVE "STST"     TO   PLT-ARG
               PERFORM 9010-START-MPLTINFO
               IF COND-WORD = 17
                   MOVE "N"    TO   MULT-STR-FLAG
                   MOVE "N"    TO   ALWAYS-MULT-STR-CODE-FLAG
                   MOVE "Y"    TO   WO-OVERRD-ENTRY
                   MOVE "Y"    TO   WO-OVERRD-EXP
                   MOVE "N"    TO   ENTRY-OVERRD-EXP
                   MOVE "N"    TO   WS-PW-SW
                   MOVE "N"    TO   VALID-EMPL-CRAFTWS
                   MOVE "N"    TO   VALID-EMPL-STORES
                   MOVE "N"    TO   MP1-OVERRD-CHG-DEPT
               ELSE
               IF COND-WORD = 0
                   MOVE MPLTINFO-ST TO MULTIPLE-STR-DATA.

           IF EDIT-EXP-FLAG = "Y" OR "N"
               NEXT SENTENCE
           ELSE
               MOVE "POPT"     TO   PLT-ARG
               PERFORM 9010-START-MPLTINFO
               IF COND-WORD = 17
                   MOVE "Y"    TO EDIT-EXP-FLAG
               ELSE
               IF MPLTINFO-ADDTL-DATA-EDIT-SW = "N"
                   MOVE "N"    TO EDIT-EXP-FLAG
               ELSE
                   MOVE "Y"    TO EDIT-EXP-FLAG.

           MOVE RET-CODE       TO SAVE-RET-CODE.
           MOVE "00"           TO RET-CODE.
           MOVE 0              TO SUB.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE DE-CHARGE-TYPE TO HOLD-CHARGE-TYPE.

      *------ DEFAULTS FOR STR EXP CLASS LOGIC.  IF THE FIRST ONE IS
      *------ SET, THE REST SHOULD BE.
           IF WO-OVERRD-ENTRY = "Y" OR "N"
               NEXT SENTENCE
           ELSE
               MOVE "Y"        TO   WO-OVERRD-ENTRY
               MOVE "N"        TO   ENTRY-OVERRD-EXP
               MOVE "Y"        TO   WO-OVERRD-EXP
               MOVE "N"        TO   MP1-OVERRD-CHG-DEPT.

       6100-AKRON-DETERMINATION.
           IF PLANT-CODE-1-2 = "11"
               MOVE "Y"        TO  AKRON-PLANT-FLAG.

       6200-CHECK-EMPL.
           IF DE-EMPL = SPACES
      *M----   "E29: EMPLOYEE ID IS REQUIRED"
               MOVE   5        TO LANG-SETNUM
               MOVE  29        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1          TO SUB
               GO TO 6990-MAIN-X.

      **************************************************************
      **   A "CC" CALL TO ISSPARTS DETERMINES IF WE HAVE A VALID  **
      **   CLOCK CARD (EMPL NUMBER).  REQ DEPT WILL DEFAULT IF    **
      **   LEFT BLANK TO:                                         **
      **     1.  CHARGE DEPT IF DE-EMPL NUMBER IS NOT VALID          **
      **     2.  DE-EMPLOYEE'S DEPT FROM MMIS DE-EMPLOYEE FILE IF VALID **
      **************************************************************

           MOVE SPACES         TO  PART-WORKAREA.
           MOVE DE-EMPL        TO  EMPLOYEE-ID.
           MOVE "CC"           TO  RETURN-STATUS.
           MOVE ZEROS          TO  QTY-ISSUED, AVERAGE-COST.

           CALL "ISSPARTS" USING PART-WORKAREA
                                 MMIS-BASE
                                 LANGUAGE-PARMS
                                 BUDGET-MESSAGE.

           IF DE-REQ-DEPT = SPACES
               IF RETURN-STATUS = "ID"
                   MOVE DE-CHARGE-DEPT TO DE-REQ-DEPT
               ELSE
                   MOVE EMPLOYEE-ID    TO DE-REQ-DEPT.

      *------ EMPL IS ALWAYS VALIDATED IF WO (EXCEPT AKRON, WHO PUTS
      *------ MT, I, J, & Z ORDERS IN THE WO FIELD).  IF NOT WO,
      *------ THERE IS A FLAG TO VALIDATE EMPL ON CRAFTSMAN WORKSHEET,
      *------ AND ANOTHER FLAG TO VALIDATE FOR ALL OTHER ISSUES.
           MOVE "N"            TO   EMPL-MUST-BE-VALID-SW.
           IF DE-WO > SPACES
               IF AKRON-PLANT
                   NEXT SENTENCE
               ELSE
                   MOVE "Y"    TO   EMPL-MUST-BE-VALID-SW
           ELSE
           IF SCOM-PGM-KEY = "CW"
               IF VALID-EMPL-CRAFTWS = "Y"
                   MOVE "Y"    TO   EMPL-MUST-BE-VALID-SW
               ELSE
                   NEXT SENTENCE
           ELSE
           IF VALID-EMPL-STORES = "Y"
               MOVE "Y"        TO   EMPL-MUST-BE-VALID-SW.

           IF EMPL-MUST-BE-VALID-SW = "Y"
               IF RETURN-STATUS = "ID"
      *M-----      "E17: EMPLOYEE ID DOES NOT EXIST"
                   MOVE   5    TO LANG-SETNUM
                   MOVE  17    TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-EMPL TO MSG-FLD
                   MOVE 1       TO SUB
                   GO TO 6990-MAIN-X.

      ** IF WORKORDER IS SPACES AND EXP CLASS IS SPACES
      ** THEN FIND CURRENT WO ASSIGNED TO EMPL
      **  FOR SW1 OR SW6 FUNCTIONS
           IF SCOM-PGM-KEY = "SW1" OR "SW6"
               IF PLANT-CODE = "155"
                   IF DE-WO = SPACES
                       MOVE DE-EMPL TO PERCCNUM OF LABOR-CURR-STAT-I
                       READ LABOR-CURR-STAT-I INTO LCS-DATA
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                       END-READ
                       IF FILE-STATUS = "00"
                           MOVE LCS-WO-NUM TO DE-WO
                       END-IF
                   END-IF
               END-IF
               IF DE-WO = SPACES AND (DE-EXP-CLASS = SPACES
                                      OR DE-CHARGE-DEPT = SPACES)
                   MOVE DE-EMPL TO PERCCNUM OF LABOR-CURR-STAT-I
                   READ LABOR-CURR-STAT-I INTO LCS-DATA
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-READ
                   IF FILE-STATUS = "00"
                       MOVE LCS-WO-NUM TO DE-WO
                   END-IF
               END-IF
           END-IF.

      ** IF WORKORDER IS SPACES, SKIP WORKORDER CHECKS.

           IF DE-WO = SPACES
               GO TO 6400-CHECK-REQ-DEPT.

      *---------- IN THE AKRON COMPLEX ONLY, THE WORKORDER FIELD
      *           IS USED TO ENTER IT, J, AND Z BILLS, SPECIAL
      *           STATIONERY ISSUES, AND MATERIAL TRANSFERS.
      *           ALSO, FOR NEW WORKS, AND ADDITIONAL CHARGE NUMBER
      *           IS ALLOWED IN THE WORKORDER FIELD.

           IF AKRON-PLANT
               IF IT-J-Z-CHECK = "I" OR "J" OR "Z"
                   MOVE IT-J-Z-CHECK TO DE-CHARGE-DEPT-1-4
                   MOVE HOLD-CHARGE-TYPE TO DE-CHARGE-TYPE
                   GO TO 6550-CHECK-CHARGE-TYPE
                ELSE
                IF STATIONERY-CHECK = "R" OR "D" OR "T" OR "S"
                   MOVE "    "      TO  DE-CHARGE-DEPT-1-4
                   MOVE HOLD-CHARGE-TYPE TO DE-CHARGE-TYPE
                   GO TO 6550-CHECK-CHARGE-TYPE
               ELSE
               IF MT-CHECK = "MT"
                   MOVE "    " TO  DE-REQ-DEPT
                   GO TO 6500-CHECK-CHARGE-DEPT
               ELSE
               IF DE-CHARGE-TYPE = "4"
                   GO TO 6400-CHECK-REQ-DEPT.

      *---------- THE SECOND BYTE OF RETURN CODE CONTAINS A "C" IF
      *---------- THE CALLING PROGRAM ("TIRSNGL" ONLY) IS DOING A EDIT
      *---------- FOR A CORRECTION OF BANBURY EXPLOSION TRANSACTION.  IN
      *---------- THIS CASE, THE WORKORDER FIELD IS USED FOR PRODUCTION
      *---------- DATE, AND ALL EDIT CHECKS ON W.O. ARE SKIPPED.

           IF SAVE-RET-CODE-2 = "C"
               GO TO 6400-CHECK-REQ-DEPT.

       6300-CHECK-WO.
      **************************************************************
      **   WE RIGHT SHIFT THE WO USING THE SUBROUTINE "TALWONO".  **
      **   NOTE THAT A 10-BYTE WO OF "716D      " WILL BE SHIFTED **
      **   TO "000716D   ".  THE LAST 3 CHARACTERS ARE FOR THE WO **
      **   SUFFIX.                                                **
      **************************************************************

           MOVE DE-WO          TO ALIGN-WO.
           CALL "TALWONO" USING ALIGN-WO ALIGN-RET-CODE.
           MOVE ALIGN-WO       TO DE-WO.

      ******************************************************
      ** IF A WORK ORDER NUMBER IS ENTERED, A CALL TO A MMIS
      **  SUBPROGRAM WITH A STATUS CODE OF "CX" (CHECK) IS
      **  MADE TO VERIFY THE WORK ORDER EXISTS AND PICK UP
      **  THE CHARGE CARRIED BY MMIS.
      ******************************************************

           MOVE SPACES         TO  PART-WORKAREA.
           MOVE DE-CODE        TO  STORES-CODE.
           MOVE DE-WO          TO  WO-NUMBER.
           MOVE DE-EMPL        TO  EMPLOYEE-ID.
           MOVE "CX"           TO  RETURN-STATUS.
           MOVE ZEROS          TO  QTY-ISSUED, AVG-COST.

           CALL "ISSPARTS" USING PART-WORKAREA
                                 MMIS-BASE
                                 LANGUAGE-PARMS
                                 BUDGET-MESSAGE.

           IF RETURN-STATUS = "WU"
      *M----   "WORK ORDER IS UNAPPROVED                     W12"
               MOVE  49        TO LANG-SETNUM
               MOVE  12        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-WO      TO MSG-FLD
               MOVE 2          TO SUB
               GO TO 6990-MAIN-X
           ELSE
           IF RETURN-STATUS = "WO"
      *M----   "WORKORDER DOES NOT EXIST"
               MOVE  23        TO LANG-SETNUM
               MOVE   3        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-WO      TO MSG-FLD
               MOVE 2          TO SUB
               GO TO 6990-MAIN-X
           ELSE
           IF RETURN-STATUS = "BB"
      *M----   "BUDGET SYSTEM CHECK FAILED"
               MOVE BUDGET-MESSAGE TO MESSAGE-BUFFER
               MOVE DE-WO      TO MSG-FLD
               MOVE 2          TO SUB
               GO TO 6990-MAIN-X.

           IF SAVE-RET-CODE-1 = "R"
      *M----   "T22: THIS PART WAS NEVER ISSUED FOR THIS W.O."
               IF RETURN-STATUS = "NP"
               MOVE  20        TO LANG-SETNUM
               MOVE  22        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-WO  TO MSG-FLD
                   MOVE 2      TO SUB
                   GO TO 6990-MAIN-X.

           IF DEPT-CHARGED > SPACES
               IF WO-OVERRD-ENTRY = "Y" OR DE-CHARGE-DEPT-1-4 = SPACES
                   MOVE DEPT-CHARGED     TO DE-CHARGE-DEPT
                   MOVE HOLD-CHARGE-TYPE TO DE-CHARGE-TYPE.

      *------ THE FOLLOWING STATEMENTS PROTECT AGAINST POSSIBLY BAD
      *------ DATA OUT OF MMISA.  COULD GET A NON-RIGHT SHIFTED "250",
      *------ SO WHEN WE MOVE THE LAST 6 DIGITS WE WOULD LOSE THE
      *------ NUMBER. ALSO, WATCH OUT FOR "NW12345", WHICH WE CANNOT
      *------ RIGHTSHIFT (OTHERWISE WOULD GET THE 'W' IN LST 6 DIGITS).
           IF EXP-CLASSIFICATION-1-2 = "NW"
               NEXT SENTENCE
           ELSE
           IF EXP-CLASSIFICATION NUMERIC
               NEXT SENTENCE
           ELSE
               MOVE EXP-CLASSIFICATION TO   RS-SHIFT-FLD
               CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD
               MOVE RS-SHIFT-FLD       TO   EXP-CLASSIFICATION.

      *------ IF WORKORDER EXP CLASS OVERRIDES SCREEN ENTRY, MOVE IN
      *------ WO EXP CLASS REGARDLESS.  OTHERWISE, MOVE IT IN ONLY IF
      *------ THE SCREEN EXP CLASS IS LEFT BLANK.
           IF EXP-CLASSIFICATION > SPACES
               IF WO-OVERRD-ENTRY = "Y" OR DE-EXP-CLASS = SPACES
                   IF PLANT-CODE = "211" OR "281" OR "284" OR "285"
                       MOVE EXP-CLASSIFICATION-1-2 TO DE-CHARGE-DEPT-5-6
                       MOVE EXP-CLASSIFICATION-3-8 TO DE-EXP-CLASS
                   ELSE
                       MOVE EXP-CLASSIFICATION-3-8 TO DE-EXP-CLASS.

       6400-CHECK-REQ-DEPT.
           IF DE-REQ-DEPT = SPACES
      *M----   "R34: REQUESTING DEPT REQUIRED"
               MOVE  18        TO LANG-SETNUM
               MOVE  34        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3          TO SUB
               GO TO 6990-MAIN-X.

           MOVE "DP"           TO VALID-ARG-1-2.
           MOVE DE-REQ-DEPT    TO  VALID-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA.
           IF COND-WORD = 17
      *M----   "D12: DEPARTEMENT CODE DOES NOT EXIST"
               MOVE   4        TO LANG-SETNUM
               MOVE  12        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-REQ-DEPT TO MSG-FLD
               MOVE 3          TO SUB
               GO TO 6990-MAIN-X
           ELSE
           IF COND-WORD NOT = 0
               MOVE "BU"       TO RET-CODE
               GO TO 6990-MAIN-X.

       6450-CHECK-RESTRICTIONS.
      **************************************************************
      **  THIS PARAGRAPH IS ONLY USED IF RESTRICTIONS ARE PLACED  **
      **  ON A STOREROOM CODE.  IT WILL STOP WITHDRAWALS IF       **
      **  THE ASSOCIATE IS NOT LISTED IN THE RESTRICTION TABLE.   **
      **  THIS PARAGRAPH WILL BE MOST EFFICIENT IF USED WITH      **
      **  THE PERSONNAL PASSWORD SYSTEM.                          **
      **************************************************************
           IF STR-RESTRICTED-FLG-E = "X"
               NEXT SENTENCE
           ELSE
               GO TO 6460-CHECK-CLASS-RESTRICTIONS.

           MOVE DE-CODE      TO CORPCDE OF DRESTRIC-REC.

           READ DRESTRIC     INTO BUF-DRESTRIC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
      *M---- RESTRICTED WITHDRAWAL ITEM, CONTACT MATERIAL CONTROL
               MOVE 18       TO LANG-SETNUM
               MOVE 91       TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-CODE  TO MSG-FLD
               GO TO  6990-MAIN-X.
           SET RESTRICT-X-ONLY TO TRUE.

       6450-BEGIN-CC-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6450-CHECK-CC-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "C"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6450-READ-PER-DATA
               ELSE
                   GO TO 6450-CHECK-CC-LINE.

       6450-CHECK-CC-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = DE-EMPL
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6450-CHECK-CC-LINE
               ELSE
                   GO TO 6450-CHECK-CC-DATA.

       6450-READ-PER-DATA.
           MOVE DE-EMPL  TO PERCCNUM OF PER-PERSON-PC-REC-I.
           READ PER-PERSON-PC-I   INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
      *M---- "E17: EMPLOYEE ID DOES NOT EXIST"
               MOVE 05       TO LANG-SETNUM
               MOVE 17       TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  1       TO SUB
               GO TO  6990-MAIN-X.

       6450-BEGIN-DEPT-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6450-CHECK-DEPT-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "D"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6450-BEGIN-CFT-SEARCH
               ELSE
                   GO TO 6450-CHECK-DEPT-LINE.

       6450-CHECK-DEPT-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = PER-DEPT
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6450-CHECK-DEPT-LINE
               ELSE
                   GO TO 6450-CHECK-DEPT-DATA.

       6450-BEGIN-CFT-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6450-CHECK-CFT-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "T"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6450-BEGIN-DEPT-CC-SEARCH
               ELSE
                   GO TO 6450-CHECK-CFT-LINE.

       6450-CHECK-CFT-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = PER-CRAFT
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6450-CHECK-CFT-LINE
               ELSE
                   GO TO 6450-CHECK-CFT-DATA.

      *------THIS CHECK HAS BEEN ADDED TO RESTRICT TO CC IN DEPT.
      *------IF DEPT/CC MATCHES DEPT/CC ON WITHDRAWAL THEN ALLOW.
      *------IF DEPT MATCHES BUT NOT CC DO NOT ALLOW.
      *------ALLOW ALL OTHER DEPTS DEPENDENT ON PREVIOUS RESTRICTIONS.
       6450-BEGIN-DEPT-CC-SEARCH.
           SET RESTRICT-DEPT-CC-NOT-FOUND TO TRUE.
           SET L-INDEX, D-INDEX  TO 1.

       6450-CHECK-DEPT-CC-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "X"
               NEXT SENTENCE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
      *------------ IF X THE ONLY RESTRICTION
      *------------   AND DEPT ON WITHDRAWAL FOUND THEN NOT AUTHORIZED
      *------------   OTHERWISE AUTHORIZED UNLESS CAUGHT BY A PREVIOUS
      *------------   RESTRICTION
                   IF RESTRICT-X-ONLY
                       IF RESTRICT-DEPT-CC-FOUND
                          GO TO 6450-NOT-AUTHORIZED
                       ELSE
                          GO TO 6500-CHECK-CHARGE-DEPT
                   ELSE
                       GO TO 6450-NOT-AUTHORIZED
               ELSE
                   GO TO 6450-CHECK-DEPT-CC-LINE.

       6450-CHECK-DEPT-CC.
           IF D-INDEX = 1
               IF RES-LINE-DATA (L-INDEX, D-INDEX) NOT = PER-DEPT
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6450-CHECK-DEPT-CC-LINE
               ELSE
                   SET D-INDEX UP BY 1
               END-IF
           END-IF
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = DE-EMPL
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET RESTRICT-DEPT-CC-FOUND TO TRUE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6450-CHECK-DEPT-CC-LINE
               ELSE
                   GO TO 6450-CHECK-DEPT-CC.

       6450-NOT-AUTHORIZED.
      *M-----  "NOT AUTHORIZED TO WITHDRAW, RESTRICTED BY CODE"
           MOVE  40        TO LANG-SETNUM.
           MOVE  83        TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE DE-CODE    TO MSG-FLD.
           MOVE   1        TO SUB.
           GO TO 6990-MAIN-X.

       6460-CHECK-CLASS-RESTRICTIONS.
           MOVE DE-CODE      TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF STR-CLASS = SPACES
               GO TO 6500-CHECK-CHARGE-DEPT.
           MOVE STR-CLASS    TO HOLD-RESTRICT.
           MOVE "C"          TO HOLD-RESTRICT-8.

           MOVE HOLD-RESTRICT TO CORPCDE OF DRESTRIC-REC.

           READ DRESTRIC     INTO BUF-DRESTRIC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
               GO TO 6500-CHECK-CHARGE-DEPT.
           SET RESTRICT-X-ONLY TO TRUE.

       6460-BEGIN-CC-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6460-CHECK-CC-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "C"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6460-READ-PER-DATA
               ELSE
                   GO TO 6460-CHECK-CC-LINE.

       6460-CHECK-CC-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = DE-EMPL
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6460-CHECK-CC-LINE
               ELSE
                   GO TO 6460-CHECK-CC-DATA.

       6460-READ-PER-DATA.
           MOVE DE-EMPL  TO PERCCNUM OF PER-PERSON-PC-REC-I.
           READ PER-PERSON-PC-I   INTO BUF-PER-PERSONNEL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
      *M---- "E17: EMPLOYEE ID DOES NOT EXIST"
               MOVE 05       TO LANG-SETNUM
               MOVE 17       TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE  1       TO SUB
               GO TO  6990-MAIN-X.

       6460-BEGIN-DEPT-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6460-CHECK-DEPT-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "D"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6460-BEGIN-CFT-SEARCH
               ELSE
                   GO TO 6460-CHECK-DEPT-LINE.

       6460-CHECK-DEPT-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = PER-DEPT
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6460-CHECK-DEPT-LINE
               ELSE
                   GO TO 6460-CHECK-DEPT-DATA.

       6460-BEGIN-CFT-SEARCH.
           SET L-INDEX, D-INDEX  TO 1.

       6460-CHECK-CFT-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "T"
               SET RESTRICT-MORE-THAN-X TO TRUE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
                   GO TO 6460-BEGIN-DEPT-CC-SEARCH
               ELSE
                   GO TO 6460-CHECK-CFT-LINE.

       6460-CHECK-CFT-DATA.
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = PER-CRAFT
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6460-CHECK-CFT-LINE
               ELSE
                   GO TO 6460-CHECK-CFT-DATA.

      *------THIS CHECK HAS BEEN ADDED TO RESTRICT TO CC IN DEPT.
      *------IF DEPT/CC MATCHES DEPT/CC ON WITHDRAWAL THEN ALLOW.
      *------IF DEPT MATCHES BUT NOT CC DO NOT ALLOW.
      *------ALLOW ALL OTHER DEPTS DEPENDENT ON PREVIOUS RESTRICTIONS.
       6460-BEGIN-DEPT-CC-SEARCH.
           SET RESTRICT-DEPT-CC-NOT-FOUND TO TRUE.
           SET L-INDEX, D-INDEX  TO 1.

       6460-CHECK-DEPT-CC-LINE.
           IF RES-DESC-BYTE (L-INDEX) = "X"
               NEXT SENTENCE
           ELSE
               SET L-INDEX UP BY 1
               IF L-INDEX > 46
                   SET L-INDEX TO 1
      *------------ IF X THE ONLY RESTRICTION
      *------------   AND DEPT ON WITHDRAWAL FOUND THEN NOT AUTHORIZED
      *------------   OTHERWISE AUTHORIZED UNLESS CAUGHT BY A PREVIOUS
      *------------   RESTRICTION
                   IF RESTRICT-X-ONLY
                       IF RESTRICT-DEPT-CC-FOUND
                          GO TO 6460-NOT-AUTHORIZED
                       ELSE
                          GO TO 6500-CHECK-CHARGE-DEPT
                   ELSE
                       GO TO 6460-NOT-AUTHORIZED
               ELSE
                   GO TO 6460-CHECK-DEPT-CC-LINE.

       6460-CHECK-DEPT-CC.
           IF D-INDEX = 1
               IF RES-LINE-DATA (L-INDEX, D-INDEX) NOT = PER-DEPT
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6460-CHECK-DEPT-CC-LINE
               ELSE
                   SET D-INDEX UP BY 1
               END-IF
           END-IF
           IF RES-LINE-DATA (L-INDEX, D-INDEX) = DE-EMPL
               GO TO 6500-CHECK-CHARGE-DEPT
           ELSE
               SET RESTRICT-DEPT-CC-FOUND TO TRUE
               SET D-INDEX UP BY 1
               IF D-INDEX > 10
                   SET D-INDEX TO 1
                   SET L-INDEX UP BY 1
                   GO TO 6460-CHECK-DEPT-CC-LINE
               ELSE
                   GO TO 6460-CHECK-DEPT-CC.

       6460-NOT-AUTHORIZED.
      *M-----  "NOT AUTHORIZED TO WITHDRAW, RESTRICTED BY CLASS"
           MOVE  40        TO LANG-SETNUM.
           MOVE  84        TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE STR-CLASS  TO MSG-FLD.
           MOVE   1        TO SUB.
           GO TO 6990-MAIN-X.


       6500-CHECK-CHARGE-DEPT.

      *---------- IN AKRON PLANTS, IF A NEW WORK (CHARGE TYPE 4) OR
      *           AN MACHINE DESIGN (CHARGE TYPE 5), CHARGE DEPT IS
      *           NOT REQUIRED.

           IF AKRON-PLANT
               IF DE-CHARGE-TYPE = "4" OR "5"
                   MOVE "    " TO  DE-CHARGE-DEPT-1-4
                   GO TO 6600-CHECK-EXP-CLASS.

           IF DE-CHARGE-DEPT-1-4 = SPACES
      *M----   "C110: CHARGE DEPT IS REQUIRED"
               MOVE   3        TO LANG-SETNUM
               MOVE 110        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4          TO SUB
               GO TO 6990-MAIN-X.

           MOVE "DP"           TO VALID-ARG-1-2.
           MOVE DE-CHARGE-DEPT-1-4 TO VALID-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA.
           IF COND-WORD = 17
      *M----   "D12: DEPARTEMENT CODE DOES NOT EXIST"
               MOVE   4        TO LANG-SETNUM
               MOVE  12        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE DE-CHARGE-DEPT TO MSG-FLD
               MOVE 4          TO SUB
               GO TO 6990-MAIN-X
           ELSE
           IF COND-WORD NOT = 0
               MOVE "BU"       TO RET-CODE
               GO TO 6990-MAIN-X.

           IF MP1-OVERRD-CHG-DEPT = "Y"
               IF STR-DIR-CHRG-DEPT-E = SPACES
                   MOVE HOLD-CHARGE-TYPE  TO DE-CHARGE-TYPE
               ELSE
                   MOVE STR-DIR-CHRG-DEPT-E   TO DE-CHARGE-DEPT-1-4
                   MOVE HOLD-CHARGE-TYPE      TO DE-CHARGE-TYPE.

           IF STR-REQ-CHG-OVERRD-E = "X"
               MOVE DE-REQ-DEPT          TO DE-CHARGE-DEPT-1-4
               MOVE HOLD-CHARGE-TYPE     TO DE-CHARGE-TYPE.


       6550-CHECK-CHARGE-TYPE.

      *---------- IN AKRON, THE WORKORDER CAN BE USED FOR IT, J, Z BILLS,
      *           MATERIAL TRANSFERS, AND SPECIAL STATIONERY.  IN THESE
      *           CASES WE DO NOT WANT A CHARGE TYPE ENTERED.

           IF AKRON-PLANT
               IF IT-J-Z-CHECK = "I" OR "J" OR "Z"
                 OR MT-CHECK = "MT"
                 OR STATIONERY-CHECK = "R" OR "D" OR "T" OR "S"
                   IF DE-CHARGE-TYPE > " "
      *M----           "D2: DO NOT ENTER CHARGE TYPE IF I, J, Z, OR MT"
                       MOVE  4 TO LANG-SETNUM
                       MOVE  2 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 5  TO  SUB
                       GO TO 6990-MAIN-X.


       6600-CHECK-EXP-CLASS.

      *---------- IN AKRON PLANTS, IF AN OPERATING EXPENSE (CHARGE TYPE
      *           IS BLANK), NO CHARGE ACCOUNT IS REQUIRED.  ACCOUNING
      *           WOULD LIKE AN "NC" IF ENTERED ON OPERATING ITEMS TO
      *           COME THROUGH NON-RIGHT-SHIFTED.  IF A CHARGE NUMBER
      *           IS ENTERED ON OPERATING EXPENSE ITEMS, IT GOES
      *           THROUGH WITHOUT EDITING.  IF A NEW WORK (CHARGE
      *           TYPE 4), A NEW WORK NUMBER IS REQUIRED, BUT IS NOT
      *           VALIDATED.  IF A MACHINE DESIGN, (CHARGE TYPE 5),
      *           A MACHINE DESIGN NUMBER IS REQUIRED BUT NOT VALIDATED.
      *           AND IF A RESEARCH AND DEVELOPMENT (CHARGE TYPE 1),
      *           AN R & D NUMBER IS REQUIRED BUT NOT VALIDATED.

      *------ PLANTS HAVE THE OPTION OF NOT VALIDATING THE EXP CLASS:
      *------ FOR PLANTS USING A STRANGE GAS FORMAT FOR EXP CLASS.
           IF EDIT-EXP-FLAG = "N" AND SCOM-PGM-KEY = "RQ"
               MOVE DE-EXP-CLASS TO RS-SHIFT-FLD
               CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD
               MOVE RS-SHIFT-FLD-3-8 TO DE-EXP-CLASS
               GO TO 6990-MAIN-X.

           IF AKRON-PLANT
               IF DE-CHARGE-TYPE = " "
                   IF DE-EXP-CLASS = SPACES OR "NC"
                       GO TO 6990-MAIN-X.

      *---------- IN AKRON PLANTS, THE EXPENSE CLASS IS IGNORED
      *           ON J, IT, AND Z BILLS, AND MATERIAL TRANSFERS
      *           AND SPECIAL STATIONERY. THERFORE WE DONT ALLOW
      *           ENTRY OF IT.

           IF AKRON-PLANT
               IF IT-J-Z-CHECK = "I" OR "J" OR "Z"
               OR STATIONERY-CHECK = "R" OR "D" OR "T" OR "S"
               OR MT-CHECK = "MT"
                 IF DE-EXP-CLASS > 0
      *M----       "EXPENSE CLASS SHOULD NOT BE ENTERED IF IT, J, OR Z"
                   MOVE   5    TO LANG-SETNUM
                   MOVE   3    TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE  6     TO SUB
                   GO TO 6990-MAIN-X
                 ELSE
                   GO TO 6990-MAIN-X.

      *------ SINCE AN EXP CLASS OF '000000' COULD BE VALID, WE HAVE TO
      *------ SAVE THE EXP CLASS BEFORE RIGHT SHIFTING
           MOVE DE-EXP-CLASS   TO   SAVE-EXP-CLASS.

           MOVE DE-EXP-CLASS   TO   RS-SHIFT-FLD.
           CALL "TRSHIFT" USING RS-RET-CODE, RS-SHIFT-FLD.
           MOVE RS-SHIFT-FLD-3-8 TO   DE-EXP-CLASS.

      *------ THE FOLLOWING IS THE DEFAULT EXPENSE CLASS LOGIC.
      *       THIS DOES NOT APPLY TO THE AKRON COMPLEX.  IN KELLY
      *       PLANTS, THE DEFAULT IS USED ONLY IF ENTERED EXP CLASS
      *       IS LESS THAN 300. FOR PLANTS OTHER THAN KELLY AND AKRON,
      *       DB FLAG TELLS WHETHER WORKORDER EXP CLASS OVERRIDES
      *       DEFAULT MP1 EXP CLASS, AND IF ENTERED EXP CLASS OVERRIDES
      *       DEFAULT MP1 EXP CLASS.
      *       NON-AKRON, NON-KELLY DEFAULT TABLE:
      *
      *           WO OVERRIDES EXP / ENTRY OVERRIDES EXP
      *  WO      EXP        Y/Y      Y/N      N/Y       N/N
      *  -----   -------    ------------------------------------
      *  SPACES  SPACES     OVERRD   OVERRD   OVERRD    OVERRD
      *  SPACES  1234       ....     OVERRD   ....      OVERRD
      *  56H     SPACES     N O T   P O S S I B L E
      *  56H     1234       ....     ....     ....      OVERRD
      *
      *
      *  DEFAULTS:   ENTRY-OVERRD-EXP = "N"  (DEFAULT OVERRIDES ENTRY)
      *              WO-OVERRD-EXP    = "Y"  (WO OVERRIDES DEFAULT)

      *********************************************************************
      **  THIS BLOCK OF CODE WAS REPLACED BY THE FOLLOWING BLOCK ON      **
      **  02/13/92 BY W. ROXBURY PER REQUEST #6155 REQUESTED BY          **
      **  LOU VAOW IN FAYETTEVILLE.                                      **
      *********************************************************************
      *    IF NOT AKRON-PLANT                                             *
      *        IF STR-EXP-CLASS > SPACES                                  *
      *            IF PLANT-CODE = "211" OR "281" OR "284" OR "285"       *
      *                IF DE-EXP-CLASS < "000300"                         *
      *                    MOVE STR-EXP-CLASS TO   DE-EXP-CLASS           *
      *                ELSE                                               *
      *                    NEXT SENTENCE                                  *
      *            ELSE                                                   *
      *            IF DE-WO = SPACES AND  SAVE-EXP-CLASS = SPACES         *
      *                MOVE STR-EXP-CLASS     TO   DE-EXP-CLASS           *
      *            ELSE                                                   *
      *            IF DE-WO = SPACES AND SAVE-EXP-CLASS > SPACES          *
      *                IF ENTRY-OVERRD-EXP = "Y"                          *
      *                    NEXT SENTENCE                                  *
      *                ELSE                                               *
      *                    MOVE STR-EXP-CLASS TO   DE-EXP-CLASS           *
      *            ELSE                                                   *
      *                IF ENTRY-OVERRD-EXP = "Y" OR WO-OVERRD-EXP = "Y"   *
      *                    NEXT SENTENCE                                  *
      *                ELSE                                               *
      *                    MOVE STR-EXP-CLASS TO   DE-EXP-CLASS.          *
      *********************************************************************

           IF NOT AKRON-PLANT
               IF STR-EXP-CLASS > SPACES
      *            IF PLANT-CODE = "211" OR "281" OR "284" OR "285"
                   IF PLANT-CODE = "211" OR "281" OR "284"
                       IF SAVE-EXP-CLASS = SPACES
                           IF PLANT-CODE = "285"
                               IF DE-EXP-CLASS < "000300"
                                   MOVE STR-EXP-CLASS TO DE-EXP-CLASS
                               ELSE
                               NEXT SENTENCE
                           ELSE
      *M----               "A12: ACCOUNT IS REQUIRED"
                           MOVE  1 TO LANG-SETNUM
                           MOVE 12 TO LANG-MSGNUM
                           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                           MOVE 6  TO SUB
                           MOVE SPACES TO DE-EXP-CLASS
                           GO TO 6990-MAIN-X
                       ELSE
                       IF DE-EXP-CLASS < "000300"
                           MOVE STR-EXP-CLASS TO DE-EXP-CLASS
                       ELSE
                           NEXT SENTENCE
                   ELSE
                   IF DE-WO = SPACES AND SAVE-EXP-CLASS = SPACES
                       MOVE STR-EXP-CLASS TO DE-EXP-CLASS
                   ELSE
                   IF DE-WO = SPACES AND SAVE-EXP-CLASS > SPACES
                       IF ENTRY-OVERRD-EXP = "Y"
                           NEXT SENTENCE
                       ELSE
                           MOVE STR-EXP-CLASS TO DE-EXP-CLASS
                   ELSE
                       IF ENTRY-OVERRD-EXP = "Y" OR WO-OVERRD-EXP = "Y"
                           NEXT SENTENCE
                       ELSE
                           MOVE STR-EXP-CLASS TO DE-EXP-CLASS.

           IF AKRON-PLANT
               IF DE-CHARGE-TYPE = " "
                   GO TO 6990-MAIN-X
               ELSE
               IF DE-CHARGE-TYPE = "4"
                   IF SAVE-EXP-CLASS = SPACES
      *M----           "M31: MUST ENTER A NEW WORK NUMBER"
                       MOVE 13 TO LANG-SETNUM
                       MOVE 31 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 6  TO SUB
                       GO TO 6990-MAIN-X
                   ELSE
                       GO TO 6990-MAIN-X
               ELSE
               IF DE-CHARGE-TYPE = "5"
                   IF SAVE-EXP-CLASS = SPACES
      *M----           "M29: MUST ENTER A MACHINE DESIGN NUMBER"
                       MOVE 13 TO LANG-SETNUM
                       MOVE 29 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 6  TO SUB
                       GO TO 6990-MAIN-X
                   ELSE
                       GO TO 6990-MAIN-X
               ELSE
               IF DE-CHARGE-TYPE = "1"
                   IF SAVE-EXP-CLASS = SPACES
      *M----           "M30: MUST ENTER AN R & D NUMBER"
                       MOVE 13 TO LANG-SETNUM
                       MOVE 30 TO LANG-MSGNUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 6  TO SUB
                       GO TO 6990-MAIN-X
                   ELSE
DP9804                 GO TO 6990-MAIN-X.

DP9804*----- 03APR1998 COMMENTED OUT THE FOLLOWING LOGIC FOR AKRON
DP9804*-----  CHARGE TYPES 2 AND 3.  THIS NEW LOGIC LED TO MORE ERRORS
DP9804*-----  THAN IT WAS ABLE TO PREVENT.  FURTHER STUDY IS NEEDED.
DP9804*                GO TO 6990-MAIN-X
DP9804*        ELSE
      *---------- JSB 2/2/98 FOR CHARGE TYPE OF 2 ONLY ALLOW
      *----------   ACCOUNTS 450 AND GREATER
DP9804*        IF DE-CHARGE-TYPE = "2"
DP9804*            IF SAVE-EXP-CLASS < "000450"
      *M----           ACCOUNT MUST BE 450 AND HIGHER FOR CHARGE TYPE
DP9804*                 MOVE   1        TO LANG-SETNUM
DP9804*                 MOVE  42        TO LANG-MSGNUM
DP9804*                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
DP9804*                 MOVE 6          TO SUB
DP9804*                 GO TO 6990-MAIN-X
DP9804*            ELSE
DP9804*                GO TO 6990-MAIN-X
DP9804*       ELSE
      *---------- JSB 2/2/98 FOR CHARGE TYPE OF 3 ONLY ALLOW
      *----------   ACCOUNTS LESS THAN 450.
DP9804*        IF DE-CHARGE-TYPE = "3"
DP9804*            IF SAVE-EXP-CLASS NOT < "000450"
      *M----           ACCOUNT MUST BE LESS THAN 450 FOR CHARGE TYPE
DP9804*                 MOVE   1        TO LANG-SETNUM
DP9804*                MOVE  43        TO LANG-MSGNUM
DP9804*                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
DP9804*                 MOVE 6          TO SUB
DP9804*                 GO TO 6990-MAIN-X
DP9804*            ELSE
DP9804*                GO TO 6990-MAIN-X.

           IF SAVE-EXP-CLASS = SPACES AND DE-EXP-CLASS = "000000"
           AND STR-EXP-CLASS = SPACES
      *M----   "A12: ACCOUNT IS REQUIRED"
               MOVE   1        TO LANG-SETNUM
               MOVE  12        TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 6          TO SUB
               GO TO 6990-MAIN-X.

      *------- NON-NUMERIC EXPENSE/NEW WORKS ARE NOW ALLOWED FOR ALL PLANTS.
      *------- THERE ARE NO DISTINCTIONS BETWEEN EXPENSE CLASS AND NEW WORK
      *------- CODES (PREVIOUSLY, CODES OVER 10,000 WERE NEW WORKS, AND CODES
      *------- UNDER 10,000 WERE EXPENSE CLASSES. IN UC, THE CUTOFF WAS 1,000)
           MOVE "EC"           TO    VALID-ARG-1-2.
           MOVE DE-EXP-CLASS   TO    VALID-ARG-3-10.
           PERFORM 9000-START-MVALIDPLTDATA.
           IF COND-WORD = 17
               MOVE "NW"       TO   VALID-ARG-1-2
               PERFORM 9000-START-MVALIDPLTDATA
               IF COND-WORD = 17
      *M----       "INVALID ACCOUNT"
                   MOVE   9    TO LANG-SETNUM
                   MOVE  71    TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE DE-EXP-CLASS TO MSG-FLD
                   MOVE 6      TO SUB
                   GO TO 6990-MAIN-X
               ELSE
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
                   MOVE "BU"   TO   RET-CODE
                   GO TO 6990-MAIN-X
           ELSE
           IF COND-WORD NOT = 0
               MOVE "BU"       TO   RET-CODE
               GO TO 6990-MAIN-X.

       6990-MAIN-X.
           GOBACK.

       9000-START-MVALIDPLTDATA.
           MOVE 0              TO COND-WORD.
           MOVE VALID-ARG      TO VALDTAKEY OF MVALIDPLTDATA-REC.
           START MVALIDPLTDATA KEY = VALDTAKEY OF MVALIDPLTDATA-REC
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17     TO COND-WORD
               ELSE
                   MOVE 99     TO COND-WORD.

       9010-START-MPLTINFO.
           MOVE 0              TO COND-WORD.
           MOVE PLT-ARG        TO PLTINFOKEY OF MPLTINFO-REC.
           START MPLTINFO      KEY = PLTINFOKEY OF MPLTINFO-REC
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17     TO COND-WORD
               ELSE
                   MOVE 99     TO COND-WORD.

       999-CATREAD.
           MOVE LANG-SETNUM    TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM    TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.
