000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TIRSNGL.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        7/1/83.
000600 DATE-COMPILED.
000700 INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800 SECURITY.
000900*REMARKS.             SINGLE ISSUE AND RETURN SUBPROGRAM.
001000*
001100*    ON NOVEMBER 15, 1983, CHANGED PRINT ROUTINE TO FORM FEED
001200*    TWICE AFTER THE PRINTOUT IS DONE.  THIS IS FOR 5.5 INCH
001300*    PAPER.  FORM LENGTH ON PRINTER MUST NOW BE SET TO 5.5.
001400*    ONLY GADSDEN AND DANVILLE HAVE THE HALF SHEETS NOW.
001500*
001600*    ON NOVEMBER 18, 1983, ADDED LAWTON TO THE HALF-SHEET
001700*    PLANTS.  CIH.
001800*
001900*    ON NOVEMBER 30, 1983, CHANGED PARAMETERS FOR CALL TO
002000*    "TSPLPRT".  NOW RETURNS ENTIRE SPOOLER REC, BUT NO
002100*    MESSAGE BUFFER.  CIH.
002200*
002300*    ON FEBRUARY 10, 1983, CHANGED PARAMETERS FOR CALL TO
002400*    "TREQFILU".  THE FIELDS "STR-RESERVED" AND "
002500*    "SAVE-RSRVD-BEFORE" WERE ADDED.  THIS IS BECAUSE THE
002600*    REQFILE UPDATE SUBPROGRAM WILL NOW CREATE AUTO REQS ON THE
002700*    BASIS OF AVAILABLE RATHER THAN ONHAND.  CIH.
002800*
002900*    ON APRIL 26, 1984, MADE THE FOLLOWING CHANGES:
003000*    1. CHANGED PARAMETERS TO INCLUDE ENTIRE
003100*       SPOOLER REC (USER, ACCOUNT, TERM NUMBER, AND ALL 5 SPOOLER
003200*       NUMBERS), RATHER THAN JUST SPOOL-PRT.  THIS IS BECAUSE THE
003300*       5TH SPOOLER NUMBER WAS USED TO DETERMINE WHETHER HALF-SHEET,
003400*       PAPER WAS BEING USED, BUT THIS KEY WAS LOST WHEN GOING
003500*       BETWEEN SUB-PROGRAMS.  CIH.
003600*
003700*    ON AUGUST 10, 1984, CHANGED THE "DDAILYTC-LIST" TO
003800*    "ALL-ITEMS", BECAUSE WE CHANGED THE DATA ITEMS IN THE
003900*    DDAILYTC DATA-SET, AND ALL PLANTS DO NOT YET HAVE THE
004000*    CHANGE.  CIH.
004100*
004200*    ON SEPT 10, 1984, MADE THE FOLLOWING CHANGES:
004300*      1.  ADDED A "BASE" PARAMETER FOR THE CALL TO "TREQFILU".
004400*          THIS IS BECAUSE THE KSAM FILE "REQFILE" IS GOING
004500*          TO BE ELIMINATED AND THE DATA PUT IN A NEW DATA
004600*          SEGMENT IN THE STORES DATABASE.  THE REQFILE FILE
004700*          NUMBER PARAMETER IS LEFT IN THE CALL SO THAT PROGRAMS
004800*          WILL WORK ON EITHER THE KSAM REQFILE OR THE DATABASE
004900*          REQFILE (SINCE "TREQFILU" IS IN THE ACCOUNT SL, NO
005000*          DIFFERENT VERSIONS OF PROGRAMS WILL HAVE TO BE
005100*          MAINTAINED FOR PLANTS THAT HAVE NOT YET MADE THE
005200*          DATABASE CHANGE).
005300*
005400*      2.  TOOK OUT THE OPEN OF THE KSAM FILE "REQFILE", AND ALL
005500*          THE KSAM WORK AREAS.  FROM NOW ON, THE OLD VERSION
005600*          OF "TREQFILU" (KSAM VERSION) WILL OPEN THE REQFILE
005700*          IF THE PASSED FILE NUMBER IS 0, THEN WILL RETURN THE
005800*          FILE NUMBER OF THE OPENED FILE.  THIS WAY THE FILE
005900*          WILL BE OPENED ONLY ONCE.  (THERE WILL BE NO FORMAL
006000*          CLOSE OF THE REQFILE).  FOR THE NEW VERSION OF
006100*          "TREQFILU" (DATABASE VERSION), OF COURSE NO KSAM
006200*          OPEN WILL BE NEEDED (AND THE REQFILE FILE NUMBER
006300*          PASSED WILL BE IGNORED). CIH.
006400*
006500*    ON OCT 8, 1984, CHANGED THIS SUBPROGRAM TO WORK FOR BOTH
006600*    THE AKRON PLANTS AND THE SUB-PLANTS.  FORMERLY THERE WAS
006700*    A SEPERATE VERSION OF ALL THE STORES PROGRAMS FOR AKRON
006800*    PLANTS.  THIS INVOLVED THE FOLLOWING CHANGES:
006900*        1.  THE "DEFAULT EXPENSE CLASS" LOGIC WAS MOVED FROM
007000*            THIS SUBPROGRAM INTO THE "TIREDIT" EDITING SUB-
007100*            PROGRAM.  THIS REQUIRED ADDING THE "STR-EXP-CLASS"
007200*            AS A PARAMETER TO THE CALL OF "TIREDIT".
007300*            (DEFAULT EXP CLASS IS NOT USED IN AKRON, AND THE
007400*            EDITING SUB-PROGRAM WILL HANDLE THESE DIFFERENCES).
007500*
007600*        2.  AN "IF AKRON" STATEMENT WAS ADDED FOR UPDATING OF
007700*            LAST CHARGE DEPT.  THE STORES PROGRAMS ARE USED
007800*            FOR Z, IT, J BILLS, MATERIAL TRANSFERS, AND SPECIAL
007900*            STORES ISSUES.  IN THESE CASES, DIFFERENT FIELDS
008000*            MAY UPDATE "STR-LAST-CHARGE" OTHER THAN THE CHARGE
008100*            DEPT FIELD.  HOPEFULLY, SOON THESE FUNCTIONS WILL
008200*            BE MOVED OUT OF THE STORES PROGRAMS TO A SEPERATE
008300*            PROGRAM (WHERE THEY SHOULD BE).  AT THIS TIME THIS
008400*            LOGIC WILL BE REMOVED.
008500*
008600*        3.  THE "TIREDIT", "TQTYEDIT", "TWSPRT" SUBPROGRAMS WERE
008700*            CHANGED WITH SPECIAL LOGIC FOR AKRON.
008800*
008900*        4.  IN THE PRINT ROUTINE, IF AKRON A "CENTER" HEADING
009000*            IS ADDED FOR THE WORK CENTER FIELD.
009100*
009200*        5.  A DIFFERENT FORMS FILE IS MAINTAINED FOR AKRON AND THE
009300*            PLANTS.  THE AKRON VERSION HAS A "WORK CENTER" FIELD.
009400*            THE PLANT VERSION HAS THIS FIELD, BUT IT IS DISPLAY
009500*            ONLY, NO ENHANCEMENTS (INVISIBLE).  (THUS THE SCREEN
009600*            BUFFER IS THE SAME IN THE PROGRAM).  THE AKRON VERSION
009700*            HAS A 1 BYTE "CHARGE TYPE FIELD".  THE PLANTS VERSION
009800*            HAS A 2 BYTE EXTENSION TO THE CHARGE DEPT.  SO ON
009900*            THE AKRON FORM FILE, THE SECOND HALF THE THIS EXTENSION
010000*            FIELD WAS CHANGED TO  DISPLAY ONLY, NO ENHANCEMENTS.
010100*            (ONCE AGAIN, SO THAT THE SCREEN BUFFER DOES NOT NEED
010200*            TO BE DIFFERENT FOR THE TWO VERSIONS).
010300*             CIH.
010400*
010500*    ON OCT 27, 1984, CHANGED THIS SUBPROGRAM TO BE CALLED
010600*    BY THE NEW MAIN PROGRAM "TRMCORR". THIS PROGRAM WILL BE
010700*    DOING SPECIAL ISSUES AND RETURNS (SINGLE ITEM ONLY),
010800*    DESIGNATED "BANBURY EXPLOSION CORRECTIONS".  THESE
010900*    TRANSACTIONS ARE IDENTICAL TO NORMAL ISSUES AND RETURNS,
011000*    EXCEPT THAT THE WORKORDER FIELD IS USED TO HOLD THE
011100*    PRODUCTION DATE OF THE BANBURY EXPLOSION BEING
011200*    CORRECTED.  FOR EXAMPLE, ON JANUARY 1, THE USER MAY BE
011300*    DOING CORRECTIONS TO BANBURY PRODUCTION DONE ON
011400*    DECEMBER 31.  THE REASON THE PRODUCTION DATE MUST BE
011500*    ENTERED IS BECAUSE THE PLANTS WANT USAGE TO BE UPDATED
011600*    BY THE ACTUAL PRODUCTION DATE, AND THEY WANT THE MONTH
011700*    END PROCESSING TO BE CUT OFF BY PRODUCTION DATE ALSO.
011800*    IN THIS WAY, ANY USAGE FIGURES FOR ANY MONTH ON THE HP
011900*    SHOULD MATCH THE USAGE AS REPORTED BY THE PLANT'S
012000*    ACCOUNTING PROGRAMS.  ALSO, FOR MONTH END PROCESSING,
012100*    BANBURY EXPLOSION CORRECTIONS WILL BE HELD BACK OR LET
012200*    THRU BASED ON ACTUAL PRODUCTION DATE.  CIH.
012300*
012400*    ON JANUARY 9, 1984, ADDED A FIELD TO SHOW THE AVAILABLE
012500*    ONHAND QUANTITY TO THE ISSUE SINGLE/RETURN SINGLE SCREEN.
012600*    CIH.
012700*
012800*    ON JANUARY 23, 1985, CHANGED THE "K-TERMINAL" PARAMETER
012900*    (THE TERMINAL NUMBER OBTAINED FROM "TSPLPRT", WHICH IS PASSED
013000*    BACK AND FORTH TO "TIRMAIN") FROM 9(2) TO 9(4).  CIH.
013100*
013200*    ON MARCH 23, 1985, CHANGED THE PROGRAM TO BE FLEXIBLE FOR
013300*    EUROPEAN DATE FORMATS BY CALLING THE SUBPROGRAM "TDATECHK"
013400*    TO HANDLE ALL DATE WORK.  THE DATE WILL APPEAR IN EUROPEAN
013500*    FORMAT ON THE PRINTOUT IF AT A EUROPEAN PLANT (AS DETERMINED
013600*    BY THE SUBPROGRAM BY CHECKING FOR THE EXISTENCE OF THE
013700*    FILE "DDATECOD/DONTPURG.PUB").  FOR THE BANBURY CORRECTION
013800*    MODE, THE PRODUCTION DATE WILL BE EDITED BY THE SUBPROGRAM
013900*    ALSO, ALLOWING EUROPEAN PLANTS TO ENTER THE DATE AS
014000*    DAY, MONTH, YEAR, AND AMERICAN PLANTS TO ENTER THE DATE AS
014100*    MONTH, DAY, YEAR.  CIH.
014200*
014300*   10/08/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND
014400*             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE
014500*             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND
014600*             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.
014700*   10/08/85  CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,
014800*             TDATECHK TO TDATECK2.
014900*             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE
015000*             SUPPORT VERSIONS OF THESE SUBROUTINES.
015100*                                            -TW COTTON.
015200*
015300*   06/17/86  TOOK OUT CALL TO "TBLDSDTA", WHICH GOT DESCRIPTION
015400*             AS WELL AS SET UP BIN DISPLAY, AND REPLACED WITH CALL
015500*             TO "CDESC" TO GET THE NEW DESCRIPTION INFO IN THE
015600*             "DMANPART" DATASET.  CIH.
015700*
015800*
015900*      DATE 6/19/86                 A.M. KRAUSS
016000*         1. HARD-CODED ESCAPE SEQUENCES REMOVED FROM
016100*            PROGRAM.  THEY ARE NOW TO BE EXTERNALLY
016200*            SUPPLIED.
016300*         2. THE MAIN PROGRAM IN A JOB STREAM WILL
016400*            COPY ESC-NAM2 THAT CONTAINS THE HP
016500*            ESCAPE SEQUENCES.  IT WILL ALSO CALL
016600*            TESCSEQ THAT CONTAINS THE NON-HP ESCAPE
016700*            SEQUENCES, IF ANY ARE USED.  THE NON-HP
016800*            SEQUENCES WILL OVERRIDE THE HP SEQUENCES.
016900*         3. THE ACTUAL PRINTING PROGRAM WILL GET THE
017000*            APPROPRIATE SEQUENCES PASSED DOWN TO IT
017100*            THRU THE INTERMEDIATE SUBROUTINES THAT
017200*            COPY ESC-NAME.
017300*C
017300*C  08-25-92   BK DISMUKES  REQUEST# 6252
017300*C     1. ADDED LOGIC TO PASS STR-RESTRICTED-FLG TO TIREDIT.
017300*C
017300*C  10-23-92   BK DISMUKES  REQUEST# 6015
017300*C     1. ADDED LOGIC TO DISPLAY ONHAND FOR EACH STOREROOM
017300*C        LOCATION
      *C
      *C   04NOV1994    WILL MCINTYRE   REQUEST 94-027
      *C     ADDED CODE TO PASS NEW PARMS TO TQTYEDIT, TO CHECK FOR LIMITS
      *C     ON STOREROOM RETURNS.
      *C
      *C   AUGUST 1996  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     INCLUDE CENTURY ON ACTIVITY AND ISSUE DATES.
017300*C
      *C   MAY 2, 1997  JEFF BUNGO
      *C     WRITE TC333/433 FOR EACH OWNER OF A BIN THAT AN
      *C     ISSUE IS MADE FROM.  DISPLAY OWNER OF BINS ON
      *C     THE WITHDRAWL SCREEN.  EDITS TO FORCE ISSUE FROM
      *C     GOODYEAR BINS FIRST MADE IN TQTYEDIT.
      *C
      *C   JULY 22, 1997 JEFF BUNGO
      *C     IF DISPLAYING A QUANTITY ERROR REPLACE ZERO QUANTITIES
      *C     WITH SPACES.  THIS IS TO AVOID ERRORS IN DATA
      *C     ENTRY WHERE THE ZEROS ARE NOT FIELD EXITED.
017300*C
      *C   OCTOBER 1995  JIM COFFMAN
      *C     CHANGED ISSPARTS PARAMETERS TO BE INCLUDED IN A COPYLIB
      *C     MEMBER. THIS WAS NECESSARY TO ALLOW THE AREA TO BE
      *C     EXPANDABLE TO CONTAIN THE LINK TO A WORK ORDER LOGIC
      *C     REQUEST NOW AVAILABLE IN AN E1 REQUISITION CREATE.
      *C
      *C   SEPT 22, 1998  CA YODER
      *C     ADDED CALL TO MCXSNDMSG TO SEND A MESSAGE TO USERS
      *C     SPECIFIED IN MCFPCSUSER FILE WHEN A PARTICULAR CODE
      *C     IS WITHDRAWN FROM THE STOREROOM.
      *C
017400 ENVIRONMENT DIVISION.
017500 CONFIGURATION SECTION.
017600 SOURCE-COMPUTER.  HP-3000.
017700 OBJECT-COMPUTER.  HP-3000.
017800 COPY SPECIALN IN COPYLIB.
017900
018000 INPUT-OUTPUT SECTION.
018100 FILE-CONTROL.
           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DT-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZUDCSTR-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

           SELECT USER-I
               ASSIGN         TO DATABASE-MCFLCSUSER
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                              WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

018300
018400 DATA DIVISION.
018500 FILE SECTION.
018600
018700*------ FD STATEMENTS FOR IBM ONLY ------*
018800 FD  MSTORERM-CD-O
018900     LABEL RECORDS ARE STANDARD.
019000 01  MSTORERM-CD-REC-O.
019100     COPY DDS-MCRPCS0200 OF MCFLCS0201.
019200
018800 FD  MPLTINFO
018900     LABEL RECORDS ARE STANDARD.
019000 01  MPLTINFO-REC.
019100     COPY DDS-MCRPCS0500 OF MCFLCS0501.
019200
019300 FD  DDAILYTC-DT-O
019400     LABEL RECORDS ARE STANDARD.
019500 01  DDAILYTC-DT-REC-O.
019600     COPY DDS-MCRPCS1600 OF MCFLCS1601.
019700
019800 FD  DISPLAY-FILE
019900     LABEL RECORDS ARE OMITTED.
020000 01  DISPLAY-REC                   PIC X(1500).
020100
       FD  USER-I
           LABEL RECORDS ARE STANDARD.
       01  USER-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCSUSER.

020200*------ FD STATMENT AREA FOR IBM ONLY ------*
020300
020400 WORKING-STORAGE SECTION.
020500
020600 77  FIRST-TIME-FLAG               PIC X(1)  VALUE "Y".
020700 77  SAVE-ONHAND-BEFORE            PIC S9(8) VALUE 0.
020800 77  SAVE-RSRVD-BEFORE             PIC S9(8) VALUE 0.
020900 77  AVAIL                         PIC S9(8) VALUE 0.
021000 77  SAVE-EMPL                     PIC X(4).
021100 77  LINE-ADV                      PIC 9(1)  VALUE 0.
021200 77  BANBURY-CORR-FLAG             PIC X(1)  VALUE "N".
021300 77  DUMMY-REQFILNO                PIC S9(4) BINARY VALUE 0.
021400 77  SAVE-PARA-NUMBER              PIC 9(2)  VALUE 0.
021500 77  ALT-KEY-ARG                   PIC X(40) VALUE SPACES.
021600 77  ALT-CORP-CODE                 PIC X(8)  VALUE SPACES.
021700 77  HANDLE-BLOWUP-FLAG            PIC X     VALUE "Y".
       77  USER-FILE-EXISTS              PIC X     VALUE "N".
021800
021900 COPY FILESTAT IN COPYLIB.
022000
022100**************************************************************
022200**                                                          **
022300**            D A T E / T I M E   A R E A S                 **
022400**                                                          **
022500**************************************************************
022600
022700 01  YMD-WORK.
022800     05  YMD-YY                    PIC X(2).
022900     05  YMD-MM                    PIC X(2).
023000     05  YMD-DD                    PIC X(2).
023100
023200*************************************************************
023300**                                                          **
023400**          C O M M U N I C A T I O N S   A R E A S         **
023500**                                                          **
023600**************************************************************
023700
023800 01  BUDGET-MESSAGE                PIC X(80).
023900
       COPY ISSPARTS IN COPYLIB.

024000*01  MMIS-WORK.
024100*    05  MMIS-WO                   PIC X(10).
024200*    05  MMIS-ST-CODE              PIC X(8).
024300*    05  MMIS-QTY                  PIC S9(8).
024400*    05  MMIS-AVGCST               PIC S9(11)V9(4).
024500*    05  MMIS-CHRG-DEPT            PIC X(4).
024600*    05  MMIS-EXP-CLASS.
024700*        10  MMIS-EXP-CLASS-1-2    PIC X(2).
024800*        10  MMIS-EXP-CLASS-3-8    PIC X(6).
024900*    05  MMIS-DESC                 PIC X(46).
025000*    05  MMIS-STAT                 PIC XX.
025100*    05  MMIS-UM                   PIC XX.
025200*    05  MMIS-EMP-ID               PIC X(4).
025300*
025400 COPY TBLOWUP    IN COPYLIB.
025500 01  RET-CODE.
025600     05  FILLER                    PIC X(1)  VALUE SPACES.
025700     05  RET-CODE-2                PIC X(1)  VALUE SPACES.
025800
025900 01  KSAM-STAT-SAVE                PIC X(2)  VALUE SPACES.
026000
026100 01  SUB                           PIC 9(1)  VALUE 0.
026100 01  SUB2                          PIC 9(1)  VALUE 0.
026200
026300 01  QEDIT-TOTAL-QTY-X             PIC X(8).
026400 01  QEDIT-TOTAL-QTY REDEFINES QEDIT-TOTAL-QTY-X PIC 9(8).
026500 01  QEDIT-PLANT-CODE              PIC X(3).
       01  WARNING-FLAG                  PIC X(01) VALUE "N".
       01  WARNING-TYPE                  PIC X(01) VALUE " ".
       01  WARNING-VALUE                 PIC 9(08) VALUE 0.

      *----------- MESSAGE PARAMETER FOR CALL TO MCXSNDMSG.
       01  MCXSNDMSG-PARM.
           05  MCXSNDMSG-CODE            PIC X(08).
           05  FILLER                    PIC X.
           05  MCXSNDMSG-MSG             PIC X(70).
           05  FILLER                    PIC X(433).
026600
027700 COPY TIREDIT    IN COPYLIB.
027600
027700 COPY TDATECHK   IN COPYLIB.
027800 COPY CDESC      IN COPYLIB.
027900 COPY COMMAND    IN COPYLIB.
028000 COPY CATREAD    IN COPYLIB.
028100 COPY IOFEEDBACK IN COPYLIB.
028200 COPY DISPDAT2   IN COPYLIB.
028300
028400**************************************************************
028500**                                                          **
028600**                  V I E W   W O R K                       **
028700**                                                          **
028800**************************************************************
028900 COPY FUNCTDEF   IN COPYLIB.
029000**  SEE LINKAGE SECTION FOR VIEW-COMAREA
029100
029200 COPY HMSGBUF IN COPYLIB.
029600
029700 01  FIELD-NUMBER                  PIC S9(4) BINARY VALUE 1.
029800
029900**************************************************************
030000**                                                          **
030100**            D A T A B A S E   W O R K                     **
030200**                                                          **
030300**************************************************************
030400 COPY DATAB3 IN COPYLIB.
030500 COPY DBMODES IN COPYLIB.
030600
030700 01  MULTI-LOCK.
030800     05  NUMBER-OF-LOCK-DESCRIPTORS PIC S9(4) BINARY VALUE 1.
030900     05  LOCK-MSTORERM.
031000         10  LOCK-LENGTH           PIC S9(4) BINARY VALUE 24.
031100         10  LOCK-DSET             PIC X(16)  VALUE "MSTORERM;".
031200         10  LOCK-ITEM-LIST        PIC X(16)  VALUE "CORP-CODE;".
031300         10  LOCK-REL-OP           PIC XX     VALUE "= ".
031400         10  LOCK-VALUE            PIC X(12)  VALUE SPACES.
031500     05  LOCK-DRESERVE.
031600         10  LOCK-LENGTH2          PIC S9(4) BINARY VALUE 24.
031700         10  LOCK-DSET2            PIC X(16) VALUE "DRESERVE;".
031800         10  LOCK-ITEM-LIST2       PIC X(16) VALUE "RSRV-WONO;".
031900         10  LOCK-REL-OP2          PIC X(2)  VALUE "= ".
032000         10  LOCK-VALUE2           PIC X(12) VALUE SPACES.

      *---5/2/97, JSB HOLDING AREA FOR FRANCHISERS
       01  FRAN-TABLE.
           05  FRAN-ENTRY OCCURS 4 TIMES INDEXED BY FRAN-IDX.
               10  FRAN-ID             PIC X(1).
               10  FRAN-NAME           PIC X(4).
               10  FRAN-VEN0CODE       PIC X(10).

      *----5/2/97, HOLDING AREA FOR ISSUE FROM EACH BIN OWNER.
       01  OWNER-TABLE.
          05  OWNER-ENTRY OCCURS 6 TIMES INDEXED BY OWNR-IDX.
              10  OWNR                PIC X(4).
              10  OWNR-QTY            PIC 9(9).
       01  CURR-OWNR                  PIC 9(1).
       01  MAX-OWNRS                  PIC 9(1).
       01  HOLD-FRAN-ID               PIC X(1).

032100
032200**************************************************************
032300**                                                          **
032400**           D A T A B A S E   B U F F E R S                **
032500**                                                          **
032600**************************************************************
032700
032800 COPY MSTORERM   IN COPYLIB.
032900 COPY DDAILYTC   IN COPYLIB.
033000 COPY TC333      IN COPYLIB.
033100 COPY TC433      IN COPYLIB.
033200 COPY TC330      IN COPYLIB.
033300 COPY TC430      IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTFRAN   IN COPYLIB.
       COPY USERFILE   IN COPYLIB.
033400
033500**************************************************************
033600**                                                          **
033700**                  S C R E E N   D A T A                   **
033800**                                                          **
033900**************************************************************
034000
034400 01  DE-FIELDS-1.
034500     05  DE-CODE                   PIC X(12).
034600     05  V-INSTRUCTION             PIC X(62).
034700     05  V-CODE                    PIC X(8).
034800     05  V-KWRD-ADJ                PIC X(46).
034900     05  V-UM                      PIC XX.
035000     05  V-AVAIL                   PIC ---------9.
035100     05  V-DESC                    PIC X(72).
035200     05  DE-CHARGE-DATA.
035300         10  DE-EMPL               PIC X(4).
035400         10  DE-WO.
035500             15  MT-CHECK.
035600                 20  STATIONERY-CHECK    PIC X(1).
035700                 20  FILLER        PIC X(1).
035800             15  FILLER            PIC X(1).
035900             15  IT-J-Z-CHECK      PIC X(1).
036000             15  FILLER            PIC X(6).
036100         10  DE-PROD-DATE REDEFINES DE-WO.
036200             15  PROD-DT-MM        PIC X(2).
036300             15  PROD-SLASH-1      PIC X(1).
036400             15  PROD-DT-DD        PIC X(2).
036500             15  PROD-SLASH-2      PIC X(1).
036600             15  PROD-DT-YY        PIC X(4).
036700         10  DE-REQ-DEPT           PIC X(4).
036800         10  DE-CHARGE-DEPT.
036900             15  DE-CHARGE-DEPT-1-4      PIC X(4).
037000             15  DE-CHARGE-DEPT-5-6.
037100                 20  DE-CHARGE-TYPE      PIC X(1).
037200                 20  FILLER        PIC X(1).
037300         10  DE-EXP-CLASS          PIC X(6).
037400         10  DE-WORK-CENTER        PIC X(2).
037500     05  DATA-ENTRY-AREA.
037600         10  DATA-ENTRY-LINE  OCCURS 6 TIMES.
                   15  DE-FRAN           PIC X(4).
037700             15  V-LOC             PIC X(12).
                   15  DE-LOC-ONHAND     PIC ZZZZZZZ9.
                   15  DE-LOC-ONHX REDEFINES DE-LOC-ONHAND   PIC X(8).
037800             15  DE-QTY-X          PIC X(8).
037900             15  DE-QTY REDEFINES DE-QTY-X      PIC 9(8).
038000     05  V-DISB-INSTR              PIC X(30).
038100     05  DE-COMMAND-LINE-1         PIC X(79).
038200     05  DE-MESSAGE-LINE-1         PIC X(79).
038300
038400**************************************************************
038500**                                                          **
038600**            L I N K A G E   S E C T I O N                 **
038700**                                                          **
038800**************************************************************
038900
039000 LINKAGE SECTION.
039100 01  BASE                          PIC X(10).
039200 01  MMIS-BASE                     PIC X(13).
039300
039400 COPY DBSTAT     IN COPYLIB.
039500 COPY VCOMLINK   IN COPYLIB.
039600 COPY STCOM      IN COPYLIB.
039700 COPY TSHWSUB    IN COPYLIB.
039800 COPY LANGSUB    IN COPYLIB.
039900 COPY MULTSTR    IN COPYLIB.
040000 COPY ESCNAME   IN COPYLIB.
040100
040200 PROCEDURE DIVISION USING BASE MMIS-BASE STATUS-AREA
040300                          VIEW-COMAREA STORES-COMAREA
040400                          SRF-COMAREA, SRF-SPOOLER-REC,
040500                          LANGUAGE-PARMS, MULTIPLE-STR-DATA,
040600                          ESC-NAME.
040700
040800 1-HSK.
           OPEN INPUT MPLTINFO.
      *-----5/2/97 JSB, GET VALID FRANCHISERS
           MOVE "FRAN"                   TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE SPACES               TO   FRAN-TABLE
           ELSE
           MOVE MPLTINFO-FRANCHISES      TO   FRAN-TABLE.
040900     MOVE "P 01"                   TO  PLT-ARG.
041000     MOVE 1                        TO  SAVE-PARA-NUMBER.
           MOVE "N"                      TO  WARNING-FLAG.
           MOVE SPACES                   TO  WARNING-TYPE.
           MOVE ZEROES                   TO  WARNING-VALUE.
041100
041200     GO TO 6-MAIN.
041300
041400 2100-BLOWUP.
041500     MOVE SAVE-PARA-NUMBER         TO  BU-DISPLAY-PARA.
041600     MOVE "TIRSNGL"                TO  BU-PGM-NAME.
041700     MOVE CODE-ARG                 TO  BU-DISPLAY-FLD (2).
041800     MOVE CORP-CODE                TO  BU-DISPLAY-FLD (3).
041900     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
042000       VIEW-COMAREA KSAM-STAT-SAVE BU-DISPLAY-MSG
042100       BU-DISPLAY-FLDS.
042200
042300 5-CLEAR-FORM.
042400     MOVE SPACE TO MESSAGE-BUFFER, DE-FIELDS-1.
042500     PERFORM 9999-PUTWINDOW.
042600     PERFORM 9999-INITFORM.
042700
042800 6-MAIN.
042900*----------THIS SUBPROGRAM IS ALSO CALLED FROM THE PROGRAM
043000*----------"TRMCORR" - CORRECTION OF BANBURY EXPLOSION PROGRAM.
043100*----------IN THIS CASE DECIDE WHICH FUNCTION (RETURN OR ISSUE),
043200*----------AND SET A FLAG.
043300     MOVE 2                        TO  SAVE-PARA-NUMBER.
043400     IF SCOM-PGM-KEY = "RM1"
043500         MOVE "SW1"                TO  SCOM-PGM-KEY
043600         MOVE "Y"                  TO  BANBURY-CORR-FLAG.
043700     IF SCOM-PGM-KEY = "RM2"
043800         MOVE "ST1"                TO  SCOM-PGM-KEY
043900         MOVE "Y"                  TO  BANBURY-CORR-FLAG.
044000     IF SCOM-PGM-KEY = "SW1"
044100         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
044200             MOVE "ISSNGL_AK"      TO  VIEW-NFNAME
044300         ELSE
044400             MOVE "ISSNGL"         TO  VIEW-NFNAME
044500     ELSE
044600         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
044700             MOVE "RTSNGL_AK"      TO  VIEW-NFNAME
044800         ELSE
044900             MOVE "RTSNGL"         TO  VIEW-NFNAME.
045000
045100     IF BANBURY-CORR-FLAG EQUAL "Y"
045200       PERFORM 9999-OVERRIDE-FORM-FILE.
045300
045400     PERFORM 9999-OPEN-STUFF.
045500
045600     PERFORM 9999-GETNEXTFORM.
045700
045800 61-GET-IR-FORM.
045900     MOVE 3                        TO  SAVE-PARA-NUMBER.
046000     IF SCOM-PGM-KEY = "SW1"
046100         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
046200             MOVE "ISSNGL3_AK"     TO  VIEW-NFNAME
046300         ELSE
046400             MOVE "ISSNGL3"        TO  VIEW-NFNAME
046500     ELSE
046600         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
046700             MOVE "RTSNGL3_AK"     TO  VIEW-NFNAME
046800         ELSE
046900             MOVE "RTSNGL3"        TO  VIEW-NFNAME.
047000
      *-----  INITIALIZE WARNING-FLAG FOR TQTYEDIT FOR RETURN LIMITS
           MOVE "N" TO WARNING-FLAG.

047100     PERFORM 9999-GETNEXTFORM.
047200     PERFORM 5-CLEAR-FORM.
047300* "T8: TYPE CORPORATE CODE AND PRESS 'ENTER'"
047400     MOVE 20                       TO  LANG-SETNUM.
047500     MOVE 8                        TO  LANG-MSGNUM.
047600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
047700     MOVE MESSAGE-BUFFER           TO  V-INSTRUCTION.
047800*----- f1 f2, APPLICATION, f3 f6 INVALID, f4 REFRESH, f5 PRT, f7 CLR
047900     MOVE 5                        TO  SRF-KEYSET.
048000     PERFORM 9999-PUTBUFFER-1.
048100
048200 61-SHOWFORM-1.
048300     MOVE 4                        TO  SAVE-PARA-NUMBER.
048400* "T8: TYPE CORPORATE CODE AND PRESS 'ENTER'"
048500     MOVE 20                       TO  LANG-SETNUM.
048600     MOVE 8                        TO  LANG-MSGNUM.
048700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
048800     MOVE MESSAGE-BUFFER           TO  V-INSTRUCTION.
048900*----- f1 f2, APPLICATION, f3 f6 INVALID, f4 REFRESH, f5 PRT, f7 CLR
049000     MOVE 5                        TO  SRF-KEYSET.
049100     PERFORM 9999-DO-SCREEN-1.
049200
049300     IF VIEW-LASTKEY = EXIT-PROGRAM OR F1-KEY OR F2-KEY
049400         GO TO 6-MAIN-X.
049500
049600     PERFORM 9999-GETBUFFER-1.
049700
049800 612-CHECK-CODE.
049900     MOVE 5                        TO  SAVE-PARA-NUMBER.
050000     IF DE-CODE = SPACES
050100         MOVE   3                  TO  LANG-SETNUM
050200         MOVE 103                  TO  LANG-MSGNUM
050300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
050400         MOVE 1                    TO  FIELD-NUMBER
050500         PERFORM 9999-SETERROR-1
050600         GO TO 61-SHOWFORM-1.
050700
050800*
050900* CHECK ALTERNATE KEY
051000*
051100     MOVE DE-CODE                  TO  ALT-KEY-ARG.
051200     CALL "TALTKEY" USING RET-CODE, BASE, STATUS-AREA,
051300                          ALT-KEY-ARG, ALT-CORP-CODE.
051400     IF RET-CODE NOT EQUAL "00"
051500       MOVE "TALTKEY ERROR 612-CHECK-CODE" TO
051600         BU-DISPLAY-MSG
051700       PERFORM 2100-BLOWUP.
051800
051900     MOVE ALT-CORP-CODE            TO  CODE-ARG DE-CODE.
052000     PERFORM 9999-GETKEY-MSTORERM-CD-O.
052100     IF NO-ENTRY
052200         MOVE  19                  TO  LANG-SETNUM
052300         MOVE   9                  TO  LANG-MSGNUM
052400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052500         MOVE MESSAGE-BUFFER       TO  MSG-TEXT
052600         MOVE DE-CODE              TO  MSG-FLD
052700         MOVE 1                    TO  FIELD-NUMBER
052800         PERFORM 9999-SETERROR-1
052900         GO TO 61-SHOWFORM-1.
053000
053100     PERFORM 9999-RESET-MSTORERM-CD-O.
053200
053300     IF STR-STATE = "F"
053400         MOVE  13                  TO  LANG-SETNUM
053500         MOVE  32                  TO  LANG-MSGNUM
053600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
053700         MOVE MESSAGE-BUFFER       TO  MSG-TEXT
053800         MOVE DE-CODE              TO  MSG-FLD
053900         MOVE 1                    TO  FIELD-NUMBER
054000         PERFORM 9999-SETERROR-1
054100         GO TO 61-SHOWFORM-1.
054200
054300 62-BUILD-SCREEN.
054400     MOVE 6                        TO  SAVE-PARA-NUMBER.
054500     IF SCOM-PGM-KEY = "SW1"
054600         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
054700             MOVE "ISSNGL2_AK"     TO  VIEW-NFNAME
054800         ELSE
054900             MOVE "ISSNGL2"        TO  VIEW-NFNAME
055000     ELSE
055100         IF AKRON-PLANT AND BANBURY-CORR-FLAG = "N"
055200             MOVE "RTSNGL2_AK"     TO  VIEW-NFNAME
055300         ELSE
055400             MOVE "RTSNGL2"        TO  VIEW-NFNAME.
055500     PERFORM 9999-GETNEXTFORM.
055600
055700     SUBTRACT STR-RESERVED FROM STR-ONHAND GIVING AVAIL.
055800     MOVE AVAIL                    TO  V-AVAIL.
055900     MOVE STR-UM                   TO  V-UM.
056000     MOVE DE-CODE                  TO  V-CODE.
056100     MOVE STR-DISB-INSTR           TO  V-DISB-INSTR.
056200     PERFORM VARYING SUB FROM 1 BY 1
056300             UNTIL SUB GREATER THAN 6
056400
056500       MOVE STR-LOC (SUB)          TO  V-LOC (SUB)
056600       IF V-LOC (SUB) = SPACES
                 MOVE SPACES             TO  DE-LOC-ONHX (SUB)
                                             DE-FRAN (SUB)
             ELSE
                 MOVE STR-LOC-ONHAND (SUB)  TO  DE-LOC-ONHAND (SUB)
                 PERFORM 900-GET-FRAN-NAME THRU 900-GET-FRAN-NAME-X
056600       END-IF
056700     END-PERFORM.
056800     MOVE 2                        TO  CDESC-LINES-TO-GET.
056900     MOVE "N"                      TO  CDESC-LOCAL-DESC-OPTION.
057000     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
057100       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
057200     IF BU-DISPLAY-MSG-1 NOT = SPACES
057300         PERFORM 2100-BLOWUP.
057400     MOVE CDESC (1)                TO  V-KWRD-ADJ.
057500     MOVE CDESC (2)                TO  V-DESC.
057600
057700*--- "T23: TYPE CHARGE DATA AND PRESS 'ENTER'"
057800     MOVE  20                      TO  LANG-SETNUM
057900     MOVE  23                      TO  LANG-MSGNUM
058000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058100     MOVE MESSAGE-BUFFER           TO  V-INSTRUCTION
058200     PERFORM 9999-PUTBUFFER-1.
058300
058400 63-SHOWFORM-2.
      *-----5/2/97, IF CODE FRAN OWNED THEN DISPLAY BIN OWNERS
           IF STR-CODE-OWNER NOT = SPACES
               MOVE B"1" TO IND(95)
           ELSE
               MOVE B"0" TO IND(95).
058500     MOVE 7                        TO  SAVE-PARA-NUMBER.
058600*----- f1 f2 f7 APPLICATION, f3 f6 INVALID, f4 REFRESH, f5 PRINT, f8 EXIT
058700     MOVE 6                        TO  SRF-KEYSET.
058800     PERFORM 9999-DO-SCREEN-1.
058900
059000     IF VIEW-LASTKEY = EXIT-PROGRAM OR F1-KEY OR F2-KEY
059100         GO TO 6-MAIN-X
059200     ELSE
059300     IF VIEW-LASTKEY = F7-KEY
059400         GO TO 61-GET-IR-FORM.
059500
059600     PERFORM 9999-GETBUFFER-1.
059700
059800**************************************************************
059900**                                                          **
060000**              EDIT CHARGE DATA                            **
060100**                                                          **
060200**************************************************************
060300
060400     MOVE SRF-MPLTINFO-COMPANY     TO  EDIT-PLANT-CODE.
060500     MOVE CODE-ARG                 TO  EDIT-CODE.
060600     MOVE DE-EMPL                  TO  EDIT-EMPL.
060700     MOVE DE-WO                    TO  EDIT-WO.
060800     MOVE DE-REQ-DEPT              TO  EDIT-REQ-DEPT.
060900     MOVE DE-CHARGE-DEPT           TO  EDIT-CHARGE-DEPT.
061000     MOVE DE-EXP-CLASS             TO  EDIT-EXP-CLASS.
061000     MOVE STR-RESTRICTED-FLG       TO  EDIT-RESTRICTED-FLG.
045700     MOVE STR-REQ-CHG-OVERRD       TO  EDIT-REQ-CHG-OVERRD.
045700     MOVE STR-DIR-CHRG-DEPT        TO  EDIT-DIR-CHRG-DEPT.
061100     IF SCOM-PGM-KEY = "SW1"
061200         MOVE "IS"                 TO  RET-CODE
061300     ELSE
061400         MOVE "RT"                 TO  RET-CODE.
061500
061600*---------- IF THIS IS A BANBURY EXPLOSION CORRECTION
061700*---------- (MAIN PGM "TRMCORR"), A KEY THE EDIT SUBPROGRAM
061800*---------- OF THIS THRU SECOND DIGIT OF RETURN CODE - SINCE
061900*---------- THE WORKORDER FIELD IS BEING USED FOR PRODUCTION DATE
062000*---------- IN THIS CASE, THE EDIT SUBPGM MUST SKIP W.O. EDIT.
062100
062200     IF BANBURY-CORR-FLAG = "Y"
062300         MOVE "C"                  TO  RET-CODE-2.
062400
062500     CALL "TIREDIT" USING RET-CODE, BASE, MMIS-BASE, PART-WORKAREA,
062600       STATUS-AREA, EDIT-DATA, MESSAGE-BUFFER, MULTIPLE-STR-DATA,
062700       STORES-COMAREA, STR-EXPENSE-CLASS, LANGUAGE-PARMS.
062800     IF RET-CODE = "BU"
062900         MOVE "TIREDIT ERROR 631-RF" TO BU-DISPLAY-MSG
063000         PERFORM 2100-BLOWUP.
063100
063200     MOVE EDIT-CODE                TO  DE-CODE.
063300     MOVE EDIT-EMPL                TO  DE-EMPL.
063400     MOVE EDIT-WO                  TO  DE-WO.
063500     MOVE EDIT-REQ-DEPT            TO  DE-REQ-DEPT.
063600     MOVE EDIT-CHARGE-DEPT         TO  DE-CHARGE-DEPT.
063700     MOVE EDIT-EXP-CLASS           TO  DE-EXP-CLASS.
063700     MOVE EDIT-SUB                 TO  SRF-ERROR-FLD.
063800
063900     IF MESSAGE-BUFFER NOT = SPACES
064000         ADD 6, EDIT-SUB GIVING FIELD-NUMBER
064100         PERFORM 9999-SETERROR-1
064200         GO TO 63-SHOWFORM-2.
064300
064400*---------- IF THIS IS A BANBURY EXPLOSION PROGRAM (MAIN PGM
064500*---------- "TRMCORR"), THE WORKORDER FIELD IS USED FOR PRODUCTION
064600*---------- DATE ENTRY.  WE VALIDATE THE DATE ENTERED WITH
064700*---------- "TDATECHK", THEN PUT IT IN THE FORMAT THAT CUTOFF
064800*---------- EXPECTS IT IN (I.E. 10-18-84).
064900     IF BANBURY-CORR-FLAG = "Y"
065000         MOVE DE-WO                TO  DATE-VALIDATE-IN
065100         MOVE 3                    TO  DATE-MODE
065200         CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
065300         IF DATE-RET-CODE = 0
065400             MOVE DATE-YMD-OUT     TO  YMD-WORK
065500             MOVE YMD-YY           TO  PROD-DT-YY
065600             MOVE YMD-MM           TO  PROD-DT-MM
065700             MOVE YMD-DD           TO  PROD-DT-DD
065800             MOVE "-"              TO  PROD-SLASH-1
065900                                       PROD-SLASH-2
066000         ELSE
066100             MOVE DATE-MSG         TO  MESSAGE-BUFFER
066200             MOVE 8                TO  FIELD-NUMBER
066300             PERFORM 9999-SETERROR-1
066400             GO TO 63-SHOWFORM-2.
066500
066600     MOVE V-CODE                   TO  CODE-ARG.
066700     MOVE V-CODE                   TO  LOCK-VALUE.
066800     IF DE-WO NOT = SPACES
066900         MOVE 2                    TO  NUMBER-OF-LOCK-DESCRIPTORS
067000         MOVE DE-WO                TO  LOCK-VALUE2
067100     ELSE
067200         MOVE 1     TO  NUMBER-OF-LOCK-DESCRIPTORS.
067300     PERFORM 9999-MULTI-LOCK.
067400
067500     PERFORM 9999-GETKEY-MSTORERM-CD-O.
067600
067700****************************************************
067800**   SAVE THE ONHAND BEFORE UPDATING QUANTITIES   **
067900**   TO PASS TO REQ UPDATE SUBPROGRAM.            **
068000**   SAVE THE RESERVED BEFORE UPDATE ALSO, SINCE  **
068100**   REQS GO ON BASIS OF "AVAIL".                 **
068200****************************************************
068300
068400     MOVE STR-ONHAND               TO  SAVE-ONHAND-BEFORE.
068500     MOVE STR-RESERVED             TO  SAVE-RSRVD-BEFORE.
068600
068700**************************************************************
068800**                                                          **
068900**          EDIT AND UPDATE ONHAND AND RESERVED             **
069000**                                                          **
069100**************************************************************
069200
069300     IF SCOM-PGM-KEY = "SW1"
069400         MOVE "I1"                 TO  RET-CODE
069500     ELSE
069600         MOVE "R1"                 TO  RET-CODE.
069900     CALL "TQTYEDIT" USING RET-CODE BASE STATUS-AREA CODE-ARG
070000       DE-WO, STR-ONHAND, STR-RESERVED, STR-LOC-AREA,
070100       DATA-ENTRY-AREA, QEDIT-TOTAL-QTY, ISSUED-QTY, SUB,
070200       MESSAGE-BUFFER, MULTIPLE-STR-DATA,
070300       LANGUAGE-PARMS, WARNING-FLAG, WARNING-TYPE,
070300       WARNING-VALUE, STR-AVG-COST, DE-CHARGE-DEPT-1-4,
             DE-EXP-CLASS, DE-EMPL, STR-UM, STR-MAX, STR-REORDER
             STR-CODE-OWNER FRAN-TABLE.
070600     IF RET-CODE NOT = "00"
070700         MOVE "TQTYEDIT ERROR"     TO  BU-DISPLAY-MSG
070800         PERFORM 2100-BLOWUP.
070900     IF MESSAGE-BUFFER NOT = SPACES
      *-----7/22/97, IF ENTERED QUANTITES = 0 THEN MOVE SPACES
      *-----   TO DISPLAY SCREEN.
               PERFORM VARYING SUB2 FROM 1 BY 1
                   UNTIL SUB2 GREATER THAN 6
                 IF DE-QTY-X(SUB2) = "00000000"
                   MOVE SPACES TO DE-QTY-X(SUB2)
                 END-IF
               END-PERFORM
071000         COMPUTE FIELD-NUMBER = 2 * SUB + 13
071100         PERFORM 9999-SETERROR-1
071200         PERFORM 9999-UNLOCK
071300         PERFORM 9999-RESET-MSTORERM-CD-O
071400         GO TO 63-SHOWFORM-2.
071500
071600     MOVE  14                      TO  LANG-SETNUM.
071700     MOVE   2                      TO  LANG-MSGNUM.
071800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
071900     PERFORM 9999-PUTWINDOW.
072000     PERFORM 9999-SHOWFORM.
072100
072200**************************************************************
072300**   DETERMINE DATE & TIME FOR TRANSACTION.  NOTE THAT DATE **
072400**   & TIME AT THIS INSTANT WILL BE USED FOR MSTORERM       **
072500**   UPDATE, TRANSACTION, AND PRINTOUT.                     **
072600**************************************************************
072700
072800     MOVE 1                        TO  DATE-MODE.
072900     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
073000
073100******************************
073200**   UPDATE ACTIVITY DATES  **
073300******************************
073400
073500     MOVE DATE-YMD-OUT             TO  STR-ACT-DATE.
           IF STR-ACT-DATE-YY > "70"
               MOVE "19" TO STR-ACT-DATE-CC
           ELSE
               MOVE "20" TO STR-ACT-DATE-CC.
073600     IF SCOM-PGM-KEY = "SW1"
073700         MOVE DATE-YMD-OUT         TO  STR-LAST-IDATE
               IF STR-ISS-DATE-YY > "70"
                   MOVE "19" TO STR-LAST-IDATE-CC
               ELSE
                   MOVE "20" TO STR-LAST-IDATE-CC.
073800
073900     IF SCOM-PGM-KEY = "SW1"
074000         MOVE DE-EMPL              TO  STR-LAST-EMPL
074100         IF AKRON-PLANT
074200             IF IT-J-Z-CHECK = "I" OR "J" OR "Z"
074300                 MOVE DE-WO        TO  STR-LAST-CHARGE
074400             ELSE
074500             IF STATIONERY-CHECK = "R" OR "D" OR "T" OR "S"
074600                 MOVE DE-REQ-DEPT  TO  STR-LAST-CHARGE
074700             ELSE
074800             IF DE-CHARGE-TYPE = "4" OR "5"
074900                 MOVE DE-REQ-DEPT  TO  STR-LAST-CHARGE
075000             ELSE
075100                 MOVE DE-CHARGE-DEPT TO  STR-LAST-CHARGE
075200         ELSE
075300             MOVE DE-CHARGE-DEPT   TO  STR-LAST-CHARGE.
075400
075500     PERFORM 9999-UPDATE-MSTORERM-CD-O.
075600
075700     PERFORM 9999-UNLOCK.
075800
075900**************************************************************
076000**   CALL "TREQFILU" TO UPDATE THE REQFILE IF NEEDED.  IF   **
076100**   THE REQFILE HAS NOT YET BEEN OPENED, "TREQFILU" WILL   **
076200**   OPEN IT AND RETURN THE FILE NUMBER.                    **
076300**************************************************************
076400
076500     CALL "TREQFILU" USING RET-CODE, BASE, DUMMY-REQFILNO,
076600       CODE-ARG, SAVE-ONHAND-BEFORE, SAVE-RSRVD-BEFORE,
076700       STR-ONHAND, STR-RESERVED, STR-REORDER, STR-EXPEDITE.
076800     IF RET-CODE NOT = "00"
076900         MOVE "TREQFILU ERROR"     TO  BU-DISPLAY-MSG
077000         MOVE CODE-ARG             TO  BU-DISPLAY-FLD (1)
077100         MOVE RET-CODE             TO  KSAM-STAT-SAVE
077200         PERFORM 2100-BLOWUP.
077300
077400 64-UPDATE-DDAILYTC.
      *------5/2/97 BUILD OWNER/QTY TABLE FOR WITHDRAWLS
           IF SCOM-PGM-KEY = "SW1"
            MOVE 0 TO MAX-OWNRS
            INITIALIZE OWNER-TABLE
            PERFORM VARYING SUB FROM 1 BY 1
             UNTIL SUB > 6
               IF DE-QTY(SUB) > 0
                   SET OWNR-IDX TO 1
                   SEARCH OWNER-ENTRY
                     AT END
                        ADD 1 TO MAX-OWNRS
                        MOVE DE-FRAN(SUB) TO OWNR(MAX-OWNRS)
                        IF DE-QTY-X(SUB) NUMERIC
                            MOVE DE-QTY(SUB)  TO OWNR-QTY(MAX-OWNRS)
                        ELSE
                            MOVE ZEROS        TO OWNR-QTY(MAX-OWNRS)
                        END-IF
                     WHEN OWNR(OWNR-IDX) = DE-FRAN(SUB)
                        IF MAX-OWNRS = 0
                            MOVE 1 TO MAX-OWNRS
                        END-IF
                        MOVE OWNR-IDX TO CURR-OWNR
                        IF DE-QTY-X(SUB) NUMERIC
                            IF OWNR-QTY(CURR-OWNR) NUMERIC
                                ADD DE-QTY(SUB) TO OWNR-QTY(CURR-OWNR)
                            ELSE
                                MOVE DE-QTY(SUB) TO OWNR-QTY(CURR-OWNR)
                            END-IF
                        END-IF
                   END-SEARCH
              END-IF
            END-PERFORM
           END-IF.

077500     MOVE 10                       TO  SAVE-PARA-NUMBER.
077600     IF DE-EXP-CLASS = "000000"
077700         MOVE SPACES               TO  DE-EXP-CLASS.
077800
077900     MOVE SPACES                   TO  DDAILYTC-DATA.
078000     MOVE DATE-YMD-OUT             TO  DDAILYTC-DATE.
078100     MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.
078200     MOVE SRF-MPLTINFO-COMPANY     TO  DDAILYTC-PLT.
078300     IF SCOM-PGM-KEY = "SW1"
      *--------5/2/97 WRITE TC FOR EACH OWNER/QTY
            PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > MAX-OWNRS
078400       IF STR-AVG-COST > 99999.9999
078500         MOVE "433"                TO  DDAILYTC-TC
078600         MOVE CODE-ARG             TO  TC433-CORPCODE
078700         MOVE DE-EMPL              TO  TC433-EMP
               MOVE OWNR-QTY(SUB)        TO  TC433-QTY
               PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
               MOVE HOLD-FRAN-ID         TO  TC433-FRAN-ID
078800*        MOVE QEDIT-TOTAL-QTY      TO  TC433-QTY
      *----------GOODYEAR OWNED USES AVG COST
      *----------FRANCHISE OWNED USES MKT COST
               IF STR-CODE-OWNER NOT = SPACES
                 IF HOLD-FRAN-ID NOT = STR-CODE-OWNER
                     MOVE STR-AVG-COST     TO  TC433-AVG-COST
                 ELSE
                     MOVE STR-MKT-COST     TO  TC433-AVG-COST
                 END-IF
               ELSE
                 MOVE STR-AVG-COST         TO  TC433-AVG-COST
               END-IF
079000         MOVE STR-UM               TO  TC433-UM
079100         MOVE DE-CHARGE-DEPT       TO  TC433-DEPARTMENT
079200         MOVE DE-WO                TO  TC433-WO
079300         MOVE DE-WORK-CENTER       TO  TC433-WORK-CENTER
079400         MOVE DE-EXP-CLASS         TO  TC433-EXP-CLASS
079500         MOVE DE-REQ-DEPT          TO  TC433-REQ-DEPT
079600         MOVE STR-CLASS            TO  TC433-CLASS
079700       ELSE
079800         MOVE "333"                TO  DDAILYTC-TC
079900         MOVE CODE-ARG             TO  TC333-CORPCODE
080000         MOVE DE-EMPL              TO  TC333-EMP
               MOVE OWNR-QTY(SUB)        TO  TC333-QTY
               PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
               MOVE HOLD-FRAN-ID         TO  TC333-FRAN-ID
080100         MOVE QEDIT-TOTAL-QTY      TO  TC333-QTY
               MOVE STR-AVG-COST         TO  TC333-AVG-COST
      *----------GOODYEAR OWNED USES AVG COST
      *----------FRANCHISE OWNED USES MKT COST
               IF STR-CODE-OWNER NOT = SPACES
                 IF HOLD-FRAN-ID NOT = STR-CODE-OWNER
                     MOVE STR-AVG-COST     TO  TC333-AVG-COST
                 ELSE
                     MOVE STR-MKT-COST     TO  TC333-AVG-COST
                 END-IF
               ELSE
                 MOVE STR-AVG-COST         TO  TC333-AVG-COST
               END-IF
080300         MOVE STR-UM               TO  TC333-UM
080400         MOVE DE-CHARGE-DEPT       TO  TC333-DEPARTMENT
080500         MOVE DE-WO                TO  TC333-WO
080600         MOVE DE-WORK-CENTER       TO  TC333-WORK-CENTER
080700         MOVE DE-EXP-CLASS         TO  TC333-EXP-CLASS
080800         MOVE DE-REQ-DEPT          TO  TC333-REQ-DEPT
080900         MOVE STR-CLASS            TO  TC333-CLASS
             END-IF
            END-PERFORM
081000     ELSE
081100       IF STR-AVG-COST > 99999.9999
081200         MOVE "430"                TO  DDAILYTC-TC
081300         MOVE CODE-ARG             TO  TC430-CORPCODE
081400         MOVE DE-EMPL              TO  TC430-EMP
081500         MOVE QEDIT-TOTAL-QTY      TO  TC430-QTY
081600         MOVE STR-AVG-COST         TO  TC430-AVG-COST
081700         MOVE STR-UM               TO  TC430-UM
081800         MOVE DE-CHARGE-DEPT       TO  TC430-DEPARTMENT
081900         MOVE DE-WO                TO  TC430-WO
082000         MOVE DE-WORK-CENTER       TO  TC430-WORK-CENTER
082100         MOVE DE-EXP-CLASS         TO  TC430-EXP-CLASS
082200         MOVE DE-REQ-DEPT          TO  TC430-REQ-DEPT
082300         MOVE STR-CLASS            TO  TC430-CLASS
082400       ELSE
082500         MOVE "330"                TO  DDAILYTC-TC
082600         MOVE CODE-ARG             TO  TC330-CORPCODE
082700         MOVE DE-EMPL              TO  TC330-EMP
082800         MOVE QEDIT-TOTAL-QTY      TO  TC330-QTY
082900         MOVE STR-AVG-COST         TO  TC330-AVG-COST
083000         MOVE STR-UM               TO  TC330-UM
083100         MOVE DE-CHARGE-DEPT       TO  TC330-DEPARTMENT
083200         MOVE DE-WO                TO  TC330-WO
083300         MOVE DE-WORK-CENTER       TO  TC330-WORK-CENTER
083400         MOVE DE-EXP-CLASS         TO  TC330-EXP-CLASS
083500         MOVE DE-REQ-DEPT          TO  TC330-REQ-DEPT
083600         MOVE STR-CLASS            TO  TC330-CLASS.
083700
083800     MOVE DSET-DDAILYTC            TO  DSET-NAME.
083900     PERFORM 9999-DSET-LOCK.
084000
084100     PERFORM 9999-PUT-DDAILYTC-DT-O.
084200
084300     PERFORM 9999-UNLOCK.
084400
      *--------- SEND USER NOTIFICATION MESSAGE IF SPECIFIED IN
      *--------- MCFPCSUSER.
           IF SCOM-PGM-KEY = "SW1"
               IF USER-FILE-EXISTS = "Y"
                   PERFORM 900-SEND-MESSAGE.

084500*********************************************************
084600**  PRINT A RECORD OF THE SINGLE ISSUE TO LOCAL PRINTER *
084700*********************************************************
           IF PRINT-SINGLE-ISS-FLAG NOT = "N"
084800         CALL "CIRPRNT" USING SCOM-PGM-KEY, MULTIPLE-STR-DATA,
084900           SRF-COMAREA, SRF-SPOOLER-REC, DE-CHARGE-DATA,
085000           BUF-MSTORERM, DATA-ENTRY-AREA, CDESC (1), CDESC (2),
085100           ESC-NAME, DATE-CHECK-AREA.
085200
085300 66-UPDATE-MMIS.
085400     MOVE 14                       TO  SAVE-PARA-NUMBER.
085500     IF DE-WO = SPACES
085600         GO TO 61-GET-IR-FORM.
085700
085800     MOVE SPACES                   TO  PART-WORKAREA.
085900     MOVE DE-WO                    TO  WO-NUMBER.
086000     MOVE CODE-ARG                 TO  STORES-CODE.
086100     MOVE QEDIT-TOTAL-QTY          TO  ISSUED-QTY.
086200     IF SCOM-PGM-KEY = "ST1"
086300         MULTIPLY -1         BY  QTY-ISSUED.
086400     MOVE STR-AVG-COST             TO  AVG-COST.
086500     MOVE V-KWRD-ADJ               TO  STORES-DESC.
086600     MOVE DE-EMPL                  TO  EMPLOYEE-ID.
086700     MOVE STR-UM                   TO  UNIT-OF-MEAS.
086800
086900     CALL "ISSPARTS" USING PART-WORKAREA
087000                           MMIS-BASE
087100                           LANGUAGE-PARMS
087200                           BUDGET-MESSAGE.
087300
087400     GO TO 61-GET-IR-FORM.
087500
087600 6-MAIN-X.
087700     PERFORM 5-CLEAR-FORM.
087800     PERFORM 9999-CLOSE-STUFF.
087900     IF BANBURY-CORR-FLAG EQUAL "Y"
088000       PERFORM 9999-DELETE-OVERRIDE-FORM-FILE.
088100
088200     GOBACK.
088300
       9999-OPEN-STUFF.
           OPEN I-O   MSTORERM-CD-O        .
           OPEN I-O   DDAILYTC-DT-O        .
           OPEN I-O   DISPLAY-FILE         .

           OPEN INPUT USER-I.
           IF FILE-STATUS NOT = "00"
               MOVE "N" TO USER-FILE-EXISTS
           ELSE
               MOVE "Y" TO USER-FILE-EXISTS.

       9999-CLOSE-STUFF.
           CLOSE      MSTORERM-CD-O        .
           CLOSE      DDAILYTC-DT-O        .
           CLOSE      DISPLAY-FILE         .
           CLOSE      USER-I.

       9999-OVERRIDE-FORM-FILE.
           MOVE "OVRDSPF FILE(ZUDCSTR) TOFILE(ZRMCORR)" TO
             COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

       9999-DELETE-OVERRIDE-FORM-FILE.
           MOVE "DLTOVR FILE(ZUDCSTR)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

088500 COPY HCATREAD   IN COPYLIB.
088600 COPY SCRNCALL   IN COPYLIB.
       9999-GETBUFFER-1.
           MOVE DISPLAY-REC TO DE-FIELDS-1.

       9999-PUTBUFFER-1.
           MOVE DE-FIELDS-1 TO DISPLAY-REC.

       9999-SETERROR-1.
           MOVE B"1"            TO IND (99).
           MOVE B"1"            TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER  TO DE-MESSAGE-LINE-1.
           MOVE DE-FIELDS-1     TO DISPLAY-REC.

       9999-DO-SCREEN-1.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.

089000 COPY DLOCKCAL   IN COPYLIB.
089100 COPY MLOCKCAL   IN COPYLIB.
089200 COPY UNLOCK     IN COPYLIB.
       9999-GETKEY-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MSTORERM-CD-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MSTORERM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-CD-REC-O.
           START MSTORERM-CD-O KEY > CORPCDE OF MSTORERM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DDAILYTC-DT-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DT-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DDAILYTC-DT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           REWRITE MSTORERM-CD-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MSTORERM-CD-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       900-SEND-MESSAGE.
           MOVE CODE-ARG TO CORPCDE OF USER-I-REC.
           START USER-I KEY = CORPCDE OF USER-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ USER-I NEXT INTO BUF-USERFILE
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   PERFORM UNTIL USR-CORP-CODE NOT = CODE-ARG
                                     OR FILE-STATUS NOT = "00"
                       MOVE SPACES            TO  MCXSNDMSG-PARM
                       MOVE USR-CORP-CODE     TO  MCXSNDMSG-CODE
                       MOVE USR-MESSAGE       TO  MCXSNDMSG-MSG
                       CALL "MCXSNDMSG" USING MCXSNDMSG-PARM
                                              USR-USER-ID
                       READ USER-I NEXT INTO BUF-USERFILE
                           AT END MOVE FILE-STATUS TO FILE-STATUS
                       END-READ
                   END-PERFORM.

       900-GET-FRAN-NAME.
           IF FRAN-TABLE = SPACES
               MOVE SPACES TO DE-FRAN(SUB)
           ELSE
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                 AT END  MOVE SPACES TO DE-FRAN (SUB)
                 WHEN FRAN-ID(FRAN-IDX) = STR-BIN-OWNER (SUB)
                  MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN(SUB)
               END-SEARCH.
       900-GET-FRAN-NAME-X.
           EXIT.

       900-GET-FRAN-ID.
           IF FRAN-TABLE = SPACES
               MOVE SPACES TO HOLD-FRAN-ID
           ELSE
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                 AT END  MOVE SPACES TO HOLD-FRAN-ID
                 WHEN FRAN-NAME(FRAN-IDX) = OWNR (SUB)
                  MOVE FRAN-ID(FRAN-IDX) TO HOLD-FRAN-ID
               END-SEARCH.
       900-GET-FRAN-ID-X.
           EXIT.
