000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TIRWSDLT.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        6/24/85.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     ISSUE AND RETURN WORKSHEET DELETE SUBPROGRAM.
001000*
      *C 06/12/96   JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP NEW FILE FORMATS.
      *C
      *C 09/17/97   JEFF BUNGO
      *C   FOR AKRON RESEARCH (119) ONLY.
      *C   AFTER DELETING A WORKSHEET, CHECK IF ANY CCS DATA WAS ENTERED
      *C   FOR THE WORKSHEET (FOR CODES WITH MAJ/SUB GROUP 2890).  IF
      *C   DATA FOUND AND NO DATE IS ENTERED (NOT PROCESSED) THEN REMOVE
      *C   THESE RECORDS WITH THE WORKSHEET.
      *C
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.  HP-3000.
001400 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MWRKLIST
                  ASSIGN TO DATABASE-MCFLCS0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DWLITEM
                  ASSIGN TO DATABASE-MCFLCS1501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DCCSDATA
                  ASSIGN TO DATABASE-MCFLCS6601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

001900 DATA DIVISION.
       FILE SECTION.
       FD  MWRKLIST
           LABEL RECORDS ARE STANDARD.
       01  MWRKLIST-REC.
           COPY DDS-MCRPCS0300  OF MCFLCS0301.

       FD  DWLITEM
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-REC.
           COPY DDS-MCRPCS1500  OF MCFLCS1501.

       FD  DCCSDATA
           LABEL RECORDS ARE STANDARD.
       01  DCCSDATA-REC.
           COPY DDS-MCRPCS6600  OF MCFLCS6601.

002100
002900 WORKING-STORAGE SECTION.
003000
003100*************************************************************
003200**                                                          **
003300**          C O M M U N I C A T I O N S   A R E A S         **
003400**                                                          **
003500**************************************************************
003600
003700 01  SPOOLER-AREA.
003800     05  SPOOL-STAT           PIC S9     VALUE ZEROS COMP-4.
003900     05  SPOOL-PRT            PIC S9(2)  COMP-4.
004000     05  SPOOL-COPIES         PIC S9(2)  VALUE 1 COMP-4.
004100     05  SPOOL-PRIOR          PIC S9     VALUE ZEROS COMP-4.
004200     05  SPOOL-MSG            PIC X(75)  VALUE  SPACES.
004300
004400**************************************************************
004500**                                                          **
004600**            D A T A B A S E   W O R K                     **
004700**                                                          **
004800**************************************************************
004900
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

005000 01  DSET-NAMES.
005100     05  DSET-DWLITEM           PIC X(16) VALUE "DWLITEM;".
005200     05  DSET-MWRKLIST          PIC X(16) VALUE "MWRKLIST;".
005300
005400 01  MODE-AREA.
005500     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
005600     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
005700     05  MODE4                  PIC S9(4)   COMP       VALUE 4.
005800     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
005900     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
006000
006100 01  ALL-ITEMS                  PIC X(2)  VALUE "@;".
006200
006300*01  MULTI-LOCK.
006400*    05  NUMBER-OF-LOCK-DESCRIPTORS  PIC S9(4) COMP-4 VALUE 2.
006500*    05  LOCK-WL.
006600*        10  LOCK-LENGTH              PIC S9(4) COMP-4 VALUE 24.
006700*        10  LOCK-DSET                PIC X(16) VALUE "DWLITEM;".
006800*        10  LOCK-ITEM-LIST          PIC X(16) VALUE "WL-KEY;".
006900*        10  LOCK-REL-OP              PIC X(2)  VALUE "= ".
007000*        10  LOCK-VALUE               PIC X(12).
007100*    05  LOCK-WL.
007200*        10  LOCK-LENGTH-2            PIC S9(4) COMP-4 VALUE 24.
007300*        10  LOCK-DSET-2              PIC X(16) VALUE "MWRKLIST;".
007400*        10  LOCK-ITEM-LIST-2        PIC X(16) VALUE "WL-KEY;".
007500*        10  LOCK-REL-OP-2            PIC X(2)  VALUE "= ".
007600*        10  LOCK-VALUE-2             PIC X(12).
007700 01 ST-CODE-ARG              PIC X(8).
007800 01  PLT-ARG                 PIC X(4)  VALUE "P 01".
007900
008000 01  WL-KEY-ARG.
008100     05  WRKL-NO-KEY        PIC X(2).
008200     05  WRKL-NO-INC        PIC 9(4).
008300
008400 01  WRKL-SEARCH             PIC X(7)  VALUE "WL-KEY;".
008500
008600**************************************************************
008700**                                                          **
008800**           D A T A B A S E   B U F F E R S                **
008900**                                                          **
009000**************************************************************
009100 COPY DWLITEM    IN COPYLIB.
       COPY DCCSDATA   IN COPYLIB.
009200
009300**************************************************************
009400**                                                          **
009500**            L I N K A G E   S E C T I O N                 **
009600**                                                          **
009700**************************************************************
009800
009900 LINKAGE SECTION.
010000
010100 01  RET-CODE                      PIC S9(4) COMP-4.
010200 01  CALL-MODE                     PIC S9(4) COMP-4.
010300 01  WS-NO                         PIC X(6).
010400 01  BASE                          PIC X(10).
010500 COPY DBSTAT IN COPYLIB.
010600 01  BU-DISPLAY-MSG.
           05  BU-DISPLAY-MSG-1          PIC X(1).
           05  FILLER                    PIC X(57).
           05  BU-DISPLAY-FILE-STATUS    PIC X(2).
010700 01  DELETE-WS-AREA.
010800     05  PRINT-FLAG                PIC X(1).
010900     05  LOCK-FLAG                 PIC X(1).
011000     05  UNLOCK-FLAG               PIC X(1).
011100     05  FILLER                    PIC X(4).
011200
011300 PROCEDURE DIVISION USING RET-CODE, CALL-MODE, WS-NO, BASE,
011400     STATUS-AREA, BU-DISPLAY-MSG, DELETE-WS-AREA.
011500 6000-MAIN.
           OPEN I-O MWRKLIST.
           OPEN I-O DWLITEM.
           OPEN I-O DCCSDATA.

011600     MOVE 0                        TO  RET-CODE.
011700*    IF LOCK-FLAG = "Y"
011800*        MOVE WS-NO                TO  LOCK-VALUE, LOCK-VALUE-2
011900*        CALL "DBLOCK" USING BASE, MULTI-LOCK, MODE5,
012000*          STATUS-AREA
012100*        IF COND-WORD NOT = 0
012200*            MOVE 1                TO  RET-CODE
012300*            MOVE "TIRWSDLT DBLOCK ERR 6000-MAIN"
012400*                                  TO  BU-DISPLAY-MSG
012500*            GO TO 6990-MAIN-X.
012600
012700*    CALL "DBFIND" USING BASE, DSET-DWLITEM, MODE1, STATUS-AREA,
012800*      WRKL-SEARCH, WS-NO.
           MOVE 0 TO COND-WORD.
           MOVE WS-NO TO WLKEY OF DWLITEM-REC.
           START DWLITEM KEY = EXTERNALLY-DESCRIBED-KEY INVALID KEY
               MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
012900     IF COND-WORD NOT = 0
013000         MOVE 2                    TO  RET-CODE
013100         MOVE "TIRWSDLT DBFIND ERR 6000-MAIN" TO BU-DISPLAY-MSG
013200         GO TO 6990-MAIN-X.
013300
013400 6100-GET-LOOP.
013500*    CALL "DBGET" USING BASE, DSET-DWLITEM, MODE5, STATUS-AREA,
013600*       ALL-ITEMS, BUF-DWLITEM, WS-NO.
           MOVE 0 TO COND-WORD.
           READ DWLITEM NEXT INTO BUF-DWLITEM AT END
               MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF WLKEY OF DWLITEM-REC NOT = WS-NO
               MOVE 15 TO COND-WORD.
013700     IF COND-WORD = 15
               START DWLITEM KEY = EXTERNALLY-DESCRIBED-KEY
                  INVALID KEY MOVE 15 TO COND-WORD
               END-START
013800         GO TO 6200-DELETE-MASTER
013900     ELSE
014000     IF COND-WORD NOT = 0
014100         MOVE 3                    TO  RET-CODE
014200         MOVE "TIRWSDLT DBGET ERR 6100-GL" TO BU-DISPLAY-MSG
014300         GO TO 6990-MAIN-X.
014400
014500*    CALL "DBDELETE" USING BASE, DSET-DWLITEM, MODE1, STATUS-AREA.
           MOVE 0 TO COND-WORD.
           DELETE DWLITEM INVALID KEY
               MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
014600     IF COND-WORD NOT = 0
014700         MOVE "TIRWSDLT DBDELETE ERR 6100-GL" TO BU-DISPLAY-MSG
014800         MOVE 4                    TO  RET-CODE
014900         GO TO 6990-MAIN-X.
015000
015100     GO TO 6100-GET-LOOP.
015200
015300 6200-DELETE-MASTER.
015400*    CALL "DBUNLOCK" USING BASE, MULTI-LOCK, MODE1, STATUS-AREA.
015500*
015600*    CALL "DBLOCK" USING BASE, DSET-MWRKLIST, MODE3,
015700*      STATUS-AREA.
015800*    IF COND-WORD NOT = 0
015900*        MOVE "TIRWSDLT DBLOCK ERR MWRK 6200-DM"
016000*                                  TO  BU-DISPLAY-MSG
016100*        MOVE 8                    TO  RET-CODE
016200*        GO TO 6990-MAIN-X.
016300*
016400*    CALL "DBGET" USING BASE, DSET-MWRKLIST, MODE7, STATUS-AREA,
016500*      ALL-ITEMS, BUF-DWLITEM, WS-NO.
           MOVE 0 TO COND-WORD.
           MOVE WS-NO TO WLKEY OF MWRKLIST-REC.
           READ MWRKLIST INVALID KEY
                MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
016600     IF COND-WORD NOT = 0
016700         MOVE "TIRWSDLT DBGET ERR 6200-DM" TO BU-DISPLAY-MSG
016800         MOVE 5                    TO RET-CODE
016900         GO TO 6990-MAIN-X.
017000
017100*    CALL "DBDELETE" USING BASE, DSET-MWRKLIST, MODE1,
017200*        STATUS-AREA.
           MOVE 0 TO COND-WORD.
           DELETE MWRKLIST INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
017300     IF COND-WORD NOT = 0
017400         MOVE "TIRWSDLT DBDELETE ERR 6200-DM" TO BU-DISPLAY-MSG
017500         MOVE 6                               TO RET-CODE
017600         GO TO 6990-MAIN-X.
017700
017800*    CALL "DBUNLOCK" USING BASE, DSET-MWRKLIST, MODE1,
017900*      STATUS-AREA.
018000*    IF COND-WORD NOT = 0
018100*        MOVE "TIRWSDLT DBUNLOCK ERR 1" TO BU-DISPLAY-MSG
018200*        MOVE 9                         TO RET-CODE
018300*        GO TO 6990-MAIN-X.
018400*
018500*    IF UNLOCK-FLAG = "N"
018600*        CALL "DBLOCK" USING BASE, MULTI-LOCK, MODE5,
018700*          STATUS-AREA
018800*        IF COND-WORD NOT = 0
018900*            MOVE "TIRWSDLT DBLOCK ERR 2" TO BU-DISPLAY-MSG
019000*            MOVE 10                      TO RET-CODE
019100*            GO TO 6990-MAIN-X.
019200*
       6300-DELETE-CCS.
           MOVE 0 TO COND-WORD.
           MOVE WS-NO TO WLKEY OF DCCSDATA-REC.
           MOVE SPACES TO CORPCDE OF DCCSDATA-REC.
           START DCCSDATA KEY NOT < EXTERNALLY-DESCRIBED-KEY INVALID KEY
               MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE 2                    TO  RET-CODE
               MOVE "TIRWSDLT START ERR 6300-CCS" TO BU-DISPLAY-MSG
               GO TO 6990-MAIN-X.

       6300-GET-LOOP.
           MOVE 0 TO COND-WORD.
           READ DCCSDATA NEXT INTO BUF-DCCSDATA AT END
               MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF WLKEY OF DCCSDATA-REC NOT = WS-NO
               MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               START DCCSDATA KEY = EXTERNALLY-DESCRIBED-KEY
                  INVALID KEY MOVE 15 TO COND-WORD
               END-START
               GO TO 6990-MAIN-X
           ELSE
           IF COND-WORD NOT = 0
               MOVE 3                    TO  RET-CODE
               MOVE "TIRWSDLT READ ERR 6300" TO BU-DISPLAY-MSG
               GO TO 6990-MAIN-X.
           IF DATECYMD OF DCCSDATA-REC NOT = SPACES
               GO TO 6300-GET-LOOP.

           MOVE 0 TO COND-WORD.
           DELETE DCCSDATA INVALID KEY
               MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "TIRWSDLT DELETE ERR 6300" TO BU-DISPLAY-MSG
               MOVE 4                    TO  RET-CODE
               GO TO 6990-MAIN-X.

           GO TO 6300-GET-LOOP.

019300
019400 6990-MAIN-X.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE FILE-STATUS TO BU-DISPLAY-FILE-STATUS.
           CLOSE MWRKLIST.
           CLOSE DWLITEM.
           CLOSE DCCSDATA.
019500     GOBACK.
