000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TISSCRWS.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        12/20/85.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     EXECUTIVE PROGRAM (MAIN PROGRAM) FOR MATERIAL STATUS
001000*             SUB-PROGRAM.
001100*
001200*    1/2/86.
001300*       CHANGED THE CRAFSTMAN WORKSHEET TO A SUBPROGRAM THAT CAN
001400*       BE CALLED FROM MMIS PROGRAMS WITH INITIAL DATA IN THE SCREEN
001500*       SPECIFIED.  THIS PROGRAM IS NOW JUST A MAIN PROGRAM TO OPEN
001600*       DATABASES, ETC, AND THEN CALL THE CRAFTSMAN WORKSHEET
001700*       SUBPROGRAM.  CIH.
001800*
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.  HP-3000.
002200 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

002300
002400 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

002500 WORKING-STORAGE SECTION.
002600
002700**************************************************************
002800**                                                          **
002900**     C O M M U N I C A T I O N S   A R E A S              **
003000**                                                          **
003100**************************************************************
003200
003300 COPY TBLOWUP    IN COPYCSIS.
003400 COPY TISSCRWS   IN COPYCSIS.
003500 COPY ESCNAM2   IN COPYCSIS.
003600 COPY CSWITCHF   IN COPYCSIS.
003700 01  ISCR-RET-CODE                 PIC S9(4) COMP-4 VALUE 0.
003800**************************************************************
003900**                                                          **
004000**                  V I E W   W O R K                       **
004100**                                                          **
004200**************************************************************
004300
       COPY VCOMAREA IN COPYCSIS.
009000 01  FORMFILE.
009100     05  FORM-FNAME                PIC X(8)  VALUE "FISSCRWS".
009200     05  FILLER                    PIC X     VALUE ".".
009300     05  FORM-GNAME.
009400         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009500         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009600     05  FILLER                    PIC X(19) VALUE SPACES.
009700
009800 01  TERMFILENAME         PIC X(11) VALUE "MYFILE ;".
009900
010000 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76      COMP-4.
010100
010200 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO    COMP-4.
010300
010400 01  MESSAGE-BUFFER.
010500     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
010600     05  MSG-FLD               PIC X(8)     VALUE SPACE.
010700     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
010800
010900*---------- WORK AREAS FOR HANDLING VIEW COMMUNICATIONS ERRORS
011000*01  ESC-RESET-TERM.
011100*    05  FILLER                    PIC X(1)  VALUE %33.
011200*    05  FILLER                    PIC X(1)  VALUE "g".
011300*01  VERR-COUNT                    PIC S9(4) COMP-4 VALUE 0.
011400*
011500**************************************************************
011600**                                                          **
011700**            D A T A B A S E   W O R K                     **
011800**                                                          **
011900**************************************************************
012000
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

012100 01  BASE                       PIC X(24) VALUE "  STORES;".
012200 01  MMIS-BASE                  PIC X(24) VALUE "  MMISA;".
012300 01  MMIS-PASSWORD              PIC X(7)  VALUE "DO-ALL;".
012400 01  PASSWORD                   PIC X(5)  VALUE "JADE;".
012500 COPY DBSTAT     IN COPYCSIS.
012600 01  DSET-NAMES.
012700     05  DSET-DUMMY             PIC X(2)  VALUE SPACES.
012800     05  DSET-MPLTINFO          PIC X(16) VALUE "MPLTINFO;".
012900
013000 01  ALL-ITEMS                  PIC X(2)  VALUE "@;".
013100
013200 01  MODE-AREA.
013300     05  MODE1                  PIC S9(4) COMP-4 VALUE 1.
013400     05  MODE7                  PIC S9(4) COMP-4 VALUE 7.
013500
013600 01  PLT-ARG                    PIC X(4)  VALUE "P 01".
013700
013800 COPY MPLT0      IN COPYCSIS.
013900 COPY MPLTP01   IN COPYCSIS.
014000 01  PASS-MPLTINFO-COMPANY      PIC X(4)  VALUE SPACES.
014100
014200**************************************
014300*                                    *
014400*    NATIVE LANGUAGE SUPPORT AREA    *
014500*                                    *
014600**************************************
014700
014800 COPY LANGUAGE   IN COPYCSIS.
014900
015000
015100 PROCEDURE DIVISION.
015200 1-HOUSEKEEP SECTION.
015300
           OPEN INPUT MPLTINFO.
015400*    CALL "TESCSEQ" USING ESC-NAME.
015500*
015600*    CALL "DBOPEN" USING BASE, PASSWORD, MODE1, STATUS-AREA.
015700*    IF COND-WORD NOT = 0
015800*        MOVE "DBOPEN ERR STORES"  TO BU-DISPLAY-MSG
015900*        PERFORM 2100-BLOWUP.
016000*
016100*    CALL "DBOPEN" USING MMIS-BASE, MMIS-PASSWORD, MODE1,
016200*      STATUS-AREA.
016300*    IF COND-WORD NOT = 0
016400*        MOVE "DBOPEN ERROR MMISA" TO  BU-DISPLAY-MSG
016500*        GO TO 2100-BLOWUP.
016600*
016700*    CALL INTRINSIC "FINDJCW" USING LANG-JCW-NAME, LANG-JCW-VALUE,
016800*                               LANG-JCW-STATUS.
016900*    IF LANG-JCW-STATUS NOT = 0
017000*        MOVE 1 TO LANG-JCW-VALUE.
017100*
017200*    CALL INTRINSIC "NLAPPEND" USING FORM-GNAME, LANG-JCW-VALUE,
017300*         LANG-ERROR.
017400*    IF LANG-ERROR1 NOT = 0
017500*        MOVE "001" TO FORM-GNAME2.
017600*
017700*    MOVE FORM-GNAME2 TO LANG-ERCAT-FNAME2, LANG-ERCAT-GNAME2.
017800*
017900*    CALL INTRINSIC "CATOPEN" USING LANG-ERCAT, LANG-ERROR,
018000*        GIVING LANG-INDEX.
018100*    IF LANG-ERROR1 NOT = 0
018200*        MOVE "CATOPEN FAILED * TMTSTEXC" TO BU-DISPLAY-MSG
018300*        GO TO 2100-BLOWUP.
018400*
018500*------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
018600*    MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
018700*    PERFORM 7150-CALL-CSWITCHF.
018800*
018900*------- HANDLE POSSIBLE VIEW ERRORS ON OPENTERM
019000*1020-OPENTERM.
019100*    CALL "VOPENTERM" USING VIEW-COMAREA, TERMFILENAME.
019200*    IF VIEW-STATUS NOT = 0
019300*        IF VERR-COUNT > 6
019400*            MOVE "7 ERRORS IN VOPENTERM 1020-O" TO BU-DISPLAY-MSG
019500*            PERFORM 2100-BLOWUP
019600*        ELSE
019700*            ADD 1                 TO   VERR-COUNT
019800*            DISPLAY ESC-RESET-TERM
019900*            MOVE 0                TO   VIEW-STATUS
020000*            GO TO 1020-OPENTERM.
020100*
020200*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7, STATUS-AREA,
020300*      ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
020400     IF COND-WORD NOT = 0
020500         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
020600         PERFORM 2100-BLOWUP.
020700
           CLOSE MPLTINFO.

020800     MOVE SPACES                   TO   ISCR-DATA.
020900     MOVE MPLTINFO-COMPANY         TO   PASS-MPLTINFO-COMPANY.
021000     CALL "TSUBCRWS" USING ISCR-RET-CODE, BASE, MMIS-BASE,
021100       STATUS-AREA, VIEW-COMAREA, LANGUAGE-PARMS, ISCR-DATA,
021200       PASS-MPLTINFO-COMPANY, ESC-NAME.
021300
021400 1-EOJ.
021500*    CALL INTRINSIC "CATCLOSE" USING LANG-INDEX, LANG-ERROR.
021600*    CALL "VCLOSETERM" USING VIEW-COMAREA.
021700*    CALL "VCLOSEFORMF" USING VIEW-COMAREA.
021800*    CALL "DBCLOSE" USING BASE, DSET-DUMMY, MODE1,
021900*        STATUS-AREA.
022000     GOBACK.
022100
022200 2100-BLOWUP.
022300     MOVE "TISSCRWS"               TO   BU-PGM-NAME.
022400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
022500       VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
022600       BU-DISPLAY-FLDS.
022700*
022800*7150-CALL-CSWITCHF.
022900*    CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
023000*      FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
023100*    IF BU-DISPLAY-MSG-1 NOT = SPACES
023200*        PERFORM 2100-BLOWUP.
