000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TJADDSEQ.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER. AS400.
000900 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.
001300 WORKING-STORAGE SECTION.
       01  BLOWUP-BASE             PIC X(16).

002600 01  C-MODE                  PIC X.
002700
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.

002800 01  CRFT-FIELD              PIC S9(4) COMP-4.
002900
003000 01  EST-FIELD               PIC S9(4) COMP-4.
003100
       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  JB-STATUS           PIC XX.
           05  WCRF-STATUS         PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

003800 01  JOB-CMP-SEQ             PIC 9999.
003900
004000 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
004100
004200 01  MEN-FIELD               PIC S9(4) COMP-4.
004500
004800 01  MISC-BUFFER.
           05  FILLER              PIC X(17).
           05  MISC-SEQ-1          PIC XXX.
           05  FILLER              PIC X(60).
004900
005000 01  NEXT-JOB-LINE.
005100     05 NEXT-LINE            PIC 999.
005200     05 NL REDEFINES NEXT-LINE.
005300        10 NL2               PIC 99.
005400        10 NL3               PIC 9.
005500     05 FILLER               PIC X.
005600
005700 01  PASSWORD-INFORMATION.
005800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TJADDSEQ".
005900     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
006000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
006100     05  PROGRAM-DESCRIPTION.
006200         10  PROG-DESC-A     PIC X(60) VALUE
006300            " ADDS OR APPENDS NEW LINES TO A JOBPLAN SEQUENCE  " .
006400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
006600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
006800     05  PASSWORD-FLAG       PIC X.
006900
007700 01  SAVE-CHAIN-NUM          PIC S9(9) COMP-4.
007800
       COPY DBSTAT OF COPYLIB.
008000
008100 01  SCREEN-DATA-1.
008200     05 PASSED-SCREEN.
008300        10 S-NAME            PIC X(10).
008400        10 S-TITLE           PIC X(30).
008500        10 S-ORIG            PIC X(4).
008600        10 S-SEQUENCE        PIC 9(3).
008700        10 S-LINES           PIC 9(3).
008800
008900     05 JOBPLAN-SCREEN-DATA.
009000        10 JOBPLAN-TABLE OCCURS 12 TIMES.
009100           15 JLINE          PIC 999.
009200           15 JOB-DATA.
009300              20 JDESC       PIC X(50).
                    20 JREST.
009400                 25 JDT1.
                          30 JDT1-1  PIC X.
                          30 JDT1-2  PIC X.
                          30 JDT1-3  PIC X.
009500                 25 JDT2     PIC X.
009600                 25 JCRFT    PIC X(2).
009700                 25 JMEN.
                          30 JMEN1 PIC X.
                          30 JMEN2 PIC X.
009800                 25 JEST1.
                          30 JEST1-1 PIC X.
                          30 JEST1-2 PIC X.
                          30 JEST1-3 PIC X.
009900                 25 JEST2    PIC X.
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
010000
010100 01  STOP-SW                 PIC X.
010200
010300 01  S1                      PIC S9(4) COMP-4.
010400
       COPY TBLOWUP OF COPYLIB.

       01  TRUE-VAL                PIC 1 VALUE B"1".

010500 01  WO-CRAFT.               COPY MWOCRAFT OF COPYLIB.
010600 COPY WSCONTROL OF COPYLIB.
010800
010700 LINKAGE SECTION.
010900 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
011200 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
011300 01  JOBPLAN-KEY.
011400     05 JOBP-WO-NO           PIC X(10).
011500     05 JOBP-SEQ-NO          PIC 999.
011600     05 FILLER               PIC X.
011900 PROCEDURE DIVISION USING    DBPARAMETERS
012000                             VIEW-COMAREA
012100                             LANGUAGE-PARMS
012200                             MASTER-JOBPLAN-DATA
012300                             JOBPLAN-KEY.
012500 START-PROGRAM.
012600     PERFORM 1-HSK.
012700     PERFORM 6-MAIN UNTIL STOP-SW = "Y".
012900 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-BANK.
           CLOSE WO-CRAFTS-REQD-FILE.
013000     GOBACK.
013100
013300 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   JOBPLAN-BANK.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
013400     CALL "TPWORD" USING PASSWORD-INFORMATION.
013800     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
02250      MOVE 0 TO S-LINES.
           IF VIEW-LASTKEY = 1
               PERFORM 69-START-JOBPLAN-BANK-ADD
           ELSE
           PERFORM 69-START-JOBPLAN-BANK-APPEND.
014400     IF COND-WORD = 17
014500         MOVE 10 TO NEXT-LINE
014700     ELSE
           PERFORM 69-READ-JOBPLAN-BANK THRU 69-RJB-EXIT
015200     IF COND-WORD = 0
015300         MOVE JOBP-LINE-NUM TO NEXT-LINE
015400         PERFORM 11-CHECK-LAST-LINE
015500         PERFORM 10-GET-NEXT-LINE UNTIL NL3 = 0.
016300     MOVE SPACES TO SCREEN-DATA-1.
016400     MOVE MASTER-JOBPLAN-DATA TO SCREEN-DATA-1.
016600     MOVE "S" TO C-MODE.
           MOVE "N" TO STOP-SW.

016800 10-GET-NEXT-LINE.
016900     ADD 1 TO NEXT-LINE.
017000
017100 11-CHECK-LAST-LINE.
017200*    IF SAVE-CHAIN-NUM > 98 OR SAVE-CHAIN-NUM = 98
017300*        MOVE 36010 TO CATREAD-MSG-NUMBER
017500*        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE MISC-BUFFER TO SCREEN-ERR-LINE
      *        MOVE TRUE-VAL TO INDS (99)
      *        MOVE SCREEN-DATA-1 TO DSPLY-REC
      *        PERFORM 99-SCREEN-WRITE
      *        PERFORM 98-SCREEN-READ
018800*        GO TO 2-EOJ
018900*    ELSE
019000     IF NEXT-LINE > 980 OR NEXT-LINE = 980
019100         MOVE 39019 TO CATREAD-MSG-NUMBER
019300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO SCREEN-ERR-LINE
               MOVE TRUE-VAL TO INDS (99)
               MOVE SCREEN-DATA-1 TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
020600         GO TO 2-EOJ.
020800     IF NL3 = 0 ADD 10 TO NEXT-LINE.
021000
021200 6-MAIN.
021300     PERFORM 60-SHOW-SCREEN.
021400     PERFORM 61-READ-SCREEN THRU 61-READ-SCREEN-EXIT.
021500     PERFORM 62-ADD-SEQUENCE-LINES.
021600
021800 60-SHOW-SCREEN.
021900     MOVE SPACES TO JOBPLAN-SCREEN-DATA.
022000     PERFORM 601-FILL-LINES VARYING S1 FROM 1 BY 1
022100         UNTIL S1 > 12.
           MOVE "FJADDSE2" TO VIEW-CFNAME.
           MOVE 42077 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
024600
024700 601-FILL-LINES.
024800     MOVE NEXT-LINE TO JLINE (S1).
024900     ADD 10 TO NEXT-LINE.
025000     IF NEXT-LINE > 980 MOVE 13 TO S1.
025200
025400 61-READ-SCREEN.
025500     PERFORM 98-SCREEN-READ.
026600     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
027800     IF VIEW-LASTKEY = 4
027900         IF C-MODE = "S"
028000             MOVE "FJADDSE3" TO VIEW-CFNAME
028100             MOVE "D"        TO C-MODE
                   MOVE 42142 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MISC-BUFFER TO SCREEN-CMD-LINE
                   MOVE SCREEN-DATA-1 TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   GO TO 61-READ-SCREEN
028200         ELSE
028300         MOVE "FJADDSE2" TO VIEW-CFNAME
028400         MOVE "S"        TO C-MODE
               MOVE 42077 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO SCREEN-CMD-LINE
028800         MOVE SCREEN-DATA-1 TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
029500         GO TO 61-READ-SCREEN.
029700     IF VIEW-LASTKEY = 0
029800         NEXT SENTENCE
029900     ELSE
030000     PERFORM 99-SCREEN-WRITE
030100     GO TO 61-READ-SCREEN.
030300     MOVE "FJADDSE2" TO VIEW-CFNAME.
030400     MOVE "S"        TO C-MODE.
032300     MOVE DSPLY-REC TO SCREEN-DATA-1.
033000     MOVE 1 TO S1.
033200     MOVE 21 TO CRFT-FIELD.
033400     MOVE 22 TO MEN-FIELD.
033600     MOVE 23 TO EST-FIELD.
033700 610-VALIDATE-DATA.
033900     IF JOB-DATA (S1) = SPACES OR JLINE (S1) = SPACES
034000         MOVE "Y" TO STOP-SW
034100         GO TO 61-READ-SCREEN-EXIT.
           IF JREST (S1) = SPACES GO TO 611-NEXT-LINE-CONT.
034700     IF JDT2 (S1) NUMERIC
034800         IF JDT1 (S1) NOT NUMERIC
034900             MOVE "000"        TO JDT1 (S1).
           IF JDT1-1 (S1) = " "
               IF JDT1-2 (S1) = " "
                   IF JDT1-3 (S1) = " "
                       MOVE "000"    TO JDT1 (S1)
                   ELSE
                   MOVE "0"          TO JDT1-1 (S1) JDT1-2 (S1)
               ELSE
               IF JDT1-3 (S1) = " "
                   MOVE JDT1-2 (S1)  TO JDT1-3 (S1)
                   MOVE "0"          TO JDT1-1 (S1) JDT1-2 (S1)
               ELSE
               MOVE "0"              TO JDT1-1 (S1)
           ELSE
           IF JDT1-3 (S1) = " "
               IF JDT1-2 (S1) = " "
                   MOVE JDT1-1 (S1)  TO JDT1-3 (S1)
                   MOVE "0" TO JDT1-2 (S1) JDT1-1 (S1)
               ELSE
               MOVE JDT1-2 (S1)      TO JDT1-3 (S1)
               MOVE JDT1-1 (S1)      TO JDT1-2 (S1)
               MOVE "0"              TO JDT1-1 (S1).
034300     IF JDT1 (S1) NUMERIC
034400         IF JDT2 (S1) NOT NUMERIC
034500             MOVE "0"          TO JDT2 (S1).
035500     IF JCRFT (S1) NOT = SPACES
035600         NEXT SENTENCE
035700     ELSE
035800     MOVE 29032 TO CATREAD-MSG-NUMBER
036000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036100     MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
036300     GO TO 61-READ-SCREEN.
036400     MOVE 0 TO COND-WORD.
           MOVE JCRFT (S1) TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
037000     IF COND-WORD = 17
037200         MOVE 35037 TO CATREAD-MSG-NUMBER
037400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
               MOVE MISC-BUFFER TO SCREEN-ERR-LINE
               MOVE SCREEN-DATA-1 TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
037700         GO TO 61-READ-SCREEN.
           IF JMEN1 (S1) = " "
               IF JMEN2 (S1) = " "
038400             MOVE 39013 TO CATREAD-MSG-NUMBER
038600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
038700             MOVE TRUE-VAL TO INDS (MEN-FIELD) INDS (99)
                   MOVE MISC-BUFFER TO SCREEN-ERR-LINE
                   MOVE SCREEN-DATA-1 TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
038900             GO TO 61-READ-SCREEN
               ELSE
               MOVE "0"              TO JMEN1 (S1)
           ELSE
           IF JMEN2 (S1) = " "
               MOVE JMEN1 (S1)       TO JMEN2 (S1)
               MOVE "0"              TO JMEN1 (S1).
039500     IF JEST2 (S1) NUMERIC
039600         IF JEST1 (S1) NOT NUMERIC
039700             MOVE "000"        TO JEST1 (S1).
           IF JEST1-1 (S1) = " "
               IF JEST1-2 (S1) = " "
                   IF JEST1-3 (S1) = " "
                       MOVE "000"    TO JEST1 (S1)
                   ELSE
                   MOVE "0"          TO JEST1-1 (S1) JEST1-2 (S1)
               ELSE
               IF JEST1-3 (S1) = " "
                   MOVE JEST1-2 (S1) TO JEST1-3 (S1)
                   MOVE "0"          TO JEST1-1 (S1) JEST1-2 (S1)
               ELSE
               MOVE "0"              TO JEST1-1 (S1)
           ELSE
           IF JEST1-3 (S1) = " "
               IF JEST1-2 (S1) = " "
                   MOVE JEST1-1 (S1) TO JEST1-3 (S1)
                   MOVE "0"          TO JEST1-2 (S1) JEST1-1 (S1)
               ELSE
               MOVE JEST1-2 (S1)     TO JEST1-3 (S1)
               MOVE JEST1-1 (S1)     TO JEST1-2 (S1)
               MOVE "0"              TO JEST1-1 (S1).
039100     IF JEST1 (S1) NUMERIC
039200         IF JEST2 (S1) NOT NUMERIC
039300             MOVE "0"          TO JEST2 (S1).
039900     IF JEST1 (S1) NUMERIC
040000         NEXT SENTENCE
040100     ELSE
040200     MOVE 31031 TO CATREAD-MSG-NUMBER
040400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040500     MOVE TRUE-VAL TO INDS (EST-FIELD) INDS (99)
           MOVE MISC-BUFFER TO SCREEN-ERR-LINE
           MOVE SCREEN-DATA-1 TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
040700     GO TO 61-READ-SCREEN.
040800
040900 611-NEXT-LINE-CONT.
041000     ADD 9 TO CRFT-FIELD MEN-FIELD EST-FIELD.
041200     ADD 1 TO S1.
041300     IF S1 > 12
041400         GO TO 61-READ-SCREEN-EXIT
041500     ELSE
041600     GO TO 610-VALIDATE-DATA.
041700
041800 61-READ-SCREEN-EXIT.    EXIT.
042000
042200 62-ADD-SEQUENCE-LINES.
042400     PERFORM 620-ADD-SEQUENCE-CONT
             VARYING S1 FROM 1 BY 1
               UNTIL (S1 > 12)
                 OR (JOB-DATA (S1) = SPACES)
042500             OR (JLINE (S1) = SPACES).
           MOVE 66232 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE TRUE-VAL TO INDS (98).
           MOVE JOBP-SEQ-NO TO MISC-SEQ-1.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
042700
042800 620-ADD-SEQUENCE-CONT.
042900     MOVE SPACES TO JOBPLAN-BUFFER.
043100     MOVE JOBP-WO-NO       TO JOBPLAN-NAME.
043200     MOVE SPACES           TO JOBPLAN-SEQ-NO.
043300     MOVE JOBP-SEQ-NO      TO JOBPLAN-SEQ-NO-1-3.
043400     MOVE JDESC (S1)       TO JOBPLAN-DESCRIP.
043600     IF JDT1 (S1) NUMERIC
043700         MOVE JDT1  (S1)     TO JOBPLAN-DT-HRS
043800         MOVE JDT2  (S1)     TO JOBPLAN-DT-PARTIAL.
044000     MOVE JCRFT (S1)       TO JOBPLAN-CRAFT.
044200     IF JMEN (S1) NUMERIC
044300         MOVE JMEN  (S1)     TO JOBPLAN-MEN.
044500     IF JEST1 (S1) NUMERIC
044600         MOVE JEST1 (S1)     TO JOBPLAN-EST-HRS
044700         MOVE JEST2 (S1)     TO JOBPLAN-EST-PARTIAL.
044900     MOVE SPACES           TO JOBP-LINE.
045000     MOVE JLINE (S1)       TO JOBP-LINE-NUM.
045200*    ADD 1 TO SAVE-CHAIN-NUM.
045300*    IF SAVE-CHAIN-NUM > 98
045400*        MOVE 36010 TO CATREAD-MSG-NUMBER
045600*        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
046900*        GO TO 2-EOJ.
           MOVE 0 TO COND-WORD.
           WRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
047400     IF COND-WORD = 17
047600         PERFORM 998-BLOWUP.

       69-READ-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = JOBP-N-S MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 0 TO COND-WORD
               READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
                   AT END    MOVE 15 TO COND-WORD
           ELSE
           GO TO 69-READ-JOBPLAN-BANK.
       69-RJB-EXIT.    EXIT.

       69-START-JOBPLAN-BANK-ADD.
013900     MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
           START JOBPLAN-BANK KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-JOBPLAN-BANK-APPEND.
013900     MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
           START JOBPLAN-BANK KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
049600
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TJADDSEQ" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

049700 999-CATREAD.
049800     MOVE SPACES TO MISC-BUFFER.
049900     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
050800 999-CATREAD-EXIT.    EXIT.
