000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TJBRWSEQ.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER. AS400.
000900 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
001300 WORKING-STORAGE SECTION.
       77  FST-SW                  PIC 9.

       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.

       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  JB-STATUS           PIC XX.

       01  HV-KEY                  PIC X(18).

       COPY IOFEEDBACK IN COPYLIB.

004200 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
004300
004400 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
004500
004800 01  PASSWORD-INFORMATION.
004900     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TJBRWSEQ".
005000     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
005100     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
005200     05  PROGRAM-DESCRIPTION.
005300         10  PROG-DESC-A     PIC X(60) VALUE
005400       " BROWSES A GENERIC JOBPLAN OR 1 SEQUENCE OF THE JOBPLAN ".
005500         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
005700         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
005900     05  PASSWORD-FLAG       PIC X.
006000
       01  SAVE-LAST-JOBPLAN-KEY   PIC X(14).

       COPY DBSTAT OF COPYLIB.
007900
008000 01  SCREEN-DATA-1.
008100     05 PASSED-SCREEN.
008200        10 S-NAME            PIC X(10).
008300        10 S-TITLE           PIC X(30).
008400        10 S-ORIG            PIC X(4).
008500        10 S-SEQUENCE        PIC 9(3).
008600
008700     05 JOBPLAN-SCREEN-DATA.
008800        10 JOBPLAN-TABLE OCCURS 12 TIMES.
008900           15 JLINE          PIC 999.
009000           15 JOB-DATA.
009100              20 JDESC       PIC X(50).
009200              20 JDT         PIC X(4).
009300              20 JCRFT       PIC X(2).
009400              20 JMEN        PIC X(2).
009500              20 JEST        PIC X(4).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
009600
009700 01  S1                      PIC S9(4) COMP-4.
009800
010300 01  SEQ1                    PIC 999.

       01  SUB1                    PIC 9(4).

010400 COPY WSCONTROL OF COPYLIB.
010500 LINKAGE SECTION.
010700 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
011000 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
011100 01  JOBPLAN-KEY.
011200     05 JOBP-WO-NO           PIC X(10).
011300     05 JOBP-SEQ-NO          PIC 999.
011400     05 FILLER               PIC X.
011500 01  SEQ2                    PIC 999.
011600 01  SEQ3                    PIC 999.
011700 01  SCREEN-NAME             PIC X(16).
012000 PROCEDURE DIVISION USING    DBPARAMETERS
012100                             VIEW-COMAREA
012200                             LANGUAGE-PARMS
012300                             MASTER-JOBPLAN-DATA
012400                             JOBPLAN-KEY
012500                             SEQ2
012600                             SEQ3
012700                             SCREEN-NAME.
012800
012900 START-PROGRAM.
013000     PERFORM 1-HSK.
013100     PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.
013300
013400 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-BANK.
013500     GOBACK.
013600
013800 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   JOBPLAN-BANK.
           MOVE 0 TO SUB1 COND-WORD.
           MOVE HIGH-VALUES TO HV-KEY.
           START JOBPLAN-BANK KEY > HV-KEY.
013900     CALL "TPWORD" USING PASSWORD-INFORMATION.
014300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
014800     MOVE SPACES TO SCREEN-DATA-1.
014900     MOVE MASTER-JOBPLAN-DATA TO SCREEN-DATA-1.
           MOVE SEQ2 TO SEQ1.
018100     MOVE SEQ1 TO JOBP-SEQ-NO.
018200     PERFORM 69-START-JOBPLAN-BANK.
           IF COND-WORD = 17 GO TO 2-EOJ.

015700 6-MAIN.
019400     PERFORM 601-MAIN-CONTROL1 THRU 6010-READ-SCREEN
019800         UNTIL COND-WORD = 99.
           MOVE 0 TO COND-WORD.
017600
017700 6-MAIN-EXIT.    EXIT.
017900
019900 601-MAIN-CONTROL1.
020000     PERFORM 6010-RETRIEVE-SEQ THRU 6010-R-S-E
               VARYING S1 FROM 1 BY 1
020100         UNTIL (S1 > 12) OR (COND-WORD = 15 OR 99).
           IF COND-WORD = 99
               MOVE SAVE-LAST-JOBPLAN-KEY TO JOBPLAN-KEY
               PERFORM 69-READ-JOBPLAN-PRIOR UNTIL COND-WORD = 14
               MOVE SPACES TO SAVE-LAST-JOBPLAN-KEY
               MOVE 99 TO COND-WORD
           ELSE
           IF S1 > 12
               NEXT SENTENCE
           ELSE
           MOVE 0 TO COND-WORD
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER.
           MOVE 66233 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
026300     MOVE SCREEN-NAME TO VIEW-CFNAME.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
       6010-READ-SCREEN.
           PERFORM 98-SCREEN-READ.
029100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
032900     IF VIEW-LASTKEY = 1
033100         NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 2
               IF JOBPLAN-NAME NOT = MJOBPLAN-NAME
                   NEXT SENTENCE
               ELSE
               IF COND-WORD = 99
                   MOVE 0 TO COND-WORD
                   MOVE 1 TO FST-SW
                   MOVE JOBP-N-S TO JOBPLAN-KEY
                   PERFORM 69-READ-JOBPLAN-BANK-BACK
                       UNTIL COND-WORD = 14 OR 99
      *            MOVE 0 TO COND-WORD
               ELSE
               MOVE 0 TO FST-SW
               MOVE JOBP-N-S TO JOBPLAN-KEY
               PERFORM 69-READ-JOBPLAN-BANK-BACK
                   UNTIL COND-WORD = 14 OR 99.
      *        MOVE 0 TO COND-WORD.
021100
021300 6010-RETRIEVE-SEQ.
021400     PERFORM 69-READ-JOBPLAN-BANK.
021600     IF COND-WORD = 0
021700         NEXT SENTENCE
021800     ELSE
021900     IF COND-WORD = 15
               MOVE GJOBPSEQ OF JBREC TO JOBPLAN-KEY
022000         GO TO 6010-R-S-E.
023600
023700     IF S1 = 1
023800         MOVE SPACES TO JOBPLAN-SCREEN-DATA.
           IF JOBPLAN-BUFFER = SPACES
               NEXT SENTENCE
           ELSE
024000     MOVE JOBPLAN-SEQ-NO-1-3  TO S-SEQUENCE
024200     MOVE JOBP-LINE-NUM       TO JLINE (S1)
024300     MOVE JOBPLAN-DESCRIP     TO JDESC (S1)
024400     MOVE JOBPLAN-DT          TO JDT   (S1)
024500     MOVE JOBPLAN-CRAFT       TO JCRFT (S1)
024600     MOVE JOBPLAN-MEN-X       TO JMEN  (S1)
024700     MOVE JOBPLAN-EST         TO JEST  (S1).
024800
024900 6010-R-S-E.    EXIT.
025100
       69-READ-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JOBPLAN-NAME NOT = JOBP-WO-NO
               MOVE SPACES TO JOBPLAN-BUFFER
               MOVE 99 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               NEXT SENTENCE
           ELSE
           MOVE JOBPLAN-KEY TO SAVE-LAST-JOBPLAN-KEY.

       69-READ-JOBPLAN-BANK-BACK.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END    MOVE 14 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 14 TO COND-WORD.
           IF COND-WORD = 14
               NEXT SENTENCE
           ELSE
           MOVE GJOBPSEQ OF JBREC TO SAVE-LAST-JOBPLAN-KEY.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               IF JOBPLAN-NAME NOT = JOBP-WO-NO
                   MOVE SPACES TO JOBPLAN-BUFFER
                   MOVE 99 TO COND-WORD
               ELSE
               MOVE 14 TO COND-WORD
               IF FST-SW = 0
                   MOVE 1 TO FST-SW
                   MOVE 0 TO COND-WORD
                   MOVE GJOBPSEQ OF JBREC TO JOBPLAN-KEY
                   GO TO 69-READ-JOBPLAN-BANK-BACK
               ELSE
               MOVE 0 TO FST-SW.

       69-READ-JOBPLAN-PRIOR.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END    MOVE 14 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 14 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 14 TO COND-WORD.
           IF COND-WORD = 14
               NEXT SENTENCE
           ELSE
           MOVE GJOBPSEQ OF JBREC TO SAVE-LAST-JOBPLAN-KEY.

       69-START-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           MOVE SPACES TO GJOBPSEQ OF JBREC.
           MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
           START JOBPLAN-BANK KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

036000 999-CATREAD.
036100     MOVE SPACES TO MISC-BUFFER.
036200     CALL "CCATREAD" USING CATREAD-PARMS.
036300     MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
037100 999-CATREAD-EXIT.    EXIT.
