000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TJDELSEQ.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
001100 WORKING-STORAGE SECTION.
       01  BLOWUP-BASE             PIC X(16).

       COPY CATREAD OF COPYLIB.

       COPY CPYIND  OF COPYLIB.

       01  DSPLY-STATUS            PIC XX.

004800 01  ERROR-BUFFER.
           05  FILLER              PIC X(17).
           05  ERR-SEQ-1           PIC XXX.
           05  FILLER              PIC X(60).
004900
       COPY IOFEEDBACK OF COPYLIB.

       01  JB-STATUS               PIC XX.

001300 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
001400
001500 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
001600
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TJDELSEQ".
001900     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A     PIC X(60) VALUE
002300             " DELETE GENERIC JOBPLAN SEQUENCE  "                .
002400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG       PIC X.
002900
       01  S1                      PIC 9(4).

008000 01  SCREEN-DATA-1.
008100     05 PASSED-SCREEN.
008200        10 S-NAME            PIC X(10).
008300        10 S-TITLE           PIC X(30).
008400        10 S-ORIG            PIC X(4).
008500        10 S-SEQUENCE        PIC 9(3).
008600
008700     05 JOBPLAN-SCREEN-DATA.
008800        10 JOBPLAN-TABLE OCCURS 12 TIMES.
008900           15 JLINE          PIC 999.
009000           15 JOB-DATA.
009100              20 JDESC       PIC X(50).
009200              20 JDT         PIC X(4).
009300              20 JCRFT       PIC X(2).
009400              20 JMEN        PIC X(2).
009500              20 JEST        PIC X(4).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
009600
       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP   OF COPYLIB.

       COPY WSCONTROL OF COPYLIB.
003200 LINKAGE SECTION.
003400 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
003700 01  JOBPLAN-KEY.
003800     05 JOBP-WO-NO           PIC X(10).
003900     05 JOBP-SEQ-NO          PIC 999.
004000     05 FILLER               PIC X.
011700 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
004100
004300 PROCEDURE DIVISION USING    DBPARAMETERS
004400                             VIEW-COMAREA
004500                             LANGUAGE-PARMS
004600                             JOBPLAN-KEY
                                   MASTER-JOBPLAN-DATA.

004800 START-PROGRAM.
004900     PERFORM 1-HSK.
005000     PERFORM 6-MAIN.
005200
005300 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-BANK.
005400     GOBACK.
005500
005700 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   JOBPLAN-BANK.
005800     CALL "TPWORD" USING PASSWORD-INFORMATION.
006200     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO S1.
006600
006800 6-MAIN.
           PERFORM 60-DISPLAY-SEQUENCE THRU 60-DS-EXIT.
           PERFORM 61-READ-PRIOR THRU 61-RP-EXIT UNTIL COND-WORD = 14.
           MOVE MASTER-JOBPLAN-DATA TO PASSED-SCREEN.
           MOVE "FMJOBPL5" TO VIEW-CFNAME.
           MOVE 66374 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 1
007300         PERFORM 62-DELETE-SEQUENCE THRU 62-DS-EXIT
               MOVE 0 TO VIEW-LASTKEY.
007400
007500 60-DISPLAY-SEQUENCE.
           MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
           START JOBPLAN-BANK KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
007600     IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
007800     IF COND-WORD = 17 GO TO 60-DS-EXIT.
008600
008700 60-LOOP-RETRIEVE.
008800     MOVE 0 TO COND-WORD.
008900     READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
009000     IF COND-WORD = 15 GO TO 60-DS-EXIT.
           ADD 1 TO S1.
           IF S1 > 12
               PERFORM 601-DS-BREAK THRU 601-DSB-X
               MOVE SPACES TO SCREEN-DATA-1
               MOVE 0 TO S1
               GO TO 60-LOOP-RETRIEVE.
024000     MOVE JOBPLAN-SEQ-NO-1-3  TO S-SEQUENCE.
024200     MOVE JOBP-LINE-NUM       TO JLINE (S1).
024300     MOVE JOBPLAN-DESCRIP     TO JDESC (S1).
024400     MOVE JOBPLAN-DT          TO JDT   (S1).
024500     MOVE JOBPLAN-CRAFT       TO JCRFT (S1).
024600     MOVE JOBPLAN-MEN-X       TO JMEN  (S1).
024700     MOVE JOBPLAN-EST         TO JEST  (S1).
           GO TO 60-LOOP-RETRIEVE.
       60-DS-EXIT.    EXIT.

       601-DS-BREAK.
           MOVE MASTER-JOBPLAN-DATA TO PASSED-SCREEN.
           MOVE "FMJOBPL5" TO VIEW-CFNAME.
           MOVE 66374 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 1
007300         PERFORM 62-DELETE-SEQUENCE THRU 62-DS-EXIT
               MOVE 0 TO VIEW-LASTKEY.
007400 601-DSB-X.    EXIT.

       61-READ-PRIOR.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END    MOVE 14 TO COND-WORD.
           IF JOBP-N-S NOT = JOBPLAN-KEY
               MOVE 14 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 14 TO COND-WORD.
       61-RP-EXIT.    EXIT.

007500 62-DELETE-SEQUENCE.
008800     MOVE 0 TO COND-WORD.
008900     READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
009000     IF COND-WORD = 15 GO TO 62-DS-EXIT.
009800     MOVE 0 TO COND-WORD.
           DELETE JOBPLAN-BANK RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
010000     IF COND-WORD = 17
010100         PERFORM 998-BLOWUP.
010400     GO TO 62-DELETE-SEQUENCE.
010500
010600 62-DS-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TJDELSEQ" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
