000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TJMODSEQ.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
           SELECT JOBPLAN-BANK-PF
               ASSIGN TO DATABASE-MCFPMM3600
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS JBPF-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  JOBPLAN-BANK-PF
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBPFREC.
       01  JBPFREC.
           COPY DDS-ALL-FORMATS OF MCFPMM3600.
       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.
001100 WORKING-STORAGE SECTION.
       77  END-MOD-SW              PIC 9.

       01  BLOWUP-BASE             PIC X(16).

002400 01  C-MODE                  PIC X.
002500
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.

002600 01  CRFT-FIELD              PIC S9(4) COMP-4.
002700
002800 01  DELETE-BYTE             PIC X.
002900
003000 01  DELETE-BYTES            PIC X(2).
003100
003600 01  EST-FIELD               PIC S9(4) COMP-4.
003700
004000 01  FIELDNUM                PIC S9(4) COMP-4.
004100
       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  JB-STATUS           PIC XX.
           05  JBPF-STATUS         PIC XX.
           05  WCRF-STATUS         PIC XX.

004200 01  HIGH-NUMBER             PIC 999.
004300
004400 01  INSERT-BYTE             PIC X.
004500
004600 01  INSERT-BYTES            PIC X(2).
004700
       COPY IOFEEDBACK OF COPYLIB.

004800 01  JOB-CMP-SEQ             PIC 9999.
004900
005000 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
005100
005200 01  JOBPLAN-SCREEN-DATA-1.
005300     05  JOBPLAN-TABLE-1 OCCURS 12 TIMES.
005400         10  JLINE-1         PIC 999.
005500         10  JOB-DATA-1.
005600             15  JDESC-1     PIC X(50).
005700             15  JDT-1       PIC X(4).
005800             15  JCRFT-1     PIC X(2).
005900             15  JMEN-1      PIC X(2).
006000             15  JEST-1      PIC X(4).
006100
006200 01  JOBPLAN-SCREEN-DATA-2.
006300     05  JOBPLAN-TABLE-2 OCCURS 12 TIMES.
006400         10  JLINE-2         PIC 999.
006500         10  JOB-DATA-2.
006600             15  JDESC-2     PIC X(50).
006700             15  JDT-2       PIC X(4).
006800             15  JCRFT-2     PIC X(2).
006900             15  JMEN-2      PIC X(2).
007000             15  JEST-2      PIC X(4).
007100
       01  HV-KEY                  PIC X(14) VALUE HIGH-VALUES.

       01  LINE-WA.
           05  L-WA.
               10  LWA OCCURS 3    PIC X.

007400 01  LINE-FOUND-SW           PIC X.
007500
007200 01  LOW-NUMBER              PIC 999.
007300
008200 01  MEN-FIELD               PIC S9(4) COMP-4.
008300
008400 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
008500
008600 01  MODIFY-BYTE             PIC X.
008700
007600 01  MOVE-BYTE               PIC X.
007700
007800 01  MOVE-BYTES              PIC X(2).
007900
009000 01  PASSWORD-INFORMATION.
009100     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TJMODSEQ".
009200     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
009300     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
009400     05  PROGRAM-DESCRIPTION.
009500         10  PROG-DESC-A     PIC X(60) VALUE
009600            " MODIFIES A GENERIC JOBPLAN SEQUENCE  "             .
009700         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
009900         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
010100     05  PASSWORD-FLAG       PIC X.
010200
       01  PFKEY                   PIC 9(9).

010500 01  REC-NUM1                PIC 9(9).
010600
010700 01  REC-NUM2                PIC 9(9).
010800
010900 01  RECORD-TABLE.
011000     05 RECORD-NUMBER OCCURS 12 TIMES
011100                             PIC S9(9) COMP-4.
011200
011300 01  RECORD-TABLE-2.
011400     05 RECORD-NUMBER-2 OCCURS 12 TIMES
011500                             PIC S9(9) COMP-4.
011600
013200 01  S1                      PIC S9(4) COMP-4.
013300
013400 01  S2                      PIC S9(4) COMP-4.
013500
013600 01  S3                      PIC S9(4) COMP-4.
013700
013800 01  S4                      PIC S9(4) COMP-4.
013900
014000 01  S5                      PIC S9(4) COMP-4.
014100
014200 01  S6                      PIC S9(4) COMP-4.
014300
014400 01  S7                      PIC S9(4) COMP-4.
014500
014600 01  S8                      PIC S9(4) COMP-4.
014700
014800 01  S9                      PIC S9(4) COMP-4.
014900
015000 01  S10                     PIC S9(4) COMP-4.
015100
015200 01  S11                     PIC S9(4) COMP-4.
015300
015400 01  S12                     PIC S9(4) COMP-4.
015500
015600 01  SAVE-REC-NUM1           PIC 9(9).
015700
016600 01  SCREEN-DATA-1.
016700     05 PASSED-SCREEN.
016800        10 S-NAME            PIC X(10).
016900        10 S-TITLE           PIC X(30).
017000        10 S-ORIG            PIC X(4).
017100        10 S-SEQUENCE        PIC 9(3).
017200        10 S-LINES           PIC 9(3).
017300
017400     05 JOBPLAN-SCREEN-DATA.
017500        10 JOBPLAN-TABLE OCCURS 12 TIMES.
017600           15 JLINE          PIC 999.
017700           15 JLINE-X REDEFINES JLINE
017800                             PIC XXX.
017900           15 JOB-DATA.
018000              20 JDESC       PIC X(50).
018100              20 JDT.
018200                 25 JDT1     PIC X(3).
018300                 25 JDT2     PIC X.
018400              20 JCRFT       PIC X(2).
018500              20 JMEN        PIC X(2).
018600              20 JEST.
018700                 25 JEST1    PIC X(3).
018800                 25 JEST2    PIC X.
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
018900
019000 01  SCREEN-DATA-2.
019100     05 PASSED-SCREEN2.
019200        10 S-NAME2           PIC X(10).
019300        10 S-TITLE2          PIC X(30).
019400        10 S-ORIG2           PIC X(4).
019500        10 S-SEQUENCE2       PIC 9(3).
019600        10 S-LINES2          PIC 9(3).
019700
019800     05 JOBPLAN-SCREEN-DATA2.
019900        10 JOBPLAN-TABLE2 OCCURS 10 TIMES.
020000           15 JLINE2         PIC 999.
020100           15 JLINE-X2       REDEFINES JLINE2
020200                             PIC XXX.
020300           15 MOVE-LINE2     PIC 999.
020400           15 MOVE-LINE-X2   REDEFINES MOVE-LINE2
020500                             PIC XXX.
           05  SCREEN-CMD2-LINE    PIC X(79).
           05  SCREEN-ERR2-LINE    PIC X(79).
020600
       COPY DBSTAT OF COPYLIB.
015700
       COPY TBLOWUP  OF COPYLIB.

       01  TRUE-VAL                PIC 1 VALUE B"1".

020700 01  WO-CRAFT.               COPY MWOCRAFT OF COPYLIB.
020800
       COPY WSCONTROL OF COPYLIB.

020900 LINKAGE SECTION.
021100 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
021400 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
021500 01  JOBPLAN-KEY.
021600     05 JOBP-WO-NO           PIC X(10).
021700     05 JOBP-SEQ-NO          PIC 999.
021800     05 FILLER               PIC X.
021900
022100 PROCEDURE DIVISION USING    DBPARAMETERS
022200                             VIEW-COMAREA
022300                             LANGUAGE-PARMS
022400                             MASTER-JOBPLAN-DATA
022500                             JOBPLAN-KEY.
022700 START-PROGRAM.
022800     PERFORM 1-HSK.
022900     PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
023100
023200 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-BANK.
           CLOSE JOBPLAN-BANK-PF.
           CLOSE WO-CRAFTS-REQD-FILE.
023300     GOBACK.
023400
023600 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   JOBPLAN-BANK.
           OPEN I-O   JOBPLAN-BANK-PF.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
023700     CALL "TPWORD" USING PASSWORD-INFORMATION.
024100     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
024600     MOVE SPACES              TO SCREEN-DATA-1.
024700     MOVE MASTER-JOBPLAN-DATA TO SCREEN-DATA-1.
024900     MOVE 0 TO S1 S2 S3 S4 S5 S6 S7 S8 S9 S10 S11 S12.
025400
025600 6-MAIN.
           MOVE 0 TO COND-WORD.
025700     MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
025800     START JOBPLAN-BANK KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
025900     IF COND-WORD = 17
026000         GO TO 2-EOJ
026100     ELSE
026200     IF COND-WORD = 0
               MOVE 0 TO S-LINES
               MOVE 0 TO END-MOD-SW
026400         PERFORM 60-MAIN-CONTROL1 THRU 60-M-C-E
026800             UNTIL VIEW-LASTKEY = 3.

026900 60-MAIN-CONTROL1.
027000     PERFORM 601-RETRIEVE-SEQ THRU 601-R-S-E
               VARYING S1 FROM 1 BY 1
027100         UNTIL (S1 > 12) OR (COND-WORD = 15).
           IF COND-WORD = 15 MOVE 1 TO END-MOD-SW.
028500     MOVE JOBPLAN-SCREEN-DATA TO JOBPLAN-SCREEN-DATA-1.
028700     MOVE "Y" TO MODIFY-BYTE.
028800     MOVE "Y" TO DELETE-BYTE.
028900     MOVE "N" TO INSERT-BYTE.
029000     MOVE "N" TO MOVE-BYTE.
029100     MOVE  0  TO S5 S11.
038900     MOVE "FJMODSE2" TO VIEW-CFNAME.
           MOVE 66234 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA-1 TO DSPLY-REC.
039000     MOVE "S" TO C-MODE.
039900     PERFORM 99-SCREEN-WRITE.
           PERFORM 600-READ-SCREEN THRU 600-READ-SCREEN-EXIT.
029700     IF MODIFY-BYTE = "Y"
030000         PERFORM 6010-MODIFY-LINES THRU 6010-M-L-E
                   VARYING S3 FROM 1 BY 1 UNTIL
030100                (S3 > 12) OR (JLINE-X (S3) = SPACES)
030300         PERFORM 6011-MOVE-LINES   THRU 6011-MOVE-EXIT
030500         PERFORM 6012-INSERT-LINES THRU 6012-INSERT-EXIT
               MOVE 0 TO S-LINES
               MOVE 0 TO COND-WORD.
           IF END-MOD-SW = 1
               MOVE 3 TO VIEW-LASTKEY.
032700 60-M-C-E.    EXIT.
032900
       600-READ-SCREEN.
029600     PERFORM 98-SCREEN-READ.
041800     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
043000     IF VIEW-LASTKEY = 4
043100         IF C-MODE = "S"
043200             MOVE "FJMODSE3" TO VIEW-CFNAME
043300             MOVE "D"        TO C-MODE
                   MOVE 66235 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MISC-BUFFER TO SCREEN-CMD-LINE
                   MOVE SCREEN-DATA-1 TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   GO TO 600-READ-SCREEN
043400         ELSE
043500         MOVE "FJMODSE2" TO VIEW-CFNAME
043600         MOVE "S"        TO C-MODE
               MOVE 66234 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-DATA-1 TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               GO TO 600-READ-SCREEN.
           IF VIEW-LASTKEY = 1 OR 5 OR 6
               MOVE SPACES TO SCREEN-ERR-LINE
           ELSE
           MOVE DSPLY-REC TO SCREEN-DATA-1
           MOVE 35126 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO SCREEN-ERR-LINE
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           MOVE SCREEN-DATA-1 TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           GO TO 600-READ-SCREEN.
045500     IF VIEW-LASTKEY = 5
045600         MOVE "N" TO MODIFY-BYTE
               MOVE REC-NUM1 TO SAVE-REC-NUM1
               START JOBPLAN-BANK KEY > HV-KEY
               MOVE REC-NUM2 TO PFKEY
               PERFORM 69-READ-JOBPLAN-BANK-PF
046400         GO TO 600-READ-SCREEN-EXIT.
046600     IF VIEW-LASTKEY = 6
               MOVE 0 TO END-MOD-SW
046700         MOVE "N" TO MODIFY-BYTE
               MOVE SAVE-REC-NUM1 TO REC-NUM1
               PERFORM 601-RETRIEVE-JOBPLAN-PRIOR THRU 601-R-J-P-E
                   UNTIL COND-WORD = 99
               MOVE 0 TO COND-WORD
047500         GO TO 600-READ-SCREEN-EXIT.
048100     MOVE "FJMODSE2" TO VIEW-CFNAME.
           MOVE DSPLY-REC TO SCREEN-DATA-1.
048200     MOVE "S"        TO C-MODE.
050800     MOVE 1 TO S2.
051000     MOVE 21 TO CRFT-FIELD.
051200     MOVE 22 TO MEN-FIELD.
051400     MOVE 23 TO EST-FIELD.
           MOVE REC-NUM1 TO SAVE-REC-NUM1.
051500
051600 600-VALIDATE-DATA.
051700     IF JLINE-X (S2) = SPACES GO TO 600-READ-SCREEN-EXIT.
052000     IF JDT1 (S2) NUMERIC
052100         IF JDT2 (S2) NOT NUMERIC
052200             MOVE "0" TO JDT2 (S2).
052400     IF JDT2 (S2) NUMERIC
052500         IF JDT1 (S2) NOT NUMERIC
052600             MOVE "000" TO JDT1 (S2).
052800     IF SPACES = JCRFT (S2) AND JMEN (S2) AND JEST1 (S2)
052900                                          AND JEST2 (S2)
053000         GO TO 600-NEXT-LINE-CONT.
053200     IF JCRFT (S2) NOT = SPACES
053300         NEXT SENTENCE
053400     ELSE
053500     MOVE 29032 TO CATREAD-MSG-NUMBER
053700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
054000     GO TO 600-READ-SCREEN.
           MOVE 0 TO COND-WORD.
054200     MOVE JCRFT (S2) TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WCRF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
054600     IF COND-WORD = 17
054800         MOVE 35037 TO CATREAD-MSG-NUMBER
055000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
055100         MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
055300         GO TO 600-READ-SCREEN.
055800     IF JMEN (S2) NUMERIC
055900         NEXT SENTENCE
056000     ELSE
056100     MOVE 39013 TO CATREAD-MSG-NUMBER
056300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
056400     MOVE TRUE-VAL TO INDS (MEN-FIELD) INDS (99)
056600     GO TO 600-READ-SCREEN.
056800     IF JEST1 (S2) NUMERIC
056900         IF JEST2 (S2) NOT NUMERIC
057000             MOVE "0" TO JEST2 (S2).
057200     IF JEST2 (S2) NUMERIC
057300         IF JEST1 (S2) NOT NUMERIC
057400             MOVE "000" TO JEST1 (S2).
057600     IF JEST1 (S2) NUMERIC
057700         NEXT SENTENCE
057800     ELSE
057900     MOVE 31031 TO CATREAD-MSG-NUMBER
058100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058200     MOVE TRUE-VAL TO INDS (MEN-FIELD) INDS (99)
058400     GO TO 600-READ-SCREEN.
058500
058600 600-NEXT-LINE-CONT.
058700     ADD 8 TO CRFT-FIELD MEN-FIELD EST-FIELD.
058900     ADD 1 TO S2.
059000     IF S2 > 12
059100         NEXT SENTENCE
059200     ELSE
059300     GO TO 600-VALIDATE-DATA.
       600-READ-SCREEN-EXIT.    EXIT.

       601-RETRIEVE-JOBPLAN-PRIOR.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END MOVE 99 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 99 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 99 TO COND-WORD.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           IF IO-REL-NO < SAVE-REC-NUM1 MOVE 99 TO COND-WORD.
       601-R-J-P-E.    EXIT.

033100 601-RETRIEVE-SEQ.
           PERFORM 69-READ-JOBPLAN-BANK.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
034000     IF COND-WORD = 15 GO TO 601-R-S-E.
035800     IF S1 = 1
               MOVE IO-REL-NO TO REC-NUM1 REC-NUM2
035900         MOVE SPACES TO JOBPLAN-SCREEN-DATA
036000                        JOBPLAN-SCREEN-DATA-1
036100                        JOBPLAN-SCREEN-DATA-2.
036300     MOVE IO-REL-NO TO RECORD-NUMBER (S1) REC-NUM2.
           ADD 1 TO S-LINES.
036500     MOVE JOBPLAN-SEQ-NO-1-3  TO S-SEQUENCE.
036700     MOVE JOBP-LINE-NUM       TO JLINE (S1).
036800     MOVE JOBPLAN-DESCRIP     TO JDESC (S1).
036900     MOVE JOBPLAN-DT          TO JDT   (S1).
037000     MOVE JOBPLAN-CRAFT       TO JCRFT (S1).
037100     MOVE JOBPLAN-MEN-X       TO JMEN  (S1).
037200     MOVE JOBPLAN-EST         TO JEST  (S1).
037400 601-R-S-E.    EXIT.
037600
059900 6010-MODIFY-LINES.
060000     IF JOB-DATA (S3) = JOB-DATA-1 (S3)
060100         MOVE "N" TO DELETE-BYTE
060200         GO TO 6010-M-L-E.
060400     MOVE JOB-DATA (S3) TO INSERT-BYTES.
060500     IF INSERT-BYTES = "I*"
060600         MOVE "Y" TO INSERT-BYTE
060700         MOVE "N" TO DELETE-BYTE
060800         IF S5 = 0
060900             MOVE S3 TO S5
061000             GO TO 6010-M-L-E
061100         ELSE
061200         GO TO 6010-M-L-E.
061400     MOVE JOB-DATA (S3) TO MOVE-BYTES.
061500     IF MOVE-BYTES = "M*" OR "C*"
061600         MOVE "N" TO DELETE-BYTE
061700         IF S11 = 0
061800             MOVE S3 TO S11
061900             MOVE MOVE-BYTES TO MOVE-BYTE
062000             GO TO 6010-M-L-E
062100         ELSE
062200         GO TO 6010-M-L-E.
           MOVE RECORD-NUMBER (S3) TO PFKEY.
           PERFORM 69-READ-JOBPLAN-BANK-PF.
062600     IF COND-WORD = 0
062700         NEXT SENTENCE
062800     ELSE
062900     PERFORM 998-BLOWUP.
           REWRITE JBPFREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JBPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6010-M-L-E.
           PERFORM 69-START-JOBPLAN-BANK.
           IF COND-WORD = 17 GO TO 6010-M-L-E.
           PERFORM 69-READ-JOBPLAN-BANK.
           IF COND-WORD = 15 GO TO 6010-M-L-E.
063200     MOVE JOB-DATA (S3) TO DELETE-BYTES.
063300     IF DELETE-BYTES = "D*" OR JOB-DATA (S3) = SPACES
               PERFORM 69-DELETE-JOBPLAN-BANK
               IF COND-WORD = 17
                   PERFORM 998-BLOWUP
               ELSE
               SUBTRACT 1 FROM S-LINES
064000         GO TO 6010-M-L-E.
064200     MOVE "N" TO DELETE-BYTE.
064400     MOVE JDESC (S3) TO JOBPLAN-DESCRIP.
064500     MOVE JDT   (S3) TO JOBPLAN-DT.
064600     MOVE JCRFT (S3) TO JOBPLAN-CRAFT.
064700     MOVE JMEN  (S3) TO JOBPLAN-MEN-X.
064800     MOVE JEST  (S3) TO JOBPLAN-EST.
           MOVE 0 TO COND-WORD.
           REWRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
065200     IF COND-WORD NOT = 0
065300         PERFORM 998-BLOWUP.
065600 6010-M-L-E.    EXIT.
097000
097200 6011-MOVE-LINES.
097300     IF MOVE-BYTE = "N" GO TO 6011-MOVE-EXIT.
           MOVE RECORD-NUMBER (S11) TO PFKEY.
           PERFORM 69-READ-JOBPLAN-BANK-PF.
100500     IF COND-WORD NOT = 0
100600         PERFORM 998-BLOWUP.
100800     MOVE JOBP-LINE-NUM TO HIGH-NUMBER.
           REWRITE JBPFREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JBPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6011-MOVE-EXIT.
           PERFORM 69-START-JOBPLAN-BANK.
           IF COND-WORD = 17 GO TO 6011-MOVE-EXIT.
101000     PERFORM 69-READ-JOBPLAN-BANK-PRIOR.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
101200     IF COND-WORD = 0
101300         MOVE JOBP-LINE-NUM TO LOW-NUMBER
101400         ADD 1 TO LOW-NUMBER
101500     ELSE
101600*    IF COND-WORD = 14
101700*        MOVE 1 TO LOW-NUMBER.
102200*    IF LOW-NUMBER = HIGH-NUMBER
102300*        PERFORM 6013-RESET-CHAIN THRU 6013-R-C-E
102600*        GO TO 6011-MOVE-EXIT.
           REWRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6011-MOVE-EXIT.
103200     PERFORM 60110-SHOW-SCREEN2.
103300     PERFORM 60111-READ-SCREEN2 THRU 60111-READ-SCREEN2-EXIT.
103400     PERFORM 60112-MOVE-COPY-LINES.
103600 6011-MOVE-EXIT.    EXIT.
103800
104000 60110-SHOW-SCREEN2.
104100     MOVE PASSED-SCREEN TO PASSED-SCREEN2.
104200     MOVE SPACES TO JOBPLAN-SCREEN-DATA2.
104300     MOVE 1 TO S12.
104400     PERFORM 601100-FILL-LINES2 VARYING S11 FROM LOW-NUMBER BY 1
104500                         UNTIL S11 = HIGH-NUMBER
104600                         OR    S12 > 10.
104700     MOVE "FJMODSE4" TO VIEW-CFNAME.
105200     IF MOVE-BYTE = "M"
105300         MOVE 31032 TO CATREAD-MSG-NUMBER
105500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO SCREEN-CMD2-LINE
105600     ELSE
105700     MOVE 31034 TO CATREAD-MSG-NUMBER
105900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO SCREEN-CMD2-LINE.
           MOVE SCREEN-DATA-2 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
107000
107100 601100-FILL-LINES2.
107200     MOVE S11 TO JLINE2 (S12).
107300     ADD 1 TO S12.
107400
107600 60111-READ-SCREEN2.
107700     PERFORM 98-SCREEN-READ.
108800     IF VIEW-LASTKEY = 3 PERFORM 2-EOJ.
109000     IF VIEW-LASTKEY = 0
10910          NEXT SENTENCE
109200     ELSE
109400     GO TO 60111-READ-SCREEN2.
111500     MOVE DSPLY-REC TO SCREEN-DATA-2.
111900 60111-READ-SCREEN2-EXIT.    EXIT.
112100
112300 60112-MOVE-COPY-LINES.
      *    PERFORM 6013-RESET-CHAIN THRU 6013-R-C-E.
112500     PERFORM 601120-MOVE-COPY-CONT THRU 601120-M-C-C-E
               VARYING S8 FROM 1 BY 1 UNTIL
112600            MOVE-LINE-X2 (S8) = SPACES OR JLINE-X2 (S8) = SPACES
112700                OR S8 > 10.
112800
113000 601120-MOVE-COPY-CONT.
           PERFORM 69-READ-JOBPLAN-BANK.
114200     IF COND-WORD = 0
114300         ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
114400     ELSE
           MOVE 11 TO S8
           MOVE 0 TO COND-WORD
114500     GO TO 601120-M-C-C-E.
114800     MOVE "N" TO LINE-FOUND-SW.
114900     PERFORM 6011200-GET-LINE THRU 6011200-GET-LINE-EXIT
115000         UNTIL COND-WORD = 15 OR LINE-FOUND-SW = "Y".
115200     IF LINE-FOUND-SW = "N" GO TO 601120-M-C-C-E.
117500     IF MOVE-BYTE = "M"
117700         PERFORM 69-DELETE-JOBPLAN-BANK
117800         IF COND-WORD = 17
117900             PERFORM 998-BLOWUP
               ELSE
               SUBTRACT 1 FROM S-LINES.
118200     MOVE JLINE2 (S8) TO JOBP-LINE-NUM.
           MOVE 0 TO COND-WORD.
           WRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
118700     IF COND-WORD = 17
118800         PERFORM 998-BLOWUP.
119300 601120-M-C-C-E.    EXIT.
119500
119700 6011200-GET-LINE.
           MOVE MOVE-LINE2 (S8) TO L-WA.
           PERFORM 6011201-RIGHT-ADJ-LINE THRU 6011201-RAL-EXIT.
           MOVE L-WA TO MOVE-LINE2 (S8).
119800     IF JOBP-LINE-NUM = MOVE-LINE2 (S8)
119900         MOVE "Y" TO LINE-FOUND-SW
120000         GO TO 6011200-GET-LINE-EXIT.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
120500     IF COND-WORD = 0 OR 15
120600         NEXT SENTENCE
120700     ELSE
120800     PERFORM 998-BLOWUP.
121100 6011200-GET-LINE-EXIT.    EXIT.
121300
       6011201-RIGHT-ADJ-LINE.
           IF LWA (3) = " "
               IF LWA (2) = " "
                   IF LWA (1) = " "
                       NEXT SENTENCE
                   ELSE
                   MOVE LWA (1) TO LWA (3)
               ELSE
               MOVE LWA (2) TO LWA (3)
               MOVE LWA (1) TO LWA (2).
           IF LWA (3) = " " MOVE "0" TO LWA (3).
           IF LWA (2) = " " MOVE "0" TO LWA (2).
           IF LWA (1) = " " MOVE "0" TO LWA (1).
       6011201-RAL-EXIT.    EXIT.

066000 6012-INSERT-LINES.
066100     IF INSERT-BYTE = "N" GO TO 6012-INSERT-EXIT.
           MOVE RECORD-NUMBER (S5) TO PFKEY.
           PERFORM 69-READ-JOBPLAN-BANK-PF.
069500     MOVE JOBP-LINE-NUM TO HIGH-NUMBER.
           REWRITE JBPFREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JBPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6012-INSERT-EXIT.
           MOVE 0 TO COND-WORD.
           MOVE JOBP-N-S TO GJOBPSEQ OF JBREC.
           MOVE JOBP-LINE TO GJOBPLINE OF JBREC.
           START JOBPLAN-BANK KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6012-INSERT-EXIT.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END    MOVE 14 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 14 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 14 TO COND-WORD.
069900     IF COND-WORD = 0
070000         MOVE JOBP-LINE-NUM TO LOW-NUMBER
070100         ADD 1 TO LOW-NUMBER.
070200*    ELSE
070300*    IF COND-WORD = 14
070400*        MOVE 1 TO LOW-NUMBER.
070900*    IF LOW-NUMBER = HIGH-NUMBER
071000*        PERFORM 6013-RESET-CHAIN THRU 6013-R-C-E
071300*        GO TO 6012-INSERT-EXIT.
           REWRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6012-INSERT-EXIT.
071900     PERFORM 60120-SHOW-SCREEN1.
072000     PERFORM 60121-READ-SCREEN1 THRU 60121-READ-SCREEN1-EXIT.
072100     PERFORM 60122-ADD-SEQUENCE-LINES.
072300 6012-INSERT-EXIT.    EXIT.
072500
072700 60120-SHOW-SCREEN1.
072800     MOVE SPACES TO JOBPLAN-SCREEN-DATA.
072900     MOVE 1 TO S6.
073000     PERFORM 601200-FILL-LINES VARYING S5 FROM LOW-NUMBER BY 1
073100                        UNTIL S5 = HIGH-NUMBER
073200                        OR    S6 > 10.
073300     MOVE "S" TO C-MODE.
073400     MOVE "FJADDSE2" TO VIEW-CFNAME.
           MOVE 66173 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
074300     MOVE SCREEN-DATA-1 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
074800
074900 601200-FILL-LINES.
075000     MOVE S5 TO JLINE (S6).
075100     ADD 1 TO S6.
075200
075400 60121-READ-SCREEN1.
075500     PERFORM 98-SCREEN-READ.
076600     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
076800     IF VIEW-LASTKEY = 4
076900       IF C-MODE = "S"
077000           MOVE "FJADDSE3" TO VIEW-CFNAME
077100           MOVE "D"        TO C-MODE
                 MOVE 66234 TO CATREAD-MSG-NUMBER
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MISC-BUFFER TO SCREEN-CMD-LINE
                 MOVE SCREEN-DATA-1 TO DSPLY-REC
                 PERFORM 99-SCREEN-WRITE
                 GO TO 60121-READ-SCREEN1
077200       ELSE
077300       MOVE "FJADDSE2" TO VIEW-CFNAME
077400       MOVE "S"        TO C-MODE
             MOVE 66235 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MISC-BUFFER TO SCREEN-CMD-LINE
             MOVE SCREEN-DATA-1 TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO 60121-READ-SCREEN1.
078700     IF VIEW-LASTKEY = 0
078800         NEXT SENTENCE
078900     ELSE
079100     GO TO 60121-READ-SCREEN1.
079300     MOVE "FJADDSE2" TO VIEW-CFNAME.
079400     MOVE "S"        TO C-MODE.
081600     MOVE DSPLY-REC TO SCREEN-DATA-1.
082000     MOVE 1 TO S7.
082200     MOVE 21 TO CRFT-FIELD.
082400     MOVE 22 TO MEN-FIELD.
082600     MOVE 23 TO EST-FIELD.
082700
082800 60121-VALIDATE-DATA1.
082900     IF JOB-DATA (S7) = SPACES OR JLINE-X (S7) = SPACES
083000         GO TO 60121-READ-SCREEN1-EXIT.
083200     IF JDT1 (S7) NUMERIC
083300         IF JDT2 (S7) NOT NUMERIC
083400             MOVE "0" TO JDT2 (S7).
083600     IF JDT2 (S7) NUMERIC
083700         IF JDT1 (S7) NOT NUMERIC
083800             MOVE "000" TO JDT1 (S7).
084000     IF SPACES = JCRFT (S7) AND JMEN (S7) AND JEST1 (S7)
084100                                          AND JEST2 (S7)
084200         GO TO 60121-NEXT-LINE-CONT1.
084400     IF JCRFT (S7) NOT = SPACES
084500         NEXT SENTENCE
084600     ELSE
084700     MOVE 29032 TO CATREAD-MSG-NUMBER
084900     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
085000     MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
085200     GO TO 60121-READ-SCREEN1.
           MOVE 0 TO COND-WORD.
085400     MOVE JCRFT (S7) TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WCRF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
085800     IF COND-WORD = 17
086000         MOVE 35037 TO CATREAD-MSG-NUMBER
086200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
086300         MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
086500         GO TO 60121-READ-SCREEN1.
087000     IF JMEN (S7) NUMERIC
087100         NEXT SENTENCE
087200     ELSE
087300     MOVE 39013 TO CATREAD-MSG-NUMBER
087500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
087600     MOVE TRUE-VAL TO INDS (MEN-FIELD) INDS (99)
087800     GO TO 60121-READ-SCREEN1.
088000     IF JEST1 (S7) NUMERIC
088100         IF JEST2 (S7) NOT NUMERIC
088200             MOVE "0" TO JEST2 (S7).
088400     IF JEST2 (S7) NUMERIC
088500         IF JEST1 (S7) NOT NUMERIC
088600             MOVE "000" TO JEST1 (S7).
088800     IF JEST1 (S7) NUMERIC
088900         NEXT SENTENCE
089000     ELSE
089100     MOVE 31031 TO CATREAD-MSG-NUMBER
089300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
089400     MOVE TRUE-VAL TO INDS (CRFT-FIELD) INDS (99)
089600     GO TO 60121-READ-SCREEN1.
089700
089800 60121-NEXT-LINE-CONT1.
089900     ADD 8 TO CRFT-FIELD MEN-FIELD EST-FIELD.
090100     ADD 1 TO S7.
090200     IF S7 > 12
090300         GO TO 60121-READ-SCREEN1-EXIT
090400     ELSE
090500     GO TO 60121-VALIDATE-DATA1.
090700 60121-READ-SCREEN1-EXIT.    EXIT.
090900
091100 60122-ADD-SEQUENCE-LINES.
091400     PERFORM 601220-ADD-SEQUENCE-CONT VARYING S8 FROM 1 BY 1
091500         UNTIL JOB-DATA (S8) = SPACES OR JLINE-X (S8) = SPACES
091600             OR S8 > 12.
091700
091900 601220-ADD-SEQUENCE-CONT.
092000     MOVE SPACES TO JOBPLAN-BUFFER.
092200     MOVE JOBP-WO-NO       TO JOBPLAN-NAME.
092300     MOVE SPACES           TO JOBPLAN-SEQ-NO.
092400     MOVE JOBP-SEQ-NO      TO JOBPLAN-SEQ-NO-1-3.
092500     MOVE JDESC (S8)       TO JOBPLAN-DESCRIP.
092700     IF JDT1 (S8) NUMERIC
092800         MOVE JDT1  (S8)     TO JOBPLAN-DT-HRS
092900         MOVE JDT2  (S8)     TO JOBPLAN-DT-PARTIAL.
093100     MOVE JCRFT (S8)       TO JOBPLAN-CRAFT.
093300     IF JMEN (S8) NUMERIC
093400         MOVE JMEN  (S8)     TO JOBPLAN-MEN.
093600     IF JEST1 (S8) NUMERIC
093700         MOVE JEST1 (S8)     TO JOBPLAN-EST-HRS
093800         MOVE JEST2 (S8)     TO JOBPLAN-EST-PARTIAL.
094000     MOVE SPACES           TO JOBP-LINE.
094100     MOVE JLINE (S8)       TO JOBP-LINE-NUM.
096200     WRITE JBREC FROM JOBPLAN-BUFFER
096300         INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
096500     IF COND-WORD = 17
096600         PERFORM 998-BLOWUP.

121500*6013-RESET-CHAIN.
      *    MOVE REC-NUM1 TO PFKEY.
      *    PERFORM 69-READ-JOBPLAN-BANK-PF.
      *    IF COND-WORD = 14 OR 15 PERFORM 998-BLOWUP.
      *    REWRITE JBPFREC FROM JOBPLAN-BUFFER
      *        INVALID KEY    MOVE 17 TO COND-WORD.
      *    IF JBPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
      *    IF COND-WORD = 17 PERFORM 998-BLOWUP.
      *    MOVE 0 TO COND-WORD.
      *    MOVE JOBP-N-S TO GJOBPSEQ OF JBREC.
      *    MOVE JOBP-LINE TO GJOBPLINE OF JBREC.
      *    START JOBPLAN-BANK KEY = EXTERNALLY-DESCRIBED-KEY
      *        INVALID KEY    MOVE 17 TO COND-WORD.
      *    IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
      *    PERFORM 69-READ-JOBPLAN-BANK-PRIOR UNTIL COND-WORD = 14.
122800*6013-R-C-E.    EXIT.

037700 602-SWITCH-LINES.
037800     IF JOBPLAN-TABLE (S10) = SPACES
037900         NEXT SENTENCE
038000     ELSE
038100     MOVE JOBPLAN-TABLE (S10) TO JOBPLAN-TABLE-2 (S9)
038200     MOVE RECORD-NUMBER (S10) TO RECORD-NUMBER-2 (S9)
038300     ADD 1 TO S9.
038500     SUBTRACT 1 FROM S10.
059700
       69-DELETE-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           DELETE JOBPLAN-BANK RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-JOBPLAN-BANK-PF.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK-PF INTO JOBPLAN-BUFFER
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBPFREC
               MOVE 15 TO COND-WORD.
           IF JBPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-JOBPLAN-BANK-PRIOR.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK PRIOR INTO JOBPLAN-BUFFER
               AT END    MOVE 14 TO COND-WORD.
           IF JOBPLAN-KEY NOT = GJOBPSEQ OF JBREC
               MOVE 14 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 14 TO COND-WORD.

       69-START-JOBPLAN-BANK.
           MOVE 0 TO COND-WORD.
           MOVE JOBP-N-S TO GJOBPSEQ OF JBREC.
           MOVE JOBP-LINE TO GJOBPLINE OF JBREC.
           START JOBPLAN-BANK KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TJMODSEQ" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

049700 999-CATREAD.
049800     MOVE SPACES TO MISC-BUFFER.
049900     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
050800 999-CATREAD-EXIT.    EXIT.
