000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TJOBPCLR.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS JF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  JOBPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS JFREC.
       01  JFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.
000900 WORKING-STORAGE SECTION.
       77  JP-REC-CTR          PIC 9(5).
       01  JF-STATUS           PIC XX.
005200 01  JOBPLAN-BUFFER.     COPY DJOBPLAN OF COPYLIB.
012500 COPY DBSTAT   OF COPYLIB.
015900 PROCEDURE DIVISION.
016200 START-PROGRAM.
016300     PERFORM 1-HSK.
016400     PERFORM 6-MAIN.
016500 2-EOJ.
           DISPLAY "RECORDS CLEARED = " JP-REC-CTR.
           CLOSE JOBPLAN-FILE.
016600     GOBACK.
016700 1-HSK.
           OPEN I-O   JOBPLAN-FILE.
           MOVE 0 TO JP-REC-CTR.
       6-MAIN.
           READ JOBPLAN-FILE NEXT INTO JOBPLAN-BUFFER
               AT END    GO TO 2-EOJ.
           IF JF-STATUS NOT = "00" GO TO 2-EOJ.
           MOVE "    " TO JOBP-LINE.
           REWRITE JFREC FROM JOBPLAN-BUFFER
               INVALID KEY    GO TO 2-EOJ.
           IF JF-STATUS NOT = "00" GO TO 2-EOJ.
           ADD 1 TO JP-REC-CTR.
           GO TO 6-MAIN.
