       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TLABUPDT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.

      *****************************************************************
      *****************************************************************
      ****                                                          ***
      ****  LABOR UPDATE SUBROUTINE TO WRITE SINGLE LABOR RECORD    ***
      ****  FOR EACH LABOR TRANSACTION.  USE OF THIS ROUTINE WILL   ***
      ****  NOT CONCATENATE LABOR RECORDS FOR ONE SHIFT.            ***
      ****                                                          ***
      *****************************************************************
      *****************************************************************.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-LABOR
                  ASSIGN       TO DATABASE-MCFLMM1301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PERS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  WO-LABOR
           LABEL RECORDS       ARE STANDARD.
       01  LABS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       WORKING-STORAGE SECTION.
       77  LABOR-HRS-WA        PIC S99V9.
       77  HOLD-CRAFT          PIC XXXX.
       77  TCOMP-MIN           PIC S9(4).
       77  TSAVE-MIN           PIC S9(4).
       77  TSTRT-MIN           PIC S9(4).
       77  FILE-STAT           PIC XX.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TLABUPDT".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA1 PIC X(30) VALUE
                   "UPDATES WORKORDER LABOR.  CALL".
               10  PROG-DESCA2 PIC X(30) VALUE
                   "ED BY ANY PROGRAM WHICH WRITES".
               10  PROG-DESCB1 PIC X(60) VALUE
                   "LABOR RECORDS TO A WORKORDER. ".
               10  PROG-FUNC   PIC X(60) VALUE
                   "         DO NOT APPLY PASSWORD".
           05  PASSWORD-FLAG   PIC X.

       01  SHIFT-DATA.
           05  ZONE-BUF        PIC X(04).
           05  TIME-IN.
               10  HRS-IN      PIC 99.
               10  MIN-IN      PIC 99.
           05  CODE-BUF        PIC X.
           05  SHIFTS.
               10  S-1         PIC 9999.
               10  E-1         PIC 9999.
               10  S-2         PIC 9999.
               10  E-2         PIC 9999.
               10  S-3         PIC 9999.
               10  E-3         PIC 9999.
               10  S-4         PIC 9999.
               10  E-4         PIC 9999.
           05  CURR-SHIFT      PIC 9.

       01  WO-LABOR-DATA.
           COPY DWOLABOR       IN COPYLIB.

       01  PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  LABOR-CURR-DATA.
           COPY DCURRLBR       IN COPYLIB.

       01  ZONE-LINK           PIC X(04).

       PROCEDURE DIVISION USING DBPARAMETERS
                                LABOR-CURR-DATA
                                ZONE-LINK.

       BEGIN.
           OPEN INPUT          PER-PERSONNEL.
           OPEN I-O            WO-LABOR.
           MOVE "X"            TO RETURN-BYTE.
           MOVE ZONE-LINK      TO ZONE-BUF.
           IF LCS-COMP-DATE-TIME < LCS-START-DATE-TIME
               MOVE LCS-START-DATE-TIME TO LCS-COMP-DATE-TIME.

           PERFORM WRITE-LABOR-RECORD THRU WLR-EXIT.

       END-OF-JOB.
           CLOSE               PER-PERSONNEL.
           CLOSE               WO-LABOR.
           MOVE HOLD-CRAFT     TO ZONE-LINK.
           GOBACK.

       WRITE-LABOR-RECORD.
           MULTIPLY 60 BY C-COMPL-HH GIVING TCOMP-MIN.
           ADD C-COMPL-MI      TO TCOMP-MIN.
           MULTIPLY 60 BY C-START-HH GIVING TSTRT-MIN.
           ADD C-START-MI      TO TSTRT-MIN.
           SUBTRACT TSTRT-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
           IF TSAVE-MIN < 0
               ADD 1440        TO TSAVE-MIN.
           DIVIDE 60 INTO TSAVE-MIN GIVING LABOR-HRS-WA ROUNDED.

           MOVE SPACES         TO PERS-DATA.
           MOVE EMP-NO         TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PERS-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE 30.0000 TO PER-LABOR-RATE.
           IF PER-CC-NUM NOT = EMP-NO
               MOVE 30.0000 TO PER-LABOR-RATE.

           MOVE PER-CRAFT      TO HOLD-CRAFT.
           MOVE SPACES         TO WO-LABOR-DATA.
           MOVE WO-NO-CLS      TO LBR-WO-NUM.
           MOVE EMP-NO         TO LBR-EMPL-NUM.
           MOVE PER-EMP-NAME   TO LBR-EMPL-NAME.
           MOVE PER-CRAFT      TO LBR-CRAFT.
           MOVE PER-SHIFT-CREW TO LABOR-CREW.
           MOVE LABOR-HRS-WA   TO LABOR-HRS.
           MULTIPLY LABOR-HRS  BY PER-LABOR-RATE GIVING LABOR-COST
                               ROUNDED.
           MOVE C-START-CC     TO LBR-START-DATE-CC.
           MOVE C-START-YY     TO LBR-START-DATE-YY.
           MOVE C-START-MM     TO LBR-START-DATE-MM.
           MOVE C-START-DD     TO LBR-START-DATE-DD.
           MOVE C-START-HH     TO LBR-START-TIME-HH.
           MOVE C-START-MI     TO LBR-START-TIME-MM.
           MOVE C-COMPL-CC     TO LBR-COMPL-DATE-CC LBR-DATE-CC.
           MOVE C-COMPL-YY     TO LBR-COMPL-DATE-YY LBR-DATE-YY.
           MOVE C-COMPL-MM     TO LBR-COMPL-DATE-MM LBR-DATE-MM.
           MOVE C-COMPL-DD     TO LBR-COMPL-DATE-DD LBR-DATE-DD.
           MOVE C-COMPL-HH     TO LBR-COMPL-TIME-HH.
           MOVE C-COMPL-MI     TO LBR-COMPL-TIME-MM.

           MOVE LBR-COMPL-TIME TO TIME-IN.
           CALL "TGETSHFT" USING SHIFT-DATA DBPARAMETERS.

           MOVE CURR-SHIFT     TO LBR-SHIFT-1.

           WRITE LABS-REC FROM WO-LABOR-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               DISPLAY "FAILED TO WRITE LABOR RECORD  " EMP-NO
                       "/" LBR-WO-NUM.

       WLR-EXIT.               EXIT.

