       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TLBRFILE.
       AUTHOR.                 W. FENSKE.
       INSTALLATION.           THE GOODYEAR TIRE & RUBBER COMPANY.
      ******************************************************************.
      *    THIS PROGRAM WILL CREATE A FILE THAT
      *    CONTAINS THE LABOR RECORDS BETWEEN TWO
      *    DATES SPECIFIED IN INFO PARAMETERS;
      *    INPUT PARAMETERS ARE:                                SIZE:
      *                 STARTING DATE AND TIME:  CCYYMMDDHHMN   X(12)
      *                   ENDING DATE AND TIME:  CCYYMMDDHHMN   X(12)
      *    THE NUMBER OF RECORDS TO BE PRINTED:  NNNNNN         9(06)
      *                            (BLANK DEFAULTS TO 999999)
      ******************************************************************.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          C01              IS NEW-PAGE
                               I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-LABOR
                  ASSIGN       TO DATABASE-MCFPMM1300
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS FILE-STAT.

           SELECT CHARPRT
                  ASSIGN       TO PRINTER-MCPRT.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-LBRFILE
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS OUT-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS       ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS       ARE STANDARD.
       01  PWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-LABOR
           LABEL RECORDS       ARE STANDARD.
       01  WL-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM1300.

       FD  CHARPRT
           RECORD CONTAINS     132 CHARACTERS
           LABEL RECORD        IS OMITTED
           DATA RECORD         IS CHARFI.
       01  CHARFI.
           02  CHAR-CC         PIC X.
           02  CHAR-RECORD     PIC X(131).

       FD  OUT-FILE
           RECORD CONTAINS     53 CHARACTERS
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS OUTFI.
       01  OUTFI.
           05  OUT-EMPL-NUM    PIC X(04).
           05  OUT-SHIFT       PIC X.
           05  OUT-STR-DATE    PIC X(06).
           05  OUT-STR-TIME    PIC X(04).
           05  OUT-END-DATE    PIC X(06).
           05  OUT-END-TIME    PIC X(04).
           05  OUT-LBR-HRS1    PIC XX.
           05  OUT-DECIMAL     PIC X.
           05  OUT-LBR-HRS2    PIC X.
           05  OUT-DEPT-CHRG   PIC X(04).
           05  OUT-WO-NUM      PIC X(10).
           05  OUT-EXP-CLASS   PIC X(08).
           05  FILLER          PIC XX.

       WORKING-STORAGE SECTION.
       77  ADV                 PIC 9999  VALUE 1.
       77  OUT-KEY             PIC 9999  VALUE 0.
       77  LINE-CTR            PIC 99 VALUE 0.
       77  RECORD-CTR          PIC 999999.
       77  RECORD-CTR-OUTSIDE  PIC 999999.
       77  RECORD-CTR-PARTIAL  PIC 999999.
       77  RECORD-CTR-INSIDE   PIC 999999.
       77  RECORD-CTR-BAD      PIC 999999.
       77  RECORD-CTR-IN-FILE  PIC 999999.
       77  MESSAGE-LINE        PIC X(82).
       77  D-PARM              PIC X.
       77  L-PARM              PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  CUR-DATE-CN.
           05  CD-CC           PIC 99.
           05  CURRENT-DATE.
               10  CD-YY       PIC 99.
               10  CD-MM       PIC 99.
               10  CD-DD       PIC 99.

       01  DEFAULT-DATE-BUF.
           05  DEF-STR-DATE-BUF.
               10  DEF-STR-DATE-BUF-CC PIC 99.
               10  DEF-STR-DATE-BUF-YY PIC 99.
               10  DEF-STR-DATE-BUF-MM PIC 99.
               10  DEF-STR-DATE-BUF-DD PIC 99.
           05  DEF-END-DATE-BUF.
               10  DEF-END-DATE-BUF-CC PIC 99.
               10  DEF-END-DATE-BUF-YY PIC 99.
               10  DEF-END-DATE-BUF-MM PIC 99.
               10  DEF-END-DATE-BUF-DD PIC 99.

       01  GREG-DATE.
           05  G-YEAR          PIC XXXX.
           05  G-MONTH         PIC XX.
           05  G-DAY           PIC XX.

       01  JUL-SIGN            PIC S9(06).
       01  JUL-DATE            PIC  X(07).
       01  JULIAN-DATE         REDEFINES JUL-DATE
                               PIC  9(07).
       01  FILLER              REDEFINES JUL-DATE.
           05  J-YEAR          PIC 9999.
           05  J-DAY           PIC 999.

       01  TIME-TEST-BUF.
           05  ACT-START-TIME-BUF.
               10  START-DATE-BUF      PIC 9(08).
               10  START-TIME-BUF      PIC 9(04).
           05  ACT-COMPL-TIME-BUF.
               10  COMPL-DATE-BUF      PIC 9(08).
               10  COMPL-TIME-BUF      PIC 9(04).

       01  DETAIL-LINE.
           05  FILLER          PIC X.
           05  D-EMPL-NUM      PIC X(4).
           05  FILLER          PIC XX.
           05  D-SHIFT         PIC X.
           05  FILLER          PIC XX.
           05  D-STR-DATE      PIC X(8).
           05  D-STR-TIME      PIC X(4).
           05  FILLER          PIC XX.
           05  D-END-DATE      PIC X(8).
           05  D-END-TIME      PIC X(4).
           05  FILLER          PIC XX.
           05  D-LBR-HRS1      PIC XX.
           05  D-DECIMAL       PIC X.
           05  D-LBR-HRS2      PIC X.
           05  FILLER          PIC XX.
           05  D-DEPT-CHRG     PIC X(4).
           05  FILLER          PIC XX.
           05  D-WO-NUM        PIC X(10).
           05  FILLER          PIC XX.
           05  D-EXP-CLASS     PIC X(8).
           05  FILLER          PIC XX.
           05  D-MESSAGE       PIC X(6).
           05  FILLER          PIC X(58).

       01  HEADER0.
           05  FILLER          PIC X(22) VALUE SPACES.
           05  FILLER          PIC X(24)
                               VALUE "LABOR FILE REVIEW REPORT".
           05  FILLER          PIC X(24)
                               VALUE "                 DATE:  ".
           05  CUR-DATE-BUFFER.
               10  CUR-DATE-MM PIC 99.
               10  FILLER      PIC X     VALUE "/".
               10  CUR-DATE-DD PIC 99.
               10  FILLER      PIC X     VALUE "/".
               10  CUR-DATE-YY PIC 99.
           05  FILLER          PIC X(54) VALUE SPACES.

       01  HEADER1.
           05  FILLER          PIC X(10) VALUE " CC#  SFT ".
           05  FILLER          PIC X(14) VALUE "START TIME    ".
           05  FILLER          PIC X(14) VALUE "COMPL TIME    ".
           05  FILLER          PIC X(10) VALUE " HRS  CHGE".
           05  FILLER          PIC X(12) VALUE "  WO NUMBER ".
           05  FILLER          PIC X(10) VALUE "  EXPENSE ".
           05  FILLER          PIC X(66) VALUE SPACES.

       01  HEADER2.
           05  FILLER          PIC X(10) VALUE SPACE.
           05  FILLER          PIC X(14) VALUE "CCYYMMDDHHMM  ".
           05  FILLER          PIC X(14) VALUE "CCYYMMDDHHMM  ".
           05  FILLER          PIC X(6)  VALUE SPACES.
           05  FILLER          PIC X(4)  VALUE "DEPT".
           05  FILLER          PIC X(12) VALUE SPACES.
           05  FILLER          PIC X(10) VALUE "  CLASS   ".
           05  FILLER          PIC X(66) VALUE SPACE.

       01  HEADER3.
           05  FILLER          PIC X     VALUE SPACE.
           05  FILLER          PIC X(82) VALUE ALL "-".

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  WO-LABOR-DATA.
           COPY DWOLABOR       IN COPYLIB.

       LINKAGE SECTION.
       01  INFO-DATA.
           05  STR-TIME-BUF.
               10  STR-TIME-BUF-CC PIC 99.
               10  STR-TIME-BUF-YY PIC 99.
               10  STR-TIME-BUF-MM PIC 99.
               10  STR-TIME-BUF-DD PIC 99.
               10  STR-TIME-BUF-HH PIC 99.
               10  STR-TIME-BUF-MN PIC 99.
           05  END-TIME-BUF.
               10  END-TIME-BUF-CC PIC 99.
               10  END-TIME-BUF-YY PIC 99.
               10  END-TIME-BUF-MM PIC 99.
               10  END-TIME-BUF-DD PIC 99.
               10  END-TIME-BUF-HH PIC 99.
               10  END-TIME-BUF-MN PIC 99.
           05  WRITE-SW            PIC 9(06).

       PROCEDURE DIVISION USING INFO-DATA.
       BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
           GO TO FINISH-REPORT.

       1-HSK.
           OPEN INPUT          WO-BASIC.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          WO-LABOR.
           OPEN OUTPUT         OUT-FILE.
           OPEN OUTPUT         CHARPRT.

           MOVE SPACES         TO MESSAGE-LINE.
           MOVE SPACES         TO DETAIL-LINE.
           MOVE  0             TO RECORD-CTR
                                  RECORD-CTR-OUTSIDE
                                  RECORD-CTR-PARTIAL
                                  RECORD-CTR-INSIDE
                                  RECORD-CTR-BAD
                                  RECORD-CTR-IN-FILE.

      *************************************************************
      * GET THE CURRENT-DATE.  THEN, SUBTRACT ONE DAY TO          *
      * GET DEF-END-DATE-BUF AND SUBTRACT ANOTHER DAY TO          *
      * GET DEF-STR-DATE-BUF.                                     *
      *************************************************************
           ACCEPT CURRENT-DATE FROM DATE.
           MOVE 20             TO CD-CC.
           IF CD-YY > 70
               MOVE 19         TO CD-CC.

           MOVE CD-YY          TO CUR-DATE-YY.
           MOVE CD-MM          TO CUR-DATE-MM.
           MOVE CD-DD          TO CUR-DATE-DD.

           MOVE CUR-DATE-CN    TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE J-DAY          TO JUL-SIGN.
           SUBTRACT 1          FROM JUL-SIGN.
           PERFORM UNTIL       JUL-SIGN > 0
               ADD 365         TO JUL-SIGN
               SUBTRACT 1      FROM J-YEAR
           END-PERFORM.
           MOVE JUL-SIGN       TO J-DAY.
           MOVE SPACES         TO GREG-DATE.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE GREG-DATE      TO DEF-END-DATE-BUF.

           MOVE J-DAY          TO JUL-SIGN.
           SUBTRACT 1          FROM JUL-SIGN.
           PERFORM UNTIL       JUL-SIGN > 0
               ADD 365         TO JUL-SIGN
               SUBTRACT 1      FROM J-YEAR
           END-PERFORM.
           MOVE JUL-SIGN       TO J-DAY.
           MOVE SPACES         TO GREG-DATE.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE GREG-DATE      TO DEF-STR-DATE-BUF.

           IF STR-TIME-BUF-CC = SPACES
               MOVE DEF-STR-DATE-BUF-CC TO STR-TIME-BUF-CC.

           IF END-TIME-BUF-CC = SPACES
               MOVE DEF-END-DATE-BUF-CC TO END-TIME-BUF-CC.

           IF STR-TIME-BUF-YY = SPACES
               MOVE DEF-STR-DATE-BUF-YY TO STR-TIME-BUF-YY.

           IF END-TIME-BUF-YY = SPACES
               MOVE DEF-END-DATE-BUF-YY TO END-TIME-BUF-YY.

           IF STR-TIME-BUF-MM = SPACES
               MOVE DEF-STR-DATE-BUF-MM TO STR-TIME-BUF-MM.

           IF END-TIME-BUF-MM = SPACES
               MOVE DEF-END-DATE-BUF-MM TO END-TIME-BUF-MM.

           IF STR-TIME-BUF-DD = SPACES
               MOVE DEF-STR-DATE-BUF-DD TO STR-TIME-BUF-DD.

           IF END-TIME-BUF-DD = SPACES
               MOVE DEF-END-DATE-BUF-DD TO END-TIME-BUF-DD.

           IF STR-TIME-BUF-HH = SPACES
               MOVE 23         TO STR-TIME-BUF-HH.

           IF END-TIME-BUF-HH = SPACES
               MOVE 23         TO END-TIME-BUF-HH.

           IF STR-TIME-BUF-MN = SPACES
               MOVE 00         TO STR-TIME-BUF-MN.

           IF END-TIME-BUF-MN = SPACES
               MOVE 00         TO END-TIME-BUF-MN.

           IF WRITE-SW = SPACES
               MOVE 999999     TO WRITE-SW.

           READ WO-LABOR       INTO WO-LABOR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               DISPLAY "PROGRAM:  TLBRFILE  (INITIAL READ)"
               DISPLAY "UNABLE TO READ WO-LABOR FILE."
                       "    FILE-STATUS = " FILE-STAT
               GO TO END-OF-JOB.

           ADD  1              TO RECORD-CTR.

           IF WRITE-SW > 0
               WRITE CHARFI    AFTER ADVANCING NEW-PAGE
               MOVE HEADER1    TO CHARFI
               WRITE CHARFI    AFTER ADVANCING 2 LINES
               MOVE HEADER2    TO CHARFI
               WRITE CHARFI    AFTER ADVANCING 1 LINES
               MOVE HEADER3    TO CHARFI
               WRITE CHARFI    AFTER ADVANCING 1 LINES
               MOVE 5          TO LINE-CTR.

       6-MAIN.
           MOVE LBR-START-DATE-CN TO START-DATE-BUF.
           MOVE LBR-START-TIME    TO START-TIME-BUF.
           MOVE LBR-COMPL-DATE-CN TO COMPL-DATE-BUF.
           MOVE LBR-COMPL-TIME    TO COMPL-TIME-BUF.

           IF ACT-START-TIME-BUF IS GREATER THAN ACT-COMPL-TIME-BUF
              ADD  1           TO RECORD-CTR-BAD
              GO TO 6-MAIN-CONTINUE.

           IF ACT-COMPL-TIME-BUF IS NOT GREATER THAN STR-TIME-BUF
              ADD  1           TO RECORD-CTR-OUTSIDE
              GO TO 6-MAIN-CONTINUE.

           IF ACT-START-TIME-BUF IS NOT LESS THAN END-TIME-BUF
              ADD  1           TO RECORD-CTR-OUTSIDE
              GO TO 6-MAIN-CONTINUE.

           IF STR-TIME-BUF IS NOT LESS THAN ACT-START-TIME-BUF
               IF END-TIME-BUF IS NOT GREATER THAN ACT-COMPL-TIME-BUF
                   ADD  1      TO RECORD-CTR-PARTIAL
                   MOVE "(I  I)" TO D-MESSAGE
                   PERFORM 61-PROCESS-RECORD
               ELSE
                   ADD  1      TO RECORD-CTR-PARTIAL
                   MOVE "(I )I " TO D-MESSAGE
                   PERFORM 61-PROCESS-RECORD
           ELSE
               IF END-TIME-BUF  IS NOT LESS THAN  ACT-START-TIME-BUF
                   ADD  1      TO RECORD-CTR-INSIDE
                   MOVE " I()I " TO D-MESSAGE
                   PERFORM 61-PROCESS-RECORD
               ELSE
                   ADD  1      TO RECORD-CTR-PARTIAL
                   MOVE " I( I)" TO D-MESSAGE
                   PERFORM 61-PROCESS-RECORD.

       6-MAIN-CONTINUE.
           READ WO-LABOR       INTO WO-LABOR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO 6-MAIN-EXIT
               ELSE
                   DISPLAY "PROGRAM:  TLBRFILE  (SEQUENTIAL READ)"
                   DISPLAY "     RECORD-CTR = " RECORD-CTR
                   DISPLAY "UNABLE TO READ WO-LABOR FILE."
                           "    FILE-STATUS = " FILE-STAT
                   GO TO END-OF-JOB.

           ADD  1              TO RECORD-CTR.
           GO TO 6-MAIN.

       6-MAIN-EXIT.   EXIT.

       61-PROCESS-RECORD.
           MOVE SPACES         TO OUTFI.
           MOVE LBR-EMPL-NUM   TO D-EMPL-NUM.
           MOVE LBR-EMPL-NUM   TO OUT-EMPL-NUM.
           MOVE LBR-SHIFT-1    TO D-SHIFT.
           MOVE LBR-SHIFT-1    TO OUT-SHIFT.
           MOVE LBR-START-DATE-CN TO D-STR-DATE.
           MOVE LBR-START-DATE TO OUT-STR-DATE.
           MOVE LBR-START-TIME TO D-STR-TIME.
           MOVE LBR-START-TIME TO OUT-STR-TIME.
           MOVE LBR-COMPL-DATE-CN TO D-END-DATE.
           MOVE LBR-COMPL-DATE TO OUT-END-DATE.
           MOVE LBR-COMPL-TIME TO D-END-TIME.
           MOVE LBR-COMPL-TIME TO OUT-END-TIME.
           MOVE LBR-HRS1-99    TO D-LBR-HRS1.
           MOVE LBR-HRS1-99    TO OUT-LBR-HRS1.
           MOVE "."            TO D-DECIMAL.
           MOVE "."            TO OUT-DECIMAL.
           MOVE LBR-HRS2-9     TO D-LBR-HRS2.
           MOVE LBR-HRS2-9     TO OUT-LBR-HRS2.
           PERFORM 6X1-GET-DEPT-CHRG-EXP-CLASS THRU 6X1-EXIT.
           MOVE LBR-WO-NUM     TO D-WO-NUM.
           MOVE LBR-WO-NUM     TO OUT-WO-NUM.
           PERFORM 6X2-WRITE-RECORD.

       6X1-GET-DEPT-CHRG-EXP-CLASS.
           MOVE LBR-WO-NUM     TO WONUM OF WO-BASIC
                                  WONUM OF WO-PLANNED.
           READ WO-BASIC       INTO WO-BASIC-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               GO TO CONT-PROC.

           READ WO-PLANNED     INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE DEPT-P     TO DEPT
               MOVE EXP-CLASS-P TO EXP-CLASS
               GO TO CONT-PROC.

       6X1-ERROR.
           MOVE SPACES         TO MESSAGE-LINE.
           STRING "    CHARGE DEPT ERROR IN RECORD:  NO "
                               RECORD-CTR
                  "   FOR WORK ORDER:  "
                               LBR-WO-NUM
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.
           STRING " RECORD IN MASTER FILE - FILE STAT = "
                               FILE-STAT
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.
           GO TO 6X1-EXIT.

       CONT-PROC.
           MOVE DEPT           TO  D-DEPT-CHRG
                                   OUT-DEPT-CHRG.
           MOVE EXP-CLASS      TO  D-EXP-CLASS
                                   OUT-EXP-CLASS.

       6X1-EXIT.               EXIT.

       6X2-WRITE-RECORD.
           IF RECORD-CTR-IN-FILE < WRITE-SW
               MOVE DETAIL-LINE TO CHARFI
               WRITE CHARFI    AFTER ADVANCING 1 LINES
               ADD 1           TO LINE-CTR
               IF LINE-CTR > 59
                   MOVE HEADER0 TO CHARFI
                   WRITE CHARFI AFTER ADVANCING NEW-PAGE
                   MOVE HEADER1 TO CHARFI
                   WRITE CHARFI AFTER ADVANCING 2 LINES
                   MOVE HEADER2 TO CHARFI
                   WRITE CHARFI AFTER ADVANCING 1 LINES
                   MOVE HEADER3 TO CHARFI
                   WRITE CHARFI AFTER ADVANCING 1 LINES
                   MOVE 5       TO LINE-CTR.

           ADD  1              TO OUT-KEY.
           WRITE OUTFI         INVALID KEY
               MOVE FILE-STAT  TO FILE-STAT.
           ADD  1              TO RECORD-CTR-IN-FILE.
           MOVE SPACES         TO DETAIL-LINE.

       FINISH-REPORT.
           MOVE SPACES         TO CHARFI.
           WRITE CHARFI        AFTER ADVANCING NEW-PAGE.
           MOVE HEADER0        TO CHARFI.
           WRITE CHARFI        AFTER ADVANCING 1 LINES.

           MOVE SPACES         TO MESSAGE-LINE.
           STRING "              START DATE AND TIME OF DATA:  "
                               STR-TIME-BUF
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           MOVE 4              TO ADV.
           PERFORM 8-WRITE-MESSAGE.

           STRING "                END DATE AND TIME OF DATA:  "
                               END-TIME-BUF
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING "             TOTAL NUMBER OF RECORDS READ:  "
                               RECORD-CTR
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING "          NUMBER OF RECORDS OUTSIDE RANGE:  "
                               RECORD-CTR-OUTSIDE
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING " NUMBER OF RECORDS PARTIALLY INSIDE RANGE:  "
                               RECORD-CTR-PARTIAL
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING "   NUMBER OF RECORDS TOTALLY WITHIN RANGE:  "
                               RECORD-CTR-INSIDE
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING " NUMBER OF RECORDS WITH STOP BEFORE START:  "
                               RECORD-CTR-BAD
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           STRING "                NUMBER OF RECORDS IN FILE:  "
                               RECORD-CTR-IN-FILE
                               DELIMITED BY SIZE
                               INTO MESSAGE-LINE.
           PERFORM 8-WRITE-MESSAGE.

           MOVE SPACES         TO CHARFI.
           WRITE CHARFI        AFTER ADVANCING NEW-PAGE.

       END-OF-JOB.
           CLOSE               WO-BASIC.
           CLOSE               WO-PLANNED.
           CLOSE               WO-LABOR.
           CLOSE               OUT-FILE.
           CLOSE               CHARPRT.
           GOBACK.

       8-WRITE-MESSAGE.
           MOVE MESSAGE-LINE   TO CHARFI.
           WRITE CHARFI        AFTER ADVANCING ADV LINES.
           MOVE SPACES         TO MESSAGE-LINE.
           ADD  1              TO LINE-CTR.
           MOVE 1              TO ADV.

