000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.      TLIFORP2.
000400 AUTHOR.          D A PLUM.
000500 DATE-WRITTEN.    DECEMBER 1989.
000600*INSTALLATION.    GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.         THIS PROGRAM WAS DEVELOPED TO REPLACE TLIFORPT
000900*                 TO MEET NEW AKRON LIFO REPORTING REQUIREMENTS.
001000*                 THIS CODE WAS COPIED FROM TLIFORPT AND MODIFIED
001100*                 TO FUFILL THESE REQUIREMENTS.
001200*
001300*                 THIS PROGRAM WILL READ THROUGH THE
001400*                 MATERIAL ACCUM DATA SET AND CREATE
001500*                 A REPORT SHOWING THE MOVEMENT OF EACH
001600*                 RAW MATERIAL CODE
001700*                 (CLASSES 100-199 AND 400-499)
001800*                 AND A SUMMARY FOR ALL OTHER STORESS
001900*                 CLASSES.
      *C
      *C   28FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   06DEC1994    DAVE PLUM
      *C     EXPANDED THE SIZE OF FIELD MCDLT-FILENAME FROM 8 TO
      *C     10 BYTES TO MATCH THE LENGTH OF PARAMETER EXPECTED BY
      *C     THE CL PROGRAM MCDLT.
      *C
      *C   05SEP1996    DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C     NOTE: THE AKRON-FILE AND AKRON-TEMP-FILE WERE NOT
      *C           REVISED TO PASS 8 CHARACTER DATES.  ULTIMATELY
      *C           THE AKRON-FILE IS SENT TO AKRON VIA RJE, AND THE
      *C           DEFINITION OF THIS FILE IS DETERMINED BY TOM
      *C           GEORGE'S SECTION.  THESE "AKRON" FILES SHOULD ONLY
      *C           BE REVISED BASED ON A REQUEST COMING FROM AKRON.
      *C
      *C   06JAN1999    JIM COFFMAN
      *C     ADDED A CHANGE FOR SPARTANBURG WHERE THEY HAVE A CLASS
      *C     190 ITEM FOR VINYL FILM AND IT'S UNIT OF MEASURE IS 'RL'
      *C     INSTEAD OF 'EA' OR 'LB'.
      *C
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.      HP-3000.
002400 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002600
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MACCOUNT-INFO-IK-O
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-CL-I
               ASSIGN TO DATABASE-MCFLCS4901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-PO-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEM-PO-I
               ASSIGN TO DATABASE-MCFLCS1201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT AKRON-FILE ASSIGN TO DISK-AKRNRAW2.

           SELECT AKRON-TEMP-FILE ASSIGN TO DISK-AKRNTEMP.
003300
003400 DATA DIVISION.
003500
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  MACCOUNT-INFO-IK-O
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-O.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MCLASS-CL-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-CL-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  DPORECD-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DRCVITEM-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-PO-REC-I.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.


      *------ FD STATEMENT AREA FOR IBM ONLY ------*
003700
003800 FD  ONLINE-PRT
003900     DATA RECORD IS PRT-REC
004000     RECORD CONTAINS 133 CHARACTERS
004100     LABEL RECORDS ARE OMITTED.
004200
004300 01  PRT-REC                       PIC X(133).
004400
004500 SD  SORT-FILE
004600     DATA RECORD IS SORT-REC
004700     RECORD CONTAINS 237 CHARACTERS.
004800
004900 01  SORT-REC.
005000     05  SORT-CLASS               PIC X(4).
005100     05  SORT-MATL-CODE           PIC X(8).
005200     05  SORT-DESCR.
005300         10  SORT-DESCR1          PIC X(20).
005400         10  SORT-DESCR2          PIC X(60).
005500     05  SORT-CONV                PIC S9(6)V9(4).
005600     05  SORT-UM                  PIC XX.
005700     05  SORT-ALT-UM              PIC XX.
005800     05  SORT-AVG-COST            PIC S9(6)V9(4).
005900     05  SORT-ISS-UNITS           PIC S9(10).
006000     05  SORT-ISS-DOLLARS         PIC S9(12)V99.
006100     05  SORT-SHIPMENT-UNITS      PIC S9(10).
006200     05  SORT-SHIPMENT-DOLLARS    PIC S9(12)V99.
006300     05  SORT-RTN-UNITS           PIC S9(10).
006400     05  SORT-RTN-DOLLARS         PIC S9(12)V99.
006500     05  SORT-RTNVAL-UNITS        PIC S9(10).
006600     05  SORT-RTNVAL-DOLLARS      PIC S9(12)V99.
006700     05  SORT-END-UNITS           PIC S9(10).
006800     05  SORT-END-DOLLARS         PIC S9(12)V99.
006900     05  SORT-CONS-IND            PIC X(1).
007000
007100
007200 FD  AKRON-FILE
007300     DATA RECORD IS AKRON-REC
007400     RECORD CONTAINS 80 CHARACTERS
007500     LABEL RECORDS ARE STANDARD.
007600
007700 01  AKRON-REC                     PIC X(80).
007800
007900 FD  AKRON-TEMP-FILE
008000     DATA RECORD IS AKRON-TEMP-REC
008100     RECORD CONTAINS 80 CHARACTERS
008200     LABEL RECORDS ARE STANDARD.
008300
008400 01  AKRON-TEMP-REC                PIC X(80).
008500
008600
008700 WORKING-STORAGE SECTION.
008800
008900 77  NO-MORE-SORT                  PIC XXX       VALUE SPACES.
009000 77  LINE-CNT                      PIC 99        VALUE 0.
009100 77  PAGE-CNT                      PIC 9(4)      VALUE 0.
009200 77  PREV-CLASS                    PIC X(4)      VALUE SPACES.
009300 77  IT-DEPT1                      PIC X(6)      VALUE SPACES.
009400 77  IT-DEPT2                      PIC X(6)      VALUE SPACES.
009500 77  USAGE-UNITS                   PIC S9(10)    VALUE 0.
009600 77  USAGE-DOLLARS                 PIC S9(12)V99 VALUE ZERO.
009700 77  ERR-FLAG                      PIC 9         VALUE ZERO.
009800 77  TOT-ERRS                      PIC 99        VALUE ZERO.
009900 77  SAVE-UNIT-COST                PIC S9(10)V9(4) VALUE ZEROS.
010000 77  SUB                           PIC S9(4) BINARY VALUE ZEROS.
010100 77  TABLE-LIMIT                   PIC S9(4) BINARY VALUE ZEROS.
010200 77  RECORD-CNT                    PIC S9(5)      VALUE +0.
010300 77  SAVE-UM                       PIC X(2)       VALUE SPACES.
010400 77  SAVE-PLT-CODE                 PIC X(3)       VALUE SPACES.
010500 77  EOF-SW                        PIC X(1)       VALUE "N".
       77  MCXCBLERR-SCOPE               PIC X(1)       VALUE "C".
010600
010700 01  MONTH-YEAR.
010800     05  MONTH-PARM                PIC 99        VALUE 0.
010900     05  YEAR-PARM                 PIC 99        VALUE 0.
011000
011100 01  CLASS-TOTALS.
011200     05  CLASS-USAGE-DOLLARS       PIC S9(12)V99  VALUE 0.
011300     05  CLASS-END-DOLLARS         PIC S9(12)V99  VALUE 0.
011400     05  CLASS-USAGE-UNITS         PIC S9(10)     VALUE 0.
011500     05  CLASS-END-UNITS           PIC S9(10)     VALUE 0.
011600
011700 01  ROUNDED-TOTALS.
011800     05  ROUNDED-END-DOLLARS       PIC S9(12)  VALUE 0.
011900     05  ROUNDED-USAGE-DOLLARS     PIC S9(12)  VALUE 0.
012000
012100 01  FINAL-TOTALS.
012200     05  TOT-USAGE-DOLLARS         PIC S9(12)  VALUE 0.
012300     05  TOT-USAGE-UNITS           PIC S9(10)  VALUE 0.
012400     05  TOT-END-UNITS             PIC S9(10)  VALUE 0.
012500     05  TOT-END-DOLLARS           PIC S9(12)  VALUE 0.
012600
012700 01  NON-CODED-TABLE.
012800     05  NC-ENTRIES OCCURS 500 TIMES.
012900         10  NC-CLASS              PIC X(3).
013000         10  NC-DCHG-UNITS         PIC S9(10).
013100         10  NC-DCHG-DLRS          PIC S9(12)V9(2).
013200         10  NC-INV-UNITS          PIC S9(10).
013300         10  NC-INV-DLRS           PIC S9(12)V9(2).
013400
       01  UNIT-TOTALS.
           05  TOT-UNIT-UNITS            PIC S9(15).
           05  TOT-UNIT-DOLLARS          PIC S9(15).

013500 COPY SOPNRAV IN COPYLIB.
013600
013700 01  MONTH-TABLE.
013800     05  FILLER                    PIC X(9) VALUE "JANUARY".
013900     05  FILLER                    PIC X(9) VALUE "FEBRUARY".
014000     05  FILLER                    PIC X(9) VALUE "MARCH".
014100     05  FILLER                    PIC X(9) VALUE "APRIL".
014200     05  FILLER                    PIC X(9) VALUE "MAY".
014300     05  FILLER                    PIC X(9) VALUE "JUNE".
014400     05  FILLER                    PIC X(9) VALUE "JULY".
014500     05  FILLER                    PIC X(9) VALUE "AUGUST".
014600     05  FILLER                    PIC X(9) VALUE "SEPTEMBER".
014700     05  FILLER                    PIC X(9) VALUE "OCTOBER".
014800     05  FILLER                    PIC X(9) VALUE "NOVEMBER".
014900     05  FILLER                    PIC X(9) VALUE "DECEMBER".
015000
015100 01  MONTH-TAB REDEFINES MONTH-TABLE.
015200     05  MONTH-T OCCURS 12 TIMES   PIC X(9).
015300
015400**************************************************************
015500* OUTPUT RECORD FOR AKRON FILE                               *
015600*    NOTE: ALL DATE FIELDS ARE IN YYMMDD FORMAT              *
015700*          ALL TIME FIELDS ARE IN HHMMSS FORMAT              *
      *                                                            *
      ****** 05SEP1996 WE WILL CONTINUE TO WORK WITH A 6 CHAR DATE *
      ******   UNTIL WE ARE ADVISED THAT THE AKRON FILE'S FORMAT   *
      ******   HAS BEEN CHANGED.                                   *
015800**************************************************************
015900
016000 01  WS-A-REC.
016100     05  WS-A-SYSTEM-CODE            PIC X(2)  VALUE "A ".
016200     05  WS-A-TRANS-CODE             PIC X(2)  VALUE SPACES.
016300     05  WS-A-DATA                   PIC X(76) VALUE SPACES.
016400
016500*** TC 10 - PLANT SUMMARY RECORD ***
016600     05  WS-A-TC10 REDEFINES WS-A-DATA.
016700         10 WS-A-TC10-RUN-DATE       PIC X(6).
016800         10 WS-A-TC10-RUN-TIME       PIC X(6).
016900         10 WS-A-TC10-PLT            PIC X(3).
017000         10 WS-A-TC10-ACCT-DATE.
                  15 WS-A-TC10-ACCT-YY     PIC X(2).
                  15 WS-A-TC10-ACCT-MM     PIC X(2).
                  15 WS-A-TC10-ACCT-DD     PIC X(2).
017100         10 WS-A-TC10-USAGE-UNITS    PIC S9(9).
017200         10 WS-A-TC10-USAGE-DOLLARS  PIC S9(11).
017300         10 WS-A-TC10-ENDING-UNITS   PIC S9(9).
017400         10 WS-A-TC10-ENDING-DOLLARS PIC S9(11).
017500         10   FILLER                 PIC X(10).
017600         10 WS-A-TC10-RECORD-COUNT   PIC S9(5).
017700
017800*** TC 20 - CLASS SUMMARY RECORD ***
017900     05  WS-A-TC20 REDEFINES WS-A-DATA.
018000         10 WS-A-TC20-CLASS          PIC X(3).
018100         10 WS-A-TC20-CLASS-DESC     PIC X(20).
018200         10 WS-A-TC20-USAGE-UNITS    PIC S9(9).
018300         10 WS-A-TC20-USAGE-DOLLARS  PIC S9(11).
018400         10 WS-A-TC20-ENDING-UNITS   PIC S9(9).
018500         10 WS-A-TC20-ENDING-DOLLARS PIC S9(11).
018600         10   FILLER                 PIC X(13).
018700
018800*** TC 30 AND TC 31 ARE PAIRED RECORDS.  A TC 30 RECORD AND A
018900*** TC 31 RECORD WILL BE WRITTEN TO THE OUTPUT FILE FOR EACH
019000*** RAW MATERIAL CODE
019100
019200*** TC 30 - RAW MATERIAL DETAIL RECORD #1 ***
019300     05  WS-A-TC30 REDEFINES WS-A-DATA.
019400         10 WS-A-TC30-CORP-CODE      PIC X(7).
019500         10 WS-A-TC30-DESC           PIC X(20).
019600         10 WS-A-TC30-CLASS          PIC X(3).
019700         10 WS-A-TC30-AVG-COST       PIC S9(9)V9(4).
019800         10 WS-A-TC30-UM             PIC X(2).
019900         10   FILLER                 PIC X(31).
020000
020100*** TC 31 - RAW MATERIAL DETAIL RECORD #2 (INVENTORY RECORD) ***
020200     05  WS-A-TC31 REDEFINES WS-A-DATA.
020300         10 WS-A-TC31-USAGE-UNITS    PIC S9(9).
020400         10 WS-A-TC31-USAGE-DOLLARS  PIC S9(11).
020500         10 WS-A-TC31-ENDING-UNITS   PIC S9(9).
020600         10 WS-A-TC31-ENDING-DOLLARS PIC S9(11).
020700         10 WS-A-TC31-UM             PIC X(2).
020800         10   FILLER                 PIC X(34).
020900
021000*** ZERO, ONE, OR MORE TC 33 RECORDS WILL BE WRITTEN TO THE
021100*** AKRON FILE FOR EACH RAW MATERIAL CODE FOLLOWING THE TC 30
021200*** AND TC 31 RECORDS.
021300
021400*** TC 33 - RAW MATERIAL RECEIVING DETAIL RECORD ***
021500     05  WS-A-TC33 REDEFINES WS-A-DATA.
021600         10 WS-A-TC33-RECD-DATE      PIC X(6).
021700         10 WS-A-TC33-RECD-TIME      PIC X(6).
021800         10 WS-A-TC33-PO-NUMBER      PIC X(6).
021900         10 WS-A-TC33-RLSE-NUMBER    PIC X(3).
022000         10 WS-A-TC33-REC-SLIP-NO    PIC X(5).
022100         10 WS-A-TC33-ITEM-NUMBER    PIC X(4).
022200         10 WS-A-TC33-RECD-QTY       PIC S9(9).
022300         10 WS-A-TC33-RECD-DOLLARS   PIC S9(11).
022400         10 WS-A-TC33-UM             PIC X(2).
022500         10 WS-A-TC33-VENDOR         PIC X(12).
022600         10 WS-A-TC33-LOT-NUMBER     PIC X(4).
022700         10   FILLER                 PIC X(8).
022800
022900 COPY TDATECHK IN COPYLIB.
023000
023100************************************************************
023200**     REPORT PRINT LINES                                 **
023300************************************************************
023400
023500 01  HEADER1.
023600     05  FILLER                     PIC X(49)
023700         VALUE "TLIFORP2".
023800     05  FILLER                     PIC X(69)
023900         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
024000     05  FILLER                     PIC X(5)   VALUE "DATE ".
024100     05  DATE-H1                    PIC X(8)   VALUE SPACES.
024200
024300 01  HEADER2.
024400     05  FILLER                     PIC X(6)   VALUE "PAGE".
024500     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
024600     05  FILLER                     PIC X(46)  VALUE SPACES.
024700     05  FILLER                     PIC X(62)
024800         VALUE "RAW MATERIAL REPORT".
024900     05  FILLER                     PIC X(5)   VALUE "TIME ".
025000     05  TIME-H2                    PIC X(8)   VALUE SPACES.
025100
025200 01  HEADER3.
025300     05  FILLER                     PIC X(56)  VALUE SPACES.
025400     05  MONTH-H3                   PIC X(9)   VALUE SPACES.
025500     05  FILLER                     PIC X(3)   VALUE SPACES.
025600     05  YEAR-H3A                   PIC X(2)   VALUE "20".
025700     05  YEAR-H3B                   PIC X(2)  VALUE SPACES.
025800
025900 01  HEADER3A.
026000     05  FILLER                     PIC X(62)  VALUE SPACES.
026100     05  FILLER                     PIC X(6)  VALUE "PLANT".
026200     05  PLANT-H3A                  PIC X(3)  VALUE SPACES.
026300     05  FILLER                     PIC X(62)  VALUE SPACES.
026400
026500 01  HEADER4.
026600     05  FILLER                     PIC X(55)  VALUE SPACES.
026700     05  FILLER                     PIC X(23)
026800         VALUE "AVG UNIT     USAGE".
026900     05  FILLER                     PIC X(55)
027000         VALUE "USAGE       END       END".
027100
027200 01  HEADER5.
027300     05  FILLER                     PIC X  VALUE SPACES.
027400     05  FILLER                     PIC X(58)
027500         VALUE "CODE         DESCRIPTION".
027600     05  FILLER                     PIC X(29)
027700         VALUE "COST     UNITS   DOLLARS".
027800     05  FILLER                     PIC X(45)
027900         VALUE "UNITS   DOLLARS   UM".
028000
028100 01  BLANK-LINE.
028200     05  FILLER                     PIC X(159) VALUE SPACES.
028300
028400 01  DETAIL-LINE1.
028500     05  PRT-CLASS                  PIC X(3)  VALUE SPACES.
028600     05  FILLER                     PIC X     VALUE SPACES.
028700     05  PRT-CORP-CODE              PIC X(8)  VALUE SPACES.
028800     05  FILLER                     PIC X     VALUE SPACES.
028900     05  PRT-CODE-DESC              PIC X(40) VALUE SPACES.
029000     05  FILLER                     PIC X     VALUE SPACES.
029100     05  PRT-AVG-COST               PIC ZZZ9.9999.
029200     05  PRT-AVG-COST-A REDEFINES PRT-AVG-COST
029300                                    PIC X(9).
029400     05  FILLER                     PIC X  VALUE SPACES.
029500     05  PRT-USAGE-UNITS            PIC Z(8)9-.
029600     05  PRT-USAGE-DLRS             PIC Z(8)9-.
029700     05  PRT-END-UNITS              PIC Z(8)9-.
029800     05  PRT-END-DLRS               PIC Z(8)9-.
029900     05  FILLER                     PIC X(2)  VALUE SPACES.
030000     05  PRT-UM                     PIC XX    VALUE SPACES.
030100     05  FILLER                     PIC X(1) VALUE SPACES.
030200     05  PRT-CONS-IND-LIT           PIC X(23) VALUE SPACES.
030300
030400 01  DETAIL-LINE2.
030500     05  FILLER                  PIC X(12) VALUE SPACES.
030600     05  PRT-TRANS-CODE          PIC X(4)  VALUE SPACES.
030700     05  FILLER                  PIC X(12) VALUE "  PO NUMBER ".
030800     05  PRT-PO-NO               PIC X(7)  VALUE SPACES.
030900     05  FILLER                  PIC X     VALUE "-".
031000     05  PRT-REL-NO              PIC X(3)  VALUE SPACES.
031100     05  FILLER                  PIC X     VALUE "-".
031200     05  PRT-RCVR-NO             PIC X(3)  VALUE SPACES.
031300     05  FILLER                  PIC X(11) VALUE "  QUANTITY ".
031400     05  PRT-REC-QTY             PIC Z(9)9 VALUE ZEROS.
031500     05  FILLER                  PIC X(8)  VALUE "  VALUE ".
031600     05  PRT-REC-VALUE           PIC Z(11)9 VALUE ZEROS.
031700     05  FILLER                  PIC X(5)  VALUE "  UM ".
031800     05  PRT-RCV-UM              PIC XX    VALUE SPACES.
031900
       01  DETAIL-LINE-3.
           05  FILLER                  PIC X(49)  VALUE SPACES.
           05  D3-UNIT-UNITS           PIC Z(14)9 VALUE ZEROS.
           05  FILLER                  PIC X(5)   VALUE SPACES.
           05  D3-UNIT-DOLLARS         PIC Z(14)9 VALUE ZEROS.
           05  FILLER                  PIC X(46)  VALUE SPACES.

       01  DETAIL-LINE-3U.
           05  FILLER                  PIC X(49) VALUE SPACES.
           05  FILLER                  PIC X(15) VALUE ALL "_".
           05  FILLER                  PIC X(5)  VALUE SPACES.
           05  FILLER                  PIC X(15) VALUE ALL "_".
           05  FILLER                  PIC X(46) VALUE SPACES.

032000 01  ERR-LINE                       PIC X(133)  VALUE SPACES.
032100
032200
032300************************************************************
032400**                                                        **
032500**           D A T A B A S E   B U F F E R S              **
032600**                                                        **
032700************************************************************
032800
032900*********************
033000**  MMATL-ACCUM    **
033100*********************
033200 COPY MATLACUM IN COPYLIB.
033300
033400******************
033500**    DTRANS    **
033600******************
033700 COPY DTRANS IN COPYLIB.
033800
033900*****************
034000*    MCLASS     *
034100*****************
034200 COPY MCLASS IN COPYLIB.
034300
034400*****************
034500*   MSTORERM    *
034600*****************
034700 COPY MSTORERM IN COPYLIB.
034800
034900****************
035000* MACCOUNT-INFO*
035100****************
035200 COPY MACTINFO IN COPYLIB.
035300
035400****************
035500* DPORECD      *
035600****************
035700 COPY DPORECD IN COPYLIB.
035800
035900****************
036000* DRCVITEM     *
036100****************
036200 COPY DRCVITEM IN COPYLIB.
036300
036400**********************************************************
036500*              D A T A    B A S E                        *
036600**********************************************************
036700
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

036800 COPY DBCSACCT IN COPYLIB.
036900
037000 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
037100 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
037200
037300 COPY DBMODES IN COPYLIB.
037400
037500 COPY DBSTAT IN COPYLIB.
037600
037700 01  DATASET-NAMES.
           05  DSET-NAME        PIC X(16)  VALUE SPACES.
037800     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
037900     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
038000     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
038100     05  DSET-MCLASS      PIC X(16)  VALUE "MCLASS;".
038200     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
038300     05  DSET-DPORECD     PIC X(16)  VALUE "DPORECD;".
038400     05  DSET-DRCVITEM    PIC X(16)  VALUE "DRCVITEM;".
038500
038600 01  ITEMS-LISTING.
038700     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
038800     05  MATL-KEY         PIC X(10)  VALUE "MATL-CODE;".
038900     05  PO-KEY           PIC X(10)  VALUE "PO-NUMBER;".
039000     05  CORP-KEY         PIC X(10)  VALUE "CORP-CODE;".
039100     05  PO-SEARCH        PIC X(10)  VALUE "PO-RCV-NO;".
039200
039300 01  IMAGE-ARGS.
039400     05  MMATL-CODE-ARG    PIC X(8)  VALUE SPACES.
039500     05  DEPT-KEY          PIC X(6)  VALUE SPACES.
039600     05  CLASS-ARG         PIC X(4)  VALUE SPACES.
039700     05  PO-ARG            PIC X(10) VALUE SPACES.
039800     05  MACCT-KEY         PIC X(4)  VALUE SPACES.
039900     05  BUILD-PO-NUM.
040000         10  FILLER        PIC X(1)  VALUE "P".
040100         10  BUILD-PO-NO   PIC X(7)  VALUE SPACES.
040200         10  BUILD-REL-NO  PIC X(3)  VALUE SPACES.
040300         10  BUILD-RCV-NO  PIC X(3)  VALUE SPACES.
040400
040500 COPY MULTLOCK IN COPYLIB.
040600
040700******************************************************
040800**   PARAMETERS FOR CALLING 'CDESC'
040900******************************************************
041000
041100 COPY CDESC IN COPYLIB.
041200
041300 01  RET-CODE                     PIC X(2)   VALUE SPACES.
041400
      *************************************************************
      * 23APR90 - REPLACED THE FOLLOWING WITH A COPYLIB MEMBER
      *           SINCE IT IS MACHINE DEPENDENT.
      *************************************************************
041500*01  COMMAND-AREA.
041600*    05  COMMAND-IMAGE.
041700*        10  COMMAND                 PIC X(81)  VALUE SPACES.
041800*        10  FILLER                  PIC X      VALUE %15.
041900*    05  COMMAND-ERROR               PIC S9(4)  COMP VALUE 0.
042000*    05  COMMAND-PARM                PIC 9(4)   COMP VALUE 0.
      *************************************************************
042100
       01  MCDLT-FILENAME                  PIC X(10) VALUE SPACES.

       COPY QCMDEXC IN COPYLIB.

042200*******************************************************
042300*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
042400*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
042500*   READ ERRORS).                                     *
042600*******************************************************
042700
042800 COPY TBLOWUP IN COPYLIB.
042900
043000******************************************
043100**   PARAMETERS FOR CALLING 'CBLOWSRT'
043200******************************************
043300
043400 COPY CBLOWSRT IN COPYLIB.
043500
       COPY CCRTFILE IN COPYLIB.
043600
043700 PROCEDURE DIVISION.
043800
043900 001-BEGIN SECTION.
044000
044100 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

044200*******************************************************
044300**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
044400**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
044500**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
044600**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
044700**   OCCURS
044800*******************************************************
044900
045000     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
045100                           ACCTG-BASE,
045200                           BU-PGM-NAME,
045300                           STATUS-AREA,
045400                           DUMMY-VIEW-AREA,
045500                           FILE-STATUS,
045600                           BU-DISPLAY-MSG,
045700                           BU-DISPLAY-FLDS.
045800
045900     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
046000                                     SORT-MATL-CODE
046100         INPUT PROCEDURE IS 050-PROCESS-TRANS
046200         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
046300
046400     PERFORM 1000-CLOSE-FILES.
046500     GOBACK.
046600
046700
046800 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
046900     PERFORM 100-BEGIN.
047000     PERFORM 200-PROCESS-DETAIL
047100         UNTIL END-OF-FILE.
047200
047300     PERFORM 250-PROCESS-DCHG.
047400
047500**********************************************************
047600*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
047700*  FOR SORTING OF RECORDS.                               *
047800**********************************************************
047900
048000     GO TO 699-PROCESS-EXIT.
048100
048200 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
050200
050300******************************************************
050400**   GET IT DEPTS. FROM MACCOUNT-INFO (KEY=IT)
050500******************************************************
050600     MOVE "IT"                    TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
051400     IF GOOD-CALL
051500         MOVE MACCT-IT-DEPT1      TO IT-DEPT1
051600         MOVE MACCT-IT-DEPT2      TO IT-DEPT2
051700     ELSE
051800         MOVE "GET MACCOUNT-INFO1 * 100-B" TO BU-DISPLAY-MSG
051900         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
052000         PERFORM 990-BLOWUP.
052100
      *------ RELEASE MACCOUNT-INFO RECORD LOCKED BY PREVIOUS READ
           PERFORM 9999-RESET-MACCOUNT-INFO-IK-O.

052200     MOVE SPACES                  TO SORT-REC.
           PERFORM 9999-INIT-MMATL-ACCUM-MC-I.
052300     PERFORM 400-GET-MMATL-ACCUM.
052400     MOVE SPACES                  TO  NON-CODED-TABLE,
052500                                      SOPNRAV-PARMS.
052600
052700
052800 200-PROCESS-DETAIL.
052900     IF MATL-STORES-CODE = "NON-STR"
053000         NEXT SENTENCE
053100     ELSE
053200         PERFORM 650-GET-MSTORERM
053300         IF NO-ENTRY
053400             NEXT SENTENCE
053500         ELSE
053600             PERFORM 600-BUILD-SORT-REC.
053700
053800     PERFORM 400-GET-MMATL-ACCUM.
053900
054000 250-PROCESS-DCHG.
054100     MOVE SPACES TO SORT-REC.
054200     MOVE ZEROS                   TO SORT-CONV,
054300                                     SORT-AVG-COST,
054400                                     SORT-ISS-UNITS,
054500                                     SORT-ISS-DOLLARS,
054600                                     SORT-SHIPMENT-UNITS,
054700                                     SORT-SHIPMENT-DOLLARS,
054800                                     SORT-RTN-UNITS,
054900                                     SORT-RTN-DOLLARS,
055000                                     SORT-RTNVAL-UNITS,
055100                                     SORT-RTNVAL-DOLLARS,
055200                                     SORT-END-UNITS,
055300                                     SORT-END-DOLLARS,
055400                                     TABLE-LIMIT.
055500     MOVE "NON-STR"               TO MMATL-CODE-ARG.
           PERFORM 9999-DBFIND-DTRANS-MC-I.
055800     IF NOT GOOD-CALL
055900         IF NO-ENTRY
056000             NEXT SENTENCE
056100         ELSE
056200             MOVE "FIND DTRANS * 250-PD" TO BU-DISPLAY-MSG
056300             PERFORM 990-BLOWUP
056400     ELSE
056500         PERFORM 400-GET-DTRANS
056600         PERFORM 300-PROCESS-DETAIL
056700             UNTIL END-OF-CHAIN
056800         MOVE ZEROS TO SUB
056900         PERFORM 375-RELEASE-DCHG-RCDS
057000             VARYING SUB FROM 1 BY 1
057100                 UNTIL SUB > TABLE-LIMIT.
057200
057300 300-PROCESS-DETAIL.
057400     IF TRANS-CODE = "INV"
057500         IF TRANS-DOCUMENT-NUM NOT = "PROC"
057600             PERFORM 310-UPDATE-DCHG-INV
057700         ELSE
057800             NEXT SENTENCE
057900     ELSE
058000     IF TRANS-CODE = "DCHG"
058100         IF TRANS-BALANCE-QTY = 0
058200             NEXT SENTENCE
058300         ELSE
058400             PERFORM 320-UPDATE-DCHG-REC
058500     ELSE
058600     IF TRANS-CODE = "FRT"
058700         IF TRANS-DOCUMENT-NUM NOT = "PROC"
058800             PERFORM 330-UPDATE-FRT.
058900
059000     PERFORM 400-GET-DTRANS.
059100
059200 310-UPDATE-DCHG-INV.
059300     MOVE ZEROS  TO SUB.
059400     PERFORM 350-FIND-TABLE-ENTRY.
059500     ADD TRANS-QTY                TO NC-INV-UNITS (SUB).
059600     ADD TRANS-VALUE              TO NC-INV-DLRS (SUB).
059700
059800 320-UPDATE-DCHG-REC.
059900     MOVE ZEROS  TO SUB.
060000     PERFORM 350-FIND-TABLE-ENTRY.
060100     COMPUTE SAVE-UNIT-COST ROUNDED =
060200         TRANS-VALUE / TRANS-QTY.
060300     ADD TRANS-BALANCE-QTY        TO NC-DCHG-UNITS (SUB).
060400     COMPUTE NC-DCHG-DLRS (SUB) ROUNDED =
060500         NC-DCHG-DLRS (SUB) +
060600             (TRANS-BALANCE-QTY * SAVE-UNIT-COST).
060700
060800 330-UPDATE-FRT.
060900     MOVE ZEROS  TO SUB.
061000     PERFORM 350-FIND-TABLE-ENTRY.
061100     ADD TRANS-VALUE              TO NC-INV-DLRS (SUB).
061200
061300 350-FIND-TABLE-ENTRY.
061400     ADD 1  TO SUB.
061500     IF SUB > 500
061600         MOVE "TABLE LIMIT EXCEEDED (500) *350-FTE"
061700             TO BU-DISPLAY-MSG
061800         PERFORM 990-BLOWUP.
061900     IF SUB > TABLE-LIMIT
062000         ADD 1   TO TABLE-LIMIT
062100         MOVE ZEROS  TO NC-DCHG-UNITS (SUB),
062200                        NC-DCHG-DLRS (SUB),
062300                        NC-INV-UNITS (SUB),
062400                        NC-INV-DLRS (SUB)
062500         MOVE TRANS-CLASS         TO NC-CLASS (SUB)
062600     ELSE
062700     IF TRANS-CLASS = NC-CLASS (SUB)
062800         NEXT SENTENCE
062900     ELSE
063000         GO TO 350-FIND-TABLE-ENTRY.
063100
063200 375-RELEASE-DCHG-RCDS.
063300     MOVE NC-CLASS (SUB)          TO SORT-CLASS.
063400     MOVE "NON-STR"               TO SORT-MATL-CODE.
063500     MOVE "Non-Storeroom Item"    TO SORT-DESCR.
063600     MOVE "EA"                    TO SORT-UM.
063700     MOVE NC-DCHG-UNITS (SUB)     TO SORT-END-UNITS.
063800     MOVE NC-DCHG-DLRS (SUB)      TO SORT-END-DOLLARS.
063900     MOVE NC-INV-UNITS (SUB)      TO SORT-ISS-UNITS.
064000     MOVE NC-INV-DLRS (SUB)       TO SORT-ISS-DOLLARS.
064100     RELEASE SORT-REC.
064200
064300 400-GET-MMATL-ACCUM.
           PERFORM 9999-DBGET2-MMATL-ACCUM-MC-I.
065100     IF GOOD-CALL
065200         NEXT SENTENCE
065300     ELSE
065400         IF END-OF-FILE
065500             NEXT SENTENCE
065600         ELSE
065700             MOVE "DBGET MMATL-ACCUM * 400-GMA" TO BU-DISPLAY-MSG
065800             PERFORM 990-BLOWUP.
065900
066000 400-GET-DTRANS.
           PERFORM 9999-DBGET5-DTRANS-MC-I.
066300     IF COND-WORD NOT = 0
066400         IF COND-WORD = 15
066500             NEXT SENTENCE
066600         ELSE
066700             MOVE "GET DTRANS *400-GD" TO BU-DISPLAY-MSG
066800             PERFORM 990-BLOWUP.
066900
067000 600-BUILD-SORT-REC.
067100********************************************************
067200**   CALL 'SOPNRAV' TO GETTING ANY DIRECT CHARGE
067300**   OPEN RECEIVERS AND ALL DIRECT CHARGE INVOICES
067400**   PAID FOR THE MONTH.  IT ALSO SUPPLIES STOREROOM
067500**   OPEN RECEIVERS AND STOREROOM OPEN INVOICES.
067600********************************************************
067700     MOVE MATL-STORES-CODE        TO SOPNRAV-MATL-CODE.
067800     CALL "SOPNRAV" USING ACCTG-BASE,
067900                          SOPNRAV-PARMS,
068000                          STATUS-AREA,
068100                          BU-DISPLAY-MSG,
068200                          BU-DISPLAY-FLDS.
068300     IF BU-DISPLAY-MSG NOT = SPACES
068400         PERFORM 990-BLOWUP.
068500     MOVE MATL-STORES-CODE        TO SORT-MATL-CODE.
068600     MOVE MATL-CLASS              TO SORT-CLASS.
068700     MOVE MATL-ISSUE-UNITS        TO SORT-ISS-UNITS.
068800     MOVE MATL-TOT-ISS-DOLLARS    TO SORT-ISS-DOLLARS.
068900
069000**********************************************************
069100**   ADD ANY DIRECT CHARGE INVOICES PAID THIS MONTH
069200**   WHICH IS CALCULATED BY CALLING 'SOPNRAV' ABOVE
069300**********************************************************
069400     ADD S-DIR-PAID-INV-UNITS     TO SORT-ISS-UNITS.
069500     ADD S-DIR-PAID-INV-DLRS      TO SORT-ISS-DOLLARS.
069600     MOVE MATL-RTN-UNITS          TO SORT-RTN-UNITS.
069700     MOVE MATL-RTN-DOLLARS        TO SORT-RTN-DOLLARS.
069800     MOVE MATL-RTNVAL-UNITS       TO SORT-RTNVAL-UNITS.
069900     MOVE MATL-RTNVAL-DOLLARS     TO SORT-RTNVAL-DOLLARS.
070000
070100**********************************************************
070200**   INCLUDE ANY DIRECT CHARGE OPEN RECEIVERS CALCULATED
070300**   BY CALLING 'SOPNRAV' INTO THE ENDING BALANCE
070400**   CALCULATIONS
070500**********************************************************
070600     COMPUTE SORT-END-UNITS =
070700         MATL-BEG-BAL-UNITS +
070800         MATL-RCPT-UNITS +
070900         MATL-ADJ-UNITS +
071000         MATL-RTN-UNITS +
071100         MATL-RTNVAL-UNITS +
071200         MATL-ACCTG-UNIT-CORR -
071300         MATL-ISSUE-UNITS +
071400         S-STR-OPEN-INV-UNITS +
071500         S-STR-OPEN-RCVR-UNITS +
071600         S-DIR-OPEN-RCVR-UNITS +
071700         MATL-INTRANSIT-UNITS.
071800
071900     COMPUTE SORT-END-DOLLARS =
072000         MATL-BEG-BAL-DOLLARS +
072100         MATL-INV-DOLLARS +
072200         MATL-TOT-ADJ-DOLLARS +
072300         MATL-RTN-DOLLARS +
072400         MATL-RTNVAL-DOLLARS +
072500         MATL-ACCTG-DOLLAR-CORR -
072600         MATL-TOT-ISS-DOLLARS +
072700         S-STR-OPEN-INV-DLRS +
072800         S-STR-OPEN-RCVR-DLRS +
072900         S-DIR-OPEN-RCVR-DLRS +
073000         MATL-INTRANSIT-DOLLARS.
073100
073200     IF (MATL-CLASS > 099 AND MATL-CLASS < 200) OR
073300        (MATL-CLASS > 399 AND MATL-CLASS < 500)
073400         MOVE 1                   TO CDESC-LINES-TO-GET
073500         MOVE "N"                 TO CDESC-LOCAL-DESC-OPTION
073600         CALL "CDESC" USING RET-CODE, STORES-BASE, STATUS-AREA,
073700             BU-DISPLAY-MSG, MMATL-CODE-ARG, CDESC-DATA
073800         MOVE CDESC (1)           TO SORT-DESCR
073900     ELSE
074000         MOVE SPACES              TO SORT-DESCR.
074100
074200     PERFORM 670-CALC-SHIPMENTS.
074300
074400     RELEASE SORT-REC.
074500
074600     MOVE SPACES                  TO SORT-REC.
074700
074800 650-GET-MSTORERM.
074900     MOVE MATL-STORES-CODE        TO MMATL-CODE-ARG.
           PERFORM 9999-DBGET7-MSTORERM-CD-I.
075700     IF GOOD-CALL
075800         MOVE STR-UM              TO SORT-UM
075900         MOVE STR-AVG-COST        TO SORT-AVG-COST
076000         MOVE STR-UM1-CF          TO SORT-CONV
076100         MOVE STR-UM1             TO SORT-ALT-UM
076200         MOVE STR-CONS-IND        TO SORT-CONS-IND
076300     ELSE
076400         IF NO-ENTRY
076500             NEXT SENTENCE
076600         ELSE
076700             MOVE "DBGET MSTORERM* 650-GM" TO BU-DISPLAY-MSG
076800             MOVE MMATL-CODE-ARG  TO BU-DISPLAY-FLD (1)
076900             PERFORM 990-BLOWUP.
077000
077100
077200 670-CALC-SHIPMENTS.
077300     MOVE MATL-STORES-CODE        TO MMATL-CODE-ARG.
077400     MOVE ZEROS                   TO SORT-SHIPMENT-UNITS,
077500                                     SORT-SHIPMENT-DOLLARS.
           PERFORM 9999-DBFIND-DTRANS-MC-I.
078200     IF GOOD-CALL
078300         PERFORM 675-GET-DTRANS
078400            UNTIL END-OF-CHAIN
078500     ELSE
078600         IF NO-ENTRY
078700              NEXT SENTENCE
078800         ELSE
078900              MOVE "DBFIND DTRANS * 670-CALC" TO BU-DISPLAY-MSG
079000              MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
079100              PERFORM 990-BLOWUP.
079200
079300 675-GET-DTRANS.
           PERFORM 9999-DBGET5-DTRANS-MC-I.
080100     IF GOOD-CALL
080200         PERFORM 680-ACCUMULATE
080300     ELSE
080400         IF END-OF-CHAIN
080500             NEXT SENTENCE
080600         ELSE
080700             MOVE "DBGET DTRANS * 675-GET" TO BU-DISPLAY-MSG
080800             MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
080900             PERFORM 990-BLOWUP.
081000
081100 680-ACCUMULATE.
081200     IF TRANS-CODE = "ISS"
081300         IF TRANS-DEPT = IT-DEPT1 OR IT-DEPT2
081400             ADD TRANS-QTY        TO SORT-SHIPMENT-UNITS
081500             ADD TRANS-VALUE      TO SORT-SHIPMENT-DOLLARS.
081600
081700 699-PROCESS-EXIT.
081800     EXIT.
081900
082000
082100 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
082200     DISPLAY "BEGIN REPORT".
082300     PERFORM 710-BEGIN-REPORT.
082400     PERFORM 720-PROCESS-CLASS
082500        UNTIL NO-MORE-SORT = "YES".
082600     PERFORM 725-END-REPORT.
082700     IF TOT-ERRS = 0
082800         PERFORM 780-UPDATE-LIFORPT-SW.
082900
083000**************************************************
083100**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
083200**  TO COMPLETE PROCESSING OF REPORT            **
083300**************************************************
083400
083500     GO TO 799-CREATE-EXIT.
083600
083700 710-BEGIN-REPORT.
      *----- BEFORE OPENING THE TEMP FILE AKRON-TEMP-FILE, IT MAY
      *----- NEED TO BE CREATED DEPENDING ON THE MACHINE WE ARE
      *----- RUNNING ON.  THEREFORE, WE PERFORM A MACHINE DEPENDENT
      *----- ROUTINE TO CREATE THIS FILE IF NEEDED.
           PERFORM 9999-CREATE-AKRNTEMP-FILE.

083800     OPEN OUTPUT ONLINE-PRT, AKRON-TEMP-FILE.
083900     RETURN SORT-FILE
084000        AT END
084100            MOVE "YES" TO NO-MORE-SORT.
084200     PERFORM 750-PRINT-HEADINGS.
084300
084400
084500 720-PROCESS-CLASS.
084600     PERFORM 721-BEGIN-CLASS.
084700     PERFORM 722-PROCESS-TRANS
084800         UNTIL SORT-CLASS NOT = PREV-CLASS
084900             OR NO-MORE-SORT = "YES".
085000     PERFORM 723-END-CLASS.
085100
085200 721-BEGIN-CLASS.
085300     MOVE SORT-CLASS              TO PREV-CLASS.
085400     MOVE 0                       TO CLASS-USAGE-DOLLARS
085500                                     CLASS-END-DOLLARS
085600                                     CLASS-USAGE-UNITS
085700                                     CLASS-END-UNITS.
085800
085900
086000 722-PROCESS-TRANS.
086100     MOVE SPACES                  TO WS-A-DATA.
086200     MOVE SORT-CLASS              TO PRT-CLASS,
086300                                     WS-A-TC30-CLASS.
086400     MOVE SORT-MATL-CODE          TO PRT-CORP-CODE,
086500                                     WS-A-TC30-CORP-CODE.
086600
086700     IF SORT-DESCR1 = "CODE                "
086800         MOVE SORT-DESCR2         TO PRT-CODE-DESC,
086900                                     WS-A-TC30-DESC
087000     ELSE
087100         MOVE SORT-DESCR          TO PRT-CODE-DESC,
087200                                     WS-A-TC30-DESC.
087300
087400     MOVE SORT-UM                 TO PRT-UM,
087500                                     WS-A-TC30-UM.
087600     MOVE SORT-AVG-COST           TO PRT-AVG-COST,
087700                                     WS-A-TC30-AVG-COST.
087800
087900     COMPUTE USAGE-UNITS = SORT-ISS-UNITS -
088000                           SORT-RTN-UNITS -
088100                           SORT-SHIPMENT-UNITS.
088200
088300     COMPUTE ROUNDED-USAGE-DOLLARS ROUNDED =
088400                           SORT-ISS-DOLLARS -
088500                           SORT-RTN-DOLLARS -
088600                           SORT-SHIPMENT-DOLLARS.
088700
088800     COMPUTE USAGE-DOLLARS = SORT-ISS-DOLLARS -
088900                             SORT-RTN-DOLLARS -
089000                             SORT-SHIPMENT-DOLLARS.
089100
089200     COMPUTE ROUNDED-END-DOLLARS ROUNDED =
089300                           SORT-END-DOLLARS * 1.
089400
089500     IF (SORT-CLASS > 099 AND SORT-CLASS < 200) OR
089600        (SORT-CLASS > 399 AND SORT-CLASS < 500)
089700       IF SORT-UM = "LB" OR "EA" OR "RL"
089800         NEXT SENTENCE
089900       ELSE
090000         IF SORT-ALT-UM NOT = SPACES
090100             IF SORT-CONV > 0
090200                 COMPUTE USAGE-UNITS ROUNDED = USAGE-UNITS
090300                                                   / SORT-CONV
090400                 COMPUTE SORT-END-UNITS ROUNDED =
090500                         SORT-END-UNITS / SORT-CONV
090600                 COMPUTE SORT-AVG-COST = SORT-AVG-COST *
090700                                         SORT-CONV
090800                 MOVE SORT-AVG-COST TO PRT-AVG-COST,
090900                                       WS-A-TC30-AVG-COST
091000                 MOVE SORT-ALT-UM   TO PRT-UM,
091100                                       WS-A-TC30-UM
091200             ELSE
091300                 MOVE 1 TO ERR-FLAG
091400                 MOVE "CONVERSION FACTOR FOR THIS CODE IS ZERO - P
091500-                    "LEASE CORRECT" TO ERR-LINE
091600          ELSE
091700              MOVE 1 TO ERR-FLAG
091800              MOVE "NO CONVERSION FACTOR IN CSIS FOR THIS CODE - P
091900-                 "LEASE CORRECT" TO ERR-LINE.
092000
092100**************************************************
092200**   IF USAGE UNITS AND DOLLARS ARE NEGATIVE THEN
092300**   SEND ZEROS
092400**************************************************
092500     IF USAGE-UNITS < 0 AND ROUNDED-USAGE-DOLLARS < 0
092600         MOVE ZEROS               TO USAGE-UNITS,
092700                                     ROUNDED-USAGE-DOLLARS.
092800
092900     MOVE USAGE-UNITS             TO PRT-USAGE-UNITS.
093000     MOVE ROUNDED-USAGE-DOLLARS   TO PRT-USAGE-DLRS.
093100
093200     IF SORT-CONS-IND NOT = SPACES
093300         MOVE ZEROS               TO SORT-END-UNITS,
093400                                     ROUNDED-END-DOLLARS
093500         MOVE "** CONSIGNMENT CODE **" TO PRT-CONS-IND-LIT
093600     ELSE
093700         MOVE SPACES              TO PRT-CONS-IND-LIT.
093800
093900     MOVE SORT-END-UNITS          TO PRT-END-UNITS.
094000     MOVE ROUNDED-END-DOLLARS     TO PRT-END-DLRS.
094100
094200     IF (SORT-CLASS > 099 AND SORT-CLASS < 200)  OR
094300        (SORT-CLASS > 399 AND SORT-CLASS < 500)
094400         IF USAGE-UNITS > 0 AND USAGE-DOLLARS = ZEROS
094500             MOVE 1             TO ERR-FLAG
094600             MOVE "NO COST HAS BEEN ASSIGNED TO USAGE UNITS - PLEA
094700-                 "SE CORRECT" TO ERR-LINE.
094800
094900     IF (SORT-CLASS > 099 AND SORT-CLASS < 200) OR
095000        (SORT-CLASS > 399 AND SORT-CLASS < 500)
095100       IF SORT-END-UNITS > 0
095200         IF ROUNDED-END-DOLLARS = ZEROS
095300             MOVE 1 TO ERR-FLAG
095400             MOVE "NO COST HAS BEEN ENTERED FOR THIS CODE - PLEASE
095500-                 " CORRECT" TO ERR-LINE.
095600
095700     IF (SORT-CLASS > 099 AND SORT-CLASS < 200) OR
095800        (SORT-CLASS > 399 AND SORT-CLASS < 500)
095900       IF SORT-END-UNITS = ZEROS  AND ROUNDED-END-DOLLARS < ZERO
096000         NEXT SENTENCE
096100       ELSE
096200         IF ROUNDED-END-DOLLARS < ZERO  OR SORT-END-UNITS < ZERO
096300           MOVE 1                   TO ERR-FLAG
096400           MOVE "ENDING CREDIT BALANCE CANNOT EXIST - PLEASE CORRE
096500-             "CT "                 TO ERR-LINE.
096600
096700     IF ERR-FLAG = 1
096800         MOVE ZERO                TO ERR-FLAG
096900         ADD 1                    TO TOT-ERRS
097000         IF (SORT-CLASS > 099 AND SORT-CLASS < 200) OR
097100            (SORT-CLASS > 399 AND SORT-CLASS < 500)
097200             WRITE PRT-REC FROM DETAIL-LINE1 AFTER 3
097300             WRITE PRT-REC FROM ERR-LINE     AFTER 1
097400             ADD 4 TO LINE-CNT
097500         ELSE
097600             NEXT SENTENCE
097700     ELSE
097800         IF (SORT-CLASS > 099 AND SORT-CLASS < 200) OR
097900            (SORT-CLASS > 399 AND SORT-CLASS < 500)
098000              WRITE PRT-REC FROM DETAIL-LINE1 AFTER 3
098100              ADD 3 TO LINE-CNT
098200              MOVE "30" TO WS-A-TRANS-CODE
098300              WRITE AKRON-TEMP-REC FROM WS-A-REC
098400              ADD +1 TO RECORD-CNT
098500              MOVE WS-A-TC30-UM     TO SAVE-UM
098600              MOVE "31"             TO WS-A-TRANS-CODE
098700              MOVE SPACES           TO WS-A-DATA
098800              MOVE USAGE-UNITS      TO WS-A-TC31-USAGE-UNITS
098900              MOVE ROUNDED-USAGE-DOLLARS
099000                                    TO WS-A-TC31-USAGE-DOLLARS
099100              MOVE SORT-END-UNITS   TO WS-A-TC31-ENDING-UNITS
099200              MOVE ROUNDED-END-DOLLARS
099300                                    TO WS-A-TC31-ENDING-DOLLARS
099400              MOVE SAVE-UM          TO WS-A-TC31-UM
099500              WRITE AKRON-TEMP-REC FROM WS-A-REC
099600              ADD +1 TO RECORD-CNT
099700              IF SORT-MATL-CODE = "NON-STR"
099800                  NEXT SENTENCE
099900              ELSE
100000                  PERFORM 726-PROCESS-REC-RCDS.
100100
100200     IF LINE-CNT > 55
100300         PERFORM 750-PRINT-HEADINGS.
100400
100500     ADD USAGE-UNITS              TO CLASS-USAGE-UNITS.
100600     ADD ROUNDED-USAGE-DOLLARS    TO CLASS-USAGE-DOLLARS.
100700     ADD SORT-END-UNITS           TO CLASS-END-UNITS.
100800     ADD ROUNDED-END-DOLLARS      TO CLASS-END-DOLLARS.
100900
101000     RETURN SORT-FILE
101100        AT END
101200             MOVE "YES"           TO NO-MORE-SORT.
101300
101400 723-END-CLASS.
101500     MOVE "20"                    TO WS-A-TRANS-CODE.
101600     MOVE SPACES                  TO WS-A-DATA.
101700     MOVE PREV-CLASS              TO PRT-CLASS,
101800                                     CLASS-ARG,
101900                                     WS-A-TC20-CLASS.
102000
           PERFORM 9999-DBGET7-MCLASS-CL-I.
102800     IF GOOD-CALL
102900         MOVE MCLASS-CLASS-DESCR  TO PRT-CODE-DESC,
103000                                     WS-A-TC20-CLASS-DESC
103100     ELSE
103200         IF NO-ENTRY
103300             MOVE "** INVALID CLASS **" TO PRT-CODE-DESC,
103400                                           WS-A-TC20-CLASS-DESC
103500         ELSE
103600             MOVE "DBGET MCLASS * 723-END" TO BU-DISPLAY-MSG
103700             MOVE CLASS-ARG TO BU-DISPLAY-FLD (1)
103800             PERFORM 990-BLOWUP.
103900
104000     MOVE CLASS-USAGE-UNITS   TO PRT-USAGE-UNITS,
104100                                 WS-A-TC20-USAGE-UNITS.
104200     MOVE CLASS-USAGE-DOLLARS TO PRT-USAGE-DLRS,
104300                                 WS-A-TC20-USAGE-DOLLARS.
104400     MOVE CLASS-END-UNITS     TO PRT-END-UNITS,
104500                                 WS-A-TC20-ENDING-UNITS.
104600     MOVE CLASS-END-DOLLARS   TO PRT-END-DLRS,
104700                                 WS-A-TC20-ENDING-DOLLARS.
104800
104900     MOVE SPACES              TO PRT-CORP-CODE,
105000                                 PRT-AVG-COST-A,
105100                                 PRT-UM,
105200                                 PRT-CONS-IND-LIT.
105300
105400     WRITE PRT-REC FROM DETAIL-LINE1 AFTER ADVANCING 3 LINES.
105500     WRITE AKRON-TEMP-REC FROM WS-A-REC.
105600     ADD +1 TO RECORD-CNT.
105700     PERFORM 750-PRINT-HEADINGS.
105800
105900     ADD CLASS-USAGE-UNITS   TO TOT-USAGE-UNITS.
106000     ADD CLASS-USAGE-DOLLARS TO TOT-USAGE-DOLLARS.
106100     ADD CLASS-END-UNITS     TO TOT-END-UNITS.
106200     ADD CLASS-END-DOLLARS   TO TOT-END-DOLLARS.
106300
106400 725-END-REPORT.
106500     MOVE "10"              TO WS-A-TRANS-CODE.
106600     MOVE SPACES            TO WS-A-DATA.
106700     MOVE "TOTAL"           TO PRT-CORP-CODE.
106800     MOVE SPACES            TO PRT-CLASS,
106900                               PRT-CODE-DESC,
107000                               PRT-AVG-COST-A,
107100                               PRT-UM,
107200                               PRT-CONS-IND-LIT.
107300
107400     MOVE 1 TO DATE-MODE.
107500     CALL "TDATECHK" USING DATE-CHECK-AREA.
      ****** 05SEP1996 WE WILL CONTINUE TO WORK WITH A 6 CHAR DATE *
      ******   UNTIL WE ARE ADVISED THAT THE AKRON FILE'S FORMAT   *
      ******   HAS BEEN CHANGED.                                   *
107600     MOVE DATE-YMD-OUT              TO WS-A-TC10-RUN-DATE.
107700     MOVE DATE-UNFORMATTED-TIME-OUT TO WS-A-TC10-RUN-TIME.
107800
107900     MOVE SAVE-PLT-CODE     TO WS-A-TC10-PLT.
108000
108100*** OBTAIN THE ACCT MONTH AND YEAR FROM MACCOUNT-INFO (KEY: MY)

      *** THE DAY PORTION OF THE YYMMDD DATE WILL BE SET TO "**" AS
      *** REQUESTED BY TOM GEORGE - 16FEB90 D.A. PLUM

108200     MOVE "MY" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
109000     IF GOOD-CALL
               MOVE MACCT-YEAR   TO WS-A-TC10-ACCT-YY
               MOVE MACCT-MONTH  TO WS-A-TC10-ACCT-MM
               MOVE "**"         TO WS-A-TC10-ACCT-DD
               DISPLAY "WS-A-TC10-ACCT-DATE = ", WS-A-TC10-ACCT-DATE
109200     ELSE
109300         MOVE "GET MACCOUNT-INFO * 725-END-REPORT"
109400             TO BU-DISPLAY-MSG
109500         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
109600         PERFORM 990-BLOWUP.
109700
      *------ RELEASE MACCOUNT-INFO RECORD LOCKED BY PREVIOUS READ
           PERFORM 9999-RESET-MACCOUNT-INFO-IK-O.

109800     MOVE TOT-USAGE-UNITS   TO PRT-USAGE-UNITS,
109900                               WS-A-TC10-USAGE-UNITS.
110000     MOVE TOT-USAGE-DOLLARS TO PRT-USAGE-DLRS,
110100                               WS-A-TC10-USAGE-DOLLARS.
110200     MOVE TOT-END-UNITS     TO PRT-END-UNITS,
110300                               WS-A-TC10-ENDING-UNITS.
110400     MOVE TOT-END-DOLLARS   TO PRT-END-DLRS,
110500                               WS-A-TC10-ENDING-DOLLARS.
110600
110700*** THE RECORD COUNTER ON THE TC 10 RECORD INCLUDES THE TC 10
110800*** RECORD ITSELF
110900     ADD +1 TO RECORD-CNT.
111000     MOVE RECORD-CNT         TO WS-A-TC10-RECORD-COUNT.
111100
111200     WRITE PRT-REC FROM DETAIL-LINE1 AFTER ADVANCING 3 LINES.
111300
111400**************************************************************
111500**   SINCE THE TOTAL RECORD TC '10' MUST BE THE FIRST RECORD
111600**   IN THE FILE WRITE THIS RECORD TO 'AKRON-FILE' AND
111700**   USE AKRON-TEMP-FILE WHICH IS A TEMPORARY FILE THAT
111800**   CONTAINS ALL THE OTHER PREVIOUS DETAIL RECORDS TO WRITE
111900**   OUT TO 'AKRON-FILE'.
112000**************************************************************
112100
112200     CLOSE AKRON-TEMP-FILE.
112300     OPEN INPUT AKRON-TEMP-FILE.
112400     OPEN OUTPUT AKRON-FILE.
112500     WRITE AKRON-REC FROM WS-A-REC.
112600     MOVE "N"    TO EOF-SW.
112700     READ AKRON-TEMP-FILE
112800         AT END MOVE "Y" TO EOF-SW.
112900     PERFORM 732-WRITE-AKRON-FILE
113000         UNTIL EOF-SW = "Y".
113100
113200     IF TOT-ERRS > 0
113300         MOVE "**********************************************"
113400               TO ERR-LINE
113500         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 8 LINES
113600         MOVE "*                                            *"
113700               TO ERR-LINE
113800         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES
113900         MOVE "*      ERRORS EXIST ON THIS LIFO REPORT      *"
114000              TO ERR-LINE
114100         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES
114200         MOVE "*                                            *"
114300              TO ERR-LINE
114400         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES
114500         MOVE "*       DO NOT SEND LIFO DATA TO AKRON       *"
114600              TO ERR-LINE
114700         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES
114800         MOVE "*                                            *"
114900              TO ERR-LINE
115000         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES
115100         MOVE "**********************************************"
115200              TO ERR-LINE
115300         WRITE PRT-REC FROM ERR-LINE AFTER ADVANCING 1 LINES.
115400
115500
115600 726-PROCESS-REC-RCDS.
           MOVE 0                       TO TOT-UNIT-UNITS,
                                           TOT-UNIT-DOLLARS.
115700     MOVE "33"                    TO WS-A-TRANS-CODE.
115800     MOVE SPACES                  TO WS-A-DATA.
115900     MOVE SORT-MATL-CODE          TO MMATL-CODE-ARG.
           PERFORM 9999-DBFIND-DTRANS-MC-I.
116600     IF GOOD-CALL
116700         PERFORM 727-GET-REC-RCDS
116800            UNTIL END-OF-CHAIN
               MOVE TOT-UNIT-UNITS      TO D3-UNIT-UNITS
               MOVE TOT-UNIT-DOLLARS    TO D3-UNIT-DOLLARS
               WRITE PRT-REC FROM DETAIL-LINE-3U AFTER 1
               WRITE PRT-REC FROM DETAIL-LINE-3  AFTER 1
               ADD 2                    TO LINE-CNT
               IF LINE-CNT > 55
                   PERFORM 750-PRINT-HEADINGS
               ELSE
               NEXT SENTENCE
116900     ELSE
117000         IF NO-ENTRY
117100              NEXT SENTENCE
117200         ELSE
117300              MOVE "DBFIND DTRANS * 726-PRR" TO BU-DISPLAY-MSG
117400              MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
117500              PERFORM 990-BLOWUP.
117600
117700 727-GET-REC-RCDS.
           PERFORM 9999-DBGET5-DTRANS-MC-I.
118500     IF GOOD-CALL
118600         IF TRANS-CODE = "REC" OR "DCHG"
118700             IF TRANS-DOCUMENT-NUM = "PROC"
118800                 NEXT SENTENCE
118900             ELSE
119000                 PERFORM 728-WRITE-REC-RCDS
119100         ELSE
119200             NEXT SENTENCE
119300     ELSE
119400         IF END-OF-CHAIN
119500             NEXT SENTENCE
119600         ELSE
119700             MOVE "DBGET DTRANS * 727-GRR" TO BU-DISPLAY-MSG
119800             MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
119900             PERFORM 990-BLOWUP.
120000
120100 728-WRITE-REC-RCDS.
120200     MOVE SPACES                  TO WS-A-DATA.
      ****** 05SEP1996 WE WILL CONTINUE TO WORK WITH A 6 CHAR DATE
      ******   UNTIL WE ARE ADVISED THAT THE AKRON FILE'S FORMAT
      ******   HAS BEEN CHANGED.
120300     MOVE TRANS-DATE              TO WS-A-TC33-RECD-DATE.
120400     MOVE TRANS-TIME              TO WS-A-TC33-RECD-TIME.
120500     MOVE TRANS-ORDER-NUM         TO WS-A-TC33-PO-NUMBER,
120600                                     BUILD-PO-NO,
120700                                     PRT-PO-NO.
120800     MOVE TRANS-RELEASE           TO WS-A-TC33-RLSE-NUMBER,
120900                                     BUILD-REL-NO,
121000                                     PRT-REL-NO.
121100     MOVE TRANS-RCVR-NUM          TO WS-A-TC33-REC-SLIP-NO,
121200                                     PRT-RCVR-NO.
121300     MOVE TRANS-ITEM-NUM          TO WS-A-TC33-ITEM-NUMBER.
121400
121500*****************************************************
121600**   IF STOREROOM UNIT OF MEASURE IS NOT EITHER
121700**   'LB' OR 'EA' THEN CONVERT THE RECEIVING
121800**   TRANSACTION TO 'LB' OR 'EA' BY USING THE
121900**   ALTERNATE UNIT OF MEASURE 1 WHICH IS EITHER
122000**   'LB' OR 'EA'.  A CHECK PREVIOUS TO THIS
122100**   MAKES SURE THE ALTERNATE UM 1 IS 'LB' OR 'EA'
122200*****************************************************
122300
122400     IF TRANS-UNIT-MEASURE = "LB" OR "EA" OR "RL"
122500         MOVE TRANS-QTY           TO WS-A-TC33-RECD-QTY
122600         MOVE TRANS-UNIT-MEASURE  TO WS-A-TC33-UM,
122700                                     PRT-RCV-UM
122800     ELSE
122900         COMPUTE WS-A-TC33-RECD-QTY ROUNDED =
123000             TRANS-QTY / SORT-CONV
123100         MOVE SORT-ALT-UM         TO WS-A-TC33-UM,
123200                                     PRT-RCV-UM.
           DISPLAY "CORPCODE  = " TRANS-STORES-CODE.
           DISPLAY "QTY       = " TRANS-QTY.
           DISPLAY "TRANSDATE = " TRANS-DATE-TIME.
123300     MOVE WS-A-TC33-RECD-QTY      TO PRT-REC-QTY.
           ADD WS-A-TC33-RECD-QTY       TO TOT-UNIT-UNITS.
123400
123500     MULTIPLY TRANS-VALUE BY 1 GIVING
123600         WS-A-TC33-RECD-DOLLARS ROUNDED.
123700     MOVE WS-A-TC33-RECD-DOLLARS  TO PRT-REC-VALUE.
           ADD WS-A-TC33-RECD-DOLLARS   TO TOT-UNIT-DOLLARS.
123800
123900     PERFORM 729-GET-DPORECD  THRU  729-GD-X.
124000
124100     PERFORM 730-GET-LOT-NUM.
124200
124300     WRITE AKRON-TEMP-REC FROM WS-A-REC.
124400     ADD 1   TO RECORD-CNT.
124500
124600     MOVE TRANS-CODE              TO PRT-TRANS-CODE.
124700     WRITE PRT-REC FROM DETAIL-LINE2 AFTER 1.
124800     ADD 1   TO LINE-CNT.
124900     IF LINE-CNT > 55
125000         PERFORM 750-PRINT-HEADINGS.
125100     MOVE ZEROS                   TO COND-WORD.
125200
125300 729-GET-DPORECD.
125400     MOVE "000"                   TO BUILD-RCV-NO.
           PERFORM 9999-DBFIND-DPORECD-PO-I.
126100     IF GOOD-CALL
126200         NEXT SENTENCE
126300     ELSE
126400         IF NO-ENTRY
126500             GO TO 729-GD-X
126600         ELSE
126700             MOVE "FIND DPORECD * 729-GD" TO BU-DISPLAY-MSG
126800             MOVE BUILD-PO-NUM  TO BU-DISPLAY-FLD (1)
126900             PERFORM 990-BLOWUP.
127000
127100***** 17JAN90 DAP - REVISED TO MOVE PO-VEN-CODE1-7 TO THE OUTPUT FILE
127200*****               RECORD RATHER THAN THE ENTIRE 10 BYTE FIELD
127300*****               PO-VEN-CODE.  THIS IS PER MIKE VALENTINE'S REQUEST.
127400
           PERFORM 9999-DBGET5-DPORECD-PO-I.
128200     IF GOOD-CALL
128300         MOVE PO-VEN-CODE1-7      TO WS-A-TC33-VENDOR
128400     ELSE
128500         IF END-OF-CHAIN
128600             NEXT SENTENCE
128700         ELSE
128800             MOVE "DBGET DPORECD * 729-GD" TO BU-DISPLAY-MSG
128900             MOVE BUILD-PO-NUM TO BU-DISPLAY-FLD (1)
129000             PERFORM 990-BLOWUP.
129100
129200 729-GD-X.
129300     EXIT.
129400
129500 730-GET-LOT-NUM.
129600     MOVE TRANS-RCVR-NUM          TO BUILD-RCV-NO.
           PERFORM 9999-DBFIND-DRCVITEM-PO-I.
130300     IF GOOD-CALL
130400         PERFORM 731-GET-DRCVITEM
130500            UNTIL END-OF-CHAIN
130600     ELSE
130700         IF NO-ENTRY
130800              NEXT SENTENCE
130900         ELSE
131000              MOVE "DBFIND DRCVITEM * 730-GLN" TO BU-DISPLAY-MSG
131100              MOVE BUILD-PO-NUM TO BU-DISPLAY-FLD (1)
131200              PERFORM 990-BLOWUP.
131300
131400 731-GET-DRCVITEM.
           PERFORM 9999-DBGET5-DRCVITEM-PO-I.
132200     IF GOOD-CALL
132300         IF TRANS-ITEM-NUM = RCV-ITEM-NUMBER
132400             MOVE RCV-LOT         TO WS-A-TC33-LOT-NUMBER
132500             MOVE 15              TO COND-WORD
132600         ELSE
132700             NEXT SENTENCE
132800     ELSE
132900         IF END-OF-CHAIN
133000             NEXT SENTENCE
133100         ELSE
133200             MOVE "DBGET DRCVITEM * 731-GD" TO BU-DISPLAY-MSG
133300             MOVE BUILD-PO-NUM TO BU-DISPLAY-FLD (1)
133400             PERFORM 990-BLOWUP.
133500
133600
133700 732-WRITE-AKRON-FILE.
133800     MOVE AKRON-TEMP-REC          TO AKRON-REC.
133900     WRITE AKRON-REC.
134000     READ AKRON-TEMP-FILE
134100         AT END MOVE "Y" TO EOF-SW.
134200
134300
134400 750-PRINT-HEADINGS.
134500     MOVE 1                       TO DATE-MODE.
134600     CALL "TDATECHK" USING DATE-CHECK-AREA.
134700     MOVE DATE-SLASH-OUT          TO DATE-H1.
134800     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
134900     MOVE "MY"                    TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
135700     IF GOOD-CALL
135800         NEXT SENTENCE
135900     ELSE
136000         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO
136100             BU-DISPLAY-MSG
136200         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
136300         PERFORM 990-BLOWUP.

      *------ RELEASE MACCOUNT-INFO RECORD LOCKED BY PREVIOUS READ
           PERFORM 9999-RESET-MACCOUNT-INFO-IK-O.

136400     MOVE MACCT-MONTH             TO MONTH-PARM.
136500     MOVE MACCT-YEAR              TO YEAR-PARM.
136600     MOVE MONTH-T (MONTH-PARM)    TO MONTH-H3.
136700     MOVE YEAR-PARM               TO YEAR-H3B.
136800     MOVE "PLT"                   TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
137600     IF GOOD-CALL
137700         NEXT SENTENCE
137800     ELSE
137900         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO
138000             BU-DISPLAY-MSG
138100         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
138200         PERFORM 990-BLOWUP.

      *------ RELEASE MACCOUNT-INFO RECORD LOCKED BY PREVIOUS READ
           PERFORM 9999-RESET-MACCOUNT-INFO-IK-O.

138300     MOVE MACCT-PLT-CODE          TO PLANT-H3A,
138400                                     SAVE-PLT-CODE.
138500     ADD 1                        TO PAGE-CNT.
138600     MOVE PAGE-CNT                TO PAGE-H2.
138700     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
138800     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
138900     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
139000     WRITE PRT-REC FROM HEADER3A AFTER ADVANCING 1.
139100     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
139200     WRITE PRT-REC FROM HEADER5 AFTER ADVANCING 2.
139300     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
139400     MOVE 8                       TO LINE-CNT.
139500
139600
139700*********************************************************
139800**                                                     **
139900**   THIS PROCEDURE UPDATES AN INDICATOR THAT STATES   **
140000**   THIS PROGRAM WAS EXECUTED SUCCESSFULLY.  THIS IS  **
140100**   PART OF THE MONTH-END PROCEDURE.  THE INDICATOR   **
140200**   IS LOCATED IN THE DATA SET 'MACCOUNT-INFO' UNDER  **
140300**   THE KEY 'MTED'                                    **
140400**                                                     **
140500*********************************************************
140600
140700 780-UPDATE-LIFORPT-SW.
140800     MOVE 1                       TO  NUMBER-OF-DSETS-LOCKED.
140900     MOVE DSET-MACCT              TO  DSET-NAME-1.
141000     MOVE "INFO-KEY;"             TO  ITEM-LIST-1.
141100     MOVE "MTED"                  TO  LOCK-VALUE-1.

           MOVE DSET-MACCT TO DSET-NAME.
           PERFORM 9930-LOCK.
141700
141800     MOVE "MTED" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
142600     IF GOOD-CALL
142700         NEXT SENTENCE
142800     ELSE
142900         MOVE "DBGET MACCT 'MTED'* 780-ULS" TO BU-DISPLAY-MSG
143000         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (2)
143100         PERFORM 990-BLOWUP.
143200
      *----- THE FOLLOWING DBUPDATE(REWRITE) COMMAND WILL UNLOCK
      *----- THE MACCOUNT-INFO RECORD WHICH WAS LOCKED BY THE READ
      *----- ABOVE

143300     MOVE "X"                     TO  MACCT-LIFORPT-SW.
           PERFORM 9999-DBUPDATE-MACCOUNT-INFO-O.
144000     IF GOOD-CALL
144100         NEXT SENTENCE
144200     ELSE
144300         MOVE "DBUPDATE MACCT * 780-ULS" TO BU-DISPLAY-MSG
144400         MOVE MACCT-KEY           TO BU-DISPLAY-FLD (2)
144500         PERFORM 990-BLOWUP.
144600
           PERFORM 9940-UNLOCK.
145600
145700
145800 799-CREATE-EXIT.
145900     EXIT.
146000
146100 900-ERROR SECTION.
146200
146300 990-BLOWUP.
146400
146500***************************************************************
146600**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
146700**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
146800**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
146900**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
147000**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
147100**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
147200**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
147300**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
147400**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
147500**   PROBLEM IS AVOIDED.                                     **
147600***************************************************************
147700
147800     MOVE "TLIFORP2"              TO  BU-PGM-NAME.
147900     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
148000                           ACCTG-BASE,
148100                           BU-PGM-NAME,
148200                           STATUS-AREA,
148300                           DUMMY-VIEW-AREA,
148400                           FILE-STATUS,
148500                           BU-DISPLAY-MSG,
148600                           BU-DISPLAY-FLDS.
148700
148800
148900
149000 1000-CLOSE-FILES.
149100     CLOSE ONLINE-PRT, AKRON-FILE, AKRON-TEMP-FILE.

      **************************************************************
      * 23APR90 - REPLACED THE FOLLOWING LOGIC IN ORDER TO INVOKE
      *           A MACHINE DEPENDENT ROUTINE
      **************************************************************
149200*    IF TOT-ERRS > 0
149300*        MOVE "PURGE AKRNRAW2" TO COMMAND
149400*        PERFORM 1010-CALL-INTRINSIC.
      **************************************************************

           IF TOT-ERRS > 0
               DISPLAY "TOT-ERRS IS GREATER THAN ZERO,"
               DISPLAY "FILE AKRNRAW2 WILL BE DELETED/PURGED."
               PERFORM 9999-DELETE-FILE.

           PERFORM 9999-CLOSE-STUFF.
151300
      **************************************************************
      * 23APR90 - REPLACED THE FOLLOWING LOGIC WITH THE MACHINE
      *           DEPENDENT ROUTINE 9999-DELETE-FILE FOUND IN THE
      *           COPYLIB MEMBER WLIFORP2.
      **************************************************************
151400*1010-CALL-INTRINSIC.
151500*    CALL INTRINSIC "COMMAND" USING COMMAND-IMAGE,
151600*            COMMAND-ERROR, COMMAND-PARM.
151700*    IF COMMAND-ERROR NOT = 0
151800*        MOVE "COMMAND INTRINSIC FAILED" TO BU-DISPLAY-MSG
151900*        MOVE COMMAND-ERROR TO BU-DISPLAY-FLD9 (1)
152000*        MOVE COMMAND-PARM TO BU-DISPLAY-FLD (1)
152100*        PERFORM 990-BLOWUP.
      **************************************************************

       9999-ROUTINES SECTION.

       9930-LOCK.

       9940-UNLOCK.

       9999-DBGET7-MACCOUNT-INFO-IK-O.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           READ MACCOUNT-INFO-IK-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-RESET-MACCOUNT-INFO-IK-O.
           MOVE HIGH-VALUES TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           START MACCOUNT-INFO-IK-O KEY > INFOKEY OF
              MACCOUNT-INFO-IK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBFIND-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY = MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF MATLCODE OF DTRANS-MC-REC-I NOT = MMATL-CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-DBGET2-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           READ MMATL-ACCUM-MC-I NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MMATL-ACCUM-MC-I.
           MOVE SPACES TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           START MMATL-ACCUM-MC-I KEY >= MATLCODE OF
             MMATL-ACCUM-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCLASS-CL-I.
           MOVE 0 TO COND-WORD.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-CL-REC-I.
           READ MCLASS-CL-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBFIND-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE BUILD-PO-NUM TO PORCVNO OF DPORECD-PO-REC-I.
           START DPORECD-PO-I KEY = PORCVNO OF DPORECD-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-I NOT = BUILD-PO-NUM
               MOVE 15 TO COND-WORD.

       9999-DBFIND-DRCVITEM-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE BUILD-PO-NUM TO PORCVNO OF DRCVITEM-PO-REC-I.
           START DRCVITEM-PO-I KEY = PORCVNO OF DRCVITEM-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DRCVITEM-PO-I.
           MOVE 0 TO COND-WORD.
           READ DRCVITEM-PO-I NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF PORCVNO OF DRCVITEM-PO-REC-I NOT = BUILD-PO-NUM
               MOVE 15 TO COND-WORD.

       9999-DBUPDATE-MACCOUNT-INFO-O.
           MOVE 0 TO COND-WORD.
           REWRITE MACCOUNT-INFO-IK-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN I-O   MACCOUNT-INFO-IK-O   .
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MCLASS-CL-I          .
           OPEN INPUT DPORECD-PO-I         .
           OPEN INPUT DRCVITEM-PO-I        .

       9999-CLOSE-STUFF.
           CLOSE      MACCOUNT-INFO-IK-O   .
           CLOSE      DTRANS-MC-I          .
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MCLASS-CL-I          .
           CLOSE      DPORECD-PO-I         .
           CLOSE      DRCVITEM-PO-I        .

       9999-CREATE-AKRNTEMP-FILE.
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES     TO CCRTFILE-PARMS.
           MOVE "QTEMP"    TO CCRTFILE-LIBRARY.
           MOVE "AKRNTEMP" TO CCRTFILE-FILE.
           MOVE "0080"     TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"    TO CCRTFILE-NO-RECORDS.
           MOVE "01000"    TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"       TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF AKRNTEMP FAILED"
                 TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP.

       9999-DELETE-FILE.
      *----- MACHINE DEPENDENT LOGIC USED TO DELETE/PURGE FILE
      *----- AKRNRAW2 IF ERRORS ARE FOUND IN THE DATA
           MOVE "AKRNRAW2  " TO MCDLT-FILENAME.
           CALL "MCDLT" USING MCDLT-FILENAME.

