       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TLOADVAL.
       AUTHOR.        MARVIN MITCHELL.
       INSTALLATION.  THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
       DATE-WRITTEN.  JANUARY 1993.
      *REMARKS.       VALIDATION CODE LOADING PROGRAM.

      *D         This program loads the MVALIDTYPE (MCFPCS5100) and the
      *D    DVALIDDATA (MCFPCS5200) datasets from a SEQUENTIAL file.
      *D         The program DELETES all DETAIL records from the DVALID-
      *D    DATA dataset with a TYPE CODE equal to the incoming type (if
      *D    any exist), DELETES the MASTER recors from the MVALIDTYPE
      *D    dataset.
      *D         It then inserts a new MASTER record before inserting
      *D    the new DETAIL records read from the SEQUENTIAL file.
      *D
      *D    TO EXECUTE THIS PROGRAM ON THE AS/400:
      *D         TLOADVAL uses the input file MCFPCSEECC for all input
      *D    data.  The file is seperated into four members:
      *D      COUNTRYCDE -- contains all EEC Country codes;
      *D      DELVRYTERM -- contains all EEC Delivery Terms codes;
      *D      MODEOFTRAN -- contains all EEC Mode Of Transport codes;
      *D      NATOFTRANS -- contains the EEC Nature Of Transaction codes.
      *D
      *D         Use the following OVRDBF (override database file)
      *D    command to point to the member which holds the updated
      *D    code information:
      *D
      *D           OVRDBF FILE(MCFPCSEECC) MBR(member name)
      *D
      *D    Then use the following statement to load the database:
      *D
      *D           CALL TLOADVAL
      *D
      *D    The OVRDBF command must be changed to point to a different
      *D    member if you wish to update other codes.
      *D
      *D    IF THE OVRDBF COMMAND IS NOT USED,
      *D    TLOADVAL will tranverse the entire sequential and update
      *D    the DVALIDDATA dataset with codes for the first type
      *D    code read into the program, regardless of the type of
      *D    information found in the sequential file.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT VALID-INFILE
               ASSIGN TO DATABASE-MCFPCSEECC
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT MVALID-FILE
               ASSIGN TO DATABASE-MCFLCS5101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVALID-FILE
               ASSIGN TO DATABASE-MCFLCS5201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  VALID-INFILE.
       01  VALID-REC.
           05  IN-VALID-TYPE-CODE      PIC X(6).
           05  IN-VALID-DESC.
               10  IN-VALID-DESC-30    PIC X(30).
               10    FILLER            PIC X(20).
           05  IN-VALID-ERROR-NO       PIC X(6).
           05    FILLER                PIC X(18).

       FD  MVALID-FILE
           LABEL RECORDS ARE STANDARD.
       01  TYPE-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5101.

       FD  DVALID-FILE
           LABEL RECORDS ARE STANDARD.
       01  DATA-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS5201.

       WORKING-STORAGE SECTION.

       COPY DVLDDATA OF COPYLIB.
       COPY MVLDTYPE OF COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X     VALUE "0".
           05  FILE-STATUS-2             PIC X     VALUE "0".

       01  SAVE-KEY.
           05  SAVE-TYPE                 PIC X(6)  VALUE SPACES.
           05  SAVE-CODE                 PIC X(6)  VALUE SPACES.

       01  SEARCH-ITEM                   PIC X(16)
                                            VALUE "VALID-CODE-TYPE;".

       01  SWITCHES.
           05  DEL-DETAIL-SW             PIC X     VALUE "Y".
           05  DEL-MASTER-SW             PIC X     VALUE "Y".
           05  INSERT-SW                 PIC X     VALUE "Y".
           05  INVALID-SW                PIC X     VALUE "N".

      *COPY LANGSUB     OF COPYCSIS.

      *COPY DBSTAT      OF COPYCSIS.

      *COPY VCOMLINK    OF COPYCSIS.

       PROCEDURE DIVISION.

       0-INSTRUCTIONS.
           PERFORM 1-HOUSEKEEPING THRU 1-EXIT.
           PERFORM 6-MAIN         THRU 6-EXIT
           PERFORM 2-END-OF-JOB   THRU 2-EXIT.

       1-HOUSEKEEPING.
           OPEN INPUT VALID-INFILE.
           OPEN I-O   MVALID-FILE, DVALID-FILE.

           MOVE LOW-VALUES   TO VALID-REC.

           PERFORM 30-READ-VALID THRU 30-EXIT.
           IF VALID-REC = HIGH-VALUES
             DISPLAY "   *** READ LOADFILE ERROR ***"
             DISPLAY "END-OF-FILE CONDITION ON FIRST READ"
             DISPLAY "CHECK TO SEE IF YOUR FILE IS EMPTY"
             GO TO 2-END-OF-JOB.

       1-EXIT.
           EXIT.

       2-END-OF-JOB.
           CLOSE VALID-INFILE,
                 MVALID-FILE,
                 DVALID-FILE.
           GOBACK.

       2-EXIT.
           EXIT.

       30-READ-VALID.
           READ VALID-INFILE
             AT END
               MOVE HIGH-VALUES TO VALID-REC.

       30-EXIT.
           EXIT.

       31-READ-MVALIDTYPE.
           READ MVALID-FILE
             INVALID KEY
               MOVE "Y" TO INVALID-SW.

       31-EXIT.
           EXIT.

       32-READ-DVALIDDATA.
           READ DVALID-FILE
             INVALID KEY
               MOVE "Y" TO INVALID-SW.

       32-EXIT.
           EXIT.

       6-MAIN.
           MOVE IN-VALID-TYPE-CODE TO SAVE-TYPE,
                                      VLDCODETYP OF TYPE-REC,
                                      VLDCODETYP OF DATA-REC.

      *****  Check for an existing MASTER record.
      *****  If no record exists, move NO to DELETE-MASTER
      *****  records switch to bypass delete processing.
           START MVALID-FILE
             KEY IS EQUAL TO VLDCODETYP OF TYPE-REC
               INVALID KEY
                 DISPLAY "NO MVALID RECORD FOUND"
                 DISPLAY "PRECEEDING WITHOUT DELETING MAVLID RECORDS."
               MOVE "N" TO DEL-MASTER-SW.

      *****  Search for detail records with the same TYPE
      *****  CODE as the MASTER record.  If non exist, move
      *****  NO to DELETE-DETAIL records switch to bypass
      *****  delete processing.
           START DVALID-FILE
             KEY IS EQUAL TO VLDCODETYP OF DATA-REC
               INVALID KEY
                 DISPLAY "NO RECORD FOUND TO MATCH TYPE"
                 DISPLAY
                     "PROCEDING WITHOUT DELETEING RECORDS FROM DVALID"
                 MOVE "N" TO DEL-DETAIL-SW.

           IF DEL-DETAIL-SW = "Y"
             PERFORM 32-READ-DVALIDDATA THRU 32-EXIT
             MOVE "N" TO INVALID-SW
             PERFORM 60-DELETE-DETAIL THRU 60-EXIT
                 UNTIL DEL-DETAIL-SW = "N".

           PERFORM 61-PROCESS-MASTER THRU 61-EXIT.

           PERFORM 30-READ-VALID THRU 30-EXIT.
           IF VALID-REC = HIGH-VALUES
             DISPLAY "READ VALID-INFIILE ERROR"
             DISPLAY "END-OF-FILE CONDITION ON SECOND READ"
             GO TO 2-END-OF-JOB.

           PERFORM 62-INSERT-DETAIL THRU 62-EXIT
               UNTIL INSERT-SW = "N".

       6-EXIT.
           EXIT.

       60-DELETE-DETAIL.
           DELETE DVALID-FILE
               INVALID KEY
                 DISPLAY "DELETE DVALID ERROR 60-"
                 DISPLAY "INVALID KEY".

           PERFORM 32-READ-DVALIDDATA THRU 32-EXIT.
           IF INVALID-SW = "Y"
             MOVE "N" TO DEL-DETAIL-SW.

       60-EXIT.
           EXIT.

       61-PROCESS-MASTER.
           IF DEL-MASTER-SW = "Y"
      *****  If an old MASTER record exists, it will be deleted here.
             DELETE MVALID-FILE
                 INVALID KEY
                   DISPLAY "DELETE MVALID ERROR 61-"
                   DISPLAY "INVALID KEY".

           MOVE SPACES             TO BUF-MVALIDTYPE.
           MOVE IN-VALID-TYPE-CODE TO VALID-TYPE-CODE.
           MOVE IN-VALID-DESC      TO VALID-TYPE-DESC.
           MOVE IN-VALID-ERROR-NO  TO VALID-TYPE-ERR-NO.

      *****  The new MASTER record is added to the dataset here.
           WRITE TYPE-REC FROM BUF-MVALIDTYPE.

       61-EXIT.
           EXIT.

       62-INSERT-DETAIL.
           MOVE IN-VALID-TYPE-CODE TO SAVE-CODE.
           MOVE SAVE-TYPE          TO VALID-CODE-TYPE.
           MOVE SAVE-KEY           TO VALID-CODE-KEY.
           MOVE IN-VALID-DESC-30   TO VALID-CODE-DESC.

           WRITE DATA-REC FROM BUF-DVALIDDATA.

           PERFORM 30-READ-VALID THRU 30-EXIT.
           IF VALID-REC = HIGH-VALUES
             MOVE "N" TO INSERT-SW.

       62-EXIT.
           EXIT.
