       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TLOADPO.
       AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
       DATE-COMPILED.
      ***------------------------------------------------------------***
      ***  >>>>>>>>>>  P O R T A B L E    P R O G R A M  <<<<<<<<<<  ***
      ***------------------------------------------------------------***
      ************************************************************
      **                                                        **
      **       L O A D P O   F O R   A L L   P L A N T S        **
      **                                                        **
      *D   THIS PROGRAM IS FOR ADDING, MODIFING, AND DELETING   **
      *D   PURCHASE ORDERS IN BATCH MODE FROM AN INPUT FILE.    **
      *D   THE DATA COMES FROM CORPORATE PURCHASING IN EITHER   **
      *D   AKRON, CANADA (TORONTO), OR CUMBERLAND (KELLY).      **
      **                                                        **
      ************************************************************


      ***------------------------------------------------------------***
      *------- NOTE: FOR A PROCESSING OUTLINE OF THIS PROGRAM,
      *------- SORTED LIST OF ERROR MESSAGES, MISC INFORMATION, AND
      *------- PROGRAM CHANGES PREVIOUS TO THE RELEASE SYSTEM, REFER
      *------- TO THE PROGRAM DOCUMENATION FILE 'PLOADPO.DOC.CME'
      ***------------------------------------------------------------***


      *****************************************************************
      **            M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *
      *
      ***------------------------------------------------------------***
      *C  MARCH 19, 1993     CR KALMAN
      *C  AKRON WAS DESIGNATING INVOICELESS PO'S FOR IT'S OWN AKRON RCV'G
      *C  BUT IT ENDED UP SENDING ONE OF THESE PO'S TO ANOTHER PLANT.
      *C  THIS PROGRAM WAS LOADING A "Y" INTO THE INVOICELESS IND FIELD
      *C  FOR THE PO. I CHANGED IT TO LOAD AN "X". THE PLANT ALSO NEEDS
      *C  TO DESIGNATE THE VENDOR AS INVOICELESS IF THEY WANT THE
      *C  PAYMENT TO BE AUTOMATICALLY GENERATED BY TINGEN.
      ***------------------------------------------------------------***
      *C  SEPT. 12, 1994     JE COFFMAN   REQ# 6527
      *C  ADDED CODE TO PICK UP CHAT NUMBERS FROM DVENDITM FOR CODED
      *C  ITEMS THAT WERE QUOTE-GENERATED AND THE USER IS CREATING A
      *C  PURCHASE ORDER FROM THE QUOTE.
      ***------------------------------------------------------------***
      *C  DECEMBER 8, 1994   JS BUNGO
      *C  ADDED NEW PO LOAD TRANSACTION #6 TO MODIFY THE PO ITEM
      *C  ORDERED QUANTITY AND PRICE FROM MEXICO'S IMS (IMPORT
      *C  MANAGEMENT SYSTEM).  PO LOAD FILE WILL CONTAIN THE
      *C  PO NUMBER, ITEM NUMBER, NEW ORDERED QUANTITY, NEW ORDERED
      *C  QUANTITY UM, NEW PRICE, PRICE UM.  THE PROGRAM WILL EDIT
      *C  THE PO EXISTS, ITEM FOR PO EXISTS, QUANTITY AND PRICE ARE
      *C  NUMERIC, AND THE UNIT OF MEASURES ARE STOREROOM UM OR
      *C  STOREROOM ALTERNATES.
      ***------------------------------------------------------------***
      *C  APRIL 4, 1995    CA ZUBEK    REQ. # 95-009
      *C  ADDED CALLS TO "SPOTRACK" TO WRITE TO THE AUDIT TRAIL FILE
      *C  WHEN UNIT PRICE OR QUANTITY ORDERED IS CHANGED.
      ***------------------------------------------------------------***
      *C  JULY 10, 1995    CA YODER
      *C  ADDED PO ITEM NUMBER FIELD TO PARAMETERS PASSED TO "SPOTRACK."
      ***------------------------------------------------------------***
      *C  AUGUST 1995      JE COFFMAN  REQ. # 95-030
      *C  ADDED THE ABILITY TO STORE PURCHASE ORDER TRAILER COMMENTS.
      *C  THESE ARE THE 'A' RECORDS THAT ARE SENT FROM CORPORATE TO
      *C  THE PLANT FOR INFORMATION ONLY REGARDING THE PURCHASE ORDER
      *C  (I.E. HOW IT'S TO BE BILLED, PAID, ETC.).
      ***------------------------------------------------------------***
      *C  DECEMBER 6, 1995   JEFF BUNGO
      *C  CHANGED THE WAY THE PROGRAM WAS GETTING RECORDS FROM BOTH
      *C  DPOITEM AND DPODTAITM.  THE PROGRAM WAS LOOPING THROUGH
      *C  ALL ITEMS OF THE PO TO GET THE CORRECT ITEM.  CHANGED THE
      *C  LOGIC TO GO AFTER THE ITEM DIRECTLY INSTEAD OF LOOPING.
      *C  THIS WAS DONE TO REDUCE THE I/O ON THE TWO FILES WHICH WAS
      *C  ASTRONOMICAL WHEN THE PROGRAM WAS RUN.
      ***------------------------------------------------------------***
      *C  SEPTEMBER 1996  JE COFFMAN REQ# 6619
      *C  EXPANDED DATE FIELDS FOR COMPLIANCE WITH YEAR 2000.
      ***------------------------------------------------------------***
      *C  JANUARY 21, 1997  JEFF BUNGO
      *C    SKIP EDIT CHECKS OF COMPLETED PO ON PO DELETE FOR
      *C    DELETES DOWNLOADED FOR KELLY PLANTS.
      ***------------------------------------------------------------***
      *C  14MAR1997  DAVE PLUM
      *C    CORRECTED THE 99-GETNEXT-DPODATAITM-PO-ITM-O
      *C    PARAGRAPH TO PROPERLY RECOGNIZE WHEN THE "READ NEXT"
      *C    HAS RETRIEVED A RECORD HAVING A KEY GREATER THAN
      *C    THE PO/ITEM THAT WE ARE WORKING WITH.
      ***------------------------------------------------------------***
      *C  24MAR1997  CA YODER
      *C    CORRECTED 6900-PROCESS-TRAILER-COMMENTS TO CHECK FOR THE
      *C    CORRECT CONDITION FOR THE DELETION OF DTRAILER ITEMS.
      *C    PREVIOUSLY, IT WAS PERFORMING THE DELETE UNTIL COND-WORD
      *C    NOT = 15, WHEN IT SHOULD REALLY BE PERFORMED UNTIL COND-WORD
      *C    = 15.  THE DTRAILER COMMENTS WERE NEVER BEING DELETED IF A
      *C    MODIFICATION TO A PO WAS BEING MADE.
      ***------------------------------------------------------------***
      *C  25MAR1997  CA YODER
      *C    CORRECTED 6400-MOD-ITEM PARAGRAPH TO DELETE DPODATAITM
      *C    ENTRIES AFTER THE EDIT CHECKS ON THE PO NUMBER ARE PERFORMED.
      *C    PREVIOUSLY, THE DPODATAITM ENTRIES WERE DELETED BEFORE THE
      *C    THE EDIT CHECKS, SO PURCHASE ORDERS WERE MISSING THE
      *C    DESCRIPTIONS IF AN UPDATE RECORD WAS IN ERROR.
      ***------------------------------------------------------------***
      *C  05MAY1997  CA YODER
      *C    CORRECTED CENTURY LOGIC TO SKIP 'IF YY > "70"' STATEMENT IF
      *C    THE EXPECT OR SHIP DATES ARE EQUAL TO SPACES.  PREVIOUSLY,
      *C    DATES OF "20      " WERE FOUND IN DPORECD.  ALSO, IF THE
      *C    SHIP DATE IS NON-NUMERIC, THE CENTURY LOGIC IS SKIPPED.
      ***------------------------------------------------------------***
      *C  11JUN1997  JE COFFMAN
      *C    CHANGED THE WORKING STORAGE AREAS FOR CODED ITEMS ADDS
      *C    (RECORD TYPE 3 - STR-ITEM-BUFFER) AND NON-STORES ITEM
      *C    ADDS (RECORD TYPE 4 - NS-ITEM-BUFFER) WHEN JUDY FINNEY
      *C    FOUND THAT THE DEPARTMENT AND ADDITIONAL DATA FIELDS WERE
      *C    MISALIGNED.
      ***------------------------------------------------------------***
      *C  05JAN1998  CA YODER
      *C    ADDED FIELDS FOR QUANTITY RECEIVED, INVOICED, AND PAID
      *C    FOR COLLINGWOOD ON THE "3" AND "4" RECORDS.
      ***------------------------------------------------------------***
      *C  03/04/1998  CA YODER
      *C    FOUND THAT THE PROGRAM WAS CREATING POS WITH BLANK PO NUMBER.
      *C    CHANGED VALIDATION CHECK TO MAKE SURE PO NUMBER CHARACTERS
      *C    1 - 7 ARE NOT BLANK, NOT ALL 10 CHARACTERS.  WHEN THE RELEASE
      *C    NUMBER CONTAINED "000" THE PROGRAM WAS CREATING THE PO
      *C    ANYWAYS.
      ***------------------------------------------------------------***
      *C  04/03/1998  CA YODER
      *C    REMOVED LOGIC TO REPLACE THE FIRST CHARACTER OF A REQ
      *C    WITH AN "N" FOR AKRON PLANTS.
      ***------------------------------------------------------------***
      *C  07/13/1998  CA YODER
      *C    AN ERROR OCCURRED IN PARAGRAPH 6295-DELETE-PO WHEN THE
      *C    RIGHT CONDITIONS EXISTED FOR THE LOGIC TO FALL THROUGH TO
      *C    THE 6298-SET-DELETE-IT PARAGRAPH ERRONEOUSLY.  MOVED THE
      *C    6298 PARAGRAPH OUT OF THE 6295 LOOP.  ALSO ADDED CALL TO
      *C    MCXCBLERR.
      ***------------------------------------------------------------***
      *C  12/08/1999  CA YODER
      *C    ADDED LOGIC FOR AKRON PLANTS TO CHECK IF THE PURCHASE ORDER
      *C    BEING ADDED IS ALREADY IN THE HISTORY DATABASE.  IF IT IS,
      *C    THE PURCHASE ORDER IS SKIPPED AND AN ERROR MESSAGE IS
      *C    PRINTED.
      ***------------------------------------------------------------***
      *C  10/03/2002  CA YODER
      *C    ADDED LOGIC TO PROCESS REQUIRED DATE FIELD FROM CPS.  IT
      *C    IS SENT AS A TYPE "5" RECORD WITH ZEROES FOR THE SEQUENCE
      *C    NUMBER.  IT IS STORED IN DPODATAITM.
      ***------------------------------------------------------------***
      *C  04/03/2003    DCR  DAN RAUCH
      *C  DCR01 - ADDED LOGIC FOR PO LOGGING
      ***------------------------------------------------------------***
      *C  03/04/2004    BRUCE GEISER
      *C  BG001 - REMOVE LOGIC TO CREATE TEMP VENDORS.
      **************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               LOCAL-DATA       IS LOCAL-DATA-AREA
                               C01 IS NEW-PAGE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DDAILYTC-DT-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-PO-O
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-PO-O
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-PO-O
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-VN-I
               ASSIGN TO DATABASE-MCFLCS0902
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD-PO-O
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD-RQ-O
               ASSIGN TO DATABASE-MCFLCS2101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-RQ-O
               ASSIGN TO DATABASE-MCFLCS2201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DTRAILER-PO-O
               ASSIGN TO DATABASE-MCFLCS6001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-CD-O
               ASSIGN TO DATABASE-MCFLCS0802
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-QT-I
               ASSIGN TO DATABASE-MCFLCS0803
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDITM-VN-I
               ASSIGN TO DATABASE-MCFLCS0801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT INPUT-PO-FILE
               ASSIGN TO DISK-AKPOFILE
               FILE STATUS IS FILE-STATUS.

           SELECT KVENDOR-VN-O
               ASSIGN TO DATABASE-MCFLCSVEN2
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MBUYER-BY-I
               ASSIGN TO DATABASE-MCFLCS0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-O
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-PO-I
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-PO-O
               ASSIGN TO DATABASE-MCFLCS0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ-RQ-O
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-UM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECDH-I
               ASSIGN TO DATABASE-MCFLST0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PO-ERROR-FILE
               ASSIGN TO DISK-DPOERFIL
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  DDAILYTC-DT-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-DT-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  DPODATAITM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-PO-REC-O.
           COPY DDS-MCRPCS1100  OF MCFLCS1101.

       FD  DPOITEM-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-PO-REC-O.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPORECD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPORECD-VN-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-VN-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0902.

       FD  DREQD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DREQD-PO-REC-O.
           COPY DDS-MCRPCS2100  OF MCFLCS2102.

       FD  DREQD-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  DREQD-RQ-REC-O.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQITM-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-RQ-REC-O.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DTRAILER-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DTRAILER-PO-REC-O.
           COPY DDS-MCRPCS6000  OF MCFLCS6001.

       FD  DVENDITM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-CD-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

       FD  DVENDITM-QT-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-QT-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DVENDITM-VN-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-VN-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  DVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-O.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

001000*****************************************************
001100*  INPUT FILE FOR TLOADPO.SOURCE (ABSTFILE LAYOUT)  *
001110* PO-REC IS MOVED TO ANOTHER AREA BASED ON PO-TRANS *
001120* IF PO-DEL-FLAG = 'D' AND                          *
001130*    PO-TRANS=1  -  DELETE PO HEADER                *
001140*    PO-TRANS=3  -  DELETE CODED ITEM               *
001150*    PO-TRANS=4  -  DELETE NONCODED ITEM            *
001160*    PO-TRANS=5  -  DELETE DESCRIPTION              *
      *    PO-TRANS=6  -  P.O. TRAILER COMMENTS           *
001170*                                                   *
001180* IF PO-DEL-FLANG = ' ' AND                         *
001190*    PO-TRANS=1  -  ADD PO HEADER                   *
001191*    PO-TRANS=2  -  ADD VENDOR RECORD               *
001192*    PO-TRANS=3  -  ADD CODED ITEM                  *
001193*    PO-TRANS=4  -  ADD NONCODED ITEM               *
001194*    PO-TRANS=5  -  ADD DESCRIPTION                 *
      *    PO-TRANS=6  -  MODIFY ITEM (MEXICO, 659 ONLY)  *
001195*    PO-TRANS= ,7,8 ARE IGNORED                     *
      *    PO-TRANS=A  -  P.O. TRAILER COMMENTS           *
001196*    ALL OTHERS ARE INVALID                         *
001200*****************************************************
001300 FD  INPUT-PO-FILE
001400     LABEL RECORDS ARE OMITTED
001500     RECORD CONTAINS 133 CHARACTERS
001600     DATA RECORD IS INPUT-PO-REC.
001700 01  INPUT-PO-REC.
001800     05  FILLER                         PIC X.
001900     05  PO-TRANS                       PIC X.
           05  RECORDS-1-8.
002000         10  PO-DEL-FLAG                PIC X.
002100         10  PO-INPUT-NUM.
002200             15  PO-NUM-1-7             PIC X(7).
002300             15  PO-RLSE-8-10           PIC X(3).
002400         10  PO-REC                     PIC X(120).
           05  RECORD-A REDEFINES RECORDS-1-8.
               10  FILLER                     PIC X.
               10  PO-REC-A                   PIC X(129).
002500
       FD  KVENDOR-VN-O
           LABEL RECORDS ARE STANDARD.
       01  KVENDOR-VN-REC-O.
           COPY DDS-MCRPCSVEND  OF MCFLCSVEN2.

       FD  MBUYER-BY-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-BY-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MPORCV-PO-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MPORCV-PO-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-PO-REC-O.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MREQ-RQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-RQ-REC-O.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MVALIDUM-UM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-UM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.

       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0301.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC.
           05  PRINT-LINE                PIC X(132).

       FD  PO-ERROR-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS PO-ERROR-REC.
       01  PO-ERROR-REC.
           05  CTL                       PIC X(1).
           05  PO-ERROR-LINE.
               10  CONTROL-DATE          PIC X(6).
               10  FILLER                PIC X(126).

       WORKING-STORAGE SECTION.
       77  CONVERT-NUM                   PIC 9(4)  VALUE 0.
       77  DELETE-IT                     PIC 9     VALUE 0.
       77  HANDLE-BLOWUP-FLAG            PIC X     VALUE "N".
       77  SAVE-IN-QUOTE                 PIC X(6)  VALUE SPACES.
       77  SAVE-CHAT-SW                  PIC X     VALUE "N".
       77  TRAILER-SW                    PIC 9     VALUE 0.
       77  ITEMSEQNO-9                   PIC 9(6)  VALUE 0.
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".
       77  PO-IN-HIST-SW                 PIC X     VALUE "N".
       77  ADD-2-SW                      PIC X     VALUE "N".

       01  YMD-DATE.
           05  YMD-YY                    PIC X(2).
           05  YMD-MM                    PIC X(2).
           05  YMD-DD                    PIC X(2).

       01  TEMP-DATE-9                   PIC 9(8).
       01  TEMP-DATE   REDEFINES  TEMP-DATE-9
                                         PIC X(8).

       01  FROM-QUOTE                    PIC X     VALUE "N".
      *------- THIS FLAGS WHAT TYPE OF FUNCTION WE ARE PROCESSING
      *------- FOR A RECORD - ADD, MOD, DELETE / ITEM, HEADER, DATAITEM
       01  RECORD-FUNCTION-D.
           05  RECORD-FUNCTION.
               10  RECORD-FUNCTION-1     PIC X(1).
               10  RECORD-FUNCTION-2     PIC X(1).
           05  FILLER                    PIC X(1).
           05  RECORD-FUNCTION-DESC      PIC X(14).

       01  ITEM-TO-SEARCH-FOR            PIC X(4).

       01  WORK-AREA-DATA-NAMES.
           05  OLD-ORD-QTY-SAVE          PIC S9(8)  VALUE ZEROS.
           05  ORD-QTY-SAVE              PIC S9(8)  VALUE ZEROS.
           05  SAVE-PO-NUM-REL           PIC X(10)  VALUE SPACES.
           05  SAVE-PO-NUM-REL-2         PIC X(19)  VALUE SPACES.
           05  LINE-CTR                  PIC 9(2)   VALUE ZERO.
           05  PAGE-CTR                  PIC 9(3)   VALUE ZERO.
           05  POR-LINE-CTR              PIC 9(2)   VALUE ZERO.
           05  POR-PAGE-CTR              PIC 9(3)   VALUE ZERO.
           05  RECORD-COUNTER            PIC 9(6)   VALUE ZEROS.
           05  TC-TYPE-SAVE              PIC X(3)   VALUE SPACES.
           05  OLD-BUDGET-AMT            PIC S9(11) VALUE ZEROS.
           05  SUB                       PIC S9(4)  VALUE ZEROS.
           05  DUPLICATE-PO-NO           PIC X(14)  VALUE SPACES.
           05  SAVE-PARA-NO              PIC 9(2)   VALUE 0.
           05  SAVE-STR-CF               PIC S9(11)V9(4).
           05  FORMAT-QTY                PIC S9(8)V9(4).
           05  SAV-ORD-STR-UM            PIC S9(11)V9(4).
           05  SAV-PRC-STR-UM            PIC S9(11)V9(4).
           05  SAVE-ITM-TAX-CODE         PIC XX.

       01  SWITCH-AREA.
           05  VEN-CHANGE-SW             PIC X(1)  VALUE SPACES.
           05  BAD-CODE-SW               PIC X(1)  VALUE SPACES.
           05  ERR-SW                    PIC X(1)  VALUE SPACES.
           05  BLANKET-SW                PIC X(1)  VALUE SPACES.
           05  AT-LEAST-ONE-BLKT-SW      PIC X(1)  VALUE SPACES.
           05  CONST-PO-SW               PIC X(1)  VALUE SPACES.
           05  INTERNATIONAL-REQ-FLAG    PIC X(1)  VALUE SPACES.
           05  MMIS-REQ-FLAG             PIC X(1)  VALUE SPACES.
           05  FOUND-DREQD-FLAG          PIC X(1)  VALUE SPACES.
           05  EOF-SW                    PIC X(1)  VALUE SPACES.
           05  FOUND-REQ-FLAG            PIC X(1)  VALUE SPACES.
           05  LOADPO-REQACCT-SW         PIC X(1)  VALUE SPACES.
           05  AKRON-DEFAULT-FLAG        PIC X(1)  VALUE "N".
           05  CUR-CODE-REQUIRED-SW      PIC X(1).
           05  LOADPO-VEN                PIC X(10).
           05  UNIT-QTY-CHGD-SW          PIC X(1)  VALUE "N".

       01  COMPANY-SAVE.
           05  COMPANY-SAVE1-2           PIC X(2).
               88  AKRON-PLANT                     VALUE "11".
           05  FILLER                    PIC X.
       01  COMPANY-SAVE-KELLY-TEST REDEFINES COMPANY-SAVE PIC X(3).
           88  KELLY-PLANT                         VALUE "211", "281",
                                                         "285".
           88  MEXICO-PLANT                        VALUE "659".
           88  CARTER-PLANT                        VALUE "173".
           88  DECATUR-PLANT                       VALUE "174".
           88  COLLING-PLANT                       VALUE "327".

       01  CURRENT-DATE-CN.
           05  CUR-DATE-CC               PIC XX.
           05  CUR-DATE.
               10  CUR-DATE-YY           PIC XX.
               10  FILLER                PIC X(4).


DCR01 *==============================================================
DCR01 * EXTRA PO LOGGING FLDS
DCR01 *==============================================================
DCR01  01  WS-Z000-EXTRA-FLDS.
DCR01      03  WS-Z000-PGM       PIC X(10)        VALUE "TLOADPO".
DCR01  COPY POLOGSUBWS  IN COPYLIB.
DCR01 *==============================================================

DCR01  COPY CPOLOGPRM   IN COPYLIB.


      **************************************************************
      **                                                          **
      **       S U B P R O G R A M   A R E A S                    **
      **                                                          **
      **************************************************************

       01  RET-CODE                      PIC S9(4) BINARY VALUE 0.
       01  CALL-MODE                     PIC S9(4) BINARY VALUE 0.
       COPY TLSHIFT2   IN COPYLIB.
       COPY TUMCF      IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY STC320     IN COPYLIB.
       COPY SVENPRC    IN COPYLIB.
       COPY SPOMSTRM   IN COPYLIB.
       COPY CDESC      IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.

       01  JCW-PARMS.
           05  JCW-NAME                  PIC X(16).
           05  JCW-VALUE.
               10  JCW-VALUE-1-3.
                   15  JCW-VALUE-1-2     PIC X(2).
                   15  FILLER            PIC X(1).
               10  JCW-VALUE-1-3N REDEFINES JCW-VALUE-1-3 PIC 9(3).
               10  FILLER                PIC X(1).
           05  JCW-YES-NO                PIC X(1).
           05  JCW-STATUS                PIC 9(4).
           05  JCW-STARTING-POS          PIC 9(4).
           05  JCW-LENGTH                PIC 9(1).


       01  ZBILL-PO-SW                   PIC X(1).

      *------- PARMS FOR INTRINSIC "FOPEN"
       01  FOPEN-FILE                    PIC X(9)  VALUE "DPOERFIL ".
       01  FNUM                          PIC S9(4) BINARY.
       01  FCHECK-MSG-LENGTH             PIC S9(4) BINARY.
       01  FCHECK-ERROR-NUM              PIC S9(4) BINARY.
       01  FCHECK-MSG                    PIC X(72) VALUE SPACES.

000001
001000*****************************************************************
001100**                                                             **
001200**     I N P U T   R E C O R D   F I L E   -   T L O A D P O   **
001300**                                                             **
001400*****************************************************************
002600 01  FILE-HEADER-LABEL.
002700     05  FILLER                         PIC X(3).
002800     05  HEADER-LABEL                   PIC X(15).
002900     05  SEND-SEQ                       PIC X(4).
003000*----------  "Y" IF USED FOR LOADING DATABASE ONLY.  NO
003100*            TRANSACTIONS ARE CREATED.
003200     05  LOAD-SW                        PIC X.
003210     05  IN-TYPE                        PIC X.
003220     05  IN-DOCUMENT                    PIC X(12).
003230     05  IN-QUOTE-DOC REDEFINES IN-DOCUMENT.
003240         07  IN-QUOTE                   PIC X(6).
003250         07  FILLER                     PIC X(6).
003300     05  FILLER                         PIC X(97).
003400
003500 01  FILE-TRAILER-LABEL REDEFINES FILE-HEADER-LABEL.
003600     05  FILLER                         PIC X(3).
003700     05  TRAILER-LABEL                  PIC X(13).
003800     05  FILLER                         PIC X(7).
           05  TRAILER-LABEL-CTR-X            PIC X(5).
003900     05  TRAILER-LABEL-CTR REDEFINES TRAILER-LABEL-CTR-X
                                              PIC 9(5).
004000     05  FILLER                         PIC X(105).

001500 01  PO-HEADER-BUFFER.
001600     05  IN-PO-REQ-NUM             PIC X(12).
001700     05  IN-PO-RCV-DEPT.
001800         10  IN-RCV-DEPT-1-2       PIC X(2).
001900         10  FILLER                PIC X(4).
002000     05  IN-PO-RCV-DEPT-R  REDEFINES  IN-PO-RCV-DEPT.
002100         10  IN-RCV-DEPT-1-3       PIC X(3).
002200         10  IN-RCV-DEPT-4         PIC X.
002300         10  FILLER                PIC XX.
002400     05  IN-PO-FOR-DEPT            PIC X(6).
002500     05  IN-PO-DATE.
002600         10 IN-PO-DATE-MM          PIC XX.
002700         10 IN-PO-DATE-DD          PIC XX.
002800         10 IN-PO-DATE-YY          PIC XX.
002900     05  IN-PO-PLT                 PIC X(3).
003000     05  IN-PO-BLDG                PIC X(4).
003100     05  IN-PO-ACCTG-INFO.
003200         10  IN-PO-COMPANY         PIC X(3).
003300         10  IN-PO-PRIME           PIC X(3).
003400         10  IN-PO-SUB             PIC X(3).
003500         10  IN-PO-SUB-DETL        PIC X(3).
003600         10  IN-PO-ADDL-DATA       PIC X(6).
               10  FILLER                PIC X.
003700     05  IN-PO-TERMS.
003800         10  IN-PO-PCT             PIC X.
003900         10  IN-PO-DUE-DTE         PIC X.
004000     05  IN-PO-BUYER               PIC X(16).
004100     05  IN-PO-ADDTL-INFO          PIC X(16).
004200     05  IN-PO-VIA                 PIC X(20).
004300     05  IN-PO-FOB                 PIC X(2).
004400     05  IN-CONST-INDICATOR        PIC X.
004500     05  IN-BUYER-CODE             PIC X(4).
004600     05  FILLER                    PIC X(3).
004700
       01  PO-TRAILER-COMMENTS.
           05  IN-TRLR-COMMNO            PIC 9(3).
           05  IN-TRLR-COMMENT           PIC X(70).
           05  FILLER                    PIC X(57).

004800 01  PO-VENDOR-BUFFER.
004900     05  IN-VENDOR-CODE.
005000         10  IN-VENDOR-CODE1-7     PIC X(7).
005100         10  IN-VENDOR-CODE8-10    PIC X(3).
005200     05  IN-VENDOR-NAME            PIC X(44).
005300     05  IN-PO-BUDGET-NUMBER       PIC X(12).
005400     05  IN-PO-BUDGET-AMT-9        PIC S9(8).
005500     05  IN-PO-BUDGET-AMT-X REDEFINES IN-PO-BUDGET-AMT-9
005600                                   PIC X(8).
005700     05  IN-PO-SHIP-DATE.
005800         10 IN-PO-SHIP-MM          PIC XX.
005900         10 IN-PO-SHIP-DD          PIC XX.
006000         10 IN-PO-SHIP-YY          PIC XX.
006100     05  IN-EXP-DATE.
006200         10  IN-EXP-DATE-MM        PIC XX.
006300         10  IN-EXP-DATE-DD        PIC XX.
006400         10  IN-EXP-DATE-YY        PIC XX.
006500     05  IN-CURRENCY-CODE          PIC X(2).
006600     05  IN-LAST-RELEASE           PIC 9(3).
006700     05  IN-LAST-RELEASE-X  REDEFINES  IN-LAST-RELEASE
006800                                   PIC X(3).
           05  IN-LAST-CHANGE-NOTICE     PIC X(3).
           05  IN-INVOICELESS-IND        PIC X(1).
006900     05  FILLER                    PIC X(25).
007000
007100 01  STR-ITEM-BUFFER.
007200     05  IN-CORP-CODE              PIC X(8).
007300     05  IN-ITM-NUM                PIC X(4).
007400     05  IN-ITM-NUM-9 REDEFINES IN-ITM-NUM
007500                                   PIC 9(4).
007600     05  IN-ITM-QTY-ORD-9          PIC S9(8)V9(4).
007700     05  IN-ITM-QTY-ORD-X REDEFINES IN-ITM-QTY-ORD-9
007800                                   PIC X(12).
007900     05  IN-ITM-QTY-UM             PIC XX.
008000     05  IN-ITM-PRICE-UM           PIC X(2).
008100     05  IN-ITM-UNIT-PRICE-9  PIC S9(8)V9(4).
008200     05  IN-ITM-UNIT-PRICE-X REDEFINES IN-ITM-UNIT-PRICE-9
008300                                   PIC X(12).
008400*----05  IN-ITM-SUB-DETAIL         PIC X(4).
      *------  CHANGED TO PIC X(3) WHEN PLANT 1 INDICATED THAT THIS
      *------  WAS SKEWED WITH THE ADDL DATA FIELD ON DOWNLOADED PO'S.
           05  IN-ITM-SUB-DETAIL         PIC X(3).
008500     05  IN-ITM-ADDL-DATA          PIC X(6).
           05  FILLER                    PIC X.
008600     05  IN-ITM-REQ-NO             PIC X(10).
008700     05  IN-ITM-CONTAINER-INDIC    PIC X.
           05  IN-ITM-TAX-CODE           PIC XX.
      *------- FOR COLLINGWOOD STARTUP ONLY------------------
           05  FILLER                    PIC X(4).
           05  IN-ITM-QTY-RCVD           PIC S9(8).
           05  IN-ITM-QTY-INV            PIC S9(8).
           05  IN-ITM-QTY-PAID           PIC S9(8).
      *------------------------------------------------------
008800     05  FILLER                    PIC X(29).
008900
009000 01  NS-ITEM-BUFFER.
009100     05  IN-NSTR-ITM-NUM           PIC X(4).
009200     05  IN-NSTR-QTY-UM            PIC X(2).
009300     05  IN-NSTR-QTY-ORD-9 PIC S9(8)V9(4).
009400     05  IN-NSTR-QTY-ORD-X REDEFINES IN-NSTR-QTY-ORD-9
009500                                   PIC X(12).
009600     05  IN-NSTR-PRICE-UM          PIC X(2).
009700     05  IN-NSTR-UNIT-PRICE-9  PIC S9(8)V9(4).
009800     05  IN-NSTR-UNIT-PRICE-X REDEFINES IN-NSTR-UNIT-PRICE-9
009900                                   PIC X(12).
010000     05  IN-NSTR-ITM-SUB           PIC X(3).
      *------  CHANGED TO PIC X(3) WHEN PLANT 1 INDICATED THAT THIS
      *------  WAS SKEWED WITH THE ADDL DATA FIELD ON DOWNLOADED PO'S.
010100     05  IN-NSTR-SUB-DETL          PIC X(4).
      *----05  IN-NSTR-SUB-DETL          PIC X(3).
010200     05  IN-NSTR-ADDL-DATA         PIC X(8).
010300     05  IN-NSTR-CORP-CODE         PIC X(8).
      *------  COMMENTED OUT THIS FILLER BECAUSE IT WAS THROWING OFF
      *------  THE REQ NUMBER.
      *----05  FILLER                    PIC X.
010400     05  IN-NSTR-REQ-NO            PIC X(10).
010500     05  IN-NSTR-CONTAINER-INDIC   PIC X.
           05  IN-NSTR-TAX-CODE          PIC XX.
010600     05  FILLER                    PIC X(51).
      *------- FOR COLLINGWOOD STARTUP ONLY------------------
       01  NS-COL-X   REDEFINES  NS-ITEM-BUFFER.
           05  FILLER                    PIC X(68).
           05  IN-NSTR-QTY-RCVD          PIC S9(8).
           05  IN-NSTR-QTY-INV           PIC S9(8).
           05  IN-NSTR-QTY-PAID          PIC S9(8).
           05  FILLER                    PIC X(28).
      *------------------------------------------------------
010700
010800 01  DATA-ITEM-BUFFER.
           05  IN-DATA-ITM-LINE.
010900       10  IN-DATA-ITM-NUMBER        PIC X(4).
011000       10  IN-DATA-ITM-NUMBER-9 REDEFINES IN-DATA-ITM-NUMBER
011100                                     PIC 9(4).
011200       10  IN-DATA-LINE-NUMBER       PIC X(2).
011300       10  IN-DATA-LINE-NUMBER-9 REDEFINES IN-DATA-LINE-NUMBER
011400                                     PIC 9(2).
           05  IN-DATA-ITM-LINE-9 REDEFINES IN-DATA-ITM-LINE PIC 9(6).
011500     05  IN-ABSTFILE-DESC.
011600         07  IN-PO-DATA-LINE           PIC X(62).
011700         07  IN-DATA-CONTAINER-INDIC   PIC X.
011800         07  IN-PROD-KEY               PIC X(20).
011900     05  IN-QUOTE-PO-DESC REDEFINES IN-ABSTFILE-DESC.
012000         07  IN-NC-ITEM-DESC       PIC X(80).
012100         07  FILLER                PIC X(3).
012200     05  FILLER                    PIC X(31).

       01  MEXICO-DATA-BUFFER.
           05  IN-MEXICO-ITEM            PIC X(4).
           05  IN-MEXICO-QTY-ORD         PIC S9(8)V9(4).
           05  IN-MEXICO-QTY-ORD-UM      PIC X(2).
           05  IN-MEXICO-UNIT-PRICE      PIC S9(11)V9(4).
           05  IN-MEXICO-UNIT-PRICE-UM   PIC X(2).
           05  FILLER                    PIC X(85).

      *******************************************************************
      **      K E L L Y   R E C O R D   L A Y O U T S                  **
      *******************************************************************

       01  K-PO-HEADER-BUFFER.
           05  K-PO-REQ-NUM              PIC X(12).
           05  K-PO-RCV-DEPT             PIC X(6).
           05  K-PO-FOR-DEPT             PIC X(6).
           05  K-PO-DATE                 PIC X(6).
           05  K-PO-PLT                  PIC X(3).
           05  K-PO-ADDL-DATA            PIC X(8).
           05  K-PO-BUYER                PIC X(16).
           05  K-PO-SHIP-DATE            PIC X(6).
           05  K-VENDOR-CODE             PIC X(10).
           05  K-VENDOR-NAME             PIC X(40).
           05  FILLER                    PIC X(4).
           05  K-PO-TYPE                 PIC X(1).
           05  K-BLANKET-INDIC           PIC X(1).
           05  FILLER                    PIC X(1).

       01  K-PO-VENDOR-BUFFER.
           05  K-VENDOR-ADDR-1           PIC X(40).
           05  K-VENDOR-ADDR-LAST        PIC X(40).
           05  FILLER                    PIC X(40).

       01  K-STR-ITEM-BUFFER.
           05  K-CORP-CODE               PIC X(7).
           05  K-ITM-NUM                 PIC X(4).
           05  K-ITM-QTY-ORD             PIC X(12).
           05  K-ITM-QTY-ORD-9 REDEFINES K-ITM-QTY-ORD
                                         PIC S9(8)V9(4).
           05  K-ITM-QTY-UM              PIC XX.
           05  K-ITM-PRICE-UM            PIC X(2).
           05  K-ITM-UNIT-PRICE          PIC X(12).
           05  K-ITM-UNIT-PRICE-9 REDEFINES K-ITM-UNIT-PRICE
                                         PIC S9(8)V9(4).
           05  K-ITM-SUB-DETAIL          PIC X(3).
           05  K-ITM-REQ-NO              PIC X(10).
           05  K-STORES-QTY              PIC S9(8).
           05  K-STORES-UM               PIC X(2).
           05  FILLER                    PIC X(58).

       01  K-NSTR-ITEM-BUFFER.
           05  K-NSTR-ITM-NUM            PIC X(4).
           05  K-NSTR-QTY-UM             PIC X(2).
           05  K-NSTR-QTY-ORD            PIC X(12).
           05  K-NSTR-QTY-ORD-9 REDEFINES K-NSTR-QTY-ORD
                                         PIC S9(8)V9(4).
           05  K-NSTR-PRICE-UM           PIC X(2).
           05  K-NSTR-UNIT-PRICE         PIC X(12).
           05  K-NSTR-UNIT-PRICE-9 REDEFINES K-NSTR-UNIT-PRICE
                                         PIC S9(8)V9(4).
           05  K-NSTR-ITM-SUB            PIC X(3).
           05  K-NSTR-SUB-DETL           PIC X(4).
           05  K-NSTR-ADDL-DATA          PIC X(8).
           05  K-NSTR-REQ-NO             PIC X(10).
           05  K-NSTR-STORES-QTY         PIC S9(8).
           05  K-NSTR-STORES-UM          PIC X(2).
           05  FILLER                    PIC X(53).

       01  BUILD-PO-DATE-CN.
           05  BUILD-PO-DATE-CC          PIC X(2).
           05  BUILD-PO-DATE.
               10  BUILD-PO-DATE-YY      PIC X(2).
               10  BUILD-PO-DATE-MM      PIC X(2).
               10  BUILD-PO-DATE-DD      PIC X(2).

       01  BUILD-REQ-DESC-LINE.
           05  FILLER                    PIC X(4)  VALUE "REQ ".
           05  BUILD-REQ-DESC-REQ        PIC X(12).


      *****************************************************
      ** THE FOLLOWING WORK AREA IS USED FOR PRINTING PO **
      *****************************************************

       01  WORK-AREA.
           05  BUILD-PO.
             07  PO-RLSE.
               10  PO-PREFIX             PIC X       VALUE "P".
               10  PO-NUM-REL.
                   15  PO-NUM            PIC X(7)    VALUE SPACES.
                   15  PO-REL            PIC X(3)    VALUE SPACES.
             07  PO-RECV                 PIC 9(3)    VALUE ZEROS.

           05  BUILD-POH.
             07  POH-NUM-REL             PIC X(10).
             07  POH-RCV                 PIC X(3).
             07  FILLER                  PIC X       VALUE SPACE.

           05  SAVE-ACCTG-DATA.
               10  IN-ITM-SUB            PIC X(3).

           05  SAVE-EXPECT-DATE-CN.
               10  SAVE-EXPECT-CC        PIC XX   VALUE SPACES.
               10  SAVE-EXPECT-DATE.
                   15  SAVE-EXPECT-YY    PIC XX   VALUE SPACES.
                   15  SAVE-EXPECT-MM    PIC XX   VALUE SPACES.
                   15  SAVE-EXPECT-DD    PIC XX   VALUE SPACES.

           05  BUILD-T-VEN-KEY.
               10  FILLER                PIC X       VALUE "T".
               10  T-VEN-NUM-2-7         PIC X(6).
               10  T-VEN-NUM-8-10        PIC X(3).
               10  T-VEN-NUM-8-10-R REDEFINES T-VEN-NUM-8-10
                                         PIC 9(3).

           05  BUILD-TM-DISCOUNT-KEY.
               10  FILLER                PIC X(3)  VALUE "TMP".
               10  BUILD-TM-DISCOUNT-VALUE PIC X     VALUE SPACES.

           05  BUILD-TM-DUE-DATE-KEY.
               10  FILLER                PIC X(3)  VALUE "TMD".
               10  BUILD-TM-DATE-VALUE   PIC X     VALUE SPACES.

           05  BUILD-FOB-KEY.
               10  FILLER                PIC X(2)  VALUE "FB".
               10  BUILD-FOB-VALUE       PIC X(2)  VALUE SPACES.

      *------- HOLD REQ NO IS USED INSTEAD OF IN-ITM-REQ-NO BECAUSE THE
      *------- LATTER IS 10 BYTES, WE NEED MORE FOR 'N' PREFIX
       01 HOLD-REQ-NO.
           05  HOLD-REQ-NO-1             PIC X(1).
           05  HOLD-REQ-NO-2-4.
               10  HOLD-REQ-NO-2         PIC X(1).
               10  HOLD-REQ-NO-3         PIC X(1).
               10  FILLER                PIC X(1).
           05  FILLER                    PIC X(8).

       01  HOLD-REQ-NO-B REDEFINES HOLD-REQ-NO.
           05  FILLER                    PIC X(1).
           05  HOLD-REQ-NO-2-3           PIC X(2).
           05  HOLD-REQ-NO-4-12          PIC X(9).

       01  HOLD-REQ-NO-C REDEFINES HOLD-REQ-NO.
           05  FILLER                    PIC X(2).
           05  HOLD-REQ-NO-3-12          PIC X(10).

       01  BUILD-REQ-NO.
           05  FILLER                    PIC X(1)  VALUE "N".
           05  BUILD-REQ-2-12            PIC X(12).

       01  STRIP-REQ-PREFIX              PIC X(12) VALUE SPACES.

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MSTORERM   IN COPYLIB.
       COPY MPORCV     IN COPYLIB.
       COPY DPORECD    IN COPYLIB.
       COPY DPOITEM    IN COPYLIB.
       COPY DPODATA    IN COPYLIB.
       COPY DVENDOR    IN COPYLIB.
       COPY DTRAILER   IN COPYLIB.
       COPY KVENDOR    IN COPYLIB.
       COPY DDAILYTC   IN COPYLIB.
       COPY TC360      IN COPYLIB.
       COPY TC32D      IN COPYLIB.
       COPY TC370      IN COPYLIB.
       COPY MVALIDUM   IN COPYLIB.
       COPY DVENDITM   IN COPYLIB.
       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.
       COPY MPLTFBXX   IN COPYLIB.
       COPY MPLTPOSQ   IN COPYLIB.
       COPY MPLTPOPT   IN COPYLIB.
       COPY MPLTCHAT   IN COPYLIB.
       COPY MBUYER     IN COPYLIB.
       COPY MREQ       IN COPYLIB.
       COPY DREQD      IN COPYLIB.
       COPY DREQITM    IN COPYLIB.
       COPY DPORECDH   IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-NAME                 PIC X(16)  VALUE SPACES.
           05  DSET-MPORCV               PIC X(16)  VALUE "MPORCV;".
           05  DSET-DPORECD              PIC X(16)  VALUE "DPORECD;".
           05  DSET-DPOITEM              PIC X(16)  VALUE "DPOITEM;".
           05  DSET-DPODATAITM        PIC X(16)  VALUE "DPODATAITM;".
           05  DSET-DVENDOR              PIC X(16)  VALUE "DVENDOR;".
           05  DSET-AVENDCODE            PIC X(16)  VALUE "AVENDCODE;".
           05  DSET-DVENDITM             PIC X(16)  VALUE "DVENDITM;".
           05  DSET-DDAILYTC             PIC X(16)  VALUE "DDAILYTC;".
           05  DSET-MSTORERM             PIC X(16)  VALUE "MSTORERM;".
           05  DSET-MVALIDUM             PIC X(16)  VALUE "MVALIDUM;".
           05  DSET-MPLTINFO             PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-MREQ                 PIC X(16)  VALUE "MREQ;".
           05  DSET-DREQD                PIC X(16)  VALUE "DREQD;".
           05  DSET-DREQITM              PIC X(16)  VALUE "DREQITM;".
           05  DSET-MBUYER               PIC X(16)  VALUE "MBUYER;".

       COPY DATAB IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01 ITEMS-LISTING.
           05  ALL-ITEMS                 PIC XX    VALUE "@;".
           05  PO-SEARCH                 PIC X(10) VALUE "PO-RCV-NO;".
           05  CODE-SEARCH               PIC X(10) VALUE "CORP-CODE;".
           05  VEN-SEARCH                PIC X(10) VALUE "VEN-CODE;".
           05  REQ-SEARCH                PIC X(12) VALUE "REQ-NUMBER;".

       01 ARG-VALUES.
           05  PO-ARG                    PIC X(14) VALUE SPACES.
           05  VEN-ARG                   PIC X(10) VALUE SPACES.
           05  CODE-ARG                  PIC X(8)  VALUE SPACES.
           05  UM-ARG                    PIC XX    VALUE SPACES.
           05  PLT-ARG                   PIC X(4)  VALUE SPACES.
           05  REQ-ARG                   PIC X(12) VALUE SPACES.
           05  BUYER-ARG                 PIC X(4)  VALUE SPACES.
           05  QUOTE-ARG                 PIC X(10) VALUE SPACES.

       01  PO-TRACK-DATA.
           COPY DPOTRACK      OF COPYLIB.

      *****************************************************************
      **                                                             **
      **          H E A D E R / D E T A I L   L I N E S              **
      **                                                             **
      *****************************************************************
       01  PORPT-HEADER-1.
           05  FILLER                    PIC X(5)  VALUE "DATE ".
           05  POR-PRT-DATE              PIC X(8).
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  POR-PRT-TIME              PIC X(8).
           05  FILLER                    PIC X(30) VALUE SPACES.
           05  FILLER     PIC X(16) VALUE "LOAD P.O. REPORT".
           05  FILLER                    PIC X(35) VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "PLT ".
           05  PRT-PLT-1                 PIC X(3).
           05  FILLER                    PIC X(4)  VALUE "PAGE".
           05  POR-PRT-PAGE              PIC ZZZ9.

       01  PORPT-HEADER.
           05  POR-FUNCTION              PIC X(7).
           05  FILLER                    PIC X(4) VALUE "PO: ".
           05  POR-PO-NUMBER             PIC X(10).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(9)  VALUE "PO DATE: ".
           05  POR-PO-DATE               PIC X(8).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER           PIC X(13) VALUE "VENDOR CODE: ".
           05  POR-VENDOR-CODE           PIC X(10).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER           PIC X(13) VALUE "VENDOR NAME: ".
           05  POR-VENDOR-NAME           PIC X(40).

       01  PORPT-ITEM.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  POR-ITEM-FUNCTION         PIC X(7).
           05  FILLER                    PIC X(7)  VALUE "ITEM: ".
           05  POR-ITEM                  PIC X(4).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(11) VALUE "CORP CODE: ".
           05  POR-CORP-CODE             PIC X(7).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(10) VALUE "QUANTITY: ".
           05  POR-QTY                   PIC -------9.9999.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(8)  VALUE "QTY UM: ".
           05  POR-QTY-UM                PIC X(2).
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE "PRICE: ".
           05  POR-PRICE                 PIC -------9.9999.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(10) VALUE "PRICE UM: ".
           05  POR-PRICE-UM              PIC X(2).

       01  PORPT-DESC.
           05  FILLER                    PIC X(6) VALUE SPACES.
           05  POR-DESC                  PIC X(80).

       01  ERROR-HEADING.
           05  FILLER                    PIC X(5) VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "PAGE".
           05  PAGE-NO-OUT               PIC ZZ9.
           05  FILLER                    PIC X(26) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "ERROR LIST OF ".
           05  PRT-FIL-TYP               PIC X(9) VALUE "PURCHASE ".
           05  FILLER                    PIC X(6)  VALUE "ORDERS".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "PLT-".
           05  PRT-CO                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(32) VALUE SPACES.
           05  FILLER                    PIC X(5)  VALUE "DATE ".
           05  PRT-DATE                  PIC X(8) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  PRT-TIME                  PIC X(8) VALUE SPACES.

       01  ERROR-MSG-LINE.
           05  FILLER                    PIC X(10)  VALUE SPACES.
           05  PRT-RECORD-FUNCTION       PIC X(14)  VALUE SPACES.
           05  FILLER                    PIC X(3)   VALUE SPACES.
           05  ERR-MSG                   PIC X(60)  VALUE SPACES.
           05  FILLER                    PIC X(1)   VALUE SPACES.
           05  PRT-REC-PROCESSED         PIC X(20)  VALUE SPACES.
           05  FILLER                    PIC X(1)   VALUE SPACES.
           05  PRT-ERROR-STARS           PIC X(23)  VALUE ALL "*".

       01  ERROR-RECORD.
           05  FILLER                    PIC X(5)   VALUE SPACES.
           05  PRT-PO-NUM                PIC X(10)  VALUE SPACES.
           05  FILLER                    PIC X(2)   VALUE SPACES.
           05  PRT-ITEM-NUM              PIC X(4)   VALUE SPACES.
           05  FILLER                    PIC X(5)   VALUE SPACES.
           05  FIELDS-IN-ERROR           PIC X(105) VALUE SPACES.
           05  FIELDS-IN-ERROR-R REDEFINES FIELDS-IN-ERROR.
               10  ITEM-LIT              PIC X(20).
               10  ITEM-VALUE            PIC X(15).
               10  ITEM-LIT-2            PIC X(20).
               10  ITEM-VALUE-2          PIC X(15).
               10  ITEM-VALUE-2-9 REDEFINES ITEM-VALUE-2
                                         PIC Z(9)9.9(4).
               10  FILLER                PIC X.
               10  ITEM-LIT-3            PIC X(19).
               10  ITEM-VALUE-3          PIC X(15).
               10  ITEM-VALUE-3-9  REDEFINES ITEM-VALUE-3
                                         PIC Z(9)9.9(4).

       01  DASH-LINE.
           05  DASH                      PIC X(132) VALUE ALL "-".

       01  STAR-LINE.
           05  STAR                      PIC X(132) VALUE ALL "*".

       01  RECORD-COUNTER-MESSAGE.
           05  FILLER                PIC X(14) VALUE "*TOTAL RECORDS".
           05  FILLER                PIC X(13) VALUE " PROCESSED   ".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  TOT-REC-PROCESS           PIC 9(6)  VALUE ZEROS.

       01  RECORD-RECV-MESSAGE.
           05  FILLER                PIC X(14) VALUE "*TOTAL RECORDS".
           05  FILLER                PIC X(15) VALUE " TRANSMITTED   ".
           05  TOTAL-REC-RECV            PIC 9(6)  VALUE ZEROS.

       01  SEQUENCE-NUMBER-MESSAGE.
           05  FILLER                PIC X(13) VALUE "TRANSMISSION ".
           05  FILLER                    PIC X(9)  VALUE "SEQUENCE ".
           05  FILLER                PIC X(12) VALUE "COUNTER WAS ".
           05  PRT-TRANS-SEQ-NO          PIC ZZZ9.

       01  IMAGE-ERR-INSTRUCTION-1.
           05  FILLER    PIC X(21) VALUE " F A T A L  E R R O R".
           05  FILLER    PIC X(22) VALUE "  O C C U R E D  P R O".
           05  FILLER    PIC X(21) VALUE " C E S S I N G  C E A".
           05  FILLER    PIC X(12) VALUE " S E D | | |".

       01  IMAGE-ERR-INSTRUCTION-2.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER    PIC X(15) VALUE "PLEASE CONTACT ".
           05  FILLER    PIC X(18) VALUE "PROGRAMMING STAFF ".
           05  FILLER    PIC X(21) VALUE "*AKRON PO UPDATE PGM*".

       01  ERROR-MSG.
           05  FILLER                    PIC X(5)  VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR OCCURED WHILE ".
           05  FILLER    PIC X(17) VALUE "PROCESSING RECORD".
           05  FILLER                    PIC X(8)  VALUE " NUMBER ".
           05  REC-NO-OUT                PIC 9(6)  VALUE ZEROS.

       01  SEQ-ERROR-LINE.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER            PIC X(14) VALUE "EXPECTED SEQ. ".
           05  FILLER                    PIC X(7)  VALUE "NUMBER ".
           05  PRT-MPLTINFO-PO-SEQ       PIC ZZZ9.
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER            PIC X(14) VALUE "RECEIVED SEQ. ".
           05  FILLER                    PIC X(7)  VALUE "NUMBER ".
           05  PRT-SEND-SEQ              PIC ZZZ9.

       01  BAD-CODE-LINE.
           05  FILLER         PIC X(15) VALUE "CORPORATE CODE ".
           05  BAD-CODE-SAVE             PIC X(7).

       PROCEDURE DIVISION.

       1000-HKEEP SECTION 01.
       1000-HOUSEKEEPING.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
           MOVE SPACES                   TO   PO-HEADER-BUFFER
                                              PO-VENDOR-BUFFER
                                              STR-ITEM-BUFFER
                                              NS-ITEM-BUFFER
                                              DATA-ITEM-BUFFER.

           ACCEPT CUR-DATE FROM DATE.
           IF CUR-DATE-YY > "70"
               MOVE "19"                 TO  CUR-DATE-CC
           ELSE
               MOVE "20"                 TO  CUR-DATE-CC.

           MOVE "Y" TO HANDLE-BLOWUP-FLAG.
           MOVE "N" TO FROM-QUOTE, AKRON-DEFAULT-FLAG,
             UMCF-KELLY-FLAG, EOF-SW.
           MOVE ZERO TO OLD-ORD-QTY-SAVE, ORD-QTY-SAVE,
             LINE-CTR, PAGE-CTR, POR-LINE-CTR, POR-PAGE-CTR,
             RECORD-COUNTER, OLD-BUDGET-AMT, SUB.
           OPEN OUTPUT PRINT-FILE.

           PERFORM 9999-OPENS.

      *------- CHECK FOR EXISTANCE OF THE CIRCULAR ERROR FILE 'DPOERFIL'.
      *------- IF NOT THERE, BUILD IT.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'XXXXXXXXXX'
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "DPOERFIL"    TO CCRTFILE-FILE.
           MOVE "0133"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           SET CIRCULAR-FILE TO TRUE.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DPOERFIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           OPEN INPUT INPUT-PO-FILE
                EXTEND PO-ERROR-FILE.

           MOVE 1                        TO   DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO   PRT-DATE, POR-PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO   PRT-TIME, POR-PRT-TIME.
           PERFORM 7620-POR-HDR.

      *------- MOVE A CONTROL DATE TO THE ERROR REPORT FILE, SO THAT
      *------- "XPRTRPT" CAN PRINT A RANGE OF DATES OF THE PO ERROR RPT
           MOVE SPACES                   TO   PO-ERROR-REC.
           MOVE "*"                      TO   CTL.
           MOVE DATE-YMD-OUT             TO   CONTROL-DATE.
           WRITE PO-ERROR-REC.

      *------ DETERMINE WHETHER WE ARE SUPPOSED TO BE CONCERNED WITH
      *------ CHAT NUMBERS BEING PASSED ON QUOTES.
           MOVE "CHAT"         TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NOT GOOD-CALL
               MOVE "N"        TO  SAVE-CHAT-SW
           ELSE
           MOVE MPLTINFO-CHAT-PURCH-REQUIRED TO SAVE-CHAT-SW.

      *------ FIND OUT IF WE'RE SPOSED TO OVERLAY THE PO ACCT DATA WITH THE
      *------ REQUISITION ACCT DATA.  THE DEFAULT IS 'YES'.
           MOVE "POPT"         TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
               MOVE "ERR IN 1000-H GETKEY MPLTINFO" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
           IF MPLTINFO-LOADPO-REQACCT-SW = "N"
               MOVE "N"                  TO   LOADPO-REQACCT-SW
           ELSE
               MOVE "Y"                  TO   LOADPO-REQACCT-SW.
           MOVE MPLTINFO-CUR-CODE-REQUIRED-SW TO CUR-CODE-REQUIRED-SW.
           MOVE MPLTINFO-LOADPO-VEN      TO   LOADPO-VEN.

      *------ JCW 'AKRONPO' TELLS US IF WE DEFAULT CERTAIN DATA FROM
      *------ AKRON GENERATED PO'S:
      *------      BUYER CODE    - 'AKRN'         - AKRONPO
      *------      CURRENCY CODE - '01' (DOLLARS) - AKRONPO & CUR CODE REQUIRED
      *------      BUDGET AMOUNT - '1'            - AKRONPO & ZERO PASSED
      *------      TAX CODE      - 'NO'           - ALWAYS DEFAULTED
      *------      TYPIST        - 'AKR'          - ALWAYS DEFAULTED
           MOVE "AKRON           "  TO JCW-NAME.
           MOVE 286                 TO JCW-STARTING-POS.
           MOVE 1                   TO JCW-LENGTH.
           CALL "CFINDJCW" USING JCW-PARMS.
           MOVE JCW-YES-NO          TO AKRON-DEFAULT-FLAG.

DCR01 *---------------------------------------------------------------
DCR01      SET  Z000-POLG-ACTIVE-NO  TO TRUE.
DCR01      MOVE WS-Z000-POLG-KEY  TO PLT-ARG.
DCR01      PERFORM 9999-GETKEY-MPLTINFO-PK-I.
DCR01      IF  FILE-STATUS = "00"
DCR01          IF  PLTINFODTA OF MPLTINFO-PK-REC-I(1:1) = "Y"
DCR01              SET  Z000-POLG-ACTIVE-YES TO TRUE
DCR01          END-IF
DCR01      END-IF.
DCR01 *---------------------------------------------------------------

           MOVE "P 01"         TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
               MOVE "ERR IN 1000-H GETKEY MPLTINFO" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE MPLTINFO-COMPANY TO  PRT-CO, PRT-PLT-1, COMPANY-SAVE.
DCR01      MOVE MPLTINFO-COMPANY TO  WS-Z000-PLANT-CODE.



      *------- MIXCTR HAS SAME PLANT CODE AS PLANT 1, BUT DIFF TERR
      *------- USE THIS FOR DIFFERENT HEADER
           IF MPLTINFO-COMPANY = "111"
               IF MPLTINFO-TERR = "0070"
                   MOVE "11M"            TO   PRT-CO.

      *------- FOR AKRON, DETERMINE IF IT IS A BLANKET FILE SO WE CAN
      *------- SHOW THAT ON THE HEADER OF THE REPORT
           IF AKRON-PLANT
               OPEN INPUT DPORECDH-I
               PERFORM 7670-FIND-HEADER-LABEL THRU 7675-FHL-X
               IF EOF-SW = "Y"
                   GO TO 2000-EOJ
               ELSE
                   PERFORM 7680-READ-INPUT-PO-FILE
                   IF EOF-SW = "Y"
                       GO TO 2000-EOJ
                   ELSE
                       CLOSE INPUT-PO-FILE
                       OPEN INPUT INPUT-PO-FILE
                       IF PO-RLSE-8-10 = "999"
                           MOVE "BLANKET" TO  PRT-FIL-TYP.

           PERFORM 7610-PAGE-HDR.
           MOVE 1              TO  LINE-CTR.
           GO TO 6000-FIND-HEADER-LABEL.

       2000-EOJ.
           MOVE RECORD-RECV-MESSAGE   TO  PO-ERROR-LINE.
           MOVE 3  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE RECORD-COUNTER          TO  TOT-REC-PROCESS.
           MOVE RECORD-COUNTER-MESSAGE  TO  PO-ERROR-LINE.
           MOVE 1  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           CLOSE INPUT-PO-FILE, PO-ERROR-FILE, PRINT-FILE.
       2005-DBCLOSE.
           PERFORM 9999-CLOSES.
           GOBACK.

       2100-BLOWUP.
           MOVE SAVE-PARA-NO             TO   BU-DISPLAY-PARA.

      *------ FOR HP ONLY ------*
      *    CALL "DBEXPLAIN" USING STATUS-AREA.
      *------ FOR HP ONLY ------*

           IF LINE-CTR = 0  AND  PAGE-CTR = 0
               PERFORM 7610-PAGE-HDR.
           MOVE STAR-LINE            TO PO-ERROR-LINE.
           MOVE 2  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE 1  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE IMAGE-ERR-INSTRUCTION-1  TO   PO-ERROR-LINE.
           MOVE 3  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE IMAGE-ERR-INSTRUCTION-2  TO   PO-ERROR-LINE.
           MOVE 2  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE RECORD-COUNTER           TO   REC-NO-OUT.
           MOVE ERROR-MSG                TO   PO-ERROR-LINE.
           MOVE 2  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE 1  TO  CTL.
           MOVE SEQ-ERROR-LINE           TO   PO-ERROR-LINE.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE INPUT-PO-REC             TO   PO-ERROR-LINE.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE BU-DISPLAY-MSG           TO   PO-ERROR-LINE.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE STAR-LINE                TO   PO-ERROR-LINE.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE 1  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           PERFORM 2000-EOJ.
           MOVE RECORD-COUNTER           TO   BU-DISPLAY-FLD9 (1).
           MOVE PO-ARG                   TO   BU-DISPLAY-FLD (1).
           MOVE IN-PO-REQ-NUM            TO   BU-DISPLAY-FLD (2).
           MOVE IN-VENDOR-CODE           TO   BU-DISPLAY-FLD (3).
           MOVE IN-CORP-CODE             TO   BU-DISPLAY-FLD (4).
           MOVE IN-ITM-NUM               TO   BU-DISPLAY-FLD (5).
           MOVE "TLOADPO"                TO   BU-PGM-NAME.
           IF BU-DISPLAY-MSG-1 = SPACES
               MOVE ERROR-MSG            TO   BU-DISPLAY-MSG.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       6000-FIND-HEADER-LABEL.
           MOVE 1                        TO   SAVE-PARA-NO.
           PERFORM 7670-FIND-HEADER-LABEL THRU 7675-FHL-X.
           IF EOF-SW = "Y"
               PERFORM 6850-BLANKET-HEADER-CLEANUP THRU 6870-BHC-X
               GO TO 2000-EOJ.

           IF SEND-SEQ NUMERIC
               MOVE SEND-SEQ             TO   PRT-TRANS-SEQ-NO
           ELSE
               MOVE ZERO                 TO   PRT-TRANS-SEQ-NO.

           ADD 1                         TO   RECORD-COUNTER.

       6012-CHECK-SEQ-NO.
      *------- SEQ# CURRENTLY NOT CHECKED ON KELLY-ONLY DELETE FILES
           IF HEADER-LABEL = "PURCHASE DELETE"
               GO TO 6010-READ-RECORD.

      *----------  SKIP CHECK FOR SEQ# IF CREATING PO FROM QUOTE
           MOVE "JCWQT           "  TO JCW-NAME.
           MOVE 290                 TO JCW-STARTING-POS.
           MOVE 1                   TO JCW-LENGTH.
           CALL "CFINDJCW" USING JCW-PARMS.
           MOVE JCW-YES-NO          TO FROM-QUOTE.

      *------- IF POSQ KEY EXISTS, SEQ# IS CHECKED.
      *------- IF POSQ KEY DOESN'T EXIST, THAT PLANT IS NOT CHECKING
      *------- SEQUENCE NUMBER (CURRENTLY ONLY KELLY CHECKS SEQ).
           MOVE "POSQ" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NO-ENTRY
             GO TO 6010-READ-RECORD
           ELSE
             DISPLAY "LOADPO FILE EXPECTED WAS    ", MPLTINFO-PO-SEQ
             DISPLAY "LOADPO FILE NUMBER SENT WAS ", SEND-SEQ.

           MOVE SEND-SEQ             TO   PRT-SEND-SEQ.
           MOVE MPLTINFO-PO-SEQ      TO   PRT-MPLTINFO-PO-SEQ.
           IF SEND-SEQ NOT = MPLTINFO-PO-SEQ
               MOVE "* SEQUENCE NUMBER ERROR *"  TO  ERROR-MSG
               MOVE MPLTINFO-PO-SEQ      TO   BU-DISPLAY-FLD9 (2)
               MOVE SEND-SEQ             TO   CONVERT-NUM
               MOVE CONVERT-NUM          TO   BU-DISPLAY-FLD9 (3)
               PERFORM 2100-BLOWUP.

           MOVE "MPLTINFO;"              TO   DSET-NAME.

           ADD 1                         TO   MPLTINFO-PO-SEQ.
           PERFORM 9999-UPDATE-MPLTINFO-PK-O.

      ****************************************************
      *  WHEN EOF IS REACHED CHECK TO SEE IF AT LEAST    *
      *  ONE BLANKET WAS PROCESSED (RLSE="999";AT-LEAST- *
      *  ONE-BLKT-SW="Y"). IF SO THEN PERFORM THE        *
      *  BLANKET HEADER CLEAN UP PROCEDURE.  THIS IS     *
      *  DONE BECAUSE ALL BLANKETS ARE PROCESSED IN      *
      *  EVERY AKRON DATA BASE AND IF A CODE(S) DOES NOT *
      *  EXIST THERE IS THE POSSIBILTY THAT A HEADER     *
      *  WILL BE IN A DATA BASE WITH NO ITEMS THEREFORE  *
      *  THIS PROC. CLEANS UP THESE 'BARE' HEADERS       *
      ****************************************************

       6009-READ SECTION 02.
       6010-READ-RECORD.
           MOVE 2                        TO   SAVE-PARA-NO.
           MOVE SPACES                   TO   ERR-SW.

           READ INPUT-PO-FILE AT END
               MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE "Y"                  TO  EOF-SW
               PERFORM 6850-BLANKET-HEADER-CLEANUP THRU 6870-BHC-X
               GO TO 2000-EOJ
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERR INPUT-PO-FILE" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE INPUT-PO-REC          TO  FILE-HEADER-LABEL.

           IF PO-TRANS = "A"
               NEXT SENTENCE
           ELSE
           MOVE PO-NUM-1-7            TO  PO-NUM
           MOVE PO-RLSE-8-10          TO  PO-REL
           MOVE ZEROS                 TO  PO-RECV.

           IF TRAILER-LABEL  =  "END PURCHASE "
               IF TRAILER-LABEL-CTR-X NUMERIC
                   ADD 1  TO  RECORD-COUNTER
                   ADD TRAILER-LABEL-CTR   TO  TOTAL-REC-RECV
                   GO TO 6000-FIND-HEADER-LABEL
               ELSE
                   ADD 1  TO RECORD-COUNTER
                   GO TO 6000-FIND-HEADER-LABEL.

           ADD 1                      TO  RECORD-COUNTER.
      ******************************************
      *     BLANKET ORDERS ARE PROCESSED       *
      *     AT-LEAST-ONE-BLKT-SW IS SET TO 'Y' *
      *     WHEN A BLANKET IS FOUND SO THAT    *
      *     THE HEADER CLEAN UP LOGIC IS       *
      *     EXECUTED                           *
      *     SEE (6010-READ-RECORD)             *
      ******************************************

           IF PO-REL  = "999"
               MOVE "Y"     TO  BLANKET-SW, AT-LEAST-ONE-BLKT-SW
           ELSE
               MOVE SPACES  TO  BLANKET-SW.

       6020-CHECK-FOR-PO-NUM.
      *------- CHECK CHARACTERS 1-7 ONLY IN CASE THE RELEASE NUMBER IS
      *------- FILLED IN.
      **** IF PO-INPUT-NUM = SPACES
           IF PO-NUM-1-7 = SPACES
               GO TO 6010-READ-RECORD.

      *****************************************************************
      **                                                             **
      **           C O N T R O L   S E C T I O N                     **
      **                                                             **
      *****************************************************************
       6030-CHECK-TRANS.
      *    DISPLAY "PROCESSING RECORD NUMBER ", RECORD-COUNTER,
      *      " PO ", PO-INPUT-NUM.
      *    DISPLAY INPUT-PO-REC.
           MOVE 3                        TO   SAVE-PARA-NO.
           MOVE BUILD-PO                 TO   PO-ARG.
      *DISPLAY "****************** PROCESSING TRANS ", PO-TRANS,
      *  " FOR PO ", PO-INPUT-NUM, " ***********************".

           IF PO-DEL-FLAG = "D"
               IF PO-TRANS = "1"
                   MOVE "DH-DELETE HEADER"    TO   RECORD-FUNCTION-D
                   PERFORM 6295-DELETE-PO THRU 6299-DP-X
               ELSE
               IF PO-TRANS = "3" OR PO-TRANS = "4"
                   MOVE "DI-DELETE ITEM"      TO   RECORD-FUNCTION-D
                   PERFORM 7010-MOVE-PO-ITEM-RECORD
                   MOVE IN-ITM-NUM       TO   ITEM-TO-SEARCH-FOR
                   PERFORM 7120-GET-ITEM
                   IF GOOD-CALL
                     IF IN-ITM-CONTAINER-INDIC = SPACES
                       PERFORM 6500-DELETE-ITEM THRU 6590-DI-X
                     ELSE
      *                DELETE OF CONTAINER ACTUALLY REMOVES C INDIC
                       PERFORM 6400-MOD-ITEM THRU 6490-MI-X
                     END-IF
                   END-IF
               ELSE
               IF PO-TRANS = "5"
                   MOVE "DD-DELETE DESC"      TO   RECORD-FUNCTION-D
                   PERFORM 7025-MOVE-PO-DATAITEM-RECORD
                   PERFORM 7130-GET-DATA-ITEM
                   IF GOOD-CALL
                     PERFORM 6625-DELETE-DATA-ITEM
                   END-IF
               ELSE
                   GO TO 6010-READ-RECORD
           ELSE
           IF PO-TRANS = "1"
               MOVE 0                    TO   TRAILER-SW
               MOVE "AH-ADD HEADER"      TO   RECORD-FUNCTION-D
               PERFORM 7000-MOVE-PO-HEADER-RECORD
      *--------- IF THIS IS AN AKRON PLANT, CHECK TO SEE IF THE PO
      *--------- EXISTS IN HISTORY.
               IF AKRON-PLANT
                   PERFORM 6040-CHECK-HISTORY
               END-IF
               IF PO-IN-HIST-SW = "Y"
                   MOVE
                   "*PO EXISTS IN HISTORY DATABASE*12*"
                                         TO   ERR-MSG
                   MOVE "            PO DATE" TO ITEM-LIT-2
                   MOVE BUILD-PO-DATE    TO   ITEM-VALUE-2
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
               ELSE
               MOVE PO-NUM-REL           TO   SAVE-PO-NUM-REL
               MOVE SPACES               TO   PO-INPUT-NUM
               PERFORM 6010-READ-RECORD UNTIL PO-INPUT-NUM > SPACES
               OR EOF-SW = "Y"
               IF PO-TRANS = "2"
                   IF BUILD-PO NOT = PO-ARG
                       MOVE
                       "*PO NO. NOT EQUAL ON PO HEADER RECORDS*11*"
                                         TO   ERR-MSG
                       MOVE "1ST RECORD PO #"   TO ITEM-LIT
                       MOVE SAVE-PO-NUM-REL     TO ITEM-VALUE
                       MOVE "2ND RECORD PO #"   TO ITEM-LIT-2
                       MOVE PO-NUM-REL          TO ITEM-VALUE-2
                       MOVE "Y"          TO   ERR-SW
                       PERFORM 7600-WRITE-REPORT-LINE
                   ELSE
                       PERFORM 7005-MOVE-PO-VENDOR-RECORD
                       PERFORM 9999-GETKEY-MPORCV-PO-I
                       IF NOT GOOD-CALL
                           PERFORM 6100-ADD-HEADER THRU 6190-AH-X
                       ELSE
                           PERFORM 7110-GET-HEADER
                           IF END-OF-CHAIN
      *                        *** THIS SHOULD NEVER HAPPEN, COULD BE
      *                        *** DUE TO BLOWUP.  FIX IT UP - AVOIDS
      *                        *** HAVING TO GO INTO QUERY.
                               PERFORM 6100-ADD-HEADER THRU 6190-AH-X
                           ELSE
                               MOVE "MH-MODIFY HEADER"
                                         TO   RECORD-FUNCTION-D
                               PERFORM 6200-MOD-HEADER THRU 6290-MH-X
               ELSE
                   MOVE
                   "*MISSING VENDOR INFO FOR PO *10*"
                                                  TO ERR-MSG
                   MOVE PO-NUM-REL                TO SAVE-PO-NUM-REL-2
                   MOVE SAVE-PO-NUM-REL           TO PO-NUM-REL
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
                   MOVE SAVE-PO-NUM-REL-2         TO PO-NUM-REL
                   GO TO 6020-CHECK-FOR-PO-NUM
           ELSE
           IF PO-TRANS = "3" OR "4"
               MOVE "AI-ADD ITEM"        TO   RECORD-FUNCTION-D
               MOVE "N"                  TO   ADD-2-SW
               PERFORM 7010-MOVE-PO-ITEM-RECORD
               PERFORM 7110-GET-HEADER
               IF END-OF-CHAIN
                   PERFORM 7210-NO-PO-ERROR
               ELSE
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE IN-ITM-NUM       TO   ITEM-TO-SEARCH-FOR
                   PERFORM 7120-GET-ITEM
JB                 IF NO-ENTRY
                       IF IN-ITM-CONTAINER-INDIC NOT = SPACES
                           PERFORM 7220-CONTAINER-ERROR
                       ELSE
                           PERFORM 6300-ADD-ITEM THRU 6390-AI-X
                   ELSE
                       MOVE "MI-MODIFY ITEM" TO RECORD-FUNCTION-D
                       PERFORM 6400-MOD-ITEM THRU 6490-MI-X
           ELSE
           IF PO-TRANS = "5"
               MOVE "AD-ADD DESC"        TO   RECORD-FUNCTION-D
               PERFORM 7025-MOVE-PO-DATAITEM-RECORD
      *------- FOR AKRON-PO ITEM DESC LINE#S PASSED START WITH 00.
      *------- KELLY STARTS WITH 01. SINCE 00 WAS USED FOR OTHER INFO,
      *------- ADD 1 TO PASSED LINE#, IF IT WRAPS AROUND, SKIP IT.
               PERFORM 7660-ADD-TO-DESC-LINE-NO
               IF IN-DATA-LINE-NUMBER-9 = 0
                   NEXT SENTENCE
               ELSE
                   PERFORM 7110-GET-HEADER
                   IF END-OF-CHAIN
                       PERFORM 7210-NO-PO-ERROR
                   ELSE
                       PERFORM 9999-RESET-DPORECD-PO-O
                       MOVE IN-DATA-ITM-NUMBER TO  ITEM-TO-SEARCH-FOR
                       PERFORM 7120-GET-ITEM
                       IF NOT GOOD-CALL
                           PERFORM 7215-NO-ITEM-ERROR
                       ELSE
      *                    ***NOTE: ALL DESC FOR ITEM WILL BE DELETED
      *                    ***AS EACH ITEM IS ENCOUNTERED
                           PERFORM 9999-RESET-DPOITEM-PO-O
                           PERFORM 6600-ADD-DATA-ITEM THRU 6610-ADI-X
           ELSE
           IF PO-TRANS = "6" AND MEXICO-PLANT
               MOVE PO-REC TO MEXICO-DATA-BUFFER
               PERFORM 7110-GET-HEADER
               IF END-OF-CHAIN
                   PERFORM 7210-NO-PO-ERROR
               ELSE
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE IN-MEXICO-ITEM   TO   ITEM-TO-SEARCH-FOR
                   PERFORM 7120-GET-ITEM
JB                 IF NO-ENTRY
                       PERFORM 7225-NO-ITEM-ERROR
                   ELSE
                       MOVE "MI-MODIFY ITEM" TO RECORD-FUNCTION-D
                       PERFORM 6400-MOD-MEX-ITEM THRU 6490-MMI-X
           ELSE
           IF PO-TRANS = "A"
               MOVE PO-REC-A             TO   PO-TRAILER-COMMENTS
               PERFORM 6900-PROCESS-TRAILER-COMMENTS THRU 6900-PTC-X
           ELSE
           IF PO-TRANS = "6" OR "7" OR "8"
               GO TO 6010-READ-RECORD.

           GO TO 6010-READ-RECORD.

       6040-CHECK-HISTORY.
           MOVE PO-NUM-REL               TO  POH-NUM-REL.
           MOVE PO-RECV                  TO  POH-RCV.
           MOVE "N"                      TO  PO-IN-HIST-SW.
           PERFORM 9999-START-DPORECDH-I.
           IF FILE-STATUS = "00"
               PERFORM 9999-READ-NEXT-DPORECDH-I
               PERFORM  UNTIL POH-RCV-NO (1:10) NOT = PO-INPUT-NUM
                          OR  FILE-STATUS NOT = "00"
                          OR  PO-IN-HIST-SW = "Y"
                   MOVE IN-PO-DATE-MM    TO  BUILD-PO-DATE-MM
                   MOVE IN-PO-DATE-DD    TO  BUILD-PO-DATE-DD
                   MOVE IN-PO-DATE-YY    TO  BUILD-PO-DATE-YY
                   IF BUILD-PO-DATE-YY = "  "
                       MOVE "  "         TO  BUILD-PO-DATE-CC
                   END-IF
                   IF BUILD-PO-DATE-YY > "  "
                       IF BUILD-PO-DATE-YY > "70"
                           MOVE "19"     TO  BUILD-PO-DATE-CC
                       ELSE
                           MOVE "20"     TO  BUILD-PO-DATE-CC
                       END-IF
                   END-IF
                   MOVE POH-DATE         TO  TEMP-DATE-9
                   IF BUILD-PO-DATE-CN = TEMP-DATE
                       MOVE "Y"          TO  PO-IN-HIST-SW
                   ELSE
                       PERFORM 9999-READ-NEXT-DPORECDH-I
                   END-IF
               END-PERFORM.

      *****************************************************
      **                                                 **
      **             ADD PO HEADER                       **
      **                                                 **
      *****************************************************
       6100-ADD-HEADER.
           MOVE 4                        TO   SAVE-PARA-NO.
           MOVE SPACES                   TO   DUPLICATE-PO-NO.
           MOVE SPACES                   TO   BUF-DPORECD.
           MOVE 0                        TO   PO-BUDGET-AMT.
           MOVE BUILD-PO                 TO   PO-RCV-NO.
DCR01      MOVE PO-RCV-NO                TO   WS-Z000-PORCVNO.

           MOVE "ADD"                    TO   POR-FUNCTION.
           PERFORM 7622-HDR-PRINT.

           PERFORM 7300-EDIT-MOVE-PO-HEADER THRU 7320-EMPH-X.
           IF ERR-SW = "Y"
               GO TO 6190-AH-X.

      *------- ADD VENDOR IF REQUIRED, OR UPDATE VENDOR NAME
           MOVE IN-VENDOR-CODE           TO   VEN-ARG.
           PERFORM 7587-CHECK-NEW-VENDOR.
           IF END-OF-CHAIN
BG001 *        IF AKRON-PLANT OR KELLY-PLANT
                   PERFORM 7500-ADD-DVENDOR
BG001 *        ELSE
BG001 *            PERFORM 7505-ADD-TEMP-DVENDOR
           ELSE
           IF AKRON-PLANT OR KELLY-PLANT
               PERFORM 7580-CHECK-NEW-VEN-NAME THRU 7583-CNVN-X.

      ************************************************
      **   MOVE 'B000' TO                           **
      **   PO-RCV-STAT TO SIGNIFY A BLANKET IN      **
      **   CSIS AS WE DO IN SUB PLANTS              **
      ************************************************

           MOVE 6                        TO   SAVE-PARA-NO.
           MOVE IN-PO-BUDGET-NUMBER      TO   PO-BUDGET-NUMBER.
           MOVE IN-VENDOR-CODE           TO   PO-VEN-CODE.
           MOVE SPACES                   TO   BUF-MPORCV.
           MOVE BUILD-PO                 TO   M-PO-RCV-NO.
           IF BLANKET-SW  =  "Y"
               MOVE "B000"               TO   M-PO-RCV-STAT
               IF IN-LAST-RELEASE-X NUMERIC
                   MOVE IN-LAST-RELEASE  TO   M-PO-LAST-RLSE
               END-IF
           ELSE
               MOVE SPACES               TO   M-PO-RCV-STAT.
           MOVE "MPORCV;"                TO   DSET-NAME.
      *------- IF ADDING ON A BAD PO WITH NO HEADER, THE MPORCV WILL
      *------- ALREADY BE THERE.
           MOVE PO-RCV-NO TO PO-ARG.
           PERFORM 9999-GETKEY-MPORCV-PO-I.
           IF NO-ENTRY
             PERFORM 9999-PUT-MPORCV-PO-O
           END-IF.
           MOVE "DPORECD;"               TO   DSET-NAME.
           PERFORM 9999-PUT-DPORECD-PO-O.


DCR01 *--------------------------------------------------------------
DCR01      IF  Z000-POLG-ACTIVE-YES
DCR01          PERFORM L000-LOG-ADD          THRU L000-ADD-EXIT
DCR01      END-IF.
DCR01 *--------------------------------------------------------------


       6140-BUILD-DDAILYTC-360.
           MOVE "360"  TO  TC-TYPE-SAVE.
           IF LOAD-SW NOT = "Y"
              PERFORM 7700-BUILD-DDAILYTC-PO.

       6190-AH-X.
           EXIT.

      ****************************************************
      **                                                **
      **           MODIFY PO HEADER                     **
      **                                                **
      ****************************************************

       6200-MOD-HEADER.
           MOVE 7                        TO   SAVE-PARA-NO.
           MOVE "DPORECD;"               TO   DSET-NAME.

           MOVE "MODIFY"                 TO   POR-FUNCTION.
           PERFORM 7622-HDR-PRINT.

DCR01      MOVE BUILD-PO                 TO   WS-Z000-PORCVNO.

           PERFORM 7300-EDIT-MOVE-PO-HEADER THRU 7320-EMPH-X.
           IF ERR-SW = "Y"
               GO TO 6280-RESET-DPORECD.

           MOVE SPACES                   TO   VEN-CHANGE-SW.
           IF IN-VENDOR-CODE  NOT = PO-VEN-CODE
             MOVE "Y"             TO VEN-CHANGE-SW
             PERFORM 9999-UPDATE-DPORECD-PO-O
             PERFORM 7510-VENDOR-CHANGE THRU 7520-VC-X
             PERFORM 9999-CHAINHD-DPORECD-PO-O
             PERFORM 9999-GETNEXT-DPORECD-PO-O
             PERFORM 9999-DELETE-DPORECD-PO-O
             MOVE IN-VENDOR-CODE   TO  PO-VEN-CODE
             PERFORM 9999-PUT-DPORECD-PO-O
           ELSE
             PERFORM 9999-UPDATE-DPORECD-PO-O
           END-IF.

      *------- FOR AKRON, IF VENDOR CODE DIDN'T CHANGE, UPDATE THE
      *------- VENDOR NAME IF IT CHANGED.  FOR KELLY, UPDATE VENDOR
      *------- NAME AND 2 VENDOR ADDRESS LINES IF THEY CHANGED.
           IF VEN-CHANGE-SW NOT = "Y"
               IF AKRON-PLANT OR KELLY-PLANT
                   PERFORM 7587-CHECK-NEW-VENDOR
                   IF END-OF-CHAIN
                       PERFORM 7500-ADD-DVENDOR
                   ELSE
                       PERFORM 7580-CHECK-NEW-VEN-NAME THRU 7583-CNVN-X.

DCR01 *--------------------------------------------------------------
DCR01      IF  Z000-POLG-ACTIVE-YES
DCR01          PERFORM L000-LOG-UPD          THRU L000-UPD-EXIT
DCR01      END-IF.
DCR01 *--------------------------------------------------------------


       6225-BUILD-DDAILYTC-361.
           MOVE 8                        TO   SAVE-PARA-NO.
           MOVE "361"                    TO   TC-TYPE-SAVE.
           IF LOAD-SW NOT = "Y"
              PERFORM 7700-BUILD-DDAILYTC-PO.

       6280-RESET-DPORECD.
           PERFORM 9999-RESET-DPORECD-PO-O.

       6290-MH-X.
           EXIT.

      ****************************************************
      **                                                **
      **   DELETE AN ENTIRE PO                          **
      **                                                **
      ****************************************************

       6295-DELETE-PO.
           MOVE "DELETE"                 TO   POR-FUNCTION.
           MOVE 9                        TO   SAVE-PARA-NO.
           MOVE "N" TO ERR-SW.
           PERFORM 9999-CHAINHD-DPOITEM-PO-O.
           PERFORM 9999-GETNEXT-DPOITEM-PO-O.
           IF END-OF-CHAIN
               MOVE "Y" TO ERR-SW
           ELSE
               MOVE "N" TO ERR-SW
           END-IF.
      *------SKIP PO COMPLETE EDITS FOR KELLY PLANTS (1/21/97)
           IF NOT KELLY-PLANT
             PERFORM UNTIL END-OF-CHAIN OR ERR-SW EQUAL "Y"

             IF ITM-CORP-CODE NOT EQUAL "NON-STR"
               IF ITM-QTY-DLVR < ITM-QTY-ORD AND
                  ITM-COMPLETE-FLAG = SPACES
                  MOVE 0 TO DELETE-IT
                  PERFORM 6298-SET-DELETE-IT
                  IF DELETE-IT > 0
                      NEXT SENTENCE
                  ELSE
                  PERFORM 9999-RESET-DPOITEM-PO-O
                  MOVE "*CODED ITEM NOT COMPLETED CAN'T DELETE*13*"
                      TO ERR-MSG
                  MOVE "QTY ORDERED"    TO   ITEM-LIT-2
                  MOVE ITM-QTY-ORD      TO   ITEM-VALUE-2-9
                  MOVE "QTY DELIVERED"  TO   ITEM-LIT-3
                  MOVE ITM-QTY-DLVR     TO   ITEM-VALUE-3-9
                  MOVE "Y"              TO   ERR-SW
                  PERFORM 7600-WRITE-REPORT-LINE
               ELSE
                 IF ITM-QTY-STORED < ITM-QTY-DLVR

                   PERFORM 9999-RESET-DPOITEM-PO-O
                   MOVE "*CODED ITEM NOT COMPLETED CAN'T DELETE*14*"
                     TO ERR-MSG
                   MOVE "QTY DELIVERED"  TO   ITEM-LIT-2
                   MOVE ITM-QTY-DLVR     TO   ITEM-VALUE-2-9
                   MOVE "QTY STORED"     TO   ITEM-LIT-3
                   MOVE ITM-QTY-STORED   TO   ITEM-VALUE-3-9
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE

                 END-IF
               END-IF
             END-IF
             IF ERR-SW EQUAL "N"
               PERFORM 9999-GETNEXT-DPOITEM-PO-O
             END-IF
             END-PERFORM
           ELSE
               PERFORM 9999-RESET-DPOITEM-PO-O
           END-IF.

      *
      * IF THE PO WAS FOUND AND WAS COMPLETED THEN DELETE IT
      *
           IF ERR-SW EQUAL "N"
DCR01        MOVE BUILD-PO              TO   WS-Z000-PORCVNO
             CALL "SDELTPO" USING BASE,
                                  PO-ARG,
                                  COMPANY-SAVE
DCR01 *--------------------------------------------------------------
DCR01         IF  Z000-POLG-ACTIVE-YES
DCR01             PERFORM L000-LOG-DEL     THRU L000-DEL-EXIT
DCR01         END-IF
DCR01 *--------------------------------------------------------------
           END-IF.

       6299-DP-X.
           EXIT.

      *----- MOVED OUTSIDE OF 6295-DELETE-PO LOOP.
       6298-SET-DELETE-IT.
           IF COMPANY-SAVE = "112"
               IF ITM-QTY-ORD > ZEROES
                   IF ITM-QTY-DLVR = ZEROES
                       MOVE 1 TO DELETE-IT.

      *    ADDED THE ABOVE PARAGRAPH 8/15/94 PER A CONVERSATION WITH
      *    KEN BARR. THE TECH CENTER UNCONDITIONALLY WANTS THE P.O.
      *    DELETED IF CORPORATE ISSUES A DELETE FOR IT REGARDLESS OF
      *    WHETHER THE ITEMS HAVE BEEN RECEIVED OR NOT.

      **************************************************************
      **                                                          **
      **                  ADD PO ITEM                             **
      **                                                          **
      **************************************************************
       6300-ADD-ITEM.
           MOVE "ADD"                    TO   POR-ITEM-FUNCTION.
           PERFORM 7624-ITEM-PRINT.
           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 7626-DESC-PRINT.

           MOVE 12                       TO   SAVE-PARA-NO.
           MOVE SPACES                   TO   BAD-CODE-SW
                                              SAVE-ITM-TAX-CODE.
           PERFORM 7350-EDIT-ITEM THRU 7360-EI-X.
           IF ERR-SW = "Y"
               DISPLAY IN-CORP-CODE " DID NOT PASS 7350 EDITS"
               GO TO 6390-AI-X.

           MOVE SPACES              TO  BUF-DPOITEM.

      *------- ON ADD ITEM, IF CORP CODE NOT EXIST, WILL ADD THE
      *------- ITEM AS NON-STOREROOM, AND PUT A COMMENT LINE WITH CODE
           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 6640-CHECK-CORP-CODE
               IF ERR-SW  =  "Y"
                   DISPLAY IN-CORP-CODE " DID NOT PASS 6640-CODE CHK"
                   GO TO 6390-AI-X
               ELSE
               IF NO-ENTRY
                   MOVE "Y"              TO   BAD-CODE-SW
                   MOVE IN-CORP-CODE     TO   BAD-CODE-SAVE
                   MOVE "NON-STR"        TO   IN-CORP-CODE.

      *************************************************
      *   IF THE ITEM IS GOING TO BE ADDED TO A       *
      *   BLANKET CHECK TO BE SURE THAT THE ITEM WAS  *
      *   WAS NOT FLAGGED FOR STOCK OUT IN WHICH CASE *
      *   THE ITEM IS NOT LINKED TO THE BLANKET.      *
      *************************************************
           IF PO-REL  = "999"
               IF STR-STOCK-OT = "X"
                   DISPLAY IN-CORP-CODE " IS IN STOCK OUT STATUS"
                   GO TO 6390-AI-X.

           PERFORM 7370-EDIT-STR-ITM THRU 7380-ESI-X.
           IF ERR-SW = "Y"
               DISPLAY IN-CORP-CODE " DID NOT PASS 7370 EDITS"
               GO TO 6390-AI-X.

      *------- 'SPOMSTRM' IS CALLED TO UPDATE MSTORERM LAST PO, LAST
      *------- VENDOR, AND MKT COST.  ALSO CALC QTY & PRICE IN STR UM.
           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 6650-UPDATE-STR-MKT-COST.

      *------- BUILD UP AND PUT DPOITEM ENTRY FOR THE PO ITEM
           MOVE 13                       TO   SAVE-PARA-NO.
           MOVE IN-CORP-CODE             TO   ITM-CORP-CODE.
           MOVE IN-ITM-NUM-9             TO   ITM-NUMBER.
           MOVE ZEROS                    TO   ITM-QTY-DLVR
                                              ITM-QTY-STORED
                                              ITM-QTY-PAID
                                              ITM-WT
                                              ITM-KELLY-PO-QTY
                                              ITM-ZBILL-VALUE
                                              ITM-ASN-QTY.
           MOVE "NO"                     TO   ITM-TAX-CODE.
           IF FROM-QUOTE = "Y"
               IF SAVE-ITM-TAX-CODE = "  "
                   NEXT SENTENCE
               ELSE
               MOVE SAVE-ITM-TAX-CODE    TO   ITM-TAX-CODE.

           PERFORM 7090-MOVE-ITEM-DATA.

           MOVE BUILD-PO                TO  ITM-PO-RCV-NO.

      *******************************************
      *  IF THE ITEM IS A BLANKET ZERO OUT QTY  *
      *  IN CASE A NON ZERO QTY WAS PASSED.     *
      *******************************************

           IF BLANKET-SW  =  "Y"
               MOVE ZEROS            TO  ITM-QTY-ORD.

      *------- CREATE 320 AND 322 TRANSACTIONS
           MOVE SPACES                   TO   STC320-PARMS.
           MOVE ZEROS                    TO   STC320-OLD-BUDGET-AMT.
           MOVE "20"                     TO   STC320-ITEM-TC-ID.
           IF LOAD-SW NOT = "Y"
              PERFORM 7720-BUILD-DDAILYTC-ITM   THRU 7730-BDI-X.

      *------- "SVENPRC" SUBROUTINE WILL ADD DVENDITM SEGMENT
      *------- IF NOT ALREADY THERE, IF THERE IT WILL UPDATE IT
           IF ITM-CORP-CODE NOT = "NON-STR"
               PERFORM 6660-UPDATE-VENDOR-PRICE
               PERFORM 63900-CHECK-4-CHAT-NO THRU 63900-C4CN-X.

      *------- ADD NEW LINK IF NEEDED
           IF BLANKET-SW NOT = "Y" AND
              HOLD-REQ-NO NOT = SPACES
               PERFORM 6740-PROCESS-REQ-NO  THRU  6760-PRN-X.

      *------ WE WAIT TILL HERE TO PUT THE PO ITEM BECAUSE IF THE REQ
      *------ EXISTS, WE TAKE THE ACCOUNTING DATA FROM REQ.
           IF FOUND-REQ-FLAG = "Y" AND LOADPO-REQACCT-SW = "Y"
               MOVE REQ-SUB              TO   ITM-CLASS
               MOVE REQ-SUBD             TO   ITM-SUB-DETL
               MOVE REQ-ADDTL-DATA       TO   ITM-ADDL-DATA.

           MOVE "DPOITEM;"          TO  DSET-NAME.
           PERFORM 9999-PUT-DPOITEM-PO-O.

      *------- IF CORPCODE NOT EXIST, ADD A DESC LINE WITH CORP CODE
           IF BAD-CODE-SW = "Y"
               MOVE SPACES               TO   DATA-ITEM-BUFFER
               MOVE IN-ITM-NUM           TO   IN-DATA-ITM-NUMBER
               MOVE "90"                 TO   IN-DATA-LINE-NUMBER
               MOVE BAD-CODE-LINE        TO   IN-PO-DATA-LINE
               PERFORM 6605-ADD-DATAITEM-NOEDIT THRU 6610-ADI-X.

       6390-AI-X.
           EXIT.


       63900-CHECK-4-CHAT-NO.
           IF SAVE-CHAT-SW = "N" GO TO 63900-C4CN-X.
           MOVE SAVE-IN-QUOTE TO QUOTE-ARG.
           PERFORM 9999-CHAINHD-DVENDITM-QT-I.
       63900-C4CN-LOOP.
           PERFORM 9999-GETNEXT-DVENDITM-QT-I.
           IF COND-WORD NOT = 0 GO TO 63900-C4CN-X.
           IF ITM-CORP-CODE = VEN-ITM-CORPCODE
               MOVE VEN-ITM-CHAT-NO TO ITM-CHAT-NO
               GO TO 63900-C4CN-X
           ELSE
           GO TO 63900-C4CN-LOOP.
       63900-C4CN-X.    EXIT.

      *************************************************************
      *                                                           *
      *                MODIFY PO ITEM                             *
      *                                                           *
      *************************************************************

       6400-MOD-ITEM.
           MOVE 16                       TO   SAVE-PARA-NO.

           MOVE "MODIFY"                 TO   POR-ITEM-FUNCTION.
           PERFORM 7624-ITEM-PRINT.
           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 7626-DESC-PRINT.

           PERFORM 7350-EDIT-ITEM THRU 7360-EI-X.
           IF ERR-SW = "Y"
               GO TO 6490-MI-X.

      *------- ON DELETE OF CONTAINER, ACTUALLY JUST MOD TO
      *------- REMOVE CONTAINER INDIC.  ON MOD, JUST MOD CONTAINER
      *------- INDIC, NO OTHER FLDS.
           IF IN-ITM-CONTAINER-INDIC NOT = SPACES
               IF PO-DEL-FLAG = SPACES
      *            *** MODIFY THE ITEM TO A CONTAINER
                   MOVE IN-ITM-CONTAINER-INDIC  TO  ITM-CONTAINER
                   PERFORM 6428-UPDATE-DPOITEM
                   GO TO 6490-MI-X
               ELSE
      *            *** REMOVE THE CONTAINER INDICATOR ("DELETE")
                   MOVE SPACES                  TO  ITM-CONTAINER
                   PERFORM 6428-UPDATE-DPOITEM
                   GO TO 6490-MI-X.

           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 6640-CHECK-CORP-CODE
               IF ERR-SW  =  "Y"
                   GO TO 6490-MI-X.

      **** MOVED THIS PARAGRAPH AFTER THE EDIT CHECKS.  PREVIOUSLY,
      **** THIS LOGIC WAS BEFORE THE EDIT CHECKS.  SO, IF AN ENTRY WAS
      **** IN ERROR, THE DATAITEMS WERE BEING DELETED.
      *------ WHEN ITEM IS MODIFIED, WE DELETE ALL FREE-FORMAT
      *------ FREE-FORMAT DESCRIPITON.  IT WILL BE RE-ADDED LATER
      *------ (ON A MODIFY ALL DESC MUST BE PASSED)
           IF IN-ITM-CONTAINER-INDIC = SPACES
               PERFORM 7140-DELETE-ALL-DATAITEM.

           IF IN-CORP-CODE = ITM-CORP-CODE
               PERFORM 6405-NO-CODE-CHANGES THRU 6445-NCC-X
           ELSE
               PERFORM 6450-CODE-CHANGES THRU 6480-CC-X.

           PERFORM 9999-RESET-DPOITEM-PO-O.
           GO TO 6490-MI-X.

      ********************************
      *                              *
      *   NO CODE CHANGE             *
      *                              *
      ********************************

       6405-NO-CODE-CHANGES.
           MOVE 17                       TO   SAVE-PARA-NO.
           PERFORM 7370-EDIT-STR-ITM THRU 7380-ESI-X.
           IF ERR-SW  =  "Y"
               GO TO 6445-NCC-X.

           IF ITM-QTY-DLVR = 0
               GO TO 6410-PROCESS-NO-CODE-CHANGES.
           IF IN-ITM-QTY-UM NOT = ITM-UM
               MOVE "*CAN'T CHANGE QTY UM AFTER DELIVERY*33*"
                   TO ERR-MSG
               MOVE "PRESENT QTY UM"     TO   ITEM-LIT-2
               MOVE ITM-UM               TO   ITEM-VALUE-2
               MOVE "NEW UM"             TO   ITEM-LIT-3
               MOVE IN-ITM-QTY-UM        TO   ITEM-VALUE-3
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6445-NCC-X.

           IF ITM-QTY-DLVR  >  IN-ITM-QTY-ORD-9
               MOVE "*CAN'T REDUCE QTY ORDERED BELOW QTY DELV*34*"
                   TO ERR-MSG
               MOVE "QTY DELIVERED"      TO   ITEM-LIT-2
               MOVE ITM-QTY-DLVR         TO   ITEM-VALUE-2-9
               MOVE "QTY ORDERED"        TO   ITEM-LIT-3
               MOVE ITM-QTY-ORD          TO   ITEM-VALUE-3-9
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6445-NCC-X.

       6410-PROCESS-NO-CODE-CHANGES.
           MOVE 18                       TO   SAVE-PARA-NO.
      *------- 'SPOMSTRM' IS CALLED TO UPDATE MSTORERM LAST PO, LAST
      *------- VENDOR, AND MKT COST.  ALSO CALC QTY & PRICE IN STR UM.
           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 6650-UPDATE-STR-MKT-COST.

      *------- COMPUTE OLD BUDGET AMOUNT FOR 322 TRANSACTION
      *------- (USING OLD QTYS ON OLD ITEM - BEFORE MOVING ITM DATA)
           PERFORM 6670-COMPUTE-OLD-BUDGET.

      *--- CHECK TO SEE IF UNIT PRICE OR QUANTITY ORDERED HAS CHANGED
      *--- FOR AUDIT PURPOSES BEFORE MOVING NEW DATA INTO THE ITM BUFFER.
           IF IN-ITM-UNIT-PRICE-9 NOT = ITM-UNIT-PRICE OR
                   IN-ITM-QTY-ORD-9 NOT = ITM-QTY-ORD
               MOVE "Y" TO UNIT-QTY-CHGD-SW
               MOVE ITM-UNIT-PRICE        TO  OLD-ITEM-PRICE
               MOVE IN-ITM-UNIT-PRICE-9   TO  NEW-ITEM-PRICE
               MOVE ITM-QTY-ORD           TO  OLD-ITEM-QTY
               MOVE IN-ITM-QTY-ORD-9      TO  NEW-ITEM-QTY.

           PERFORM 7090-MOVE-ITEM-DATA.

      *******************************************
      *  IF THE ITEM IS A BLANKET ZERO OUT QTY  *
      *  IN CASE A NON ZERO QTY WAS PASSED.     *
      *******************************************
           IF BLANKET-SW  =  "Y"
               MOVE ZEROS                TO   ITM-QTY-ORD
                                              NEW-ITEM-QTY
               MOVE IN-ITM-QTY-UM        TO   ITM-UM
               MOVE IN-ITM-PRICE-UM      TO   ITM-PRICE-UM.

      *------- CREATE 321 AND 322 TRANSACTIONS: ITEM MOD, ACCT DATA
           MOVE SPACES                   TO   STC320-PARMS.
           MOVE OLD-BUDGET-AMT           TO   STC320-OLD-BUDGET-AMT.
           MOVE "21"                     TO   STC320-ITEM-TC-ID.
           IF LOAD-SW NOT = "Y"
              PERFORM 7720-BUILD-DDAILYTC-ITM   THRU 7730-BDI-X.

           IF ITM-CORP-CODE NOT = "NON-STR"
               PERFORM 6660-UPDATE-VENDOR-PRICE.

      *------- DELETE OLD REQ LINK IF EXISTS.  ADD NEW LINK IF NEEDED
           IF BLANKET-SW NOT = "Y"
               PERFORM 6765-CHECK-FOR-REQ THRU 6785-CFR-X
               IF HOLD-REQ-NO NOT = SPACES
                   PERFORM 6740-PROCESS-REQ-NO THRU 6760-PRN-X.

      *--- WRITE CHANGES IN UNIT PRICE AND ORDER QUANTITY TO AUDIT
      *--- TRAIL FILE.
           IF UNIT-QTY-CHGD-SW = "Y"
               MOVE ITM-PO-RCV-NO TO PO-NUM-TRACK
               MOVE ITM-NUMBER    TO PO-ITEM-NUM
               CALL "SPOTRACK" USING PO-TRACK-DATA
               MOVE "N" TO UNIT-QTY-CHGD-SW
               MOVE 0   TO OLD-ITEM-PRICE    OLD-ITEM-QTY
                           NEW-ITEM-PRICE    NEW-ITEM-QTY.

       6428-UPDATE-DPOITEM.
           MOVE 20                       TO   SAVE-PARA-NO.

           IF FOUND-REQ-FLAG = "Y" AND LOADPO-REQACCT-SW = "Y"
               MOVE REQ-SUB              TO   ITM-CLASS
               MOVE REQ-SUBD             TO   ITM-SUB-DETL
               MOVE REQ-ADDTL-DATA       TO   ITM-ADDL-DATA.

           MOVE "DPOITEM;"               TO   DSET-NAME.
           PERFORM 9999-UPDATE-DPOITEM-PO-O.

       6429-UPDATE-DPOITEM-EXIT.

       6445-NCC-X.
           EXIT.

      ********************************
      *                              *
      *   CODE CHANGE                *
      *                              *
      ********************************

       6450-CODE-CHANGES.
           MOVE 22                       TO   SAVE-PARA-NO.
           IF ITM-QTY-DLVR NOT = 0
               MOVE "*CAN'T CHANGE CORP CODE AFTER DELIVERY*35*"
                   TO ERR-MSG
               MOVE "PRESENT CORP CODE"  TO   ITEM-LIT-2
               MOVE ITM-CORP-CODE        TO   ITEM-VALUE-2
               MOVE "QTY DELEVERED"      TO   ITEM-LIT-3
               MOVE ITM-QTY-DLVR         TO   ITEM-VALUE-3-9
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6480-CC-X.

      *------- FOR A CODE CHANGE, WE MUST FIRST DELETE THE PO ITEM,
      *------- THEN RE-ADD IT. USE 'MODIFY' FOR ERROR REPORT LIT,
      *------- BUT ACUTAL FUNCTION IS ADD OR DELETE
           MOVE "DI-MODIFY ITEM"         TO   RECORD-FUNCTION-D.
           PERFORM 6500-DELETE-ITEM THRU 6590-DI-X.
           MOVE "AI-MODIFY ITEM"         TO   RECORD-FUNCTION-D.
           PERFORM 6300-ADD-ITEM THRU 6390-AI-X.

       6480-CC-X.
           EXIT.

       6490-MI-X.
           EXIT.


      *************************************************************
      *                                                           *
      *                MODIFY MEXICO PO ITEM                      *
      *                                                           *
      *************************************************************

       6400-MOD-MEX-ITEM.
           MOVE 16                       TO   SAVE-PARA-NO.

      * MEXICO INPUT IS MOVED TO NORMAL PO INPUT TO USE EXISTING
      * ROUTINES.  THE CURRENCY CODE AND CORP CODE IS TAKEN FROM
      * THE EXISTING PO.
           MOVE PO-CURRENCY-CODE TO IN-CURRENCY-CODE.
           MOVE ITM-CORP-CODE TO IN-CORP-CODE.
           MOVE IN-MEXICO-ITEM    TO IN-ITM-NUM.
           MOVE IN-MEXICO-QTY-ORD TO IN-ITM-QTY-ORD-9.
           MOVE IN-MEXICO-QTY-ORD-UM TO IN-ITM-QTY-UM.
           MOVE IN-MEXICO-UNIT-PRICE TO IN-ITM-UNIT-PRICE-9.
           MOVE IN-MEXICO-UNIT-PRICE-UM TO IN-ITM-PRICE-UM.

           MOVE "MODIFY"                 TO   POR-ITEM-FUNCTION.
           PERFORM 7625-ITEM-PRINT.

           IF (IN-MEXICO-ITEM NOT NUMERIC) OR (IN-MEXICO-ITEM = "0000")
               MOVE "*ITEM # IS ZERO OR IS NOT NUMERIC*" TO ERR-MSG
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6490-MMI-X.

           IF IN-CORP-CODE NOT = "NON-STR"
               PERFORM 6640-CHECK-CORP-CODE
               IF ERR-SW  =  "Y"
                   GO TO 6490-MMI-X.

           PERFORM 6446-NO-CODE-MEX-CHANGES THRU 6449-NCMC-X

           PERFORM 9999-RESET-DPOITEM-PO-O.

       6490-MMI-X.
           EXIT.

      ********************************
      *                              *
      *   NO CODE CHANGES MEXICO     *
      *                              *
      ********************************

      *----- DPOITEM UPDATE FOR MEXICO ONLY, TO UPDATE THE
      *----- THE ORDER QUANTITY AND UNIT PRICE
       6446-NO-CODE-MEX-CHANGES.
           MOVE 17                       TO   SAVE-PARA-NO.
           PERFORM 7370-EDIT-STR-ITM THRU 7380-ESI-X.
           IF ERR-SW  =  "Y"
               GO TO 6449-NCMC-X.

           IF ITM-QTY-DLVR = 0
               GO TO 6447-PROCESS-NO-CODE-CHANGES.
           IF IN-MEXICO-QTY-ORD-UM NOT = ITM-UM
               MOVE "*CAN'T CHANGE QTY UM AFTER DELIVERY*33*"
                   TO ERR-MSG
               MOVE "PRESENT QTY UM"     TO   ITEM-LIT-2
               MOVE ITM-UM               TO   ITEM-VALUE-2
               MOVE "NEW UM"             TO   ITEM-LIT-3
               MOVE IN-MEXICO-QTY-ORD-UM TO   ITEM-VALUE-3
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6449-NCMC-X.

           IF ITM-QTY-DLVR  >  IN-MEXICO-QTY-ORD
               MOVE "*CAN'T REDUCE QTY ORDERED BELOW QTY DELV*34*"
                   TO ERR-MSG
               MOVE "QTY DELIVERED"      TO   ITEM-LIT-2
               MOVE ITM-QTY-DLVR         TO   ITEM-VALUE-2-9
               MOVE "QTY ORDERED"        TO   ITEM-LIT-3
               MOVE ITM-QTY-ORD          TO   ITEM-VALUE-3-9
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6449-NCMC-X.

       6447-PROCESS-NO-CODE-CHANGES.
           MOVE 18                       TO   SAVE-PARA-NO.
      *------- 'SPOMSTRM' IS CALLED TO UPDATE MSTORERM LAST PO, LAST
      *------- VENDOR, AND MKT COST.  ALSO CALC QTY & PRICE IN STR UM.
           IF ITM-CORP-CODE NOT = "NON-STR"
               PERFORM 6650-UPDATE-STR-MKT-COST.

      *------- COMPUTE OLD BUDGET AMOUNT FOR 322 TRANSACTION
      *------- (USING OLD QTYS ON OLD ITEM - BEFORE MOVING ITM DATA)
           PERFORM 6670-COMPUTE-OLD-BUDGET.

      *--- CHECK TO SEE IF UNIT PRICE OR QUANTITY ORDERED HAS CHANGED
      *--- FOR AUDIT PURPOSES BEFORE MOVING NEW DATA INTO THE ITM BUFFER.
           IF IN-MEXICO-UNIT-PRICE NOT = ITM-UNIT-PRICE OR
                   IN-MEXICO-QTY-ORD NOT = ITM-QTY-ORD
               MOVE "Y" TO UNIT-QTY-CHGD-SW
               MOVE ITM-UNIT-PRICE        TO  OLD-ITEM-PRICE
               MOVE IN-MEXICO-UNIT-PRICE  TO  NEW-ITEM-PRICE
               MOVE ITM-QTY-ORD           TO  OLD-ITEM-QTY
               MOVE IN-MEXICO-QTY-ORD     TO  NEW-ITEM-QTY.

           PERFORM 7090-MOVE-ITEM-DATA.

      *******************************************
      *  IF THE ITEM IS A BLANKET ZERO OUT QTY  *
      *  IN CASE A NON ZERO QTY WAS PASSED.     *
      *******************************************
           IF BLANKET-SW  =  "Y"
               MOVE ZEROS                TO   ITM-QTY-ORD
                                              NEW-ITEM-QTY
               MOVE IN-ITM-QTY-UM        TO   ITM-UM
               MOVE IN-ITM-PRICE-UM      TO   ITM-PRICE-UM.

      *------- CREATE 321 AND 322 TRANSACTIONS: ITEM MOD, ACCT DATA
           MOVE SPACES                   TO   STC320-PARMS.
           MOVE OLD-BUDGET-AMT           TO   STC320-OLD-BUDGET-AMT.
           MOVE "21"                     TO   STC320-ITEM-TC-ID.
           IF LOAD-SW NOT = "Y"
              PERFORM 7720-BUILD-DDAILYTC-ITM   THRU 7730-BDI-X.

           IF ITM-CORP-CODE NOT = "NON-STR"
               PERFORM 6660-UPDATE-VENDOR-PRICE.

      *--- WRITE CHANGES IN UNIT PRICE AND ORDER QUANTITY TO AUDIT
      *--- TRAIL FILE.
           IF UNIT-QTY-CHGD-SW = "Y"
               MOVE ITM-PO-RCV-NO TO PO-NUM-TRACK
               MOVE ITM-NUMBER    TO PO-ITEM-NUM
               CALL "SPOTRACK" USING PO-TRACK-DATA
               MOVE "N" TO UNIT-QTY-CHGD-SW
               MOVE 0   TO OLD-ITEM-PRICE    OLD-ITEM-QTY
                           NEW-ITEM-PRICE    NEW-ITEM-QTY.

       6448-UPDATE-DPOITEM.
           MOVE 20                       TO   SAVE-PARA-NO.

           MOVE "DPOITEM;"               TO   DSET-NAME.
           PERFORM 9999-UPDATE-DPOITEM-PO-O.

       6448-UPDATE-DPOITEM-EXIT.

       6449-NCMC-X.
           EXIT.

      **************************************************************
      *                                                            *
      *                  DELETE PO ITEM                            *
      *                                                            *
      **************************************************************

       6500-DELETE-ITEM.
           MOVE "DELETE"                 TO   POR-ITEM-FUNCTION.
           PERFORM 7624-ITEM-PRINT.

           MOVE 23                       TO   SAVE-PARA-NO.
           IF ITM-QTY-DLVR  NOT = 0
               MOVE "*CAN'T DELETE ITEM BECAUSE OF DELEVERY*36*"
                   TO ERR-MSG
               MOVE "QTY DELEVERED"      TO   ITEM-LIT-2
               MOVE ITM-QTY-DLVR         TO   ITEM-VALUE-2-9
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6590-DI-X.

      *------- GET OLD CORP CODE FOR TRANSACTION INFO
           MOVE ITM-CORP-CODE            TO   CODE-ARG.
           PERFORM 9999-GETKEY-MSTORERM-CD-I.
           IF NO-ENTRY
               MOVE "ERR IN 6500-DI GETKEY MSTORERM" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE "DPOITEM;"               TO   DSET-NAME.
           PERFORM 9999-DELETE-DPOITEM-PO-O.

      *------- FOR DELETING PO ITEM ON A MODIFY OF PO ITEM WHERE THE
      *------- CORP CODE CHANGED, DON'T DELTE THE DESCRIPTION.
           IF PO-DEL-FLAG NOT = "D"
               GO TO 6530-UPDATE-DDAILYTC.

      *------- OTHERWISE FIND AND DELETE THE FREE-FORMAT ITEM DESC
JB         PERFORM 7140-DELETE-ALL-DATAITEM.

      **********************
      *                    *
      *   BUILD TC "321"   *
      *                    *
      **********************

       6530-UPDATE-DDAILYTC.
           MOVE 26                       TO   SAVE-PARA-NO.
           MOVE SPACES                   TO   STC320-PARMS.
           MOVE "21"                     TO   STC320-ITEM-TC-ID.
           PERFORM 6670-COMPUTE-OLD-BUDGET.
           MOVE OLD-BUDGET-AMT           TO   STC320-OLD-BUDGET-AMT.
           MOVE ZEROS                    TO   ITM-QTY-ORD,
                                              ITM-UNIT-PRICE.
           IF LOAD-SW NOT = "Y"
              PERFORM 7720-BUILD-DDAILYTC-ITM   THRU 7730-BDI-X
              PERFORM 7740-CUT-TC32D  THRU  7750-CT-X.

      **********************************************************
      **  CALL 'SVENPRC' TO DELETE THE VENDOR PRICE SEGMENT
      **  'DVENDITM' IF THIS ENTRY CONTAINS NO RECEIVING
      **  HISTORY (ALL 3 LTs = ZEROS)
      **********************************************************
           IF ITM-CORP-CODE NOT = "NON-STR"
               PERFORM 6660-UPDATE-VENDOR-PRICE.

      *------- DELETE THE REQ LINK IF IT EXISTS
           IF BLANKET-SW NOT = "Y"
               PERFORM 6765-CHECK-FOR-REQ  THRU  6785-CFR-X.

       6590-DI-X.
           EXIT.

      **************************************************************
      **                                                          **
      **          ADD DATA ITEM                                   **
      **                                                          **
      **************************************************************
      *------ ON AN ADD OF A NEW ITEM, NO ITEM DESC WILL EXIST, SO
      *------ EACH ITEM LINE IS JUST ADDED.  ON AN ITEM MOD, ALL
      *------ DESC FOR THAT ITEM IS DELETED FIRST, THEN RE-ADDED.
      *------ THE INTERFACE PROGRAMS (AKRON AND CUMBERLAND) ALWAYS PASS
      *------ ALL ITEM DESCN ON AN ITEM MOD.  NOTE: THEREFORE NO DESC
      *------ MODIFY ROUTINE IS NEEDED.
       6600-ADD-DATA-ITEM.
           IF POR-LINE-CTR > 55
               PERFORM 7620-POR-HDR.
           MOVE IN-NC-ITEM-DESC          TO   POR-DESC.
           WRITE PRINT-REC FROM PORPT-DESC AFTER ADVANCING 1.
           ADD 1                         TO   POR-LINE-CTR.

           MOVE 28                       TO   SAVE-PARA-NO.
           IF FROM-QUOTE = "Y"
              GO TO 6605-ADD-DATAITEM-NOEDIT.
           PERFORM 7330-EDIT-DATA-ITEM THRU 7340-EDI-X.
           IF ERR-SW = "Y"
               GO TO 6610-ADI-X.

       6605-ADD-DATAITEM-NOEDIT.
           MOVE PO-ARG                   TO   DATAITM-PO-RCV-NO.
           MOVE IN-DATA-ITM-NUMBER       TO   DATAITM-ITEM-NO.
           MOVE IN-DATA-LINE-NUMBER      TO   DATAITM-LINE-NO.
           IF FROM-QUOTE = "Y"
              MOVE IN-NC-ITEM-DESC       TO   DATAITM-INFO
           ELSE
              MOVE IN-PO-DATA-LINE       TO   DATAITM-INFO.
           MOVE "DPODATAITM;"            TO   DSET-NAME.
           PERFORM 9999-PUT-DPODATAITM-PO-O.
           IF ITM-CORP-CODE = "NON-STR"
               IF IN-DATA-LINE-NUMBER-9 = 01
                   MOVE SPACES          TO  BUF-DDAILYTC
                   MOVE "370"           TO  DDAILYTC-TC
                   IF LOAD-SW NOT = "Y"
                      PERFORM 7710-CUT-TC370  THRU  7715-CUT-TC370-X.

       6610-ADI-X.
           EXIT.

      *****************************************************************
      **                                                             **
      **             DELETE DATA ITEM                                **
      **                                                             **
      *****************************************************************
      *------ THIS ROUTINE IS KEPT IN CASE ANY HOST SYSTEM PASSES A 'D'
      *------ RECORD FOR A PARTICULAR DESC LINE FOR AN ITEM.  THIS IS
      *------ NOT DONE AT THIS TIME: IF AN ITEM IS MODIFIED, ALL LINES
      *------ OF DESC ARE PASSED.  THIS ROUTINE IS ALSO USED FROM THE
      *------ "DELETE ALL DATAITEM" ROUTINE THAT DELETES ALL DESC FOR
      *------ AN ITEM AT THE TIME THE ITEM MOD IS DONE
       6625-DELETE-DATA-ITEM.
           MOVE 30                       TO   SAVE-PARA-NO.
           MOVE "DPODATAITM;"            TO   DSET-NAME.
           PERFORM 9999-DELETE-DPODATAITM-PO-O.

      *****************************************************************
      **                                                             **
      **           P E R F O R M E D   R O U T I N E S               **
      **                                                             **
      *****************************************************************
       6640-CHECK-CORP-CODE.
      *------ NONEXIST CORP CODE:  BLANKETS - ERROR, BUT NOT PRINTED
      *------                      ADD ITEM - ADDED AS NON-STR, WARNING
      *------                      MOD ITEM - ERROR, AND PRINTED
           MOVE IN-CORP-CODE    TO  CODE-ARG.
           PERFORM 9999-GETKEY-MSTORERM-CD-I.
           IF NO-ENTRY
               IF BLANKET-SW  =  "Y"
                   MOVE "Y"  TO  ERR-SW
               ELSE
                   PERFORM 6645-CORP-CODE-ERROR.
           IF FROM-QUOTE = "Y"
               MOVE STR-TAX-CODE TO SAVE-ITM-TAX-CODE
           ELSE
           MOVE "  "             TO SAVE-ITM-TAX-CODE.

       6645-CORP-CODE-ERROR.
           IF RECORD-FUNCTION = "AI"
               MOVE "*NONEXISTENT CORPCODE - ADDED AS NON-STR*41*"
                                              TO   ERR-MSG
           ELSE
               MOVE "Y"                  TO   ERR-SW
               MOVE "*CORP CODE DOES NOT EXIST*40*"
                                         TO   ERR-MSG.
           MOVE "BAD CORP CODE"          TO   ITEM-LIT-2.
           MOVE IN-CORP-CODE             TO   ITEM-VALUE-2.
           PERFORM 7600-WRITE-REPORT-LINE.

       6650-UPDATE-STR-MKT-COST.
      *------- IN THIS ROUTINE, THE QTY ORDERED AND UNIT PRICE ARE
      *------- RETURNED IN 'SPOMSTRM-STR-QTY' AND 'SPOMSTRM-STR-PRICE'
      *------- THIS ROUTINE FOR CODED ONLY.
           MOVE "0"                      TO   ZBILL-PO-SW.
           MOVE COMPANY-SAVE             TO   SPOMSTRM-COMPANY-SAVE.
           MOVE IN-ITM-QTY-ORD-9         TO   SPOMSTRM-QTY.
           MOVE IN-ITM-QTY-UM            TO   SPOMSTRM-QTY-UM.
      *------- FOR KELLY, ORD UM MAY NOT MATCH ANY OF THE 3 STR UMS.
      *------- ORD QTY IS ALWAYS PASSED WITH EQIV QTY IN STR UM.
      *------- THE PRICE PASSED IN ORD UM, SO WE HAVE TO CONVERT TO
      *------- STR UM ('SPOMSTRM' DOESN'T HAVE THE INFO TO CALC).
      *------- FOR KELLY, 'ITM-QTY-ORD' HAS QTY ORD IN STR UM, AND
      *------- THE OLD BUFFER 'K-ITM-QTY-ORD' HAS QTY ORD IN PO UM.
      *------- IF PRICE OR PRICE UM ARE INVALID, (RECORD PROCESSED ONLY
      *------- ON ADD), THE EDIT ROUTINE WILL MOVE 0 TO PRICE, WHICH
      *------- WILL CAUSE 'SPOMSTRM' NOT TO UPDATE MKT COST
           IF KELLY-PLANT
               MOVE STR-UM               TO   SPOMSTRM-PRICE-UM
               IF IN-ITM-PRICE-UM = STR-UM
                   MOVE K-ITM-UNIT-PRICE-9 TO SPOMSTRM-PRICE
               ELSE
      *            *** ONE OF ALTERNATE GIVES HOW MANY OF PRIMARY?
      *            ***    QTY-STR-UM       /  QTY-PO-UM
                   IF IN-ITM-QTY-ORD-9 = 0 OR K-ITM-QTY-ORD-9 = 0
                       MOVE 1 TO SAVE-STR-CF
                   ELSE
                       DIVIDE IN-ITM-QTY-ORD-9 BY K-ITM-QTY-ORD-9
                         GIVING SAVE-STR-CF ROUNDED
                   END-IF
                   DIVIDE IN-ITM-UNIT-PRICE-9 BY SAVE-STR-CF
                     GIVING SPOMSTRM-PRICE ROUNDED
           ELSE
               MOVE IN-ITM-UNIT-PRICE-9  TO   SPOMSTRM-PRICE
               MOVE IN-ITM-PRICE-UM      TO   SPOMSTRM-PRICE-UM.

      *------- LAST PO AND LAST VENDOR ARE UPDATED ONLY ON ITEM
      *------- ADD, NOT ON ITEM MODS.  (BUT MKT COST IS UPDATED
      *------- ON ITEM MODS).  NOTE: A CODE CHANGE ON AN ITEM ACTS
      *------- AS AN ITEM ADD, SO LAST VEN & PO ARE UPDATED.
           IF RECORD-FUNCTION = "AI"
               MOVE PO-INPUT-NUM         TO   SPOMSTRM-LAST-PO
               MOVE PO-VEN-CODE          TO   SPOMSTRM-VEN-CODE
           ELSE
               MOVE SPACES               TO   SPOMSTRM-LAST-PO,
                                              SPOMSTRM-VEN-CODE.
           MOVE IN-CURRENCY-CODE         TO   SPOMSTRM-CUR-CODE.
           CALL "SPOMSTRM" USING BASE, CODE-ARG, SPOMSTRM-PARMS,
             ZBILL-PO-SW, STATUS-AREA, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.


       6660-UPDATE-VENDOR-PRICE.
      *------- THIS ROUTINE FOR CODED ONLY.
      *------- UPDATE LAST PO PRICE FOR THAT CODE FOR THAT VENDOR.
      *------- ON PO ITEM DELETE, SEGMENT WILL BE DELETED IF NO
      *------- DATA IN THAT DVENDITM SEGMENT.
           MOVE SPACES                   TO   SVENPRC-PARMS.
           IF RECORD-FUNCTION = "AI" OR "MI"
               MOVE "U"                  TO   SVENPRC-FLAG
           ELSE
           IF RECORD-FUNCTION = "DI"
               MOVE "D"                  TO   SVENPRC-FLAG.
           MOVE ITM-CORP-CODE            TO   SVENPRC-CODE.
           MOVE PO-VEN-CODE              TO   SVENPRC-VEN-CODE.
           IF RECORD-FUNCTION = "AI" OR "MI"
               MOVE ITM-UNIT-PRICE       TO   SVENPRC-PRICE
               MOVE ITM-PRICE-UM         TO   SVENPRC-PRICE-UM
               MOVE PO-DATE              TO   SVENPRC-PO-DATE
           ELSE
               MOVE ZEROS                TO   SVENPRC-PRICE.
           CALL "SVENPRC" USING BASE,
                                SVENPRC-PARMS,
                                STATUS-AREA,
                                BU-DISPLAY-MSG,
                                BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               PERFORM 2100-BLOWUP.

      ***********************************************
      **   COMPUTE OLD BUDGET AMOUNT               **
      ***********************************************

       6670-COMPUTE-OLD-BUDGET.
      *------- THIS ROUTINE PERFORMED FROM MODIFY OR DELETE ITEM.
      *------- THE QTY/PRICE FROM THE  O L D  PO ITEM IS CONVERTED
      *------- TO STR UM FIRST (NEW PO ITEM IS CONVERTED IN 'SPOMSTRM')
           PERFORM 6675-CONVERT-TO-STR-UM.
           MULTIPLY SAV-ORD-STR-UM BY SAV-PRC-STR-UM
             GIVING OLD-BUDGET-AMT ROUNDED.

       6675-CONVERT-TO-STR-UM.
      *------- IF KELLY, SPECIAL STUFF FOR UM CONVERSION
           IF KELLY-PLANT
               MOVE "Y"                  TO   UMCF-KELLY-FLAG
               MOVE ITM-QTY-ORD          TO   UMCF-KELLY-STR-QTY
               MOVE ITM-KELLY-PO-QTY     TO   UMCF-KELLY-ORD-QTY
               MOVE ITM-KELLY-PO-UM      TO   UMCF-KELLY-ORD-UM
               IF IN-CORP-CODE = "NON-STR"
                   MOVE ITM-UM           TO   STR-UM.

      *------- FOR KELLY, THE NON-CODED ITEMS CAN HAVE A CONVERSION|
           IF ITM-CORP-CODE = "NON-STR" AND (NOT KELLY-PLANT)
               MOVE ITM-QTY-ORD          TO   SAV-ORD-STR-UM
               MOVE ITM-UNIT-PRICE       TO   SAV-PRC-STR-UM
           ELSE
               MOVE ITM-QTY-ORD          TO   UMCF-SOURCE-QTY
               MOVE ITM-UM               TO   UMCF-SOURCE-UM
               CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
                 UMCF-QUANTITY-AREA
               MOVE UMCF-QTY-STR-UM-DEC  TO   SAV-ORD-STR-UM
               MOVE ITM-UNIT-PRICE       TO   UMCF-SOURCE-QTY
               MOVE ITM-PRICE-UM         TO   UMCF-SOURCE-UM
               MOVE "PR"                 TO   UMCF-RET-CODE
               CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
                 UMCF-QUANTITY-AREA
               MOVE UMCF-QTY-STR-UM-DEC  TO   SAV-PRC-STR-UM.

      *****************************************************************
      **        A D D   N E W   R E Q   L I N K                      **
      *****************************************************************
       6740-PROCESS-REQ-NO.
      *------ LEFT SHIFT THE REQ NUMBER AND ELIMINATE EMBEDDED SPACES,
      *------ NON-STR REQS HAVE AN 'N' IN FRONT (EXCEPT INTERNAT. REQS,
      *------ OR MMIS REQS SUCH AS 'M103')
      *------ IF NON-STR, IF IT DONT EXIST, CREATE IT.
           PERFORM 6790-FORMAT-REQ-NO.

           MOVE "Y"                      TO   FOUND-REQ-FLAG.
           PERFORM 9999-GETKEY-MREQ-RQ-O.
           IF NO-ENTRY
               MOVE "N"                  TO   FOUND-REQ-FLAG
               IF IN-CORP-CODE = "NON-STR" AND MMIS-REQ-FLAG = "N"
                   PERFORM 6800-BUILD-MREQ THRU 6830-BM-X
               ELSE
               IF HOLD-REQ-NO-1 NUMERIC  OR MMIS-REQ-FLAG = "Y"
                   MOVE "* REQUISITION DOES NOT EXIST *52.1*"
                       TO ERR-MSG
                   MOVE "REQUISITION NUMBER"  TO   ITEM-LIT-2
                   MOVE HOLD-REQ-NO           TO   ITEM-VALUE-2
                   MOVE "CORP CODE"           TO   ITEM-LIT-3
                   MOVE IN-CORP-CODE          TO   ITEM-VALUE-3
                   PERFORM 7600-WRITE-REPORT-LINE
                   GO TO 6760-PRN-X
               ELSE
                   GO TO 6760-PRN-X
           ELSE
             PERFORM 9999-RESET-MREQ-RQ-O.

           MOVE "N"                      TO   FOUND-DREQD-FLAG.

      *------- ONLY 1 DREQD PER REQ EXISTS
           PERFORM 9999-CHAINHD-DREQD-RQ-O.
           PERFORM 9999-GETNEXT-DREQD-RQ-O.
           IF END-OF-CHAIN
               MOVE SPACES              TO  BUF-DREQD
               MOVE REQ-ARG             TO  DREQD-REQ-NUMBER
               GO TO 6745-FIND-DREQITM.

           MOVE "Y"                      TO   FOUND-DREQD-FLAG.

      *------- FOR KELLY DONT GIVE THE ERROR SINCE THEY HAVE MULTIPLE
      *------- PO ITEMS PER REQ, BUT ADD THE REQ TO A PO DESC LINE
      *------- FOR OTHER PLANTS DONT PRINT THE ERROR ON NON-STR ITEMS
      *------- BUT DO PRINT THE ERROR ON MMIS NON-STR REQS
           IF DREQD-PO-RCV-NO = SPACES
               NEXT SENTENCE
           ELSE
           IF KELLY-PLANT AND IN-CORP-CODE = "NON-STR"
               PERFORM 6762-ADD-DESC-97
               GO TO 6758-RESET-DREQD
           ELSE
           IF IN-CORP-CODE = "NON-STR" AND MMIS-REQ-FLAG = "N"
               GO TO 6758-RESET-DREQD
           ELSE
               MOVE "* REQUISITION HAS ALREADY BEEN ASSIGNED A P.O.  *52
      -            ".3*" TO ERR-MSG
               MOVE "REQUISITION NUMBER"         TO ITEM-LIT-2
               MOVE HOLD-REQ-NO                  TO ITEM-VALUE-2
               MOVE "CORP CODE"                  TO ITEM-LIT-3
               MOVE IN-CORP-CODE                 TO ITEM-VALUE-3
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6758-RESET-DREQD.

       6745-FIND-DREQITM.
           PERFORM 9999-CHAINHD-DREQITM-RQ-O.
           PERFORM 9999-GETNEXT-DREQITM-RQ-O.
           PERFORM 9999-RESET-DREQITM-RQ-O.
           IF END-OF-CHAIN
             MOVE "* NO ITEM ON REQ- ERROR CONTACT PROGRAMMING ST      A
      -           "FF *52.4*" TO ERR-MSG
             MOVE "REQUISITION NUMBER" TO ITEM-LIT-2
             MOVE HOLD-REQ-NO TO ITEM-VALUE-2
             PERFORM 7600-WRITE-REPORT-LINE
             GO TO 6758-RESET-DREQD.

           IF IN-CORP-CODE NOT =  REQITM-CORP-CODE
               MOVE "* CORP CODE NOT ON REQUISITION *52.5*"
                   TO ERR-MSG
               MOVE "REQUISITION NUMBER"         TO ITEM-LIT-2
               MOVE HOLD-REQ-NO                    TO ITEM-VALUE-2
               MOVE "CORP CODE"                  TO ITEM-LIT-3
               MOVE IN-CORP-CODE               TO ITEM-VALUE-3
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 6758-RESET-DREQD.

       6750-LINK-TO-PO.
           MOVE "DREQD;"            TO  DSET-NAME.

           IF FOUND-DREQD-FLAG = "Y"
             PERFORM 9999-DELETE-DREQD-RQ-O.

           MOVE PO-ARG              TO  DREQD-PO-RCV-NO.
           MOVE PO-VEN-CODE         TO  DREQD-VEN-CODE.
           MOVE IN-ITM-NUM        TO  DREQD-PO-ITM-NO.
           PERFORM 9999-PUT-DREQD-RQ-O.

       6755-UPDATE-MREQ.
           MOVE "MREQ;"             TO  DSET-NAME.
           PERFORM 9999-GETKEY-MREQ-RQ-O.
           IF NO-ENTRY
             MOVE "ERR IN 6755-UM GETKEY MREQ" TO BU-DISPLAY-MSG
             PERFORM 2100-BLOWUP.
           MOVE "XX"         TO  REQ-RELEASE-STAT.
           MOVE SPACES       TO  REQ-PAD.
           PERFORM 9999-UPDATE-MREQ-RQ-O.

       6758-RESET-DREQD.
           PERFORM 9999-RESET-DREQD-RQ-O.

       6760-PRN-X.
           EXIT.

       6762-ADD-DESC-97.
      *------- FOR KELLY MULTIPLE PO ITEMS PER REQ, WE ADD A DESC LINE
      *------- THE PO ITEM IF THE REQ WAS ALREADY ON ANOTHER PO ITEM.
           MOVE SPACES                   TO   DATA-ITEM-BUFFER.
           MOVE IN-ITM-NUM               TO   IN-DATA-ITM-NUMBER.
           MOVE 97                       TO   IN-DATA-LINE-NUMBER-9.
           MOVE HOLD-REQ-NO              TO   BUILD-REQ-DESC-REQ.
           MOVE BUILD-REQ-DESC-LINE      TO   IN-PO-DATA-LINE.
           PERFORM 6605-ADD-DATAITEM-NOEDIT THRU 6610-ADI-X.

      *****************************************************************
      **        D E L E T E   O L D   R E Q   L I N K                **
      *****************************************************************
       6765-CHECK-FOR-REQ.
      *------- FOR KELLY MULTIPLE PO ITEMS PER REQ ARE STORED AS DESC
      *------- LINE 97.  DELETE THAT LINE IF IT EXISTS.
           IF KELLY-PLANT
               PERFORM 6787-DELETE-DESC-97.

           PERFORM 9999-CHAINHD-DREQD-PO-O.

       6770-GET-DREQD.
           PERFORM 9999-GETNEXT-DREQD-PO-O.
           IF END-OF-CHAIN
             GO TO 6785-CFR-X.

      *---------- ON A MODIFY OF PO ITEM, WE CHECK IF THERE IS ALREADY
      *---------- AN EXISTING REQ FOR THAT PO AND ITEM NUMBER.
      *---------- THE REQ LINK SEGMENT IS MATCHED ON PO AND ITEM NUMBER.
           IF DREQD-PO-ITM-NO NOT EQUAL IN-ITM-NUM
               GO TO 6770-GET-DREQD.

       6775-UNLINK-OLD-REQ.
           MOVE "DREQD;"            TO  DSET-NAME.
           PERFORM 9999-DELETE-DREQD-PO-O.
           MOVE SPACES              TO  DREQD-PO-RCV-NO,
                                        DREQD-VEN-CODE.
           PERFORM 9999-PUT-DREQD-RQ-O.

       6780-RESET-MREQ.
           MOVE DREQD-REQ-NUMBER      TO  REQ-ARG.
           MOVE "MREQ;"               TO  DSET-NAME.
           PERFORM 9999-GETKEY-MREQ-RQ-O.
           IF NO-ENTRY
             MOVE "ERR IN 6780-RM GETKEY MREQ" TO BU-DISPLAY-MSG
             PERFORM 2100-BLOWUP.
           MOVE SPACES              TO   REQ-PURCH-RELEASE,
                                         REQ-PAD.
           PERFORM 9999-UPDATE-MREQ-RQ-O.

       6785-CFR-X.
           EXIT.

      ******************************************************************
      **     R E Q   M I S C E L L A N E O U S   R O U T I N E S      **
      ******************************************************************
       6787-DELETE-DESC-97.
      *------- FOR KELLY MULTIPLE PO ITEMS PER REQ, ON DUPLICATES THE
      *------- REQ# IS PUT IN A COMMENT LINE.  DELETE THIS ON ITEM MODS.
           MOVE IN-ITM-NUM               TO   IN-DATA-ITM-NUMBER.
           MOVE 97                       TO   IN-DATA-LINE-NUMBER-9.
           PERFORM 7130-GET-DATA-ITEM.
           IF GOOD-CALL
               PERFORM 6625-DELETE-DATA-ITEM.

       6790-FORMAT-REQ-NO.
           MOVE HOLD-REQ-NO              TO   LS-SHIFT-FLD.
           CALL "TLSHIFT2" USING LS-RET-CODE, LS-SHIFT-FLD.

           CALL "TCOMPRES" USING LS-RET-CODE, LS-SHIFT-FLD.

           MOVE LS-SHIFT-FLD             TO  HOLD-REQ-NO, REQ-ARG.

      *------ INTERNATIONAL REQS LOOK LIKE THIS: 8LT12311 OR 8I1234, ETC
      *------ ALWAYS PREFIXED WITH 8 AND PLANT CODE. FOR THESE IN AKRON
      *------ WE LEAVE THE PREFIX, IN PLANTS WE STRIP THE PREFIX TO LINK
      *------ TO THE ACTUAL REQ. FOR MMIS REQS COMING BACK FROM THE
      *------ PURCH SYSTEM, WE LEAVE ALONE TO LINK THE PO TO THE HP REQ.
      *------ IF A NON CODED REQ AND DOESNT START WITH 'M', IT CANT BE
      *------ AN HP-GENERATED REQ, SO WE PREFIX WITH 'N': LATER THE REQ
      *------ CREATED AND THIS AVOIDS CONFLICTS.
           MOVE "N"                      TO   INTERNATIONAL-REQ-FLAG.
           MOVE "N"                      TO   MMIS-REQ-FLAG.
           IF HOLD-REQ-NO-1 = "8" AND HOLD-REQ-NO-2 ALPHABETIC
               IF AKRON-PLANT
                   MOVE "Y"              TO   INTERNATIONAL-REQ-FLAG
               ELSE
               IF HOLD-REQ-NO-3 NUMERIC
                   MOVE HOLD-REQ-NO-3-12 TO   STRIP-REQ-PREFIX
                   MOVE STRIP-REQ-PREFIX TO   HOLD-REQ-NO, REQ-ARG
               ELSE
                   MOVE HOLD-REQ-NO-4-12 TO   STRIP-REQ-PREFIX
                   MOVE STRIP-REQ-PREFIX TO   HOLD-REQ-NO, REQ-ARG
           ELSE
           IF HOLD-REQ-NO-1 = "M" AND HOLD-REQ-NO-2-4 NUMERIC
               MOVE "Y"                  TO   MMIS-REQ-FLAG
           ELSE
           IF IN-CORP-CODE = "NON-STR"
               IF NOT AKRON-PLANT
                   MOVE HOLD-REQ-NO      TO   BUILD-REQ-2-12
                   MOVE BUILD-REQ-NO     TO   HOLD-REQ-NO,
                                              REQ-ARG.

      *****************************************************************
      **         B U I L D   R E Q                                   **
      *****************************************************************
       6800-BUILD-MREQ.
           MOVE "MREQ;"                  TO   DSET-NAME.

           MOVE SPACES                   TO   BUF-MREQ.
           MOVE HOLD-REQ-NO              TO   MREQ-NUMBER.
           MOVE IN-PO-BUDGET-AMT-9       TO   REQ-BUDGET-AMT.
           MOVE "X "                     TO   REQ-RELEASE-STAT.
           IF INTERNATIONAL-REQ-FLAG = "Y"
               MOVE "NI"                 TO   REQ-STATUS
           ELSE
               MOVE "NM"                 TO   REQ-STATUS.
           MOVE 1                        TO   DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT             TO   REQ-DATE.
           IF REQ-DATE-YY = "  "
               MOVE "  "                 TO   REQ-DATE-CC
           ELSE
           IF REQ-DATE-YY > "70"
               MOVE "19"                 TO   REQ-DATE-CC
           ELSE
           MOVE "20"                     TO   REQ-DATE-CC.
           MOVE IN-PO-RCV-DEPT           TO   REQ-RCV-DEPT.
           MOVE IN-PO-FOR-DEPT           TO   REQ-FOR-DEPT.
           MOVE IN-PO-SHIP-DATE          TO   DATE-VALIDATE-IN.
           MOVE 3                        TO   DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT             TO   REQ-SHIP-DATE.
           IF REQ-SHIP-DATE-YY = "  "
               MOVE "  "                 TO   REQ-SHIP-DATE-CC
           ELSE
           IF REQ-SHIP-DATE-YY > "70"
               MOVE "19"                 TO   REQ-SHIP-DATE-CC
           ELSE
           MOVE "20"                     TO   REQ-SHIP-DATE-CC.
      *----MOVE IN-PO-ACCTG-INFO         TO   REQ-ACCT-INFO.
      *------- CHANGED THE ABOVE 22 CHARACTER MOVE TO FIELD MOVES WHEN
      *------- IT WAS REPORTED THAT THE DEPARTMENT AND ADDITIONAL DATA
      *------- FIELDS WERE GETTING SKEWED ON AKRON DOWNLOADED PO'S.
           MOVE IN-PO-COMPANY            TO   REQ-CO.
           MOVE IN-PO-PRIME              TO   REQ-PRIME.
           MOVE IN-PO-SUB                TO   REQ-SUB.
           MOVE IN-PO-SUB-DETL           TO   REQ-SUBD.
           MOVE IN-PO-ADDL-DATA          TO   REQ-ADDTL-DATA.

           MOVE IN-PO-BUDGET-NUMBER      TO   REQ-BUDGET-NO.
           MOVE IN-PO-TERMS              TO   REQ-TERMS.
           MOVE IN-PO-ADDTL-INFO         TO   REQ-ADDL-INFO.
           MOVE IN-PO-FOB                TO   REQ-FOB.
           MOVE "X"                      TO   REQ-MMIS-INDIC.
      *------- FLAG THIS REQ WAS CREATED BY LOADPO
           MOVE "X"                      TO   REQ-LOADPO-CRTE-FLAG.

           PERFORM 9999-PUT-MREQ-RQ-O.

           MOVE "DREQITM;"               TO   DSET-NAME.

           MOVE SPACES                   TO   BUF-DREQITM.
           MOVE HOLD-REQ-NO              TO   REQITM-REQ-NUMBER.
           MOVE "NON-STR"                TO   REQITM-CORP-CODE.
           MOVE IN-ITM-NUM               TO   REQITM-NUMBER.
           MOVE IN-ITM-QTY-UM            TO   REQITM-UM.
           MOVE IN-ITM-QTY-ORD-9         TO   REQITM-QTY-TO-ORD.
           MOVE IN-ITM-PRICE-UM          TO   REQITM-PRICE-UM.
           MOVE IN-ITM-UNIT-PRICE-9      TO   REQITM-UNIT-PRICE.
           MULTIPLY IN-ITM-QTY-ORD-9 BY IN-ITM-UNIT-PRICE-9 GIVING
                                         REQITM-BUDGET-AMT ROUNDED.
           MOVE 0                        TO   REQITM-UNIT-PRICE-CURR.
           IF INTERNATIONAL-REQ-FLAG = "Y"
               MOVE "INTERNATIONAL REQUISITION" TO REQITM-NOTE.

           PERFORM 9999-PUT-DREQITM-RQ-O.

       6830-BM-X.
           EXIT.

      *****************************************************************
      **     B L A N K E T   H E A D E R   C L E A N U P             **
      *****************************************************************
      *  THIS LOGIC CLEANS UP ANY BLANKETS THAT DO  NOT GET ANY ITEMS
      *  ASSIGNED TO THEM BECAUSE THE CODES DON'T EXIST ON THE AKRON DB
      *  THAT THE BLANKET WAS PUT IN.  THIS IS NECCESSARY SINCE AKRON
      *  REQUIREMENTS ORDERS DON NOT HAVE RCV DEPTS

       6850-BLANKET-HEADER-CLEANUP.
           IF AT-LEAST-ONE-BLKT-SW NOT = "Y"
               GO TO 6870-BHC-X.
           CLOSE INPUT-PO-FILE.
           OPEN  INPUT INPUT-PO-FILE.

       6855-FIND-HEADER-LABEL.
           PERFORM 7670-FIND-HEADER-LABEL THRU 7675-FHL-X.
           IF EOF-SW = "Y"
               GO TO 6870-BHC-X.

       6860-READ-RECORD.
           READ INPUT-PO-FILE  AT END
               MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               GO TO 6870-BHC-X.
      *    ELSE
      *        MOVE "READ INPUT FILE ERR 6860-RR" TO BU-DISPLAY-MSG
      *        PERFORM 2100-BLOWUP.

           MOVE INPUT-PO-REC TO FILE-HEADER-LABEL.
           IF TRAILER-LABEL  =  "END PURCHASE "
               GO TO 6855-FIND-HEADER-LABEL.
           IF PO-TRANS NOT = "1" OR
              PO-DEL-FLAG NOT = SPACES OR
              PO-RLSE-8-10  NOT =  "999"
               GO TO 6860-READ-RECORD.
           MOVE PO-NUM-1-7       TO  PO-NUM.
           MOVE PO-RLSE-8-10     TO  PO-REL.
           MOVE ZEROS            TO  PO-RECV.

           MOVE BUILD-PO         TO  PO-ARG.
           PERFORM 9999-CHAINHD-DPOITEM-PO-O.
      ****************************************************************
      *    ADDED CHECK OF FILE STATUS = 23 BELOW AS LOAD OF BLANKET  *
      *    PURCHASE ORDERS WAS BLOWING UP WHEN THE BLANKET HEADER    *
      *    WAS NOT GETTING ADDED AND THE PROGRAM WAS NOT CHECKING    *
      *    TO VERIFY THAT THE BLANKET EVEN EXISTED OR NOT.           *
      ****************************************************************
           IF FILE-STATUS = "23"
               PERFORM 9999-RESET-DPOITEM-PO-O
               GO TO 6860-READ-RECORD.
           PERFORM 9999-GETNEXT-DPOITEM-PO-O.
           IF END-OF-CHAIN
             CALL "SDELTPO" USING BASE,
                                  PO-ARG,
                                  COMPANY-SAVE
           ELSE
             PERFORM 9999-RESET-DPOITEM-PO-O
           END-IF.

           GO TO 6860-READ-RECORD.

       6870-BHC-X.
           EXIT.

      *****************************************************************
      **         P R O C E S S   T R A I L E R   C O M M E N T S     **
      *****************************************************************
       6900-PROCESS-TRAILER-COMMENTS.
           IF TRAILER-SW = 0
               PERFORM 9999-CHAINHD-DTRAILER-PO-O
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
      *------------- INCORRECT CHECK FOR COND-WORD.  IT SHOULD BE
      *------------- PERFORMING THE DELETE UNTIL COND-WORD IS EQUAL TO
      *------------- 15.  PREVIOUSLY, THE DELETE WAS NEVER PERFORMED.
      ****     PERFORM 6901-DELETE-LOOP UNTIL COND-WORD NOT = 15.
               PERFORM 6901-DELETE-LOOP UNTIL COND-WORD = 15.
           MOVE PO-ARG                   TO   DTRAILER-PO-NUM.
           MOVE IN-TRLR-COMMNO           TO   DTRAILER-COMMENT-NO.
           MOVE IN-TRLR-COMMENT          TO   DTRAILER-COMMENT.
           MOVE 1                        TO   TRAILER-SW.
           PERFORM 9999-PUT-DTRAILER-PO-O.
       6900-PTC-X.    EXIT.

       6901-DELETE-LOOP.
           PERFORM 9999-GETNEXT-DTRAILER-PO-O.
           IF COND-WORD = 0
               PERFORM 9999-DELETE-DTRAILER-PO-O.

      *****************************************************************
      **         M O V E   D A T A                                   **
      *****************************************************************
       7000-MOVE-PO-HEADER-RECORD.
           IF KELLY-PLANT
               MOVE PO-REC               TO   K-PO-HEADER-BUFFER
               MOVE K-PO-REQ-NUM         TO   IN-PO-REQ-NUM
               MOVE K-PO-RCV-DEPT        TO   IN-PO-RCV-DEPT
               MOVE K-PO-FOR-DEPT        TO   IN-PO-FOR-DEPT
               MOVE K-PO-DATE            TO   IN-PO-DATE
               MOVE K-PO-PLT             TO   IN-PO-PLT
               MOVE SPACES               TO   IN-PO-BLDG
                                              IN-PO-ACCTG-INFO
               MOVE K-PO-ADDL-DATA       TO   IN-PO-ADDL-DATA
               MOVE SPACES               TO   IN-PO-TERMS
               MOVE K-PO-BUYER           TO   IN-PO-BUYER
               MOVE SPACES               TO   IN-PO-ADDTL-INFO
                                              IN-PO-VIA
                                              IN-PO-FOB
                                              IN-CONST-INDICATOR
                                              IN-BUYER-CODE
               MOVE K-PO-SHIP-DATE       TO   IN-PO-SHIP-DATE
               MOVE K-VENDOR-CODE        TO   IN-VENDOR-CODE
               MOVE K-VENDOR-NAME        TO   IN-VENDOR-NAME
               MOVE SPACES               TO   IN-PO-BUDGET-NUMBER
               MOVE ZERO                 TO   IN-PO-BUDGET-AMT-9
               MOVE SPACES               TO   IN-EXP-DATE
                                              IN-CURRENCY-CODE
               MOVE ZERO                 TO   IN-LAST-RELEASE
           ELSE
               MOVE PO-REC               TO   PO-HEADER-BUFFER.

      ************************************************
      *  CHECK CONST. INDICATOR THIS SWITCH WILL     *
      *  BE USED TO ENSURE THAT THE P.O. IS          *
      *  NON-CODED                                   *
      ************************************************

           MOVE SPACES  TO  CONST-PO-SW.
           IF IN-CONST-INDICATOR  =  "C"
               MOVE "Y"  TO  CONST-PO-SW.

           IF IN-PO-BUDGET-AMT-X < "00000001" OR = "0000000{"
           AND AKRON-DEFAULT-FLAG = "Y"
               MOVE 1                    TO   IN-PO-BUDGET-AMT-9.

           IF AKRON-DEFAULT-FLAG = "Y" AND CUR-CODE-REQUIRED-SW = "Y"
               MOVE "01"                 TO   IN-CURRENCY-CODE.

           IF AKRON-DEFAULT-FLAG = "Y"
               MOVE "AKRN"               TO   IN-BUYER-CODE.


       7005-MOVE-PO-VENDOR-RECORD.
      *------- KELLY VEN INFO IN HEADER REC, ADDTL VEN INFO HERE
           IF KELLY-PLANT
               MOVE PO-REC               TO   K-PO-VENDOR-BUFFER
           ELSE
               MOVE PO-REC               TO   PO-VENDOR-BUFFER.

           IF LOADPO-VEN > SPACES
               MOVE LOADPO-VEN           TO   IN-VENDOR-CODE.


       7010-MOVE-PO-ITEM-RECORD.
           MOVE SPACES                   TO   IN-ITM-SUB.
           IF KELLY-PLANT
               IF PO-TRANS = "3"
                   MOVE PO-REC           TO   K-STR-ITEM-BUFFER
                   MOVE K-CORP-CODE      TO   IN-CORP-CODE
                   MOVE K-ITM-NUM        TO   IN-ITM-NUM
      *------- MOVE THE QTYS IN STR UM FOR KELLY, BUT PRICES
      *------- STAY IN ORDERED UM
                   MOVE K-STORES-QTY     TO   FORMAT-QTY
                   MOVE FORMAT-QTY       TO   IN-ITM-QTY-ORD-9
                   MOVE K-STORES-UM      TO   IN-ITM-QTY-UM
                   MOVE K-ITM-PRICE-UM   TO   IN-ITM-PRICE-UM
                   MOVE K-ITM-UNIT-PRICE TO   IN-ITM-UNIT-PRICE-X
                   MOVE K-ITM-SUB-DETAIL TO   IN-ITM-SUB-DETAIL
                   MOVE SPACES           TO   IN-ITM-ADDL-DATA
                   MOVE K-ITM-REQ-NO     TO   HOLD-REQ-NO
                   MOVE SPACES           TO   IN-ITM-CONTAINER-INDIC
               ELSE
                   MOVE PO-REC           TO   K-NSTR-ITEM-BUFFER
                   MOVE "NON-STR"        TO   IN-CORP-CODE
                   MOVE K-NSTR-ITM-NUM   TO   IN-ITM-NUM
                   MOVE K-NSTR-PRICE-UM  TO   IN-ITM-PRICE-UM
                   MOVE K-NSTR-UNIT-PRICE TO  IN-ITM-UNIT-PRICE-X
                   MOVE K-NSTR-ITM-SUB   TO   IN-ITM-SUB
                   MOVE K-NSTR-SUB-DETL  TO   IN-ITM-SUB-DETAIL
                   MOVE K-NSTR-ADDL-DATA TO   IN-ITM-ADDL-DATA
                   MOVE K-NSTR-REQ-NO    TO   HOLD-REQ-NO
      *------- KELLY ORD QTYS REFERENCED LATER IN THE OLD BUFFER, SO
      *------- MOVE THE NON-STR OVER TO STR BUFFER.  THESE ARE THE
      *------- ORD QTYS IN ORD UM.
                   MOVE K-NSTR-QTY-ORD   TO   K-ITM-QTY-ORD
                   MOVE K-NSTR-QTY-UM    TO   K-ITM-QTY-UM
      *------- KELLY MAY OR MAY NOT SEND A "STORES" QTY AND UM FOR
      *------- NON STRS ITEMS.  IF THEY DO, HANDLE JUST AS WITH STORERM
      *------- IF NOT, MAKE STR AND NON-STR QTYS/UMS MATCH
      *------- THESE ARE ORD QTYS IN "STR" UM
                   IF K-NSTR-STORES-QTY = 0
                     OR K-NSTR-STORES-UM = SPACES
                       MOVE K-NSTR-QTY-ORD-9  TO   IN-ITM-QTY-ORD-9
                       MOVE K-NSTR-QTY-UM     TO   IN-ITM-QTY-UM
                   ELSE
                       MOVE K-NSTR-STORES-QTY TO   FORMAT-QTY
                       MOVE FORMAT-QTY        TO   IN-ITM-QTY-ORD-9
                       MOVE K-NSTR-STORES-UM  TO   IN-ITM-QTY-UM
           ELSE
           IF PO-TRANS = "3"
               MOVE PO-REC               TO   STR-ITEM-BUFFER
               MOVE IN-ITM-REQ-NO        TO   HOLD-REQ-NO
           ELSE
               MOVE PO-REC               TO   NS-ITEM-BUFFER
               MOVE "NON-STR"            TO   IN-CORP-CODE
               MOVE IN-NSTR-ITM-NUM      TO   IN-ITM-NUM
               MOVE IN-NSTR-QTY-UM       TO   IN-ITM-QTY-UM
               MOVE IN-NSTR-QTY-ORD-X    TO   IN-ITM-QTY-ORD-X
               MOVE IN-NSTR-PRICE-UM     TO   IN-ITM-PRICE-UM
               MOVE IN-NSTR-UNIT-PRICE-X TO   IN-ITM-UNIT-PRICE-X
               MOVE IN-NSTR-ITM-SUB      TO   IN-ITM-SUB
               MOVE IN-NSTR-SUB-DETL     TO   IN-ITM-SUB-DETAIL
               MOVE IN-NSTR-ADDL-DATA    TO   IN-ITM-ADDL-DATA
               MOVE IN-NSTR-REQ-NO       TO   HOLD-REQ-NO
               MOVE IN-NSTR-CONTAINER-INDIC TO IN-ITM-CONTAINER-INDIC
               IF COLLING-PLANT
                   MOVE IN-NSTR-QTY-RCVD TO   IN-ITM-QTY-RCVD
                   MOVE IN-NSTR-QTY-INV  TO   IN-ITM-QTY-INV
                   MOVE IN-NSTR-QTY-PAID TO   IN-ITM-QTY-PAID
               END-IF
               IF FROM-QUOTE = "Y"
                   MOVE IN-NSTR-TAX-CODE TO   IN-ITM-TAX-CODE.

       7025-MOVE-PO-DATAITEM-RECORD.
           MOVE PO-REC                   TO   DATA-ITEM-BUFFER.

       7090-MOVE-ITEM-DATA.
      *------- FOR KELLY, QTY ORD IN ORD UM IS STORED IN
      *------- "ITM-KELLY-PO-QTY", AND THE QTY ORD STR-UM IS
      *------- STORED IN "ITM-QTY-ORD"
           IF KELLY-PLANT
               MOVE K-ITM-QTY-ORD-9      TO   ITM-KELLY-PO-QTY
               MOVE K-ITM-QTY-UM         TO   ITM-KELLY-PO-UM.

           MOVE IN-ITM-QTY-ORD-9         TO   ITM-QTY-ORD.
           MOVE IN-ITM-QTY-UM            TO   ITM-UM.
           MOVE IN-ITM-UNIT-PRICE-9      TO   ITM-UNIT-PRICE.
           MOVE IN-ITM-PRICE-UM          TO   ITM-PRICE-UM.
      *------- IF COLLINGWOOD PLANT, MOVE QTY RCVD AND PAID FOR
      *------- INITIAL LOAD OF POS.
           IF COLLING-PLANT
               IF IN-ITM-QTY-RCVD NUMERIC
                  MOVE IN-ITM-QTY-RCVD   TO   ITM-QTY-DLVR
                                              ITM-QTY-STORED
                  IF IN-ITM-QTY-RCVD > 0
                    MOVE "    DD  "      TO   ITM-DATE-STORED-CN
                    MOVE CURRENT-DATE-CN TO   ITM-DATE-RCVD-CN
                  ELSE
                    MOVE SPACES          TO   ITM-DATE-STORED-CN
                                              ITM-DATE-RCVD-CN
                  END-IF
               END-IF
               IF IN-ITM-QTY-PAID NUMERIC
                  MOVE IN-ITM-QTY-PAID   TO   ITM-QTY-PAID
               END-IF
           END-IF.
           IF PO-TRANS NOT = "6"
             IF IN-ITM-SUB = SPACES AND
                IN-ITM-SUB-DETAIL  =  SPACES AND
                IN-ITM-ADDL-DATA  =  SPACES
                 MOVE PO-SUB              TO  ITM-CLASS
                 MOVE PO-SUB-DET          TO  ITM-SUB-DETL
                 MOVE PO-ADDL-DATA        TO  ITM-ADDL-DATA
             ELSE
                 MOVE IN-ITM-SUB         TO  ITM-CLASS
                 MOVE IN-ITM-SUB-DETAIL  TO  ITM-SUB-DETL
                 MOVE IN-ITM-ADDL-DATA  TO  ITM-ADDL-DATA
             END-IF
             IF IN-CORP-CODE NOT = "NON-STR"
                 MOVE STR-CLASS           TO  ITM-CLASS
             END-IF
             IF FROM-QUOTE = "Y"
                 MOVE IN-ITM-TAX-CODE     TO  ITM-TAX-CODE
             END-IF
           END-IF.

      *****************************************************************
      **   G E T   P O   M A S T E R,  H E A D E R,  I T E M         **
      *****************************************************************

       7110-GET-HEADER.
           PERFORM 9999-CHAINHD-DPORECD-PO-O.
           PERFORM 9999-GETNEXT-DPORECD-PO-O.

       7120-GET-ITEM.
JB         MOVE PO-ARG TO PORCVNO OF DPOITEM-PO-REC-O.
.          MOVE ITEM-TO-SEARCH-FOR TO ITEMNO OF DPOITEM-PO-REC-O.
.          READ DPOITEM-PO-O INTO BUF-DPOITEM
.              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
.          IF FILE-STATUS NOT = "00"
JB             SET NO-ENTRY TO TRUE.

       7130-GET-DATA-ITEM.
JB         MOVE PO-ARG TO PORCVNO OF DPODATAITM-PO-REC-O.
.          MOVE IN-DATA-ITM-LINE-9 TO ITEMSEQNO OF DPODATAITM-PO-REC-O.
.          READ DPODATAITM-PO-O INTO BUF-DPODATAITM
.              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
.          IF FILE-STATUS = "23"
JB             SET NO-ENTRY TO TRUE.


      *------ WHEN AN ITEM IS MODIFIED, FIRST ALL DESC IS DELETED, THEN
      *------ RE-ADDED
       7140-DELETE-ALL-DATAITEM.
JB    *----- POSITION AT PO, ITEM NUMBER, AND LINE NO = 01
.          MOVE PO-ARG TO PORCVNO OF DPODATAITM-PO-REC-O.
.          COMPUTE ITEMSEQNO-9 = IN-ITM-NUM-9 * 100 + 1.
.          MOVE ITEMSEQNO-9 TO ITEMSEQNO OF DPODATAITM-PO-REC-O.
.          START DPODATAITM-PO-O KEY = PORCVNO OF DPODATAITM-PO-REC-O
.                                      ITEMSEQNO OF DPODATAITM-PO-REC-O.
JB         PERFORM 99-GETNEXT-DPODATAITM-PO-ITM-O.

           PERFORM UNTIL END-OF-CHAIN
             PERFORM 6625-DELETE-DATA-ITEM
JB           PERFORM 99-GETNEXT-DPODATAITM-PO-ITM-O
           END-PERFORM.

           IF GOOD-CALL

             PERFORM 9999-RESET-DPODATAITM-PO-O

           END-IF.

      *****************************************************************
      **        E R R O R   M E S S A G E S                          **
      *****************************************************************
       7210-NO-PO-ERROR.
      *------- THIS ERROR MESSAGE HAS BEEN SUPRESSED FOR AKRON
           IF NOT AKRON-PLANT
               MOVE "*PO NUMBER DOES NOT EXIST *27*" TO ERR-MSG
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE.

       7215-NO-ITEM-ERROR.
           IF BLANKET-SW NOT = "Y"
               MOVE "*ITEM DOES NOT EXIST, COMMENT NOT ADDED*78*"
                       TO ERR-MSG
               MOVE "             ITEM#" TO   ITEM-LIT
               MOVE IN-DATA-ITM-NUMBER-9 TO   ITEM-VALUE
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE.

       7220-CONTAINER-ERROR.
           MOVE "* CONTAINER ITEM PASSED WITHOUT TRUE ITEM *32.6*"
               TO  ERR-MSG.
           MOVE "Y"                      TO   ERR-SW.

      *------- SINCE BLANKETS ARE PASSED TO ALL PLANTS IN AKRON, DONT
      *------- PRINT THIS ERROR FOR BLANKETS
           IF BLANKET-SW NOT = "Y"
               PERFORM 7600-WRITE-REPORT-LINE.

       7225-NO-ITEM-ERROR.
           MOVE "*ITEM DOES NOT EXIST, PO NOT MODIFIED *"
                   TO ERR-MSG.
           MOVE "             ITEM#" TO   ITEM-LIT.
           MOVE IN-MEXICO-ITEM       TO   ITEM-VALUE.
           MOVE "Y"                  TO   ERR-SW.
           PERFORM 7600-WRITE-REPORT-LINE.

      *****************************************************************
      **       E D I T   P O   H E A D E R                           **
      *****************************************************************
       7300-EDIT-MOVE-PO-HEADER.
      *------- AKRON MAY SEND A PO NUMBER THAT ALREADY EXISTS, BUT IS
      *------- ACTUALLY A DIFFERENT PO.  THIS IS DETERMINED BY PO DATE-
      *------- PO# WILL EQUAL BUT PO DATE WILL BE DIFFERENT.
      *------- PO DATE CANNOT BE MODIFIED UNLESS IT WAS SPACES.
           IF AKRON-PLANT
               IF IN-RCV-DEPT-1-3  =  "120"
                   IF IN-RCV-DEPT-4  =  SPACES
                       MOVE "A"          TO   IN-RCV-DEPT-4.

           IF IN-VENDOR-CODE8-10 = SPACES
               MOVE "000"                TO   IN-VENDOR-CODE8-10.

           IF IN-VENDOR-NAME = SPACES
               MOVE "*VENDOR NAME EQUALS SPACES*22*"
                   TO ERR-MSG
               MOVE "        VENDOR CODE"    TO ITEM-LIT
               MOVE IN-VENDOR-CODE           TO ITEM-VALUE
               PERFORM 7600-WRITE-REPORT-LINE.

      *------- CHECK PO DATE
           MOVE IN-PO-DATE-MM            TO   BUILD-PO-DATE-MM.
           MOVE IN-PO-DATE-DD            TO   BUILD-PO-DATE-DD.
           MOVE IN-PO-DATE-YY            TO   BUILD-PO-DATE-YY.
           IF BUILD-PO-DATE-YY = "  "
               MOVE "  "                 TO   BUILD-PO-DATE-CC
           ELSE
           IF BUILD-PO-DATE-YY > "70"
               MOVE "19"                 TO   BUILD-PO-DATE-CC
           ELSE
           MOVE "20"                     TO   BUILD-PO-DATE-CC.

           IF IN-PO-DATE  NOT NUMERIC
               MOVE "*PO DATE NOT NUMERIC*15.1*"  TO ERR-MSG
               MOVE "PO DATE"            TO   ITEM-LIT
               MOVE IN-PO-DATE           TO   ITEM-VALUE
               PERFORM 7600-WRITE-REPORT-LINE
               IF RECORD-FUNCTION = "AH"
                   MOVE SPACES           TO   PO-DATE-CN
               END-IF
           ELSE
           IF RECORD-FUNCTION = "AH"
               MOVE BUILD-PO-DATE-CN     TO   PO-DATE-CN
           ELSE
      *    ** FUNCTION IS MODIFY **
           IF PO-DATE-CN = SPACES
               MOVE BUILD-PO-DATE-CN     TO   PO-DATE-CN
           ELSE
           IF BUILD-PO-DATE-CN NOT = PO-DATE-CN
               MOVE BUILD-PO    TO DUPLICATE-PO-NO
               MOVE "* DUPLICATE PO NUMBER*5.6" TO ERR-MSG
               MOVE "            PO DATE"  TO ITEM-LIT
               MOVE PO-DATE        TO ITEM-VALUE
               MOVE "        NEW PO DATE"  TO ITEM-LIT-2
               MOVE BUILD-PO-DATE  TO ITEM-VALUE-2
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 7320-EMPH-X.

      *------- CHECK PO TERMS
           MOVE IN-PO-PCT             TO  BUILD-TM-DISCOUNT-VALUE.
           MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
      *        "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
               MOVE "9Z"                 TO   IN-PO-TERMS
           ELSE
               MOVE IN-PO-DUE-DTE        TO   BUILD-TM-DATE-VALUE
               MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG
               PERFORM 9999-GETKEY-MPLTINFO-PK-I
               IF NO-ENTRY
      *            "INVALID PAYMENT TERMS; TERMS DOES NOT EXIST"
                   MOVE "9Z"             TO   IN-PO-TERMS
               END-IF
           END-IF.

           IF IN-BUYER-CODE > SPACES
               MOVE IN-BUYER-CODE        TO   BUYER-ARG
               PERFORM 9999-GETKEY-MBUYER-BY-I
               IF GOOD-CALL
                 MOVE IN-BUYER-CODE TO PO-BUYER-CODE
               END-IF
           END-IF.

      *------- MOVE PO DATA
           MOVE IN-PO-REQ-NUM            TO   PO-REQ-NUMBER.
           MOVE IN-PO-FOR-DEPT           TO   PO-FOR-DEPT.
           MOVE IN-PO-PLT                TO   PO-PLT.
           MOVE IN-PO-BLDG               TO   PO-BLDG.
      *    MOVE IN-PO-ACCTG-INFO         TO   PO-ACCTG-INFO.
      *------- CHANGED THE ABOVE 22 CHARACTER MOVE TO FIELD MOVES WHEN
      *------- IT WAS REPORTED THAT THE DEPARTMENT AND ADDITIONAL DATA
      *------- FIELDS WERE GETTING SKEWED ON AKRON DOWNLOADED PO'S.
           MOVE IN-PO-COMPANY            TO   PO-CO.
           MOVE IN-PO-PRIME              TO   PO-PRIME.
           MOVE IN-PO-SUB                TO   PO-SUB.
           MOVE IN-PO-SUB-DETL           TO   PO-SUB-DET.
           MOVE IN-PO-ADDL-DATA          TO   PO-ADDL-DATA.
           MOVE IN-PO-BUYER              TO   PO-BUYER-TYP.
           MOVE IN-PO-ADDTL-INFO         TO   PO-ADDL-INFO.
           MOVE IN-PO-VIA                TO   PO-VIA.
           MOVE IN-PO-TERMS              TO   PO-TERMS.
           MOVE IN-PO-RCV-DEPT           TO   PO-RCV-DEPT.
9303CK     IF IN-INVOICELESS-IND = "Y"
  .           MOVE "X"                   TO   PO-INVOICELESS-IND
  .        ELSE
9303CK        MOVE SPACES                TO   PO-INVOICELESS-IND.

      *------ DEFAULT CERTAIN ITEMS THAT ARE NOT PASSED ON ANY INPUT
      *------ RECORD.
           MOVE "AKR"                    TO   PO-TYPIST.

           IF FROM-QUOTE = "Y"
              MOVE "Q" TO PO-CREATE-TYPE.

      *------- KELLY PASSED SPECIAL INDICATORS FOR BLANKET ORDER,
      *------- RAW MATERIAL INDICATOR (PO TYPE = 2)
           IF KELLY-PLANT
               MOVE K-PO-TYPE            TO   PO-TYPE
               MOVE K-BLANKET-INDIC      TO   PO-BLANKET-INDIC.

      *------- CHECK FOB CODE
           MOVE IN-PO-FOB                TO   BUILD-FOB-VALUE.
           MOVE BUILD-FOB-KEY            TO   PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
             MOVE IN-PO-FOB TO PO-FOB
           ELSE
             MOVE MPLTINFO-FOB TO PO-FOB
           END-IF.

           IF IN-PO-BUDGET-AMT-9 NOT NUMERIC
               MOVE "*BUDGET AMOUNT NOT NUMERIC*9*"  TO ERR-MSG
               MOVE "BAD BUDGET AMT."         TO   ITEM-LIT
               MOVE IN-PO-BUDGET-AMT-X        TO   ITEM-VALUE
               PERFORM 7600-WRITE-REPORT-LINE
               IF RECORD-FUNCTION = "AH"
                   MOVE ZEROS            TO   PO-BUDGET-AMT
               ELSE
               NEXT SENTENCE
           ELSE
               MOVE IN-PO-BUDGET-AMT-9        TO PO-BUDGET-AMT.

      ****************************************************
      *  EDIT EXPECTED OR EXPIRATION DATE. IF THIS IS A  *
      *  A BLANKET THEN IT IS EXPIRATION DATE WHICH IS A *
      *  REQUIRED FIELD. OTHERWISE IT IS EXPECTED DELV.  *
      *  DATE. SHIP DATE IS ALSO CHECKED AND IF EXPECT.  *
      *  DELV. DATE IS SPACES SHIP DATE IS USED IF IT IS *
      *  NUMERIC                                         *
      ****************************************************

           MOVE IN-EXP-DATE-MM           TO   SAVE-EXPECT-MM.
           MOVE IN-EXP-DATE-DD           TO   SAVE-EXPECT-DD.
           MOVE IN-EXP-DATE-YY           TO   SAVE-EXPECT-YY.

      *-------- DON'T MOVE A CENTURY IF THE DATE IS EQUAL TO SPACES.
           IF IN-EXP-DATE = SPACES
               NEXT SENTENCE
           ELSE
           IF SAVE-EXPECT-YY > "70"
               MOVE "19"                 TO   SAVE-EXPECT-CC
           ELSE
               MOVE "20"                 TO   SAVE-EXPECT-CC.

           IF IN-EXP-DATE  =  SPACES
               IF BLANKET-SW  =  "Y"
                   MOVE
                   "* NO EXPIRATION DATE ON REQUIREMENTS ORDER*11.1*"
                                         TO   ERR-MSG
                   PERFORM 7600-WRITE-REPORT-LINE
                   IF RECORD-FUNCTION = "AH"
                       MOVE "Y"          TO   ERR-SW
                   END-IF
               ELSE
               MOVE SAVE-EXPECT-DATE-CN  TO   PO-EXPECT-DATE-CN
           ELSE
           IF IN-EXP-DATE  NUMERIC
               MOVE SAVE-EXPECT-DATE-CN  TO   PO-EXPECT-DATE-CN
           ELSE
           IF BLANKET-SW = "Y"
               MOVE "* EXPIRATION DATE NOT NUMERIC *21.3*"
                                         TO   ERR-MSG
               MOVE "EXPIRATION DATE"    TO   ITEM-LIT
               MOVE IN-EXP-DATE          TO   ITEM-VALUE
               IF RECORD-FUNCTION = "AH"
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
                   GO TO 7320-EMPH-X
               ELSE
                   PERFORM 7600-WRITE-REPORT-LINE
           ELSE
               MOVE "* EXPECTED DELIVERY DATE NOT NUMERIC *21.4*"
                                         TO   ERR-MSG
               MOVE "EXP DLVR DATE"      TO   ITEM-LIT
               MOVE IN-EXP-DATE          TO   ITEM-VALUE
               PERFORM 7600-WRITE-REPORT-LINE.

           IF IN-PO-SHIP-DATE NUMERIC
               MOVE IN-PO-SHIP-MM        TO   PO-SHIP-MM
               MOVE IN-PO-SHIP-DD        TO   PO-SHIP-DD
               MOVE IN-PO-SHIP-YY        TO   PO-SHIP-YY
               IF IN-PO-SHIP-YY = "  "
                   MOVE "  "             TO   PO-SHIP-DATE-CC
               ELSE
               IF IN-PO-SHIP-YY > "70"
                   MOVE "19"             TO   PO-SHIP-DATE-CC
               ELSE
                   MOVE "20"             TO   PO-SHIP-DATE-CC
               END-IF
           ELSE
      *--------- REMOVED CENTURY LOGIC HERE SINCE CORPORATE PURCHASING
      *--------- SOMETIMES SENDS LITERALS SUCH AS "BELOW", "AT ONC", ETC.
           IF IN-PO-SHIP-DATE NOT = SPACES
               MOVE IN-PO-SHIP-DATE      TO   PO-SHIP-DATE
               MOVE SPACES               TO   PO-SHIP-DATE-CC
           ELSE
               MOVE SPACES               TO   PO-SHIP-DATE
                                              PO-SHIP-DATE-CC.

           IF BLANKET-SW NOT = "Y"
               IF PO-EXPECT-DATE-CN = SPACES
                   IF PO-SHIP-DATE-CN NUMERIC
                       MOVE PO-SHIP-DATE-CN TO   PO-EXPECT-DATE-CN.

      *------- CHECK CURRENCY CODE
           IF IN-CURRENCY-CODE = SPACES
               MOVE IN-CURRENCY-CODE     TO   PO-CURRENCY-CODE
           ELSE
               MOVE IN-CURRENCY-CODE     TO   UM-ARG
               PERFORM 9999-GETKEY-MVALIDUM-UM-I
               IF NO-ENTRY
      *                "CURRENCY CODE DOES NOT EXIST"
                 MOVE "* INVALID CURRENCY CODE *21.4*"
                   TO  ERR-MSG
                 MOVE "CURRENCY CODE"  TO  ITEM-LIT
                 MOVE IN-CURRENCY-CODE TO  ITEM-VALUE
                 PERFORM 7600-WRITE-REPORT-LINE
                 MOVE SPACES           TO  IN-CURRENCY-CODE
               END-IF
           END-IF.
           MOVE IN-CURRENCY-CODE        TO  PO-CURRENCY-CODE.

       7320-EMPH-X.
           EXIT.

      *****************************************************************
      **     E D I T   I T E M   D E S C R I P T I O N               **
      *****************************************************************
       7330-EDIT-DATA-ITEM.
           IF BUILD-PO = DUPLICATE-PO-NO
               MOVE "Y"                  TO   ERR-SW
               GO TO 7340-EDI-X.
           IF IN-PO-DATA-LINE  =  SPACES
               MOVE "Y"                  TO   ERR-SW
               GO TO 7340-EDI-X.

      ****************************************************
      *  IF THIS IS DESC. FOR A CONTAINER DONT PROCESS
      *  IT SINCE WE DONT SAVE LINE INFORMATION FOR
      *   CONTAINERS
      *****************************************************

           IF IN-DATA-CONTAINER-INDIC NOT = SPACES
               MOVE "Y"                  TO   ERR-SW
               GO TO 7340-EDI-X.

           IF IN-DATA-LINE-NUMBER  NOT NUMERIC
               MOVE "*DESC OR COMMENT LINE# NOT NUMERIC, NO PROCESSING D
      -            "ONE*72*"  TO ERR-MSG
               MOVE "NON NUMERIC LINE #"     TO ITEM-LIT-2
               MOVE IN-DATA-LINE-NUMBER      TO ITEM-VALUE-2
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 7340-EDI-X.

           IF (IN-DATA-ITM-NUMBER = "0000") OR
             (IN-DATA-ITM-NUMBER NOT NUMERIC)
               MOVE "*ITEM # EQUALS ZERO OR NOT NUMERIC*76*" TO ERR-MSG
               MOVE "LINE NUMBER"             TO ITEM-LIT-2
               MOVE IN-DATA-LINE-NUMBER       TO ITEM-VALUE-2
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE.

      *------- DONT PROCESS THE 99 DESC RECORD FROM AKRON, WHICH JUST
      *------- DUPLICATES THE ACCOUNTING DATA
           IF IN-DATA-LINE-NUMBER-9 = 99
               MOVE "Y"                  TO   ERR-SW.

       7340-EDI-X.
           EXIT.

      *****************************************************************
      **        E D I T   I T E M   N U M B E R                      **
      *****************************************************************
       7350-EDIT-ITEM.
           IF BUILD-PO = DUPLICATE-PO-NO
               MOVE "Y"                  TO   ERR-SW
               GO TO 7360-EI-X.

      ************************************************
      *   CONSTRUCTION RELEASES MUST BE NON-CODED.   *
      *   THE CONST-PO-SW THAT WAS SET IN THE HEADER *
      *   DATA IS USED TO CHECK THIS.                *
      ************************************************

           IF PO-TRANS = "3"
             IF CONST-PO-SW  =  "Y"
               MOVE "* CONSTRUCTION RELEASE P.O.s MUST BE NON-CODED *"
                   TO  ERR-MSG
               MOVE "CORPORATE CODE"         TO ITEM-LIT-2
               MOVE IN-CORP-CODE             TO ITEM-VALUE-2
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 7360-EI-X.

      *************************************************
      *  CHECK TO MAKE SURE THAT THE NON-CODED ITEM   *
      *  IS NOT A BLANKET ORDER SINCE ALL BLANKETS    *
      *  M U S T   B E   C O D E D ||||||||||||       *
      *************************************************

           IF PO-TRANS = "4"
             IF CARTER-PLANT OR DECATUR-PLANT OR COLLING-PLANT
                 NEXT SENTENCE
             ELSE
             IF BLANKET-SW  =  "Y"
               MOVE "* ITEM NOT CODED ON REQUIREMENTS ORDER *54.1*"
                   TO  ERR-MSG
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 7360-EI-X.

           IF (IN-ITM-NUM NOT NUMERIC) OR (IN-ITM-NUM = "0000")
               MOVE "*ITEM # IS ZERO OR IS NOT NUMERIC*30*" TO ERR-MSG
               MOVE "Y"                  TO   ERR-SW
               PERFORM 7600-WRITE-REPORT-LINE
               GO TO 7360-EI-X.

           IF PO-TRANS = "3"
               IF IN-ITM-NUM  =  "9980"
                   MOVE "9980000"         TO IN-CORP-CODE.

       7360-EI-X.
           EXIT.

      *****************************************************************
      **    E D I T   I T E M   U N I T   O F   M E A S U R E        **
      *****************************************************************
       7370-EDIT-STR-ITM.
      *------- HANDLING OF INVALID UM: ON BLANKETS, THE PASSED UM MUST
      *------- BE USED EVEN IF INVALID, WHETHER MODIFYING OR ADDING THE
      *------- ITEM.  OTHERWISE, IF ADDING, SUBSTITUTE STR UM, IF
      *------- MODIFYING, THE RECORD IS NOT PROCESSED.
           IF IN-ITM-QTY-ORD-9  NOT NUMERIC
               MOVE "*QTY ORDERED NONNUMERIC *47*"
                   TO ERR-MSG
               MOVE "BAD ORDER QTY"                 TO ITEM-LIT-2
               MOVE IN-ITM-QTY-ORD-X                TO ITEM-VALUE-2
               IF RECORD-FUNCTION = "MI"
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
                   GO TO 7380-ESI-X
               ELSE
                   MOVE ZEROS            TO   IN-ITM-QTY-ORD-9
                   PERFORM 7600-WRITE-REPORT-LINE.

           IF IN-ITM-UNIT-PRICE-9    NOT NUMERIC
               MOVE "*UNIT PRICE NONNUMERIC *48*"
                   TO ERR-MSG
               MOVE "BAD PRICE"                    TO ITEM-LIT-2
               MOVE IN-ITM-UNIT-PRICE-X            TO ITEM-VALUE-2
               IF RECORD-FUNCTION = "MI"
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
                   GO TO 7380-ESI-X
               ELSE
                   MOVE ZEROS            TO   IN-ITM-UNIT-PRICE-9
                   PERFORM 7600-WRITE-REPORT-LINE.

      *------- NO FURTHER EDITS ON NON-STR
           IF IN-CORP-CODE = "NON-STR"
               GO TO 7380-ESI-X.

      *------- IF NO UM PASSED, DEFAULT IT TO "EACH"
           IF IN-ITM-QTY-UM = SPACES
               MOVE "EA"                 TO   IN-ITM-QTY-UM.
           IF IN-ITM-PRICE-UM = SPACES
               MOVE "EA"                 TO   IN-ITM-PRICE-UM.

           IF IN-ITM-QTY-UM = STR-UM OR STR-UM1 OR STR-UM2
               NEXT SENTENCE
           ELSE
               MOVE "*ORDER UM NOT A VALID STORE ROOM UM*50"
                                 TO ERR-MSG
               MOVE "BAD ORDER UM"       TO   ITEM-LIT-2
               MOVE IN-ITM-QTY-UM        TO   ITEM-VALUE-2
               MOVE IN-CORP-CODE         TO   ITEM-LIT-3
               MOVE IN-ITM-QTY-ORD-9     TO   ITEM-VALUE-3-9
               IF RECORD-FUNCTION = "MI"
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
               ELSE
                   PERFORM 7600-WRITE-REPORT-LINE
                   MOVE ZEROS            TO   IN-ITM-QTY-ORD-9
                   MOVE STR-UM           TO   IN-ITM-QTY-UM.

           IF IN-ITM-PRICE-UM = STR-UM OR STR-UM1 OR STR-UM2
               NEXT SENTENCE
           ELSE
               MOVE "*PRICE UM NOT A VALID STORE ROOM UM*52*"
                                         TO   ERR-MSG
               MOVE "BAD PRICE UM"       TO   ITEM-LIT-2
               MOVE IN-ITM-PRICE-UM      TO   ITEM-VALUE-2
               MOVE IN-CORP-CODE         TO   ITEM-LIT-3
               MOVE IN-ITM-QTY-ORD-9     TO   ITEM-VALUE-3-9
               IF RECORD-FUNCTION = "MI"
                   MOVE "Y"              TO   ERR-SW
                   PERFORM 7600-WRITE-REPORT-LINE
               ELSE
                   PERFORM 7600-WRITE-REPORT-LINE
                   MOVE ZEROS            TO   IN-ITM-UNIT-PRICE-9
                   MOVE STR-UM           TO   IN-ITM-PRICE-UM.

       7380-ESI-X.
           EXIT.

      *****************************************************************
      ** A D D   N E W   D V E N D O R :   A K R O N / K E L L Y     **
      *****************************************************************
       7500-ADD-DVENDOR.
           MOVE "DVENDOR;"     TO  DSET-NAME.
           MOVE SPACES         TO  BUF-DVENDOR.
           MOVE IN-VENDOR-CODE TO  VEN-VEN-CODE.
           MOVE ZEROS          TO  VEN-ITM-NO.
           MOVE IN-VENDOR-NAME TO  VEN-NAME.
           IF IN-VENDOR-NAME NOT = SPACES
             PERFORM 9999-PUT-DVENDOR-VN-O
             PERFORM 7503-PUT-KVENDOR.

      *------- FOR KELLY PLANTS, 2 ADDRESS LINES ARE ALSO PASSED.
           IF KELLY-PLANT
             IF K-VENDOR-ADDR-1 NOT = SPACES
               MOVE K-VENDOR-ADDR-1  TO   VEN-ADDRESS
               MOVE 1                TO   VEN-ITM-NO
               PERFORM 9999-PUT-DVENDOR-VN-O
             END-IF
             IF K-VENDOR-ADDR-LAST NOT = SPACES
               MOVE K-VENDOR-ADDR-LAST TO VEN-ADDRESS
               MOVE 2                TO   VEN-ITM-NO
               PERFORM 9999-PUT-DVENDOR-VN-O
             END-IF
           END-IF.


       7503-PUT-KVENDOR.
      *
      * IF RECORD ALREADY EXISTS THEN DELETE IT AND ADD IT BACK
      *
           PERFORM 9999-GETKEY-KVENDOR-VN-O.
           IF GOOD-CALL
             PERFORM 9999-DELETE-KVENDOR-VN-O
           END-IF.
           MOVE VEN-VEN-CODE TO KVENDOR-CODE.
           MOVE VEN-NAME TO KVENDOR-NAME.
           PERFORM 9999-PUT-KVENDOR-VN-O.

      *****************************************************************
      ** A D D   T E M P   V E N D O R :   P L A N T S               **
      *****************************************************************
      *7505-ADD-TEMP-DVENDOR.
      *    MOVE PO-NUM                 TO  T-VEN-NUM-2-7.
      *    MOVE PO-REL                 TO  T-VEN-NUM-8-10.
      *    PERFORM 7507-CHECK-FOR-DUP-T-VEN.
      *    MOVE "* VENDOR CODE NOT ON FILE TEMPORARY VENDOR ASSIGNED *26
      *         ".1*"  TO  ERR-MSG.
      *    MOVE "        VENDOR CODE"  TO  ITEM-LIT.
      *    MOVE IN-VENDOR-CODE         TO  ITEM-VALUE.
      *    MOVE "   TEMPORARY VENDOR"  TO  ITEM-LIT-2.
      *    MOVE BUILD-T-VEN-KEY        TO  ITEM-VALUE-2.
      *    PERFORM 7600-WRITE-REPORT-LINE.
      *    MOVE BUILD-T-VEN-KEY        TO  IN-VENDOR-CODE.
      *    MOVE "DVENDOR;"             TO  DSET-NAME.
      *    MOVE SPACES                 TO  BUF-DVENDOR.
      *    MOVE IN-VENDOR-CODE         TO  VEN-VEN-CODE.
      *    MOVE ZEROS                  TO  VEN-ITM-NO.
      *    MOVE IN-VENDOR-NAME         TO  VEN-NAME.
      *    PERFORM 9999-PUT-DVENDOR-VN-O.
      *    PERFORM 7503-PUT-KVENDOR.

      *7507-CHECK-FOR-DUP-T-VEN.
      *    MOVE BUILD-T-VEN-KEY TO VEN-ARG.
      *    PERFORM 9999-CHAINHD-DVENDOR-VN-O.
      *    PERFORM 9999-GETNEXT-DVENDOR-VN-O.
      *    PERFORM UNTIL END-OF-CHAIN

      *      ADD 1 TO T-VEN-NUM-8-10-R
      *      MOVE BUILD-T-VEN-KEY TO VEN-ARG
      *      PERFORM 9999-CHAINHD-DVENDOR-VN-O
      *      PERFORM 9999-GETNEXT-DVENDOR-VN-O

      *    END-PERFORM.

      *****************************************************************
      **       V E N D O R   C H A N G E                             **
      *****************************************************************
       7510-VENDOR-CHANGE.
      *------- FOR AKRON/KELLY, IF OLD VENDOR NOT ON ANOTHER PO,
      *------- DELETE THE VENDOR.  FOR SUB PLANTS, IF OLD VENDOR
      *------- IS TEMPORARY, DELETE THE OLD VENDOR.
           IF AKRON-PLANT OR KELLY-PLANT
             MOVE PO-VEN-CODE TO VEN-ARG
             PERFORM 9999-CHAINHD-DPORECD-VN-I
             PERFORM 9999-GETNEXT-DPORECD-VN-I
             IF END-OF-CHAIN
               PERFORM 7570-DELETE-OLD-VENDOR
             END-IF
           ELSE
             IF PO-VEN-CODE-T = "T"
               PERFORM 7570-DELETE-OLD-VENDOR
             END-IF
           END-IF.

      *------- IF THE NEW VENDOR DOESNT EXIST, IF AKRON ADD THE VENDOR,
      *------- IF SUB-PLANTS ADD A TEMP VENDOR.  IF THE NEW VENDOR DOES
      *------- EXIST AND IF AKRON, CHANGE NAME ON DB IF DIFFERENT.
           PERFORM 7587-CHECK-NEW-VENDOR.
           IF END-OF-CHAIN
BG001 *        IF AKRON-PLANT OR KELLY-PLANT
                   PERFORM 7500-ADD-DVENDOR
BG001 *        ELSE
BG001 *            PERFORM 7505-ADD-TEMP-DVENDOR
           ELSE
           IF (AKRON-PLANT OR KELLY-PLANT) AND GOOD-CALL
               PERFORM 7580-CHECK-NEW-VEN-NAME THRU 7583-CNVN-X.

      *------- NOW DELETE OLD DVENDITM LINKS IF THEY HAVE NOT DATA,
      *------- AND ADD NEW DVENDITM LINKS IF THEY DONT ALREADY EXIST,
      *------- FOR EACH CODE ON THE PO.
           PERFORM 7530-UNLNKOLD-ADDNEW-DVENDITM.

       7520-VC-X.
           EXIT.

      *****************************************************************
      **  D V E N D I T M   L I N K S :   V E N   C H A N G E        **
      *****************************************************************
       7530-UNLNKOLD-ADDNEW-DVENDITM.

      *
      * FOR EACH ITEM ON THE PO, DELETE THE DVENDITM LINK
      * IF IT EXISTS AND CONTAINS NO DATA THEN
      * ADD THE LINK BETWEEN THE CORPORATE CODE AND THE
      * NEW VENDOR IF IT DOESN'T ALREADY EXIST
      *
           PERFORM 9999-CHAINHD-DPOITEM-PO-O.
           PERFORM 9999-GETNEXT-DPOITEM-PO-O.
           PERFORM UNTIL END-OF-CHAIN

      *
      * SKIP NOT-STOREROOM ITEMS
      *
             IF ITM-CORP-CODE NOT EQUAL "NON-STR"

      *
      * FIND THE DVENDITM FOR THAT CODE FOR THE OLD VENDOR
      *
               MOVE ITM-CORP-CODE TO CODE-ARG
               PERFORM 9999-CHAINHD-DVENDITM-CD-O
               PERFORM 9999-GETNEXT-DVENDITM-CD-O
               PERFORM UNTIL END-OF-CHAIN OR
                             PO-VEN-CODE EQUAL VEN-ITM-VENCODE

                 PERFORM 9999-GETNEXT-DVENDITM-CD-O

               END-PERFORM

      *
      * IF A LINK WAS FOUND FOR THIS CODE AND VENDOR THEN
      * IF IT DOESN'T HAVE ANY DATA DELETE IT
      *
               IF GOOD-CALL
                   IF VEN-ITM-LT1 = 0 AND VEN-ITM-LT2 = 0
                   AND VEN-ITM-LT3 = 0 AND VEN-QUOTE-FLAG NOT = "Q"
                       MOVE "DVENDITM;" TO DSET-NAME
                       PERFORM 9999-DELETE-DVENDITM-CD-O
                   ELSE
                       PERFORM 9999-RESET-DVENDITM-CD-O
                   END-IF
               END-IF

      *
      * CHECK FOR A DVENDITM LINK FOR THE NEW VENDOR
      *
               MOVE IN-VENDOR-CODE TO VEN-ARG
               PERFORM 9999-CHAINHD-DVENDITM-VN-I
               PERFORM 9999-GETNEXT-DVENDITM-VN-I
               PERFORM UNTIL END-OF-CHAIN OR
                             VEN-ITM-CORPCODE EQUAL ITM-CORP-CODE

                 PERFORM 9999-GETNEXT-DVENDITM-VN-I

               END-PERFORM

      *
      * IF A LINK BETWEEN THE NEW VENDOR AND THIS CODE DOESN'T
      * EXIST THEN ADD IT
      *
               IF END-OF-CHAIN

                 MOVE SPACES TO BUF-DVENDITM
                 MOVE IN-VENDOR-CODE TO VEN-ITM-VENCODE
                 MOVE ITM-CORP-CODE TO VEN-ITM-CORPCODE
                 MOVE ITM-UNIT-PRICE TO VEN-ITM-PRICE
                 MOVE ITM-PRICE-UM TO VEN-ITM-PRICE-UM
                 MOVE PO-DATE TO VEN-ITM-PRICE-DATE
                 MOVE ZEROS TO VEN-ITM-LT1, VEN-ITM-LT2,
                               VEN-ITM-LT3, VEN-BID-QTY,
                               VEN-ITM-YTD-BUS, VEN-EST-LT
                 PERFORM VARYING SUB FROM 1 BY 1
                         UNTIL SUB > 3

                   MOVE ZEROS TO VEN-LOW-QTY(SUB),
                                 VEN-HIGH-QTY(SUB),
                                 VEN-WORK-PRICE(SUB)

                 END-PERFORM
                 MOVE "DVENDITM;" TO DSET-NAME
                 PERFORM 9999-PUT-DVENDITM-CD-O

               END-IF

             END-IF

             PERFORM 9999-GETNEXT-DPOITEM-PO-O

           END-PERFORM.

       7570-DELETE-OLD-VENDOR.
           CALL "CVENDEL" USING RET-CODE, CALL-MODE, BASE,
             STATUS-AREA, PO-VEN-CODE, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

       7580-CHECK-NEW-VEN-NAME.
      *------- FOR AKRON AND KELLY, THE VENDOR FILE IS MAINTAINED BY THIS
      *------- PROGRAM.  FOR AKRON, ONLY VEN NAME IS MAINTAINED.  FOR
      *------- KELLY, VEN NAME AND 2 ADDRESS LINES ARE MAINTAINED.  THIS
      *------- PROC UPDATES ANY CHANGES IN NAME OR ADDRESS OF VENDORS.
           IF VEN-NAME NOT = IN-VENDOR-NAME
               MOVE "DVENDOR;"           TO   DSET-NAME
               MOVE IN-VENDOR-NAME       TO   VEN-NAME
               PERFORM 7503-PUT-KVENDOR
               PERFORM 9999-UPDATE-DVENDOR-VN-O
           ELSE
               PERFORM 9999-RESET-DVENDOR-VN-O.

           IF KELLY-PLANT
               PERFORM 7584-GET-UPDATE-DVENDOR UNTIL
                 (NOT GOOD-CALL) OR VEN-ITM-NO > 2
               PERFORM 9999-RESET-DVENDOR-VN-O.

       7583-CNVN-X.
           EXIT.

       7584-GET-UPDATE-DVENDOR.
      *------- FOR KELLY, UPDATE THE 2 ADDRESS LINES OF THE VENDOR
      *------- IF WHAT WAS PASSED DIFFERS FROM WHAT'S ON DB
           MOVE "DVENDOR;"               TO   DSET-NAME.
           PERFORM 9999-GETNEXT-DVENDOR-VN-O.
           IF VEN-ITM-NO = 1 AND
              VEN-ADDRESS NOT = K-VENDOR-ADDR-1

             MOVE K-VENDOR-ADDR-1 TO VEN-ADDRESS
             PERFORM 9999-UPDATE-DVENDOR-VN-O

           END-IF.
           IF VEN-ITM-NO = 2 AND
              VEN-ADDRESS NOT = K-VENDOR-ADDR-LAST

             MOVE K-VENDOR-ADDR-LAST TO VEN-ADDRESS
             PERFORM 9999-UPDATE-DVENDOR-VN-O

           END-IF.

       7587-CHECK-NEW-VENDOR.
           MOVE IN-VENDOR-CODE TO VEN-ARG.
           PERFORM 9999-CHAINHD-DVENDOR-VN-O.
           PERFORM 9999-GETNEXT-DVENDOR-VN-O.

      ******************************************************************
      **      M I S C E L L A N E O U S   R O U T I N E S             **
      ******************************************************************
       7600-WRITE-REPORT-LINE.
           IF (LINE-CTR = 0) OR (LINE-CTR > 50)
               PERFORM 7610-PAGE-HDR.
           MOVE PO-NUM-REL               TO   PRT-PO-NUM.
           IF PO-TRANS = "1" OR "2"
               MOVE SPACES               TO   PRT-ITEM-NUM
           ELSE
           IF PO-TRANS = "3" OR "4"
               MOVE IN-ITM-NUM           TO   PRT-ITEM-NUM
           ELSE
               MOVE IN-DATA-ITM-NUMBER   TO   PRT-ITEM-NUM.
           IF ERR-SW = "Y"
               MOVE "RECORD NOT PROCESSED" TO PRT-REC-PROCESSED
           ELSE
               MOVE "RECORD PROCESSED"   TO   PRT-REC-PROCESSED.
           MOVE RECORD-FUNCTION-DESC     TO   PRT-RECORD-FUNCTION.
           MOVE ERROR-RECORD             TO   PO-ERROR-LINE.
           MOVE 2  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           MOVE ERROR-MSG-LINE           TO   PO-ERROR-LINE.
           MOVE 1  TO  CTL.
           PERFORM 7605-WRITE-PO-ERROR-REC.
           ADD 3                         TO   LINE-CTR.
           MOVE SPACES                   TO   ERROR-RECORD.

       7605-WRITE-PO-ERROR-REC.
           MOVE PO-ERROR-LINE            TO   PRINT-REC.
           WRITE PO-ERROR-REC.
      *------ ALSO WRITE THE ERROR TO THE PO REPORT
           WRITE PRINT-REC AFTER ADVANCING 1.
           ADD 1                         TO   POR-LINE-CTR.

       7610-PAGE-HDR.
           ADD 1                         TO   PAGE-CTR.
           MOVE PAGE-CTR            TO PAGE-NO-OUT.
           MOVE ERROR-HEADING       TO PO-ERROR-LINE.
           MOVE 0  TO  CTL.
           WRITE PO-ERROR-REC.
           MOVE DASH-LINE           TO PO-ERROR-LINE.
           MOVE 1  TO  CTL.
           WRITE PO-ERROR-REC.
           MOVE ZEROS               TO LINE-CTR.

       7620-POR-HDR.
           ADD 1                         TO   POR-PAGE-CTR.
           MOVE POR-PAGE-CTR             TO   POR-PRT-PAGE.
           WRITE PRINT-REC FROM PORPT-HEADER-1 AFTER ADVANCING NEW-PAGE.
           MOVE 1                        TO   POR-LINE-CTR.

       7622-HDR-PRINT.
           IF POR-LINE-CTR > 55
               PERFORM 7620-POR-HDR.
           MOVE PO-INPUT-NUM             TO   POR-PO-NUMBER.
           MOVE IN-PO-DATE-MM            TO   YMD-MM.
           MOVE IN-PO-DATE-DD            TO   YMD-DD.
           MOVE IN-PO-DATE-YY            TO   YMD-YY.
           MOVE 4                        TO   DATE-MODE.
           MOVE YMD-DATE                 TO   DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT           TO   POR-PO-DATE.
           MOVE IN-VENDOR-CODE           TO   POR-VENDOR-CODE.
           MOVE IN-VENDOR-NAME           TO   POR-VENDOR-NAME.
           WRITE PRINT-REC FROM PORPT-HEADER AFTER ADVANCING 2.
           ADD 2                         TO   POR-LINE-CTR.

       7624-ITEM-PRINT.
           IF POR-LINE-CTR > 55
               PERFORM 7620-POR-HDR.
           MOVE IN-ITM-NUM               TO   POR-ITEM.
           MOVE IN-CORP-CODE             TO   POR-CORP-CODE.
           IF IN-ITM-QTY-ORD-X = "            "
               NEXT SENTENCE
           ELSE
           MOVE IN-ITM-QTY-ORD-9         TO   POR-QTY.
           MOVE IN-ITM-QTY-UM            TO   POR-QTY-UM.
           IF IN-ITM-UNIT-PRICE-X = "            "
               NEXT SENTENCE
           ELSE
           MOVE IN-ITM-UNIT-PRICE-9      TO   POR-PRICE.
           MOVE IN-ITM-QTY-UM            TO   POR-PRICE-UM.
           WRITE PRINT-REC FROM PORPT-ITEM AFTER ADVANCING 1.
           ADD 1                         TO   POR-LINE-CTR.

       7625-ITEM-PRINT.
           IF POR-LINE-CTR > 55
               PERFORM 7620-POR-HDR.
           MOVE IN-MEXICO-ITEM           TO   POR-ITEM.
           MOVE SPACES                   TO   POR-CORP-CODE.
           MOVE IN-MEXICO-QTY-ORD        TO   POR-QTY.
           MOVE IN-MEXICO-QTY-ORD-UM     TO   POR-QTY-UM.
           MOVE IN-MEXICO-UNIT-PRICE     TO   POR-PRICE.
           MOVE IN-MEXICO-UNIT-PRICE-UM  TO   POR-PRICE-UM.
           WRITE PRINT-REC FROM PORPT-ITEM AFTER ADVANCING 1.
           ADD 1                         TO   POR-LINE-CTR.

       7626-DESC-PRINT.
           IF POR-LINE-CTR > 55
               PERFORM 7620-POR-HDR.
           MOVE 3                        TO   CDESC-LINES-TO-GET.
           MOVE "N"                      TO   CDESC-LOCAL-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, IN-CORP-CODE, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

           IF CDESC-LINES-GOT > 0 AND CDESC-RET-CODE = "00"
               ADD 1                     TO   POR-LINE-CTR
               MOVE CDESC (1)            TO   POR-DESC
               WRITE PRINT-REC FROM PORPT-DESC AFTER ADVANCING 1
               IF CDESC-LINES-GOT > 1
                   ADD 1                 TO   POR-LINE-CTR
                   MOVE CDESC (2)        TO   POR-DESC
                   WRITE PRINT-REC FROM PORPT-DESC AFTER ADVANCING 1
                   IF CDESC-LINES-GOT > 2
                       ADD 1             TO   POR-LINE-CTR
                       MOVE CDESC (3)    TO   POR-DESC
                       WRITE PRINT-REC FROM PORPT-DESC
                         AFTER ADVANCING 1.

       7660-ADD-TO-DESC-LINE-NO.
      *------- KELLY GENERATED POS START WITH 01, THEY ARE OK.  AKRON-
      *------- GENERATED START WITH 00, SO WE MUST ADD 1 TO THEM.
      *------- IF REQUIRED DATE FIELD IS SENT, THERE WILL BE 2 ZERO
      *------- SEQUENCE NUMBER RECORDS IN A ROW; THEREFORE, ADD 2.
           IF NOT KELLY-PLANT
               IF IN-DATA-LINE-NUMBER-9 = 0
                   IF IN-PO-DATA-LINE (1:14) = "REQUIRED DATE:"
                       MOVE 1             TO   IN-DATA-LINE-NUMBER-9
                       MOVE "Y"           TO   ADD-2-SW
                   ELSE
                   IF ADD-2-SW = "Y"
                       MOVE 2             TO   IN-DATA-LINE-NUMBER-9
                   ELSE
                       ADD 1              TO   IN-DATA-LINE-NUMBER-9
                   END-IF
               ELSE
                   IF ADD-2-SW = "Y"
                       ADD 2              TO   IN-DATA-LINE-NUMBER-9
                   ELSE
                       ADD 1              TO   IN-DATA-LINE-NUMBER-9.

       7670-FIND-HEADER-LABEL.
           MOVE "N"                      TO   EOF-SW.
           READ INPUT-PO-FILE AT END
               MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE "Y"                  TO   EOF-SW
               GO TO 7675-FHL-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ INPUT FILE ERR 7670-FHL" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE INPUT-PO-REC TO FILE-HEADER-LABEL.

           IF HEADER-LABEL = "PURCHASE ORDERS" OR "PURCHASE DELETE"
               MOVE IN-QUOTE TO SAVE-IN-QUOTE
               GO TO 7675-FHL-X
           ELSE
               GO TO 7670-FIND-HEADER-LABEL.

       7675-FHL-X.
           EXIT.

       7680-READ-INPUT-PO-FILE.
           READ INPUT-PO-FILE AT END
               MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE "Y"                  TO   EOF-SW
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ INPUT FILE ERR 7680-RIPF" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE INPUT-PO-REC TO FILE-HEADER-LABEL.

      *****************************************************************
      **     D D A I L Y T C   T R A N S A C T I O N S               **
      *****************************************************************
       7700-BUILD-DDAILYTC-PO.
      *------- 360 TRANSACTION FOR PO HEADER
           MOVE SPACES               TO  BUF-DDAILYTC.
           PERFORM 7790-MOVE-DDAILYTC-DATE-TIME.
           MOVE TC-TYPE-SAVE         TO  DDAILYTC-TC.
           MOVE COMPANY-SAVE         TO  DDAILYTC-PLT.
           MOVE PO-RLSE              TO  TC360-PO-RLS.
           MOVE PO-FOB               TO  TC360-PO-FOB.
           MOVE PO-VEN-CODE1-7       TO  TC360-VENDOR-CODE.
           MOVE PO-TERMS             TO  TC360-PO-TERMS.
           MOVE PO-CURRENCY-CODE     TO  TC360-CURRENCY-CODE.
           MOVE IN-VENDOR-NAME       TO  TC360-VENDOR-NAME.

           MOVE "DDAILYTC;"          TO  DSET-NAME.
           PERFORM 9999-PUT-DDAILYTC-DT-O.

       7710-CUT-TC370.
      ******************************************************
      **  THIS ROUTINE CUTS TC 370s AND 371s FOR
      **  THE FIRST LINE OF NON-CODED ITEM DESCRIPTIONS
      ******************************************************

           PERFORM 7790-MOVE-DDAILYTC-DATE-TIME.
           MOVE COMPANY-SAVE            TO  DDAILYTC-PLT.
           MOVE PO-RLSE                 TO  TC370-PO-RLS.
           MOVE ITM-NUMBER              TO  TC370-ITEM-NO.
           MOVE "01"                    TO  TC370-LINE-NO.
           MOVE IN-PO-DATA-LINE         TO  TC370-NONCODED-DESC.
           MOVE "DDAILYTC;"             TO  DSET-NAME.
           PERFORM 9999-PUT-DDAILYTC-DT-O.

       7715-CUT-TC370-X.
           EXIT.

       7720-BUILD-DDAILYTC-ITM  .
      *------- NOTE: STC320 WILL CUT 320, 321, 322 TRANSACTIONS
      *------- ON MODIFY, THE BUDGET AMOUNT IN THE 322 WILL BE THE
      *------- DIFFERENCE FROM THE OLD BUDGET AND THE NEW BUDGET
           MOVE COMPANY-SAVE             TO   STC320-COMPANY-SAVE.
           MOVE ITM-CORP-CODE            TO   STC320-CODE.
           MOVE PO-RLSE                  TO   STC320-PO-NUM.
           MOVE IN-ITM-NUM               TO   STC320-ITEM.

           IF ITM-CORP-CODE = "NON-STR" AND KELLY-PLANT
               PERFORM 6675-CONVERT-TO-STR-UM
               MOVE ITM-UM               TO   STC320-QTY-UM
               MOVE ITM-QTY-ORD          TO   STC320-QTY
               MOVE ITM-UM               TO   STC320-PRICE-UM
               MOVE SAV-PRC-STR-UM       TO   STC320-PRICE
           ELSE
           IF ITM-CORP-CODE = "NON-STR"
               MOVE ITM-UM               TO   STC320-QTY-UM
               MOVE ITM-PRICE-UM         TO   STC320-PRICE-UM
               MOVE ITM-QTY-ORD          TO   STC320-QTY
               MOVE ITM-UNIT-PRICE       TO   STC320-PRICE
           ELSE
               MOVE STR-UM               TO   STC320-QTY-UM
                                              STC320-PRICE-UM
               PERFORM 6675-CONVERT-TO-STR-UM
               MOVE SAV-ORD-STR-UM       TO   STC320-QTY
               MOVE SAV-PRC-STR-UM       TO   STC320-PRICE.

           MOVE HOLD-REQ-NO              TO   STC320-REQ-NO.
           MOVE PO-BUDGET-NUMBER         TO   STC320-BUDGET-NO.
           MOVE ITM-CLASS                TO   STC320-SUB.
           MOVE ITM-SUB-DETL             TO   STC320-SUBD.
           MOVE ITM-ADDL-DATA            TO   STC320-ADDTL-DATA.
           MOVE IN-CURRENCY-CODE         TO   STC320-CUR-CODE.
           CALL "STC320" USING BASE,
                               STC320-PARMS,
                               STATUS-AREA,
                               BU-DISPLAY-MSG,
                               BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.

       7730-BDI-X.
           EXIT.

       7740-CUT-TC32D.
           MOVE SPACES                  TO  BUF-DDAILYTC.
           PERFORM 7790-MOVE-DDAILYTC-DATE-TIME.
           MOVE "32D"                   TO  DDAILYTC-TC.
           MOVE COMPANY-SAVE            TO  DDAILYTC-PLT.
           MOVE PO-RLSE                 TO  TC32D-PO-RLS.
           MOVE ITM-CORP-CODE           TO  TC32D-CORP-CODE.
           MOVE ITM-NUMBER              TO  TC32D-ITEM-NO.
           MOVE "DDAILYTC;"             TO  DSET-NAME.
           PERFORM 9999-PUT-DDAILYTC-DT-O.

       7750-CT-X.
           EXIT.

       7790-MOVE-DDAILYTC-DATE-TIME.
           MOVE 1                        TO   DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT             TO   DDAILYTC-DATE.
           MOVE DATE-UNFORMATTED-TIME-OUT TO  DDAILYTC-TIME.

       9999-OPENS.
           OPEN I-O MPLTINFO-PK-O, MPORCV-PO-O, DPORECD-PO-O,
             DPOITEM-PO-O, DPODATAITM-PO-O, MREQ-RQ-O,
             DREQD-RQ-O, DREQITM-RQ-O, DVENDOR-VN-O, KVENDOR-VN-O,
             DVENDITM-CD-O, DDAILYTC-DT-O, DREQD-PO-O, DTRAILER-PO-O.
           OPEN INPUT MVALIDUM-UM-I, DPORECD-VN-I,
             MSTORERM-CD-I, MBUYER-BY-I, DVENDITM-VN-I,
             MPORCV-PO-I, MPLTINFO-PK-I, DVENDITM-QT-I.

       9999-CLOSES.
           CLOSE MPLTINFO-PK-O, MPORCV-PO-O, DPORECD-PO-O,
             DPOITEM-PO-O, DPODATAITM-PO-O, MREQ-RQ-O,
             DREQD-RQ-O, DREQITM-RQ-O, DVENDOR-VN-O, KVENDOR-VN-O,
             DVENDITM-CD-O, DDAILYTC-DT-O,
             MVALIDUM-UM-I, DPORECD-VN-I, DVENDITM-QT-I
             MSTORERM-CD-I, MBUYER-BY-I, DVENDITM-VN-I,
             MPORCV-PO-I, MPLTINFO-PK-I, DREQD-PO-O, DTRAILER-PO-O.
           IF AKRON-PLANT
             CLOSE DPORECDH-I.

      *
      * DDAILYTC
      *
       9999-PUT-DDAILYTC-DT-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DT-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DDAILYTC-DT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DPODATAITM
      *

       9999-RESET-DPODATAITM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPODATAITM-PO-REC-O.
           START DPODATAITM-PO-O KEY > PORCVNO OF DPODATAITM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DELETE-DPODATAITM-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE DPODATAITM-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DPODATAITM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DPODATAITM-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DPODATAITM-PO-REC-O FROM BUF-DPODATAITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DPODATAITM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DPOITEM
      *
       9999-CHAINHD-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY = PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE DPOITEM-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-PO-O NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPOITEM-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPOITEM-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPOITEM-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DPOITEM-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPOITEM-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPOITEM-PO-REC-O.
           START DPOITEM-PO-O KEY > PORCVNO OF DPOITEM-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPOITEM-PO-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DPOITEM-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DPOITEM-PO-REC-O FROM BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DPOITEM-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DPORECD
      *
       9999-CHAINHD-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY = PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DPORECD-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DPORECD-VN-REC-I.
           START DPORECD-VN-I KEY = VENCDE OF DPORECD-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE DPORECD-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DPORECD-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DPORECD-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DPORECD-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-PO-REC-O.
           START DPORECD-PO-O KEY > PORCVNO OF DPORECD-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DPORECD-VN-I.
           MOVE 0 TO COND-WORD.
           READ DPORECD-VN-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DPORECD-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.

       9999-PUT-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DPORECD-PO-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DPORECD-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DPORECD-PO-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DPORECD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DREQD
      *
       9999-CHAINHD-DREQD-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DREQD-PO-REC-O.
           START DREQD-PO-O KEY = PORCVNO OF DREQD-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DREQD-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-RQ-REC-O.
           START DREQD-RQ-O KEY = REQNO OF DREQD-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQD-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DREQD-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQD-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DREQD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DREQD-RQ-O.
           MOVE 0 TO COND-WORD.
           DELETE DREQD-RQ-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DREQD-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DREQD-PO-O.
           MOVE 0 TO COND-WORD.
           READ DREQD-PO-O NEXT INTO BUF-DREQD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQD-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQD-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DREQD-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DREQD-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQD-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DREQD-PO-REC-O.
           START DREQD-PO-O KEY > PORCVNO OF DREQD-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DREQD-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQD-RQ-O NEXT INTO BUF-DREQD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQD-RQ-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQD-RQ-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REQNO OF DREQD-RQ-REC-O NOT = REQ-ARG
               PERFORM 9999-RESET-DREQD-RQ-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQD-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF DREQD-RQ-REC-O.
           START DREQD-RQ-O KEY > REQNO OF DREQD-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DREQD-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DREQD-PO-REC-O FROM BUF-DREQD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DREQD-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DREQD-RQ-O.
           MOVE 0 TO COND-WORD.
           WRITE DREQD-RQ-REC-O FROM BUF-DREQD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DREQD-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DREQITM
      *
       9999-CHAINHD-DREQITM-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-RQ-REC-O.
           START DREQITM-RQ-O KEY = REQNO OF DREQITM-RQ-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DREQITM-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DREQITM-RQ-O.
           MOVE 0 TO COND-WORD.
           READ DREQITM-RQ-O NEXT INTO BUF-DREQITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DREQITM-RQ-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DREQITM-RQ-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REQNO OF DREQITM-RQ-REC-O NOT = REQ-ARG
               PERFORM 9999-RESET-DREQITM-RQ-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DREQITM-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF DREQITM-RQ-REC-O.
           START DREQITM-RQ-O KEY > REQNO OF DREQITM-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DREQITM-RQ-O.
           MOVE 0 TO COND-WORD.
           WRITE DREQITM-RQ-REC-O FROM BUF-DREQITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DREQITM-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DTRAILER
      *
       9999-CHAINHD-DTRAILER-PO-O.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DTRAILER-PO-REC-O.
           START DTRAILER-PO-O KEY = PORCVNO OF DTRAILER-PO-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DTRAILER-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DTRAILER-PO-O.
           MOVE 0 TO COND-WORD.
           DELETE DTRAILER-PO-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DTRAILER-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DTRAILER-PO-O.
           MOVE 0 TO COND-WORD.
           READ DTRAILER-PO-O NEXT INTO BUF-DTRAILER
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DTRAILER-PO-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DTRAILER-PO-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DTRAILER-PO-REC-O NOT = PO-ARG
               PERFORM 9999-RESET-DTRAILER-PO-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DTRAILER-PO-O.
           MOVE HIGH-VALUES TO PORCVNO OF DTRAILER-PO-REC-O.
           START DTRAILER-PO-O KEY > PORCVNO OF DTRAILER-PO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-DTRAILER-PO-O.
           MOVE 0 TO COND-WORD.
           REWRITE DTRAILER-PO-REC-O FROM BUF-DTRAILER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DTRAILER-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-DTRAILER-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE DTRAILER-PO-REC-O FROM BUF-DTRAILER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DTRAILER-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DVENDITM
      *
       9999-CHAINHD-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-CD-REC-O.
           START DVENDITM-CD-O KEY = CORPCDE OF DVENDITM-CD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-CD-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DVENDITM-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDITM-VN-REC-I.
           START DVENDITM-VN-I KEY = VENCDE OF DVENDITM-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DVENDITM-QT-I.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DVENDITM-QT-REC-I.
           START DVENDITM-QT-I KEY = QUOTENUM OF DVENDITM-QT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-QT-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-CD-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDITM-CD-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-CD-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDITM-CD-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-CD-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF CORPCDE OF DVENDITM-CD-REC-O NOT = CODE-ARG
               PERFORM 9999-RESET-DVENDITM-CD-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDITM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF DVENDITM-CD-REC-O.
           START DVENDITM-CD-O KEY > CORPCDE OF DVENDITM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DVENDITM-VN-I.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-VN-I NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDITM-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.

       9999-GETNEXT-DVENDITM-QT-I.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-QT-I NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-QT-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF QUOTENUM OF DVENDITM-QT-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.

       9999-PUT-DVENDITM-CD-O.
           MOVE 0 TO COND-WORD.
           WRITE DVENDITM-CD-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DVENDITM-CD-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * DVENDOR
      *
       9999-CHAINHD-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY = VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-O NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDOR-VN-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-O NOT = VEN-ARG
               PERFORM 9999-RESET-DVENDOR-VN-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDOR-VN-O.
           MOVE HIGH-VALUES TO VENCDE OF DVENDOR-VN-REC-O.
           START DVENDOR-VN-O KEY > VENCDE OF DVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           WRITE DVENDOR-VN-REC-O FROM BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-UPDATE-DVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           REWRITE DVENDOR-VN-REC-O FROM BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * KVENDOR
      *
       9999-DELETE-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           DELETE KVENDOR-VN-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO KVENCDE OF KVENDOR-VN-REC-O.
           READ KVENDOR-VN-O INTO BUF-KVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-KVENDOR-VN-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-KVENDOR-VN-O.
           MOVE HIGH-VALUES TO KVENCDE OF KVENDOR-VN-REC-O.
           START KVENDOR-VN-O KEY > KVENCDE OF KVENDOR-VN-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-PUT-KVENDOR-VN-O.
           MOVE 0 TO COND-WORD.
           WRITE KVENDOR-VN-REC-O FROM BUF-KVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-KVENDOR-WK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MBUYER
      *
       9999-GETKEY-MBUYER-BY-I.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-BY-REC-I.
           READ MBUYER-BY-I INTO BUF-MBUYER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MBUYER-BY-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MPLTINFO
      *
       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MREQ
      *
       9999-GETKEY-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-RQ-REC-O.
           READ MREQ-RQ-O INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MREQ-RQ-O.
           MOVE HIGH-VALUES TO REQNO OF MREQ-RQ-REC-O.
           START MREQ-RQ-O KEY > REQNO OF MREQ-RQ-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           REWRITE MREQ-RQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-MREQ-RQ-O.
           MOVE 0 TO COND-WORD.
           WRITE MREQ-RQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MREQ-RQ-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MPORCV
      *
       9999-GETKEY-MPORCV-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF MPORCV-PO-REC-I.
           READ MPORCV-PO-I INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPORCV-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-PUT-MPORCV-PO-O.
           MOVE 0 TO COND-WORD.
           WRITE MPORCV-PO-REC-O FROM BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "PUT ERR 9999-PUT-MPORCV-PO-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MSTORERM
      *
       9999-GETKEY-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MSTORERM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

      *
      * MVALIDUM
      *
       9999-GETKEY-MVALIDUM-UM-I.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MVALIDUM-UM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

JB     99-GETNEXT-DPODATAITM-PO-ITM-O.
.          READ DPODATAITM-PO-O NEXT INTO BUF-DPODATAITM
.              AT END MOVE FILE-STATUS TO FILE-STATUS.
.          IF FILE-STATUS NOT = "00"
.              IF FILE-STATUS = "10" OR "14"
.                  PERFORM 9999-RESET-DPODATAITM-PO-O
.                  SET END-OF-CHAIN TO TRUE
.              ELSE
.              IF FILE-STATUS = "46"
.                  SET END-OF-CHAIN TO TRUE
.              ELSE
.                  MOVE 99 TO COND-WORD
.                  IF HANDLE-BLOWUP-FLAG = "Y"
.                      MOVE "GETNEXT ERR 9999-GETNEXT-DPODATAITM-PO-O"
.                          TO BU-MSG-AREA
.                      PERFORM 2100-BLOWUP
.                  END-IF
.          ELSE
DAP   *        *********************************************************
DAP   *        *** VERIFY THAT WE ARE STILL WORKING WITH THE DESIRED
DAP   *        *** PO/ITEM.  IF WE HAVE READ PAST THIS PO/ITEM, WE
DAP   *        *** HAVE REACHED THE "END-OF-CHAIN".
DAP   *        *********************************************************
DAP            IF   (DATAITM-PO-RCV-NO = PO-ARG)
DAP             AND (DATAITM-ITEM-NO-9 = IN-ITM-NUM-9)
DAP                NEXT SENTENCE
DAP            ELSE
DAP                PERFORM 9999-RESET-DPODATAITM-PO-O
DAP                SET END-OF-CHAIN TO TRUE.
      *
      * DPORECDH
      *
       9999-START-DPORECDH-I.
           MOVE BUILD-POH TO PORCVNO OF DPORECDH-REC-I.
           START DPORECDH-I KEY = PORCVNO OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-DPORECDH-I.
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.

DCR01  COPY POLOGSUBR2 IN COPYLIB.
