000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TLODCSAS.
000400 AUTHOR.               K MOVSESIAN.
000500 DATE-WRITTEN.         JAN. 7, 1988.
000600 INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000800*REMARKS.
001000**************************************************************
001100*                                                            *
001200*   T L O D C S A S   THIS IS AN INITIAL LOAD PROGRAM        *
001300*    FOR CORPORATE STORES ACCOUNTING.  THIS PROGRAM LOADS    *
001400*    THE CODE INFORMATION USING THE 'STORES' DATA BASE IN    *
001500*    CSIS.  THE ONHAND LESS ANY OPEN RECEIVABLES WILL BE     *
001600*    THE BEGINNING BALANCE UNITS. THE DOLLARS ARE CALCULATED *
001700*    USING AVERAGE COST AND BEGINNING UNITS.  THIS PROGRAM   *
001800*    CAN BE EXECUTED IN REPORT MODE OR UPDATE MODE.          *
001900*    THIS PROGRAM CAN BE USED BY A PLANT ALREADY LIVE ON     *
002000*    CSAS IN WHICH CASE IT WILL ONLY LOAD CODES NOT ALREADY  *
002100*    IN THE CSAS DATA BASE.  SINCE THE PLANT IS ALREADY LIVE *
002200*    THE UNITS AND VALUE ARE PLACED IN ACCOUNTING ADJUSTMENT *
002300*    UNITS AND DOLLARS INSTEAD OF BEGINNING UNITS AND DOLLARS*
002400*                                                            *
002500**************************************************************
002600*    17NOV89 DAP - ADDED LOGIC TO USE MARKET COST INSTEAD OF *
002700*                  AVERAGE COST IF AVERAGE COST IS EQUAL TO  *
002800*                  ZERO.                                     *
002900**************************************************************
003000*C  09/16/1992     DAVE PLUM     REQUEST #6256
003100*C  CHANGED ALL REFERENCES TO DATASET MCLASS FROM THE CSACCT
003200*C  DB TO THE STORES DB.
003300*C************************************************************
003400*C  09/29/1992     DAVE PLUM     REQUEST #6269
003500*C  ADDED SORTSPACE=5000 TO THE $CONTROL STATEMENT.  ALSO ADDED
003600*C  A SPECIFIED NUMBER OF RECORDS TO THE SORT-FILE SELECT STMT.
003700*C************************************************************
003800*C  05OCT1994      DAVE PLUM     REQUEST #6533
003900*C  RECOMPILED TO PICK UP A NEW FIELD IN MCLASS.
004000*C************************************************************
      *C  09MAY1995      CATHY ZUBEK
      *C    MODIFIED HP VERSION FOR AS/400 FOR CARTERSVILLE.
      *C************************************************************
      *C  16SEP1996      DAVE PLUM
      *C    REVISED FOR CENTURY DATABASE CHANGES.
      *C************************************************************
004100 ENVIRONMENT DIVISION.
004200 CONFIGURATION SECTION.
004300 SOURCE-COMPUTER.      IBM-AS400.
004400 OBJECT-COMPUTER.      IBM-AS400.
004500 SPECIAL-NAMES.        C01 IS NEW-PAGE.
004600
004700 INPUT-OUTPUT SECTION.
004800 FILE-CONTROL.

           SELECT MATLACCUM-O
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-O
                  ASSIGN TO DATABASE-MCFLCA0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MACTINFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
               ASSIGN TO DATABASE-MCFLCS1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MCHTACCTS-I
                  ASSIGN TO DATABASE-MCFLCA0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.
005100
005200 DATA DIVISION.
005300
005400 FILE SECTION.

       FD  MATLACCUM-O
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-REC-O.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  DTRANS-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-O.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MACTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1001.

       FD  MCHTACCTS-I
           LABEL RECORDS ARE STANDARD.
       01  MCHTACCTS-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-MCRPCS4900  OF MCFLCS4901.

       FD  ONLINE-PRT
           DATA RECORD IS PRT-REC
           RECORD CONTAINS 133 CHARACTERS
           LABEL RECORDS ARE OMITTED.
       01  PRT-REC                       PIC X(133).

006200 SD  SORT-FILE
006300     DATA RECORD IS SORT-REC
006400     RECORD CONTAINS 63  CHARACTERS.
006500 01  SORT-REC.
006600     05  SORT-CODE                PIC X(8).
006700     05  SORT-CLASS               PIC X(3).
006800     05  SORT-ONHAND              PIC S9(8).
006900     05  SORT-AVG-COST            PIC S9(11)V9(4).
007000     05  SORT-WD-INDIC            PIC X(1).
007100     05  SORT-DFLT-DEPT           PIC X(4).
007200     05  SORT-UM                  PIC X(2).
007300     05  SORT-OPEN-RCVR-QTY       PIC S9(8).
007400     05  SORT-OPEN-RCVR-VALUE     PIC S9(12)V9(2).
007500
007600 WORKING-STORAGE SECTION.
007700 77  NO-MORE-SORT                 PIC XXX       VALUE SPACES.
007800 77  LINE-CNT                     PIC 99        VALUE 0.
007900 77  PAGE-CNT                     PIC 9(4)      VALUE 0.
008000 77  SAVE-STR-DEPT                PIC X(4)      VALUE SPACES.
008100 77  TOTAL-OPEN-RCVR-QTY          PIC S9(8)     VALUE ZEROS.
008200 77  TOTAL-OPEN-RCVR-VALUE        PIC S9(12)V99 VALUE ZEROS.
008300 77  PO-OPEN-RCVR-QTY             PIC S9(8)     VALUE ZEROS.
008400 77  PO-STR-UNIT-PRICE            PIC S9(11)V9(4) VALUE ZEROS.
008500 77  UPDATE-RESPONSE              PIC X(3)      VALUE SPACES.
008600 77  RCD-CTR                      PIC S9(5)     VALUE ZEROS.
008700 77  INIT-LOAD-SW                 PIC X(3)  VALUE SPACES.
008800 77  LOAD-ZERO-ONHAND-SW          PIC X(3)  VALUE SPACES.
008900 77  PRINT-ERRORS-ONLY-SW         PIC X(3)  VALUE SPACES.
009000
009100 01  ERROR-SW-AREA.
009200     05  INVALID-CLASS-SW         PIC X(1).
009300     05  INVALID-DEPT-SW          PIC X(1).
009400     05  MISSING-WD-DEPT-SW       PIC X(1).
009500     05  NO-AVG-COST-SW           PIC X(1).
009600     05  MISSING-REPORT-CODE-SW   PIC X(1).
009700
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  FILE-SWITCHES.
           05  MSTORERM-EOF-SW          PIC X  VALUE "N".
           05  DPOITEM-EOF-SW           PIC X  VALUE "N".
009800
009900************************************************************
010000**     REPORT PRINT LINES                                 **
010100************************************************************
010200
010300 01  HEADER1.
010400     05  FILLER                     PIC X      VALUE SPACES.
010500     05  FILLER                     PIC X(19)
010600         VALUE "TLODCSAS".
010700     05  FILLER                     PIC X(42)
010800         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
010900     05  FILLER                     PIC X(15)  VALUE SPACES.
011000     05  FILLER                     PIC X(5)   VALUE "DATE ".
011100     05  DATE-H1                    PIC X(8)   VALUE SPACES.
011200     05  FILLER                     PIC X(6)   VALUE SPACES.
011300
011400 01  HEADER2.
011500     05  FILLER                     PIC X      VALUE SPACES.
011600     05  FILLER                     PIC X(6)   VALUE "PAGE".
011700     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
011800     05  FILLER                     PIC X(12)  VALUE SPACES.
011900     05  FILLER                     PIC X(45)
012000         VALUE "CORPORATE CODE LOAD REPORT                 ".
012100     05  FILLER                     PIC X(09)  VALUE SPACES.
012200     05  FILLER                     PIC X(5)   VALUE "TIME ".
012300     05  TIME-H2                    PIC X(8)   VALUE SPACES.
012400
012500 01  HEADER4.
012600     05  FILLER                     PIC X(29)
012700         VALUE "CODE    CLASS  UM  WD INDIC  ".
012800     05  FILLER                     PIC X(40)
012900         VALUE "DEPT     AVERAGE COST  BEGINNING UNITS  ".
013000     05  FILLER                     PIC X(32)
013100         VALUE "BEGINNING DOLLARS  REPORT CODE  ".
013200     05  FILLER                     PIC X(31)
013300         VALUE "OPEN RECEIVER UNITS AND DOLLARS".
013400
013600 01  DETAIL-LINE1.
013700     05  PRT-CODE                 PIC X(7)   VALUE SPACES.
013800     05  FILLER                   PIC X(2)  VALUE SPACES.
013900     05  PRT-CLASS                PIC X(3)  VALUE SPACES.
014000     05  FILLER                   PIC X(3)  VALUE SPACES.
014100     05  PRT-UM                   PIC X(2)  VALUE ZEROS.
014200     05  FILLER                   PIC X(5)  VALUE SPACES.
014300     05  PRT-WD-INDIC             PIC X(1)  VALUE SPACES.
014400     05  FILLER                   PIC X(6)  VALUE SPACES.
014500     05  PRT-DEPT                 PIC X(4)  VALUE SPACES.
014600     05  FILLER                   PIC X(1)  VALUE SPACES.
014700     05  PRT-AVG-COST             PIC Z(10)9.9999 VALUE ZEROS.
014800     05  FILLER                   PIC X(5)  VALUE SPACES.
014900     05  PRT-BEG-UNITS            PIC ZZ,ZZZ,ZZ9 VALUE ZEROS.
015000     05  FILLER                   PIC X(3)  VALUE SPACES.
015100     05  PRT-BEG-DOLLARS          PIC ZZZ,ZZZ,ZZZ,ZZ9.99
015200                                            VALUE ZEROS.
015300     05  FILLER                   PIC X(6)  VALUE SPACES.
015400     05  PRT-REPORT-CODE          PIC X(2)  VALUE SPACES.
015500     05  FILLER                   PIC X(6)  VALUE SPACES.
015600     05  PRT-OPEN-RCVR-UNITS      PIC ZZ,ZZZ,ZZ9 VALUE ZEROS.
015700     05  FILLER                   PIC X(4)  VALUE SPACES.
015800     05  PRT-OPEN-RCVR-DLRS       PIC $$$,$$$,$$$,$$9.99
015900                                          VALUE ZEROS.
016000
016100 01  INVALID-DEPT-MSG.
016200     05  FILLER  PIC X(10) VALUE SPACES.
016300     05  FILLER  PIC X(36)
016400             VALUE "*****  INVALID DEPARTMENT  -  '0000'".
016500     05  FILLER  PIC X(18)
016600             VALUE " SUBSTITUTED *****".
016700
016800 01  INVALID-CLASS-MSG.
016900     05  FILLER  PIC X(10) VALUE SPACES.
017000     05  FILLER  PIC X(30)
017100             VALUE "*****  INVALID CLASS  -  '000'".
017200     05  FILLER  PIC X(18)
017300             VALUE "SUBSTITUTED *****".
017400
017500 01  MISSING-WD-DEPT-MSG.
017600     05  FILLER  PIC X(10) VALUE SPACES.
017700     05  FILLER  PIC X(30)
017800             VALUE "*****  NO WRITEDOWN DEPARTMENT".
017900     05  FILLER  PIC X(29)
018000             VALUE "  -  '0000' SUBSTITUTED *****".
018100
018200 01  NO-AVG-MKT-COST-MSG.
018300     05  FILLER  PIC X(10) VALUE SPACES.
018400     05  FILLER  PIC X(39)
018500             VALUE "*****  NO AVG/MKT COST; ITEM BEGINNING ".
018600     05  FILLER  PIC X(29)
018700             VALUE "DOLLAR BALANCE IS ZEROS *****".
018800
018900 01  NO-REPORT-CODE-MSG.
019000     05  FILLER  PIC X(10) VALUE SPACES.
019100     05  FILLER  PIC X(31)
019200             VALUE "*****  NO REPORT CODE HAS BEEN ".
019300     05  FILLER  PIC X(40)
019400             VALUE "ASSIGNED; ACCTG CLASS OUT OF RANGE *****".
019500
019600 01  LAST-LINE.
019700     05  FILLER  PIC X(10)  VALUE SPACES.
019800     05  RCD-CTR-OUT  PIC ZZZZ9  VALUE ZEROS.
019900     05  FILLER  PIC X(45)
020000         VALUE "  CORPORATE CODE(S) HAVE BEEN LOADED".
020100
020200 COPY TDATECHK IN COPYLIB.
020300
020500************************************************************
020600**                                                        **
020700**           D A T A B A S E   B U F F E R S              **
020800**                                                        **
020900************************************************************

021100 COPY MACTINFO IN COPYLIB.
021200
021300 COPY MATLACUM IN COPYLIB.
021400
021500 COPY DTRANS   IN COPYLIB.
021600
021700 COPY DPOITEM  IN COPYLIB.
021800
021900 COPY MSTORERM IN COPYLIB.
022000
022100 COPY MCLASS   IN COPYLIB.
022200
022300 COPY MCHTACCT IN COPYLIB.
022400
022500**********************************************************
022600*              D A T A    B A S E                        *
022700**********************************************************
022800
022900 COPY DBCSACCT IN COPYLIB.
023000
023100 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
023200 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
023300
023400 COPY DBMODES  IN COPYLIB.
023500
023600 COPY DBSTAT   IN COPYLIB.
023700
023800 01  DATASET-NAMES.
023900     05  DSET-MACCT            PIC X(16)  VALUE "MACCOUNT-INFO;".
024000     05  DSET-MMATL-ACCUM         PIC X(16) VALUE "MMATL-ACCUM;".
024100     05  DSET-DPOITEM             PIC X(16) VALUE "DPOITEM;".
024200     05  DSET-MSTORERM            PIC X(16) VALUE "MSTORERM;".
024300     05  DSET-MCLASS              PIC X(16) VALUE "MCLASS;".
024400     05  DSET-MCHT-ACCTS          PIC X(16) VALUE "MCHT-ACCTS;".
024500     05  DSET-DTRANS              PIC X(16) VALUE "DTRANS;".
024600
024700 01  ITEMS-LISTING.
024800     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
024900     05  MATL-KEY         PIC X(10)  VALUE "MATL-CODE;".
025000     05  CODE-SEARCH      PIC X(10)  VALUE "CORP-CODE;".
025100
025200 01  IMAGE-ARGS.
025300     05  MACCT-KEY                PIC X(4)   VALUE SPACES.
025400     05  MMATL-CODE-ARG           PIC X(8)   VALUE SPACES.
025500     05  DUMMY-ARG                PIC X(10)  VALUE SPACES.
025600     05  CODE-ARG                 PIC X(8)   VALUE SPACES.
025700     05  DEPT-ARG                 PIC X(6)  VALUE SPACES.
025800     05  CLASS-ARG                PIC X(4)  VALUE SPACES.
025900
026000 COPY MULTLOCK IN COPYLIB.
026100
026200 COPY TBLOWUP  IN COPYLIB.
026300
026400 PROCEDURE DIVISION.
026500
026600 001-BEGIN SECTION.
026700
026800 010-MAINLINE.
           PERFORM 1000-OPEN-FILES.
026900     SORT SORT-FILE ON ASCENDING KEY SORT-CODE
027000        INPUT PROCEDURE IS 050-PROCESS-TRANS
027100        OUTPUT PROCEDURE IS 700-CREATE-REPORT.
027200     PERFORM 1000-CLOSE-FILES.
027300     GOBACK.
027400
027500 050-PROCESS-TRANS SECTION.
       050-START-PROCESS.
027600     PERFORM 100-BEGIN.
027700     PERFORM 200-PROCESS-DTRANS
027800         UNTIL MSTORERM-EOF-SW = "Y".
027900
028000**********************************************************
028100*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
028200*  FOR SORTING OF RECORDS.                               *
028300**********************************************************
028400
028500     GO TO 699-PROCESS-EXIT.
028600
028700 100-BEGIN.
028800     DISPLAY "LOAD CODES? (YES OR NO)".
028900     ACCEPT UPDATE-RESPONSE.
029000     DISPLAY UPDATE-RESPONSE.
029100     IF UPDATE-RESPONSE = "YES" OR "NO"
029200         NEXT SENTENCE
029300     ELSE
029400         DISPLAY "INCORRECT RESPONSE; LETS START OVER|"
029500         GO TO 100-BEGIN.
029600
029700     DISPLAY "IS THIS AN INITIAL LOAD? (YES OR NO)".
029800     ACCEPT INIT-LOAD-SW.
029900     DISPLAY INIT-LOAD-SW.
030000     IF INIT-LOAD-SW = "YES" OR "NO"
030100         NEXT SENTENCE
030200     ELSE
030300         DISPLAY "INCORRECT RESPONSE; LETS START OVER|"
030400         GO TO 100-BEGIN.
030500
030600     DISPLAY "LOAD CODES WITH ZERO ONHAND ? (YES OR NO)".
030700     ACCEPT LOAD-ZERO-ONHAND-SW.
030800     DISPLAY LOAD-ZERO-ONHAND-SW.
030900     IF LOAD-ZERO-ONHAND-SW = "YES" OR "NO"
031000         NEXT SENTENCE
031100     ELSE
031200         DISPLAY "INCORRECT RESPONSE; LETS START OVER|"
031300         GO TO 100-BEGIN.
031400
031500     DISPLAY "PRINT ONLY CODES IN ERROR ON REPORT ?(YES OR NO)".
031600     ACCEPT PRINT-ERRORS-ONLY-SW.
031700     DISPLAY PRINT-ERRORS-ONLY-SW.
031800     IF PRINT-ERRORS-ONLY-SW = "YES" OR "NO"
031900         NEXT SENTENCE
032000     ELSE
032100         DISPLAY "INCORRECT RESPONSE; LETS START OVER|"
032200         GO TO 100-BEGIN.
034500
034600****************************************************
034700**   GET STOREROOM DEPT FROM MACCOUNT-INFO        **
034800**   KEY IS EQUAL TO 'SDPT'.  THE STOREROOM DEPT. **
034900****************************************************
035000
035100     MOVE "SDPT" TO MACCT-KEY.
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-I.
           READ MACTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
035900     IF FILE-STATUS = "00"
036000         MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
036100     ELSE
036200         MOVE "READ MACCOUNT-INFO 'SDPT'* 100"
036300               TO BU-DISPLAY-MSG
036400         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
036500         PERFORM 990-BLOWUP.
036600
036700     DISPLAY "SAVE-STR-DEPT=", SAVE-STR-DEPT.
036800
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.

           START MSTORERM-I KEY > CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
                   MOVE "START MSTORERM * 100" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

           PERFORM 400-READ-MSTORERM.
037000
037200 200-PROCESS-DTRANS.
037300     IF LOAD-ZERO-ONHAND-SW = "NO"  AND  STR-ONHAND = ZEROS
037400         NEXT SENTENCE
037500     ELSE
037600         PERFORM 400-READ-MMATL-ACCUM
037700         IF FILE-STATUS-1 = "2"
037800             MOVE CORP-CODE       TO SORT-CODE
037900             MOVE STR-CLASS       TO SORT-CLASS
038000             MOVE STR-ONHAND      TO SORT-ONHAND
038100             PERFORM 210-PROCESS-COST
038200             MOVE STR-WR-DOWN     TO SORT-WD-INDIC
038300             MOVE STR-DFLT-DEPT   TO SORT-DFLT-DEPT
038400             MOVE STR-UM          TO SORT-UM
038500             PERFORM 300-CALC-OPEN-RCVRS
038600             MOVE TOTAL-OPEN-RCVR-QTY TO SORT-OPEN-RCVR-QTY
038700             MOVE TOTAL-OPEN-RCVR-VALUE  TO SORT-OPEN-RCVR-VALUE
038800             RELEASE SORT-REC.
038900
039000     PERFORM 400-READ-MSTORERM.
039100
039200 210-PROCESS-COST.
039300     IF STR-AVG-COST = ZEROS
039400         MOVE STR-MKT-COST TO SORT-AVG-COST
039500     ELSE
039600         MOVE STR-AVG-COST TO SORT-AVG-COST.
039700
039800 300-CALC-OPEN-RCVRS.
           MOVE CODE-ARG TO CORPCDE OF DPOITEM-REC-I.
           START DPOITEM-I KEY >= CORPCDE OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
                   MOVE "START DPOITEM * 300-COR" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE "Y" TO DPOITEM-EOF-SW.
041000
041100     MOVE ZEROS                   TO TOTAL-OPEN-RCVR-QTY,
041200                                     TOTAL-OPEN-RCVR-VALUE.
      *------- ADDED THE FOLLOWING MOVE STMT - 24JUL1995 - DAVE PLUM
           MOVE "N"                     TO DPOITEM-EOF-SW.
041300     IF CODE-ARG  = "NON-STR"
041400         NEXT SENTENCE
041500     ELSE
      *        DISPLAY "CODE-ARG   " CODE-ARG
      *        DISPLAY "DPOITEM-EOF-SW   " DPOITEM-EOF-SW
041600         PERFORM 310-PROCESS-DPOITEM
                   UNTIL ITM-CORP-CODE NOT = CODE-ARG OR
                         DPOITEM-EOF-SW    = "Y".
041800
041900 310-PROCESS-DPOITEM.
      *    DISPLAY "DPOITEM-REC-I " DPOITEM-REC-I.
      *    DISPLAY "FILE-STATUS   " FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DPOITEM * 300-GD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP
               END-IF
           ELSE
               IF ITM-SUB-DETL = SAVE-STR-DEPT AND
                 ITM-CORP-CODE = CODE-ARG
      *            DISPLAY "ITM-SUB-DETL  " ITM-SUB-DETL
      *            DISPLAY "SAVE-STR-DEPT " SAVE-STR-DEPT
      *            DISPLAY "ITM-CORP-CODE " ITM-CORP-CODE
      *            DISPLAY "CODE-ARG      " CODE-ARG
                   PERFORM 320-CHECK-OPEN-RCVR
               ELSE
                   NEXT SENTENCE
               END-IF.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE "Y" TO DPOITEM-EOF-SW.
043800
043900 320-CHECK-OPEN-RCVR.
      *    DISPLAY "ITM-QTY-STORED  " ITM-QTY-STORED.
      *    DISPLAY "ITM-QTY-PAID    " ITM-QTY-PAID.
044000     IF ITM-QTY-STORED NOT = ITM-QTY-PAID
044100         IF ITM-QTY-STORED > ITM-QTY-PAID
044200             COMPUTE PO-OPEN-RCVR-QTY ROUNDED = ITM-QTY-STORED -
044300                                                ITM-QTY-PAID
044400             PERFORM 325-CONVERT-STR-UM
044500             ADD PO-OPEN-RCVR-QTY  TO TOTAL-OPEN-RCVR-QTY
044600             COMPUTE TOTAL-OPEN-RCVR-VALUE ROUNDED =
044700                 TOTAL-OPEN-RCVR-VALUE + (PO-OPEN-RCVR-QTY *
044800                                          PO-STR-UNIT-PRICE).
      *            DISPLAY "TOTAL-OPEN-RCVR-VALUE  "
      *                                TOTAL-OPEN-RCVR-VALUE.
044900
045000 325-CONVERT-STR-UM.
045100     IF ITM-UM = STR-UM
045200         NEXT SENTENCE
045300     ELSE
045400     IF ITM-UM = STR-UM1
045500         COMPUTE PO-OPEN-RCVR-QTY ROUNDED =
045600             PO-OPEN-RCVR-QTY * STR-UM1-CF
045700     ELSE
045800     IF ITM-UM = STR-UM2
045900         COMPUTE PO-OPEN-RCVR-QTY ROUNDED =
046000             PO-OPEN-RCVR-QTY * STR-UM2-CF
046100     ELSE
046200         MOVE "QTY UM CF ERROR" TO BU-DISPLAY-MSG
046300         MOVE ITM-CORP-CODE     TO BU-DISPLAY-FLD (1)
046400         MOVE ITM-PO-RCV-NO     TO BU-DISPLAY-FLD (2)
046500         PERFORM 990-BLOWUP.
046600
046700     IF ITM-PRICE-UM = STR-UM
046800         COMPUTE PO-STR-UNIT-PRICE ROUNDED =
046900              ITM-UNIT-PRICE * 1
047000         ELSE
047100         IF ITM-PRICE-UM = STR-UM1
047200             COMPUTE PO-STR-UNIT-PRICE ROUNDED =
047300                 ITM-UNIT-PRICE / STR-UM1-CF
047400         ELSE
047500         IF ITM-PRICE-UM = STR-UM2
047600             COMPUTE PO-STR-UNIT-PRICE ROUNDED =
047700                 ITM-UNIT-PRICE / STR-UM2-CF
047800         ELSE
047900             MOVE "PRICE UM CF ERROR" TO BU-DISPLAY-MSG
048000             MOVE ITM-CORP-CODE   TO BU-DISPLAY-FLD (1)
048100             MOVE ITM-PO-RCV-NO   TO BU-DISPLAY-FLD (2)
048200             PERFORM 990-BLOWUP.
048300
048400     IF PO-STR-UNIT-PRICE = ZEROS
048500         COMPUTE PO-STR-UNIT-PRICE ROUNDED =
048600             STR-AVG-COST * 1.
048700
048800 400-READ-MSTORERM.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
              AT END MOVE "Y" TO MSTORERM-EOF-SW.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
                   MOVE "READ MSTORERM*400-RM" TO BU-DISPLAY-MSG
                   MOVE CORP-CODE              TO BU-DISPLAY-FLD (3)
                   GO TO  990-BLOWUP.
050400
050500 400-READ-MMATL-ACCUM.
050600     MOVE CORP-CODE               TO CODE-ARG.
           MOVE CODE-ARG TO MATLCODE OF MMATL-ACCUM-REC-O.
           READ MATLACCUM-O INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 NOT = "2"
                   MOVE "READ MATL-ACCUM * 400-RMA" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.

052400 699-PROCESS-EXIT.
052500     EXIT.
052600
052700 700-CREATE-REPORT SECTION.
       700-PRINT-REPORT.
052800     DISPLAY "BEGIN REPORT".
052900     PERFORM 710-BEGIN-REPORT.
053000     PERFORM 720-PROCESS-CODE
053100        UNTIL NO-MORE-SORT = "YES".
053200
053300     MOVE RCD-CTR                 TO RCD-CTR-OUT.
053400     WRITE PRT-REC FROM LAST-LINE AFTER 3.
053500
053600**************************************************
053700**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
053800**  TO COMPLETE PROCESSING OF REPORT            **
053900**************************************************
054000
054100     GO TO 799-CREATE-EXIT.
054200
054300 710-BEGIN-REPORT.
054400     OPEN OUTPUT ONLINE-PRT.
054500     PERFORM 750-PRINT-HEADINGS.
054600     RETURN SORT-FILE
054700        AT END
054800            MOVE "YES" TO NO-MORE-SORT.
054900
055000 720-PROCESS-CODE.
055100     MOVE SPACES                  TO ERROR-SW-AREA.
055200     PERFORM 920-CHECK-CLASS.
055300     IF SORT-DFLT-DEPT = SPACES
055400         NEXT SENTENCE
055500     ELSE
055600         PERFORM 920-CHECK-DEPT.
055700     IF SORT-WD-INDIC NOT = SPACES
055800         IF SORT-DFLT-DEPT = SPACES
055900             MOVE "Y"             TO MISSING-WD-DEPT-SW
056000             MOVE "0000"          TO SORT-DFLT-DEPT.
056100
056200     PERFORM 800-LOAD-MATL-ACCUM.
056300
056400     IF SORT-AVG-COST = ZEROS  AND  SORT-ONHAND NOT = ZEROS
056500         MOVE "Y"                 TO NO-AVG-COST-SW.
056600
056700     PERFORM 745-PRINT-REPORT-DETAIL.
056800
056900     RETURN SORT-FILE
057000         AT END
057100             MOVE "YES"           TO NO-MORE-SORT.
057200
057300 745-PRINT-REPORT-DETAIL.
057400     ADD 1                        TO RCD-CTR.
057500     MOVE SORT-CODE               TO PRT-CODE.
057600     MOVE SORT-CLASS              TO PRT-CLASS.
057700     MOVE SORT-UM                 TO PRT-UM.
057800     MOVE MATL-WDOWN-FLAG         TO PRT-WD-INDIC.
057900     MOVE SORT-DFLT-DEPT          TO PRT-DEPT
058000     MOVE SORT-AVG-COST           TO PRT-AVG-COST.
058100     MOVE SORT-ONHAND             TO PRT-BEG-UNITS.
058200     IF INIT-LOAD-SW = "YES"
058300         MOVE MATL-BEG-BAL-DOLLARS    TO PRT-BEG-DOLLARS
058400     ELSE
058500         MOVE MATL-ACCTG-DOLLAR-CORR  TO PRT-BEG-DOLLARS.
058600     MOVE MATL-REPORT-CODE        TO PRT-REPORT-CODE.
058700     MOVE SORT-OPEN-RCVR-QTY      TO PRT-OPEN-RCVR-UNITS.
058800     MOVE SORT-OPEN-RCVR-VALUE    TO PRT-OPEN-RCVR-DLRS.
058900
059000***************************************************************
059100**   IF PRINT-ERRORS-ONLY-SW IS SET TO 'YES' THEN THEY ONLY
059200**   WANT TO SEE CODES IN ERROR ON THE REPORT SO CHECK THE
059300**   THE 'ERROR-SW-AREA' FOR SPACES, IF ITS EQUAL TO SPACES
059400**   (NO ERRORS) THEN DONT PRINT THE CODE.
059500***************************************************************
059600
059700     IF PRINT-ERRORS-ONLY-SW = "YES"
059800         IF ERROR-SW-AREA = SPACES
059900             NEXT SENTENCE
060000         ELSE
060100             WRITE PRT-REC FROM DETAIL-LINE1 AFTER 1
060200             ADD 1                TO LINE-CNT
060300     ELSE
060400         WRITE PRT-REC FROM DETAIL-LINE1 AFTER 1
060500         ADD 1                    TO LINE-CNT.
060600
060700     IF INVALID-CLASS-SW  = "Y"
060800         WRITE PRT-REC FROM INVALID-CLASS-MSG AFTER 1
060900         ADD 1 TO LINE-CNT.
061000
061100     IF INVALID-DEPT-SW = "Y"
061200         WRITE PRT-REC FROM INVALID-DEPT-MSG AFTER 1
061300         ADD 1 TO LINE-CNT.
061400
061500     IF MISSING-WD-DEPT-SW = "Y"
061600         WRITE PRT-REC FROM MISSING-WD-DEPT-MSG AFTER 1
061700         ADD 1 TO LINE-CNT.
061800
061900     IF NO-AVG-COST-SW = "Y"
062000         WRITE PRT-REC FROM NO-AVG-MKT-COST-MSG AFTER 1
062100         ADD 1 TO LINE-CNT.
062200
062300     IF MISSING-REPORT-CODE-SW = "Y"
062400         WRITE PRT-REC FROM NO-REPORT-CODE-MSG AFTER 1
062500         ADD 1 TO LINE-CNT.
062600
062700     IF LINE-CNT > 55
062800         PERFORM 750-PRINT-HEADINGS.
062900
063000 750-PRINT-HEADINGS.
063100     MOVE 1                       TO DATE-MODE.
063200     CALL "TDATECHK" USING DATE-CHECK-AREA.
063300     MOVE DATE-SLASH-OUT          TO DATE-H1.
063400     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
063500     ADD 1                        TO PAGE-CNT.
063600     MOVE PAGE-CNT                TO PAGE-H2.
063700     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
063800     WRITE PRT-REC FROM HEADER2 AFTER 1.
063900     WRITE PRT-REC FROM HEADER4 AFTER 2.
064000     MOVE SPACES                  TO PRT-REC.
064100     WRITE PRT-REC  AFTER 1.
064200     MOVE 6 TO LINE-CNT.
064300
064400 800-LOAD-MATL-ACCUM.
064500     MOVE SPACES                  TO BUF-MATLACUM.
064600     MOVE ZEROS                   TO MATL-BEG-BAL-DOLLARS,
064700                                     MATL-BEG-BAL-UNITS,
064800                                     MATL-INV-DOLLARS,
064900                                     MATL-RCPT-UNITS,
065000                                     MATL-ISSUE-UNITS,
065100                                     MATL-RTN-UNITS,
065200                                     MATL-ADJ-UNITS,
065300                                     MATL-RTN-DOLLARS,
065400                                     MATL-RCPT-DOLLARS,
065500                                     MATL-UNITS-RCVD-NOT-INV,
065600                                     MATL-INV-DOL-NOT-RCVD,
065700                                     MATL-UNITS-INV-NOT-RCVD,
065800                                     MATL-INTRANSIT-DOLLARS
065900                                     MATL-ACCTG-UNIT-CORR,
066000                                     MATL-ACCTG-DOLLAR-CORR,
066100                                     MATL-INTRANSIT-UNITS,
066200                                     MATL-WDOWN-PERC,
066300                                     MATL-TOT-ISS-DOLLARS,
066400                                     MATL-TOT-ADJ-DOLLARS,
066500                                     MATL-RTNVAL-UNITS,
066600                                     MATL-RTNVAL-DOLLARS.
066700     MOVE SORT-CODE               TO MATL-STORES-CODE.
066800     MOVE SORT-UM                 TO MATL-UNIT-MEASURE.
066900     IF INVALID-CLASS-SW = "Y"
067000         MOVE "000"               TO MATL-CLASS
067100     ELSE
067200         MOVE SORT-CLASS          TO MATL-CLASS.
067300     IF INVALID-DEPT-SW = "Y"
067400         MOVE "0000"              TO MATL-DEPT
067500     ELSE
067600         MOVE SORT-DFLT-DEPT      TO MATL-DEPT.
067700     IF SORT-WD-INDIC NOT = SPACES
067800         MOVE "1"                 TO MATL-WDOWN-FLAG
067900         MOVE .85                 TO MATL-WDOWN-PERC.
068000
068100     IF (MATL-CLASS > 099 AND MATL-CLASS < 200) OR
068200        (MATL-CLASS > 399 AND MATL-CLASS < 500)
068300         MOVE "02"                TO MATL-REPORT-CODE
068400     ELSE
068500     IF (MATL-CLASS > 199 AND MATL-CLASS < 344)
068600         MOVE "05"                TO MATL-REPORT-CODE
068700     ELSE
068800     IF (MATL-CLASS > 343 AND MATL-CLASS < 400)  OR
068900        (MATL-CLASS > 499) OR( MATL-CLASS < 100)
069000         MOVE "01"                TO MATL-REPORT-CODE.
069100     IF MATL-REPORT-CODE = SPACES
069200         MOVE "Y"                 TO MISSING-REPORT-CODE-SW.
069300
069400***********************************************************
069500**   IF THIS IS AN INITIAL LOAD (INIT-LOAD-SW = "YES")  THEN
069600**   PUT THE UNIT AND DOLLARS IN THE BEGINNING BALANCE
069700**   FIELDS OTHERWISE PUT THEM IN ACCOUNTING ADJUSTMENT
069800**   FIELDS
069900***********************************************************
070000
070100     SUBTRACT SORT-OPEN-RCVR-QTY FROM SORT-ONHAND
070200     IF INIT-LOAD-SW = "YES"
070300         MOVE SORT-ONHAND         TO MATL-BEG-BAL-UNITS
070400         COMPUTE MATL-BEG-BAL-DOLLARS ROUNDED =
070500                 SORT-ONHAND * SORT-AVG-COST
070600     ELSE
070700         MOVE SORT-ONHAND         TO MATL-ACCTG-UNIT-CORR
070800         COMPUTE MATL-ACCTG-DOLLAR-CORR ROUNDED =
070900                 SORT-ONHAND * SORT-AVG-COST.
071000
           PERFORM 910-WRITE-MATL-ACCUM.

071500     IF INIT-LOAD-SW = "YES"
071600         NEXT SENTENCE
071700     ELSE
071800         PERFORM 871-CREATE-AADJ.
071900
072000 871-CREATE-AADJ.
072100     MOVE SPACES                  TO BUF-DTRANS.
072200     MOVE MATL-STORES-CODE        TO TRANS-STORES-CODE.
072300     MOVE MATL-CLASS              TO TRANS-CLASS.
072400************************************************************
072500**  DANVILLE   '1996' -> DEPT; '000010' -> ACCOUNT
072600**  LAWTON    STR-DEFAULT-DEPT -> DEPT; "000215" -> ACCOUNT
072700**  TOPEKA     '7274' -> DEPT; '000215' -> ACCOUNT
072800************************************************************
072900     IF MATL-DEPT = SPACES
073000         MOVE "0000"              TO TRANS-DEPT
073100     ELSE
073200         MOVE MATL-DEPT           TO TRANS-DEPT.
073300     MOVE "000215"                TO TRANS-ACCT.
073400     MOVE "AADJ"                  TO TRANS-CODE.
073500     MOVE 1                       TO DATE-MODE.
073600     CALL "TDATECHK" USING DATE-CHECK-AREA.
073700     MOVE DATE-YMD-OUT            TO TRANS-DATE.

           IF TRANS-YY > "70"
               MOVE "19"                TO TRANS-DATE-CC
           ELSE
               MOVE "20"                TO TRANS-DATE-CC
           END-IF.

073800     MOVE DATE-UNFORMATTED-TIME-OUT TO TRANS-TIME.
073900     MOVE MATL-ACCTG-UNIT-CORR    TO TRANS-QTY.
074000     MOVE MATL-ACCTG-DOLLAR-CORR  TO TRANS-VALUE.
074100     MOVE MATL-UNIT-MEASURE       TO TRANS-UNIT-MEASURE.
074200     MOVE ZEROS                   TO TRANS-BALANCE-QTY.
074300
075200     PERFORM 910-WRITE-DTRANS.
077900
078000 910-WRITE-MATL-ACCUM.
078100     IF UPDATE-RESPONSE = "YES"
               WRITE MMATL-ACCUM-REC-O FROM BUF-MATLACUM
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE MMATL-ACCUM * 910-WMA" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
078900
079000 910-WRITE-DTRANS.
079100     IF UPDATE-RESPONSE = "YES"
               WRITE DTRANS-REC-O FROM BUF-DTRANS
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-WRITE
               IF FILE-STATUS NOT = "00"
                   MOVE "WRITE DTRANS * 910-WD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP.
079900
080000 920-CHECK-CLASS.
080100     MOVE SORT-CLASS              TO CLASS-ARG.
           MOVE CLASS-ARG TO ACTGCLASS OF MCLASS-REC-I.
           READ MCLASS-I INTO BUF-MCLASS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
               IF FILE-STATUS-1 = "2"
                   MOVE "Y"          TO INVALID-CLASS-SW
               ELSE
                   MOVE "READ MCLASS * 920-CC" TO BU-DISPLAY-MSG
                   MOVE CLASS-ARG    TO BU-DISPLAY-FLD (4)
                   PERFORM 990-BLOWUP
               END-IF.

081900 920-CHECK-DEPT.
082000     MOVE SORT-DFLT-DEPT          TO DEPT-ARG.
           MOVE DEPT-ARG TO DEPT OF MCHTACCTS-REC-I.
           READ MCHTACCTS-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               NEXT SENTENCE
           ELSE
083100         IF FILE-STATUS-1 = "2"
083200             MOVE "Y"             TO INVALID-DEPT-SW
083300         ELSE
083400             MOVE "READ MCHT-ACCTS * 920-CD" TO
083500                   BU-DISPLAY-MSG
083600             MOVE DEPT-ARG        TO BU-DISPLAY-FLD (4)
083700             PERFORM 990-BLOWUP
               END-IF.
083900
084000 799-CREATE-EXIT.
084100     EXIT.
084200
084400 900-ERROR SECTION.
084500
084600 990-BLOWUP.
084700     MOVE "TLODCSAS"              TO  BU-PGM-NAME.
084800     CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
084900         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
085000             BU-DISPLAY-FLDS.
085100
085200 1000-CLOSE-FILES.
085300     CLOSE    ONLINE-PRT     MATLACCUM-O
                    MCLASS-I       MCHTACCTS-I
                    MACTINFO-I     DTRANS-O
                    MSTORERM-I     DPOITEM-I.

       1000-OPEN-FILES.
           OPEN INPUT  MACTINFO-I
                       MSTORERM-I
                       MCLASS-I
                       MCHTACCTS-I
                       DPOITEM-I.
           OPEN I-O    MATLACCUM-O
                       DTRANS-O.
