000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID. TLSTCODE.
000800*REMARKS.
000900*        ########################################################
001000*        # Lists the personnel absence codes on the screen .... #
001100*        ########################################################.
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER. AS400.
001800 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.    I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                         LOCAL-DATA IS LOCAL-DATA-AREA.
001900 INPUT-OUTPUT SECTION.
002000 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-ABSENCE-MSTR
               ASSIGN TO DATABASE-MCFLMM2901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PAM-STATUS.
002100     SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.
002500 DATA DIVISION.
002600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-ABSENCE-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PAMREC.
       01  PAMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2901.
002700 SD  SORT-FILE
002800     RECORD CONTAINS 32 CHARACTERS
002900     DATA RECORD IS SORTF.
003000 01  SORTF.
003100     05 SORT-CODE                  PIC X(2).
003200     05 SORT-DESC                  PIC X(30).
003300 WORKING-STORAGE SECTION.
007300 01  CHECK-DISPLAY                 PIC X VALUE "N".
007400     88 STOP-DISPLAY                     VALUE "Y".
007500 01  CODE-BUFFER.
007600     05 CODE-B                     PIC XX.
007700     05 DESC-B                     PIC X(30).
       COPY CPYIND  OF COPYLIB.
007100 01  DEX                           PIC S9(4) COMP-4.
       01  DSPLY-STATUS                  PIC XX.
007200 01  END-OF-FILE-SW                PIC X VALUE "N".
006100 COPY IOFEEDBACK OF COPYLIB.
       01  PAM-STATUS                    PIC XX.
003400 01  PASSWORD-INFORMATION.
003500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TLSTCODE".
003600     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
003700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003800     05  PROGRAM-DESCRIPTION.
003900         10  PROG-DESC-A     PIC X(60) VALUE
004000            "PERSONNEL SYSTEM ABSENCE CODE LIST PROGRAM "        .
004100         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
004300         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004500     05  PASSWORD-FLAG       PIC X.
005000 01  PASSED-SPOOL-PRT              PIC S9(2) COMP VALUE 0.
006200 01  PER-CODES.
006300     05 PCODES OCCURS 140 TIMES.
006400        10 CO                      PIC X(2).
006500        10 DS                      PIC X(30).
004600 01  SCREEN-PRINT-PARMS.
004700     05 PRINTCNTL                  PIC S9(4) COMP VALUE 0.
004800     05 PAGECNTL                   PIC S9(4) COMP VALUE 49.
004900     05 SPOOLFIL-OPEN-SW           PIC X VALUE "N".
006600 01  SCREEN-BUFFER.
006700     05 SCREEN-CODE OCCURS 14 TIMES.
006800        10 SCODE                   PIC X(2).
006900        10 SDESC                   PIC X(30).
           05  SCREEN-CMD-LINE           PIC X(79).
           05  SCREEN-ERR-LINE           PIC X(79).
007000 01  SCRIPT                        PIC S9(4) COMP-4.
007800 COPY DBSTAT    OF COPYLIB.
008000 COPY WSCONTROL OF COPYLIB.
008100 LINKAGE SECTION.
008200 01  DBPARAMETERS.                 COPY DBPARMS  OF COPYLIB.
008300 COPY VCOMLINK  OF COPYLIB.
008400 01  PLT-IDT                       PIC X(4).
008900 PROCEDURE DIVISION USING DBPARAMETERS
009000                          VIEW-COMAREA
009100                          PLT-IDT.
009500 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-ABSENCE-MSTR.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PER-ABSENCE-MSTR.
009600     CALL "TPWORD" USING PASSWORD-INFORMATION.
010000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
011000     MOVE SPACES TO PER-CODES.
011100     MOVE 1 TO SCRIPT.
011800 6-MAIN.
011900     PERFORM 61-READ-CODES.
012100     PERFORM 63-DISPLAY-SCREEN UNTIL STOP-DISPLAY.
012400 61-READ-CODES.
012500     MOVE 0 TO COND-WORD.
012600     READ PER-ABSENCE-MSTR NEXT INTO CODE-BUFFER
012700         AT END    MOVE 11 TO COND-WORD.
           IF PAM-STATUS NOT = "00" MOVE 11 TO COND-WORD.
013300     IF COND-WORD = 11 GO TO 2-EOJ.
013700     PERFORM 611-READ THRU 611-READ-EXIT
013800         UNTIL COND-WORD = 11 OR SCRIPT > 140.
014200     SORT SORT-FILE ON ASCENDING KEY SORT-CODE
014300         INPUT PROCEDURE 621-INPUT
014400         OUTPUT PROCEDURE 622-OUTPUT.
014600
014700 63-DISPLAY-SCREEN.
014800     MOVE "FLSTCODE" TO VIEW-CFNAME.
015100     MOVE 1 TO DEX.
015200     MOVE SPACES TO SCREEN-BUFFER.
015300     PERFORM 631-DISPLAY-MOVE UNTIL DEX > 14.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
015400     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
018100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
018200     IF SCRIPT > 140 OR PCODES (SCRIPT) = SPACES
018300         MOVE "Y" TO CHECK-DISPLAY.
018600 611-READ.
018700     IF CODE-BUFFER = SPACES
018800         MOVE 0 TO COND-WORD
018900         PERFORM 69-READ-PER-ABSENCE-MSTR
019600         IF COND-WORD = 0 OR 11
019700             GO TO 611-READ-EXIT
019800         ELSE
019900         GO TO 2-EOJ.
020000     MOVE CODE-BUFFER TO PCODES (SCRIPT).
020100     ADD 1 TO SCRIPT.
020200     PERFORM 69-READ-PER-ABSENCE-MSTR.
021000     IF COND-WORD = 0 OR 11
021100         NEXT SENTENCE
021200     ELSE
021300     GO TO 2-EOJ.
021600 611-READ-EXIT.    EXIT.
021700
022000 621-INPUT.
022100     MOVE 1 TO SCRIPT.
022200     PERFORM 6211-SORT UNTIL SCRIPT > 140 OR
022300                          PCODES (SCRIPT) = SPACES.
022700 6211-SORT.
022800     MOVE PCODES (SCRIPT) TO SORTF.
022900     RELEASE SORTF.
023000     ADD 1 TO SCRIPT.

023300 622-OUTPUT.
023400     RETURN SORT-FILE
023500         AT END MOVE "Y" TO END-OF-FILE-SW.
023600     MOVE 1 TO SCRIPT.
023700     PERFORM 6221-MOVE UNTIL END-OF-FILE-SW = "Y".
023800     MOVE 1 TO SCRIPT.
024000
024200 6221-MOVE.
024300     MOVE SORTF TO PCODES (SCRIPT).
024400     ADD 1 TO SCRIPT.
024500     RETURN SORT-FILE
024600         AT END MOVE "Y" TO END-OF-FILE-SW.
024800
024900 631-DISPLAY-MOVE.
025000     MOVE PCODES (SCRIPT) TO SCREEN-CODE (DEX).
025100     ADD 1 TO SCRIPT DEX.

       69-READ-PER-ABSENCE-MSTR.
           MOVE 0 TO COND-WORD.
           READ PER-ABSENCE-MSTR NEXT INTO CODE-BUFFER
               AT END    MOVE 11 TO COND-WORD.
           IF PAM-STATUS NOT = "00" MOVE 11 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

