       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TMANSENT.
       AUTHOR.  KURT MOVSESIAN.
      *REMARKS.
      **************************************************************
      *                                                            *
      *    T M A N S E N T                                         *
      *                                                            *
      *      THIS PROGRAM CHECKS THE JCW 'SENDWORKED' TO SEE IF    *
      *      THE SEND OF THE LAST MANIFEST FILE WAS SUCCESSFUL     *
      *      (SENDWORKED = ).  IF IT WAS THE LAST MANIFEST ENTRY   *
      *      IN MPLTINFO IS MARKED WITH A GOOD SEND, IF THE SEND   *
      *      WAS UNSUCCESSFUL MPLTINFO IS MARKED WITH SEND         *
      *      UNSUCCESSFUL.                                         *
      *                                                            *
      *        1) MPLTINFO-SEND-STATUS = 1 NO SEND ATTEMPTED YET   *
      *        2) MPLTINFO-SEND-STATUS = 2 SEND ATTEMPTED BUT      *
      *                                    FAILED                  *
      *        3) MPLTINFO-SEND-STATUS = 3 SEND SUCCEEDED          *
      *                                                            *
      *                                                            *
      **************************************************************
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES.    LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MPLTINFO-O
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-O-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  SEND-WORKED-SW          PIC X       VALUE "N".
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
9406CK 01  SCOPE                        PIC X.

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY JCWAREA  IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       COPY DATAB   IN COPYLIB.

       COPY VIEWDUM IN COPYLIB.

       PROCEDURE DIVISION.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

      ************************************************
      **  ACCEPT LOCAL DATA AREA FOR MANIFEST-SEND  **
      ************************************************

           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           IF JCW-MANIFEST-SEND-289 = "1"
               MOVE "Y"    TO SEND-WORKED-SW
           ELSE
               MOVE "N"    TO SEND-WORKED-SW.

           OPEN I-O MPLTINFO-O.
           IF FILE-STATUS NOT = "00"
               MOVE "OPEN MPLTINFO-O " TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
       1-H-X.
           EXIT.

       2-EOJ.
           CLOSE MPLTINFO-O.

       2-EOJ-X.
           EXIT.


      *********************************************
      *                                           *
      *  BLOWUP ROUTINE EXECUTES WHENEVER A       *
      *  FATAL ERROR OCCURS                       *
      *                                           *
      *********************************************

       2-BLOWUP.
           MOVE "TMANSENT"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.


      **************************************************
      *                                                *
      *     6 - M A I N                                *
      *                                                *
      **************************************************


       6-MAIN.
           MOVE "PMAN"  TO  PLTINFOKEY OF MPLTINFO-O-REC.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ MPLTINFO 6-M" TO  BU-DISPLAY-MSG
               MOVE "PMAN"              TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           IF SEND-WORKED-SW = "Y"
               MOVE "3"               TO  MPLTINFO-SEND-STATUS
           ELSE
               MOVE "2"               TO  MPLTINFO-SEND-STATUS.

           REWRITE MPLTINFO-O-REC FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE MPLTINFO 6M" TO BU-DISPLAY-MSG
               MOVE MPLTINFO-MAN-NO       TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

       6-M-X.
           EXIT.
