       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TMANTOR.
       AUTHOR.         ANNETTE TREUDLER/FRED HAYNES.
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *D*                                                           *
      *D* T M A N T O R                                             *
      *D*   FILE DEFINITIONS (INPUTS/OUTPUTS)                       *
      *D*      1) MANWKFL1 - FILE THAT CONTAINS A LIST OF ALL       *
      *D*                   REGISTER NUMBERS CONTAINED IN THE       *
      *D*                   MOST RECENT MANIFEST FILE RUN           *
      *D*      2) MANAKFL1 - THE AKRON MANIFEST FILE. THIS FILE     *
      *D*                   MUST BE SENT TO AKRON ACCOUNTS PAYABLE  *
      *D*                   ON THE IBM BEFORE ANOTHER MANIFEST      *
      *D*                   FILE CAN BE CREATED                     *
      *D*      3) MANRPTFL - REPORT FILE WHICH CONTAINS A ONE PAGE  *
      *D*                    SUMMARY OF WHICH OPTION WAS CHOSEN     *
      *D*                    TO CREATE THE AKRON MANIFEST FILE      *
      *D*                                                           *
      *D* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *C* CHANGES
      *C*
      *C* AUG 25, 1992  CR KALMAN   REQUEST:6234
      *C* ADDED CHANGE FOR VALLEYFIELD (629) ONLY. THEY NEEDED TO
      *C* KEEP TRACK OF DOLLARS PAID FOR A NEW TAX (QST/TVQ) BY
      *C* INVOICE. PREVIOUSLY THEY HAD ONLY GST. SINCE TOTAL TAX
      *C* PAID IS STORED (INV-ADD-TAX) AND GST PAID IS STORED
      *C* (INV-ADD-GST) SUBTRACTION WOULD GIVE THE TOTAL QST/TVQ
      *C* PAID. WILL NOW SEND QST/TVQ IN A SEPARATE RECORD USING
      *C* THE SAME FORMAT AS THE GST RECORD.
      *C*
      *C* CR KALMAN        4/26/94            REQUEST 6490
      *C* REMOVED PORTABLILITY COPYLIBS.
      *C*
      *C* CR KALMAN        6/3/94             REQUEST 6511
      *C* REPLACED OPENING, WRITING, CLOSING AND DELETING OF A FILE
      *C* FOR EACH REGISTER IN THE MANIFEST WITH A TABLE TO DO
      *C* THE PROCESSING.
      *C*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C*
      *C* CA YODER         7/15/96
      *C*  RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.
      *C*
      *C* CA YODER        10/17/97
      *C*  INCREASED SIZE OF DIST-TABLE AFTER NAPANEE HAD > 100
      *C*  ITEMS ON AN INVOICE.  INCREASED IT FROM 100 TO 150.
      *C*
      *C* 03FEB1998   CA YODER
      *C* INCREASED SIZE OF DIST-TABLE TO 1000 SINCE RECEIVING NOW
      *C* HANDLES UP TO 999 ITEMS PER RECEIVING SLIP.
      *C*
      *C* 06/02/99   CA YODER   (DECATUR REQUEST)
      *C*   EXPANDED TAX RATE PERCENTAGE FROM 2 DECIMAL
      *C*   PLACES TO 4.

       DATE-WRITTEN.   DECEMBER 1988.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MANIFEST-REPORT    ASSIGN TO DATABASE-MANRPTFL.
           SELECT SORT-ITEMS         ASSIGN TO DISK-SORT.
           SELECT REG-FILE           ASSIGN TO DATABASE-MANWKFL1.
           SELECT MAN-AKRON-FILE     ASSIGN TO DATABASE-MANAKFL1.
           SELECT TAXGST-FILE        ASSIGN TO DISK-TAXGST
                                     FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-PK-O
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT MVALIDUM-UM-I
               ASSIGN TO DATABASE-MCFLCS0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-RG-I
               ASSIGN TO DATABASE-MCFLCS2601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT MTAX-TX-I
               ASSIGN TO DATABASE-MCFLCS3701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT DINVACCT-RG-I
               ASSIGN TO DATABASE-MCFLCS2701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-IV-I
               ASSIGN TO DATABASE-MCFLCS2504
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-RG-I
               ASSIGN TO DATABASE-MCFLCS2501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DPORECD-PO-I
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR-VN-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.

      *------ FOR IBM ONLY ------*
       FD  MPLTINFO-PK-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  MVALIDUM-UM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-UM-REC-I.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.
       FD  DINVITM-RG-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-RG-REC-I.
           COPY DDS-MCRPCS2600  OF MCFLCS2601.
       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  MTAX-TX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-TX-REC-I.
           COPY DDS-MCRPCS3700  OF MCFLCS3701.
       FD  DINVACCT-RG-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-RG-REC-I.
           COPY DDS-MCRPCS2700  OF MCFLCS2701.
       FD  DINVRCD-IV-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-IV-REC-I.
           COPY DDS-MCRPCS2500  OF MCFLCS2504.
       FD  DINVRCD-RG-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-RG-REC-I.
           COPY DDS-MCRPCS2500  OF MCFLCS2501.
       FD  DPORECD-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-I.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.
       FD  DVENDOR-VN-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-VN-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
      *------ FOR IBM ONLY ------*

       FD  MANIFEST-REPORT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS MANIFEST-REPORT-RECORD.
       01  MANIFEST-REPORT-RECORD    PIC X(133).

       SD  SORT-ITEMS
           RECORD CONTAINS 87 CHARACTERS.
       01  SORT-ITEMS-RECORD.
           05  S-ITEM-RECORD         PIC 9(4).
           05  FILLER                PIC X(77).
           05  S-ITEM-PCT-RECORD     PIC 9V9(4).
           05  FILLER                PIC X.

       FD  REG-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 5 CHARACTERS
           DATA RECORD IS REG-RECORD.
       01  REG-RECORD                PIC X(5).

       FD  MAN-AKRON-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS MAN-AKRON-RECORD.
       01  MAN-AKRON-RECORD          PIC X(80).

       FD  TAXGST-FILE
           RECORD CONTAINS 80 CHARACTERS.
       01  TAXGST-RECORD             PIC X(80).

       WORKING-STORAGE SECTION.
       77  TERRITORY-SAVE              PIC X(4)   VALUE SPACES.
       77  MANIFEST-HEADER-TOTAL       PIC S9(11)V99 VALUE ZEROS.
       77  PAGE-CTR                    PIC S9(4) COMP VALUE ZEROS.
       77  LINE-CTR                    PIC S9(4) COMP VALUE ZEROS.
       77  SUB                         PIC 99  COMP VALUE ZEROS.
9406CK 77  ITEM-IX                     PIC 9(4) COMP VALUE ZEROS.
       77  GST-ENTRY                   PIC 99  COMP VALUE ZEROS.
       77  SAVE-MANIFEST-NO            PIC X(3)     VALUE SPACES.
       77  MAN-EMP-ID                  PIC X(4)     VALUE SPACES.
       77  SAVE-TOTAL-TAX              PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-TOTAL-TAX-ABS          PIC 9(11)V99 VALUE ZEROS.
       77  STORES-QTY                  PIC S9(8)V99  VALUE ZEROS.
       77  PRIME-SAVE                  PIC X(3)     VALUE SPACES.
       77  ITEM-PRICE-EXT              PIC S9(11)V9(7) VALUE ZEROS.
       77  INV-TOTAL-ITM-EXT           PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-TOTAL-MATL-COST        PIC S9(11)V99 VALUE ZEROS.
       77  ACCT-PCT                    PIC S9V9(4)  VALUE ZEROS.
       77  SAVE-ACCT-ADDR              PIC S9(9)  COMP VALUE ZEROS.
       77  SAVE-FRWD-ADDR              PIC S9(9)  COMP VALUE ZEROS.
       77  TOTAL-QTY-DIST              PIC S9(8)V99 VALUE ZEROS.
       77  TOTAL-COST-DIST             PIC S9(11)V99 VALUE ZEROS.
       77  TOTAL-ITEM-DIST-COST        PIC S9(11)V99 VALUE ZEROS.
       77  TOTAL-TAX-DIST              PIC S9(11)V99 VALUE ZEROS.
       77  DIST-COST-DIFF              PIC S9(11)V99 VALUE ZEROS.
       77  DIST-TAX-DIFF               PIC S9(11)V99 VALUE ZEROS.
       77  DIST-QTY-DIFF               PIC S9(8)V99 VALUE ZEROS.
       77  SAVE-ITEM-QTY               PIC S9(8)V99 VALUE ZEROS.
       77  SAVE-ITEM-DIST-COST         PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-ITEM-TAX               PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-ITEM-NO                PIC X(4)     VALUE SPACES.
       77  MAN-RCD-COUNTER             PIC S9(6) COMP VALUE ZEROS.
       77  MAN-INVOICE-COUNTER         PIC S9(4) COMP VALUE ZEROS.
      *77  TOTAL-MTAX-PERCENT          PIC S9(4)V99 COMP VALUE ZEROS.
       77  TOTAL-MTAX-PERCENT          PIC S9(4)V9999 COMP VALUE ZEROS.
       77  ITM-TAX-ADJUST              PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-TOTAL-ITEM-TAX-DIST    PIC S9(11)V99 VALUE ZEROS.
       77  ADDL-ITEM-TAX               PIC S9(11)V99 VALUE ZEROS.
       77  SAVE-LAST-ITEM-NO           PIC X(4)     VALUE SPACES.
       77  TOTAL-CE-AMOUNT             PIC S9(11)V99 VALUE ZEROS.
       77  CE-SUB                      PIC S9(4) COMP VALUE ZEROS.
       77  TOTAL-DISTRIBUTED-COST      PIC S9(11)V99 VALUE ZEROS.
       77  TOTAL-IT-DISTRIBUTED-COST   PIC S9(11)V99 VALUE ZEROS.
       77  TOTAL-IT-CE-AMOUNT          PIC S9(11)V99 VALUE ZEROS.
       77  IT-CTR                      PIC S9(4) COMP VALUE ZEROS.
       77  TOTAL-BALANCE-AMT           PIC S9(11)V99 VALUE ZEROS.
       77  TOTAL-IT-BALANCE-AMT        PIC S9(11)V99 VALUE ZEROS.
       77  CHK-VEN-CODE                PIC X(10)     VALUE SPACES.
       77  CHK-INV-DATE                PIC 9(6)      VALUE ZEROS.
       77  SKIP-INVOICE-SW             PIC X(1)      VALUE "N".
       77  SAVE-STOREROOM-DEPT         PIC X(4)      VALUE SPACES.
       77  COMPANY-SAVE                PIC X(3)      VALUE SPACES.
       77  INVOICE-COUNT               PIC 9(3)      VALUE ZERO.
       77  NUMBER-INVOICES-FOUND       PIC 9         VALUE ZERO.
       77  GST-TAX                     PIC S9(11)V9(4) VALUE ZEROS.
       01  GST-TAX-SW                  PIC X(1).
           88  DONT-TAX-ON-GST                       VALUE "1".
           88  TAX-ON-GST                            VALUE "2".
       01  DUP-INV-SW                  PIC X(1)      VALUE "N".
           88  DUP-INVOICE-EXISTS                    VALUE "Y".
       01  SETUP-ADDTL-DATA.
           05  FILLER                  PIC X(3)      VALUE "116".
           05  SETUP-AD-2              PIC X(3)      VALUE SPACES.
       01  INVOICE-BREAK-DOWN.
           05  IBD-1-5                 PIC X(5).
               88 VALID-TYPE  VALUES ARE
                  "DUTY-"  "FRHT-".
           05  FILLER                  PIC X(9).
       01  PO-RIGHT-JUST               PIC X(7).
       01  PO-RIGHT-JUST-R REDEFINES PO-RIGHT-JUST.
           05  PO-BYTE                 PIC X(1)      OCCURS 7 TIMES.
       01  PO-ZERO-FILLED              PIC X(7).
       01  PO-ZERO-FILLED-R REDEFINES PO-ZERO-FILLED.
           05  PO-ZERO                 PIC X(1)      OCCURS 7 TIMES.
       01  INDX                        PIC 9(1)      VALUE ZERO.
       01  INDY                        PIC 9(1)      VALUE ZERO.
9406CK 01  SCOPE                       PIC X.
      **************************************
      *                                    *
      *   SWITCHES                         *
      *                                    *
      **************************************

       01  HANDLE-BLOWUP-FLAG           PIC X        VALUE "Y".
       01  SWITCH-AREA.
           05  EOF-SW                   PIC X        VALUE SPACES.
           05  AT-LEAST-ONE-ACCT-ENTRY  PIC X        VALUE "N".
           05  NO-ITEMS-SW             PIC X        VALUE "N".

       01  MANIFEST-YEAR                PIC 99  VALUE ZEROS.

       01  SAVE-MANIFEST-DATE.
           05  SAVE-MANIFEST-DATE-YY    PIC XX  VALUE SPACES.
           05  SAVE-MANIFEST-DATE-MM    PIC XX  VALUE SPACES.
           05  SAVE-MANIFEST-DATE-DD    PIC XX  VALUE SPACES.

       COPY CCRTFILE IN COPYLIB.

       01  CDLTF-FILENAME        PIC X(26).

       01  VEN-NOT-ON-FILE.
           05  FILLER  PIC X(14)  VALUE "** VENDOR NOT ".
           05  FILLER  PIC X(10)  VALUE "ON FILE **".

       01  SAVE-MAN-STATUS  PIC X(4).

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                & FILE BUFFERS                            **
      **                                                          **
      **************************************************************
      **************************************************************

      *
      * MANAKFL LAYOUTS
      *
       01  AKRON-HDR-RCD.
           05  AKRON-MAN-FUNCT       PIC X(4).
           05  FILLER                PIC X(3).
           05  AKRON-SUB-TERR        PIC X(4).
           05  AKRON-HDR-MAN-NO      PIC X(3).
           05  AKRON-MAN-DATE.
               10  AKRON-MAN-DATE-MM PIC XX.
               10  AKRON-MAN-DATE-DD PIC XX.
               10  AKRON-MAN-DATE-YY PIC XX.
           05  AKRON-MAN-TOTAL       PIC S9(8)V99.
           05  FILLER                PIC X(50).
       01  AKRON-CE-RCD.
           05  AKRON-REG-NO          PIC X(5).
           05  FILLER                PIC X(1).
           05  AKRON-SD-4            PIC X(1).
           05  AKRON-CE-AMOUNT       PIC S9(8)V99.
           05  AKRON-CE              PIC X.
           05  AKRON-INVOICE-NO      PIC X(14).
           05  AKRON-INVOICE-DATE.
               10  AKRON-INVOICE-DATE-MM    PIC XX.
               10  AKRON-INVOICE-DATE-DD    PIC XX.
               10  AKRON-INVOICE-DATE-YY    PIC XX.
           05  AKRON-INVOICE-TERMS   PIC X(2).
           05  AKRON-ITEM-NUMBER     PIC X(4).
           05  AKRON-IT-INDIC        PIC X(1).
           05  AKRON-D-F-INDIC       PIC X(1).
           05  AKRON-VEN-CODE        PIC X(7).
           05  AKRON-ACCOUNT.
               10  AKRON-PR          PIC X(3).
               10  AKRON-SA          PIC X(3).
               10  AKRON-SD          PIC X(3).
               10  AKRON-AD          PIC X(6).
           05  AKRON-PO-NO           PIC X(7).
           05  AKRON-PO-RLSE         PIC X(3).
           05  AKRON-CURRENCY-CODE   PIC X(2).

      *
      * MANRPTFL LAYOUT
      *
       01  MANIFEST-REPORT-RCD.
           05  MAN-CTL               PIC 9.
           05  MANIFEST-REPORT-LINE  PIC X(132).

      *
      * SORT LAYOUT
      *
       01  SORT-ITEMS-RCD.
           05  S-ITEM                PIC 9(4).
           05  S-CORP-CODE           PIC X(7).
           05  S-CLASS               PIC X(3).
           05  S-UM                  PIC X(2).
           05  S-QUANTITY            PIC S9(8)V99.
           05  S-ITEM-DIST-COST      PIC S9(11)V99.
           05  S-ITEM-FRT            PIC S9(11)V99.
           05  S-ITEM-TAX            PIC S9(11)V99.
           05  S-ACCTG-DATA.
               10  S-PRIME           PIC X(3).
               10  S-SUB             PIC X(3).
               10  S-SUBD.
                   15  S-SUBD-1-3    PIC X(3).
                   15  S-SUBD-4      PIC X(1).
               10  S-ADDL-DATA       PIC X(6).
           05  S-ITEM-PCT            PIC 9V9(4).
           05  S-ITEM-MEMO-INDIC     PIC X.

      *
      * MANWKFL LAYOUT
      *
       01  REG-RCD.
           05  REGISTER-NO           PIC X(5).

       COPY MSTORERM   IN COPYLIB.
       COPY MVALIDUM   IN COPYLIB.
       COPY DPORECD    IN COPYLIB.
       COPY DVENDOR    IN COPYLIB.
       COPY DINVRCD    IN COPYLIB.
       COPY MPLTINFO   IN COPYLIB.
       COPY DINVITM    IN COPYLIB.
       COPY DINVACCT   IN COPYLIB.
       COPY MTAX       IN COPYLIB.
       COPY DATAB      IN COPYLIB.

9406CK 01  DIST-TABLE.
  .        05  OCCURS 1000 TIMES.
  .            10  DIST-ITEM-NO          PIC X(4).
  .            10  DIST-CORP-CODE        PIC X(7).
  .            10  DIST-UM               PIC X(2).
  .            10  DIST-QUANTITY         PIC S9(8)V99.
  .            10  DIST-ITEM-VALUE       PIC S9(11)V99.
  .            10  DIST-ITEM-TAX         PIC S9(11)V99.
  .            10  DIST-ITEM-TOT-VALUE   PIC S9(11)V99.
  .            10  DIST-ITEM-TAX-PCNT    PIC 9(2)V9(4).
9406CK         10  DIST-MEMO-INDIC       PIC X.

      *
      * FILE STATUS DEFINITION FOR AS/400 DB CALLS OR HP KSAM CALLS
      *
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X.
           05  FILE-STATUS-2             PIC X.


      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-MVALIDUM          PIC X(16)  VALUE "MVALIDUM;".
           05  DSET-DVENDOR           PIC X(16)   VALUE "DVENDOR;".
           05  DSET-DINVRCD           PIC X(16)   VALUE "DINVRCD;".
           05  DSET-DINVITM           PIC X(16)   VALUE "DINVITM;".
           05  DSET-DINVACCT          PIC X(16)   VALUE "DINVACCT;".
           05  DSET-MSTORERM          PIC X(16)   VALUE "MSTORERM;".
           05  DSET-MTAX              PIC X(16)   VALUE "MTAX;".

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
           05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".
           05  REQ-SEARCH             PIC X(12) VALUE "REQ-NUMBER;".
           05  REG-SEARCH        PIC X(16) VALUE "REGISTER-NUMBER;".
           05  INVOICE-SEARCH    PIC X(16) VALUE "INVOICE-NUMBER;".

       01  ARG-VALUES.
           05  PO-ARG                 PIC X(14) VALUE SPACES.
           05  CODE-ARG               PIC X(8)  VALUE SPACES.
           05  UM-ARG                 PIC X(2)  VALUE SPACES.
           05  REQ-ARG                PIC X(12) VALUE SPACES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  REGISTER-ARG           PIC X(6)  VALUE SPACES.
           05  TAX-ARG                PIC X(2)  VALUE SPACES.
           05  VEN-ARG                PIC X(10) VALUE SPACES.
           05  INVOICE-ARG            PIC X(14) VALUE SPACES.
           05  CURRENT-REC-ARG        PIC S9(9) COMP.

      *****************************************************
      *                                                   *
      *   R E P O R T    H E A D E R S  &  D E T A I L S  *
      *                                                   *
      *****************************************************


       01  HEADER-1.
           05  FILLER            PIC X(6)  VALUE " PAGE ".
           05  PAGE-NO-OUT       PIC ZZZ9  VALUE ZEROS.
           05  FILLER            PIC X(15) VALUE SPACES.
           05  RPT-HEADER        PIC X(44) VALUE SPACES.
           05  FILLER            PIC X     VALUE SPACES.
           05  PRT-CO            PIC X(3)  VALUE SPACES.
           05  FILLER            PIC X(10) VALUE SPACES.
           05  PRT-DATE          PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  PRT-TIME          PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(15) VALUE SPACES.
           05  FILLER            PIC X(8)  VALUE "TMANTOR".
           05  FILLER            PIC X(2)  VALUE SPACES.

       01  MANIFEST-HEADER1.
           05  FILLER  PIC X(36) VALUE SPACES.
           05  FILLER  PIC X(60) VALUE ALL "*".
           05  FILLER  PIC X(36) VALUE SPACES.

       01  MANIFEST-HEADER2.
           05  FILLER  PIC X(36) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".
           05  FILLER  PIC X(56) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".
           05  FILLER  PIC X(36) VALUE SPACES.

       01  MANIFEST-HEADER3.
           05  FILLER  PIC X(36) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".
           05  FILLER  PIC X(10) VALUE SPACES.
           05  MAN-HDR3-RPT-LINE  PIC X(42) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE "**".
           05  FILLER  PIC X(36) VALUE SPACES.

       01  MANIFEST-RPT-LINE1.
           05  FILLER  PIC X(17) VALUE "MANIFEST FUNCTION".
           05  FILLER  PIC X(9)  VALUE "       - ".
           05  MAN-FUNCT-OUT  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(12) VALUE SPACES.

       01  MANIFEST-RPT-LINE2.
           05  FILLER  PIC X(15) VALUE "MANIFEST NUMBER".
           05  FILLER  PIC X(11) VALUE "         - ".
           05  MAN-NO-OUT  PIC X(3) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE SPACES.

       01  MANIFEST-RPT-LINE3.
           05  FILLER  PIC X(13) VALUE "MANIFEST DATE".
           05  FILLER  PIC X(13) VALUE "           - ".
           05  MAN-DATE-OUT PIC X(8) VALUE SPACES.
           05  FILLER  PIC X(8)  VALUE SPACES.

       01  MANIFEST-RPT-LINE4.
           05  FILLER  PIC X(14) VALUE "MANIFEST TOTAL".
           05  FILLER  PIC X(12) VALUE "          - ".
           05  MAN-TOTAL-OUT  PIC -(11)9.99 VALUE ZEROS.
           05  FILLER  PIC X(1)  VALUE SPACES.

       01  MANIFEST-RPT-LINE5.
           05  FILLER  PIC X(16) VALUE "MANIFEST RECORD ".
           05  FILLER  PIC X(10) VALUE "COUNT   - ".
           05  FILLER  PIC X(09) VALUE SPACES.
           05  MAN-RCD-OUT PIC Z(5)9 VALUE ZEROS.
           05  FILLER  PIC X(1)   VALUE SPACES.

       01  MANIFEST-RPT-LINE6.
           05  FILLER  PIC X(17) VALUE "MANIFEST INVOICE ".
           05  FILLER  PIC X(9) VALUE "COUNT  - ".
           05  MAN-INV-CTR-OUT  PIC ZZZ9 VALUE ZEROS.
           05  FILLER  PIC X(12) VALUE SPACES.

       01  MANIFEST-RPT-LINE7.
           05  FILLER  PIC X(17) VALUE "MANIFEST EMPLOYEE".
           05  FILLER  PIC X(9)  VALUE " ID    - ".
           05  MAN-EMP-ID-OUT PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(12) VALUE SPACES.

       01  MANIFEST-RPT-LINE8.
           05  FILLER  PIC X(17) VALUE "TOTAL DISTRIBUTED".
           05  FILLER  PIC X(9) VALUE " COST  - ".
           05  MAN-TOTAL-DIST-OUT  PIC -(11)9.99 VALUE ZEROS.
           05  FILLER  PIC X(12) VALUE SPACES.

       01  MANIFEST-RPT-LINE9.
           05  FILLER  PIC X(17) VALUE "TOTAL IT COST    ".
           05  FILLER  PIC X(9)  VALUE "       - ".
           05  MAN-IT-TOTAL-OUT  PIC -(11)9.99 VALUE ZEROS.
           05  FILLER  PIC X(1)  VALUE SPACES.

       01  MANIFEST-RPT-LINE10.
           05  FILLER  PIC X(17) VALUE "TOTAL IT DIST COS".
           05  FILLER  PIC X(9)  VALUE "T      - ".
           05  MAN-IT-DIST-OUT   PIC -(11)9.99 VALUE ZEROS.
           05  FILLER  PIC X(1)  VALUE SPACES.

       01  MANIFEST-RPT-LINE11.
           05  FILLER  PIC X(17) VALUE "INTERNAL ORDER CO".
           05  FILLER  PIC X(9)  VALUE "UNT    - ".
           05  FILLER  PIC X(12) VALUE SPACES.
           05  IT-CTR-OUT        PIC ZZ9 VALUE ZEROS.
           05  FILLER  PIC X(1)  VALUE SPACES.

       01  STORES-PAGE-HDR-1.
           05  FILLER  PIC X(15) VALUE SPACES.
           05  FILLER  PIC X(17) VALUE "MANIFEST NUMBER  ".
           05  STR-MAN-NO-OUT  PIC X(3) VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  FILLER  PIC X(15) VALUE "MANIFEST DATE  ".
           05  STR-MAN-DATE-OUT  PIC X(8) VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  FILLER  PIC X(19) VALUE "NUMBER OF INVOICES ".
           05  STR-MAN-INV-CTR-OUT  PIC ZZZ9.
           05  FILLER  PIC X(41) VALUE SPACES.

       01  STORES-HEADER-1.
           05  FILLER  PIC X(11) VALUE "REGISTER   ".
           05  FILLER  PIC X(16) VALUE "PURCHASE ORDER  ".
           05  FILLER  PIC X(13) VALUE "VENDOR CODE  ".
           05  FILLER  PIC X(17) VALUE "BUDGET NUMBER    ".
           05  FILLER  PIC X(14) VALUE "DIST. COST    ".
           05  FILLER  PIC X(22) VALUE "NET DUE VENDOR        ".
           05  FILLER  PIC X(11) VALUE "DISCOUNT   ".
           05  FILLER  PIC X(14) VALUE "TERMS         ".
           05  FILLER  PIC X(6)  VALUE "TAX   ".
           05  FILLER  PIC X(8)  VALUE "TAX CODE".
           05  FILLER  PIC X(6)  VALUE SPACES.

       01  STORES-DETAIL-LINE-1.
           05  FILLER  PIC X(2)  VALUE SPACES.
           05  REG-OUT  PIC X(5) VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE SPACES.
           05  PO-NUM-OUT PIC X(10)  VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE SPACES.
           05  VEN-CODE-OUT PIC X(7) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  BUDGT-NO-OUT PIC X(12) VALUE SPACES.
           05  FILLER  PIC X(1)  VALUE SPACES.
           05  DIST-COST-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(2) VALUE SPACES.
           05  DUE-VENDOR-OUT PIC Z(10)9.99CR VALUE ZEROS.
           05  DISCOUNT-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(2)  VALUE SPACES.
           05  TERMS-OUT  PIC X(2)  VALUE SPACES.
           05  TAX-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(3)  VALUE SPACES.
           05  TAX-CODE-OUT  PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X VALUE SPACES.


       01  MANIFEST-DETAIL-LINE1.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(10) VALUE "INVOICE NO".
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "DATE    TERMS".
           05  FILLER  PIC X(13) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "NET DUE VENDOR".
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(60) VALUE "CURRENCY CODE".

       01  MANIFEST-DETAIL-LINES.
           05  MANIFEST-DETAIL-LINE2.
               10  FILLER            PIC X(2)  VALUE SPACES.
               10  M-REG-NO          PIC X(5) VALUE SPACES.
               10  FILLER            PIC X(2)  VALUE SPACES.
               10  M-INV-NO          PIC X(14) VALUE SPACES.
               10  FILLER            PIC X(3)  VALUE SPACES.
               10  M-INV-DATE        PIC X(8)  VALUE SPACES.
               10  FILLER            PIC X(3)  VALUE SPACES.
               10  M-INV-TERMS       PIC X(2)  VALUE SPACES.
               10  FILLER            PIC X(14) VALUE SPACES.
               10  M-NET-DUE-VENDOR  PIC -(11)9.99 VALUE ZEROS.
               10  FILLER            PIC X(4)  VALUE SPACES.
               10  M-CUR-CODE-OUT    PIC X(2)  VALUE SPACES.
               10  FILLER            PIC X(2)  VALUE SPACES.
               10  M-CUR-DESC-OUT    PIC X(12) VALUE SPACES.
               10  FILLER            PIC X(45) VALUE SPACES.

           05  MANIFEST-DETAIL-LINE3.
               10  FILLER            PIC X(9).
               10  M-VEN-LIT         PIC X(7).
               10  M-VEN-CODE        PIC X(7).
               10  FILLER            PIC X(20).
               10  IT-LIT            PIC X(89).
               10  FILLER  PIC X(109).

           05  MANIFEST-DETAIL-LINE4.
               10  FILLE             PIC X(9).
               10  M-VEN-NAME        PIC X(44).
               10  FILLER            PIC X(79).

       01  ITEM-HEADER.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(17) VALUE "ITEM  CORP CODE  ".
           05  FILLER  PIC X(15) VALUE "CE     UM      ".
           05  FILLER  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "QUANTITY     ".
           05  FILLER  PIC X(15) VALUE "ITEM VALUE     ".
           05  FILLER  PIC X(15) VALUE "ACCOUNTING DATA".
           05  FILLER  PIC X(43) VALUE SPACES.

       01  ITEM-DETAIL-LINE.
           05  FILLER    PIC X(5)  VALUE SPACES.
           05  ITEM-OUT  PIC ZZ9   VALUE ZEROS.
           05  ITEM-OUT-X  REDEFINES ITEM-OUT  PIC X(3).
           05  FILLER    PIC X(3)  VALUE SPACES.
           05  CORP-CODE-OUT  PIC X(7) VALUE SPACES.
           05  FILLER    PIC X(4)  VALUE SPACES.
           05  CE-OUT    PIC X(1)  VALUE SPACES.
           05  FILLER    PIC X(5)  VALUE SPACES.
           05  UM-OUT    PIC X(2)  VALUE SPACES.
           05  FILLER    PIC X(12) VALUE SPACES.
           05  QTY-OUT   PIC -Z(8).99 VALUE ZEROS.
           05  FILLER    PIC X(1)  VALUE SPACES.
           05  ITEM-VALUE-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER    PIC X     VALUE SPACES.
           05  PRIME-OUT PIC X(3)  VALUE SPACES.
           05  FILLER    PIC X     VALUE SPACES.
           05  SUB-OUT   PIC X(3)  VALUE SPACES.
           05  FILLER    PIC X     VALUE SPACES.
           05  SUBD-OUT  PIC X(4)  VALUE SPACES.
           05  FILLER    PIC X     VALUE SPACES.
           05  ADDL-DATA-OUT  PIC X(6) VALUE SPACES.
           05  FILLER    PIC X     VALUE SPACES.
           05  ACCT-PCT-OUT PIC ZZ9.99 VALUE ZEROS.
           05  FILLER    PIC X     VALUE "%".

       01  OUT-BALANCE-MSG.
           05  FILLER  PIC X(19)  VALUE "## OUT OF BALANCE -".
           05  FILLER  PIC X(18)  VALUE " OUT OF BALANCE ##".
           05  FILLER  PIC X(56)  VALUE SPACES.
           05  FILLER  PIC X(19)  VALUE "## OUT OF BALANCE -".
           05  FILLER  PIC X(18)  VALUE " OUT OF BALANCE ##".

       01  MAN-SUM-OUT-BAL-MSG.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE ALL "*".
           05  FILLER  PIC X(12) VALUE " TOTAL COST ".
           05  FILLER  PIC X(15) VALUE "DISTRIBUTED IS ".
           05  FILLER  PIC X(15) VALUE "OUT OF BALANCE ".
           05  FILLER  PIC X(20) VALUE ALL "*".
           05  FILLER  PIC X(30) VALUE SPACES.

       01  MANIFEST-HEADER.
           05  FILLER  PIC X(17)  VALUE "ACCOUNTS PAYABLE ".
           05  FILLER  PIC X(19)  VALUE "MANIFEST PROCESSING".
           05  FILLER  PIC X(7)   VALUE " REPORT".

       01  NO-ITEMS-MSG.
           05  FILLER  PIC X(14) VALUE SPACES.
           05  FILLER  PIC X(16) VALUE "** NO ITEMS WERE".
           05  FILLER  PIC X(15) VALUE " FOUND ON THIS ".
           05  FILLER  PIC X(10) VALUE "INVOICE **".
           05  FILLER  PIC X(77) VALUE SPACES.

       01  DUP-INV-MSG.
           05  FILLER  PIC X(17) VALUE "WARNING DUPLICATE".
           05  FILLER  PIC X(21) VALUE " INVOICE NUMBER FOUND".

       01  DASH-LINE.
           05  FILLER  PIC X(132) VALUE ALL "-".
       01  ASTERISK-LINE.
           05  FILLER  PIC X(132) VALUE ALL "*".
       01  SAVE-REPORT-LINE  PIC X(132)  VALUE SPACES.
       01  DETAIL-LINE       PIC X(132)  VALUE SPACES.

      **************************************************
      **                DATE AREAS                    **
      **************************************************

       01  DATES-AND-TIMES.
           05  CUR-DATE.
               10  YY               PIC XX.
               10  MM               PIC XX.
               10  DD               PIC XX.
       COPY TDATECHK   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION.
       MAIN-LINE-LOGIC.

9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           PERFORM 10-INIT.
           PERFORM 60-CALCULATE-MANIFEST-TOTAL THRU 60-CMT-X.
           PERFORM 70-CREATE-AKRON-FILE THRU 70-CAF-X.
           PERFORM 130-UPDATE-MPLTINFO.
           CLOSE MANIFEST-REPORT.

      *
      * DELETE MNACTIVE
      *
           MOVE "MNACTIVE" TO CDLTF-FILENAME.
           CALL "CDLTF" USING CDLTF-FILENAME.
           PERFORM 9999-CLOSES.

           STOP RUN.

       10-INIT.
           MOVE "Y" TO HANDLE-BLOWUP-FLAG.
           PERFORM 9999-OPENS.

      *
      * GET CO. AND PRIME FROM MPLTINFO
      * USING 'P 01' AS THE ARGUMENT
      *
           MOVE "P 01" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL
             MOVE "GETKEY MPLTINFO 10-INIT" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
           MOVE MPLTINFO-COMPANY TO PRT-CO, COMPANY-SAVE.
           MOVE MPLTINFO-TERR TO TERRITORY-SAVE.
           MOVE MPLTINFO-PRIME TO PRIME-SAVE.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-YMD-OUT TO CUR-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
           MOVE "P 03" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL
             MOVE "GETKEY MPLTINFO 10-INIT" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
           MOVE MPLTINFO-STOREROOM TO SAVE-STOREROOM-DEPT.

      *
      * FIND THE ENTRY THAT CONTAINS THE GST INFORMATION
      *
           MOVE 0 TO GST-ENTRY.
           MOVE "PTX1" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL
             MOVE "GETKEY MPLTINFO 10-INIT" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL GST-ENTRY > 0 OR
                         SUB > 2

             IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
               MOVE SUB TO GST-ENTRY
             END-IF

           END-PERFORM.

           IF GST-ENTRY EQUAL ZERO

             MOVE "PTX2" TO PLT-ARG
             PERFORM 9999-GETKEY-MPLTINFO-PK-O
             IF NOT GOOD-CALL
               MOVE "GETKEY MPLTINFO 10-INIT" TO BU-DISPLAY-MSG
               MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
               PERFORM 2100-BLOWUP
             END-IF
             PERFORM 9999-RESET-MPLTINFO-PK-O
             PERFORM VARYING SUB FROM 1 BY 1
                     UNTIL GST-ENTRY > 0 OR
                           SUB > 2

               IF MPLTINFO-TAX-DISTRICT(SUB) = "GST"
                 COMPUTE GST-ENTRY = SUB + 2
               END-IF

             END-PERFORM

      *
      * IF THE GST ENTRY WASN'T FOUND THEN BLOWUP
      *
             IF GST-ENTRY EQUAL ZERO

               MOVE "NO ENTRY FOUND FOR GST" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP

             END-IF

           END-IF.

      *
      * CHECK FOR EXISTENCE OF TAXGST FILE
      *  IF IT EXISTS THIS MEANS TO APPLY TAXES OTHER THAN GST
      *  ON BASE + GST ( DOUBLE TAXATION )
      *
           OPEN INPUT TAXGST-FILE.
           IF FILE-STATUS NOT EQUAL ZERO
             SET DONT-TAX-ON-GST TO TRUE
           ELSE
             SET TAX-ON-GST TO TRUE
           END-IF.
           CLOSE TAXGST-FILE.

       20-WRITE-MANIFEST-REPORT-LINE.
           IF LINE-CTR > 54
             PERFORM 30-WRITE-MANIFEST-HEADER
           END-IF.
           ADD MAN-CTL TO LINE-CTR.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.

       30-WRITE-MANIFEST-HEADER.
           MOVE MANIFEST-REPORT-LINE TO SAVE-REPORT-LINE.
           MOVE ZERO TO MAN-CTL, LINE-CTR.
           ADD 1 TO PAGE-CTR.
           MOVE PAGE-CTR TO PAGE-NO-OUT.
           MOVE HEADER-1 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE DASH-LINE TO MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE SAVE-REPORT-LINE TO MANIFEST-REPORT-LINE.
           MOVE 1 TO MAN-CTL.

       60-CALCULATE-MANIFEST-TOTAL.
           OPEN INPUT REG-FILE.

       61-GET-DINVRCD.
           READ REG-FILE INTO REG-RCD
             AT END GO TO 62-READ-INVRCD-COMPLETE.

           MOVE REGISTER-NO TO REGISTER-ARG.
           PERFORM 140-GET-DINVRCD.
           IF SKIP-INVOICE-SW = "Y"
             GO TO 61-GET-DINVRCD.

      *
      * CALCULATE THE MANIFEST TOTAL FOR THE HEADER
      * RECORD INTO TORONTO.
      * INCLUDE ITs ON THE MANIFEST FILE CREATED FOR TORONTO
      * INCLUDE ITs ON THE MANAKFL1 TO BE SENT TO TORONTO
      *
           IF INV-NO-CHECK-INDIC NOT = SPACES

             ADD INV-NET-DUE-VENDOR TO TOTAL-IT-CE-AMOUNT
             ADD 1 TO IT-CTR

           ELSE

             ADD INV-NET-DUE-VENDOR TO MANIFEST-HEADER-TOTAL
             ADD 1 TO MAN-INVOICE-COUNTER

           END-IF.
           GO TO 61-GET-DINVRCD.

       62-READ-INVRCD-COMPLETE.
           CLOSE REG-FILE.
           MOVE "PMAN" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NOT GOOD-CALL

             MOVE "GETKEY MPLTINFO 62-RIC" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP

           END-IF.
           PERFORM 9999-RESET-MPLTINFO-PK-O.
           MOVE MPLTINFO-MAN-DATE TO SAVE-MANIFEST-DATE.
           MOVE MPLTINFO-MAN-NO TO SAVE-MANIFEST-NO.

       63-WRITE-MANIFEST-REPORT.
           OPEN OUTPUT MANIFEST-REPORT.
           MOVE MANIFEST-HEADER TO RPT-HEADER.
           MOVE ZEROS TO PAGE-CTR.
           MOVE SPACES TO MANIFEST-REPORT-LINE.
           MOVE 1 TO MAN-CTL.
           PERFORM 30-WRITE-MANIFEST-HEADER.
           MOVE 5 TO MAN-CTL.
           MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE 1 TO MAN-CTL.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MPLTINFO-MAN-STATUS TO MAN-FUNCT-OUT.
           MOVE MPLTINFO-MAN-NO TO MAN-NO-OUT.
           MOVE 4 TO DATE-MODE.
           MOVE MPLTINFO-MAN-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO MAN-DATE-OUT.
           MOVE MANIFEST-HEADER-TOTAL TO MAN-TOTAL-OUT.
           MOVE MAN-INVOICE-COUNTER TO MAN-INV-CTR-OUT.
           MOVE MPLTINFO-MAN-ID TO MAN-EMP-ID-OUT.
           MOVE MANIFEST-RPT-LINE1 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE2 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE3 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE4 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE6 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE7 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.

       60-CMT-X.
           EXIT.

       70-CREATE-AKRON-FILE.
           OPEN INPUT REG-FILE.
           OPEN OUTPUT MAN-AKRON-FILE.
           MOVE 99 TO LINE-CTR.
           MOVE SPACES TO MANIFEST-DETAIL-LINES.
           PERFORM 80-WRITE-AKRON-HDR-RCD.

       71-READ-REG-FILE.
           READ REG-FILE INTO REG-RCD
             AT END GO TO 72-CLOSE-FILES.

           MOVE REGISTER-NO TO REGISTER-ARG.
           PERFORM 140-GET-DINVRCD.
           IF SKIP-INVOICE-SW = "Y"
             GO TO 71-READ-REG-FILE.

           MOVE MANIFEST-DETAIL-LINE1 TO MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.
           PERFORM 150-GET-PO-HEADER.
           MOVE SPACES TO AKRON-CE-RCD.
           MOVE INV-REG-NO TO AKRON-REG-NO, M-REG-NO.
           MOVE INV-NO TO AKRON-INVOICE-NO, M-INV-NO.
           MOVE 4 TO DATE-MODE.
           MOVE INV-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT TO AKRON-INVOICE-DATE.
           MOVE DATE-SLASH-OUT TO M-INV-DATE.
           MOVE INV-TERMS TO AKRON-INVOICE-TERMS, M-INV-TERMS.
           MOVE INV-NET-DUE-VENDOR TO M-NET-DUE-VENDOR.
           MOVE INV-NO TO INVOICE-BREAK-DOWN.
           IF VALID-TYPE

      *
      * FOR INVOICES FOR DUTY/FREIGHT RECORDS (LOADED ONLY BY TDUTYLOD)FORCE
      * THE CANADIAN CURRENCY
      *
             MOVE "08" TO AKRON-CURRENCY-CODE,
                          M-CUR-CODE-OUT, M-CUR-DESC-OUT

           ELSE

             MOVE PO-CURRENCY-CODE TO AKRON-CURRENCY-CODE,
                                      M-CUR-CODE-OUT, UM-ARG
             IF PO-CURRENCY-CODE NOT = SPACES

               PERFORM 9999-GETKEY-MVALIDUM-UM-I
               IF NOT GOOD-CALL

                 MOVE "GETKEY MVALIDUM 71-RRF" TO BU-DISPLAY-MSG
                 MOVE UM-ARG TO BU-DISPLAY-FLD(1)
                 PERFORM 2100-BLOWUP

               ELSE

                 MOVE VALID-CURRENCY-DESC TO M-CUR-DESC-OUT

               END-IF

             ELSE

               MOVE SPACES TO M-CUR-DESC-OUT

             END-IF

           END-IF.

           MOVE INV-VEN-CODE TO AKRON-VEN-CODE, M-VEN-CODE.
           MOVE INV-PO-NO TO PO-RIGHT-JUST.
           MOVE ZEROS TO PO-ZERO-FILLED.
           MOVE 7 TO INDY.
           PERFORM VARYING INDX FROM 7 BY -1
                   UNTIL INDX < 1

             IF PO-BYTE(INDX) NOT EQUAL SPACE
               MOVE PO-BYTE(INDX) TO PO-ZERO(INDY)
               SUBTRACT 1 FROM INDY
             END-IF

           END-PERFORM.
           MOVE PO-ZERO-FILLED TO AKRON-PO-NO.
           MOVE INV-RLSE TO AKRON-PO-RLSE.
           MOVE "VENDOR" TO M-VEN-LIT.
           IF INV-NO-CHECK-INDIC NOT = SPACES
             MOVE "INTERNAL ORDER" TO IT-LIT
           ELSE
             MOVE SPACES TO IT-LIT
           END-IF.
           MOVE MANIFEST-DETAIL-LINE2 TO MANIFEST-REPORT-LINE.
           MOVE 1 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.
           MOVE MANIFEST-DETAIL-LINE3 TO MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.
           PERFORM 160-GET-VENDOR.
           MOVE ZEROS TO  SUB, TOTAL-CE-AMOUNT, INV-TOTAL-ITM-EXT.
           IF INV-PAYMENT-IND = "P"
             ADD INV-P-MATL-EXT TO INV-TOTAL-ITM-EXT ROUNDED
           ELSE
             ADD INV-I-MATL-EXT TO INV-TOTAL-ITM-EXT ROUNDED
           END-IF.
           ADD INV-ADD-TAX, CE5-TAX GIVING SAVE-TOTAL-TAX ROUNDED.
           SUBTRACT SAVE-TOTAL-TAX FROM INV-NET-DUE-VENDOR
             GIVING SAVE-TOTAL-MATL-COST.

           MOVE ZEROS TO TOTAL-COST-DIST, TOTAL-TAX-DIST.

            SORT SORT-ITEMS
               ON ASCENDING KEY S-ITEM-RECORD,
                                S-ITEM-PCT-RECORD
               INPUT  PROCEDURE IS 110-COLLECT-ITEM-INFO
               OUTPUT PROCEDURE IS 120-DIST-COST-WRITE-REPORT.

9406CK*
  .   * CLEAR DIST-TABLE
  .   *
9406CK     INITIALIZE DIST-TABLE.

      *
      *  IF TORONTO WANTS RECORDS FOR INFO ONLY WHICH CONCERN
      *  DEDUCTIONS TAKEN ON THE INVOICE REMOVE THESE COMMENTS.
      *
      *    IF INV-NO-CHECK-INDIC EQUAL SPACES
      *      MOVE SPACES TO AKRON-ITEM-NUMBER
      *      PERFORM VARYING SUB FROM 2 BY 1
      *              UNTIL SUB > 10
      *
      *        IF CE-CODE(SUB) NOT EQUAL SPACES
      *          MOVE CE-CODE(SUB) TO AKRON-CE
      *          MOVE CE-VALUE(SUB) TO AKRON-CE-AMOUNT
      *          MOVE ALL "*" TO AKRON-ACCOUNT
      *          WRITE MAN-AKRON-RECORDD FROM AKRON-CE-RCD
      *        END-IF
      *
      *      END-PERFORM
      *
      *    END-IF.

      *
      * BUILD AND WRITE GST RECORD
      *

      *
      * IF GST-TAX CALCULATED IS GREATER THAN TAX SPECIFIED ON
      * THE INVOICE THEN SIMPLY CHARGE ALL TAX AS GST
      * ONLY WRITE THE GST RECORD IF THERE WERE ITEMS FOUND FOR
      * THE INVOICE AND IF THE INVOICE IS NOT A DUTY OR FRGT
      * INVOICE. VALID-TYPE IS 88 LEVEL FOR 'DUTY-' AND 'FRGT-'.
      *
           IF NO-ITEMS-SW EQUAL "N" AND
              NOT VALID-TYPE

             MOVE INV-ADD-GST TO AKRON-CE-AMOUNT
             MOVE "G" TO AKRON-D-F-INDIC
             MOVE ZEROES TO AKRON-ITEM-NUMBER
             MOVE SPACES TO AKRON-ACCOUNT, AKRON-IT-INDIC,
                            AKRON-SD-4
             WRITE MAN-AKRON-RECORD FROM AKRON-CE-RCD

9208CK* WRITE A RECORD FOR VALLEYFIELD'S QST/TVQ TAX
  .   * USING THE SAME FORMAT AS THE GST RECORD ABOVE
  .
  .          IF COMPANY-SAVE = "629"
  .             SUBTRACT INV-ADD-GST FROM INV-ADD-TAX
  .                GIVING AKRON-CE-AMOUNT
  .             MOVE "Q" TO AKRON-D-F-INDIC
  .             MOVE ZEROES TO AKRON-ITEM-NUMBER
  .             MOVE SPACES TO AKRON-ACCOUNT, AKRON-IT-INDIC,
  .                            AKRON-SD-4
  .             WRITE MAN-AKRON-RECORD FROM AKRON-CE-RCD
  .          END-IF
9208CK     END-IF.

      *
      * CHECK FOR BALANCE
      *
           IF INV-NET-DUE-VENDOR NOT EQUAL TOTAL-ITEM-DIST-COST

             MOVE OUT-BALANCE-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE
             MOVE OUT-BALANCE-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE

           END-IF.

      *
      * CHECK FOR DUPLICATE INVOICE NUMBER
      *
           PERFORM 100-CHECK-DUP-INV.
           IF DUP-INVOICE-EXISTS

             MOVE DUP-INV-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE
             MOVE DUP-INV-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE

           END-IF.

      *
      * WRITE THE INVOICE SEPARATOR LINE
      *
           MOVE ASTERISK-LINE TO MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.

           GO TO 71-READ-REG-FILE.

       72-CLOSE-FILES.
           PERFORM 90-WRITE-CONTROL-PAGE.
           CLOSE MAN-AKRON-FILE, REG-FILE.
       70-CAF-X.
           EXIT.

       80-WRITE-AKRON-HDR-RCD.
           MOVE SPACES TO AKRON-HDR-RCD.
           MOVE MPLTINFO-MAN-STATUS TO AKRON-MAN-FUNCT.
           MOVE TERRITORY-SAVE TO AKRON-SUB-TERR.
           MOVE SAVE-MANIFEST-NO TO AKRON-HDR-MAN-NO.
           MOVE SAVE-MANIFEST-DATE TO DATE-VALIDATE-IN.
           MOVE 4 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT TO AKRON-MAN-DATE.
           COMPUTE AKRON-MAN-TOTAL = MANIFEST-HEADER-TOTAL +
                                     TOTAL-IT-CE-AMOUNT.
           WRITE MAN-AKRON-RECORD FROM AKRON-HDR-RCD.

       90-WRITE-CONTROL-PAGE.
           MOVE 99 TO LINE-CTR.
           MOVE SPACES TO MANIFEST-REPORT-LINE.
           PERFORM 30-WRITE-MANIFEST-HEADER.
           MOVE 5 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.

           MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE 1 TO MAN-CTL.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-RPT-LINE4 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE TOTAL-DISTRIBUTED-COST TO MAN-TOTAL-DIST-OUT.
           MOVE MANIFEST-RPT-LINE8 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE TOTAL-IT-CE-AMOUNT TO MAN-IT-TOTAL-OUT.
           MOVE MANIFEST-RPT-LINE9 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE TOTAL-IT-DISTRIBUTED-COST TO MAN-IT-DIST-OUT.
           MOVE MANIFEST-RPT-LINE10 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE IT-CTR TO IT-CTR-OUT.
           MOVE MANIFEST-RPT-LINE11 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MAN-RCD-COUNTER TO MAN-RCD-OUT.
           MOVE MANIFEST-RPT-LINE5 TO MAN-HDR3-RPT-LINE.
           MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.
           MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE.
           WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD.

           IF TOTAL-DISTRIBUTED-COST NOT = MANIFEST-HEADER-TOTAL OR
              TOTAL-IT-DISTRIBUTED-COST NOT = TOTAL-IT-CE-AMOUNT

             MOVE MAN-SUM-OUT-BAL-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE
             MOVE MAN-SUM-OUT-BAL-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE
             MOVE MAN-SUM-OUT-BAL-MSG TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE

           END-IF.

           IF DUP-INVOICE-EXISTS

             MOVE 4 TO MAN-CTL
             MOVE SPACES TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             MOVE 1 TO MAN-CTL
             MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             MOVE DUP-INV-MSG TO MAN-HDR3-RPT-LINE
             MOVE MANIFEST-HEADER3 TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             MOVE MANIFEST-HEADER2 TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD
             MOVE MANIFEST-HEADER1 TO MANIFEST-REPORT-LINE
             WRITE MANIFEST-REPORT-RECORD FROM MANIFEST-REPORT-RCD

           END-IF.

       100-CHECK-DUP-INV.
           MOVE INV-VEN-CODE TO CHK-VEN-CODE.
           MOVE INV-DATE TO CHK-INV-DATE.
           MOVE INV-NO TO INVOICE-ARG.
           MOVE 0 TO NUMBER-INVOICES-FOUND.
           PERFORM 9999-CHAINHD-DINVRCD-IV-I.
           PERFORM 9999-GETNEXT-DINVRCD-IV-I.
           PERFORM VARYING INVOICE-COUNT FROM 1 BY 1
                   UNTIL NUMBER-INVOICES-FOUND > 1 OR
                         INVOICE-COUNT > 35        OR
                         END-OF-CHAIN

             IF INV-VEN-CODE = CHK-VEN-CODE AND
                INV-DATE = CHK-INV-DATE
               ADD 1 TO NUMBER-INVOICES-FOUND
             END-IF
             PERFORM 9999-GETNEXT-DINVRCD-IV-I

           END-PERFORM.
           IF NUMBER-INVOICES-FOUND > 1
             MOVE "Y" TO DUP-INV-SW
           ELSE
             MOVE "N" TO DUP-INV-SW
           END-IF.

       110-COLLECT-ITEM-INFO SECTION.
       110-CII-PARAGRAPH.

      *
      * IF THERE ARE NO ITEMS SET THE FLAG AND EXIT THE
      * PROCEDURE
      *
9206CK     INITIALIZE ITEM-IX.
           PERFORM 9999-CHAINHD-DINVITM-RG-I.
           PERFORM 9999-GETNEXT-DINVITM-RG-I.

           IF END-OF-CHAIN
             MOVE "Y" TO NO-ITEMS-SW
             GO TO 110-CII-X.

           MOVE "N" TO NO-ITEMS-SW.
           PERFORM 220-BUILD-ITEM-RECORD.
           PERFORM 9999-GETNEXT-DINVITM-RG-I.
           PERFORM UNTIL END-OF-CHAIN

             PERFORM 220-BUILD-ITEM-RECORD
             PERFORM 9999-GETNEXT-DINVITM-RG-I

           END-PERFORM.

      *
      * DISTRIBUTE REMAINING COST ON THE LAST ITEM
      *
           PERFORM 190-CHECK-FOR-PROPER-COST-DIST.

      *
      * GET THE FIRST ACCOUNTING ENTRY FOR THIS REGISTER
      *   THESE ARE IN ORDER BY ITEM NUMBER/SEQUENCE NUMBER
      *
           PERFORM 9999-CHAINHD-DINVACCT-RG-I.
           PERFORM 9999-GETNEXT-DINVACCT-RG-I.
9406CK     INITIALIZE ITEM-IX.

       111-READ-DIST-FILE.
9406CK     ADD 1 TO ITEM-IX.
  .        IF ITEM-IX > 1000  OR  DIST-ITEM-NO (ITEM-IX) = SPACES
  .           GO TO 110-CII-X.
  .
  .        MOVE DIST-ITEM-NO (ITEM-IX) TO S-ITEM.
  .        MOVE DIST-CORP-CODE (ITEM-IX) TO S-CORP-CODE.
  .        MOVE DIST-QUANTITY (ITEM-IX) TO S-QUANTITY.
  .        MOVE DIST-UM (ITEM-IX) TO S-UM.
9406CK     MOVE DIST-ITEM-TOT-VALUE (ITEM-IX) TO S-ITEM-DIST-COST.
           MOVE "N" TO AT-LEAST-ONE-ACCT-ENTRY.
           PERFORM 180-GET-DINVACCT-DATA THRU 180-GDD-X.

           GO TO 111-READ-DIST-FILE.

       110-CII-X.
           EXIT.

       120-DIST-COST-WRITE-REPORT SECTION.

       121-DIST-COSTS.
           MOVE ITEM-HEADER TO MANIFEST-REPORT-LINE.
           MOVE 2 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.
           MOVE ZEROS TO SAVE-ITEM-NO, TOTAL-ITEM-DIST-COST.
           IF NO-ITEMS-SW = "Y"

             MOVE NO-ITEMS-MSG TO MANIFEST-REPORT-LINE
             MOVE 2 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE
             GO TO 120-DCWR-X

           END-IF.

           MOVE SPACES TO EOF-SW.
           PERFORM 230-RETURN-RCD.
           IF EOF-SW = "Y"
             GO TO 120-DCWR-X.

       122-NEW-ITEM-LOOP.
           MOVE S-ITEM TO AKRON-ITEM-NUMBER, ITEM-OUT, SAVE-ITEM-NO.
           MOVE S-CORP-CODE TO CORP-CODE-OUT.
           MOVE S-UM TO UM-OUT.
           MOVE "N" TO AT-LEAST-ONE-ACCT-ENTRY.
           MOVE S-QUANTITY TO SAVE-ITEM-QTY.
           MOVE S-ITEM-DIST-COST TO SAVE-ITEM-DIST-COST.
           IF INV-NO-CHECK-INDIC NOT = SPACES
             ADD S-ITEM-DIST-COST TO TOTAL-IT-DISTRIBUTED-COST
           ELSE
             ADD S-ITEM-DIST-COST TO TOTAL-DISTRIBUTED-COST
           END-IF.
           ADD S-ITEM-DIST-COST TO TOTAL-ITEM-DIST-COST.
           MOVE ZEROS TO TOTAL-QTY-DIST, TOTAL-COST-DIST.
           MOVE CE1-CODE TO AKRON-CE, CE-OUT.

       123-DIST-ACCT-COSTS.
           MOVE S-PRIME TO AKRON-PR, PRIME-OUT.
           MOVE S-SUB TO AKRON-SA, SUB-OUT.
           MOVE S-SUBD TO SUBD-OUT.
           MOVE S-SUBD-1-3 TO AKRON-SD.
           MOVE S-SUBD-4 TO AKRON-SD-4.
           MOVE S-ADDL-DATA TO AKRON-AD, ADDL-DATA-OUT.
           MOVE S-ITEM-PCT TO ACCT-PCT.
           MULTIPLY ACCT-PCT BY 100
             GIVING ACCT-PCT-OUT ROUNDED.
           MULTIPLY S-QUANTITY BY ACCT-PCT
             GIVING STORES-QTY ROUNDED.
           ADD STORES-QTY TO TOTAL-QTY-DIST.
           MULTIPLY S-ITEM-DIST-COST BY ACCT-PCT
             GIVING AKRON-CE-AMOUNT ROUNDED.
           ADD AKRON-CE-AMOUNT TO TOTAL-COST-DIST.

           PERFORM 230-RETURN-RCD.
           IF EOF-SW = "Y" OR
              SAVE-ITEM-NO NOT EQUAL S-ITEM

             PERFORM 240-CHECK-FOR-PROPER-ITEM-DIST

           END-IF.

       124-WRITE-STORES-ID5-RCD.
           IF INV-NO-CHECK-INDIC NOT = SPACES
             MOVE "X" TO AKRON-IT-INDIC
           ELSE
             MOVE SPACES TO AKRON-IT-INDIC
           END-IF.
           MOVE INV-NO TO INVOICE-BREAK-DOWN.
           IF IBD-1-5 = "DUTY-"
             MOVE "D" TO AKRON-D-F-INDIC
           ELSE

             IF IBD-1-5 = "FRHT-"
               MOVE "F" TO AKRON-D-F-INDIC
             ELSE
               MOVE SPACES TO AKRON-D-F-INDIC
             END-IF

           END-IF.

           MOVE STORES-QTY TO QTY-OUT.
           IF AT-LEAST-ONE-ACCT-ENTRY = "Y"
             MOVE SPACES TO ITEM-OUT-X, CE-OUT, CORP-CODE-OUT, UM-OUT
           END-IF.
           MOVE AKRON-CE-AMOUNT TO ITEM-VALUE-OUT.
           MOVE ITEM-DETAIL-LINE TO MANIFEST-REPORT-LINE.
           MOVE 1 TO MAN-CTL.
           PERFORM 20-WRITE-MANIFEST-REPORT-LINE.

           WRITE MAN-AKRON-RECORD FROM AKRON-CE-RCD.
           ADD 1 TO MAN-RCD-COUNTER.

           IF EOF-SW = "Y"
             GO TO 120-DCWR-X
           ELSE

             IF SAVE-ITEM-NO = S-ITEM
               MOVE "Y" TO AT-LEAST-ONE-ACCT-ENTRY
               GO TO 123-DIST-ACCT-COSTS
             ELSE
               GO TO 122-NEW-ITEM-LOOP
             END-IF

           END-IF.

      *
      * SECTION EXITED WHEN PERFORMED-ROUTINES SECTION ENCOUNTERED
      *
       120-DCWR-X.
           EXIT.

       PERFORMED-ROUTINES SECTION.

       130-UPDATE-MPLTINFO.
           MOVE DSET-MPLTINFO TO DSET-NAME.
           PERFORM 9999-DSET-LOCK.
           MOVE "PMAN" TO PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-O.
           IF NO-ENTRY
             MOVE "GETKEY MPLTINFO 130-UM PMAN" TO BU-DISPLAY-MSG
             MOVE PLT-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP
           END-IF.
           MOVE MANIFEST-HEADER-TOTAL TO MPLTINFO-MAN-TOTAL.
           MOVE MAN-RCD-COUNTER TO MPLTINFO-RECORD-CTR.
           MOVE MAN-INVOICE-COUNTER TO MPLTINFO-INVOICE-CTR.
           MOVE "1" TO MPLTINFO-SEND-STATUS.
           MOVE SPACES TO MPLTINFO-MODIFY-SW.
           PERFORM 9999-UPDATE-MPLTINFO-PK-O.
           PERFORM 9999-UNLOCK.

       140-GET-DINVRCD.

      *
      * IF THE INVOICE DOES NOT EXIST AT THIS POINT WE
      * WILL SKIP OVER IT BECAUSE THE USER DELETED THE
      * INVOICE BETWEEN THE START AND END OF A MANIFEST
      * IF THE USER PLACED THE INVOICE ON HOLD WE WILL ALSO
      * NOT PROCESS IT AT THIS TIME.
      *
           PERFORM 9999-CHAINHD-DINVRCD-RG-I.
           PERFORM 9999-GETNEXT-DINVRCD-RG-I.
           IF END-OF-CHAIN OR
              INV-STATUS = "H " OR "I "

             MOVE "Y" TO SKIP-INVOICE-SW

           ELSE

             MOVE "N" TO SKIP-INVOICE-SW

           END-IF.

       150-GET-PO-HEADER.
           MOVE INV-PO-RCV-NO TO PO-ARG.
           PERFORM 9999-CHAINHD-DPORECD-PO-I.
           PERFORM 9999-GETNEXT-DPORECD-PO-I.
           IF END-OF-CHAIN

             MOVE "GETNEXT DPORECD 150-GPH" TO BU-DISPLAY-MSG
             MOVE PO-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP

           END-IF.

       160-GET-VENDOR.
           MOVE INV-VEN-CODE TO VEN-ARG.
           PERFORM 9999-CHAINHD-DVENDOR-VN-I.
           PERFORM 9999-GETNEXT-DVENDOR-VN-I.
           IF END-OF-CHAIN

             MOVE VEN-NOT-ON-FILE TO M-VEN-NAME
             MOVE MANIFEST-DETAIL-LINE4 TO MANIFEST-REPORT-LINE
             MOVE 1 TO MAN-CTL
             PERFORM 20-WRITE-MANIFEST-REPORT-LINE

           ELSE

             PERFORM VARYING SUB FROM 1 BY 1
                     UNTIL VEN-ITM-NO > 7  OR
                           SUB > 4         OR
                           END-OF-CHAIN

               MOVE VEN-ITM-DATA TO M-VEN-NAME
               MOVE MANIFEST-DETAIL-LINE4 TO MANIFEST-REPORT-LINE
               MOVE 1 TO MAN-CTL
               PERFORM 20-WRITE-MANIFEST-REPORT-LINE
               PERFORM 9999-GETNEXT-DVENDOR-VN-I

             END-PERFORM

           END-IF.

       170-CONVERT-QTY-TO-STR.
           MOVE INVITM-CORPCODE TO CODE-ARG.
           PERFORM 9999-GETKEY-MSTORERM-CD-I.
           IF NO-ENTRY

             MOVE "GETKEY MSTORERM 170-CQTS" TO BU-DISPLAY-MSG
             MOVE CODE-ARG TO BU-DISPLAY-FLD(1)
             PERFORM 2100-BLOWUP

           END-IF.
9406CK     EVALUATE DIST-UM (ITEM-IX)
             WHEN STR-UM1

9406CK         MULTIPLY DIST-QUANTITY (ITEM-IX) BY STR-UM1-CF
9406CK             GIVING DIST-QUANTITY (ITEM-IX) ROUNDED

             WHEN STR-UM2

9406CK         MULTIPLY DIST-QUANTITY (ITEM-IX) BY STR-UM2-CF
9406CK             GIVING DIST-QUANTITY (ITEM-IX) ROUNDED

           END-EVALUATE.
9406CK     MOVE STR-UM TO DIST-UM (ITEM-IX).

       180-GET-DINVACCT-DATA.
           IF END-OF-CHAIN OR
              INVACCT-ITEM > S-ITEM
             GO TO 181-CHECK-FOR-ACCT-ENTRY
           ELSE
             IF INVACCT-ITEM < S-ITEM

               MOVE "GET INVACCT LOGIC FAILED 180-GDD"
                 TO BU-DISPLAY-MSG
               MOVE REGISTER-ARG  TO  BU-DISPLAY-FLD (1)
               PERFORM 2100-BLOWUP

             END-IF
           END-IF.

      *
      * MANIPULATION OF ACCOUNTING DATA IS DONE FOR VALLEYFIELD ONLY.
      * 2/08/90 - THEY ARE NOT RUNNING CSAS AND THERE ACCOUNTING SYSTEM
      * MUST HAVE THE ACCOUNTING DATA IN ANOTHER FORMAT.
      *
           IF COMPANY-SAVE = "629"

             IF INVACCT-SUBD = SAVE-STOREROOM-DEPT

               IF INVACCT-SUB = "999"

                 MOVE INVACCT-PRIME TO S-PRIME
                 MOVE INVACCT-SUB TO S-SUB
                 MOVE INVACCT-SUBD TO S-SUBD
                 MOVE INVITM-CORPCODE TO CODE-ARG
                 PERFORM 9999-GETKEY-MSTORERM-CD-I
                 IF NOT GOOD-CALL
                   MOVE INVACCT-DATA TO S-ACCTG-DATA
                 ELSE
                   MOVE STR-CLASS TO SETUP-AD-2
                   MOVE SETUP-ADDTL-DATA TO S-ADDL-DATA
                 END-IF

               ELSE

                 MOVE INVACCT-PRIME TO S-PRIME
                 MOVE "999" TO S-SUB, S-SUBD
                 MOVE INVACCT-SUB TO SETUP-AD-2
                 MOVE SETUP-ADDTL-DATA TO S-ADDL-DATA

               END-IF

             ELSE

               IF INVACCT-ADDL-DATA = ZEROS

                 MOVE INVACCT-PRIME TO S-PRIME
                 MOVE INVACCT-SUB TO S-SUB
                 MOVE INVACCT-SUBD TO S-SUBD
                 MOVE SPACES TO S-ADDL-DATA

               ELSE

                 MOVE INVACCT-DATA TO S-ACCTG-DATA

               END-IF

             END-IF

           ELSE

             MOVE INVACCT-DATA TO S-ACCTG-DATA

           END-IF.

           DIVIDE INVACCT-PCT BY 100 GIVING ACCT-PCT ROUNDED.
           MOVE ACCT-PCT TO S-ITEM-PCT.
           RELEASE SORT-ITEMS-RECORD FROM SORT-ITEMS-RCD.
           MOVE "Y" TO AT-LEAST-ONE-ACCT-ENTRY.

           PERFORM 9999-GETNEXT-DINVACCT-RG-I.
           GO TO 180-GET-DINVACCT-DATA.

       181-CHECK-FOR-ACCT-ENTRY.

      *
      * IF NO RECORD WAS RELEASED TO THE SORT FOR THIS ITEM
      * BECAUSE IT CONTAINED NO ACCOUNTING ENTRIES THEN RELEASE
      * A RECORD WITHOUT ANY ACCOUNTING DATA
      *
           IF AT-LEAST-ONE-ACCT-ENTRY NOT EQUAL "Y"

             MOVE SPACES TO S-ACCTG-DATA
             MOVE ZERO TO S-ITEM-PCT
             RELEASE SORT-ITEMS-RECORD FROM SORT-ITEMS-RCD

           END-IF.

       180-GDD-X.
           EXIT.

       190-CHECK-FOR-PROPER-COST-DIST.
           SUBTRACT TOTAL-COST-DIST FROM SAVE-TOTAL-MATL-COST
             GIVING DIST-COST-DIFF.
9406CK     ADD DIST-COST-DIFF TO DIST-ITEM-VALUE (ITEM-IX).
  .        ADD DIST-ITEM-TAX (ITEM-IX) TO DIST-ITEM-VALUE (ITEM-IX)
9406CK       GIVING DIST-ITEM-TOT-VALUE (ITEM-IX).
           SUBTRACT TOTAL-TAX-DIST FROM SAVE-TOTAL-TAX
             GIVING DIST-TAX-DIFF.
           IF DIST-TAX-DIFF NOT = ZEROS
9406CK       INITIALIZE ITEM-IX
             PERFORM 200-DIST-REMAINING-TAX THRU 200-DRT-X
           END-IF.

       200-DIST-REMAINING-TAX.
           MOVE TOTAL-TAX-DIST TO SAVE-TOTAL-ITEM-TAX-DIST.
           MOVE SPACES TO SAVE-LAST-ITEM-NO.

       201-READ-DIST-ITEM-RCD.
9406CK     ADD 1 TO ITEM-IX.
  .          IF ITEM-IX > 1000  OR  DIST-ITEM-NO (ITEM-IX) = SPACES
  .             GO TO 202-CHECK-PROPER-TAX-DIST.
  .
  .        MOVE DIST-ITEM-NO (ITEM-IX) TO SAVE-LAST-ITEM-NO.
  .        IF DIST-ITEM-TAX-PCNT (ITEM-IX) = ZEROS
  .          GO TO 201-READ-DIST-ITEM-RCD.
  .        COMPUTE ADDL-ITEM-TAX ROUNDED =
  .          ( DIST-ITEM-TAX (ITEM-IX) / SAVE-TOTAL-ITEM-TAX-DIST ) *
  .          DIST-TAX-DIFF.
  .        ADD ADDL-ITEM-TAX TO DIST-ITEM-TOT-VALUE (ITEM-IX),
9406CK                          DIST-ITEM-TAX (ITEM-IX), TOTAL-TAX-DIST.

           GO TO 201-READ-DIST-ITEM-RCD.

       202-CHECK-PROPER-TAX-DIST.
           IF TOTAL-TAX-DIST NOT =  SAVE-TOTAL-TAX

             SUBTRACT TOTAL-TAX-DIST FROM SAVE-TOTAL-TAX
               GIVING DIST-TAX-DIFF
             PERFORM 210-BALANCE-TAX-DIST THRU 210-BTD-X

           END-IF.

       200-DRT-X.
           EXIT.

       210-BALANCE-TAX-DIST.
9406CK     INITIALIZE ITEM-IX.

       211-READ-DIST-FILE-AGAIN.

9406CK     ADD 1 TO ITEM-IX.
  .        IF ITEM-IX > 1000  OR  DIST-ITEM-NO (ITEM-IX) = SPACES
  .           GO TO 212-CLOSE-FILE.
  .
  .        IF DIST-ITEM-NO (ITEM-IX) = SAVE-LAST-ITEM-NO  OR
  .           DIST-ITEM-TAX-PCNT (ITEM-IX) NOT = ZEROS
  .
  .          ADD DIST-TAX-DIFF TO DIST-ITEM-TAX (ITEM-IX),
9406CK                            DIST-ITEM-TOT-VALUE (ITEM-IX)

             GO TO 212-CLOSE-FILE

           END-IF.
           GO TO 211-READ-DIST-FILE-AGAIN.

       212-CLOSE-FILE.

       210-BTD-X.
           EXIT.

       220-BUILD-ITEM-RECORD.

9406CK     ADD 1 TO ITEM-IX.
  .        IF ITEM-IX > 1000
  .           MOVE "DIST-TABLE HAS MORE THAN 1000 ITEMS"
  .                TO BU-DISPLAY-MSG
  .           MOVE "ITEM ="       TO BU-DISPLAY-FLD (1)
  .           MOVE INVITM-ITEM-NO TO BU-DISPLAY-FLD (2)
  .           GO TO 2100-BLOWUP.
  .
  .        MOVE INVITM-ITEM-NO TO DIST-ITEM-NO (ITEM-IX).
  .        MOVE INVITM-CORPCODE TO DIST-CORP-CODE (ITEM-IX).
  .        MOVE INVITM-PO-UM TO DIST-UM (ITEM-IX).
9406CK     MOVE INVITM-MEMO-INDIC TO DIST-MEMO-INDIC (ITEM-IX).
           EVALUATE INV-PAYMENT-IND
             WHEN "P"
9406CK         MOVE INVITM-PO-QTY-PD TO DIST-QUANTITY (ITEM-IX)
               IF INVITM-PO-QTY-PD = ZEROS
                 MOVE INVITM-PO-UPRICE TO ITEM-PRICE-EXT
               ELSE
                 MULTIPLY INVITM-PO-QTY-PD BY INVITM-PO-UPRICE
                   GIVING ITEM-PRICE-EXT ROUNDED
               END-IF
             WHEN "I"
9406CK         MOVE INVITM-INV-QTY-PD TO DIST-QUANTITY (ITEM-IX)
               IF INVITM-INV-QTY-PD = ZEROS
                 MOVE INVITM-INV-UPRICE TO ITEM-PRICE-EXT
               ELSE
                 MULTIPLY INVITM-INV-QTY-PD BY INVITM-INV-UPRICE
                   GIVING ITEM-PRICE-EXT ROUNDED
               END-IF
             WHEN OTHER

      *
      * THIS SHOULD NEVER HAPPEN -- BUT IT MAY DURING TESTING
      *
9406CK         MOVE 0 TO DIST-QUANTITY (ITEM-IX), ITEM-PRICE-EXT
           END-EVALUATE.
           IF INVITM-CORPCODE NOT EQUAL "NON-STR"
             PERFORM 170-CONVERT-QTY-TO-STR
           END-IF.
9406CK     COMPUTE DIST-ITEM-VALUE (ITEM-IX) ROUNDED =
             SAVE-TOTAL-MATL-COST *
             ( ITEM-PRICE-EXT / INV-TOTAL-ITM-EXT ).
9406CK     ADD DIST-ITEM-VALUE (ITEM-IX) TO TOTAL-COST-DIST.
  .        MOVE ZEROS TO DIST-ITEM-TAX (ITEM-IX),
9406CK                   DIST-ITEM-TAX-PCNT(ITEM-IX).

           IF INVITM-TAX-CODE EQUAL TAX-ARG

             SET GOOD-CALL TO TRUE

           ELSE

             MOVE INVITM-TAX-CODE TO TAX-ARG
             PERFORM 9999-GETKEY-MTAX-TX-I

           END-IF.
           IF NO-ENTRY

             MOVE SPACES TO TAX-ARG

           ELSE

             MOVE ZEROS TO TOTAL-MTAX-PERCENT
             PERFORM VARYING SUB FROM 1 BY 1
                     UNTIL SUB > 4

               IF MTAX-PAY-INDIC(SUB) EQUAL "P" AND
                  SUB NOT EQUAL GST-ENTRY
                 ADD MTAX-PERCENT(SUB) TO TOTAL-MTAX-PERCENT
               END-IF

             END-PERFORM
9406CK       COMPUTE DIST-ITEM-TAX-PCNT (ITEM-IX) =
                     MTAX-PERCENT(GST-ENTRY) + TOTAL-MTAX-PERCENT
             COMPUTE GST-TAX ROUNDED = ITEM-PRICE-EXT *
               ( MTAX-PERCENT(GST-ENTRY) / 100.00000000 )
             IF TAX-ON-GST

9406CK         COMPUTE DIST-ITEM-TAX (ITEM-IX) ROUNDED = GST-TAX +
                 (( ITEM-PRICE-EXT + GST-TAX  ) *
                  ( TOTAL-MTAX-PERCENT / 100.00000000 ))

             ELSE

9406CK         COMPUTE DIST-ITEM-TAX (ITEM-IX) ROUNDED = GST-TAX +
                 (( TOTAL-MTAX-PERCENT / 100.00000000 ) *
                    ITEM-PRICE-EXT)

             END-IF
9406CK       ADD DIST-ITEM-TAX (ITEM-IX) TO TOTAL-TAX-DIST
  .          COMPUTE DIST-ITEM-TOT-VALUE (ITEM-IX) =
9406CK               DIST-ITEM-TAX (ITEM-IX) + DIST-ITEM-VALUE (ITEM-IX)

           END-IF.

       230-RETURN-RCD.
           RETURN SORT-ITEMS INTO SORT-ITEMS-RCD
             AT END MOVE "Y" TO EOF-SW.

       240-CHECK-FOR-PROPER-ITEM-DIST.
           SUBTRACT TOTAL-QTY-DIST FROM SAVE-ITEM-QTY
             GIVING DIST-QTY-DIFF.
           ADD DIST-QTY-DIFF TO STORES-QTY.
           SUBTRACT TOTAL-COST-DIST FROM SAVE-ITEM-DIST-COST
            GIVING DIST-COST-DIFF.
           ADD DIST-COST-DIFF TO AKRON-CE-AMOUNT.

      *
      * BLOWUP ROUTINE EXECUTES WHENEVER A
      * FATAL ERROR OCCURS
      *
       2100-BLOWUP.
           MOVE "TMANTOR" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       COPYLIB-MEMBERS SECTION.
       9999-OPENS.
           OPEN I-O MPLTINFO-PK-O.
           OPEN INPUT MVALIDUM-UM-I.
           OPEN INPUT DINVITM-RG-I.
           OPEN INPUT MSTORERM-CD-I.
           OPEN INPUT MTAX-TX-I.
           OPEN INPUT DINVACCT-RG-I.
           OPEN INPUT DINVRCD-IV-I.
           OPEN INPUT DINVRCD-RG-I.
           OPEN INPUT DPORECD-PO-I.
           OPEN INPUT DVENDOR-VN-I.

       9999-CLOSES.
           CLOSE     MPLTINFO-PK-O
                     MVALIDUM-UM-I
                     DINVITM-RG-I
                     MSTORERM-CD-I
                     MTAX-TX-I
                     DINVACCT-RG-I
                     DINVRCD-IV-I
                     DINVRCD-RG-I
                     DPORECD-PO-I
                     DVENDOR-VN-I.

      *
      * DATABASE ACCESS ROUTINES
      *
       9999-DSET-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-UNLOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-GETKEY-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           READ MPLTINFO-PK-O INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-RESET-MPLTINFO-PK-O.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-PK-REC-O.
           START MPLTINFO-PK-O KEY > PLTINFOKEY OF MPLTINFO-PK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-MPLTINFO-PK-O.
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-PK-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-MPLTINFO-PK-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MVALIDUM-UM-I.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-UM-REC-I.
           READ MVALIDUM-UM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MVALIDUM-UM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DINVITM-RG-I.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-RG-REC-I.
           START DINVITM-RG-I KEY = REGISTERNO OF DINVITM-RG-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVITM-RG-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVITM-RG-I.
           MOVE 0 TO COND-WORD.
           READ DINVITM-RG-I NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVITM-RG-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVITM-RG-REC-I NOT = REGISTER-ARG
               MOVE 15 TO COND-WORD.

       9999-GETKEY-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MSTORERM-CD-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETKEY-MTAX-TX-I.
           MOVE 0 TO COND-WORD.
           MOVE TAX-ARG TO TAXCDE OF MTAX-TX-REC-I.
           READ MTAX-TX-I INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MTAX-TX-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DINVACCT-RG-I.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCT-RG-REC-I.
           START DINVACCT-RG-I KEY = REGISTERNO OF DINVACCT-RG-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVACCT-RG-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVACCT-RG-I.
           MOVE 0 TO COND-WORD.
           READ DINVACCT-RG-I NEXT INTO BUF-DINVACCT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVACCT-RG-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVACCT-RG-REC-I NOT = REGISTER-ARG
               MOVE 15 TO COND-WORD.

       9999-CHAINHD-DINVRCD-IV-I.
           MOVE 0 TO COND-WORD.
           MOVE INVOICE-ARG TO INVOICENO OF DINVRCD-IV-REC-I.
           START DINVRCD-IV-I KEY = INVOICENO OF DINVRCD-IV-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVRCD-IV-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVRCD-IV-I.
           MOVE 0 TO COND-WORD.
           READ DINVRCD-IV-I NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVRCD-IV-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF INVOICENO OF DINVRCD-IV-REC-I NOT = INVOICE-ARG
               MOVE 15 TO COND-WORD.

       9999-CHAINHD-DINVRCD-RG-I.
           MOVE 0 TO COND-WORD.
           MOVE REGISTER-ARG TO REGISTERNO OF DINVRCD-RG-REC-I.
           START DINVRCD-RG-I KEY = REGISTERNO OF DINVRCD-RG-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DINVRCD-RG-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DINVRCD-RG-I.
           MOVE 0 TO COND-WORD.
           READ DINVRCD-RG-I NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DINVRCD-RG-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF REGISTERNO OF DINVRCD-RG-REC-I NOT = REGISTER-ARG
               MOVE 15 TO COND-WORD.

       9999-CHAINHD-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-PO-REC-I.
           START DPORECD-PO-I KEY = PORCVNO OF DPORECD-PO-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DPORECD-PO-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DPORECD-PO-I.
           MOVE 0 TO COND-WORD.
           READ DPORECD-PO-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DPORECD-PO-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF PORCVNO OF DPORECD-PO-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.


       9999-CHAINHD-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-VN-REC-I.
           START DVENDOR-VN-I KEY = VENCDE OF DVENDOR-VN-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDOR-VN-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DVENDOR-VN-I.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-VN-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDOR-VN-I"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF VENCDE OF DVENDOR-VN-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.

