000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TMATCHPR.
      *C
      *C  09/11/1996   CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFS-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINTF.
       01  PRINTF                PIC X(132).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFSREC.
       01  WPFSREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
       77  LINE-CTR                      PIC 99 VALUE 60.
001000 77  RECORD-CTR                    PIC 9(5) VALUE 0.
001100 77  SUB1                          PIC 9(4) VALUE 0.
008300 01  ANSWER-SW                     PIC X  VALUE "N".
001200 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       01  DETAIL-LINE-1.
           05  D-WO-1                    PIC X(10) VALUE SPACES.
           05  FILLER                    PIC X(70) VALUE SPACES.
       01  FILE-STATUSES.
           05  WBF-STATUS                PIC XX.
           05  WPF-STATUS                PIC XX.
           05  WPFS-STATUS               PIC XX.
       01  HEADER-0.
           05  FILLER                    PIC X(80)
              VALUE " PARTS DELETED DUE TO NO MATCHES ".
       01  HEADER-1.
           05  FILLER                    PIC X(80) VALUE ALL "_".
       COPY OVRPFDATA IN COPYLIB.
001500 COPY DBSTAT    IN COPYLIB.
001900 01  WO-BASIC-DATA.               COPY DWOBASIC OF COPYLIB.
002000 01  WO-DELETES.
002100     05  WODS OCCURS 5000 TIMES    PIC X(10).
002200 01  WO-PARTS-DATA.               COPY DWOPARTS OF COPYLIB.
002300 01  WO-PLANNED-DATA.             COPY DWOPLAN  OF COPYLIB.
002400 PROCEDURE DIVISION.
002500 START-PGM.
002600     PERFORM 1-HSK.
002700     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
002800 2-EOJ.
           CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
003000     GOBACK.
003100 1-HSK.
003200     MOVE LOW-VALUES TO STATUS-AREA.
003300     MOVE SPACES TO WO-DELETES.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN I-O    WO-PARTS-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
004700 6-MAIN.
           MOVE 0 TO COND-WORD.
           READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
               AT END    MOVE 11 TO COND-WORD.
           IF WPFS-STATUS NOT = "00"
               IF WPFS-STATUS = "9D"
                   ADD 1 TO RECORD-CTR
                   GO TO 6-MAIN
               ELSE
               MOVE 11 TO COND-WORD.
005000     IF COND-WORD = 11
005100         DISPLAY "TOTAL RECORDS READ          = " RECORD-CTR
005200         DISPLAY "TOTAL RECORDS TO BE DELETED = " SUB1
005300         GO TO 61-DELETE-PARTS-WOS.
           IF PRT-WO-NU = "999999M   " GO TO 6-MAIN.
005400     ADD 1 TO RECORD-CTR.
           MOVE 0 TO COND-WORD.
005800     MOVE PRT-WO-NU TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
      *        DISPLAY PRT-WO-NU " HAS A WO-BASIC MATCH"
               GO TO 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE PRT-WO-NU TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
      *        DISPLAY PRT-WO-NU " HAS A WO-PLANNED MATCH"
               GO TO 6-MAIN.
007600
007700*    DISPLAY "NO MATCH FOR PARTS ENTRY = " PRT-WO-NU.
007800
007900     ADD 1 TO SUB1.
008000     IF SUB1 >  5000
               DISPLAY "THERE ARE > 5000 PARTS MISMATCHES"
               GO TO 61-DELETE-PARTS-WOS.
008100     MOVE PRT-WO-NU TO WODS (SUB1).
008200     GO TO 6-MAIN.
008300 61-DELETE-PARTS-WOS.
012700     DISPLAY "LAST CHANCE BEFORE DELETE - CONTINUE (Y/N)?".
012800     ACCEPT ANSWER-SW.
012900     IF ANSWER-SW = "Y"
013000         NEXT SENTENCE
013100     ELSE
013300     GO TO 6-MAIN-EXIT.
008400     MOVE 0 TO SUB1.
008500 61-DPW-LOOP.
008600     ADD 1 TO SUB1.
008700     IF SUB1 > 5000 OR WODS (SUB1) = SPACES
008800         SUBTRACT 1 FROM SUB1
008900         DISPLAY "TOTAL RECORDS DELETED       = " SUB1
009000         GO TO 6-MAIN-EXIT.
           MOVE 0 TO COND-WORD.
009100     MOVE WODS (SUB1) TO WONUM OF WPFSREC.
           READ WO-PARTS-FILE
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFS-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               DISPLAY "COULD NOT READ WO-PARTS ENTRY = " WODS (SUB1)
               GO TO 61-DPW-LOOP.
           DELETE WO-PARTS-FILE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFS-STATUS NOT = "00" MOVE 17 TO COND-WORD.
010400     IF COND-WORD = 0
               ADD 1 TO LINE-CTR
               MOVE WODS (SUB1) TO D-WO-1
               IF LINE-CTR > 59
                   MOVE 0 TO LINE-CTR
                   WRITE PRINTF FROM HEADER-0 AFTER NEW-PAGE
                   WRITE PRINTF FROM HEADER-1 AFTER 1
                   ADD 2 TO LINE-CTR
                   WRITE PRINTF FROM DETAIL-LINE-1 AFTER 1
               ELSE
               WRITE PRINTF FROM DETAIL-LINE-1 AFTER 1.
010500*        DISPLAY "DELETED PARTS REC FOR WO = " WODS (SUB1).
010700     GO TO 61-DPW-LOOP.
010800 6-MAIN-EXIT.    EXIT.

       COPY OVRPFCALL IN COPYLIB.
