000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TMATLCHK.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         JULY 23, 1985.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700*REMARKS.
      *C
      *C   14FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   11SEP1996    DAVE PLUM
      *C     RECOMPILED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.      HP-3000.
002500 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002700
002800 INPUT-OUTPUT SECTION.
002900 FILE-CONTROL.
           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

003600 DATA DIVISION.
003800 FILE SECTION.
003900
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

007800 WORKING-STORAGE SECTION.
008000 77  DTRANS-INV-DOLLARS      PIC S9(12)V99 VALUE ZEROS.
008100 77  DTRANS-INV-UNITS        PIC S9(10)     VALUE ZEROS.
008200 77  SAVE-UNIT-COST          PIC S9(10)V9(4) VALUE ZEROS.
008300 77  SAVE-PAID-UNITS         PIC S9(10)     VALUE ZEROS.
008400 77  SAVE-STR-DEPT           PIC X(6)  VALUE SPACES.
       77  MCXCBLERR-SCOPE         PIC X(1)  VALUE "C".
008700
024800************************************************************
024900**                                                        **
025000**           D A T A B A S E   B U F F E R S              **
025100**                                                        **
025200************************************************************
025300
025400 COPY MATLACUM IN COPYLIB.
025500
025600 COPY DTRANS IN COPYLIB.
025700
025800 COPY MACTINFO IN COPYLIB.
025900
026000**********************************************************
026100*              D A T A    B A S E                        *
026200**********************************************************
026300
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1) VALUE "0".
           05  FILE-STATUS-2    PIC X(1) VALUE "0".

026400 COPY DBCSACCT IN COPYLIB.
026500
026800 COPY DBSTAT IN COPYLIB.
026900
027000 01  DATASET-NAMES.
           05  DSET-NAME        PIC X(16)  VALUE SPACES.
027100     05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
027300     05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".
027400
027500 01  ITEMS-LISTING.
027600     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
027700
027800 01  IMAGE-ARGS.
027900     05  MATL-CODE-ARG     PIC X(8)  VALUE SPACES.
028100     05  MACCT-KEY         PIC X(4)  VALUE SPACES.
028200
       01  BASE  PIC X(10)   VALUE SPACES.

028400*******************************************************
028500*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
028600*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
028700*   READ ERRORS).                                     *
028800*******************************************************
028900
029000 COPY TBLOWUP IN COPYLIB.

009700 01  VIEW-COMAREA.
009800     05  FILLER                 PIC X(118)  VALUE ALL "0".
009900     05  FILLER                 PIC S9(4)   COMP-4 VALUE 9999.
010000 01  KSAM-STATUS                PIC X(2)    VALUE SPACES.
029100
030000 PROCEDURE DIVISION.
030100
030200 001-BEGIN SECTION.
033600
       050-PROCESS-TRANS-PARA.
033800     PERFORM 100-BEGIN.
033900     PERFORM 200-PROCESS-DETAIL
034000         UNTIL END-OF-FILE.
033300     PERFORM 1000-CLOSE-FILES.
033400     GOBACK.
034100
034900 100-BEGIN.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           PERFORM 9999-OPEN-STUFF.
083900     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
014100     IF GOOD-CALL
014200         MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
014300     ELSE
014400         MOVE "GET MACCOUNT-INFO 'SDPT'* 100"
014500               TO BU-DISPLAY-MSG
014600         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (3)
014700         PERFORM 990-BLOWUP.
036000
           PERFORM 9999-INIT-MMATL-ACCUM-MC-I.
036100     PERFORM 400-GET-MMATL-ACCUM.
036200
036400 200-PROCESS-DETAIL.
036500     IF MATL-STORES-CODE = "NON-STR"
036600         NEXT SENTENCE
036700     ELSE
           IF MATL-STORES-CODE-1-4 = "ACCR" OR "INTR" OR "OPNR"
               NEXT SENTENCE
           ELSE
036800         PERFORM 600-CHECK-INVOICE-DOLLARS.
036900     PERFORM 400-GET-MMATL-ACCUM.
037000
037100 400-GET-MMATL-ACCUM.
           PERFORM 9999-DBGET2-MMATL-ACCUM-MC-I.
037900     IF GOOD-CALL
038000         NEXT SENTENCE
038100     ELSE
038200         IF END-OF-FILE
038300             NEXT SENTENCE
038400         ELSE
038500             MOVE "DBGET MMATL-ACCUM * 400-GMA" TO BU-DISPLAY-MSG
038600             PERFORM 990-BLOWUP.
038700
038900 600-CHECK-INVOICE-DOLLARS.
040300     MOVE MATL-STORES-CODE        TO MATL-CODE-ARG,
040400                                     BU-DISPLAY-FLD (1).
           PERFORM 9999-DBFIND-DTRANS-MC-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
               MOVE "START DTRANS *600-CID" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP.

           MOVE ZEROS  TO  DTRANS-INV-DOLLARS,
                           DTRANS-INV-UNITS.
           PERFORM 650-GET-DTRANS
               UNTIL END-OF-CHAIN.
           IF DTRANS-INV-DOLLARS = MATL-INV-DOLLARS AND
              DTRANS-INV-UNITS = MATL-RCPT-UNITS
               NEXT SENTENCE
           ELSE
               DISPLAY "***** MATL-CODE= ", MATL-STORES-CODE
               DISPLAY "MATL-CLASS= ", MATL-CLASS
               DISPLAY "MASTER INV DOLLARS= ", MATL-INV-DOLLARS
               DISPLAY "DETAIL INV DOLLARS= ", DTRANS-INV-DOLLARS
               DISPLAY "MASTER INV UNITS= ", MATL-RCPT-UNITS
               DISPLAY "DETAIL INV UNITS= ", DTRANS-INV-UNITS.

       650-GET-DTRANS.
           PERFORM 9999-DBGET5-DTRANS-MC-I.
           IF COND-WORD NOT = 0
               IF COND-WORD = 15
                   NEXT SENTENCE
               ELSE
                   MOVE "READ DTRANS *650-GD" TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP
           ELSE
               IF TRANS-CODE = "INV" OR "FRT"
                   IF TRANS-DEPT = SAVE-STR-DEPT
                       PERFORM 700-TOTAL-INV-DOLLARS.

       700-TOTAL-INV-DOLLARS.
           IF TRANS-BALANCE-QTY = ZEROS
               COMPUTE DTRANS-INV-DOLLARS ROUNDED =
                   DTRANS-INV-DOLLARS + TRANS-VALUE
               ADD TRANS-QTY TO DTRANS-INV-UNITS
           ELSE
               COMPUTE SAVE-UNIT-COST ROUNDED =
                   TRANS-VALUE / TRANS-QTY
               COMPUTE SAVE-PAID-UNITS = TRANS-QTY -
                   TRANS-BALANCE-QTY
               ADD SAVE-PAID-UNITS TO DTRANS-INV-UNITS
               COMPUTE DTRANS-INV-DOLLARS ROUNDED =
                   DTRANS-INV-DOLLARS +
                       (SAVE-PAID-UNITS * SAVE-UNIT-COST).

050600 699-PROCESS-EXIT.
050700     EXIT.
050800
083000 900-ERROR SECTION.
083100
083200 990-BLOWUP.
083300
083400***************************************************************
083500**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
083600**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
083700**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
083800**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
083900**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
084000**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
084100**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
084200**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
084300**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
084400**   PROBLEM IS AVOIDED.                                     **
084500***************************************************************
084600
084700     MOVE "TMATLCHK"              TO  BU-PGM-NAME.
028000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
028100        VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
028200            BU-DISPLAY-AREA.
085900
086000 1000-CLOSE-FILES.
           PERFORM 9999-CLOSE-STUFF.

       9999-DBGET2-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           READ MMATL-ACCUM-MC-I NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-INIT-MMATL-ACCUM-MC-I.
           MOVE SPACES TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           START MMATL-ACCUM-MC-I KEY >= MATLCODE OF MMATL-ACCUM-MC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-DBFIND-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MATL-CODE-ARG TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY = MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF MATLCODE OF DTRANS-MC-REC-I NOT = MATL-CODE-ARG
               MOVE 15 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MACCOUNT-INFO-IK-I   .

       9999-CLOSE-STUFF.
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      DTRANS-MC-I          .
           CLOSE      MACCOUNT-INFO-IK-I   .

