000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TMATLVAR.
000400 AUTHOR.               G TAYLOR.
000500 DATE-WRITTEN.         JAN 14, 1986.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      DETAIL TRANSACTION DATA SET DTRANS
001000*                      AND PRINT A REPORT OF RAW MATERIAL
001100*                      VARIANCES BY MATERIAL CODE.
      *C
      *C   14FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09SEP1996   DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.      HP-3000.
001600 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
001800
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.
002400
002500 DATA DIVISION.
002600
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
002800
002900 FD  ONLINE-PRT
003000     DATA RECORD IS PRT-REC
003100     RECORD CONTAINS 133 CHARACTERS
003200     LABEL RECORDS ARE OMITTED.
003300
003400 01  PRT-REC                       PIC X(133).
003500
003600 SD  SORT-FILE
003700     DATA RECORD IS SORT-REC
003800     RECORD CONTAINS 79  CHARACTERS.
003900
004000 01  SORT-REC.
004100     05  SORT-CLASS               PIC X(4).
004200     05  SORT-MATL-CODE           PIC X(8).
004300     05  SORT-DOCUMENT-NUM.
004400         10  SORT-MANIFEST-NUM    PIC X(3).
004500         10  SORT-REGISTER-NUM    PIC X(9).
004600     05  SORT-PO-NUM.
004700         10  SORT-ORDER-NUM       PIC X(7).
004800         10  SORT-RELEASE         PIC X(3).
004900     05  SORT-ITEM-NUM            PIC X(4).
005000     05  SORT-QTY                 PIC S9(10).
005100     05  SORT-UNIT-MEASURE        PIC XX.
005200     05  SORT-VALUE               PIC S9(12)V99.
005300     05  SORT-STD-COST            PIC S9(11)V9(4).
005400
005600 WORKING-STORAGE SECTION.
005700
005800 77  NO-MORE-SORT                  PIC XXX    VALUE SPACES.
005900 77  LINE-CNT                      PIC 99     VALUE 0.
006000 77  PAGE-CNT                      PIC 9(4)   VALUE 0.
       77  MCXCBLERR-SCOPE               PIC X(1)   VALUE "C".
006100
006200 COPY TDATECHK IN COPYLIB.
006300
006400 01  REPORT-TOTALS.
006500     05  WS-STD-VALUE             PIC S9(12)V99  VALUE 0.
006600     05  WS-VARIANCE              PIC S9(12)V99  VALUE 0.
006700     05  WS-TOTAL-VARIANCE        PIC S9(14)V99  VALUE 0.
006800
007000************************************************************
007100**     REPORT PRINT LINES                                 **
007200************************************************************
007300
007400 01  HEADER1.
007500     05  FILLER                     PIC X(5)   VALUE SPACES.
007600     05  FILLER                     PIC X(40)
007700         VALUE "TMATLVAR".
007800     05  FILLER                     PIC X(69)
007900         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
008000     05  FILLER                     PIC X(5)   VALUE "DATE ".
008100     05  DATE-H1                    PIC X(8)   VALUE SPACES.
008200
008300 01  HEADER2.
008400     05  FILLER                     PIC X(5)   VALUE SPACES.
008500     05  FILLER                     PIC X(6)   VALUE "PAGE".
008600     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
008700     05  FILLER                     PIC X(35)  VALUE SPACES.
008800     05  FILLER                     PIC X(64)
008900         VALUE "RAW MATERIAL VARIANCES".
009000     05  FILLER                     PIC X(5)   VALUE "TIME ".
009100     05  TIME-H2                    PIC X(8)   VALUE SPACES.
009200
009300 01  HEADER3.
009400     05  FILLER                    PIC X(5)    VALUE SPACES.
009500     05  FILLER                    PIC X(20)
009600         VALUE "MATL CODE        P.O".
009700     05  FILLER                    PIC X(20)
009800         VALUE ".     REL    ITEM   ".
009900     05  FILLER                    PIC X(20)
010000         VALUE " MAN REG NO         ".
010100     05  FILLER                    PIC X(20)
010200         VALUE "UNITS   UM          ".
010300     05  FILLER                    PIC X(20)
010400         VALUE "INV VALUE        STD".
010500     05  FILLER                    PIC X(20)
010600         VALUE " VALUE    MATL VARIA".
010700     05  FILLER                    PIC X(8)
010800         VALUE "NCE    ".
010900
011000 01  DETAIL-LINE.
011100     05  FILLER                     PIC X(5)  VALUE SPACES.
011200     05  PRT-CLASS                  PIC X(4)  VALUE SPACES.
011300     05  PRT-MATL-CODE              PIC X(8)  VALUE SPACES.
011400     05  FILLER                     PIC X(5)  VALUE SPACES.
011500     05  PRT-ORDER-NUM              PIC X(7)  VALUE SPACES.
011600     05  FILLER                     PIC X(2)  VALUE SPACES.
011700     05  PRT-RELEASE                PIC X(3)  VALUE SPACES.
011800     05  FILLER                     PIC X(4)  VALUE SPACES.
011900     05  PRT-ITEM-NUM               PIC X(4)  VALUE SPACES.
012000     05  FILLER                     PIC X(4)  VALUE SPACES.
012100     05  PRT-MANIFEST-NUM           PIC X(3)  VALUE SPACES.
012200     05  PRT-HYPHEN1                PIC X     VALUE SPACES.
012300     05  PRT-REGISTER-NUM           PIC X(9)  VALUE SPACES.
012400     05  FILLER                     PIC X(1)  VALUE SPACES.
012500     05  PRT-QTY                    PIC Z(10)-.
012600     05  FILLER                     PIC X(2)  VALUE SPACES.
012700     05  PRT-UNIT-MEASURE           PIC XX    VALUE SPACES.
012800     05  FILLER                     PIC X(4)  VALUE SPACES.
012900     05  PRT-INV-VALUE              PIC Z(12).ZZ-.
013000     05  FILLER                     PIC X     VALUE SPACES.
013100     05  PRT-STD-VALUE              PIC Z(12).ZZ-.
013200     05  FILLER                     PIC X     VALUE SPACES.
013300     05  PRT-VARIANCE               PIC Z(12).ZZ-.
013400
013500 01  TOTAL-LINE.
013600     05  FILLER                     PIC X(94)  VALUE SPACES.
013700     05  FILLER                     PIC X(17)
013800         VALUE "TOTAL VARIANCE   ".
013900     05  PRT-TOTAL-VARIANCE         PIC Z(14).ZZ-.
014000
014200************************************************************
014300**                                                        **
014400**           D A T A B A S E   B U F F E R S              **
014500**                                                        **
014600************************************************************
014700
014800 COPY DTRANS IN COPYLIB.
014900
015000 COPY MSTORERM IN COPYLIB.
015100
015200**********************************************************
015300*              D A T A    B A S E                        *
015400**********************************************************
015500
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

015600 COPY DBCSACCT IN COPYLIB.
015700
015800 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
015900 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
016000
016100 COPY DBMODES IN COPYLIB.
016200
016300 COPY DBSTAT IN COPYLIB.
016400
016500 01  DATASET-NAMES.
016600     05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
016700     05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
016800
016900 01  ITEMS-LISTING.
017000     05  ALL-ITEMS        PIC X(2)   VALUE "@;".
017100
017200 01  IMAGE-ARGS.
017300     05  MMATL-CODE-ARG    PIC X(8)   VALUE SPACES.
017400     05  CORP-CODE-ARG     PIC X(8)   VALUE SPACES.
017500
017600******************************************
017700**   PARAMETERS FOR CALLING 'CBLOWSRT'
017800******************************************
017900
018000 COPY CBLOWSRT IN COPYLIB.
018100
018200 COPY TBLOWUP IN COPYLIB.
018300
018600 PROCEDURE DIVISION.
018700
018800 001-BEGIN SECTION.
018900
019000 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

019100*******************************************************
019200**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
019300**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
019400**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
019500**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
019600**   OCCURS
019700*******************************************************
019800
019900     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
020000                           ACCTG-BASE,
020100                           BU-PGM-NAME,
020200                           STATUS-AREA,
020300                           DUMMY-VIEW-AREA,
020400                           FILE-STATUS,
020500                           BU-DISPLAY-MSG,
020600                           BU-DISPLAY-FLDS.
020700
020800     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
020900                                     SORT-MATL-CODE
021000         INPUT PROCEDURE IS 050-PROCESS-TRANS
021100         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
021200     PERFORM 1000-CLOSE-FILES.
021300     GOBACK.
021400
021500
021600 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
021700     PERFORM 100-BEGIN.
021800     PERFORM 200-PROCESS-DETAIL
021900         UNTIL END-OF-FILE.
022000
022100**********************************************************
022200*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
022300*  FOR SORTING OF RECORDS.                               *
022400**********************************************************
022500
022600     GO TO 699-PROCESS-EXIT.
022700
022800 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
024700     MOVE SPACES                  TO SORT-REC.
024800     MOVE 0                       TO SORT-QTY
024900                                     SORT-VALUE
025000                                     SORT-STD-COST
           PERFORM 9999-INIT-DTRANS-MC-I.
025100     PERFORM 400-GET-DTRANS.
025200
025300
025400 200-PROCESS-DETAIL.
025500     IF TRANS-DOCUMENT-NUM = "PROC"
025600         NEXT SENTENCE
025700     ELSE
025800     IF TRANS-CODE = "INV" OR "FRT"
025900         IF TRANS-STORES-CODE = "NON-STR"
026000             NEXT SENTENCE
026100         ELSE
026200         IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200)
026300            OR (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
026400             PERFORM 600-BUILD-SORT-REC
026500         ELSE
026600             NEXT SENTENCE
026700     ELSE
026800         NEXT SENTENCE.
026900
027000     PERFORM 400-GET-DTRANS.
027100
027200 400-GET-DTRANS.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
028000     IF GOOD-CALL
028100         NEXT SENTENCE
028200     ELSE
028300         IF END-OF-FILE
028400             NEXT SENTENCE
028500         ELSE
028600             MOVE "DBGET DTRANS * 400-GD" TO BU-DISPLAY-MSG
028700             PERFORM 990-BLOWUP.
028800
028900
029000 600-BUILD-SORT-REC.
029100     MOVE TRANS-STORES-CODE       TO CORP-CODE-ARG.
029200     PERFORM 650-GET-MSTORERM.
029300     MOVE TRANS-DOCUMENT-NUM      TO SORT-DOCUMENT-NUM.
029400     MOVE TRANS-ORDER-NUM         TO SORT-ORDER-NUM.
029500     MOVE TRANS-RELEASE           TO SORT-RELEASE.
029600     MOVE TRANS-ITEM-NUM          TO SORT-ITEM-NUM.
029700     MOVE TRANS-CLASS             TO SORT-CLASS.
029800     MOVE TRANS-STORES-CODE       TO SORT-MATL-CODE.
029900     MOVE TRANS-QTY               TO SORT-QTY.
030000     MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEASURE.
030100     MOVE TRANS-VALUE             TO SORT-VALUE.
030200     MOVE STR-STD-COST            TO SORT-STD-COST.
030300     RELEASE SORT-REC.
030400     MOVE SPACES                  TO SORT-REC.
030500     MOVE 0                       TO SORT-QTY
030600                                     SORT-VALUE
030700                                     SORT-STD-COST
030800                                     WS-STD-VALUE
030900                                     WS-VARIANCE.
031000
031100
031200 650-GET-MSTORERM.
           PERFORM 9999-DBGET7-MSTORERM-CD-I.
032000     IF GOOD-CALL
032100         NEXT SENTENCE
032200     ELSE
032300         IF NO-ENTRY
032400             MOVE ZEROS           TO STR-STD-COST
032500         ELSE
032600             MOVE "DBGET MSTORERM * 650-GMT" TO BU-DISPLAY-MSG
032700             MOVE CORP-CODE-ARG TO BU-DISPLAY-FLD (1)
032800             PERFORM 990-BLOWUP.
032900
033000
033100 699-PROCESS-EXIT.
033200     EXIT.
033300
033400 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
033500     PERFORM 710-BEGIN-REPORT.
033600     PERFORM 720-PROCESS-TRANS
033700        UNTIL NO-MORE-SORT = "YES".
033800     PERFORM 751-PRINT-TOTAL-LINE.
033900
034000**************************************************
034100**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
034200**  TO COMPLETE PROCESSING OF REPORT            **
034300**************************************************
034400
034500     GO TO 799-CREATE-EXIT.
034600
034700 710-BEGIN-REPORT.
034800     OPEN OUTPUT ONLINE-PRT.
034900     RETURN SORT-FILE
035000        AT END
035100            MOVE "YES" TO NO-MORE-SORT.
035200     PERFORM 750-PRINT-HEADINGS.
035300
035400
035500 720-PROCESS-TRANS.
035600     MOVE SORT-MANIFEST-NUM       TO PRT-MANIFEST-NUM.
035700     MOVE "-"                     TO PRT-HYPHEN1.
035800     MOVE SORT-REGISTER-NUM       TO PRT-REGISTER-NUM.
035900     MOVE SORT-ORDER-NUM          TO PRT-ORDER-NUM.
036000     MOVE SORT-RELEASE            TO PRT-RELEASE.
036100     MOVE SORT-ITEM-NUM           TO PRT-ITEM-NUM.
036200     MOVE SORT-CLASS              TO PRT-CLASS.
036300     MOVE SORT-MATL-CODE          TO PRT-MATL-CODE.
036400     MOVE SORT-QTY                TO PRT-QTY.
036500     MOVE SORT-UNIT-MEASURE       TO PRT-UNIT-MEASURE.
036600     MOVE SORT-VALUE              TO PRT-INV-VALUE.
036700     COMPUTE WS-STD-VALUE ROUNDED = SORT-QTY * SORT-STD-COST.
036800     SUBTRACT WS-STD-VALUE FROM SORT-VALUE GIVING WS-VARIANCE.
036900     ADD WS-VARIANCE              TO WS-TOTAL-VARIANCE.
037000     MOVE WS-STD-VALUE            TO PRT-STD-VALUE.
037100     MOVE WS-VARIANCE             TO PRT-VARIANCE.
037200     WRITE PRT-REC FROM DETAIL-LINE AFTER 1.
037300     ADD 1 TO LINE-CNT.
037400     IF LINE-CNT > 55
037500         PERFORM 750-PRINT-HEADINGS.
037600     MOVE SPACES                  TO PRT-REC
037700                                     DETAIL-LINE.
037800     RETURN SORT-FILE
037900        AT END
038000             MOVE "YES" TO NO-MORE-SORT.
038100
038200
038300 750-PRINT-HEADINGS.
038400     MOVE 1                       TO DATE-MODE.
038500     CALL "TDATECHK" USING DATE-CHECK-AREA.
038600     MOVE DATE-SLASH-OUT          TO DATE-H1.
038700     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
038800     ADD 1                        TO PAGE-CNT.
038900     MOVE PAGE-CNT                TO PAGE-H2.
039000     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
039100     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
039200     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 2.
039300     MOVE 3                       TO LINE-CNT.
039400
039500 751-PRINT-TOTAL-LINE.
039600     MOVE WS-TOTAL-VARIANCE       TO PRT-TOTAL-VARIANCE.
039700     WRITE PRT-REC FROM TOTAL-LINE AFTER ADVANCING 2 LINES.
039800
039900
040000 799-CREATE-EXIT.
040100     EXIT.
040200
040300 900-ERROR SECTION.
040400
040500 990-BLOWUP.
040600
040700***************************************************************
040800**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
040900**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
041000**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
041100**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
041200**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
041300**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
041400**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
041500**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
041600**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
041700**   PROBLEM IS AVOIDED.                                     **
041800***************************************************************
041900
042000     MOVE "TMATLVAR"              TO  BU-PGM-NAME.
042100     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
042200                           ACCTG-BASE,
042300                           BU-PGM-NAME,
042400                           STATUS-AREA,
042500                           DUMMY-VIEW-AREA,
042600                           FILE-STATUS,
042700                           BU-DISPLAY-MSG,
042800                           BU-DISPLAY-FLDS.
042900
043200 1000-CLOSE-FILES.
043300     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-ROUTINES SECTION.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE CORP-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MSTORERM-CD-I        .

       9999-CLOSE-STUFF.
           CLOSE      DTRANS-MC-I          .
           CLOSE      MSTORERM-CD-I        .
