000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TMCOPJOB.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.  AS400.
000900 OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
           SELECT JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JF-STATUS.
           SELECT MASTER-JOBPLAN
               ASSIGN TO DATABASE-MCFLMM3501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS MJ-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  JOBPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS JFREC.
       01  JFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.
       FD  MASTER-JOBPLAN
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MJREC.
       01  MJREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3501.
001400 WORKING-STORAGE SECTION.
001500 01  BLOWUP-BASE             PIC X(16).

       01  FILE-STATUSES.
           05  JB-STATUS           PIC XX.
           05  JF-STATUS           PIC XX.
           05  MJ-STATUS           PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

005200 01  JOB-CMP-SEQ             PIC 9999.
005300
005400 01  JOBPLAN-KEY1.
005500     05 JOBP-WO-NO1          PIC X(10).
005600     05 JOBP-SEQ-NO1         PIC 999.
005700     05 FILLER               PIC X.
005800
005900 01  JOBPLAN-KEY2.
006000     05 JOBP-WO-NO2          PIC X(10).
006100     05 JOBP-SEQ-NO2         PIC 999.
006200     05 FILLER               PIC X.
006300
006400 01  JOBPLAN-BUFFER1.        COPY DJOBPLAN OF COPYLIB.
006500
006600 01  JOBPLAN-BUFFER2.        COPY DJOBBANK OF COPYLIB.
006700
001600 01  LINE-NUM                PIC 999.
003200
006800 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
006900
005000 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
005100
003300 01  PASSWORD-INFORMATION.
003400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMCOPJOB".
003500     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
003600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003700     05  PROGRAM-DESCRIPTION.
003800         10  PROG-DESC-A     PIC X(60) VALUE
003900            " COPIES A W/O JOBPLAN TO A GENERIC JOBPLAN  "       .
004000         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
004200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004400     05  PASSWORD-FLAG       PIC X.
004500
004800 01  SAVE-REC-NO             PIC 9(9).
004900
004600 COPY DBSTAT   OF COPYLIB.

       COPY TBLOWUP  OF COPYLIB.

007000 LINKAGE SECTION.
007200 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
007300 COPY VCOMLINK OF COPYLIB.
007400 01  M-JOBPLAN1              PIC X(10).
007500 01  M-JOBPLAN2              PIC X(10).
007600 COPY LANGSUB  OF COPYLIB.
007700
007900 PROCEDURE DIVISION USING    DBPARAMETERS
008000                             VIEW-COMAREA
008100                             M-JOBPLAN1
008200                             M-JOBPLAN2
008300                             LANGUAGE-PARMS.
008400
008500 START-PROGRAM.
008600     PERFORM 1-HSK.
008700     PERFORM 6-MAIN.
008800     PERFORM UPDATE-SEQ-NUM.
008900
009000 2-EOJ.
           CLOSE JOBPLAN-BANK.
           CLOSE JOBPLAN-FILE.
           CLOSE MASTER-JOBPLAN.
009200     GOBACK.
009300
009400 UPDATE-SEQ-NUM.
           MOVE 0 TO COND-WORD.
           MOVE M-JOBPLAN2 TO GJOBPNAME OF MJREC.
           START MASTER-JOBPLAN KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJ-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 2-EOJ.
           READ MASTER-JOBPLAN NEXT INTO MASTER-JOBPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MJ-STATUS NOT = "00" MOVE 15 TO COND-WORD.
009900     IF COND-WORD = 0
010000         MOVE JOBP-SEQ-NO2 TO MJOBPLAN-LASTSEQ
               REWRITE MJREC FROM MASTER-JOBPLAN-DATA
                   INVALID KEY    MOVE 17 TO COND-WORD.
010700
010900 1-HSK.
           OPEN I-O   JOBPLAN-BANK.
           OPEN INPUT JOBPLAN-FILE.
           OPEN I-O   MASTER-JOBPLAN.
011000     CALL "TPWORD" USING PASSWORD-INFORMATION.
011400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
012200     MOVE SPACES             TO JOBPLAN-KEY1 JOBPLAN-KEY2.
012300     MOVE M-JOBPLAN1         TO JOBP-WO-NO1.
012400     MOVE M-JOBPLAN2         TO JOBP-WO-NO2.
012500
012700 6-MAIN.
012900     PERFORM 61-COPY-JOBPLAN THRU 61-CJ-EXIT
013000      VARYING JOB-CMP-SEQ FROM 1 BY 1 UNTIL JOB-CMP-SEQ > 999.
013100
013200 61-COPY-JOBPLAN.
013300     MOVE JOB-CMP-SEQ TO JOBP-SEQ-NO1.
           MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY1 TO JOBPWOSEQ OF JFREC.
           START JOBPLAN-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
013600     IF COND-WORD = 17
013700         GO TO 61-CJ-EXIT
013800     ELSE
013900     IF COND-WORD = 0
014000         MOVE 0 TO LINE-NUM
014200         MOVE JOBP-SEQ-NO1 TO JOBP-SEQ-NO2.
014900
015000 61-CJ-LOOP.
           READ JOBPLAN-FILE NEXT INTO JOBPLAN-BUFFER1
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY1 NOT = JOBPWOSEQ OF JFREC
               MOVE 15 TO COND-WORD.
           IF JF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
015300     IF COND-WORD = 15 GO TO 61-CJ-EXIT.
016300     MOVE JOBPLAN-BUFFER1 TO JOBPLAN-BUFFER2.
016400     MOVE M-JOBPLAN2 TO JOBPLAN-NAME.
016500     MOVE SPACES TO JOBP-LINE OF JOBPLAN-BUFFER2.
016600     ADD 1 TO LINE-NUM.
016700     MOVE LINE-NUM TO JOBP-LINE-NUM.
           MOVE 0 TO COND-WORD.
           WRITE JBREC FROM JOBPLAN-BUFFER2
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
017100     IF COND-WORD NOT = 0
017200         PERFORM 998-BLOWUP.
017500     GO TO 61-CJ-LOOP.
017600
017700 61-CJ-EXIT.    EXIT.
017900
076200 998-BLOWUP.
076300     MOVE "TMCOPJOB" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
