       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TMEQP1.
       AUTHOR.        R L ENSMINGER.
       INSTALLATION.  GTR.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

       SPECIAL-NAMES.   I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQPNUMFILE-PF
                  ASSIGN TO DATABASE-MCFPMM0200
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS RANDOM
                  RELATIVE KEY IS PFKEY
                  FILE STATUS IS EQPNUMP-STATUS.

           SELECT EQPNUMFILE-LF1
                  ASSIGN TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS EQPNUML-STATUS.

           SELECT EQPNUMFILE-LF2
                  ASSIGN TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS EQPNUML-STATUS.

           SELECT TERMINAL-FILE
                  ASSIGN TO WORKSTATION-ZMASTER-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQPNUMFILE-PF
           LABEL RECORDS ARE STANDARD.
       01  EQPNUMRCD-PF.
           COPY DDS-ALL-FORMATS OF MCFPMM0200.

       FD  EQPNUMFILE-LF1
           LABEL RECORDS ARE STANDARD.
       01  EQPNUMRCD-LF1.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  EQPNUMFILE-LF2
           LABEL RECORDS ARE STANDARD.
       01  EQPNUMRCD-LF2.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  TERMINAL-FILE
           LABEL RECORDS ARE OMITTED.
       01  TERMINAL-REC.
           COPY DD-SCREEN6 OF ZMASTER.

       EJECT
       WORKING-STORAGE SECTION.
       01  ADD-SW                             PIC X.
       01  EQPNUMBUFFER1.
           COPY MEQPFILE OF COPYLIB.
       01  EQPNUMBUFFER2.
           COPY MEQPFILE OF COPYLIB.
       01  EQPNUMP-STATUS                     PIC XX.
       01  EQPNUML-STATUS                     PIC XX.
       01  CONTINUE-SW                        PIC X.
       01  DEL-SW                             PIC X.
       01  FALS-VAL                           PIC 1 VALUE B"0".
       01  GOBACK-SW                          PIC X.
       COPY IOFEEDBACK OF COPYLIB.
       01  LAST-EQPNUM                        PIC X(6).
       01  MOD-SW                             PIC X.
       01  MSG1                               PIC X(6).
       01  MSG2                               PIC X(52).
       01  PFKEY                              PIC 9(9).
       01  S1                                 PIC 99 COMP-3.
       01  TRUE-VAL                           PIC 1 VALUE B"1".
       01  WS-SCREEN.
           05 WS-FILLER                       PIC X(158).
           05 EQPNUMS OCCURS 8 TIMES.
              10 WS-EQPNUM                    PIC X(6).
              10 WS-TYPE                      PIC X(8).
              10 WS-DEPT                      PIC X(4).
              10 WS-ZONE                      PIC X(4).
              10 WS-LOCATION                  PIC X(8).
              10 WS-RIME                      PIC X(2).
              10 WS-EXPCLASS                  PIC X(8).
              10 WS-DOWNCOST                  PIC X(6).
              10 WS-LOCAL-NAME                PIC X(24).
           05 WS-ERRMSG                       PIC X(79).

       01  SCREEN-INDICATORS.
           05 IND OCCURS 99 TIMES             PIC 1 INDICATOR 01.

       LINKAGE SECTION.

       COPY CATREAD OF COPYLIB.

       EJECT
       PROCEDURE DIVISION USING CATREAD-PARMS.
       OPEN-PAR.
           OPEN I-O   EQPNUMFILE-LF2.
           OPEN INPUT EQPNUMFILE-LF1.
           OPEN I-O   EQPNUMFILE-PF.
           OPEN I-O   TERMINAL-FILE.

           MOVE SPACES TO TERMINAL-REC.
           MOVE SPACES TO LAST-EQPNUM.
           MOVE "N" TO MOD-SW DEL-SW.

           MOVE "N" TO GOBACK-SW.
           PERFORM SHOW-SCREEN UNTIL GOBACK-SW = "Y".
           PERFORM END-PAR.

       END-PAR.
           CLOSE EQPNUMFILE-LF2.
           CLOSE EQPNUMFILE-LF1.
           CLOSE EQPNUMFILE-PF.
           CLOSE TERMINAL-FILE.
           GOBACK.

       EJECT
       SHOW-SCREEN.
           WRITE TERMINAL-REC FORMAT IS "SCREEN6"
                 INDIC ARE SCREEN-INDICATORS.
           READ TERMINAL-FILE FORMAT IS "SCREEN6"
                 INDIC ARE SCREEN-INDICATORS.

           IF IND (3) = TRUE-VAL
             GO TO END-PAR
           ELSE
             MOVE ALL B"0" TO SCREEN-INDICATORS
             GO TO SHOW-SCREEN.
