       IDENTIFICATION DIVISION.                                         00002000
       PROGRAM-ID.           TMFSTSEQ.                                  00003000
       AUTHOR.               MK MADDEN.                                 00004000
       INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.               00006000
       DATE-WRITTEN.         JAN 31, 1986.                              00005000
                                                                        00007000
      *REMARKS.              THIS PROGRAM WILL SAVE THE MANIFEST FILE   00008000
      *                      SEQUENCE NUMBER AT THE END OF THE          00009000
      *                      MONTH AND MOVE ZEROS TO THE SEQUENCE       00010000
      *                      NUMBER FIELD, SO NO TRANSACTIONS           00011000
      *                      WILL BE PICKED UP UNTIL AFTER CLOSING.     00012000
      *                      THIS PROGRAM WILL BE RUN AFTER THE         00013000
      *                      LAST MANIFEST AND THE PROCESS CODES HAVE   00014000
      *                      BEEN REAVERAGED.                           00015000
      *C
      *C   14FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
       ENVIRONMENT DIVISION.                                            00018000
       CONFIGURATION SECTION.                                           00019000
       SOURCE-COMPUTER.      IBM-AS400.                                 00020000
       OBJECT-COMPUTER.      IBM-AS400.                                 00021000
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MACTINFO-O
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MACTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.
                                                                        00022000
       WORKING-STORAGE SECTION.                                         00027000
       77  MCXCBLERR-SCOPE         PIC X(1)    VALUE "C".

       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X       VALUE SPACES.
           05  FILE-STATUS-2       PIC X       VALUE SPACES.
                                                                        00029000
      ************************************************************      00030000
      **                                                        **      00031000
      **           D A T A B A S E   B U F F E R S              **      00032000
      **                                                        **      00033000
      ************************************************************      00034000
                                                                        00035000
      *********************                                             00036000
      **  MACCOUNT-INFO  **                                             00037000
      *********************                                             00038000
                                                                        00039000
       COPY MACTINFO IN COPYLIB.

       01  MACCT-KEY PIC X(4) VALUE SPACES.                             00041000

      **********************************************************        00042000
      *              D A T A    B A S E                        *        00043000
      **********************************************************        00044000
                                                                        00045000
       COPY DBCSACCT IN COPYLIB.
       COPY DBMODES  IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.

      *******************************************************           00089000
      *   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *           00090000
      *   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *           00091000
      *   READ ERRORS).                                     *           00092000
      *******************************************************           00093000
       COPY TBLOWUP  IN COPYLIB.
                                                                        00107000
       PROCEDURE DIVISION.                                              00108000
                                                                        00109000
       001-BEGIN SECTION.                                               00110000
                                                                        00111000
       010-MAINLINE.                                                    00112000
           PERFORM 100-BEGIN.                                           00113000
           PERFORM 200-UPDATE.                                          00114000
           PERFORM 1000-CLOSE-FILES.                                    00115000
           GOBACK.                                                      00116000
                                                                        00117000
       100-BEGIN.                                                       00120000
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN I-O MACTINFO-O.
                                                                        00133000
       200-UPDATE.                                                      00134000
           MOVE "SEQ" TO MACCT-KEY.                                     00135000
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-O.
           READ MACTINFO-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MACCOUNT-INFO * 100"                         00147000
                     TO BU-DISPLAY-MSG                                  00148000
               PERFORM 990-BLOWUP.                                      00150000
                                                                        00151000
           IF MACCT-MNFST-SEQ = ZERO                                    00152000
               NEXT SENTENCE                                            00153000
           ELSE                                                         00154000
               MOVE MACCT-MNFST-SEQ TO MACCT-MNFST-SAVE                 00155000
               MOVE 0 TO MACCT-MNFST-SEQ.                               00156000
                                                                        00168000
           REWRITE MACTINFO-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBUPDATE MACCT * 530-UPD" TO BU-DISPLAY-MSG        00178000
               PERFORM 990-BLOWUP.                                      00180000
                                                                        00181000
       900-ERROR SECTION.                                               00193000
                                                                        00194000
       990-BLOWUP.                                                      00195000
           MOVE "TMFSTSEQ"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING ACCTG-BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.
                                                                        00219000
       1000-CLOSE-FILES.                                                00221000
           CLOSE MACTINFO-O.
