       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TMISCACT.
       AUTHOR.             C HILLES(HP)/CA YODER(AS/400).
       DATE-WRITTEN.       APRIL 1996.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM MANUALLY ADJUSTS MSTORERM.  IT WAS CONVERTED
      *D*   FROM THE HP VERSION.
      *D*
      *C* CHANGES
      *C*
      *C*  09/04/1996    CA YODER
      *C*    MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZMISCACT-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT MSTORERM-IO
               ASSIGN         TO DATABASE-MCFLCS0201
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS    IS FILE-STATUS.

           SELECT DDESC-I
              ASSIGN          TO DATABASE-MCFLCS1401
              ORGANIZATION    IS INDEXED
              ACCESS MODE     IS DYNAMIC
              RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
                WITH DUPLICATES
              FILE STATUS     IS FILE-STATUS.

           SELECT DDAILYTC-O
              ASSIGN          TO DATABASE-MCFLCS1601
              ORGANIZATION    IS INDEXED
              ACCESS MODE     IS DYNAMIC
              RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
                WITH DUPLICATES
              FILE STATUS     IS FILE-STATUS.

           SELECT REPORT-FILE
               ASSIGN TO PRINTER-MCPRT.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(2000).

       FD  MSTORERM-IO
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-IO.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1401.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

       FD  REPORT-FILE
           DATA RECORD IS REPORT-FILE-REC.
       01  REPORT-FILE-REC      PIC X(80).

       WORKING-STORAGE SECTION.
       77  SUB                              PIC 9     VALUE 0.
       77  LOC-COUNT                        PIC 9     VALUE 0.
       77  SAVE-RSRVD-BEFORE                PIC S9(8) VALUE 0.
       77  TOTAL-QTY                        PIC S9(8) VALUE 0.
       77  CODE-ARG                         PIC X(8)  VALUE SPACES.
       77  ADD-LOC-SW                       PIC X.
       77  SAVE-ONHAND-BEFORE               PIC S9(8) VALUE 0.
       77  PRT-CODE-FLAG                    PIC X     VALUE "N".
       77  RET-CODE                         PIC X(2)  VALUE SPACES.

       01  REC-COUNT                        PIC 9(5) VALUE 0.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       01  DISPLAY-STATUS           PIC X(2)  VALUE "00".

      *----------------------------------------------------------------*
      *                S C R E E N   B U F F E R                       *
      *----------------------------------------------------------------*

       01  DE-BUF.
           05  DE-CODE-IN                   PIC X(7).
           05  DE-PROMPT                    PIC X(45).
           05  DE-CODE-OUT                  PIC X(7).
           05  DE-KWRD-ADJ                  PIC X(46).
           05  DE-UM                        PIC X(2).
           05  DE-DESC                      PIC X(70).
           05  DE-DOCUMENT                  PIC X(10).
           05  DE-VALUE                     PIC 9(11)V9(4).
           05  DE-BOX                       PIC X.
           05  DE-DATA-ENTRY-AREA.
               10  DE-DATA-ENTRY-LINE     OCCURS 6 TIMES.
                   15  DE-LOC               PIC X(12).
                   15  DE-QTY-X.
                       20  DE-QTY           PIC S9(8).
           05  DE-COMMENT                   PIC X(55).
           05  DE-DISB-INSTR                PIC X(30).
           05  DE-MSGLINE                   PIC X(78).

      *----------------------------------------------------------------*
      *                   H O L D   A R E A S                          *
      *----------------------------------------------------------------*

       01  CURRENT-DATE-CN.
           05  CUR-CC                  PIC 9(2).
           05  CURRENT-DATE.
               10  CUR-YY              PIC 9(2).
               10  CUR-MM              PIC 9(2).
               10  CUR-DD              PIC 9(2).

       01  CURRENT-TIME.
           05  CUR-HR                  PIC 9(2).
           05  CUR-MIN                 PIC 9(2).
           05  CUR-SEC                 PIC 9(2).

      *----------------------------------------------------------------*
      *                 R E P O R T   L I N E S                        *
      *----------------------------------------------------------------*

       01  HDR-1.
           05  FILLER                  PIC X(2)  VALUE SPACES.
           05  FILLER                  PIC X(6)  VALUE "DATE: ".
           05  H1-DATE.
               10  H1-MM               PIC X(2).
               10  FILLER              PIC X     VALUE "/".
               10  H1-DD               PIC X(2).
               10  FILLER              PIC X     VALUE "/".
               10  H1-YY               PIC X(2).
           05  FILLER                  PIC X(13) VALUE SPACES.
           05  FILLER                  PIC X(22) VALUE
                  "MISCELLANEOUS ACTIVITY".
           05  FILLER                  PIC X(13) VALUE SPACES.
           05  FILLER                  PIC X(6)  VALUE "TIME: ".
           05  H1-TIME.
               10  H1-HR               PIC X(2).
               10  FILLER              PIC X     VALUE ":".
               10  H1-MIN              PIC X(2).
               10  FILLER              PIC X     VALUE ":".
               10  H1-SEC              PIC X(2).
           05  FILLER                  PIC X(2)  VALUE SPACES.

       01  LINE-2.
           05  FILLER                  PIC X(29) VALUE SPACES.
           05  FILLER                  PIC X(22) VALUE ALL "-".
           05  FILLER                  PIC X(29) VALUE SPACES.

       01  LINE-3.
           05  FILLER                  PIC X(7)  VALUE SPACES.
           05  FILLER                  PIC X(10) VALUE "DOCUMENT: ".
           05  L3-DOCUMENT             PIC X(10).
           05  FILLER                  PIC X(15) VALUE SPACES.
           05  FILLER                  PIC X(13) VALUE "TOTAL VALUE: ".
           05  L3-VALUE                PIC Z(10)9.9999.
           05  FILLER                  PIC X(9)  VALUE SPACES.

       01  LINE-4.
           05  FILLER                  PIC X(16) VALUE SPACES.
           05  FILLER                  PIC X(9)  VALUE "CORP CODE".
           05  FILLER                  PIC X(9)  VALUE SPACES.
           05  FILLER                  PIC X(8)  VALUE "QUANTITY".
           05  FILLER                  PIC X(4)  VALUE "  UM".
           05  FILLER                  PIC X(5)  VALUE SPACES.
           05  FILLER                  PIC X(8)  VALUE "LOCATION".
           05  FILLER                  PIC X(21) VALUE SPACES.

       01  LINE-5.
           05  FILLER                  PIC X(16) VALUE SPACES.
           05  FILLER                  PIC X(9)  VALUE "---------".
           05  FILLER                  PIC X(9)  VALUE SPACES.
           05  FILLER                  PIC X(8)  VALUE "--------".
           05  FILLER                  PIC X(4)  VALUE "  --".
           05  FILLER                  PIC X(5)  VALUE SPACES.
           05  FILLER                  PIC X(8)  VALUE "--------".
           05  FILLER                  PIC X(21) VALUE SPACES.

       01  DETAIL-LINE.
           05  FILLER                  PIC X(17) VALUE SPACES.
           05  DET-CORP-CODE           PIC X(7).
           05  FILLER                  PIC X(9)  VALUE SPACES.
           05  DET-QTY                 PIC --------9.
           05  FILLER                  PIC X(2)  VALUE SPACES.
           05  DET-UM                  PIC X(2).
           05  FILLER                  PIC X(5)  VALUE SPACES.
           05  DET-LOC                 PIC X(12).
           05  FILLER                  PIC X(17) VALUE SPACES.

       01  TOTAL-LINE.
           05  FILLER                  PIC X(27) VALUE SPACES.
           05  FILLER                  PIC X(6)  VALUE "TOTAL ".
           05  TOT-QTY                 PIC --------9.
           05  FILLER                  PIC X(38) VALUE SPACES.

       01  COMMENT-LINE.
           05  FILLER                  PIC X(7)  VALUE SPACES.
           05  FILLER                  PIC X(9)  VALUE "COMMENT: ".
           05  COM-COMMENT             PIC X(55).
           05  FILLER                  PIC X(9)  VALUE SPACES.

      *----------------------------------------------------------------*
      *          D A T A B A S E   S T A T U S   A R E A               *
      *----------------------------------------------------------------*

       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X.
           05  FILE-STATUS-2           PIC X.

       COPY DATAB        IN COPYLIB.

       COPY VCOMAREA     IN COPYLIB.

      *----------------------------------------------------------------*
      *             D A T A B A S E   B U F F E R S                    *
      *----------------------------------------------------------------*

       COPY MSTORERM     IN COPYLIB.

       COPY DDESC        IN COPYLIB.

       COPY DDAILYTC     IN COPYLIB.

       COPY TC325        IN COPYLIB.

       COPY TC425        IN COPYLIB.

       COPY TBLOWUP      IN COPYLIB.

      *---- PARMS FOR CALL TO "TREQFILU"
       01  REQFILE-NUM                 PIC S9(4) COMP VALUE 0.

      *----------------------------------------------------------------*
      *             P R O C E D U R E   D I V I S I O N                *
      *----------------------------------------------------------------*

       PROCEDURE DIVISION.
       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THROUGH 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O     MSTORERM-IO
                        DISPLAY-FILE
                INPUT   DDESC-I
                OUTPUT  DDAILYTC-O
                        REPORT-FILE.

       2-EOJ.
           CLOSE      MSTORERM-IO
                      DISPLAY-FILE
                      DDESC-I
                      DDAILYTC-O
                      REPORT-FILE.

       6-MAIN.
           INITIALIZE DISPLAY-REC
                      DE-BUF.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE "TYPE STORES CODE THEN PRESS 'ENTER'"
                                       TO  DE-PROMPT.
      *-------- ALLOW FOR CORPORATE CODE ENTRY.
           MOVE ON-SWITCH TO IND(20).

       61-SHOWFORM-1.
           MOVE DE-BUF                 TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS "MISCSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               DISPLAY "PROBLEM WITH SCREEN WRITE   DISPLAY STATUS = "
                                     DISPLAY-STATUS
               GO TO 6-MAIN-X.
           READ DISPLAY-FILE
               FORMAT IS "MISCSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               DISPLAY "PROBLEM WITH SCREEN READ   DISPLAY STATUS = "
                                     DISPLAY-STATUS
               GO TO 6-MAIN-X.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC            TO DE-BUF.

           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           IF DE-CODE-IN = SPACES
               MOVE "ENTER STORES CODE OR PRESS F3 TO EXIT"
                                       TO  DE-MSGLINE
               MOVE ON-SWITCH          TO  IND(60)  IND(20)
               GO TO 61-SHOWFORM-1.

           MOVE DE-CODE-IN             TO  CODE-ARG.
           MOVE CODE-ARG               TO  CORPCDE OF MSTORERM-REC-IO.
           READ MSTORERM-IO INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "STORES CODE DOES NOT EXIST"
                                       TO  DE-MSGLINE
               MOVE ON-SWITCH          TO  IND(60)  IND(20)  IND(30)
               GO TO 61-SHOWFORM-1.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-REC-IO.
           START MSTORERM-IO KEY > CORPCDE OF MSTORERM-REC-IO
               INVALID KEY MOVE "00" TO FILE-STATUS.

           IF STR-STATE = "F"
               MOVE "CODE FROZEN FOR INVENTORY--NO PROCESSING ALLOWED"
                                       TO  DE-MSGLINE
               MOVE ON-SWITCH          TO  IND(60)  IND(20)  IND(30)
               GO TO 61-SHOWFORM-1.

      *-------- GET CORP CODE DESCRIPTION.
           MOVE CODE-ARG               TO  CORPCDE OF DDESC-REC-I.
           MOVE "00"                   TO  DESCIDNUM OF DDESC-REC-I.
           READ DDESC-I INTO BUF-DDESC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE DESC-DATA          TO  DE-KWRD-ADJ
               MOVE SPACES             TO  BUF-DDESC
               MOVE "99"               TO  DESCIDNUM OF DDESC-REC-I
               READ DDESC-I INTO BUF-DDESC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE DESC-DATA      TO  DE-DESC
               ELSE
                   MOVE SPACES         TO  DE-DESC
               END-IF
           ELSE
               MOVE "*NO DESCRIPTION ON FILE*"
                                       TO  DE-KWRD-ADJ.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF DDESC-REC-I.
           START DDESC-I KEY > CORPCDE OF DDESC-REC-I
               INVALID KEY MOVE "00" TO FILE-STATUS.

           MOVE "INPUT TRANSACTION DATA THEN PRESS 'ENTER'"
                                       TO  DE-PROMPT.
           MOVE CODE-ARG               TO  DE-CODE-OUT.
           MOVE STR-UM                 TO  DE-UM.
           MOVE STR-LOC (1)            TO  DE-LOC (1).
           MOVE STR-LOC (2)            TO  DE-LOC (2).
           MOVE STR-LOC (3)            TO  DE-LOC (3).
           MOVE STR-LOC (4)            TO  DE-LOC (4).
           MOVE STR-LOC (5)            TO  DE-LOC (5).
           MOVE STR-LOC (6)            TO  DE-LOC (6).
           MOVE STR-DISB-INSTR         TO  DE-DISB-INSTR.

           MOVE OFF-SWITCH             TO  IND(20).
           MOVE ON-SWITCH              TO  IND(21).
           MOVE DE-BUF                 TO  DISPLAY-REC.

       61-SHOWFORM-2.
           MOVE DE-BUF                 TO  DISPLAY-REC.
           WRITE DISPLAY-REC FORMAT IS "MISCSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               DISPLAY "PROBLEM WITH SCREEN WRITE   DISPLAY STATUS = "
                                     DISPLAY-STATUS
               GO TO 6-MAIN-X.
           READ DISPLAY-FILE
               FORMAT IS "MISCSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               DISPLAY "PROBLEM WITH SCREEN READ   DISPLAY STATUS = "
                                     DISPLAY-STATUS
               GO TO 6-MAIN-X.
           MOVE ALL B"0" TO SRF-INDICATORS.
           MOVE DISPLAY-REC            TO DE-BUF.

           IF F3-KEY-USED
               GO TO 6-MAIN.

       61-BEGIN-VALIDATION.
           ACCEPT CURRENT-DATE FROM DATE.
           ACCEPT CURRENT-TIME FROM TIME.
           IF CUR-YY > 70
               MOVE 19                 TO  CUR-CC
           ELSE
               MOVE 20                 TO  CUR-CC.
           MOVE CODE-ARG               TO  CORPCDE OF MSTORERM-REC-IO.
           READ MSTORERM-IO INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "STORES CODE DOES NOT EXIST*61-BV"
                                       TO  BU-DISPLAY-MSG
               PERFORM 999-BLOWUP.

      *------- MOVE ONHAND BEFORE ANY ACTIVITY TO SAVE AREA FOR
      *------- USE OF THE REQFILE UPDATE SUBPROGRAM.

           MOVE STR-ONHAND             TO  SAVE-ONHAND-BEFORE.
           MOVE 0                      TO  SUB.
           MOVE 0                      TO  TOTAL-QTY.

       65-QTY-LOOP.
           ADD 1                       TO  SUB.
           IF SUB > 6
               GO TO 66-UPDATE-MSTORERM.
           IF DE-QTY (SUB) = 0
               GO TO 65-QTY-LOOP.

           IF STR-LOC (SUB) = SPACES
               MOVE "CANNOT ADD OR SUBTRACT FROM A NONEXISTANT LOCATION"
                                        TO  DE-MSGLINE
               MOVE ON-SWITCH           TO  IND (SUB + 21)
               MOVE ON-SWITCH           TO  IND(60)
               PERFORM 67-UNLOCK-MSTORERM
               GO TO 61-SHOWFORM-2.

           IF DE-BOX = "X"
               IF DE-QTY (SUB) > STR-LOC-ONHAND (SUB)
                   MOVE "BIN QUANTITY TO DECREASE NOT ONHAND"
                                        TO  DE-MSGLINE
                   MOVE ON-SWITCH       TO  IND (SUB + 21)
                   MOVE ON-SWITCH       TO  IND(60)
                   PERFORM 67-UNLOCK-MSTORERM
                   GO TO 61-SHOWFORM-2.

           IF DE-BOX = "X"
      *----------- THE QUANTITY COULD HAVE ALREADY BEEN MULTIPLIED BY
      *----------- -1 IF AN ERROR OCCURRED AFTER THE CURRENT QTY, SO
      *----------- DON'T MULTIPLY AGAIN IF THAT HAPPENED.
               IF DE-QTY (SUB) NOT NEGATIVE
                   MULTIPLY DE-QTY (SUB) BY -1 GIVING DE-QTY (SUB).

           ADD DE-QTY (SUB)             TO  STR-LOC-ONHAND (SUB).
           ADD DE-QTY (SUB)             TO  STR-ONHAND.
           ADD DE-QTY (SUB)             TO  TOTAL-QTY.

           GO TO 65-QTY-LOOP.

       66-UPDATE-MSTORERM.
           IF TOTAL-QTY = 0
               MOVE "QUANTITY IS A REQUIRED FIELD"
                                        TO  DE-MSGLINE
               MOVE ON-SWITCH           TO  IND (60)  IND (22)
               PERFORM 67-UNLOCK-MSTORERM
               GO TO 61-SHOWFORM-2.

      *--------- ACCOUNT FOR CENTURY.
           MOVE CURRENT-DATE-CN         TO  STR-ACT-DATE-CN.
           REWRITE MSTORERM-REC-IO FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE MSTORERM ERROR*66-US"
                                        TO  BU-DISPLAY-MSG
               MOVE FILE-STATUS         TO  BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.

       67-UNLOCK-MSTORERM.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-REC-IO.
           START MSTORERM-IO KEY > CORPCDE OF MSTORERM-REC-IO
               INVALID KEY MOVE "00" TO FILE-STATUS.

      *------- CALL "TREQFILU" TO DECIDE WHETHER ANY REQFILE UPDATE
      *------- IS NEEDED, AND IF SO, TO DO THE UPDATE.
           MOVE STR-RESERVED            TO  SAVE-RSRVD-BEFORE.
           CALL "TREQFILU" USING RET-CODE, BASE, REQFILE-NUM, CODE-ARG,
               SAVE-ONHAND-BEFORE, SAVE-RSRVD-BEFORE, STR-ONHAND,
               STR-RESERVED, STR-REORDER, STR-EXPEDITE.

           IF RET-CODE NOT = "00"
               MOVE "TREQFILU ERROR*67-US"
                                        TO  BU-DISPLAY-MSG
               MOVE RET-CODE            TO  BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.

       68-UPDATE-DDAILYTC.
           MOVE SPACES                  TO  BUF-DDAILYTC.
           MOVE CURRENT-DATE            TO  DDAILYTC-DATE.
           MOVE CURRENT-TIME            TO  DDAILYTC-TIME.
           IF DE-VALUE > 9999999.99
               GO TO 681-TC425.
           MOVE "C"                     TO  TC325-CORRECTION-FLAG.
           MOVE CODE-ARG                TO  TC325-CORPCODE.
           MOVE DE-DOCUMENT             TO  TC325-RS.
           MOVE ZEROS                   TO  TC325-ITEM.
           MOVE TOTAL-QTY               TO  TC325-STORED-QTY.
           MOVE STR-UM                  TO  TC325-UM.
           MOVE STR-CLASS               TO  TC325-CLASS.
           MOVE "325"                   TO  DDAILYTC-TC.
           GO TO 682-PUT-TC.

       681-TC425.
           MOVE SPACES                  TO  BUF-TC425.
           MOVE "C"                     TO  TC425-CORRECTION-FLAG.
           MOVE CODE-ARG                TO  TC425-CORPCODE.
           MOVE DE-DOCUMENT             TO  TC425-RS.
           MOVE ZEROS                   TO  TC425-ITEM.
           MOVE TOTAL-QTY               TO  TC425-STORED-QTY.
           MOVE STR-UM                  TO  TC425-UM.
           MOVE STR-CLASS               TO  TC425-CLASS.
           MOVE "425"                   TO  DDAILYTC-TC.

       682-PUT-TC.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE DDAILYTC ERROR*682-PT"
                                        TO  BU-DISPLAY-MSG
               MOVE FILE-STATUS         TO  BU-DISPLAY-FLD (2)
               PERFORM 999-BLOWUP.

       69-PRINT.
           MOVE CUR-MM                  TO  H1-MM.
           MOVE CUR-DD                  TO  H1-DD.
           MOVE CUR-YY                  TO  H1-YY.
           MOVE CUR-HR                  TO  H1-HR.
           MOVE CUR-MIN                 TO  H1-MIN.
           MOVE CUR-SEC                 TO  H1-SEC.
           MOVE SPACES TO REPORT-FILE-REC.
           WRITE REPORT-FILE-REC AFTER ADVANCING PAGE.
           WRITE REPORT-FILE-REC AFTER ADVANCING 2.
           WRITE REPORT-FILE-REC FROM HDR-1 AFTER ADVANCING 2.
           WRITE REPORT-FILE-REC FROM LINE-2 AFTER ADVANCING 1.
           MOVE DE-DOCUMENT             TO  L3-DOCUMENT.
           MOVE DE-VALUE                TO  L3-VALUE.
           WRITE REPORT-FILE-REC FROM LINE-3 AFTER ADVANCING 2.
           WRITE REPORT-FILE-REC FROM LINE-4 AFTER ADVANCING 2.
           WRITE REPORT-FILE-REC FROM LINE-5 AFTER ADVANCING 1.
           MOVE SPACES TO REPORT-FILE-REC.
           WRITE REPORT-FILE-REC AFTER ADVANCING 1.

           MOVE STR-UM                  TO  DET-UM.
           MOVE 0                       TO  SUB.
           MOVE 0                       TO  LOC-COUNT.
           MOVE "N"                     TO  PRT-CODE-FLAG.

       691-PRINT-LOOP.
           ADD 1                        TO  SUB.
           IF SUB > 6
               GO TO 692-FINISH-PRINT.
           IF DE-QTY (SUB) NOT = 0
               IF PRT-CODE-FLAG = "N"
                   MOVE CODE-ARG        TO  DET-CORP-CODE
                   MOVE "Y"             TO  PRT-CODE-FLAG
               ELSE
                   MOVE SPACES          TO  DET-CORP-CODE.
           IF DE-QTY (SUB) NOT = 0
               MOVE DE-QTY (SUB)        TO  DET-QTY
               MOVE STR-LOC (SUB)       TO  DET-LOC
               ADD 1                    TO  LOC-COUNT
               WRITE REPORT-FILE-REC FROM DETAIL-LINE AFTER ADVANCING 1.

           GO TO 691-PRINT-LOOP.

       692-FINISH-PRINT.
           IF LOC-COUNT > 1
               MOVE TOTAL-QTY            TO  TOT-QTY
               WRITE REPORT-FILE-REC FROM TOTAL-LINE AFTER ADVANCING 2.

           IF DE-COMMENT NOT = SPACES
               MOVE DE-COMMENT           TO  COM-COMMENT
               WRITE REPORT-FILE-REC FROM COMMENT-LINE
                                                AFTER ADVANCING 2.

           GO TO 6-MAIN.

       6-MAIN-X.
           EXIT.

       999-BLOWUP.
           MOVE "TMISCACT"              TO  BU-PGM-NAME.
           MOVE DE-CODE-IN              TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

