000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TMJOBCOP.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.  AS400.
000900 OBJECT-COMPUTER.  AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
           SELECT JOBPLAN-BANK-PF
               ASSIGN TO DATABASE-MCFPMM3600
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS JBPF-STATUS.
           SELECT MASTER-JOBPLAN
               ASSIGN TO DATABASE-MCFLMM3501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MJ-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  JOBPLAN-BANK-PF
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBPFREC.
       01  JBPFREC.
           COPY DDS-ALL-FORMATS OF MCFPMM3600.
       FD  MASTER-JOBPLAN
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MJREC.
       01  MJREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3501.
001400 WORKING-STORAGE SECTION.
       01  BLOWUP-BASE             PIC X(16).

       01  FILE-STATUSES.
           05  JB-STATUS           PIC XX.
           05  JBPF-STATUS         PIC XX.
           05  MJ-STATUS           PIC XX.

       01  HV-KEY                  PIC X(18).

       COPY IOFEEDBACK OF COPYLIB.

004400 01  JOB-CMP-SEQ             PIC 9999.
004500
004600 01  JOBPLAN-KEY1.
004700     05 JOBP-WO-NO1          PIC X(10).
004800     05 JOBP-SEQ-NO1         PIC 999.
004900     05 FILLER               PIC X.
005000
005100 01  JOBPLAN-KEY2.
005200     05 JOBP-WO-NO2          PIC X(10).
005300     05 JOBP-SEQ-NO2         PIC 999.
005400     05 FILLER               PIC X.
005500
005600 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
005700
005800 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
005900
004200 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
004300
002500 01  PASSWORD-INFORMATION.
002600     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMJOBCOP".
002700     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002800     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002900     05  PROGRAM-DESCRIPTION.
003000         10  PROG-DESC-A     PIC X(60) VALUE
003100             " COPIES GENERIC JOBPLANS              "            .
003200         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003400         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003600     05  PASSWORD-FLAG       PIC X.
003700
       01  PFKEY                   PIC 9(9).

       01  PF-STATUS               PIC XX.

004000 01  SAVE-REC-NO             PIC 9(9).
004100
       COPY DBSTAT OF COPYLIB.
003900
       COPY TBLOWUP   OF COPYLIB.

006000 LINKAGE SECTION.
006200 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       01  M-JOBPLAN1              PIC X(10).
       01  M-JOBPLAN2              PIC X(10).
       COPY LANGSUB OF COPYLIB.
006700
006900 PROCEDURE DIVISION USING    DBPARAMETERS
007000                             VIEW-COMAREA
                                   M-JOBPLAN1
                                   M-JOBPLAN2
                                   LANGUAGE-PARMS.
007400
007500 START-PROGRAM.
007600     PERFORM 1-HSK.
007700     PERFORM 6-MAIN.
007900
008000 2-EOJ.
           CLOSE JOBPLAN-BANK.
           CLOSE JOBPLAN-BANK-PF.
           CLOSE MASTER-JOBPLAN.
008200     GOBACK.
008300
009900 1-HSK.
           OPEN I-O   JOBPLAN-BANK.
           OPEN I-O   JOBPLAN-BANK-PF.
           OPEN I-O   MASTER-JOBPLAN.
010000     CALL "TPWORD" USING PASSWORD-INFORMATION.
010400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE HIGH-VALUES        TO HV-KEY.
           START MASTER-JOBPLAN KEY > HV-KEY.
010800     MOVE SPACES             TO JOBPLAN-KEY1.
           MOVE SPACES             TO JOBPLAN-KEY2.
011000
011200 6-MAIN.
011400     PERFORM 61-COPY-JOBPLAN THRU 61-CJ-EXIT
011500         VARYING JOB-CMP-SEQ FROM 1 BY 1
                   UNTIL JOB-CMP-SEQ > 999.
           PERFORM 62-UPDATE-SEQ-NUM.
011600
011700 61-COPY-JOBPLAN.
           MOVE M-JOBPLAN1 TO JOBP-WO-NO1.
011800     MOVE JOB-CMP-SEQ TO JOBP-SEQ-NO1.
           MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY1 TO GJOBPSEQ OF JBREC.
           MOVE "0000" TO GJOBPLINE OF JBREC.
           START JOBPLAN-BANK KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
012100     IF COND-WORD = 17
012200         GO TO 61-CJ-EXIT
012300     ELSE
012400     IF COND-WORD = 0
012500         MOVE JOBPLAN-KEY1 TO JOBPLAN-KEY2
012600         MOVE M-JOBPLAN2   TO JOBP-WO-NO2.
013300
013400 61-CJ-LOOP.
           MOVE 0 TO COND-WORD.
           READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-KEY1 NOT = GJOBPSEQ OF JBREC
               MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
013700     IF COND-WORD = 15
013900         GO TO 61-CJ-EXIT
014000     ELSE
014100     IF COND-WORD = 0
               ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
014200         MOVE IO-REL-NO TO SAVE-REC-NO.
           REWRITE JBREC FROM JOBPLAN-BUFFER.
014700     MOVE M-JOBPLAN2    TO JOBPLAN-NAME.
           MOVE 0 TO COND-WORD.
           WRITE JBREC FROM JOBPLAN-BUFFER
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
015000     IF COND-WORD NOT = 0
015100         PERFORM 998-BLOWUP.
015300     MOVE SAVE-REC-NO TO PFKEY.
           READ JOBPLAN-BANK-PF INTO JOBPLAN-BUFFER
               INVALID KEY   MOVE 15 TO COND-WORD.
           IF JBPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
015600     IF COND-WORD NOT = 0
015700         PERFORM 998-BLOWUP.
016000     GO TO 61-CJ-LOOP.
016100
016200 61-CJ-EXIT.    EXIT.

008400 62-UPDATE-SEQ-NUM.
           MOVE 0 TO COND-WORD.
           MOVE M-JOBPLAN2 TO GJOBPNAME OF MJREC.
           START MASTER-JOBPLAN KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJ-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 2-EOJ.
           READ MASTER-JOBPLAN NEXT INTO MASTER-JOBPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MJ-STATUS NOT = "00" MOVE 15 TO COND-WORD.
008900     IF COND-WORD = 15 GO TO 2-EOJ.
           REWRITE MJREC FROM MASTER-JOBPLAN-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJ-STATUS NOT = "00" MOVE 17 TO COND-WORD.
009700
076200 998-BLOWUP.
076300     MOVE "TMJOBCOP" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
