000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TMJOBDEL.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.   AS400.
000900 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JOBPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JB-STATUS.
           SELECT MASTER-JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM3501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MJF-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  JOBPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD JBREC.
       01  JBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  MASTER-JOBPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MJFREC.
       01  MJFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3501.
001400 WORKING-STORAGE SECTION.
       01  FILE-STATUSES.
           05  JB-STATUS           PIC XX.
           05  MJF-STATUS          PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

003900 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
004000
001600 01  PASSWORD-INFORMATION.
001700     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMJOBDEL".
001800     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
001900     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002000     05  PROGRAM-DESCRIPTION.
002100         10  PROG-DESC-A     PIC X(60) VALUE
002200             " DELETE GENERIC JOBPLANS  "                        .
002300         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002500         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002700     05  PASSWORD-FLAG       PIC X.
002800
002900 COPY DBSTAT OF COPYLIB.
003000
004100 01  JOB-CMP-SEQ             PIC 9999.
004200
004300 01  JOBPLAN-KEY.
004400     05 JOBP-WO-NO           PIC X(10).
004500     05 JOBP-SEQ-NO          PIC 999.
004600     05 FILLER               PIC X.
004700
004800 01  JOBPLAN-BUFFER.         COPY DJOBBANK OF COPYLIB.
004900
005000 01  MASTER-JOBPLAN-DATA.    COPY MMASTJOB OF COPYLIB.
005100
005200 LINKAGE SECTION.
005400 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
005500 COPY VCOMLINK OF COPYLIB.
005600 01  MASTER-JOBPLAN          PIC X(10).
005700 COPY LANGSUB OF COPYLIB.
005800
006000 PROCEDURE DIVISION USING    DBPARAMETERS
006100                             VIEW-COMAREA
006200                             MASTER-JOBPLAN
006300                             LANGUAGE-PARMS.
006400
006500 START-PROGRAM.
006600     PERFORM 1-HSK.
006700     PERFORM 6-MAIN.
006800
006900 2-EOJ.
           CLOSE JOBPLAN-BANK.
           CLOSE MASTER-JOBPLAN-FILE.
007100     GOBACK.
007200
007400 1-HSK.
           OPEN I-O   JOBPLAN-BANK.
           OPEN I-O   MASTER-JOBPLAN-FILE.
007500     CALL "TPWORD" USING PASSWORD-INFORMATION.
007900     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
008300     MOVE SPACES             TO JOBPLAN-KEY.
008400     MOVE MASTER-JOBPLAN     TO JOBP-WO-NO.
008500
008700 6-MAIN.
008800     PERFORM 60-DELETE-JOBPLAN THRU 60-DJ-EXIT.
009100     PERFORM 61-DELETE-MASTER THRU 61-DM-EXIT.
009300
009400 60-DELETE-JOBPLAN.
           MOVE 0 TO JOBP-SEQ-NO.
           MOVE 0 TO COND-WORD.
           MOVE JOBPLAN-KEY TO GJOBPSEQ OF JBREC.
           START JOBPLAN-BANK KEY IS > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
010200     IF COND-WORD = 17 GO TO 60-DJ-EXIT.
011100 60-LOOP-DELETE.
011200     READ JOBPLAN-BANK NEXT INTO JOBPLAN-BUFFER
011300         AT END    MOVE 15 TO COND-WORD.
           IF JOBPLAN-NAME NOT = JOBP-WO-NO MOVE 15 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
011400     IF COND-WORD = 15 GO TO 60-DJ-EXIT.
012200     DELETE JOBPLAN-BANK RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF JB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-DJ-EXIT.
012800     GO TO 60-LOOP-DELETE.
012900
013000 60-DJ-EXIT.    EXIT.
013200
013400 61-DELETE-MASTER.
           MOVE 0 TO COND-WORD.
           MOVE MASTER-JOBPLAN TO GJOBPNAME OF MJFREC.
           START MASTER-JOBPLAN-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               GO TO 61-DM-EXIT
           ELSE
           READ MASTER-JOBPLAN-FILE NEXT INTO MASTER-JOBPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 61-DM-EXIT.
014300     DELETE MASTER-JOBPLAN-FILE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
       61-DM-EXIT.    EXIT.
