000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TMMATPRT.
      *****************************************************************
      *C
      *C  SEPT 06, 1996     CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *****************************************************************
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.   AS400.
000900 OBJECT-COMPUTER.   AS400.
001100 COPY SPECIALN IN COPYLIB.
001400 INPUT-OUTPUT SECTION.
001500 FILE-CONTROL.
001600     SELECT PRNT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT PRTPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS PB-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
001900 DATA DIVISION.
002000 FILE SECTION.
002200 FD  PRNT-FILE
002300     RECORD CONTAINS 80 CHARACTERS
002400     LABEL RECORD IS OMITTED
002500     DATA RECORD IS PRNTF.
002600 01  PRNTF                   PIC X(80).
       FD  PRTPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PBREC.
       01  PBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3801.
002700 FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
002800 WORKING-STORAGE SECTION.
003000 01  ARG-NO                  PIC 9(9).
003700
004000 COPY TDATESUB OF COPYLIB.
004100
003800 01  DBPARAMETERS.           COPY DBPARMS  OF COPYLIB.
003900
       01  FILE-STATUSES.
           05  PB-STATUS           PIC XX.
           05  WLNU-STATUS         PIC XX.

005700 COPY LANGSUB  OF COPYLIB.
005800
005900 01  LAST-WO-USED-DATA.      COPY MLASTWO  OF COPYLIB.
006200
006300 01  LINES-PER-PAGE          PIC 99.
006600
006700 01  MASTER-PARTS-DATA.      COPY DPRTBANK OF COPYLIB.
006800
006900 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
007000
007100 01  OPEN-SW                 PIC X VALUE "N".
007200
       COPY OVRPFDATA IN COPYLIB.

007300 01  PRINT-PAGE.
007400     05 LINE1.
007500        10 PAGE-LIT          PIC X(7) VALUE "PAGE : ".
007600        10 PAGE-VAL          PIC 9(4).
007700        10 FILLER            PIC X(69) VALUE SPACES.
007800
007900     05 LINE2.
008000        10 DATE-LIT          PIC X(7) VALUE "DATE : ".
008100        10 DATE-VAL          PIC X(8).
008200        10 FILLER            PIC X(65) VALUE SPACES.
008300
008400     05 LINE3                PIC X(80) VALUE SPACES.
008500
008600     05 LINE4.
008700        10 FILLER            PIC X(15) VALUE SPACES.
008800        10 TITLE1            PIC X(50) VALUE
008900           "G E N E R I C  W O R K  O R D E R  P A R T P L A N".
009000        10 FILLER            PIC X(15) VALUE SPACES.
009100
009200     05 LINE5.
009300        10 FILLER            PIC X(33) VALUE SPACES.
009400        10 FILLER            PIC X(2)  VALUE "* ".
009500        10 MASTER-PRTPLAN    PIC X(10).
009600        10 FILLER            PIC X(2)  VALUE " *".
009700        10 FILLER            PIC X(33).
009800
009900     05 LINE6                PIC X(80) VALUE SPACES.
010000
010100     05 LINE7                PIC X(80).
010200
010300     05 LINE8                PIC X(80).
010400
010500     05 LINE9                PIC X(80).
010600
010700     05 LINE10               PIC X(80) VALUE SPACES.
010800
010900     05 LINE11.
011000
011100        10 MATPLAN-DATA OCCURS 70 TIMES.
011200
011300           15 P-ITEM         PIC 9(4).
011400           15 FILLER         PIC X(4).
011500           15 P-CODE         PIC X(7).
011600           15 FILLER         PIC X(7).
011700           15 P-STATUS       PIC X.
011800           15 FILLER         PIC X(2).
011900           15 P-UM           PIC X(2).
012000           15 FILLER         PIC X(2).
012100           15 P-ORIG         PIC X(4).
012200           15 FILLER         PIC X(2).
012300           15 P-QUANT        PIC Z(8).
012400           15 FILLER         PIC X(2).
012500           15 P-UNIT-DOL     PIC Z(12).
012600           15 FILLER         PIC X(2).
012700           15 P-TOTAL-DOL    PIC Z(14).
012800
012900 01  S1                      PIC 9(4) COMP-4.
013000
013100 01  S2                      PIC 9(4) COMP-4.
013200
013300 01  S3                      PIC 9(4) COMP-4.
013400
013500 COPY DBSTAT   OF COPYLIB.
       LINKAGE SECTION.
       01  TSUFFR01-DATA.
006500     05  MJPLAN-FIELD        PIC X(10).
           05  MJSEQ-FIELD         PIC 999.
006500     05  MMPLAN-FIELD        PIC X(10).
003600     05  SPOOLER-FIELD       PIC 999.
006100     05  LINESP-FIELD        PIC X.
013800 PROCEDURE DIVISION USING TSUFFR01-DATA.
014000 START-PROGRAM.
014100     PERFORM 1-HSK.
014200     PERFORM 6-MAIN.
014500 2-EOJ.
015500     IF OPEN-SW = "Y" CLOSE PRNT-FILE.
           CLOSE PRTPLAN-BANK.
           CLOSE WO-LAST-NUM-USED.
016600     GOBACK.
016700
016900 1-HSK.
           OPEN INPUT PRTPLAN-BANK.
           OPEN INPUT WO-LAST-NUM-USED.
           MOVE 0 TO COND-WORD.
018800     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG.
019400     MOVE DATE-FLAG-SW TO DATE-CODE DATE-FLAG.
020000     MOVE 0 TO PAGE-VAL.
020200     MOVE 1 TO DATE-MODE.
020300     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
020400     MOVE DATE-SLASH-OUT TO DATE-VAL.
020600     MOVE MMPLAN-FIELD TO MASTER-PRTPLAN.
020800     MOVE SPACES TO LINE7.
020900     STRING "Item"
021000            "  "
021100            "Part_Code"
021200            "  "
021300            "Status"
021400            "  "
021500            "Um"
021600            "  "
021700            "Orig"
021800            "  "
021900            "Quantity"
022000            "     "
022100            "Unit_Cost"
022200            "      "
022300            "Total_Cost"
022400     DELIMITED BY SIZE INTO LINE7.
022500
022600     MOVE "Description Line 1" TO LINE8.
022700
022800     MOVE "Description Line 2" TO LINE9.
022900
023000     IF LINESP-FIELD = "6" MOVE 50 TO LINES-PER-PAGE
023100     ELSE
023200     IF LINESP-FIELD = "8" MOVE 70 TO LINES-PER-PAGE.
023400     MOVE SPOOLER-FIELD TO OVRPRTF-TOFILE-NUM.
023500     PERFORM 996-OVERRIDE-PRINT-FILE.
023700     OPEN OUTPUT PRNT-FILE.
023900     MOVE "Y" TO OPEN-SW.
024000
024200 6-MAIN.
024600     PERFORM 60-FIND-PRTPLAN THRU 60-FP-EXIT.
024700
024900 60-FIND-PRTPLAN.
025000     MOVE SPACES TO LINE11.
025100     MOVE 1 TO S1.
025200     MOVE 0 TO S2.
025300     MOVE MMPLAN-FIELD TO GPRTPNAME OF PBREC.
           START PRTPLAN-BANK KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
025600     IF COND-WORD = 17 GO TO 60-FP-EXIT.
           READ PRTPLAN-BANK NEXT INTO MASTER-PARTS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MMPLAN-FIELD NOT = GPRTPNAME OF PBREC
               MOVE 15 TO COND-WORD.
026200     IF COND-WORD = 0
026300         PERFORM 600-READ-PARTS UNTIL COND-WORD = 15.
       60-FP-EXIT.    EXIT.
027300
027500 600-READ-PARTS.
027600     ADD 1 TO S2.
027700     MOVE S2                  TO P-ITEM (S1).
027800     MOVE PRT-NUM             TO P-CODE (S1).
027900     MOVE PRT-STATUS          TO P-STATUS (S1).
028000     MOVE PRT-UNIT-MEAS       TO P-UM (S1).
028100     MOVE PRT-ORIGINATOR      TO P-ORIG (S1).
028200     MOVE PRT-EST-QTY-9       TO P-QUANT (S1).
028300     MOVE PRT-UNIT-COST-DOLLR TO P-UNIT-DOL (S1).
028400     MOVE PRT-EST-COST-DOLLR  TO P-TOTAL-DOL (S1).
028500     ADD 1 TO S1.
028600     IF S1 > LINES-PER-PAGE
028700       PERFORM 6000-WRITE-PAGE.
028800
028900     MOVE PRT-DESC            TO MATPLAN-DATA (S1).
029000     ADD 1 TO S1.
029100     IF S1 > LINES-PER-PAGE
029200       PERFORM 6000-WRITE-PAGE.
029300
029400     MOVE PRT-DESC-2          TO MATPLAN-DATA (S1).
029500     ADD 1 TO S1.
029600     IF S1 > LINES-PER-PAGE
029700       PERFORM 6000-WRITE-PAGE.
029800
029900     MOVE ALL "-"             TO MATPLAN-DATA (S1).
030000     ADD 1 TO S1.
030100     IF S1 > LINES-PER-PAGE
030200       PERFORM 6000-WRITE-PAGE.
030300
           READ PRTPLAN-BANK NEXT INTO MASTER-PARTS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MMPLAN-FIELD NOT = GPRTPNAME OF PBREC
               MOVE 15 TO COND-WORD.
           IF PB-STATUS NOT = "00" MOVE 15 TO COND-WORD.
030600
030700     IF COND-WORD = 15
030800       PERFORM 6000-WRITE-PAGE.
031500
031700 6000-WRITE-PAGE.
031800     ADD 1 TO PAGE-VAL.
031900     WRITE PRNTF FROM LINE1 AFTER ADVANCING NEW-PAGE.
032100     WRITE PRNTF FROM LINE2.
032200     WRITE PRNTF FROM LINE3.
032300     WRITE PRNTF FROM LINE4.
032400     WRITE PRNTF FROM LINE5.
032500     WRITE PRNTF FROM LINE6.
032600     WRITE PRNTF FROM LINE7.
032700     WRITE PRNTF FROM LINE8.
032800     WRITE PRNTF FROM LINE9.
032900     WRITE PRNTF FROM LINE10.
033100     PERFORM 60000-WRITE-PAGE-CONT VARYING S3 FROM 1 BY 1 UNTIL
033200             S3 > LINES-PER-PAGE.
033400     MOVE SPACES TO LINE11.
033500     MOVE 1 TO S1.
033600
033700 60000-WRITE-PAGE-CONT.
033800     WRITE PRNTF FROM MATPLAN-DATA (S3).

       COPY OVRPFCALL IN COPYLIB.
