       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TMMDELSUB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-NUMBER
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-BASIC
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED-2
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PARTS
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-LABOR
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-SCHEDULE
               ASSIGN TO DATABASE-MCFLMM4404
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT LABOR-CURR-STAT
               ASSIGN TO DATABASE-MCFLMM1602
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT JOBPLAN
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-OPEN-QUEUE
               ASSIGN TO DATABASE-MCFLMM1902
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-SCHEDULE
               ASSIGN TO DATABASE-MCFLMM2302
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-MESSAGE
               ASSIGN TO DATABASE-MCFLMM2403
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT WO-TRACKING
               ASSIGN TO DATABASE-MCFLMM2601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-OPEN-QUEUE
               ASSIGN TO DATABASE-MCFLMM3901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-SIMULATOR
               ASSIGN TO DATABASE-MCFLMM4504
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT PM-AUDIT
               ASSIGN TO DATABASE-MCFLMM4604
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-NUMBER
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.

       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  REC10.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  REC1101.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-PLANNED-2
           LABEL RECORDS ARE STANDARD.
       01  REC1101-2.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-PARTS
           LABEL RECORDS ARE STANDARD.
       01  REC12.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       FD  WO-LABOR
           LABEL RECORDS ARE STANDARD.
       01  REC13.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  PM-SCHEDULE
           LABEL RECORDS ARE STANDARD.
       01  REC44.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  LABOR-CURR-STAT
           LABEL RECORDS ARE STANDARD.
       01  REC16.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  JOBPLAN
           LABEL RECORDS ARE STANDARD.
       01  REC18.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.

       FD  WO-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  REC19.
           COPY DDS-ALL-FORMATS OF MCFLMM1902.

       FD  WO-SCHEDULE
           LABEL RECORDS ARE STANDARD.
       01  REC23.
           COPY DDS-ALL-FORMATS OF MCFLMM2302.

       FD  WO-MESSAGE
           LABEL RECORDS ARE STANDARD.
       01  REC24.
           COPY DDS-ALL-FORMATS OF MCFLMM2403.

       FD  WO-TRACKING
           LABEL RECORDS ARE STANDARD.
       01  REC26.
           COPY DDS-ALL-FORMATS OF MCFLMM2601.

       FD  PM-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  REC39.
           COPY DDS-ALL-FORMATS OF MCFLMM3901.

       FD  PM-SIMULATOR
           LABEL RECORDS ARE STANDARD.
       01  REC45.
           COPY DDS-ALL-FORMATS OF MCFLMM4504.

       FD  PM-AUDIT
           LABEL RECORDS ARE STANDARD.
       01  REC46.
           COPY DDS-ALL-FORMATS OF MCFLMM4604.

       WORKING-STORAGE SECTION.
       COPY CATREAD IN COPYLIB.
       01  CDATE.
           05 YY                            PIC 99.
           05 MM                            PIC 99.
           05 DD                            PIC 99.
       01  CTIME.
           05 HH                            PIC 99.
           05 MN                            PIC 99.
           05 FILLER                        PIC X(4).
       01  ERROR-BUFFER.
           05  ERR-MSG-LIT-1                PIC X(15).
           05  ERR-FILE-STATUS              PIC XX.
           05  ERR-MSG-LIT-2                PIC X(16).
           05  ERR-FILE                     PIC X(16).
           05  ERR-MSG-LIT3                 PIC XX.
           05  ERR-WONO                     PIC X(29).
       01  FILE-STATUS                      PIC XX.
       01  GOBACK-SW                        PIC X.
       01  GDATE.
           05 GYY                           PIC 99.
           05 GMM                           PIC 99.
           05 GDD                           PIC 99.
       01  JDATE.
           05 JYY                           PIC 99.
       01  JOBP-WONUM                       PIC X(10).
       01  MASTER-SW                        PIC X.
       01  TEMP-WONUM.
           05 TEMP-NUMBER                   PIC X(7).
           05 TEMP-SUFFIX                   PIC X(3).
       LINKAGE SECTION.
       01  SCREEN-BUF.
           05  DELETE-WONUM                 PIC X(10).
           05  WO-CMD-LINE                  PIC X(79).
           05  WO-ERR-LINE                  PIC X(79).
       PROCEDURE DIVISION USING SCREEN-BUF.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE    WO-NUMBER
                    WO-BASIC
                    WO-PLANNED
                    WO-PLANNED-2
                    WO-PARTS
                    WO-LABOR
                    PM-SCHEDULE
                    LABOR-CURR-STAT
                    JOBPLAN
                    WO-OPEN-QUEUE
                    WO-SCHEDULE
                    WO-MESSAGE
                    WO-TRACKING
                    PM-OPEN-QUEUE
                    PM-SIMULATOR
                    PM-AUDIT.
           GOBACK.

       1-HSK.
           OPEN INPUT WO-PLANNED-2.
           OPEN I-O WO-NUMBER
                    WO-BASIC
                    WO-PLANNED
                    WO-PARTS
                    WO-LABOR
                    PM-SCHEDULE
                    LABOR-CURR-STAT
                    JOBPLAN
                    WO-OPEN-QUEUE
                    WO-SCHEDULE
                    WO-MESSAGE
                    WO-TRACKING
                    PM-OPEN-QUEUE
                    PM-SIMULATOR
                    PM-AUDIT.
           ACCEPT CDATE FROM DATE.
           ACCEPT CTIME FROM TIME.
           IF WO-CMD-LINE = "TCLNMMIS"
               MOVE SPACES TO WO-ERR-LINE
           ELSE
           MOVE SPACES TO WO-CMD-LINE WO-ERR-LINE.

       6-MAIN.
           MOVE DELETE-WONUM TO WONUM OF REC10.
           START WO-BASIC
               KEY IS = WONUM OF REC10.
           IF FILE-STATUS = "00"
               PERFORM DELETE-VERBAL THRU DELETE-VERBAL-EXIT
           ELSE
           MOVE DELETE-WONUM TO WONUM OF REC1101
           START WO-PLANNED
               KEY IS = WONUM OF REC1101
           IF FILE-STATUS = "00"
               PERFORM DELETE-PLNNED THRU DELETE-PLNNED-EXIT
           ELSE
           IF WO-CMD-LINE = "TCLNMMIS"
               PERFORM DELETE-WO-NUMBER
               PERFORM DELETE-WO-PARTS
               PERFORM DELETE-WO-LABOR
               PERFORM DELETE-LABOR-CURR-STAT
               PERFORM DELETE-PM-SCHEDULE
               PERFORM DELETE-JOBPLAN
               PERFORM DELETE-WO-OPEN-QUEUE
               PERFORM DELETE-WO-SCHEDULE
               PERFORM DELETE-WO-MESSAGE
               PERFORM DELETE-WO-TRACKING
               PERFORM DELETE-PM-OPEN-QUEUE
               PERFORM DELETE-PM-SIMULATOR
               PERFORM DELETE-PM-AUDIT
           ELSE
           MOVE 66360 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE FILE-STATUS TO ERR-FILE-STATUS
           MOVE "NO ENTRY" TO ERR-FILE
           MOVE DELETE-WONUM TO ERR-WONO
           MOVE ERROR-BUFFER TO WO-ERR-LINE.

       6-MAIN-EXIT.    EXIT.

       DELETE-VERBAL.
           READ WO-BASIC NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-VERBAL-EXIT.
           PERFORM DELETE-WO-NUMBER.
           PERFORM DELETE-WO-PARTS.
           PERFORM DELETE-WO-LABOR.
           PERFORM DELETE-LABOR-CURR-STAT.
           PERFORM DELETE-WO-OPEN-QUEUE.
           PERFORM DELETE-WO-MESSAGE.
           PERFORM DELETE-WO-TRACKING.
           DELETE WO-BASIC RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-BASIC" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ.
       DELETE-VERBAL-EXIT.
           EXIT.

       DELETE-PLNNED.
           READ WO-PLANNED NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-PLNNED-EXIT.
           IF SAVEHISTSW OF REC1101 NOT = "  "
               GO TO DELETE-PLNNED-EXIT.
      *    COMMENTED THE FOLLOWING 4 STATEMENTS OUT 4/23/96
      *    USER WAS UNABLE TO DELETE A HANGING SUFFIXED WORK
      *    ORDER........JEC
      *
      *    PERFORM CHECK-MASTER THRU CHECK-MASTER-EXIT.
      *    IF MASTER-SW = "Y"
      *        MOVE "DELETE OF SUFFIXED FAILED" TO WO-ERR-LINE
      *        GO TO DELETE-PLNNED-EXIT.
           PERFORM DELETE-WO-NUMBER.
           PERFORM DELETE-WO-PARTS.
           PERFORM DELETE-WO-LABOR.
           PERFORM DELETE-LABOR-CURR-STAT.
           PERFORM DELETE-PM-SCHEDULE.
           PERFORM DELETE-JOBPLAN.
           PERFORM DELETE-WO-OPEN-QUEUE.
           PERFORM DELETE-WO-SCHEDULE.
           PERFORM DELETE-WO-MESSAGE.
           PERFORM DELETE-WO-TRACKING.
           PERFORM DELETE-PM-OPEN-QUEUE.
           PERFORM DELETE-PM-SIMULATOR.
           PERFORM DELETE-PM-AUDIT.
           DELETE WO-PLANNED RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-PLANNED" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ.
       DELETE-PLNNED-EXIT.
           EXIT.

       CHECK-MASTER.
           MOVE "N" TO MASTER-SW.
           MOVE WONUM OF REC1101 TO TEMP-WONUM.
           IF TEMP-SUFFIX NUMERIC
               IF TEMP-SUFFIX > "000"
                   NEXT SENTENCE
               ELSE
               GO TO CHECK-MASTER-EXIT
           ELSE
           GO TO CHECK-MASTER-EXIT.

           MOVE WONUM OF REC1101 TO WONUM OF REC1101-2.
           READ WO-PLANNED-2
           IF FILE-STATUS NOT = "00"
               GO TO CHECK-MASTER-EXIT.

           IF WOSTATUS OF REC1101-2 NOT = "FF"
               MOVE "Y" TO MASTER-SW.

       CHECK-MASTER-EXIT.
           EXIT.

       DELETE-WO-NUMBER.
           MOVE DELETE-WONUM TO WONUM OF REC1.
           START WO-NUMBER
               KEY IS = WONUM OF REC1.
           IF FILE-STATUS = "00"
               READ WO-NUMBER NEXT RECORD
               IF FILE-STATUS = "00"
                   DELETE WO-NUMBER RECORD.

       DELETE-WO-PARTS.
           MOVE DELETE-WONUM TO WONUM OF REC12.
           START WO-PARTS
               KEY IS = WONUM OF REC12.
           IF FILE-STATUS = "00"
               PERFORM DELETE-WO-PARTS-C THRU DELETE-WO-PARTS-C-E.

       DELETE-WO-PARTS-C.
           READ WO-PARTS NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-PARTS-C-E.

           IF WONUM OF REC12 NOT = DELETE-WONUM
               REWRITE REC12
               GO TO DELETE-WO-PARTS-C-E.

           DELETE WO-PARTS RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-PARTS" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-PARTS-C.
       DELETE-WO-PARTS-C-E.
           EXIT.

       DELETE-WO-LABOR.
           MOVE DELETE-WONUM TO WONUM OF REC13.
           START WO-LABOR
              KEY IS = WONUM OF REC13.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-LABOR-C THRU DELETE-WO-LABOR-C-E.

       DELETE-WO-LABOR-C.
           READ WO-LABOR NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-LABOR-C-E.

           IF WONUM OF REC13 NOT = DELETE-WONUM
               REWRITE REC13
               GO TO DELETE-WO-LABOR-C-E.

           DELETE WO-LABOR RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-LABOR" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-LABOR-C.
       DELETE-WO-LABOR-C-E.
           EXIT.

       DELETE-PM-SCHEDULE.
           MOVE DELETE-WONUM TO WONUM OF REC44.
           START PM-SCHEDULE
               KEY IS = WONUM OF REC44.
           IF FILE-STATUS = "00"
               PERFORM DELETE-PMSCHEDULE-C THRU DELETE-PMSCHEDULE-C-E.

       DELETE-PMSCHEDULE-C.
           READ PM-SCHEDULE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-PMSCHEDULE-C-E.

           IF WONUM OF REC44 NOT = DELETE-WONUM
               REWRITE REC44
               GO TO DELETE-PMSCHEDULE-C-E.

           DELETE PM-SCHEDULE RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "PM-SCHEDULE" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-PMSCHEDULE-C.
       DELETE-PMSCHEDULE-C-E.
           EXIT.

       DELETE-LABOR-CURR-STAT.
           MOVE DELETE-WONUM TO WONUM OF REC16.
           START LABOR-CURR-STAT
               KEY IS = WONUM OF REC16.
           IF FILE-STATUS = "00"
               PERFORM DELETE-LCS-C THRU DELETE-LCS-C-E.

       DELETE-LCS-C.
           READ LABOR-CURR-STAT NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-LCS-C-E.

           IF WONUM OF REC16 NOT = DELETE-WONUM
               REWRITE REC16
               GO TO DELETE-LCS-C-E.

           DELETE LABOR-CURR-STAT RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "LABOR-CURR-STAT" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-LCS-C.
       DELETE-LCS-C-E.
           EXIT.

       DELETE-JOBPLAN.
           MOVE DELETE-WONUM TO JOBPWOSEQ.
           START JOBPLAN
               KEY IS NOT LESS THAN JOBPWOSEQ.
           IF FILE-STATUS = "00"
               PERFORM DELETE-JOBPLAN-C THRU DELETE-JOBPLAN-C-E.

       DELETE-JOBPLAN-C.
           READ JOBPLAN NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-JOBPLAN-C-E.

           MOVE JOBPWOSEQ TO JOBP-WONUM.
           IF JOBP-WONUM NOT = DELETE-WONUM
               REWRITE REC18
               GO TO DELETE-JOBPLAN-C-E.

           DELETE JOBPLAN RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "JOBPLAN" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-JOBPLAN-C.
       DELETE-JOBPLAN-C-E.
           EXIT.

       DELETE-WO-OPEN-QUEUE.
           MOVE DELETE-WONUM TO WONUM OF REC19.
           START WO-OPEN-QUEUE
               KEY IS = WONUM OF REC19.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-OPEN-Q-C THRU DELETE-WO-OPEN-Q-C-E.

       DELETE-WO-OPEN-Q-C.
           READ WO-OPEN-QUEUE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-OPEN-Q-C-E.

           IF WONUM OF REC19 NOT = DELETE-WONUM
               REWRITE REC19
               GO TO DELETE-WO-OPEN-Q-C-E.

           DELETE WO-OPEN-QUEUE RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-OPEN-QUEUE" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-OPEN-Q-C.
       DELETE-WO-OPEN-Q-C-E.
           EXIT.

       DELETE-WO-SCHEDULE.
           MOVE DELETE-WONUM TO WONUM OF REC23.
           START WO-SCHEDULE
               KEY IS = WONUM OF REC23.
           IF FILE-STATUS = "00"
              PERFORM DELETE-WO-SCHEDULE-C THRU DELETE-WO-SCHEDULE-C-E.

       DELETE-WO-SCHEDULE-C.
           READ WO-SCHEDULE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
               GO TO DELETE-WO-SCHEDULE-C-E.

           IF WONUM OF REC23 NOT = DELETE-WONUM
               REWRITE REC23
               GO TO DELETE-WO-SCHEDULE-C-E.

           DELETE WO-SCHEDULE RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-SCHEDULE" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-SCHEDULE-C.
       DELETE-WO-SCHEDULE-C-E.
           EXIT.

       DELETE-WO-MESSAGE.
           MOVE DELETE-WONUM TO TOWO OF REC24.
           START WO-MESSAGE
               KEY IS = TOWO OF REC24.
           IF FILE-STATUS = "00"
               PERFORM DELETE-WO-MESSAGE-C THRU DELETE-WO-MESSAGE-C-E.

       DELETE-WO-MESSAGE-C.
           READ WO-MESSAGE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-WO-MESSAGE-C-E.

           IF TOWO OF REC24 NOT = DELETE-WONUM
             REWRITE REC24
             GO TO DELETE-WO-MESSAGE-C-E.

           DELETE WO-MESSAGE RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-SCHEDULE" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-MESSAGE-C.
       DELETE-WO-MESSAGE-C-E.
           EXIT.

       DELETE-WO-TRACKING.
           MOVE DELETE-WONUM TO WONUM OF REC26.
           START WO-TRACKING
            KEY IS = WONUM OF REC26.
           IF FILE-STATUS = "00"
             PERFORM DELETE-WO-TRACKING-C THRU DELETE-WO-TRACKING-C-E.

       DELETE-WO-TRACKING-C.
           READ WO-TRACKING NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-WO-TRACKING-C-E.

           IF WONUM OF REC26 NOT = DELETE-WONUM
             REWRITE REC26
             GO TO DELETE-WO-TRACKING-C-E.

           DELETE WO-TRACKING RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "WO-TRACKING" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-WO-TRACKING-C.
       DELETE-WO-TRACKING-C-E.
           EXIT.

       DELETE-PM-OPEN-QUEUE.
           MOVE DELETE-WONUM TO WONUM OF REC39.
           START PM-OPEN-QUEUE
            KEY IS = WONUM OF REC39.
           IF FILE-STATUS = "00"
             PERFORM DELETE-PM-OPEN-QUE-C THRU DELETE-PM-OPEN-QUE-C-E.

       DELETE-PM-OPEN-QUE-C.
           READ PM-OPEN-QUEUE NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-PM-OPEN-QUE-C-E.

           IF WONUM OF REC39 NOT = DELETE-WONUM
             REWRITE REC39
             GO TO DELETE-PM-OPEN-QUE-C-E.

           DELETE PM-OPEN-QUEUE RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "PM-OPEN-QUEUE" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-PM-OPEN-QUE-C.
       DELETE-PM-OPEN-QUE-C-E.
           EXIT.

       DELETE-PM-SIMULATOR.
           MOVE DELETE-WONUM TO WONUM OF REC45.
           START PM-SIMULATOR
            KEY IS = WONUM OF REC45.
           IF FILE-STATUS = "00"
             PERFORM DELETE-PM-SIMULATOR-C THRU
                 DELETE-PM-SIMULATOR-C-E.

       DELETE-PM-SIMULATOR-C.
           READ PM-SIMULATOR NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-PM-SIMULATOR-C-E.

           IF WONUM OF REC45 NOT = DELETE-WONUM
             REWRITE REC45
             GO TO DELETE-PM-SIMULATOR-C-E.

           DELETE PM-SIMULATOR RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "PM-SIMULATOR" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-PM-SIMULATOR-C.
       DELETE-PM-SIMULATOR-C-E.
           EXIT.

       DELETE-PM-AUDIT.
           MOVE DELETE-WONUM TO WONUM OF REC46.
           START PM-AUDIT
            KEY IS = WONUM OF REC46.
           IF FILE-STATUS = "00"
             PERFORM DELETE-PM-AUDIT-C THRU
                 DELETE-PM-AUDIT-C-E.

       DELETE-PM-AUDIT-C.
           READ PM-AUDIT NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             GO TO DELETE-PM-AUDIT-C-E.

           IF WONUM OF REC46 NOT = DELETE-WONUM
             REWRITE REC46
             GO TO DELETE-PM-AUDIT-C-E.

           DELETE PM-AUDIT RECORD.
           IF FILE-STATUS NOT = "00"
               MOVE 66360 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE FILE-STATUS TO ERR-FILE-STATUS
               MOVE "PM-AUDIT" TO ERR-FILE
               MOVE DELETE-WONUM TO ERR-WONO
               MOVE ERROR-BUFFER TO WO-ERR-LINE
               GO TO 2-EOJ
           ELSE
           GO TO DELETE-PM-AUDIT-C.
       DELETE-PM-AUDIT-C-E.
           EXIT.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
