       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TMMDELETE.
       AUTHOR.        R L ENSMINGER/JIM COFFMAN (MAINTAINER).
       INSTALLATION.  GTR.
       DATE-COMPILED.

      *C  09/11/96  W L  MCINTYRE
      *C  MADE REVISIONS FOR YEAR 2000 COMPATABILITY
      *C
      *C  10/16/96  W L  MCINTYRE
      *C  REVISED CODE TO SUCCESSFULLY UPDATE VOIDED WORKORDERS.
      *C
      *C  01/06/97  W D ROXBURY
      *C  ALL REFERENCES TO FILE14 (MCFPMM1400) 'PREV-MAINT' AND FILE15
      *C  (MCFPMM1500) 'PM-TRANS-FILE' ARE DELETED IN RELEASE J.01

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT FILE1
           ASSIGN TO DATABASE-MCFLMM0101
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
           FILE STATUS IS FILE-STATUS.

           SELECT FILE10
           ASSIGN TO DATABASE-MCFLMM1002
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE1101
           ASSIGN TO DATABASE-MCFLMM1101
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE1102
           ASSIGN TO DATABASE-MCFLMM1102
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE12
           ASSIGN TO DATABASE-MCFLMM1201
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE13
           ASSIGN TO DATABASE-MCFLMM1301
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

      ******************************************************************
      *  OLD FILE 'PREV-MAINT' DELETED IN RELEASE J.01
      ******************************************************************
      *    SELECT FILE14
      *    ASSIGN TO DATABASE-MCFLMM1402
      *    ORGANIZATION IS INDEXED
      *    ACCESS MODE IS DYNAMIC
      *    RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
      *    FILE STATUS IS FILE-STATUS.
      ******************************************************************

      ******************************************************************
      *  OLD FILE 'PM-TRANS-FILE' DELETED IN RELEASE J.01
      ******************************************************************
      *    SELECT FILE15
      *    ASSIGN TO DATABASE-MCFLMM1502
      *    ORGANIZATION IS INDEXED
      *    ACCESS MODE IS DYNAMIC
      *    RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
      *    FILE STATUS IS FILE-STATUS.
      ******************************************************************

           SELECT FILE16
           ASSIGN TO DATABASE-MCFLMM1602
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE18
           ASSIGN TO DATABASE-MCFLMM1801
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE19
           ASSIGN TO DATABASE-MCFLMM1902
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE23
           ASSIGN TO DATABASE-MCFLMM2302
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE24
           ASSIGN TO DATABASE-MCFLMM2403
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE26
           ASSIGN TO DATABASE-MCFLMM2601
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE39
           ASSIGN TO DATABASE-MCFLMM3901
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE44
           ASSIGN TO DATABASE-MCFLMM4404
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE45
           ASSIGN TO DATABASE-MCFLMM4504
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE46
           ASSIGN TO DATABASE-MCFLMM4604
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.

       FD  FILE10
           LABEL RECORDS ARE STANDARD.
       01  REC10.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  FILE1101
           LABEL RECORDS ARE STANDARD.
       01  REC1101.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  FILE1102
           LABEL RECORDS ARE STANDARD.
       01  REC1102.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.

       FD  FILE12
           LABEL RECORDS ARE STANDARD.
       01  REC12.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       FD  FILE13
           LABEL RECORDS ARE STANDARD.
       01  REC13.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

      ******************************************************************
      *  OLD FILE 'PREV-MAINT' DELETED IN RELEASE J.01
      ******************************************************************
      *FD  FILE14
      *    LABEL RECORDS ARE STANDARD.
      *01  REC14.
      *    COPY DDS-ALL-FORMATS OF MCFLMM1402.
      ******************************************************************

      ******************************************************************
      *  OLD FILE 'PM-TRANS-FILE' DELETED IN RELEASE J.01
      ******************************************************************
      *FD  FILE15
      *    LABEL RECORDS ARE STANDARD.
      *01  REC15.
      *    COPY DDS-ALL-FORMATS OF MCFLMM1502.
      ******************************************************************

       FD  FILE16
           LABEL RECORDS ARE STANDARD.
       01  REC16.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  FILE18
           LABEL RECORDS ARE STANDARD.
       01  REC18.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.

       FD  FILE19
           LABEL RECORDS ARE STANDARD.
       01  REC19.
           COPY DDS-ALL-FORMATS OF MCFLMM1902.

       FD  FILE23
           LABEL RECORDS ARE STANDARD.
       01  REC23.
           COPY DDS-ALL-FORMATS OF MCFLMM2302.

       FD  FILE24
           LABEL RECORDS ARE STANDARD.
       01  REC24.
           COPY DDS-ALL-FORMATS OF MCFLMM2403.

       FD  FILE26
           LABEL RECORDS ARE STANDARD.
       01  REC26.
           COPY DDS-ALL-FORMATS OF MCFLMM2601.

       FD  FILE39
           LABEL RECORDS ARE STANDARD.
       01  REC39.
           COPY DDS-ALL-FORMATS OF MCFLMM3901.

       FD  FILE44
           LABEL RECORDS ARE STANDARD.
       01  REC44.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  FILE45
           LABEL RECORDS ARE STANDARD.
       01  REC45.
           COPY DDS-ALL-FORMATS OF MCFLMM4504.

       FD  FILE46
           LABEL RECORDS ARE STANDARD.
       01  REC46.
           COPY DDS-ALL-FORMATS OF MCFLMM4604.

       EJECT
       WORKING-STORAGE SECTION.

       01  C1                               PIC 9(9).
       01  C2                               PIC 9(9).
       01  C3                               PIC 9(9).
       01  C4                               PIC 9(9).
       01  CDATE.
           05 YY                            PIC 99.
           05 MM                            PIC 99.
           05 DD                            PIC 99.

       01  CY-TODAY-DATE.
           05  TODAY-CENT                   PIC X(2)  VALUE SPACES.
           05  TODAY-DATE.
               10  TODAY-YEAR               PIC X(2)  VALUE SPACES.
               10  FILLER                   PIC X(4)  VALUE SPACES.

       01  CTIME.
           05 HH                            PIC 99.
           05 MN                            PIC 99.
           05 FILLER                        PIC X(4).
       01  DELETE-WONUM.
           05  DELETE-WONO                  PIC X(7).
           05  DELETE-SUFF                  PIC XXX.
       01  FILE-STATUS                      PIC XX.
       01  GOBACK-SW                        PIC X.
       01  GDATE.
           05 GYY                           PIC 99.
           05 GMM                           PIC 99.
           05 GDD                           PIC 99.
       01  JDATE.
           05 JYY                           PIC 99.
       01  JOBP-WONUM                       PIC X(10).
       01  MASTER-SW                        PIC X.
       01  STOP-READ                        PIC X.
       01  STOP-DEL                         PIC X.
       01  STOP-CHG                         PIC X.
       01  TEMP-WONUM.
           05 TEMP-NUMBER                   PIC X(7).
           05 TEMP-SUFFIX                   PIC X(3).
       01  TEMP-STATUS.
           05 TEMP-STATUS1                  PIC X.
           05 TEMP-STATUS2                  PIC X.

      *-----  FILE BUFFERS FOR BASIC AND PLANNED WORKORDER FILES

       01  BUF-DWOBASIC.                    COPY DWOBASIC IN COPYLIB.
       01  BUF-DWOPLAN.                     COPY DWOPLAN  IN COPYLIB.

       EJECT
       PROCEDURE DIVISION.

       OPEN-PAR.
           OPEN INPUT FILE1101.

           OPEN I-O FILE1
                    FILE10
                    FILE1102
                    FILE12
                    FILE13
                    FILE16
                    FILE18
                    FILE19
                    FILE23
                    FILE24
                    FILE26
                    FILE39
                    FILE44
                    FILE45
                    FILE46.

           MOVE 0 TO C1 C2 C3 C4.

           ACCEPT CDATE FROM DATE.

      *-----  FORMAT DATE WITH CENTURY

           MOVE CDATE TO TODAY-DATE.
           IF TODAY-YEAR > "70"
              MOVE "19"  TO TODAY-CENT
           ELSE
              MOVE "20"  TO TODAY-CENT.

           ACCEPT CTIME FROM TIME.

           PERFORM MAIN-PAR THRU MAIN-PAR-EXIT.

           PERFORM END-PAR.

       END-PAR.
           CLOSE    FILE1
                    FILE10
                    FILE1101
                    FILE1102
                    FILE12
                    FILE13
                    FILE16
                    FILE18
                    FILE19
                    FILE23
                    FILE24
                    FILE26
                    FILE39
                    FILE44
                    FILE45
                    FILE46.

           DISPLAY "NOTE: VERBAL WORK ORDERS DELETED " C1.
           DISPLAY "NOTE: PLNNED WORK ORDERS DELETED " C2.

           DISPLAY "NOTE: VERBAL WORK ORDERS READ    " C3.
           DISPLAY "NOTE: PLNNED WORK ORDERS READ    " C4.

           GOBACK.

       EJECT
       MAIN-PAR.
           MOVE "FF" TO WOSTATUS OF REC10.
           START FILE10
            KEY IS = WOSTATUS OF REC10.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-DEL
             PERFORM DELETE-VERBAL THRU DELETE-VERBAL-EXIT
              UNTIL STOP-DEL = "Y".

           MOVE "FF" TO WOSTATUS OF REC1102.
           START FILE1102
            KEY IS = WOSTATUS OF REC1102.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-DEL
             PERFORM DELETE-PLNNED THRU DELETE-PLNNED-EXIT
              UNTIL STOP-DEL = "Y".

           MOVE "VO" TO WOSTATUS OF REC10.
           START FILE10
            KEY IS = WOSTATUS OF REC10.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-CHG
             PERFORM CHANGE-VERBAL-VO THRU CHANGE-VERBAL-VO-EXIT
              UNTIL STOP-CHG = "Y".

           MOVE "VO" TO WOSTATUS OF REC1102.
           START FILE1102
            KEY IS = WOSTATUS OF REC1102.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-CHG
             PERFORM CHANGE-PLNNED-VO THRU CHANGE-PLNNED-VO-EXIT
              UNTIL STOP-CHG = "Y".

       MAIN-PAR-EXIT.
           EXIT.

       EJECT
       DELETE-VERBAL.
           READ FILE10 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-DEL
             GO TO DELETE-VERBAL-EXIT.

           IF WOSTATUS OF REC10 NOT = "FF"
             REWRITE REC10
             MOVE "Y" TO STOP-DEL
             GO TO DELETE-VERBAL-EXIT.

           ADD 1 TO C3.

           IF BASDELDATE NOT NUMERIC
             MOVE "00000000" TO BASDELDATE.

           MOVE WONUM OF REC10 TO DELETE-WONUM.

           IF CY-TODAY-DATE > BASDELDATE
             PERFORM DELETE-FILE1
             PERFORM DELETE-FILE12
             PERFORM DELETE-FILE13
             PERFORM DELETE-FILE24
             PERFORM DELETE-FILE26

             DELETE FILE10 RECORD
             IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR: FILE STATUS = "
                       FILE-STATUS
                       " ON DELETE OF FILE10"
               GO TO END-PAR
             ELSE
               ADD 1 TO C1

           ELSE
             IF BASPAD = "P   "
               NEXT SENTENCE
             ELSE
      **********************************************************
      *    STATEMENT BELOW *'D OUT 11/30/93 TO NOT DELETE      *
      *    MESSAGES ATTACHED TO WORK ORDERS FOR NAPANEE'S      *
      *    TRACKING OF INFORMATION                             *
      **********************************************************
      *        PERFORM DELETE-FILE24
               PERFORM DELETE-FILE26

               MOVE "P" TO BASPAD
               REWRITE REC10
               IF FILE-STATUS NOT = "00"
                 DISPLAY "ERROR: FILE STATUS = "
                         FILE-STATUS
                         " ON MODIFY OF FILE10"
                 GO TO END-PAR.

       DELETE-VERBAL-EXIT.
           EXIT.

       EJECT
       DELETE-PLNNED.
           READ FILE1102 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-DEL
             GO TO DELETE-PLNNED-EXIT.

           IF WOSTATUS OF REC1102 NOT = "FF"
             REWRITE REC1102
             MOVE "Y" TO STOP-DEL
             GO TO DELETE-PLNNED-EXIT.

           ADD 1 TO C4.

           IF SAVEHISTSW OF REC1102 > "  "
             GO TO DELETE-PLNNED-EXIT.

           IF PLDDELDATE OF REC1102 NOT NUMERIC
             MOVE "00000000" TO PLDDELDATE OF REC1102.

           PERFORM CHECK-MASTER THRU CHECK-MASTER-EXIT.
           IF MASTER-SW = "Y"
             GO TO DELETE-PLNNED-EXIT.

           MOVE WONUM OF REC1102 TO DELETE-WONUM.

           IF CY-TODAY-DATE > PLDDELDATE OF REC1102
             PERFORM DELETE-FILE1
             PERFORM DELETE-FILE12
             PERFORM DELETE-FILE13
             PERFORM DELETE-FILE18
             PERFORM DELETE-FILE23
             PERFORM DELETE-FILE24
             PERFORM DELETE-FILE26
             PERFORM DELETE-FILE39
             PERFORM DELETE-FILE44
             PERFORM DELETE-FILE45
             PERFORM DELETE-FILE46

             DELETE FILE1102 RECORD
             IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR: FILE STATUS = "
                       FILE-STATUS
                       " ON DELETE OF FILE1102"
               GO TO END-PAR
             ELSE
               ADD 1 TO C2

           ELSE
             IF PLDPAD OF REC1102 = "P   "
               NEXT SENTENCE
             ELSE
               PERFORM DELETE-FILE18
               PERFORM DELETE-FILE23
      **********************************************************
      *    STATEMENT BELOW *'D OUT 11/30/93 TO NOT DELETE      *
      *    MESSAGES ATTACHED TO WORK ORDERS FOR NAPANEE'S      *
      *    TRACKING OF INFORMATION                             *
      **********************************************************
      *        PERFORM DELETE-FILE24
               PERFORM DELETE-FILE26

               MOVE "P" TO PLDPAD OF REC1102
               REWRITE REC1102
               IF FILE-STATUS NOT = "00"
                 DISPLAY "ERROR: FILE STATUS = "
                         FILE-STATUS
                         " ON MODIFY OF FILE1102"
                 GO TO END-PAR.

       DELETE-PLNNED-EXIT.
           EXIT.

       CHECK-MASTER.
           MOVE "N" TO MASTER-SW.
           MOVE WONUM OF REC1102 TO TEMP-WONUM.
           IF TEMP-SUFFIX NUMERIC
             IF TEMP-SUFFIX > "000"
               NEXT SENTENCE
             ELSE
               GO TO CHECK-MASTER-EXIT
           ELSE
             GO TO CHECK-MASTER-EXIT.

           MOVE WONUM OF REC1102 TO WONUM OF REC1101.
           READ FILE1101.
           IF FILE-STATUS NOT = "00"
             GO TO CHECK-MASTER-EXIT.

           IF WOSTATUS OF REC1101 NOT = "FF"
             MOVE "Y" TO MASTER-SW.

       CHECK-MASTER-EXIT.
           EXIT.

       EJECT
       CHANGE-VERBAL-VO.
           READ FILE10 NEXT INTO BUF-DWOBASIC
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-CHG
             GO TO CHANGE-VERBAL-VO-EXIT.

           IF WO-STATUS NOT = "VO"
             REWRITE REC10 FROM BUF-DWOBASIC
             MOVE "Y" TO STOP-CHG
             GO TO CHANGE-VERBAL-VO-EXIT.

      *-----  SINCE THE KEY FIELD IS GETTING UPDATED (WOSTATUS), THE
      *-----  RECORD MUST BE DELETED AND RE-INSERTED

           DELETE FILE10.
           IF FILE-STATUS NOT = "00"
              DISPLAY "ERROR: FILE STATUS = "
                      FILE-STATUS
                      " ON DELETE OF FILE10, WO-NO = "
                      WO-NUM
              GO TO END-PAR.

           MOVE "DW" TO WO-STATUS.
           MOVE CY-TODAY-DATE TO DATE-COMP-CN.
           MOVE CTIME TO TIME-COMP.
           MOVE WO-STRT-STATUS TO TEMP-STATUS.
           MOVE "D" TO TEMP-STATUS2.
           MOVE TEMP-STATUS TO WO-STRT-STATUS.
           MOVE BUF-DWOBASIC TO REC10.

           WRITE REC10
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON RE-INSERT OF FILE10, WONUM = "
                     WO-NUM
             GO TO END-PAR.

       CHANGE-VERBAL-VO-EXIT.
           EXIT.

       EJECT
       CHANGE-PLNNED-VO.
           READ FILE1102 NEXT INTO BUF-DWOPLAN
             AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-CHG
             GO TO CHANGE-PLNNED-VO-EXIT.

           IF WO-STATUS-P NOT = "VO"
             REWRITE REC1102 FROM BUF-DWOPLAN
             MOVE "Y" TO STOP-CHG
             GO TO CHANGE-PLNNED-VO-EXIT.


      *-----  SINCE THE KEY FIELD IS GETTING UPDATED (WOSTATUS), THE
      *-----  RECORD MUST BE DELETED AND RE-INSERTED

           DELETE FILE1102.
           IF FILE-STATUS NOT = "00"
              DISPLAY "ERROR: FILE STATUS = "
                      FILE-STATUS
                      " ON DELETE OF FILE1102, WO-NUM = "
                      WO-NUM-PLANNED
              GO TO END-PAR.

           MOVE "DW" TO WO-STATUS-P.
           MOVE CY-TODAY-DATE TO DATE-COMP-P-CN.
           MOVE CTIME TO TIME-COMP-P.
           MOVE WO-START-STATUS TO TEMP-STATUS.
           MOVE "D" TO TEMP-STATUS2.
           MOVE TEMP-STATUS TO WO-START-STATUS.
           MOVE BUF-DWOPLAN TO REC1102.

           WRITE REC1102
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON RE-INSERT OF FILE1102, WO-NUM = "
                     WO-NUM-PLANNED
             GO TO END-PAR.

       CHANGE-PLNNED-VO-EXIT.
           EXIT.

       EJECT
       DELETE-FILE1.
           MOVE DELETE-WONUM TO WONUM OF REC1.
           DELETE FILE1 RECORD.
           IF FILE-STATUS NOT = "00"
             IF FILE-STATUS NOT = "23"
               DISPLAY "ERROR: FILE STATUS = "
                       FILE-STATUS
                       " ON DELETE OF FILE1 " DELETE-WONUM
               GO TO END-PAR.

       EJECT
       DELETE-FILE12.
           MOVE DELETE-WONUM TO WONUM OF REC12.
           START FILE12
            KEY IS = WONUM OF REC12.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE12-C THRU DELETE-FILE12-C-E
               UNTIL STOP-READ = "Y".

       DELETE-FILE12-C.
           READ FILE12 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE12-C-E.

           IF WONUM OF REC12 NOT = DELETE-WONUM
             REWRITE REC12
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE12-C-E.

           DELETE FILE12 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE12"
             GO TO END-PAR.

       DELETE-FILE12-C-E.
           EXIT.

       EJECT
       DELETE-FILE13.
           MOVE DELETE-WONUM TO WONUM OF REC13.
           START FILE13
            KEY IS = WONUM OF REC13.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE13-C THRU DELETE-FILE13-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE13-C.
           READ FILE13 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE13-C-E.

           IF WONUM OF REC13 NOT = DELETE-WONUM
             REWRITE REC13
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE13-C-E.

           DELETE FILE13 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE13"
             GO TO END-PAR.

       DELETE-FILE13-C-E.
           EXIT.

       EJECT
       DELETE-FILE18.
           MOVE DELETE-WONUM TO JOBPWOSEQ.
           START FILE18
            KEY IS NOT LESS THAN JOBPWOSEQ.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE18-C THRU DELETE-FILE18-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE18-C.
           READ FILE18 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE18-C-E.

           MOVE JOBPWOSEQ TO JOBP-WONUM.
           IF JOBP-WONUM NOT = DELETE-WONUM
             REWRITE REC18
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE18-C-E.

           DELETE FILE18 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE18"
             GO TO END-PAR.

       DELETE-FILE18-C-E.
           EXIT.

       EJECT
       DELETE-FILE23.
           MOVE DELETE-WONUM TO WONUM OF REC23.
           START FILE23
            KEY IS = WONUM OF REC23.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE23-C THRU DELETE-FILE23-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE23-C.
           READ FILE23 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE23-C-E.

           IF WONUM OF REC23 NOT = DELETE-WONUM
             REWRITE REC23
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE23-C-E.

           DELETE FILE23 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE23"
             GO TO END-PAR.

       DELETE-FILE23-C-E.
           EXIT.

       EJECT
       DELETE-FILE24.
           MOVE DELETE-WONUM TO TOWO OF REC24.
           START FILE24
            KEY IS = TOWO OF REC24.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE24-C THRU DELETE-FILE24-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE24-C.
           READ FILE24 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE24-C-E.

           IF TOWO OF REC24 NOT = DELETE-WONUM
             REWRITE REC24
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE24-C-E.

           DELETE FILE24 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE24"
             GO TO END-PAR.

       DELETE-FILE24-C-E.
           EXIT.

       EJECT
       DELETE-FILE26.
           MOVE DELETE-WONUM TO WONUM OF REC26.
           START FILE26
            KEY IS = WONUM OF REC26.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE26-C THRU DELETE-FILE26-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE26-C.
           READ FILE26 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE26-C-E.

           IF WONUM OF REC26 NOT = DELETE-WONUM
             REWRITE REC26
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE26-C-E.

           DELETE FILE26 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE26"
             GO TO END-PAR.

       DELETE-FILE26-C-E.
           EXIT.

       EJECT
       DELETE-FILE39.
           MOVE DELETE-WONUM TO WONUM OF REC39.
           START FILE39
            KEY IS = WONUM OF REC39.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE39-C THRU DELETE-FILE39-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE39-C.
           READ FILE39 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE39-C-E.

           IF WONUM OF REC39 NOT = DELETE-WONUM
             REWRITE REC39
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE39-C-E.

           DELETE FILE39 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE39"
             GO TO END-PAR.

       DELETE-FILE39-C-E.
           EXIT.

       EJECT
       DELETE-FILE44.
           MOVE DELETE-WONUM TO WONUM OF REC44.
           START FILE44
            KEY IS = WONUM OF REC44.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE44-C THRU DELETE-FILE44-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE44-C.
           READ FILE44 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE44-C-E.

           IF WONUM OF REC44 NOT = DELETE-WONUM
             REWRITE REC44
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE44-C-E.

           DELETE FILE44 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE44"
             GO TO END-PAR.

       DELETE-FILE44-C-E.
           EXIT.

       EJECT
       DELETE-FILE45.
           MOVE DELETE-WONUM TO WONUM OF REC45.
           START FILE45
            KEY IS = WONUM OF REC45.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE45-C THRU DELETE-FILE45-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE45-C.
           READ FILE45 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE45-C-E.

           IF WONUM OF REC45 NOT = DELETE-WONUM
             REWRITE REC45
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE45-C-E.

           DELETE FILE45 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE45"
             GO TO END-PAR.

       DELETE-FILE45-C-E.
           EXIT.

       EJECT
       DELETE-FILE46.
           MOVE DELETE-WONUM TO WONUM OF REC46.
           START FILE46
            KEY IS = WONUM OF REC46.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM DELETE-FILE46-C THRU DELETE-FILE46-C-E
              UNTIL STOP-READ = "Y".

       DELETE-FILE46-C.
           READ FILE46 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE46-C-E.

           IF WONUM OF REC46 NOT = DELETE-WONUM
             REWRITE REC46
             MOVE "Y" TO STOP-READ
             GO TO DELETE-FILE46-C-E.

           DELETE FILE46 RECORD.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON DELETE OF FILE46"
             GO TO END-PAR.

       DELETE-FILE46-C-E.
           EXIT.
