000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TMODMATL.
      ***************************************************************
      *INSTALLATION.   GOODYEAR TIRE AND RUBBER - AKRON.
      *
      *    THIS PROGRAM IS USED TO MAINTAIN MATERIALS ORDERED AGAINST
      *    A WORK ORDER.
      *
      * 07/08/2004 GEISER
      *    CHANGED F2 KEY TO CALL PROGRAM SEARQADD INSTEAD OF TMODMADD.
      *    THIS IS BEING DONE FOR SAP PLANTS SO THE SAME PROGRAM IS USED
      *    TO CREATE AND MODIFY ALL REQUISITIONS.
      *
      ***************************************************************
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZMODIFY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
001100 01  BLOWUP-BASE                       PIC X(16).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
       COPY TDATESUB OF COPYLIB.

      * PARMS FOR CALL TO SEARQADD TO CREATE A REQUISITION.
       01  BASE-STHIST                   PIC X(10) VALUE "  STHIST;".
       01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
       01  BASE-BUDGET                   PIC X(24) VALUE "  BUDGET;".
       01  BASE-DUMMY                    PIC X(24) VALUE SPACES.
       01  EARQADD-PARMS                 PIC X(30) VALUE SPACES.

       COPY REQGLOB    IN COPYLIB.
       COPY MEMPL      IN COPYLIB.
       COPY LANGUAGE   IN COPYLIB.
       COPY ESCNAM2    IN COPYLIB.
      * END OF PARMS FOR CALL TO SEARQADD TO CREATE A REQUISITION.

       01  ERROR-BUFFER.
           05  FILLER                        PIC X(12).
           05  ERR-WO                        PIC X(10).
           05  FILLER                        PIC X(58).
       01  EDIT-ERROR                        PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  WBF-STATUS                    PIC XX.
           05  WPF-STATUS                    PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
001400 01  MATL-WORKAREA.
           05  SCREEN-WA.
001500         10  WO-NUM-WA                 PIC X(10).
001600         10  DESCRIPTION-WA            PIC X(30).
001700         10  A-C-WA                    PIC X.
001800         10  WO-STATUS-WA              PIC XX.
001900         10  EQPNUM-WA                 PIC X(6).
002000         10  ZONE-WA                   PIC X(4).
002100         10  DATE-SCHD-WA              PIC X(8).
002200         10  TIME-SCHD-WA.
002300             15  TIME-SCHD-HH-WA       PIC XX.
002400             15  TIME-COLON-WA         PIC X.
002500             15  TIME-SCHD-MM-WA       PIC XX.
           05  MW-CMD-LINE                   PIC X(79).
           05  MW-ERR-LINE                   PIC X(79).
005700 01  PASSWORD-INFORMATION.
005800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMODMATL".
005900     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
006000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
006100     05  PROGRAM-DESCRIPTION.
006200         10  PROG-DESC-A.
                   15  FILLER      PIC X(16) VALUE "EXECUTIVE MODULE".
                   15  FILLER      PIC X(15) VALUE " FOR MATERIALS ".
                   15  FILLER      PIC X(29) VALUE "PROCESSING ".
006400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
006600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
006800     05  PASSWORD-FLAG       PIC X.
       COPY DBSTAT OF COPYLIB.
       01  TRUE-VAL                PIC 1 VALUE B"1".
007400 COPY TBLOWUP IN COPYLIB.
007500 01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
007600 01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
007700 LINKAGE SECTION.
008400 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
008600 01  WORK-ORDER-NO                     PIC X(10).
       COPY VCOMLINK OF COPYLIB.
009500 PROCEDURE DIVISION USING DBPARAMETERS WORK-ORDER-NO
009700                      VIEW-COMAREA.
009800 START-EXECUTING.
009900     PERFORM 1-HSK.
010000     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
010100 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE WO-PLANNED-FILE.
010200     GOBACK.
010300 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-PLANNED-FILE.
010400     CALL "TPWORD" USING PASSWORD-INFORMATION.
010800     IF PASSWORD-FLAG = "N"
010900         MOVE "  PWORD" TO BLOWUP-BASE
011000         MOVE "FAILED PASSWORD CHECK - TMODMATL"
011100             TO BU-DISPLAY-MSG
011200         PERFORM 998-BLOWUP.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-PLANNED-FILE.
011300     MOVE SPACES TO WO-BASIC-DATA.
011400     MOVE SPACES TO WO-PLANNED-DATA.
012800 6-MAIN.
012900     PERFORM 60-GET-WO-DATA THRU 60-GWD-EXIT.
           MOVE 0 TO VIEW-LASTKEY.
013100     PERFORM 61-GET-AND-PROCESS-FUNCTION
013200         UNTIL VIEW-LASTKEY = 3.
013300 6-MAIN-EXIT.    EXIT.
013400 60-GET-WO-DATA.
016000     MOVE SPACES TO MATL-WORKAREA.
           MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NO TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 60-CHECK-WO-PLANNED.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 60-CHECK-WO-PLANNED.
018100     MOVE WO-NUM TO WO-NUM-WA.
018200     MOVE APPROVAL-CODE TO A-C-WA.
018300     MOVE DESCRIPTION-1 TO DESCRIPTION-WA.
018400     MOVE WO-STATUS TO WO-STATUS-WA.
018500     MOVE EQUIP-NUM TO EQPNUM-WA.
018800     MOVE ZONE TO ZONE-WA.
019300     MOVE 0 TO VIEW-LASTKEY.
014300     GO TO 60-GWD-EXIT.
014400 60-CHECK-WO-PLANNED.
014500     MOVE SPACES TO WO-BASIC-DATA.
           MOVE 0 TO COND-WORD.
           MOVE WORK-ORDER-NO TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
014700         MOVE 49030 TO CATREAD-MSG-NUMBER
014800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WORK-ORDER-NO TO ERR-WO
015000         MOVE ERROR-BUFFER TO EDIT-ERROR
014900         MOVE TRUE-VAL TO INDS (99)
               GO TO 60-GWD-EXIT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
014600     IF COND-WORD = 15
014700         MOVE 49030 TO CATREAD-MSG-NUMBER
014800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE WORK-ORDER-NO TO ERR-WO
015000         MOVE ERROR-BUFFER TO EDIT-ERROR
014900         MOVE TRUE-VAL TO INDS (99)
               GO TO 60-GWD-EXIT.
016200     MOVE WO-NUM-PLANNED TO WO-NUM-WA.
016300     MOVE DESCRIPTION-1-P TO DESCRIPTION-WA.
016400     MOVE APPROVAL-CODE-P TO A-C-WA.
016500     MOVE WO-STATUS-P TO WO-STATUS-WA.
016600     MOVE EQUIP-NUM-P TO EQPNUM-WA.
016700     MOVE ZONE-P TO ZONE-WA.
017000     IF DATE-SCHD = "      "
017100         NEXT SENTENCE
017200     ELSE
017300     MOVE 4 TO DATE-MODE
017400     MOVE DATE-SCHD TO DATE-VALIDATE-IN
017500     CALL "TDATECHK" USING DATE-CHECK-AREA
017600     MOVE DATE-SLASH-OUT TO DATE-SCHD-WA.
017700     MOVE TIME-SCHD-P-HH TO TIME-SCHD-HH-WA.
017800     MOVE ":" TO TIME-COLON-WA.
017900     MOVE TIME-SCHD-P-MM TO TIME-SCHD-MM-WA.
015200 60-GWD-EXIT.    EXIT.
019400 61-GET-AND-PROCESS-FUNCTION.
019500     IF VIEW-LASTKEY > 0
019600         NEXT SENTENCE
019700     ELSE
019800     MOVE "FMODMEST" TO VIEW-CFNAME
           MOVE EDIT-ERROR TO MW-ERR-LINE
           MOVE 66070 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO MW-CMD-LINE
           MOVE MATL-WORKAREA TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           PERFORM 98-SCREEN-READ
           MOVE DSPLY-REC TO MATL-WORKAREA
           MOVE SPACES TO ERROR-BUFFER EDIT-ERROR.
021500     IF VIEW-LASTKEY = 1 OR 3
021600         GO TO 2-EOJ
021700     ELSE
021800     IF VIEW-LASTKEY = 2
021900*        CALL "TMODMADD" USING DBPARAMETERS WORK-ORDER-NO
      *                          VIEW-COMAREA
      *        MOVE DE-APPROVER        TO EMPLOYID OF MEMPL-REC
      *        READ MEMPL INTO BUF-MEMPL
               CALL "SEARQADD" USING WO-NUM-WA,
                                     BASE-STHIST,
                                     BASE-MMISA,
                                     BASE-BUDGET,
                                     BASE-DUMMY,
                                     EARQADD-PARMS,
                                     REQ-GLOBALS,
                                     BUF-MEMPL,
                                     VIEW-COMAREA,
                                     LANGUAGE-PARMS,
                                     ESC-NAME
022200     ELSE
022300     IF VIEW-LASTKEY = 4
022400         CALL "TMODMCHG" USING DBPARAMETERS WORK-ORDER-NO
                                 VIEW-COMAREA
022700     ELSE
022800     IF VIEW-LASTKEY = 5
022900         CALL "TMODMDEL" USING DBPARAMETERS WORK-ORDER-NO
                                 VIEW-COMAREA
023200     ELSE
023300     IF VIEW-LASTKEY = 6
               MOVE SPACES TO DBPARM-PAD
023400         CALL "TMODMLST" USING DBPARAMETERS WORK-ORDER-NO
                                 VIEW-COMAREA
               IF DBPARM-PAD = SPACES
                   NEXT SENTENCE
               ELSE
               MOVE DBPARM-PAD TO EDIT-ERROR
               MOVE TRUE-VAL TO INDS (99)
023700     ELSE
           MOVE 35126 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO EDIT-ERROR
           MOVE TRUE-VAL TO INDS (99)
024500     MOVE 0 TO VIEW-LASTKEY
024600     GO TO 61-GET-AND-PROCESS-FUNCTION.
024700
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

024800 998-BLOWUP.
024900     MOVE "TMODMATL" TO BU-PGM-NAME.
025000     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
025100                      VIEW-COMAREA DUMMY-KSAM-STAT
025200                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
025300
025400 999-CATREAD.
025500     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
027000 999-CATREAD-EXIT.
027100     EXIT.
