000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TMPORCV.
000400 AUTHOR.  KURT MOVSESIAN.
000500 DATE-WRITTEN. DEC. 6, 1985.
000700
000800************************************************************
000900**                                                        **
001000**    T M P O R C V                                       **
001100**                                                        **
001200*D    THIS IS A SPECIAL FIXUP PROGRAM THAT DELETES        **
001300*D    ANY 'MPORCV' PO ENTRIES WITHOUT A PO HEADER         **
001400*D    ENTRY IN 'DPORECD'                                  **
001500**                                                        **
001600************************************************************
      *C
      *C 09/11/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
001700
001800
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.   HP-3000.
002200 OBJECT-COMPUTER.   HP-3000.
002300 SPECIAL-NAMES.
002500
002600 INPUT-OUTPUT SECTION.
002700 FILE-CONTROL.
002800     SELECT PO-DELETE-FILE ASSIGN TO DISK-PODELT.
002900
           SELECT MPORCV-O
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

003000 DATA DIVISION.
003100 FILE SECTION.
003200 FD  PO-DELETE-FILE
003300     LABEL RECORDS ARE OMITTED
003400     RECORD CONTAINS 14 CHARACTERS.
003500 01  PO-DEL-RCD.
003600     05  PO-DEL-NUM         PIC X(14).
003700
       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0101.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.
003800
003900 WORKING-STORAGE SECTION.
004000 77  DELETE-SW                  PIC X    VALUE "N".
004100
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

004200 COPY DATAB IN COPYLIB.
004300
004400**************************************************************
004500**************************************************************
004600**                                                          **
004700**                DATABASE I/O BUFFER AREA                  **
004800**                                                          **
004900**************************************************************
005000**************************************************************
005100
005200 COPY MPORCV IN COPYLIB.
005500
005700*********************
005800*                   *
005900*   DATA SET NAMES  *
006000*                   *
006100*********************
006200
006300 01  DSET-NAMES.
006400     05  DSET-NAME              PIC X(16)  VALUE SPACES.
006500     05  DSET-MPORCV            PIC X(16)  VALUE "MPORCV;".
006600     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
006700
007200 01 ARG-VALUES.
007300     05  PO-ARG                 PIC X(14) VALUE SPACES.
007400
007500 01  BUILD-PO-NUM.
007600     05  FILLER                   PIC X(11) VALUE SPACES.
007700     05  PO-RCV                   PIC X(3)  VALUE SPACES.
007800
       COPY CCRTFILE IN COPYLIB.
007900
008000
008100
           COPY TBLOWUP IN COPYLIB.

008200 PROCEDURE DIVISION.
008300
008400 60-HOUSEKEEPING.
           OPEN I-O MPORCV-O.
           OPEN INPUT DPORECD-I.
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE 'PODELT'
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "PODELT"      TO CCRTFILE-FILE.
           MOVE "0014"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "00500"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "30"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'PODELT' FAILED"
                   TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
009000     OPEN OUTPUT PO-DELETE-FILE.
009100
009200     GO TO 61-READ-MPORCV.
009300
009400 60-EOJ.
           CLOSE MPORCV-O, DPORECD-I.
009600     CLOSE PO-DELETE-FILE.
009700     GOBACK.
009800
041000 2-BLOWUP.
041100     MOVE "TMPORCV"              TO  BU-PGM-NAME.
041300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
041400         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
041500             BU-DISPLAY-FLDS.
041600
041700
009900**************************************
010000*                                    *
010100*  SERIAL READ ON MPORCV TO FIND     *
010200*  P.O. ENTRIES WITHOUT A HEADER     *
010300*                                    *
010400**************************************
010500
010600
010700 61-READ-MPORCV.
           READ MPORCV-O NEXT INTO BUF-MPORCV
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
011200             GO TO 61-BEGIN-DELETE-PROCEDURE
011300         ELSE
011400             GO TO 2-BLOWUP.
011500
011600 61-CHECK-PO-STAT.
011700     MOVE M-PO-RCV-NO             TO  BUILD-PO-NUM,
011800                                      PO-ARG.
011900     IF PO-RCV  =  "000"
012000         NEXT SENTENCE
012100     ELSE
012200         GO TO 61-READ-MPORCV.
012300
012400
012500**************************************
012600*                                    *
012700*  GET P.O. HEADER FROM DPORECD.     *
012800*                                    *
012900**************************************
013000
013100 61-FIND-DPORECD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
014000             NEXT SENTENCE
014100         ELSE
014200             GO TO 2-BLOWUP
014300     ELSE
014400         GO TO 61-READ-MPORCV.
014500
014600     DISPLAY "M-PO-RCV-NO ", M-PO-RCV-NO.
014700     DISPLAY "M-PO-RCV-STAT ", M-PO-RCV-STAT.
014800     DISPLAY "DELETE ENTRY? (Y/N)".
014900     ACCEPT DELETE-SW.
015000     IF DELETE-SW = "Y"
015100         NEXT SENTENCE
015200     ELSE
015300         GO TO 61-READ-MPORCV.
015400
015500 61-WRITE-PO-DELETE-FILE.
015600     MOVE PO-ARG       TO PO-DEL-NUM.
015700     WRITE PO-DEL-RCD.
015800     GO TO 61-READ-MPORCV.
015900
016000
016100 61-BEGIN-DELETE-PROCEDURE.
016200     DISPLAY "LAST CHANCE BEFORE I BEGIN DELETE PROCESS? (Y/N)".
016300     ACCEPT DELETE-SW.
016400     IF DELETE-SW = "Y"
016500         NEXT SENTENCE
016600     ELSE
016700         GO TO 60-EOJ.
016800
016900     CLOSE PO-DELETE-FILE.
017000     OPEN INPUT PO-DELETE-FILE.
017100
017200 61-READ-DELETE-FILE.
017300     READ PO-DELETE-FILE
017400         AT END
017500             GO TO 60-EOJ.
017600     MOVE PO-DEL-NUM  TO  PO-ARG.
017700     PERFORM 64-DELETE-MPORCV  THRU  64-DM-X.
017800     GO TO 61-READ-DELETE-FILE.
017900
018000 64-DELETE-MPORCV.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-O.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
018700         GO TO 2-BLOWUP.
           DELETE MPORCV-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
019100         GO TO 2-BLOWUP.
019200
019800 64-DM-X.
019900     EXIT.
