000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TMPRTCOP.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.   AS400.
000900 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRTPLAN-BANK
               ASSIGN TO DATABASE-MCFLMM3801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS PB-STATUS.
           SELECT PRTPLAN-BANK-PF
               ASSIGN TO DATABASE-MCFPMM3800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS PBPF-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  PRTPLAN-BANK
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PBREC.
       01  PBREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3801.
       FD  PRTPLAN-BANK-PF
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PBPFREC.
       01  PBPFREC.
           COPY DDS-ALL-FORMATS OF MCFPMM3800.
001400 WORKING-STORAGE SECTION.
       01  BLOWUP-BASE             PIC X(16).
003300 01  ERROR-BUFFER            PIC X(80) VALUE SPACES.
       COPY IOFEEDBACK OF COPYLIB.
001600 01  PASSWORD-INFORMATION.
001700     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMPRTCOP".
001800     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
001900     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002000     05  PROGRAM-DESCRIPTION.
002100         10  PROG-DESC-A     PIC X(60) VALUE
002200             " COPIES GENERIC PART PLANS              "          .
002300         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002500         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002700     05  PASSWORD-FLAG       PIC X.
       01  PB-STATUS               PIC XX.
       01  PBPF-STATUS             PIC XX.
       01  PFKEY                   PIC 9(9).
003500 01  PRTPLAN-BANK-DATA.      COPY DPRTBANK OF COPYLIB.
003100 01  SAVE-REC-NO             PIC 9(9).
002900 COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP  OF COPYLIB.
004500 LINKAGE SECTION.
004700 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
004800 COPY VCOMLINK OF COPYLIB.
004900 01  M-PRTPLAN1              PIC X(10).
005000 01  M-PRTPLAN2              PIC X(10).
005100 COPY LANGSUB OF COPYLIB.
005400 PROCEDURE DIVISION USING    DBPARAMETERS
005500                             VIEW-COMAREA
005600                             M-PRTPLAN1
005700                             M-PRTPLAN2
005800                             LANGUAGE-PARMS.
005900
006000 START-PROGRAM.
006100     PERFORM 1-HSK.
006200     PERFORM 6-MAIN.
006300
006400 2-EOJ.
           CLOSE PRTPLAN-BANK.
           CLOSE PRTPLAN-BANK-PF.
006600     GOBACK.
006700
006900 1-HSK.
           OPEN I-O    PRTPLAN-BANK.
           OPEN I-O    PRTPLAN-BANK-PF.
007000     CALL "TPWORD" USING PASSWORD-INFORMATION.
007400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
007900
008100 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE M-PRTPLAN1 TO GPRTPNAME OF PBREC.
           START PRTPLAN-BANK KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
008900     IF COND-WORD = 17
009000         NEXT SENTENCE
009100     ELSE
009200     IF COND-WORD = 0
009300         PERFORM 69-READ-PRTPLAN-BANK
009500         IF COND-WORD = 0
                   ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA
                   MOVE IO-REL-NO TO SAVE-REC-NO
                   REWRITE PBREC FROM PRTPLAN-BANK-DATA
009600             PERFORM 61-COPY-PRTPLAN UNTIL COND-WORD = 15
009700         ELSE
009800         IF COND-WORD = 15
009900             NEXT SENTENCE
010000         ELSE
010100         PERFORM 998-BLOWUP
010300     ELSE
010400     PERFORM 998-BLOWUP.
010600
010700 61-COPY-PRTPLAN.
010900     MOVE M-PRTPLAN2 TO MPRTNAME.
011000     MOVE 0 TO COND-WORD.
011100     WRITE PBREC FROM PRTPLAN-BANK-DATA
011200         INVALID KEY    MOVE 17 TO COND-WORD.
           IF PB-STATUS NOT = "00" MOVE 17 TO COND-WORD.
011300     IF COND-WORD NOT = 0
011400        PERFORM 998-BLOWUP.
           MOVE SAVE-REC-NO TO PFKEY.
011600     PERFORM 69-READ-PRTPLAN-BANK-PF.
011900     IF COND-WORD NOT = 0
012000         PERFORM 998-BLOWUP.
           PERFORM 69-READ-PRTPLAN-BANK.
012500     IF COND-WORD = 0 OR 15
012600         NEXT SENTENCE
012700     ELSE
012800     PERFORM 998-BLOWUP.

       69-READ-PRTPLAN-BANK.
           MOVE 0 TO COND-WORD.
           READ PRTPLAN-BANK NEXT INTO PRTPLAN-BANK-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MPRTNAME NOT = M-PRTPLAN1 MOVE 15 TO COND-WORD.
           IF PB-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-PRTPLAN-BANK-PF.
           MOVE 0 TO COND-WORD.
           READ PRTPLAN-BANK-PF INTO PRTPLAN-BANK-DATA
               INVALID KEY     MOVE 15 TO COND-WORD.
           IF PBPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
012900
076200 998-BLOWUP.
076300     MOVE "TMPRTCOP" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
