       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TMSGEXEC.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.           **** ELECTRONIC MESSAGE FUNCTIONS EXECUTIVE
      *                        SUBROUTINES CALLED:
      *                            TMESSAGE
      *                            TDISPMES
      *                            TBBNEWS
      *                        ****.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        AS-400.
       OBJECT-COMPUTER.        AS-400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCORLESS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PERS-REC.
           COPY DD-ALL-FORMATS OF MCFLMM0301.

       WORKING-STORAGE SECTION.
       77  RESET-SW            PIC S9(4)  COMP-4 VALUE 0.
       77  TRUE-VAL            PIC 1             VALUE B"1".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TMSGEXEC".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA1 PIC X(30) VALUE
                   "DISPLAYS THE MESSAGE PROGRAM S".
               10  PROG-DESCA2 PIC X(30) VALUE
                   "ELECTION MENU FOR THE         ".
               10  PROG-DESCB  PIC X(60) VALUE
                   "SUPERVISOR's FUNCTIONS PROGRAM.".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "RUNS FROM THE f1 KEY OF THE SU".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "PERVISOR's FUNCTIONS MENU.    ".
           05  PASSWORD-FLAG   PIC X.

       01  SCREEN-DATA.
           05  CC-BUF          PIC X(04).
           05  CC-NUM          PIC X(04).
           05  NAME-BUF        PIC X(16).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  MSG-AREA.
           05  CNUM-MSG        PIC X(04).
           05  WONUM-MSG       PIC X(10).
           05  MSG-BUF         PIC X(76).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  CNUM-BUFFER.
           05  CNUM-BUF            PIC X(04).
           05  CNAM-BUF            PIC X(16).

       01  PERS-DATA.
           05  PER-CC              PIC XXXX.
           05  PER-ZONE            PIC XXXX.
           05  PER-SKILL           PIC XX.

       PROCEDURE DIVISION USING DBPARAMETERS
                                CNUM-BUFFER
                                PERS-DATA.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           PERFORM 1-HSK.
           GO TO 6-MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               PER-PERSONNEL.
           GOBACK.

       1-HSK.
           MOVE 0              TO RESET-SW.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          PER-PERSONNEL.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE CNUM-BUF       TO CC-NUM.
           MOVE CNAM-BUF       TO NAME-BUF.

       6-MAIN.
           IF MESSAGE-BUFFER NOT = SPACES
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99).

           MOVE "MSGEXEC"      TO SCREEN-NAME.
           MOVE SPACES         TO CC-BUF.

       61-SHOWFORM.
           IF RESET-SW > 0
               MOVE RESET-SW   TO KEY-HIT
               MOVE 0          TO RESET-SW
               GO TO 61-SEARCH-KEY.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE SPACES         TO MESSAGE-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 4
               GO TO 61-SEARCH-KEY.

           IF KEY-HIT = 0
               IF CC-NUM = SPACES
                   GO TO 61-GET-DATA.

           MOVE 0              TO RESET-SW.

           IF CC-BUF NOT = SPACES
               MOVE KEY-HIT    TO RESET-SW
               GO TO 61-GET-DATA.

           IF CNUM-BUF = SPACES
               GO TO 61-GET-DATA.

       61-SEARCH-KEY.
           IF KEY-HIT = 2
               CALL "TMESSAGE" USING DBPARAMETERS
                                     CNUM-BUFFER
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 8
               MOVE SPACES     TO MSG-AREA
               MOVE CNUM-BUF   TO CNUM-MSG
               CALL "TDISPMES" USING DBPARAMETERS
                                     MSG-AREA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   MOVE MSG-BUF TO MESSAGE-BUFFER
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 4
               CALL "TBBNEWS" USING DBPARAMETERS
                                    PERS-DATA
               IF KEY-HIT = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO 6-MAIN
           ELSE
               GO TO 61-SHOWFORM.

       61-GET-DATA.
           IF CC-BUF = "NEWS" OR "9999"
      **********************************************************************
      **    MESSAGE 035/089:
      ** INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(FIELD-NUMBER) IND(99)
               MOVE 0          TO RESET-SW
               GO TO 61-SHOWFORM.

           MOVE SPACES         TO NAME-BUF.
           MOVE CC-BUF         TO PERCCNUM-MM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO WO-PERS-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/089:
      ** INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(FIELD-NUMBER) IND(99)
               GO TO 61-SHOWFORM.

           IF PER-CC-NUM NOT = CC-BUF
      **********************************************************************
      **    MESSAGE 035/089:
      ** INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(FIELD-NUMBER) IND(99)
               GO TO 61-SHOWFORM.

           MOVE CC-BUF         TO CC-NUM CNUM-BUF.
           MOVE SPACES         TO CC-BUF PERS-DATA.
           MOVE PER-CC-NUM     TO PER-CC.
           MOVE PER-MAINT-ZONE TO PER-ZONE.

           IF PER-TEMP-ZONE NOT = SPACES
               MOVE PER-TEMP-ZONE TO PER-ZONE.

           MOVE PER-CRAFT      TO PER-SKILL.
           MOVE PER-EMP-NAME   TO CNAM-BUF NAME-BUF.
           GO TO 61-SHOWFORM.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

