       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TMSGFILE.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS. *** THE ELECTRONIC MESSAGE FUNCTIONS EXECUTIVE
      *               SUBROUTINES CALLED:
      *                   TMESSAGE
      *                   TDISPMES
      *                   TBBNEWS
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZMESSAGE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WO-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.
       77  RESET-SW            PIC S9(4) BINARY VALUE 0.
       77  DELAY-SW            PIC S9(4) BINARY VALUE 0.
       77  TRUE-VAL            PIC 1            VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TMSGFILE".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A PIC X(30) VALUE
                   "DISPLAYS THE SELECTION MENU FO".
               10  PROG-DESC-A PIC X(30) VALUE
                   "R THE STAND-ALONE MMIS MESSAGE".
               10  PROG-DESC-B PIC X(30) VALUE
                   "PROGRAM FOR PLANNERS AND ENGIN".
               10  PROG-DESC-B PIC X(30) VALUE
                   "EERS OR OTHER USERS.  ALLOWS  ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "FULL MESSAGE FUNCTIONS, SEND, ".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "RECEIVE, AND BULLETIN BOARD.  ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  CC-BUF              PIC X(04).
           05  CC-NUM              PIC X(04).
           05  NAME-BUF            PIC X(16).
           05  CMDMSG              PIC X(79).
           05  ERRMSG              PIC X(79).

       01  MSG-AREA.
           05  CNUM-MSG            PIC X(04).
           05  WONUM-MSG           PIC X(10).

       01  PERS-DATA.
           05  PER-CC              PIC XXXX.
           05  PER-ZONE            PIC XXXX.
           05  PER-SKILL           PIC XX.

       01  CNUM-BUFFER.
           05  CNUM-BUF            PIC X(04).
           05  CNAM-BUF            PIC X(16).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           PERFORM 1-HSK.
           GO TO 6-MAIN.

       2-EOJ.
           CLOSE               PER-PERSONNEL.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       1-HSK.
           OPEN INPUT          PER-PERSONNEL.
           OPEN I-O            DISPLAY-FILE.

           MOVE SPACES         TO SCREEN-DATA.
           MOVE SPACES         TO CNUM-BUFFER PERS-DATA.
           MOVE SPACES         TO LAST-WO-USED-DATA.
           MOVE 1              TO DATE-FLAG-SW.

           OPEN INPUT          WO-LAST-NUM-USED.
           READ  WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               DISPLAY "UNABLE TO GET LAST-WO-USED DATA."
                       "    FILE-STATUS = " FILE-STAT
               CLOSE           WO-LAST-NUM-USED
               GO TO 2-EOJ.

           MOVE DATE-FLAG-SW   TO DATE-FLAG.
           CLOSE               WO-LAST-NUM-USED.

      **************************************
      **   SETJCW  JCW-MLOCK-262
      **************************************
           MOVE 262            TO SETJCW-STARTING-POS.
           MOVE " "            TO SETJCW-VALUE.
           IF A-SWITCH = "O"
               MOVE "1"        TO SETJCW-VALUE.
           MOVE 1              TO SETJCW-LENGTH.

           CALL "SETJCW" USING SETJCW-VALUE
                               SETJCW-STARTING-POS
                               SETJCW-LENGTH
                               SETJCW-STATUS.

           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO 2-EOJ.

      *    ADD 32              TO VIEW-OPTIONS.
      *    MOVE 300            TO VIEW-USERTIME.

       6-MAIN.
           MOVE "MSGEXEC"      TO SCREEN-NAME.
           MOVE SPACES         TO CC-BUF.

       61-SHOWFORM.
           IF RESET-SW > 0
               MOVE RESET-SW   TO KEY-HIT
               MOVE 0          TO RESET-SW
               GO TO 61-SEARCH-KEY.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO 2-EOJ.

           IF CC-BUF = "NEWS"
               MOVE 4          TO KEY-HIT
               GO TO 61-SEARCH-KEY.

           IF KEY-HIT = 4
               GO TO 61-SEARCH-KEY.

           IF KEY-HIT = 0
               IF CC-NUM = SPACES
                   GO TO 61-GET-DATA.

           IF CC-BUF = "9999"
      **********************************************************************
      **    MESSAGE 035/047:
      **  INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 61-SHOWFORM.

           IF CC-BUF NOT = SPACES
               MOVE KEY-HIT    TO RESET-SW
               GO TO 61-GET-DATA.

           IF CNUM-BUF = SPACES
               GO TO 61-GET-DATA.

       61-SEARCH-KEY.
           IF KEY-HIT = 2
               CALL "TMESSAGE" USING DBPARAMETERS
                                     CNUM-BUFFER
               IF KEY-HIT = 3
                   GO TO 2-EOJ
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 8
               MOVE SPACES     TO MSG-AREA
               MOVE CNUM-BUF   TO CNUM-MSG
               CALL "TDISPMES" USING DBPARAMETERS
                                     MSG-AREA
               IF KEY-HIT = 3
                   GO TO 2-EOJ
               ELSE
                   GO TO 6-MAIN
           ELSE
           IF KEY-HIT = 4
               MOVE SPACES     TO MSG-AREA
               CALL "TBBNEWS" USING DBPARAMETERS
                                    PERS-DATA
               IF KEY-HIT = 3
                   GO TO 2-EOJ
               ELSE
                   GO TO 6-MAIN
           ELSE
               GO TO 61-SHOWFORM.

       61-GET-DATA.
           IF CC-BUF = "9999"
      **********************************************************************
      **    MESSAGE 035/047:
      **  INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO 61-SHOWFORM.

           IF CC-BUF = "NEWS"
      **********************************************************************
      **    MESSAGE 035/089:
      **  INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               MOVE 0          TO RESET-SW
               GO TO 61-SHOWFORM.

           MOVE SPACES         TO NAME-BUF.
           MOVE CC-BUF         TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO WO-PERS-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
             IF FILE-STAT-1 = "2"
      **********************************************************************
      **    MESSAGE 035/089:
      **  INVALID IDENTIFICATION CODE
      **********************************************************************
                 MOVE  35        TO CATREAD-MSG-SET
                 MOVE  89        TO CATREAD-MSG-NUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO ERRMSG
                 MOVE TRUE-VAL   TO IND(1) IND(99)
                 GO TO 61-SHOWFORM
             ELSE
                 MOVE FILE-STAT  TO CON-WORD
                 MOVE "READ    " TO DB-FUNC
                 MOVE "PER-PERSONNEL" TO DB-FILE
                 MOVE DB-ERROR   TO MESSAGE-BUFFER
                 MOVE MESSAGE-BUFFER TO ERRMSG
                 MOVE TRUE-VAL   TO IND(1) IND(99)
                 GO TO 61-SHOWFORM.

           MOVE CC-BUF         TO CC-NUM CNUM-BUF.
           MOVE SPACES         TO CC-BUF.
           MOVE PER-CC-NUM     TO PER-CC.
           MOVE PER-MAINT-ZONE TO PER-ZONE.
           IF PER-TEMP-ZONE NOT = SPACES
               MOVE PER-TEMP-ZONE TO PER-ZONE.
           MOVE PER-CRAFT      TO PER-SKILL.
           MOVE PER-EMP-NAME   TO CNAM-BUF NAME-BUF.
           GO TO 61-SHOWFORM.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.
