       IDENTIFICATION DIVISION.
       PROGRAM-ID. TMSTRINQI.
       AUTHOR. KURT MOVSESIAN.
      *REMARKS.
      *
      ******************************************************
      *  COPIED FROM TMSTRINQ AND MODIFIED TO OPEN FILES   *
      *  AS INPUT ONLY.                                    *
      ******************************************************
      *                                                    *
      *   T M S T R I N Q                   SMM            *
      *                                                    *
      *   THIS PROGRAM IS AN INQUIRY/UPDATE FOR THE        *
      *   LOCAL STORES ACCOUNTING SYSTEM.  THE CORPORATE   *
      *   CODE MUST RESIDE IN 2 DATA BASES.  THE 2 DATA    *
      *   BASES THAT ARE OPENED ARE 'STORES' AND 'CSACCT'. *
      *                                                    *
      ******************************************************
      *   S U B R O U T I N E S   C A L L E D :            *
      *      1. SMSTINQS                                   *
      ******************************************************
      *                                                    *
      *   C O M M E N T S                                  *
      *                                                    *
      *   10/18/1994      C A ZUBEK                        *
      *   -INCREASED THE SIZE OF THE ENTRY SCREEN CORPORATE*
      *    CODE FIELD (PASS-CORP-CODE) TO ALLOW FOR THE    *
      *    12-BYTE ALTERNATE KEY FIELD.                    *
      *                                                    *
      ******************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       SPECIAL-NAMES.        I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZMSTRINQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC           PIC X(2000).
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  PASS-CORP-CODE              PIC X(12)   VALUE SPACES.
       77  PASS-COMPANY-CODE           PIC X(3)    VALUE SPACES.
       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X       VALUE SPACES.
           05  FILE-STATUS-2           PIC X       VALUE SPACES.
       COPY VCOMAREA IN COPYLIB.
      *************************************************************
      **    PARAMETER AREA FOR DISPLAY FILE                      **
      *************************************************************
       COPY DISPDATA   IN COPYLIB.
       01  COMMAND-AREA.
           05  OVERRIDE-ZMSTRINQ      PIC X(34) VALUE
               "OVRDSPF FILE(ZMSTRINQ) SHARE(*YES)".
           05  OVERRIDE-PARM2         PIC S9(10)V9(5) COMP-3 VALUE 34.
       COPY IOFEEDBACK IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FMSTRINQ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.


      *********************************
      *                               *
      *  BELOW ARE THE BUFFER AREAS   *
      *    SET UP FOR EACH DATASET IN *
      *    THE DATABASE - STORES      *
      *                               *
      *********************************

       COPY MPLTINFO IN COPYLIB.


      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".

       COPY DATAB IN COPYLIB.

       COPY DBCSACCT IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".

       01 ARG-VALUES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.


       COPY TBLOWUP IN COPYLIB.

      ************************************
      *   NATIVE LANGUAGE SUPPORT AREA   *
      ************************************

       COPY LANGUAGE IN COPYLIB.
       COPY CATREAD  IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           CALL "SMSTINQSI" USING BASE,
                                  ACCTG-BASE,
                                  VIEW-COMAREA,
                                  PASS-CORP-CODE,
                                  PASS-COMPANY-CODE,
                                  LANGUAGE-PARMS.

           PERFORM 2-EOJ  THRU  2-EOJ-X.
           GOBACK.


       1-HSK.
           MOVE "TMSTRINQI"  TO  BU-PGM-NAME.
           CALL "QCMDEXC" USING OVERRIDE-ZMSTRINQ, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MPLTINFO-I.

           MOVE "P 01"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET P 01 MPLTINFO*1-HSK"   TO  BU-DISPLAY-MSG
               MOVE PLT-ARG   TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           MOVE MPLTINFO-COMPANY  TO  PASS-COMPANY-CODE.

       1-H-X.
           EXIT.


       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE MPLTINFO-I.
       2-EOJ-X.
            EXIT.

      *********************************************
      *                                           *
      *  BLOWUP ROUTINE EXECUTES WHENEVER A       *
      *  FATAL ERROR OCCURS                       *
      *                                           *
      *********************************************

       2-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.
