       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TMSTRMEXC.
       AUTHOR.              D. RAUCH.
       DATE-WRITTEN.        NOV 18, 2004.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *****************************************************************
      *     TRANSACTION DRIVER PROGRAM - STOREROOM TRANSACTIONS        S
      *                    ----------------------                      S
      * STOREROOM TRANSACTIONS ONLY EXIST WITHIN COBOL PROGRAM TUDCSTR.S
      * THIS PROGRAM ALLOWS THEM TO BE EXECUTED OUTSIDE OF THE MENU    S
      * PROGRAM BY DEFINING ANY OR ALL OF THEM TO THE GLOBAL MENU      S
      * SYSTEM THEN ASSOCIATING THIS PROGRAM WITH EACH.                S
      *****************************************************************S
      * SPECIAL NOTES:                                                 S
      *                                                                S
      * 1) PGM COPIED FROM TMTSTEXC - FRONTEND PGM FOR Q1 TRANS)       S
      * 2) PGM CALLS COPIED FROM STOREROOM MENU PGM TUDCSTR)           S
      *                                                                S
      *****************************************************************
      **                MODIFICATION   HISTORY
      *****************************************************************
      ** D.RAUCH        11/16/2004      REQUEST# 2004-693306
      ** DCR01     PROGRAM CREATED FROM A COPY OF TMTSTEXC
      *****************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.   LOCAL-DATA IS LDA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.


       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       01  PASSED-SPOOL-PRT          PIC S9(2)  VALUE ZEROS COMP-4.
       01  MCXCBLERR-SCOPE           PIC X(1)   VALUE "C".

      *************************************************************
      **                                                          **
      **          C O M M U N I C A T I O N S   A R E A S         **
      **                                                          **
      **************************************************************

       COPY ZMPLTWS    IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY CSWITCHF   IN COPYLIB.
       COPY STCOM      IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY ESCNAM2    IN COPYLIB.
       COPY MULTSTR    IN COPYLIB.
       COPY TISSCRWS   IN COPYLIB.

      *---------- PARMS FOR CALL TO "WHO" INTRINSIC

       01  WHO-VARIABLES.
           05  MOD                      PIC S9(4) COMP-4.
           05  CAP                      PIC S9(8) COMP-4.
           05  LATTR                    PIC S9(8) COMP-4.
           05  USERNAME                 PIC X(8).
           05  GRPNAME                  PIC X(8).
           05  ACCTNAME                 PIC X(8).
           05  HOMEGRP                  PIC X(8).
           05  TNUM                     PIC 99 COMP-4.
           05  FILLER                   PIC XX.


      **************************************************************
      **                  V I E W   W O R K                       **
      **************************************************************
       COPY VCOMAREA   IN COPYLIB.
       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FCSISINQ".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.


       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76      COMP-4.
       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO    COMP-4.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.

      *---------- WORK AREAS FOR HANDLING VIEW COMMUNICATIONS ERRORS
      *01  ESC-RESET-TERM.
      *    05  FILLER                    PIC X(1)  VALUE %33.
      *    05  FILLER                    PIC X(1)  VALUE "g".
      *01  VERR-COUNT                    PIC S9(4) COMP-4 VALUE 0.
      *
      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1         PIC X  VALUE "0".
           05  FILE-STATUS-2         PIC X  VALUE "0".

       01  BASE                      PIC X(20)   VALUE "  STORES;".
       01  PASSWORD                  PIC X(5)    VALUE "JADE;".
       01  PASS-RPT-NUMBER           PIC S9(4)   BINARY VALUE 3.
       01  MMIS-BASE                 PIC X(8)    VALUE "  MMISA;".

       01  WS-SAVE-LDA          PIC X(1024)      VALUE SPACE.
       01  WS-SAVE-LDA-R  REDEFINES WS-SAVE-LDA.
           03  FILLER           PIC X(107).
           03  LDA-TRAN-CODE    PIC X(04).
           03  FILLER           PIC X(1013).

       COPY DBSTAT     IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-DUMMY             PIC X(2)   VALUE SPACES.
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".

       01  MODE-AREA.
           05  MODE1                  PIC S9(4)  COMP-4 VALUE 1.
           05  MODE7                  PIC S9(4)  COMP-4 VALUE 7.

       01  ALL-ITEMS                  PIC X(2)   VALUE "@;".
       01  PLT-ARG                    PIC X(4)   VALUE "P 01".

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************
       COPY MPLTINFO    IN COPYLIB.


      **************************************
      *                                    *
      *    NATIVE LANGUAGE SUPPORT AREA    *
      *                                    *
      **************************************

       COPY LANGUAGE   IN COPYLIB.

       PROCEDURE DIVISION.
       1-HOUSEKEEP.

           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

      *---------------------------------------------------------------
      *-- "SUCK IN" THE *LDA TO DETERMINE WHAT TRAN CODE TO PROCESS
      *---------------------------------------------------------------
           ACCEPT WS-SAVE-LDA  FROM LDA.

      *------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
           MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
           PERFORM 7150-CALL-CSWITCHF.


      *---------------------------------------------------------------
      *-- RETRIEVE PLANT DATA FROM MPLTINFO - MCFLCS0501
      *---------------------------------------------------------------
           MOVE PLT-ARG            TO  WS-ZMPLT-KEY.
           PERFORM ZMPLT-GET-MPLTINFO  THRU ZMPLT-EXIT.
           MOVE WS-ZMPLT-FILE-STATUS  TO  FILE-STATUS.
           IF  FILE-STATUS  = "00"
               MOVE WS-ZMPLT-PLTINFODTA TO MPLTINFO-DATA
           ELSE
               MOVE "TMSTRMEXC - DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP
           END-IF.


           IF HOMEGRP = "MIXCTR  "
               MOVE "11M"     TO  MPLTINFO-COMPANY
           END-IF.

      **==============================================================
      **= PROGRAM CALLS BASED ON TRAN CODE FOUND IN LDA POS 108 - 111
      **= PROGRAM CALLS TAKEN FROM MENU PROGRAM TUDCSTR
      **==============================================================
           MOVE LDA-TRAN-CODE   TO  SCOM-PGM-KEY.


      **==============================================================
      **=   ---STOREROOM WITHDRAWAL (SW)---
      **=   SW1   WITHDRAW SINGLE ITEM
      **=   SW2   PREPARE  WITHDRAWAL WORK SHEET
      **=   SW3   MODIFY   WITHDRAWAL WORK SHEET
      **=   SW4   PROCESS  WITHDRAWAL WORK SHEET
      **=
      **=   ---STOREROOM RETURNS    (ST)---
      **=   ST1   RETURN  SINGLE ITEM
      **=   ST2   PREPARE RETURN WORK SHEET
      **=   ST3   MODIFY  RETURN WORK SHEET
      **=   ST4   PROCESS RETURN WORK SHEET
      **==============================================================
           IF  LDA-TRAN-CODE  = "SW1 "
           OR  LDA-TRAN-CODE  = "SW2 "
           OR  LDA-TRAN-CODE  = "SW3 "
           OR  LDA-TRAN-CODE  = "SW4 "
           OR  LDA-TRAN-CODE  = "ST1 "
           OR  LDA-TRAN-CODE  = "ST2 "
           OR  LDA-TRAN-CODE  = "ST3 "
           OR  LDA-TRAN-CODE  = "ST4 "
               CALL "SIRMAIN" USING BASE MMIS-BASE  VIEW-COMAREA
                     LANGUAGE-PARMS STORES-COMAREA SRF-COMAREA
                     SRF-SPOOLER-REC ESC-NAME MULTIPLE-STR-DATA
               GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=   ---STOREROOM RETURNS    (ST)---
      **=   ST5   RETURN WITH VALUE
      **==============================================================
           IF  LDA-TRAN-CODE  = "ST5 "
               CALL "SRETWVLS" USING BASE VIEW-COMAREA LANGUAGE-PARMS  ,
                     ESC-NAME MULTIPLE-STR-DATA SRF-MPLTINFO-COMPANY
               GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=   ---STOREROOM WITHDRAWAL (SW)---
      **=   SW6   MULTIPLE ITEM WITHDRAWAL
      **=
      **=   ---STOREROOM RETURNS    (ST)---
      **=   ST6   MULTIPLE ITEM RETURN
      **==============================================================
           IF   LDA-TRAN-CODE  = "SW6 "
           OR   LDA-TRAN-CODE  = "ST6 "
                CALL "SIRMULT" USING BASE MMIS-BASE STATUS-AREA
                      VIEW-COMAREA STORES-COMAREA SRF-COMAREA
                      SRF-SPOOLER-REC LANGUAGE-PARMS MULTIPLE-STR-DATA
                      ESC-NAME ISCR-DATA
                GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=   ---STOREROOM BIN MAINT  (SB)---
      **=   SB    BIN LOCATIONS
      **==============================================================
           IF  LDA-TRAN-CODE  = "SB  "
               CALL "SBINLOCS" USING BASE  VIEW-COMAREA  LANGUAGE-PARMS
               GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=   ---STOREROOM RECEIPTS   (SR)---
      **=   SR    RECEIPT INTO STOREROOM
      **==============================================================
           IF  LDA-TRAN-CODE  = "SR  "
               CALL "SSTRRCV" USING BASE VIEW-COMAREA LANGUAGE-PARMS
                     SRF-BUF-MPLTINFO MULTIPLE-STR-DATA
               GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=   ---STOREROOM MISCELLANEOUS (SM)---
      **=   SM1   WORK SHEET REPRINT
      **=   SM2   OUTSTANDING WORKSHEET REPORT
      **=   RS    RESERVATION MENU
      **==============================================================
           IF  LDA-TRAN-CODE  = "SM1 "
               CALL "SRWREPRT" USING BASE MMIS-BASE STATUS-AREA
                     VIEW-COMAREA STORES-COMAREA SRF-COMAREA
                     SRF-SPOOLER-REC LANGUAGE-PARMS MULTIPLE-STR-DATA
                     ESC-NAME
               GO TO 1-EOJ
           END-IF.

           IF  LDA-TRAN-CODE  = "SM2 "
               MOVE "FRSCREEN"   TO  CSF-NEW-FORMFILE-NAME
               MOVE "N"          TO  CSF-MODE
               PERFORM 7150-CALL-CSWITCHF
               IF  CSF-OPENFORM-ERR-SW NOT = "Y"
                   CALL "SRSCRNS" USING BASE, VIEW-COMAREA,
                         LANGUAGE-PARMS, PASS-RPT-NUMBER
                   MOVE "O"       TO  CSF-MODE
                   PERFORM 7150-CALL-CSWITCHF
               END-IF
               GO TO 1-EOJ
           END-IF.

           IF  LDA-TRAN-CODE  = "RS  "
               CALL "SRESERVE" USING BASE MMIS-BASE
                     VIEW-COMAREA SRF-COMAREA LANGUAGE-PARMS
               GO TO 1-EOJ
           END-IF.

      **==============================================================
      **=       ---STOREROOM INQUIRIES (Q?)---
      **=   INQUIRIES ARE HANDLED IN OTHER PROGRAMS
      **=
      **=   Q1  TMTSTEXC -  MATERIAL STATUS BY CORP-CODE
      **=   Q3  TRSINQ   -  RECEIVING SLIP INQUIRY
      **=   Q4  TPOINQCD -  P.O. - RCV SLIP INQUIRY BY CODE
      **=   Q8  TREQINQ  -  REQUISITION INQUIRIES
      **=   Q9  TDSCINQM -  STORES CODE INQUIRIES
      **==============================================================

       1-EOJ.

           GOBACK.

       2100-BLOWUP.
           MOVE "TMSTRMEXC"              TO   BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
                 VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
                 BU-DISPLAY-FLDS.

       7150-CALL-CSWITCHF.
           CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
                 FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP
           END-IF.

       COPY ZMPLTSUBR  IN COPYLIB.
      **==============================================================
      **==                    END  OF  SOURCE
      **==============================================================
