000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TMTDCSAS.
000400 AUTHOR.               ML BISHOP.
000500 DATE-WRITTEN.         JUNE 13,1990.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      DETAIL TRANSACTION DATA SET
001000*                      AND WRITE THE RECORDS TO A FILE.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   SEPT 16, 1996   CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.      AS-400.
001600 OBJECT-COMPUTER.      AS-400.
       COPY SPECIALN IN COPYLIB.
001800
001900 INPUT-OUTPUT SECTION.
002000 FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS IN-STATUS.

           SELECT DTRANS-OUT
               ASSIGN TO DATABASE-MCFPCAMTD
               FILE STATUS IS OUT-STATUS.

002500 DATA DIVISION.
002700 FILE SECTION.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  DTRANS-OUT
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-OUT-REC.
           COPY DDS-MCRPCAMTD  OF MCFPCAMTD.

006500 WORKING-STORAGE SECTION.
010500
022000************************************************************
022100**                                                        **
022200**           D A T A B A S E   B U F F E R S              **
022300**                                                        **
022400************************************************************
022700
022800 COPY DTRANS IN COPYLIB.
022900
023400**********************************************************
023500*              D A T A    B A S E                        *
023600**********************************************************
023700
       01  FILE-STATUS-AREA.
           05  IN-STATUS        PIC X(2).
           05  OUT-STATUS       PIC X(2).
           05  FILE-STATUS      PIC X(2).

       01  COUNTERS.
           05  RECS-READ        PIC S9(11) COMP-3 VALUE +0.
           05  RECS-WRITTEN     PIC S9(11) COMP-3 VALUE +0.

       COPY DBSTAT IN COPYLIB.

027500******************************************
027600**   PARAMETERS FOR CALLING 'TBLOWUP'
027700******************************************
027800
028100 COPY TBLOWUP IN COPYLIB.
028200
       01 DUMMY-DB               PIC X(10) VALUE SPACES.

       01  MCXCBLERR-SCOPE       PIC X(1)  VALUE "C".

028400 PROCEDURE DIVISION.
       000-MAINLINE.
028500     PERFORM 1-HOUSEKEEPING THRU 1-HOUSEKEEPING-EXIT.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL
                               BUF-DTRANS EQUAL HIGH-VALUES.
           PERFORM 2-EOJ THRU 2-EOJ-EXIT.
           GOBACK.

       1-HOUSEKEEPING.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN INPUT   DTRANS-MC-I
                OUTPUT  DTRANS-OUT.
           PERFORM 3-READ-DTRANS THRU 3-READ-DTRANS.

       1-HOUSEKEEPING-EXIT.
           EXIT.

       10-BLOWUP.
           MOVE "TMTDCSAS" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING  DUMMY-DB, BU-PGM-NAME,
                          STATUS-AREA, DUMMY-VIEW-AREA,
                          FILE-STATUS, BU-DISPLAY-MSG, BU-DISPLAY-FLDS.

       10-BLOWUP-EXIT.
           EXIT.


       2-EOJ.
           CLOSE DTRANS-MC-I, DTRANS-OUT.
           DISPLAY "TOTAL RECORDS READ  ", RECS-READ.
           DISPLAY "TOTAL RECORDS WRITTEN  ", RECS-WRITTEN.

       2-EOJ-EXIT.
           EXIT.

       3-READ-DTRANS.
           READ DTRANS-MC-I NEXT INTO  BUF-DTRANS
              AT END MOVE HIGH-VALUES TO BUF-DTRANS.
           IF IN-STATUS EQUAL ZEROS
              ADD 1 TO RECS-READ
           ELSE IF BUF-DTRANS NOT EQUAL HIGH-VALUES
                MOVE "READ DTRANS * 3-READ" TO BU-DISPLAY-MSG
                PERFORM 10-BLOWUP THRU 10-BLOWUP-EXIT.

       3-READ-DTRANS-EXIT.
           EXIT.

       4-WRITE.
           WRITE DTRANS-OUT-REC FROM BUF-DTRANS.
           ADD 1 TO RECS-WRITTEN.

       4-WRITE-EXIT.
           EXIT.

       6-MAIN.
           IF TRANS-DOCUMENT-NUM EQUAL "PROC"
              NEXT SENTENCE
           ELSE
              PERFORM 4-WRITE THRU 4-WRITE-EXIT.
           PERFORM 3-READ-DTRANS THRU 3-READ-DTRANS-EXIT.

       6-MAIN-EXIT.
           EXIT.

