000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TMTDTRNS.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         JULY 9, 1985.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      DETAIL TRANSACTION DATA SET
001000*                      AND PRINT A REPORT OF ALL TRANSACTIONS
001100*                      BY MATERIAL CODE.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   04SEP1996    CA YODER
      *C     MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.      HP-3000.
001600 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
001800
001900 INPUT-OUTPUT SECTION.
002000 FILE-CONTROL.
           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

002500 DATA DIVISION.
002700 FILE SECTION.
002800
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

002900 FD  ONLINE-PRT
003000     DATA RECORD IS PRT-REC
003100     RECORD CONTAINS 133 CHARACTERS
003200     LABEL RECORDS ARE OMITTED.
003300
003400 01  PRT-REC                       PIC X(133).
003500
003600 SD  SORT-FILE
003700     DATA RECORD IS SORT-REC
003800     RECORD CONTAINS 106 CHARACTERS.
003900
004000 01  SORT-REC.
004100     05  SORT-CLASS               PIC X(4).
004200     05  SORT-MATL-CODE           PIC X(8).
004300     05  SORT-DEPT                PIC X(6).
004400     05  SORT-ACCT                PIC X(6).
004500     05  SORT-TRANS-CODE4.
               10  SORT-TRANS-CODE      PIC X(3).
               10  FILLER               PIC X.
004600     05  SORT-QTY                 PIC S9(10).
004700     05  SORT-VALUE               PIC S9(12)V99.
004800     05  SORT-ACT-VALUE           PIC S9(12)V99.
004900     05  SORT-PO-NUM.
005000         10  SORT-ORDER-NUM       PIC X(6).
005100         10  SORT-SUFFIX          PIC X.
005200         10  SORT-RELEASE         PIC X(3).
005300     05  SORT-RCVR-NUM            PIC X(4).
005400     05  SORT-ITEM-NUM            PIC X(4).
           05  SORT-DATE-CN.
               10  SORT-CC              PIC XX.
005500         10  SORT-DATE.
005600             15  SORT-YY          PIC XX.
005700             15  SORT-MM          PIC XX.
005800             15  SORT-DD          PIC XX.
005900     05  SORT-DOCUMENT-NUM        PIC X(12).
006000     05  SORT-UNIT-MEASURE        PIC XX.
006100
006500 WORKING-STORAGE SECTION.
006600
006700 77  NO-MORE-SORT                  PIC XXX       VALUE SPACES.
006800 77  LINE-CNT                      PIC 99        VALUE 0.
006900 77  PAGE-CNT                      PIC 9(4)      VALUE 0.
007000 77  PRINT-FILE-CTR                PIC 9(4)      VALUE 0.
007100 77  PREV-MATL-CODE                PIC X(8)      VALUE SPACES.
007200 77  SORT-SEQ                      PIC X         VALUE SPACES.
007300 77  PREV-CLASS                    PIC X(4)      VALUE SPACES.
007400 77  MATL-INV-QTY                  PIC S9(10)    VALUE 0.
007500 77  MATL-INV-VALUE                PIC S9(12)V99 VALUE 0.
007600 77  MATL-ACT-VALUE                PIC S9(12)V99 VALUE 0.
007700 77  MATL-VAR-VALUE                PIC S9(12)V99 VALUE 0.
007800 77  HOLD-VAR                      PIC S9(12)V99 VALUE 0.
007900 77  MATL-ISS-RET-QTY              PIC S9(12)V99 VALUE 0.
008000 77  MATL-ISS-RET-VALUE            PIC S9(12)V99 VALUE 0.
008100 77  MATL-ISS-RET-ACT              PIC S9(12)V99 VALUE 0.
008200 77  MATL-ISS-RET-VAR              PIC S9(12)V99 VALUE 0.
008300 77  SAVE-STR-DEPT                 PIC X(6)      VALUE SPACES.
       77  MCXCBLERR-SCOPE               PIC X(1)      VALUE "C".
008400
008500 01  MONTH-YEAR.
008600     05  MONTH-PARM                PIC 99   VALUE ZEROS.
008700     05  YEAR-PARM                 PIC 99   VALUE ZEROS.
008800
008900 01  MONTH-TABLE.
009000     05  FILLER                    PIC X(9) VALUE "JANUARY".
009100     05  FILLER                    PIC X(9) VALUE "FEBRUARY".
009200     05  FILLER                    PIC X(9) VALUE "MARCH".
009300     05  FILLER                    PIC X(9) VALUE "APRIL".
009400     05  FILLER                    PIC X(9) VALUE "MAY".
009500     05  FILLER                    PIC X(9) VALUE "JUNE".
009600     05  FILLER                    PIC X(9) VALUE "JULY".
009700     05  FILLER                    PIC X(9) VALUE "AUGUST".
009800     05  FILLER                    PIC X(9) VALUE "SEPTEMBER".
009900     05  FILLER                    PIC X(9) VALUE "OCTOBER".
010000     05  FILLER                    PIC X(9) VALUE "NOVEMBER".
010100     05  FILLER                    PIC X(9) VALUE "DECEMBER".
010200
010300 01  MONTH-TAB REDEFINES MONTH-TABLE.
010400     05  MONTH-T OCCURS 12 TIMES   PIC X(9).
010500
010700 COPY TDATECHK IN COPYLIB.
010800
010900************************************************************
011000**     REPORT PRINT LINES                                 **
011100************************************************************
011200
011300 01  HEADER1.
011400     05  FILLER                     PIC X(49)
011500         VALUE "TMTDTRNS".
011600     05  FILLER                     PIC X(69)
011700         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
011800     05  FILLER                     PIC X(5)   VALUE "DATE ".
011900     05  DATE-H1                    PIC X(8)   VALUE SPACES.
012000
012100 01  HEADER2.
012200     05  FILLER                     PIC X(6)   VALUE "PAGE".
012300     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
012400     05  FILLER                     PIC X(34)  VALUE SPACES.
012500     05  FILLER                     PIC X(31)
012600         VALUE "MONTH TO DATE TRANSACTIONS FOR ".
012700     05  MONTH-H2                   PIC X(9)   VALUE SPACES.
012800     05  FILLER                     PIC X(3)   VALUE SPACES.
012900     05  YEAR-H2A                   PIC X(2)   VALUE "20".
013000     05  YEAR-H2B                   PIC X(2)   VALUE SPACES.
013100     05  FILLER                     PIC X(27)  VALUE SPACES.
013200     05  FILLER                     PIC X(5)   VALUE "TIME ".
013300     05  TIME-H2                    PIC X(8)   VALUE SPACES.
013400
013500 01  HEADER4.
013600     05  FILLER                     PIC X(12)  VALUE "MATERIAL".
013700     05  FILLER                     PIC X(19)  VALUE "TRANS".
013800     05  FILLER                     PIC X(14)
013900         VALUE "TRANS/STD".
014000     05  FILLER                     PIC X(14)
014100         VALUE "RAW MATL".
014200     05  FILLER                     PIC X(09)
014300         VALUE "RAW MATL".
014400     05  FILLER                     PIC X(10)
014500         VALUE "RAW MATL".
014600     05  FILLER                     PIC X(07)
014700         VALUE "PO NUM".
014800     05  FILLER                     PIC X(23)
014900         VALUE "RCVR    ITEM UM ACCT   ".
015000     05  FILLER                     PIC X(16)
015100         VALUE "DEPT   DATE".
015200     05  FILLER                     PIC X(12)
015300         VALUE "REF #".
015400
015500 01  HEADER5.
015600     05  FILLER                     PIC X(19)
015700         VALUE "CODE        CODE".
015800     05  FILLER                     PIC X(28)
015900         VALUE "QUANTITY        VALUE".
016000     05  FILLER                     PIC X(90)
016100         VALUE "ACTUAL     VARIANCE    CHARGE".
016200
016300
016400 01  MATERIAL-HDG.
016500     05  FILLER                     PIC X(16)
016600          VALUE "MATERIAL CODE".
016700     05  MATL-DESCR-HDG             PIC X(80)    VALUE SPACES.
016800
016900 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
017000
017100 01  AST-LINE                       PIC X(133)    VALUE ALL "*".
017200
017300 01  DETAIL-LINE.
017400     05  PRT-CLASS                  PIC X(3)  VALUE SPACES.
017500     05  PRT-HYPHEN1                PIC X     VALUE SPACES.
017600     05  PRT-MATL-CODE              PIC X(7)  VALUE SPACES.
017700     05  FILLER                     PIC X     VALUE SPACES.
017800     05  PRT-TRANS                  PIC X(4)  VALUE SPACES.
017900     05  FILLER                     PIC X     VALUE SPACES.
018000     05  PRT-QTY                    PIC Z(10)-.
018100     05  FILLER                     PIC X      VALUE SPACES.
018200     05  PRT-VALUE                  PIC Z(08).ZZ-.
018300     05  FILLER                     PIC X      VALUE SPACES.
018400     05  PRT-ACT                    PIC Z(8).ZZ-.
018500     05  FILLER                     PIC X      VALUE SPACES.
018600     05  PRT-VAR                    PIC Z(8).ZZ-.
018700     05  FILLER                     PIC X      VALUE SPACES.
018800     05  PRT-VAR-EXP                PIC XXX    VALUE SPACES.
018900     05  PRT-HYPHEN                 PIC X      VALUE SPACES.
019000     05  PRT-VAR-DEPT               PIC X(4)   VALUE SPACES.
019100     05  FILLER                     PIC X      VALUE SPACES.
019200     05  PRT-PO                     PIC X(7)   VALUE SPACES.
019300     05  PRT-HYPHEN2                PIC X      VALUE SPACES.
019400     05  PRT-RELEASE                PIC XXX    VALUE SPACES.
019500     05  FILLER                     PIC X      VALUE SPACES.
019600     05  PRT-RCVR                   PIC XXX    VALUE SPACES.
019700     05  FILLER                     PIC X      VALUE SPACES.
019800     05  PRT-ITEM                   PIC X(4)   VALUE SPACES.
019900     05  FILLER                     PIC X      VALUE SPACES.
020000     05  PRT-UM                     PIC XX     VALUE SPACES.
020100     05  FILLER                     PIC X      VALUE SPACES.
020200     05  PRT-ACCT                   PIC X(6)   VALUE SPACES.
020300     05  FILLER                     PIC X      VALUE SPACES.
020400     05  PRT-DEPT                   PIC X(6)   VALUE SPACES.
020500     05  FILLER                     PIC X      VALUE SPACES.
020600     05  PRT-DATE                   PIC X(8)   VALUE SPACES.
020700     05  FILLER                     PIC X      VALUE SPACES.
020800     05  PRT-DOCUMENT               PIC X(08)  VALUE SPACES.
020900
021000 01  TOTAL-LINE.
021100     05  TOTAL-LITERAL             PIC X(17) VALUE SPACES.
021200     05  INV-QTY-PRT               PIC Z(10)-.
021300     05  FILLER                    PIC X   VALUE SPACES.
021400     05  INV-VALUE-PRT             PIC Z(8).ZZ-.
021500     05  FILLER                    PIC X  VALUE SPACES.
021600     05  INV-ACT-PRT               PIC Z(8).ZZ-.
021700     05  FILLER                    PIC X  VALUE SPACES.
021800     05  INV-VAR-PRT               PIC Z(8).ZZ-.
021900
022000************************************************************
022100**                                                        **
022200**           D A T A B A S E   B U F F E R S              **
022300**                                                        **
022400************************************************************
022500
022600 COPY MATLACUM IN COPYLIB.
022700
022800 COPY DTRANS IN COPYLIB.
022900
023000 COPY MSTORERM IN COPYLIB.
023100
023200 COPY MACTINFO IN COPYLIB.
023300
023400**********************************************************
023500*              D A T A    B A S E                        *
023600**********************************************************
023700
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1) VALUE "0".
           05  FILE-STATUS-2    PIC X(1) VALUE "0".

023800 COPY DBCSACCT IN COPYLIB.
023900
024000 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
024100 01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".
024200
024300 COPY DBMODES IN COPYLIB.
024400
024500 COPY DBSTAT IN COPYLIB.
024600
024700 01  DATASET-NAMES.
024800     05  DSET-MMATL-ACCUM  PIC X(16)  VALUE "MMATL-ACCUM;".
024900     05  DSET-DTRANS       PIC X(16)  VALUE "DTRANS;".
025000     05  DSET-MSTORERM     PIC X(16)  VALUE "MSTORERM;".
025100     05  DSET-MACCT        PIC X(16)  VALUE "MACCOUNT-INFO;".
025200
025300 01  ITEMS-LISTING.
025400     05  ALL-ITEMS         PIC X(2)   VALUE "@;".
025500
025600 01  IMAGE-ARGS.
025700     05  MATL-CODE-ARG    PIC X(8)   VALUE SPACES.
025800     05  MACCT-KEY         PIC X(4)  VALUE SPACES.
025900
026000******************************************************
026100**   PARAMETERS FOR CALLING 'CDESC'
026200******************************************************
026300
026400 COPY CDESC IN COPYLIB.
026500
026600 01  RET-CODE                     PIC X(2)   VALUE SPACES.
026700
026800****************************************************
026900**   PARAMETERS FOR CALLING 'SVARDEPT'
027000****************************************************
027100
027200 COPY SVARDEPT IN COPYLIB.
027400
027500******************************************
027600**   PARAMETERS FOR CALLING 'CBLOWSRT'
027700******************************************
027800
027900 COPY CBLOWSRT IN COPYLIB.
028000
028100 COPY TBLOWUP IN COPYLIB.
028300
028400 PROCEDURE DIVISION.
028500
028600 001-BEGIN SECTION.
028700
028800 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

028900*******************************************************
029000**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
029100**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
029200**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
029300**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
029400**   OCCURS
029500*******************************************************
029600
029700     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
029800                           ACCTG-BASE,
029900                           BU-PGM-NAME,
030000                           STATUS-AREA,
030100                           DUMMY-VIEW-AREA,
030200                           FILE-STATUS,
030300                           BU-DISPLAY-MSG,
030400                           BU-DISPLAY-FLDS.
030500
030600     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
030700                                     SORT-MATL-CODE
030800                                     SORT-DATE-CN
030900         INPUT PROCEDURE IS 050-PROCESS-TRANS
031000         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
031100     PERFORM 1000-CLOSE-FILES.
031200     GOBACK.
031300
031500 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
031600     PERFORM 100-BEGIN.
031700     PERFORM 200-PROCESS-DETAIL
031800         UNTIL END-OF-FILE.
031900
032000**********************************************************
032100*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
032200*  FOR SORTING OF RECORDS.                               *
032300**********************************************************
032400
032500     GO TO 699-PROCESS-EXIT.
032600
032700 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
034700
034800     MOVE SPACES                  TO SVARDEPT-PARMS.
034900     CALL "SVARDEPT" USING ACCTG-BASE,
035000                           SVARDEPT-PARMS,
035100                           STATUS-AREA,
035200                           BU-DISPLAY-MSG,
035300                           BU-DISPLAY-FLDS.
035400     IF BU-DISPLAY-MSG NOT = SPACES
035500         PERFORM 990-BLOWUP.
035600
035700****************************************************
035800**   GET STOREROOM DEPT FROM MACCOUNT-INFO        **
035900**   KEY IS EQUAL TO 'SDPT'.  THE STOREROOM DEPT. **
036000**   IS USED WHEN PROCESSING RECEIVING AND        **
036100**   RECEIPT INTO STOREROOM TCs (323, 324, 325)   **
036200****************************************************
036300
036400     MOVE "SDPT"                  TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
037200     IF GOOD-CALL
037300         MOVE MACCT-STR-DEPT      TO  SAVE-STR-DEPT
037400     ELSE
037500         MOVE "GET MACCOUNT-INFO 'SDPT'* 100-B"
037600               TO BU-DISPLAY-MSG
037700         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (1)
037800         PERFORM 990-BLOWUP.
037900
038000     MOVE "MY"                    TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
038800     IF GOOD-CALL
038900         MOVE MACCT-MONTH         TO MONTH-PARM
039000         MOVE MACCT-YEAR          TO YEAR-PARM
039100     ELSE
039200         MOVE "GET MACCOUNT-INFO MY* 100-B" TO BU-DISPLAY-MSG
039300         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
039400         PERFORM 990-BLOWUP.
039500
039600     MOVE SPACES                  TO SORT-REC.
039700     MOVE 0                       TO SORT-VALUE
039800                                     SORT-QTY.
           PERFORM 9999-INIT-DTRANS-MC-I.
039900     PERFORM 400-GET-DTRANS.
040000
040200 200-PROCESS-DETAIL.
040300     IF TRANS-DOCUMENT-NUM = "PROC"
040400         NEXT SENTENCE
040500     ELSE
040600         PERFORM 600-BUILD-SORT-REC.
040700     PERFORM 400-GET-DTRANS.
040800
040900 400-GET-DTRANS.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
041700     IF GOOD-CALL
041800         NEXT SENTENCE
041900     ELSE
042000         IF END-OF-FILE
042100             NEXT SENTENCE
042200         ELSE
042300             MOVE "DBGET DTRANS * 400-GD" TO BU-DISPLAY-MSG
042400             PERFORM 990-BLOWUP.
042500
042600
042700 600-BUILD-SORT-REC.
042800     MOVE TRANS-STORES-CODE       TO SORT-MATL-CODE
042900                                     MATL-CODE-ARG.
043000     MOVE TRANS-CLASS             TO SORT-CLASS.
043100     MOVE TRANS-DEPT              TO SORT-DEPT.
043200     MOVE TRANS-ACCT              TO SORT-ACCT.
043300     MOVE TRANS-PO-NUM            TO SORT-PO-NUM.
043400     MOVE TRANS-RCVR-NUM          TO SORT-RCVR-NUM
043500     MOVE TRANS-ITEM-NUM          TO SORT-ITEM-NUM.
043600     MOVE TRANS-CODE              TO SORT-TRANS-CODE4.
043700     MOVE TRANS-DATE-CN           TO SORT-DATE-CN.
043800     MOVE TRANS-DOCUMENT-NUM      TO SORT-DOCUMENT-NUM.
043900     MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEASURE.
044000     MOVE TRANS-QTY               TO SORT-QTY.
044100     MOVE TRANS-VALUE             TO SORT-VALUE.
044200
044300****************************************************
044400**   IF RAW MATERIAL CALCULATE ACTUAL COST USING
044500**   AVG. COST SINCE THE TRANS-VALUE IS IN TERMS
044600**   OF STD. COST
044700****************************************************
044800     IF TRANS-CLASS > 099 AND TRANS-CLASS < 200 OR
044900        TRANS-CLASS > 399 AND TRANS-CLASS < 500
045000         PERFORM 650-GET-MSTORERM
045100         COMPUTE SORT-ACT-VALUE = TRANS-QTY *
045200                                  STR-AVG-COST
045300     ELSE
045400         MOVE 0                   TO SORT-ACT-VALUE.
045500     RELEASE SORT-REC.
045600     MOVE SPACES                  TO SORT-REC.
045700     MOVE 0                       TO SORT-QTY
045800                                     SORT-ACT-VALUE
045900                                     SORT-VALUE.
046000
046100 650-GET-MSTORERM.
           PERFORM 9999-DBGET7-MSTORERM-CD-I.
046900     IF GOOD-CALL
047000         NEXT SENTENCE
047100     ELSE
047200         IF NO-ENTRY
047300             MOVE 0               TO STR-AVG-COST
047400         ELSE
047500             MOVE "DBGET MSTORERM * 650-GM" TO BU-DISPLAY-MSG
047600             MOVE MATL-CODE-ARG TO BU-DISPLAY-FLD (1)
047700             PERFORM 990-BLOWUP.
047800
047900
048000 699-PROCESS-EXIT.
048100     EXIT.
048200
048300
048400 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
048500     DISPLAY "BEGIN REPORT".
048600     PERFORM 710-BEGIN-REPORT.
048700     PERFORM 720-PROCESS-MATL-CODE
048800         UNTIL NO-MORE-SORT = "YES".
048900
049000**************************************************
049100**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
049200**  TO COMPLETE PROCESSING OF REPORT            **
049300**************************************************
049400
049500     GO TO 799-CREATE-EXIT.
049600
049700 710-BEGIN-REPORT.
049800     OPEN OUTPUT ONLINE-PRT.
049900     RETURN SORT-FILE
050000        AT END
050100            MOVE "YES" TO NO-MORE-SORT.
050200     MOVE SPACES                  TO TOTAL-LINE.
050300     PERFORM 750-PRINT-HEADINGS.
050400
050500 720-PROCESS-MATL-CODE.
050600     PERFORM 721-BEGIN-MATL-CODE.
050700     PERFORM 722-PROCESS-TRANS
050800         UNTIL SORT-MATL-CODE NOT = PREV-MATL-CODE
050900                OR SORT-CLASS NOT = PREV-CLASS
051000                OR NO-MORE-SORT = "YES".
051100     PERFORM 723-END-MATL-CODE.
051200
051300 721-BEGIN-MATL-CODE.
051400     MOVE SORT-CLASS              TO PREV-CLASS.
051500     MOVE SORT-MATL-CODE          TO PREV-MATL-CODE.
051600     MOVE 0                       TO MATL-INV-QTY
051700                                     MATL-INV-VALUE
051800                                     MATL-ACT-VALUE
051900                                     MATL-VAR-VALUE
052000                                     MATL-ISS-RET-QTY
052100                                     MATL-ISS-RET-VALUE
052200                                     MATL-ISS-RET-ACT
052300                                     MATL-ISS-RET-VAR.
052400     IF SORT-MATL-CODE = "NON-STR"
052500         MOVE "NON-STOREROOM ITEM" TO MATL-DESCR-HDG
052600     ELSE
052700         MOVE 1                   TO CDESC-LINES-TO-GET
052800         MOVE "N"                 TO CDESC-LOCAL-DESC-OPTION
052900         CALL "CDESC"  USING RET-CODE, STORES-BASE, STATUS-AREA,
053000             BU-DISPLAY-MSG, SORT-MATL-CODE, CDESC-DATA
053100         MOVE CDESC (1)           TO MATL-DESCR-HDG.
053200     PERFORM 751-PRINT-HEADINGS.
053300
053400
053500 722-PROCESS-TRANS.
053600     MOVE SORT-TRANS-CODE4        TO PRT-TRANS.
053700     MOVE SORT-CLASS              TO PRT-CLASS.
053800     MOVE "-"                     TO PRT-HYPHEN1.
053900     MOVE SORT-MATL-CODE          TO PRT-MATL-CODE.
054000     MOVE SORT-QTY                TO PRT-QTY.
054100     MOVE SORT-VALUE              TO PRT-VALUE.
054200
054300**************************************************
054400**   IF RAW MATERIAL CODE CALCULATE VARIANCE AND
054500**   AND GET APPROPRIATE VARIANCE DEPT. BY
054600**   CALLING 'SVARDEPT'.
054700**************************************************
054800     IF SORT-TRANS-CODE = "ISS" OR "RET"
054900         IF SORT-CLASS > 099 AND SORT-CLASS < 200  OR
055000            SORT-CLASS > 399 AND SORT-CLASS < 500
055100               MOVE SORT-ACT-VALUE TO PRT-ACT
055200               COMPUTE HOLD-VAR = SORT-VALUE - SORT-ACT-VALUE
055300               MOVE HOLD-VAR      TO PRT-VAR.
055400
055500     IF SORT-TRANS-CODE = "ISS" OR "RET"
055600         IF SORT-CLASS > 099 AND SORT-CLASS < 200  OR
055700            SORT-CLASS > 399 AND SORT-CLASS < 500
055800             MOVE "904"           TO PRT-VAR-EXP
055900             MOVE "-"             TO PRT-HYPHEN
056000             MOVE SORT-CLASS      TO SVARDEPT-MATL-CLASS
056100             CALL "SVARDEPT" USING ACCTG-BASE,
056200                                   SVARDEPT-PARMS,
056300                                   STATUS-AREA,
056400                                   BU-DISPLAY-MSG,
056500                                   BU-DISPLAY-FLDS
056600             IF BU-DISPLAY-MSG NOT = SPACES
056700                 PERFORM 990-BLOWUP
056800             ELSE
056900                 MOVE SVARDEPT-DEPT-CLASS-VAR TO PRT-VAR-DEPT.
057000
057100     IF SORT-TRANS-CODE = "INV"
057200         IF SORT-DEPT = SAVE-STR-DEPT
057300             ADD SORT-QTY         TO MATL-INV-QTY
057400             ADD SORT-VALUE       TO MATL-INV-VALUE.
057500
057600     IF SORT-TRANS-CODE = "ISS"
057700         ADD SORT-QTY             TO MATL-ISS-RET-QTY
057800         ADD SORT-VALUE           TO MATL-ISS-RET-VALUE
057900         ADD SORT-ACT-VALUE       TO MATL-ISS-RET-ACT
058000         ADD HOLD-VAR             TO MATL-ISS-RET-VAR
058100     ELSE
058200         IF SORT-TRANS-CODE = "RET"
058300             SUBTRACT SORT-QTY    FROM MATL-ISS-RET-QTY
058400             SUBTRACT SORT-VALUE  FROM MATL-ISS-RET-VALUE
058500             SUBTRACT SORT-ACT-VALUE FROM MATL-ISS-RET-ACT
058600             SUBTRACT HOLD-VAR    FROM MATL-ISS-RET-VAR.
058700     MOVE SORT-ORDER-NUM          TO PRT-PO.
058800     IF SORT-ORDER-NUM NOT = SPACES
058900         MOVE "-"                 TO PRT-HYPHEN2
059000     ELSE
059100         MOVE SPACES              TO PRT-HYPHEN2.
059200     MOVE SORT-RELEASE            TO PRT-RELEASE.
059300     MOVE SORT-RCVR-NUM           TO PRT-RCVR.
059400     MOVE SORT-ITEM-NUM           TO PRT-ITEM.
059500     MOVE SORT-UNIT-MEASURE       TO PRT-UM.
059600     MOVE SORT-ACCT               TO PRT-ACCT.
059700     MOVE SORT-DEPT               TO PRT-DEPT.
059800     MOVE 4                       TO DATE-MODE.
059900     MOVE SORT-DATE               TO DATE-VALIDATE-IN.
060000     CALL "TDATECHK" USING DATE-CHECK-AREA.
060100     MOVE DATE-SLASH-OUT          TO PRT-DATE.
060200     MOVE SORT-DOCUMENT-NUM       TO PRT-DOCUMENT.
060300     WRITE PRT-REC FROM DETAIL-LINE AFTER 1.
060400     ADD 1                        TO LINE-CNT.
060500     MOVE SPACES                  TO PRT-REC
060600                                     DETAIL-LINE.
060700     MOVE ZERO                    TO HOLD-VAR.
060800
060900     RETURN SORT-FILE
061000        AT END
061100             MOVE "YES" TO NO-MORE-SORT.
061200
061300     IF LINE-CNT > 55
061400         IF SORT-MATL-CODE NOT = PREV-MATL-CODE
061500             NEXT SENTENCE
061600         ELSE
061700             PERFORM 750-PRINT-HEADINGS
061800             MOVE SPACES          TO PRT-REC
061900             WRITE PRT-REC AFTER 1
062000             ADD 1                TO LINE-CNT.
062100
062200 723-END-MATL-CODE.
062300     MOVE "INVOICE TOTALS"        TO TOTAL-LITERAL.
062400     MOVE MATL-INV-QTY            TO INV-QTY-PRT.
062500     MOVE MATL-INV-VALUE          TO INV-VALUE-PRT.
062600     MOVE 0                       TO MATL-INV-QTY
062700                                     MATL-INV-VALUE.
062800     WRITE PRT-REC FROM TOTAL-LINE AFTER 2.
062900     MOVE SPACES                  TO PRT-REC
063000                                     TOTAL-LINE.
063100     MOVE "PRIOR MTH END BAL"     TO TOTAL-LITERAL.
063200     PERFORM 760-GET-MMATL-ACCUM.
063300     MOVE MATL-BEG-BAL-DOLLARS    TO INV-VALUE-PRT.
063400     MOVE MATL-BEG-BAL-UNITS      TO INV-QTY-PRT.
063500     WRITE PRT-REC FROM TOTAL-LINE AFTER 1.
063600     MOVE SPACES                  TO PRT-REC
063700                                     TOTAL-LINE.
063800     MOVE MATL-ISS-RET-QTY        TO INV-QTY-PRT.
063900     MOVE MATL-ISS-RET-VALUE      TO INV-VALUE-PRT.
064000     MOVE MATL-ISS-RET-ACT        TO INV-ACT-PRT.
064100     MOVE MATL-ISS-RET-VAR        TO INV-VAR-PRT.
064200     MOVE "ISSUE/RETURN TOT"      TO TOTAL-LITERAL.
064300     WRITE PRT-REC FROM TOTAL-LINE AFTER 1.
064400     MOVE SPACES                  TO PRT-REC
064500                                     TOTAL-LINE.
064600     ADD 4                        TO LINE-CNT.
064700     IF LINE-CNT > 52
064800         PERFORM 750-PRINT-HEADINGS.
064900
065000
065100 750-PRINT-HEADINGS.
065200*************************************************
065300**   IF PRINT-FILE-CTR > 100 THEN CLOSE AND
065400**   REOPEN THE PRINT FILE SO WE DONT GET INTO
065500**   SPOOLFILE SIZE PROBLEMS.
065600*************************************************
065700     ADD 1                        TO PRINT-FILE-CTR.
065800     IF PRINT-FILE-CTR > 100
065900         MOVE ZEROS               TO PRINT-FILE-CTR
066000         CLOSE ONLINE-PRT
066100         OPEN OUTPUT ONLINE-PRT.
066200
066300     MOVE 1                       TO DATE-MODE.
066400     CALL "TDATECHK" USING DATE-CHECK-AREA.
066500     MOVE DATE-SLASH-OUT          TO DATE-H1.
066600     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
066700     MOVE MONTH-T (MONTH-PARM)    TO MONTH-H2.
066800     MOVE YEAR-PARM               TO YEAR-H2B.
066900     ADD 1                        TO PAGE-CNT.
067000     MOVE PAGE-CNT                TO PAGE-H2.
067100     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
067200     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
067300     MOVE 2                       TO LINE-CNT.
067400
067500 751-PRINT-HEADINGS.
067600     WRITE PRT-REC FROM AST-LINE AFTER ADVANCING 1 LINES.
067700     WRITE PRT-REC FROM MATERIAL-HDG  AFTER ADVANCING 2 LINES.
067800     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2 LINES.
067900     WRITE PRT-REC FROM HEADER5 AFTER ADVANCING 1 LINES.
068000     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1 LINES.
068100     ADD 7                        TO LINE-CNT.
068200
068300
068400 760-GET-MMATL-ACCUM.
068500     MOVE PREV-MATL-CODE          TO MATL-CODE-ARG.
           PERFORM 9999-DBGET7-MMATL-ACCUM-MC-I.
069300     IF GOOD-CALL
069400         NEXT SENTENCE
069500     ELSE
069600         MOVE "DBGET MMATL-ACCUM * 760-GMA" TO BU-DISPLAY-MSG
069700         MOVE MATL-CODE-ARG TO BU-DISPLAY-FLD (1)
069800         PERFORM 990-BLOWUP.
069900
070000
070100 799-CREATE-EXIT.
070200     EXIT.
070300
070400 900-ERROR SECTION.
070500
070600 990-BLOWUP.
070700
070800***************************************************************
070900**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
071000**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
071100**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
071200**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
071300**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
071400**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
071500**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
071600**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
071700**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
071800**   PROBLEM IS AVOIDED.                                     **
071900***************************************************************
072000
072100     MOVE "TMTDTRNS"              TO  BU-PGM-NAME.
072200     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
072300                           ACCTG-BASE,
072400                           BU-PGM-NAME,
072500                           STATUS-AREA,
072600                           DUMMY-VIEW-AREA,
072700                           FILE-STATUS,
072800                           BU-DISPLAY-MSG,
072900                           BU-DISPLAY-FLDS.
073000
073100
073200
073300
073400
073500 1000-CLOSE-FILES.
073600     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           READ MMATL-ACCUM-MC-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MMATL-ACCUM-MC-I     .

       9999-CLOSE-STUFF.
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      DTRANS-MC-I          .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MMATL-ACCUM-MC-I     .
