000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TMTSTEXC.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        9/1/83.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     EXECUTIVE PROGRAM (MAIN PROGRAM) FOR MATERIAL STATUS
001000*             SUB-PROGRAM.
001100*
001200*    ON AUGUST 23, 1984, CHANGED THIS PROGRAM TO ALLOW AN INQUIRY
001300*    BY AN "ALTERNATE KEY".  WHEN THE CORPORATE CODE IS ENTERED
001400*    ON THE FIRST SCREEN, THIS PGM NOW CALLS THE SUBPROGRAM
001500*    "TALTKEY", WHICH INQUIRES AGAINST A NEW DATASET "MALTKEY".
001600*    "MALTKEY" HAS A 40-BYTE KEY ASSOCIATED WITH A CORP-CODE.
001700*    "TALTKEY" CHECKS TO SEE IF AN ALTERNATE KEY WAS ENTERED
001800*    (SUCH AS "ADAMAX" FOR 2610211), AND IF SO RETURNS THE
001900*    ACTUAL CORPORATE CODE TO THIS PGM.  THE PROGRAM THEN CONTINUES
002000*    ON AS NORMAL. FOR MULTIPLE DATABASE SITUATIONS AS IN AKRON,
002100*    ONLY ALTERNATE KEYS IN THE "HOME" DATABASE WILL BE
002200*    RECOGNIZED.   ALSO ADDED THE FORMS CACHE ABILITY TO THE
002300*    PROGRAM BY CALLING THE SUBPROGRAM "TTERMTYP".  CIH.
002400*
002500*    ON JANUARY 21, 1985, ADDED A DUMMY PARAMETER TO THE CALL
002600*    OF THE SUBPROGRAM "TMTLSTAT" - MATERIAL STATUS INQUIRY.
002700*    THIS IS A DUMMY CORPORATE CODE PARAMETER - USED BY PROGRAMS
002800*    THAT MAY PASS THE CORP CODE TO THE INQUIRY, THUS BYPASSING
002900*    THE CORPORATE CODE ENTRY SCREEN.  IF THE PASSED CODE IS SPACES,
003000*    THE CODE ENTRY SCREEN IS BROUGHT, AND THE CODE PARAMETER IS
003100*    IGNORED.  CIH.
003200*
003300*   10/ 8/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND *
003400*             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE     *
003500*             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND *
003600*             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.    *
003700*             CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,*
003800*             TDATECHK TO TDATECK2.                          *
003900*             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE    *
004000*             SUPPORT VERSIONS OF THESE SUBROUTINES.         *
004100*                                        PD RAGLOW.          *
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
004200**************************************************************
004300
004600 ENVIRONMENT DIVISION.
004700 CONFIGURATION SECTION.
004800 SOURCE-COMPUTER.  HP-3000.
004900 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

005100 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

005200 WORKING-STORAGE SECTION.
005300
005400 77  PASSED-SPOOL-PRT          PIC S9(2)  VALUE ZEROS COMP-4.
       77  MCXCBLERR-SCOPE           PIC X(1)   VALUE "C".
005500
005600*************************************************************
005700**                                                          **
005800**          C O M M U N I C A T I O N S   A R E A S         **
005900**                                                          **
006000**************************************************************
006100
006200 COPY TBLOWUP    IN COPYLIB.
006300 COPY CSWITCHF   IN COPYLIB.
006400
006500*---------- PARMS FOR CALL TO "WHO" INTRINSIC
006600
006700 01  WHO-VARIABLES.
006800     05  MOD                      PIC S9(4) COMP-4.
006900     05  CAP                      PIC S9(8) COMP-4.
007000     05  LATTR                    PIC S9(8) COMP-4.
007100     05  USERNAME                 PIC X(8).
007200     05  GRPNAME                  PIC X(8).
007300     05  ACCTNAME                 PIC X(8).
007400     05  HOMEGRP                  PIC X(8).
007500     05  TNUM                     PIC 99 COMP-4.
007600     05  FILLER                   PIC XX.
007700
007800*---------- PARMS FOR CALL TO "TMTLSTAT"
007900 01  PASSED-CODE                   PIC X(7) VALUE SPACES.
008000
008100**************************************************************
008200**                                                          **
008300**                  V I E W   W O R K                       **
008400**                                                          **
008500**************************************************************
008600
008700 COPY VCOMAREA   IN COPYLIB.
008800
008900 01  FORMFILE.
009000     05  FORM-FNAME                PIC X(8)  VALUE "FCSISINQ".
009100     05  FILLER                    PIC X     VALUE ".".
009200     05  FORM-GNAME.
009300         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009400         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009500     05  FILLER                    PIC X(19) VALUE SPACES.
009600
009700 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76      COMP-4.
009800
009900 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO    COMP-4.
010000
010100 01  MESSAGE-BUFFER.
010200     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
010300     05  MSG-FLD               PIC X(8)     VALUE SPACE.
010400     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
010500
010600*---------- WORK AREAS FOR HANDLING VIEW COMMUNICATIONS ERRORS
010700*01  ESC-RESET-TERM.
010800*    05  FILLER                    PIC X(1)  VALUE %33.
010900*    05  FILLER                    PIC X(1)  VALUE "g".
011000*01  VERR-COUNT                    PIC S9(4) COMP-4 VALUE 0.
011100*
011200**************************************************************
011300**                                                          **
011400**            D A T A B A S E   W O R K                     **
011500**                                                          **
011600**************************************************************
011700
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

011800 01  BASE                       PIC X(20) VALUE "  STORES;".
011900 01  PASSWORD                   PIC X(5)  VALUE "JADE;".

012000 COPY DBSTAT     IN COPYLIB.
012100
012200 01  DSET-NAMES.
012300     05  DSET-DUMMY             PIC X(2)  VALUE SPACES.
012400     05  DSET-MPLTINFO          PIC X(16) VALUE "MPLTINFO;".
012500
012600 01  MODE-AREA.
012700     05  MODE1                  PIC S9(4) COMP-4 VALUE 1.
012800     05  MODE7                  PIC S9(4) COMP-4 VALUE 7.
012900
013000 01  ALL-ITEMS                  PIC X(2)  VALUE "@;".
013100 01  PLT-ARG                    PIC X(4)  VALUE "P 01".
013200
013300**************************************************************
013400**                                                          **
013500**           D A T A B A S E   B U F F E R S                **
013600**                                                          **
013700**************************************************************
013800
013900 COPY MPLT0     IN COPYLIB.
014000 COPY MPLTP01   IN COPYLIB.
014100
014200**************************************
014300*                                    *
014400*    NATIVE LANGUAGE SUPPORT AREA    *
014500*                                    *
014600**************************************
014700
014800 COPY LANGUAGE   IN COPYLIB.
014900
015000 PROCEDURE DIVISION.
015100 1-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN INPUT MPLTINFO.
015200*
015300*    CALL "WHO" USING MOD CAP LATTR
015400*          USERNAME GRPNAME ACCTNAME HOMEGRP TNUM.
015500*
015600*    CALL "DBOPEN" USING BASE, PASSWORD, MODE1, STATUS-AREA.
015700*    IF COND-WORD NOT = 0
015800*        MOVE "DBOPEN ERROR" TO BU-DISPLAY-MSG
015900*        GO TO 2100-BLOWUP.
016000*
016100*    CALL "FINDJCW" USING LANG-JCW-NAME, LANG-JCW-VALUE          ,
016200*                               LANG-JCW-STATUS.
016300*    IF LANG-JCW-STATUS NOT = 0
016400*        MOVE 1 TO LANG-JCW-VALUE.
016600*    CALL "NLAPPEND" USING FORM-GNAME, LANG-JCW-VALUE,
016700*         LANG-ERROR.
016800*    IF LANG-ERROR1 NOT = 0
016900*        MOVE "001" TO FORM-GNAME2.
017000*
017100*    MOVE FORM-GNAME2 TO LANG-ERCAT-FNAME2, LANG-ERCAT-GNAME2.
017200*
017300*    CALL INTRINSIC "CATOPEN" USING LANG-ERCAT, LANG-ERROR,
017400*        GIVING LANG-INDEX.
017500*    IF LANG-ERROR1 NOT = 0
017600*        MOVE "CATOPEN FAILED * TMTSTEXC" TO BU-DISPLAY-MSG
017700*        GO TO 2100-BLOWUP.
017800*
017900*------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
018000     MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
018100     PERFORM 7150-CALL-CSWITCHF.
018200
018300*------- HANDLE POSSIBLE VIEW ERRORS ON OPENTERM
018400*1020-OPENTERM.
018500*    CALL "VOPENTERM" USING VIEW-COMAREA, TERMFILENAME.
018600*    IF VIEW-STATUS NOT = 0
018700*        IF VERR-COUNT > 6
018800*            MOVE "7 ERRORS IN VOPENTERM 1020-O" TO BU-DISPLAY-MSG
018900*            PERFORM 2100-BLOWUP
019000*        ELSE
019100*            ADD 1                 TO   VERR-COUNT
019200*            DISPLAY ESC-RESET-TERM
019300*            MOVE 0                TO   VIEW-STATUS
019400*            GO TO 1020-OPENTERM.
019500*
019600*    CALL "DBGET" USING BASE DSET-MPLTINFO MODE7 STATUS-AREA
019700*      ALL-ITEMS BUF-MPLTINFO PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
019800     IF COND-WORD NOT = 0
019900         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
020000         GO TO 2100-BLOWUP.
020100
020200     IF HOMEGRP = "MIXCTR  "
020300         MOVE "11M"     TO  MPLTINFO-COMPANY.
020400
020500     CALL "TMTLSTAT" USING BASE, VIEW-COMAREA, MPLTINFO-COMPANY,
020600       PASSED-SPOOL-PRT, PASSED-CODE, LANGUAGE-PARMS.
020700
020800 1-EOJ.
020900*    CALL INTRINSIC "CATCLOSE" USING LANG-INDEX, LANG-ERROR.
021000*    CALL "VCLOSETERM" USING VIEW-COMAREA.
021100*    CALL "VCLOSEFORMF" USING VIEW-COMAREA.
021200*    CALL "DBCLOSE" USING BASE, DSET-DUMMY, MODE1,
021300*        STATUS-AREA.
           CLOSE MPLTINFO.
021400     GOBACK.
021500
021600 2100-BLOWUP.
021700     MOVE "TMTSTEXC"               TO   BU-PGM-NAME.
021800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
021900       VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
022000       BU-DISPLAY-FLDS.
022100
022200 7150-CALL-CSWITCHF.
022300     CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
022400       FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
022500     IF BU-DISPLAY-MSG-1 NOT = SPACES
022600         PERFORM 2100-BLOWUP.
