       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TMZONEP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

      *C****************************************************************
      *C*  02/03/97  WDR
      *C*  RE-WROTE ENTIRE PROGRAM TO MAKE MORE USER-FRIENDLY.
      *C****************************************************************

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-ZONE-PRTY
                  ASSIGN       TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZMASTER-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-EQUIPMENT
           LABEL RECORDS ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  WO-ZONE-PRTY
           LABEL RECORDS ARE STANDARD.
       01  ZNP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  MSG-SW              PIC  X(01).
       77  MSG-BUFFER          PIC  X(76).
       77  MESSAGE-BUFFER      PIC  X(76) VALUE SPACE.
       77  ZNP-KEY             PIC  X(06).
       77  RECNO               PIC  9999   VALUE 0.
       77  DISP-CNTR           PIC  99     VALUE 0.
       77  SEARCH-FLAG         PIC  X.
       77  TRUE-VAL            PIC  1      VALUE B"1".
       77  NEG-VAL             PIC  1      VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMZONEP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " K0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "MAINTENANCE OF ZONE/PRIORITY FILE IN THE MMIS DATABASE. ".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC  X VALUE "0".
           05  FILE-STAT-2     PIC  X VALUE "0".

       01  SCREEN-MENU.
           05  ZNUM-ADD.
               10  MAZONE      PIC  X(04).
               10  MAPRTY      PIC  X(01).
           05  ZNUM-DEL.
               10  MDZONE      PIC  X(04).
               10  MDPRTY      PIC  X(01).
           05  MSGFLDM         PIC  X(76).
           05  CMDMSGM         PIC  X(79).
           05  ERRMSGM         PIC  X(79).

       01  SCREEN-ADD.
           05  ADD-SCREEN.
               10  AZONE       PIC  X(04).
               10  APRTY       PIC  X(01).
           05  CMDMSGA         PIC  X(79).
           05  ERRMSGA         PIC  X(79).

       01  SCREEN-DELETE.
           05  DEL-SCREEN.
               10  DZONE       PIC  X(04).
               10  DPRTY       PIC  X(01).
           05  CMDMSGD         PIC  X(79).
           05  ERRMSGD         PIC  X(79).

       01  SCREEN-DISPLAY.
           05  SZONE           PIC  X(04).
           05  SPRTY           PIC  X(02).

       01  SCREEN-MSG.
           05  MSG1            PIC  X(19) VALUE "THE ZONE/PRIORITY '".
           05  MSG2            PIC  X(11) VALUE "' HAS BEEN ".
           05  MSG3            PIC  X(24)
                               VALUE "YOUR ZONE/PRIORITY FILE.".
           05  MSGA            PIC  X(09) VALUE "ADDED TO ".
           05  MSGD            PIC  X(13) VALUE "DELETED FROM ".

       01  ZONE-ARGUMENT.
           05  Z-ARG           PIC X(04).
           05  FILLER          PIC XX   VALUE "1 ".

           COPY SCREENIO       IN COPYLIB.

       01  EQUIPMENT-DATA.
           COPY MEQPFILE       IN COPYLIB.

       01  ZONE-DATA.
           COPY MZONPRTY       IN COPYLIB.

       PROCEDURE DIVISION.
       OPEN-PARAGRAPH.
           MOVE SPACE          TO MSG-SW.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            WO-ZONE-PRTY.
           OPEN INPUT          EQP-EQUIPMENT.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

      *C****************************************************************
      *-- DISPLAY MAIN MENU/INPUT SCREEN (OR HELP/INPUT SCREEN)
      *C****************************************************************

       SETUP-MENU-SCREEN.
           MOVE SPACES         TO SCREEN-MENU
                                  SCREEN-ADD
                                  SCREEN-DELETE.

           MOVE "ZNPMENU"      TO SCREEN-NAME.

       SHOW-MENU-SCREEN.
           IF MSG-SW NOT = SPACE
               MOVE SPACE      TO MSG-SW
               MOVE MSG-BUFFER TO MSGFLDM
           ELSE
               MOVE SPACES     TO MSGFLDM.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SCREEN-MENU   TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-MENU.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 9
               GO TO SETUP-MENU-SCREEN.

           IF KEY-HIT = 1 OR 2 OR 4 OR 5 OR 6 OR 7
               GO TO READ-SCREEN-CONT.

      *C****************************************************************
      *-- DETERMINE IF ONLY ONE FIELD IS FILLED AND SET FUNCTION KEY
      *-- SO 'ENTER' KEY WILL FUNCTION FOR THAT FIELD ONLY.
      *C****************************************************************

           MOVE  0             TO DISP-CNTR.
           IF ZNUM-ADD NOT = SPACES
               ADD 1           TO DISP-CNTR.

           IF ZNUM-DEL NOT = SPACES
               ADD 3           TO DISP-CNTR.

      *C****************************************************************
      *-- IF MORE THAN ONE FIELD IS FILLED, DISPLAY ERROR DESIGNATING
      *-- THAT USER PRESS THE DESIRED FUNCTION KEY.
      *C****************************************************************

           IF DISP-CNTR = 1 OR 3
               NEXT SENTENCE
           ELSE
      *M****************************************************************
      *M  PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      *M****************************************************************
               MOVE "PRESS APPROPRIATE FUNCTION KEY TO CONTINUE"
                               TO ERRMSGM
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-MENU-SCREEN.

           IF DISP-CNTR = 1
               MOVE 1          TO KEY-HIT
           ELSE
           IF DISP-CNTR = 3
               MOVE 4          TO KEY-HIT.

      *C****************************************************************
      *-- EDIT FIELDS FILLED AND DETERMINE VALID INPUT FOR FUNCTION
      *-- REQUESTED.  IF VALID, PERFORM FUNCTION.
      *C****************************************************************

       READ-SCREEN-CONT.
           IF KEY-HIT = 1
               IF MAZONE = SPACES
      *M********************************************************************
      *M  ZONE AND PRIORITY IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE AND PRIORITY IS REQUIRED"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(1) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
               IF MAPRTY = SPACE
      *M********************************************************************
      *M  ZONE AND PRIORITY IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE AND PRIORITY IS REQUIRED"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(2) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
               IF MAPRTY < "1"  OR
                  MAPRTY > "6"
      *M********************************************************************
      *M  INVALID PRIORITY - MUST FROM 1 TO 5
      *M********************************************************************
                   MOVE "INVALID PRIORITY - MUST FROM 1 TO 5"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(2) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   MOVE SPACES   TO ZNP-KEY
                   MOVE ZNUM-ADD TO ZNP-KEY
                   PERFORM CHECK-ZNPNUM THRU CHECK-ZNPNUM-EXIT
                   IF FILE-STAT = "23"
                       PERFORM ADD-ZNPNUM THRU ADD-ZNPNUM-EXIT
                       GO TO SETUP-MENU-SCREEN
                   ELSE
                   IF FILE-STAT = "00"
      *M********************************************************************
      *M ZONE/PRIORITY ALREADY EXISTS
      *M********************************************************************
                       MOVE "ZONE/PRIORITY ALREADY EXISTS"
                                     TO ERRMSGM
                       MOVE TRUE-VAL TO IND(1) IND(99)
                       GO TO SHOW-MENU-SCREEN
                   ELSE
                       MOVE MESSAGE-BUFFER TO ERRMSGM
                       MOVE TRUE-VAL   TO IND(1) IND(99)
                       GO TO SHOW-MENU-SCREEN.

           IF KEY-HIT = 4
               IF MDZONE = SPACES
      *M********************************************************************
      *M  ZONE AND PRIORITY IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE AND PRIORITY IS REQUIRED"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(3) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
               IF MDPRTY = SPACES
      *M********************************************************************
      *M  ZONE AND PRIORITY IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE AND PRIORITY IS REQUIRED"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(4) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
               IF MDPRTY < "1"  OR
                  MDPRTY > "6"
      *M********************************************************************
      *M  INVALID PRIORITY - MUST FROM 1 TO 5
      *M********************************************************************
                   MOVE "INVALID PRIORITY - MUST FROM 1 TO 5"
                               TO ERRMSGM
                   MOVE TRUE-VAL TO IND(4) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   MOVE SPACES   TO ZNP-KEY
                   MOVE ZNUM-DEL TO ZNP-KEY
                   PERFORM CHECK-ZNPNUM THRU CHECK-ZNPNUM-EXIT
                   IF FILE-STAT = "00"
                       PERFORM DEL-ZNPNUM THRU DEL-ZNPNUM-EXIT
                       GO TO SETUP-MENU-SCREEN
                   ELSE
                   IF FILE-STAT = "23"
      *M********************************************************************
      *M INVALID ZONE/PRIORITY
      *M********************************************************************
                       MOVE "INVALID ZONE/PRIORITY"
                                     TO ERRMSGM
                       MOVE TRUE-VAL TO IND(3) IND(99)
                       GO TO SHOW-MENU-SCREEN
                   ELSE
                       MOVE MESSAGE-BUFFER TO ERRMSGM
                       MOVE TRUE-VAL   TO IND(3) IND(99)
                       GO TO SHOW-MENU-SCREEN.

           IF KEY-HIT = 5
               PERFORM DISP-ZNPNUM THRU DISP-ZNPNUM-EXIT
               GO TO SETUP-MENU-SCREEN.

           IF KEY-HIT = 7
               IF SCREEN-NAME = "ZNPMENU"
                   MOVE "ZNPHELP"  TO SCREEN-NAME
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   PERFORM HELP-LOOP THRU HELP-LOOP-EXIT
                   MOVE "ZNPHELP"  TO SCREEN-NAME
                   GO TO SHOW-MENU-SCREEN.

           GO TO SETUP-MENU-SCREEN.

       HELP-LOOP.
           MOVE "ZNPAHLP1"     TO SCREEN-NAME.

       SHOW-HELP-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SPACES        TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 0 OR 7
               NEXT SENTENCE
           ELSE
               GO TO HELP-LOOP-EXIT.

           IF SCREEN-NAME = "ZNPAHLP1"
               MOVE "ZNPAHLP2" TO SCREEN-NAME
           ELSE
               MOVE "ZNPAHLP1" TO SCREEN-NAME.

           GO TO SHOW-HELP-SCREEN.

       HELP-LOOP-EXIT.         EXIT.

       ADD-ZNPNUM.
      *C****************************************************************
      *--    >>  ADD ZONE/PRIORITY RECORD TO FILE  <<
      *--  ADD-ZNPNUM EDITS FOR VALID INPUT AND WRITES A ZONE/PRIORITY
      *--  RECORD TO THE WO-ZONE-PRTY FILE (MCFPMM0500) ONLY.
      *C****************************************************************

           MOVE "ZNPADD"       TO SCREEN-NAME.

       SHOW-ADD-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE ZNUM-ADD       TO ADD-SCREEN.
           MOVE  SCREEN-ADD    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
             GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
             GO TO ADD-ZNPNUM-EXIT.

           MOVE SPACES         TO ZONE-DATA.
           MOVE ADD-SCREEN     TO ZONE-DATA.

           WRITE ZNP-REC       FROM ZONE-DATA
               INVALID KEY
      *M****************************************************************
      *M  ADD FAILED
      *M****************************************************************
                   MOVE "ADD FAILED" TO ERRMSGA
                   MOVE TRUE-VAL TO IND(99)
                   GO TO SHOW-ADD-SCREEN.

           MOVE "X"            TO MSG-SW.
           MOVE SPACES         TO MSG-BUFFER.
           STRING MSG1 AZONE "/" APRTY MSG2 MSGA MSG3
                               DELIMITED BY SIZE
                               INTO MSG-BUFFER.

       ADD-ZNPNUM-EXIT.        EXIT.

       DEL-ZNPNUM.
      *C****************************************************************
      *--    >>  DELETE ZONE/PRIORITY  RECORD IN FILE  <<
      *--  DEL-ZNPNUM DELETES THE ZONE/PRIORITY RECORD FROM THE
      *--  WO-ZONE-PRTY FILE (MCFPMM0500) BUT DOES NOT DELETE ASSOCIATED
      *--  RECORDS IN OTHER FILES.  NO NEW ASSOCIATED RECORDS MAY BE
      *--  CREATED LINKED TO THE OLD (DELETED) ZONE/PRIORITY RECORD.
      *C****************************************************************

           MOVE "ZNPDELETE"    TO SCREEN-NAME.
           MOVE ZONE-FIELD     TO  DZONE.
           MOVE PRTY-NUM       TO  DPRTY.

       SHOW-DELETE-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SCREEN-DELETE TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3 OR 8
             GO TO END-OF-JOB.

           IF KEY-HIT NOT = 4
               GO TO DEL-ZNPNUM-EXIT.

      ******************************************************************
      *-- CHECK FOR EQUIPMENT STILL LINKED TO ZONE
      *-- ZONE CANNOT BE DELETED IF STILL LINKED
      ******************************************************************

           MOVE SPACE          TO SEARCH-FLAG.
           READ EQP-EQUIPMENT  FIRST INTO EQUIPMENT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DELETE-ZONE-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               STRING
                 "READ ERROR IN EQP-EQUIPMENT FIRST FILE STATUS = "
                               FILE-STAT
                               DELIMITED BY SIZE
                               INTO ERRMSGD
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-DELETE-SCREEN.

           IF DZONE = EQP-MAINT-ZONE
               MOVE "X"        TO SEARCH-FLAG
               GO TO DELETE-ZONE-CONT.

       READ-EQUIPMENT-LOOP.
           READ EQP-EQUIPMENT  NEXT INTO EQUIPMENT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DELETE-ZONE-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               STRING
                 "READ ERROR IN EQP-EQUIPMENT NEXT   FILE STATUS = "
                               FILE-STAT
                               DELIMITED BY SIZE
                               INTO ERRMSGD
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-DELETE-SCREEN.

           IF DZONE = EQP-MAINT-ZONE
               MOVE "X"        TO SEARCH-FLAG
               GO TO DELETE-ZONE-CONT.

           GO TO READ-EQUIPMENT-LOOP.

       DELETE-ZONE-CONT.
           IF SEARCH-FLAG NOT = SPACE
      *M****************************************************************
      *M  EQUIPMENT STILL LOCATED IN THIS ZONE - CANNOT DELETE
      *M****************************************************************
               MOVE
               "EQUIPMENT STILL LOCATED IN THIS ZONE - CANNOT DELETE"
                               TO ERRMSGD
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-DELETE-SCREEN.

           MOVE DEL-SCREEN     TO ZONEPRTY OF ZNP-REC.
           READ WO-ZONE-PRTY   INTO ZONE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE FAILED"
                               TO ERRMSGD
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-DELETE-SCREEN.

           DELETE WO-ZONE-PRTY
               INVALID KEY
                   MOVE "DELETE FAILED"
                                   TO ERRMSGD
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOW-DELETE-SCREEN.

           MOVE "X"            TO MSG-SW.
           MOVE SPACES         TO MSG-BUFFER.
           STRING MSG1 DZONE "/" DPRTY MSG2 MSGD MSG3
                               DELIMITED BY SIZE
                               INTO MSG-BUFFER.

       DEL-ZNPNUM-EXIT.        EXIT.

       DISP-ZNPNUM.
      *C****************************************************************
      *--    >>  DISPLAY A LIST OF ZONE/PRIORITY RECORDS IN FILE  <<
      *--  DISP-ZNPNUM LISTS THE ZONE/PRIORITY RECORDS FROM THE
      *--  WO-ZONE-PRTY FILE (MCFPMM0500) TO THE SCREEN.
      *C****************************************************************

           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75).
           MOVE TRUE-VAL       TO IND(77) IND(76).
           MOVE SPACES         TO DISPLAY-REC
                                  SCREEN-DISPLAY.
           WRITE DISPLAY-REC   FORMAT "ZNP"
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY
               "SUBFILE CLEAR WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS.
           MOVE NEG-VAL        TO IND(77).

           MOVE LOW-VALUES     TO ZONEPRTY OF WO-ZONE-PRTY.
           START WO-ZONE-PRTY  KEY >= ZONEPRTY OF WO-ZONE-PRTY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO DBGET-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               DISPLAY
               "START WO-ZONE-PRTY ERROR.  FILE-STATUS IS "
                               FILE-STAT
               GO TO DISP-ZNPNUM-EXIT.

       DBGET-LOOP.
           READ WO-ZONE-PRTY   NEXT INTO ZONE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SUBF-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               DISPLAY
               "READ WO-ZONE-PRTY ERROR.  FILE-STATUS IS "
                               FILE-STAT
               GO TO DISP-ZNPNUM-EXIT.

           IF ZONE-FIELD = SPACES
               GO TO DBGET-LOOP.

           MOVE ZONE-FIELD     TO  SZONE.
           MOVE PRTY-NUM       TO  SPRTY.

           ADD 1               TO RECNO.
           MOVE SCREEN-DISPLAY TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE SUBFILE       DISPLAY-REC FORMAT "ZNPDISP"
                               INDIC ARE SCREEN-INDICATORS
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY   "SUBFILE 1 WRITE ERROR.  SCREEN STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           GO TO DBGET-LOOP.

       SUBF-CONT.
           IF RECNO EQUAL 0
               GO TO DISP-ZNPNUM-EXIT.

           WRITE DISPLAY-REC   FORMAT "ENDSUBF"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE TRUE-VAL       TO IND(76).

           IF RECNO GREATER THAN 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).

           WRITE DISPLAY-REC   FORMAT "ZNP"
                               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE   FORMAT "ZNP"
                               INDIC ARE SCREEN-INDICATORS.

           READ SUBFILE        DISPLAY-FILE NEXT MODIFIED
                               INTO SCREEN-DISPLAY
                               FORMAT "ZNPDISP"
                               INDIC ARE SCREEN-INDICATORS.

       DISP-ZNPNUM-EXIT.       EXIT.

       CHECK-ZNPNUM.
           MOVE ZNP-KEY        TO ZONEPRTY OF ZNP-REC.
           READ WO-ZONE-PRTY   INTO ZONE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00" OR "23"
               GO TO CHECK-ZNPNUM-EXIT
           ELSE
               STRING "READ ERROR IN WO-ZONE-PRTY      FILE STATUS = "
                               FILE-STAT
                               DELIMITED BY SIZE
                               INTO MESSAGE-BUFFER.

       CHECK-ZNPNUM-EXIT.      EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               WO-ZONE-PRTY.
           GOBACK.

      *************  END OF FILE  ************************************
