       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TMZSHIFT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

      *C****************************************************************
      *C*  01/28/97  WDR
      *C*  RE-WROTE ENTIRE PROGRAM TO MAKE MORE USER-FRIENDLY.
      *C****************************************************************

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ZONE-SHIFT-FILE
                  ASSIGN       TO DATABASE-MCFLMM2501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZMASTER-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  ZONE-SHIFT-FILE
           LABEL RECORDS       ARE STANDARD.
       01  ZNS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM2501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  MSG-SW              PIC  X(01).
       77  MSG-BUFFER          PIC  X(76).
       77  MESSAGE-BUFFER      PIC  X(76).
       77  ZNS-KEY             PIC  X(4).
       77  RECNO               PIC  9999   VALUE 0.
       77  DISP-CNTR           PIC  99     VALUE 0.
       77  TRUE-VAL            PIC  1      VALUE B"1".
       77  NEG-VAL             PIC  1      VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TMZSHIFT".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " K0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
           "MAINTENANCE OF THE ZONE/SHIFT FILE IN THE MMIS DATABASE.".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  SCREEN-MENU.
           05  ZNS-ADD         PIC X(4).
           05  ZNS-CHG         PIC X(4).
           05  ZNS-DEL         PIC X(4).
           05  MSGFLDM         PIC X(76).
           05  CMDMSGM         PIC X(79).
           05  ERRMSGM         PIC X(79).

       01  SCREEN-ADD.
           05  ADD-SCREEN.
               10  AZSHFT      PIC X(4).
               10  ACODE       PIC 9(1).
               10  ACODEX      REDEFINES ACODE
                               PIC X(1).
               10  ASHIFTS.
                   15  AFRST   PIC X(4).
                   15  ASCND   PIC X(4).
                   15  ATHRD   PIC X(4).
                   15  AFRTH   PIC X(4).
           05  CMDMSGA         PIC X(79).
           05  ERRMSGA         PIC X(79).

       01  SCREEN-CHANGE.
           05  CHG-SCREEN.
               10  CZSHFT      PIC X(4).
               10  CCODE       PIC 9(1).
               10  CCODEX      REDEFINES CCODE
                               PIC X(1).
               10  CSHIFTS.
                   15  CFRST   PIC X(4).
                   15  CSCND   PIC X(4).
                   15  CTHRD   PIC X(4).
                   15  CFRTH   PIC X(4).
           05  CMDMSGC         PIC X(79).
           05  ERRMSGC         PIC X(79).

       01  SCREEN-DELETE.
           05  DEL-SCREEN.
               10  DZSHFT      PIC X(4).
               10  DCODE       PIC X(1).
               10  DSHIFTS.
                   15  DFRST   PIC X(4).
                   15  DSCND   PIC X(4).
                   15  DTHRD   PIC X(4).
                   15  DFRTH   PIC X(4).
           05  CMDMSGD         PIC X(79).
           05  ERRMSGD         PIC X(79).

       01  SCREEN-DISPLAY.
           05  DISP-SCREEN.
               10  SZSHFT      PIC X(4).
               10  SCODE       PIC X(1).
               10  SSHIFTS.
                   15  SFRST   PIC X(4).
                   15  SSCND   PIC X(4).
                   15  STHRD   PIC X(4).
                   15  SFRTH   PIC X(4).

       01  SCREEN-MSG.
           05  MSG1            PIC X(10) VALUE "THE ZONE '".
           05  MSG2            PIC X(11) VALUE "' HAS BEEN ".
           05  MSG3            PIC X(21)
                               VALUE "YOUR ZONE/SHIFT FILE.".
           05  MSGA            PIC X(09) VALUE "ADDED TO ".
           05  MSGC            PIC X(12) VALUE "MODIFIED IN ".
           05  MSGD            PIC X(13) VALUE "DELETED FROM ".

       01  WS-ACCUMULATORS.
           05  WS-CALC.
               10  WS-CH       PIC 99.
               10  WS-CM       PIC 99.
           05  WS-MIN1         PIC 9999.
           05  WS-MIN2         PIC 9999.
           05  WS-MIN3         PIC 9999.
           05  WS-MIN4         PIC 9999.
           05  WS-HOLD         PIC 9999.
           05  WS-TOTL         PIC 9999.

       01  ADJUST.
           05 A1               PIC X.
           05 A2               PIC X.
           05 A3               PIC X.
           05 A4               PIC X.

           COPY SCREENIO       IN COPYLIB.

       01  ZONE-SHIFT-DATA.
           COPY MSHFTSTR       IN COPYLIB.

       PROCEDURE DIVISION.
       OPEN-PARAGRAPH.
           MOVE SPACE          TO MSG-SW.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            ZONE-SHIFT-FILE.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

      *C****************************************************************
      *-- DISPLAY MAIN MENU/INPUT SCREEN (OR HELP/INPUT SCREEN)
      *C****************************************************************

       SETUP-MENU-SCREEN.
           MOVE SPACES         TO SCREEN-MENU
                                  SCREEN-ADD
                                  SCREEN-CHANGE
                                  SCREEN-DELETE.

           MOVE "ZNSMENU"      TO SCREEN-NAME.

       SHOW-MENU-SCREEN.
           IF MSG-SW NOT = SPACE
               MOVE SPACE      TO MSG-SW
               MOVE MSG-BUFFER TO MSGFLDM
           ELSE
               MOVE SPACES     TO MSGFLDM.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SCREEN-MENU   TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-MENU.

           IF KEY-HIT = 3 OR 8
               GO TO END-OF-JOB.

           IF KEY-HIT = 9
               GO TO SETUP-MENU-SCREEN.

           IF KEY-HIT = 1 OR 2 OR 4 OR 5 OR 6 OR 7
               GO TO READ-SCREEN-CONT.

      *C****************************************************************
      *-- DETERMINE IF ONLY ONE FIELD IS FILLED AND SET FUNCTION KEY
      *-- SO 'ENTER' KEY WILL FUNCTION FOR THAT FIELD ONLY.
      *C****************************************************************

           MOVE  0             TO DISP-CNTR.
           IF ZNS-ADD NOT = SPACES
               ADD 1           TO DISP-CNTR.

           IF ZNS-CHG NOT = SPACES
               ADD 3           TO DISP-CNTR.

           IF ZNS-DEL NOT = SPACES
               ADD 5           TO DISP-CNTR.

      *C****************************************************************
      *-- IF MORE THAN ONE FIELD IS FILLED, DISPLAY ERROR DESIGNATING
      *-- THAT USER PRESS THE DESIRED FUNCTION KEY.
      *C****************************************************************

           IF DISP-CNTR = 1 OR 3 OR 5
               NEXT SENTENCE
           ELSE
      *M****************************************************************
      *M  PRESS APPROPRIATE FUNCTION KEY TO CONTINUE
      *M****************************************************************
               MOVE "PRESS APPROPRIATE FUNCTION KEY TO CONTINUE"
                               TO ERRMSGM
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-MENU-SCREEN.

           IF DISP-CNTR = 1
               MOVE 1          TO KEY-HIT
           ELSE
           IF DISP-CNTR = 3
               MOVE 2          TO KEY-HIT
           ELSE
           IF DISP-CNTR = 5
               MOVE 4          TO KEY-HIT.

      *C****************************************************************
      *-- EDIT FIELDS FILLED AND DETERMINE VALID INPUT FOR FUNCTION
      *-- REQUESTED.  IF VALID, PERFORM FUNCTION.
      *C****************************************************************

       READ-SCREEN-CONT.
           IF KEY-HIT = 1
               IF ZNS-ADD = SPACES
      *M********************************************************************
      *M ZONE IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE IS REQUIRED"
                                 TO ERRMSGM
                   MOVE TRUE-VAL TO IND(1) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   MOVE ZNS-ADD TO ZNS-KEY
                   PERFORM CHECK-ZSHFT THRU CHECK-ZSHFT-EXIT
                   IF FILE-STAT = "23"
                       PERFORM ADD-ZSHFT THRU ADD-ZSHFT-EXIT
                       GO TO SETUP-MENU-SCREEN
                   ELSE
                   IF FILE-STAT = "00"
      *M********************************************************************
      *M ZONE/SHIFT RECORD ALREADY EXISTS
      *M********************************************************************
                       MOVE "ZONE/SHIFT RECORD ALREADY EXISTS"
                                     TO ERRMSGM
                       MOVE TRUE-VAL TO IND(1) IND(99)
                       GO TO SHOW-MENU-SCREEN
                   ELSE
                       MOVE MESSAGE-BUFFER TO ERRMSGM
                       MOVE TRUE-VAL   TO IND(1) IND(99)
                       GO TO SHOW-MENU-SCREEN.

           IF KEY-HIT = 2
               IF ZNS-CHG = SPACES
      *M********************************************************************
      *M ZONE IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE IS REQUIRED"
                                 TO ERRMSGM
                   MOVE TRUE-VAL TO IND(2) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   MOVE ZNS-CHG TO ZNS-KEY
                   PERFORM CHECK-ZSHFT THRU CHECK-ZSHFT-EXIT
                   IF FILE-STAT = "00"
                       PERFORM CHG-ZSHFT THRU CHG-ZSHFT-EXIT
                       GO TO SETUP-MENU-SCREEN
                   ELSE
                   IF FILE-STAT = "23"
      *M********************************************************************
      *M ZONE/SHIFT RECORD DOES NOT EXIST
      *M********************************************************************
                       MOVE "ZONE/SHIFT RECORD DOES NOT EXIST"
                                     TO ERRMSGM
                       MOVE TRUE-VAL TO IND(2) IND(99)
                       GO TO SHOW-MENU-SCREEN
                   ELSE
                       MOVE MESSAGE-BUFFER TO ERRMSGM
                       MOVE TRUE-VAL   TO IND(2) IND(99)
                       GO TO SHOW-MENU-SCREEN.

           IF KEY-HIT = 4
               IF ZNS-DEL = SPACES
      *M********************************************************************
      *M ZONE IS REQUIRED
      *M********************************************************************
                   MOVE "ZONE IS REQUIRED"
                                 TO ERRMSGM
                   MOVE TRUE-VAL TO IND(3) IND(99)
                   GO TO SHOW-MENU-SCREEN
               ELSE
                   MOVE ZNS-DEL TO ZNS-KEY
                   PERFORM CHECK-ZSHFT THRU CHECK-ZSHFT-EXIT
                   IF FILE-STAT = "00"
                       PERFORM DEL-ZSHFT THRU DEL-ZSHFT-EXIT
                       GO TO SETUP-MENU-SCREEN
                   ELSE
                   IF FILE-STAT = "23"
      *M********************************************************************
      *M ZONE/SHIFT RECORD DOES NOT EXIST
      *M********************************************************************
                       MOVE "ZONE/SHIFT RECORD DOES NOT EXIST"
                                     TO ERRMSGM
                       MOVE TRUE-VAL TO IND(3) IND(99)
                       GO TO SHOW-MENU-SCREEN
                   ELSE
                       MOVE MESSAGE-BUFFER TO ERRMSGM
                       MOVE TRUE-VAL   TO IND(3) IND(99)
                       GO TO SHOW-MENU-SCREEN.

           IF KEY-HIT = 5
               PERFORM DISP-ZSHFT THRU DISP-ZSHFT-EXIT
               GO TO SETUP-MENU-SCREEN.

           IF KEY-HIT = 7
               MOVE "ZNSHELP"  TO SCREEN-NAME
               GO TO SHOW-MENU-SCREEN.

           GO TO SETUP-MENU-SCREEN.

       ADD-ZSHFT.
      *C****************************************************************
      *--    >>  ADD ZONE-SHIFT RECORD TO FILE  <<
      *--  ADD-ZSHFT EDITS FOR VALID INPUT AND WRITES A ZONE-SHIFT
      *--  RECORD TO THE ZONE-SHIFT FILE (MCFPMM2500).
      *C****************************************************************

           MOVE "ZNSADD"       TO SCREEN-NAME.

       SHOW-ADD-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE ZNS-ADD        TO AZSHFT.
           MOVE  SCREEN-ADD    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-ADD.

           IF KEY-HIT = 3 OR 8
             GO TO END-OF-JOB.

           IF KEY-HIT = 1
             GO TO ADD-ZSHFT-EXIT.

           IF ACODEX = SPACES
      *M********************************************************************
      *M NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4
      *M********************************************************************
               MOVE "NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ACODE = 2 OR 3 OR 4
               NEXT SENTENCE
           ELSE
      *M********************************************************************
      *M NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4
      *M********************************************************************
               MOVE "NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ASHIFTS = SPACES
      *M********************************************************************
      *M SHIFT TIMES MUST BE ENTERED
      *M********************************************************************
               MOVE "SHIFT TIMES MUST BE ENTERED"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ACODE > 1
               IF ASCND NOT NUMERIC
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID SECOND SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(4) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           IF ACODE > 2
               IF ATHRD NOT NUMERIC
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           IF ACODE > 3
               IF AFRTH NOT NUMERIC
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           MOVE AFRST          TO ADJUST.
           PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
           MOVE ADJUST         TO AFRST.

           MOVE ASCND          TO ADJUST.
           PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
           MOVE ADJUST         TO ASCND.

           IF ACODE > 2
               MOVE ATHRD      TO ADJUST.
               PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
               MOVE ADJUST     TO ATHRD.

           IF ACODE > 3
               MOVE AFRTH      TO ADJUST.
               PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
               MOVE ADJUST     TO AFRTH.

           IF ACODE = 2
               MOVE "    "     TO ATHRD.

           IF ACODE = 2 OR 3
               MOVE "    "     TO AFRTH.

           IF AFRST NOT NUMERIC
      *M********************************************************************
      *M INVALID FIRST SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID FIRST SHIFT TIME ENTERED"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF AFRST > "2400"
      *M********************************************************************
      *M INVALID FIRST SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID FIRST SHIFT TIME ENTERED"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ASCND NOT NUMERIC
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID SECOND SHIFT TIME ENTERED"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ASCND > "2400"
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID SECOND SHIFT TIME ENTERED"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ACODE = 2
               GO TO ADD-ZSHFT-CONT.

           IF ACODE > 2
               IF ATHRD NOT NUMERIC OR
                  ATHRD = "    "
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           IF ACODE > 2
               IF ATHRD > "2400"
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           IF ACODE = 3
               GO TO ADD-ZSHFT-CONT.

           IF ACODE > 3
               IF AFRTH NOT NUMERIC OR
                  AFRTH = "    "
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-ADD-SCREEN.

           IF ACODE > 3
               IF AFRTH > "2400"
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-ADD-SCREEN.

       ADD-ZSHFT-CONT.
           IF AFRST = "2400"   MOVE "0000" TO AFRST.
           IF ASCND = "2400"   MOVE "0000" TO ASCND.
           IF ATHRD = "2400"   MOVE "0000" TO ATHRD.
           IF AFRTH = "2400"   MOVE "0000" TO AFRTH.

           IF AFRST = ASCND OR ATHRD OR AFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
               MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ASCND = ATHRD OR AFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
               MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                               TO ERRMSGA
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-ADD-SCREEN.

           IF ACODE > 2
               IF ATHRD = AFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
                   MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                                 TO ERRMSGA
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-ADD-SCREEN.

      *M********************************************************************
      *M** TEST TIME VALIDATION CODE - NOT USED - DOES NOT WORK   **********
      *M**   LEFT HERE FOR POSSIBLE FUTURE REPAIR AND ACTIVATION  **********
      *M********************************************************************
      *    MOVE AFRST          TO WS-CALC.
      *    COMPUTE WS-MIN1 =   (WS-CH * 60) + WS-CM.
      *    MOVE ASCND          TO WS-CALC.
      *    COMPUTE WS-MIN2 =   (WS-CH * 60) + WS-CM.
      *    MOVE ATHRD          TO WS-CALC.
      *    COMPUTE WS-MIN3 =   (WS-CH * 60) + WS-CM.
      *    MOVE AFRTH          TO WS-CALC.
      *    COMPUTE WS-MIN4 =   (WS-CH * 60) + WS-CM.
      *
      *    COMPUTE WS-TOTL =   WS-MIN1 +
      *                        (WS-MIN2 - WS-MIN1) +
      *                        (WS-MIN3 - WS-MIN2) +
      *                        (WS-MIN2 - WS-MIN3) +
      *                        (1440    - WS-MIN4).
      *
      *    IF WS-TOTL NOT = 1440
      *M********************************************************************
      *M TOTAL TIME SPAN IS GREATER THAN 24 HOURS - CHECK START TIMES
      *M********************************************************************
      *        MOVE
      *    "TOTAL TIME SPAN IS GREATER THAN 24 HOURS, CHECK START TIMES"
      *                        TO ERRMSGA
      *        MOVE TRUE-VAL   TO IND(3) IND(99)
      *        GO TO SHOW-ADD-SCREEN.
      *M********************************************************************
      *M********************************************************************

           MOVE SPACES         TO ZONE-SHIFT-DATA.
           MOVE AZSHFT         TO SHIFT-ZONE.
           MOVE ACODEX         TO CODE-VALUE.
           MOVE AFRST          TO FRST-SHIFT.
           MOVE ASCND          TO SCND-SHIFT.
           MOVE ATHRD          TO THRD-SHIFT-X.
           MOVE AFRTH          TO FRTH-SHIFT-X.

           WRITE ZNS-REC       FROM ZONE-SHIFT-DATA
               INVALID KEY
      *M****************************************************************
      *M  ADD FUNCTION FAILED - FILE STATUS IS XX
      *M****************************************************************
                   STRING "ADD FUNCTION FAILED - FILE STATUS IS "
                                 FILE-STAT
                                 DELIMITED BY SIZE
                                 INTO ERRMSGA
                   MOVE TRUE-VAL TO IND(99)
                   GO TO SHOW-ADD-SCREEN.

           MOVE "X"            TO MSG-SW.
           MOVE SPACES         TO MSG-BUFFER.
           STRING MSG1 ZNS-ADD MSG2 MSGA MSG3
                               DELIMITED BY SIZE
                               INTO MSG-BUFFER.

       ADD-ZSHFT-EXIT.         EXIT.

       CHG-ZSHFT.
      *C****************************************************************
      *--    >>  CHANGE ZONE-SHIFT RECORD IN FILE  <<
      *--  CHG-ZSHFT EDITS FOR VALID INPUT AND MODIFIES THE ZONE-SHIFT
      *--  RECORD IN THE ZONE-SHIFT FILE (MCFPMM2500).
      *C****************************************************************

           MOVE "ZNSCHANGE"    TO SCREEN-NAME.
           MOVE SHIFT-ZONE     TO  CZSHFT.
           MOVE CODE-VALUE     TO  CCODEX.
           MOVE FRST-SHIFT     TO  CFRST.
           MOVE SCND-SHIFT     TO  CSCND.
           IF CODE-VALUE = "3" OR "4"
               MOVE THRD-SHIFT TO  CTHRD.
           IF CODE-VALUE = "4"
               MOVE FRTH-SHIFT TO  CFRTH.

       SHOW-CHANGE-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SCREEN-CHANGE TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-CHANGE.

           IF KEY-HIT = 3 OR 8
             GO TO END-OF-JOB.

           IF KEY-HIT = 1
               GO TO CHG-ZSHFT-EXIT.

           IF CCODEX = SPACE
      *M********************************************************************
      *M NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4
      *M********************************************************************
               MOVE "NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CCODE = 2 OR 3 OR 4
               NEXT SENTENCE
           ELSE
      *M********************************************************************
      *M NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4
      *M********************************************************************
               MOVE "NUMBER OF SHIFTS PER DAY MUST BE 2, 3, OR 4"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(2) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CSHIFTS = SPACES
      *M********************************************************************
      *M SHIFT TIMES MUST BE ENTERED
      *M********************************************************************
               MOVE "SHIFT TIMES MUST BE ENTERED"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 1
               IF CSCND NOT NUMERIC
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID SECOND SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(4) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 2
               IF CTHRD NOT NUMERIC
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 3
               IF CFRTH NOT NUMERIC
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           MOVE CFRST          TO ADJUST.
           PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
           MOVE ADJUST         TO CFRST.

           MOVE CSCND          TO ADJUST.
           PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
           MOVE ADJUST         TO CSCND.

           IF CCODE > 2
               MOVE CTHRD      TO ADJUST.
               PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
               MOVE ADJUST     TO CTHRD.

           IF CCODE > 3
               MOVE CFRTH      TO ADJUST.
               PERFORM ADJUST-FOUR UNTIL A4 NOT = SPACE.
               MOVE ADJUST     TO CFRTH.

           IF CCODE = 2
               MOVE "    "     TO CTHRD.

           IF CCODE = 2 OR 3
               MOVE "    "     TO CFRTH.

           IF CFRST NOT NUMERIC
      *M********************************************************************
      *M INVALID FIRST SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID FIRST SHIFT TIME ENTERED"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CFRST > "2400"
      *M********************************************************************
      *M INVALID FIRST SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID FIRST SHIFT TIME ENTERED"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CSCND NOT NUMERIC
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID SECOND SHIFT TIME ENTERED"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CSCND > "2400"
      *M********************************************************************
      *M INVALID SECOND SHIFT TIME ENTERED
      *M********************************************************************
               MOVE "INVALID SECOND SHIFT TIME ENTERED"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CCODE = 2
               GO TO CHG-ZSHFT-CONT.

           IF CCODE > 2
               IF CTHRD NOT NUMERIC OR
                  CTHRD = "    "
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 2
               IF CTHRD > "2400"
      *M********************************************************************
      *M INVALID THIRD SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID THIRD SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CCODE = 3
               GO TO CHG-ZSHFT-CONT.

           IF CCODE > 3
               IF CFRTH NOT NUMERIC OR
                  CFRTH = "    "
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 3
               IF CFRTH > "2400"
      *M********************************************************************
      *M INVALID FOURTH SHIFT TIME ENTERED
      *M********************************************************************
                   MOVE "INVALID FOURTH SHIFT TIME ENTERED"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(6) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

       CHG-ZSHFT-CONT.
           IF CFRST = "2400"   MOVE "0000" TO CFRST.
           IF CSCND = "2400"   MOVE "0000" TO CSCND.
           IF CTHRD = "2400"   MOVE "0000" TO CTHRD.
           IF CFRTH = "2400"   MOVE "0000" TO CFRTH.

           IF CFRST = CSCND OR CTHRD OR CFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
               MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CSCND = CTHRD OR CFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
               MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOW-CHANGE-SCREEN.

           IF CCODE > 2
               IF CTHRD = CFRTH
      *M********************************************************************
      *M INVALID STARTING TIME - TWO SHIFTS CANNOT START AT SAME TIME
      *M********************************************************************
                   MOVE
               "INVALID TIME - TWO SHIFTS CANNOT START AT SAME TIME"
                                 TO ERRMSGC
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

      *M********************************************************************
      *M** TEST TIME VALIDATION CODE - NOT USED - DOES NOT WORK   **********
      *M**   LEFT HERE FOR POSSIBLE FUTURE REPAIR AND ACTIVATION  **********
      *M********************************************************************
      *    MOVE ZEROS          TO WS-ACCUMULATORS.
      *    MOVE CFRST          TO WS-CALC.
      *    COMPUTE WS-MIN1 =   (WS-CH * 60) + WS-CM.
      *    MOVE CSCND          TO WS-CALC.
      *    COMPUTE WS-MIN2 =   (WS-CH * 60) + WS-CM.
      *    IF CTHRD NOT = SPACES
      *        MOVE CTHRD      TO WS-CALC
      *        COMPUTE WS-MIN3 = (WS-CH * 60) + WS-CM.
      *    IF CFRTH NOT = SPACES
      *        MOVE CFRTH      TO WS-CALC
      *        COMPUTE WS-MIN4 = (WS-CH * 60) + WS-CM.
      *
      *    MOVE WS-MIN1        TO WS-TOTL.
      *    COMPUTE WS-HOLD =   (WS-MIN2 - WS-MIN1).
      *    ADD  WS-HOLD        TO WS-TOTL.
      *
      *    IF CTHRD NOT = SPACES
      *        IF CCODE > 2
      *            COMPUTE WS-HOLD = (WS-MIN3 - WS-MIN2)
      *            ADD  WS-HOLD TO WS-TOTL
      *        ELSE
      *            COMPUTE WS-HOLD = (1440 - WS-MIN2)
      *            ADD  WS-HOLD TO WS-TOTL.
      *
      *    IF CFRTH NOT = SPACES
      *        IF CCODE > 3
      *            COMPUTE WS-HOLD = (WS-MIN4 - WS-MIN3)
      *            ADD  WS-HOLD TO WS-TOTL
      *            COMPUTE WS-HOLD = (1440 - WS-MIN4)
      *            ADD  WS-HOLD TO WS-TOTL
      *        ELSE
      *            COMPUTE WS-HOLD = (1440 - WS-MIN3)
      *            ADD  WS-HOLD TO WS-TOTL.
      *
      *    IF WS-TOTL NOT = 1440
      *M********************************************************************
      *M TOTAL TIME SPAN IS GREATER THAN 24 HOURS - CHECK START TIMES
      *M********************************************************************
      *        MOVE
      *    "TOTAL TIME SPAN IS GREATER THAN 24 HOURS, CHECK START TIMES"
      *                        TO ERRMSGC
      *        MOVE TRUE-VAL   TO IND(3) IND(99)
      *        GO TO SHOW-CHANGE-SCREEN.
      *M********************************************************************
      *M********************************************************************

           MOVE CZSHFT         TO SHIFTZONE OF ZNS-REC.
           READ ZONE-SHIFT-FILE INTO ZONE-SHIFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "CHANGE FAILED - READ ZONE-SHIFT-FILE"
                               TO ERRMSGC
               MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           IF CFRST = "2400"   MOVE "0000" TO CFRST.
           IF CSCND = "2400"   MOVE "0000" TO CSCND.
           IF CTHRD = "2400"   MOVE "0000" TO CTHRD.
           IF CFRTH = "2400"   MOVE "0000" TO CFRTH.

           MOVE CCODEX         TO CODE-VALUE.
           MOVE CFRST          TO FRST-SHIFT.
           MOVE CSCND          TO SCND-SHIFT.
           MOVE CTHRD          TO THRD-SHIFT-X.
           MOVE CFRTH          TO FRTH-SHIFT-X.

           REWRITE ZNS-REC     FROM ZONE-SHIFT-DATA
               INVALID KEY
                   MOVE "CHANGE FAILED - REWRITE ZONE-SHIFT-FILE"
                                   TO ERRMSGC
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOW-CHANGE-SCREEN.

           MOVE "X"            TO MSG-SW.
           MOVE SPACES         TO MSG-BUFFER.
           STRING MSG1 ZNS-CHG MSG2 MSGC MSG3
                               DELIMITED BY SIZE
                               INTO MSG-BUFFER.

       CHG-ZSHFT-EXIT.         EXIT.

       DEL-ZSHFT.
      *C****************************************************************
      *--    >>  DELETE ZONE-SHIFT RECORD IN FILE  <<
      *--  DEL-ZSHFT DELETES THE ZONE-SHIFT RECORD FROM THE ZONE-SHIFT
      *--  FILE (MCFPMM2500).
      *C****************************************************************

           MOVE "ZNSDELETE"    TO SCREEN-NAME.
           MOVE SHIFT-ZONE     TO  DZSHFT.
           MOVE CODE-VALUE     TO  DCODE.
           MOVE FRST-SHIFT     TO  DFRST.
           MOVE SCND-SHIFT     TO  DSCND.
           IF CODE-VALUE = "3" OR "4"
               MOVE THRD-SHIFT TO  DTHRD.
           IF CODE-VALUE = "4"
               MOVE FRTH-SHIFT TO  DFRTH.

       SHOW-DELETE-SCREEN.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE  SCREEN-DELETE TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DELETE.

           IF KEY-HIT = 3 OR 8
             GO TO END-OF-JOB.

           IF KEY-HIT NOT = 4
               GO TO DEL-ZSHFT-EXIT.

           MOVE DZSHFT         TO SHIFTZONE OF ZNS-REC.
           READ ZONE-SHIFT-FILE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE FAILED"
                               TO ERRMSGD
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOW-DELETE-SCREEN.

           DELETE ZONE-SHIFT-FILE
               INVALID KEY
                   MOVE "DELETE FAILED"
                                   TO ERRMSGD
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO SHOW-DELETE-SCREEN.

           MOVE "X"            TO MSG-SW.
           MOVE SPACES         TO MSG-BUFFER.
           STRING MSG1 ZNS-DEL MSG2 MSGD MSG3
                               DELIMITED BY SIZE
                               INTO MSG-BUFFER.

       DEL-ZSHFT-EXIT.         EXIT.

       DISP-ZSHFT.
      *C****************************************************************
      *--    >>  DISPLAY A LIST OF ZONE-SHIFT RECORDS IN FILE  <<
      *--  DISP-ZSHFT LISTS THE ZONE-SHIFT RECORDS FROM THE ZONE-SHIFT FILE
      *--  (MCFPMM2500) TO THE SCREEN.
      *C****************************************************************

           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75).
           MOVE TRUE-VAL       TO IND(77) IND(76).
           MOVE SPACES         TO DISPLAY-REC
                                  SCREEN-DISPLAY.
           WRITE DISPLAY-REC   FORMAT "ZNS"
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY
               "SUBFILE CLEAR WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS.
           MOVE NEG-VAL        TO IND(77).

           MOVE LOW-VALUES     TO SHIFTZONE OF ZONE-SHIFT-FILE.
           START ZONE-SHIFT-FILE
                               KEY >= SHIFTZONE OF ZONE-SHIFT-FILE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO DBGET-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               DISPLAY
               "START ZONE-SHIFT-FILE ERROR.  FILE-STATUS IS "
                               FILE-STAT
               GO TO DISP-ZSHFT-EXIT.

       DBGET-LOOP.
           READ ZONE-SHIFT-FILE     NEXT INTO ZONE-SHIFT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SUBF-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               DISPLAY
               "READ ZONE-SHIFT-FILE ERROR.  FILE-STATUS IS "
                               FILE-STAT
               GO TO DISP-ZSHFT-EXIT.

           MOVE SHIFT-ZONE     TO  SZSHFT.
           MOVE CODE-VALUE     TO  SCODE.
           MOVE FRST-SHIFT     TO  SFRST.
           MOVE SCND-SHIFT     TO  SSCND.
           MOVE THRD-SHIFT     TO  STHRD.
           MOVE FRTH-SHIFT     TO  SFRTH.

           ADD 1               TO RECNO.
           MOVE SCREEN-DISPLAY TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE SUBFILE       DISPLAY-REC FORMAT "ZNSDISP"
                               INDIC ARE SCREEN-INDICATORS
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY   "SUBFILE 1 WRITE ERROR.  SCREEN STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           GO TO DBGET-LOOP.

       SUBF-CONT.
           IF RECNO EQUAL 0
               GO TO DISP-ZSHFT-EXIT.

           WRITE DISPLAY-REC   FORMAT "ENDSUBF"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE TRUE-VAL       TO IND(76).

           IF RECNO GREATER THAN 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).

           WRITE DISPLAY-REC   FORMAT "ZNS"
                               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE   FORMAT "ZNS"
                               INDIC ARE SCREEN-INDICATORS.

           READ SUBFILE        DISPLAY-FILE NEXT MODIFIED
                               INTO SCREEN-DISPLAY
                               FORMAT "ZNSDISP"
                               INDIC ARE SCREEN-INDICATORS.

       DISP-ZSHFT-EXIT.        EXIT.

       CHECK-ZSHFT.
           MOVE ZNS-KEY        TO SHIFTZONE OF ZNS-REC.
           READ ZONE-SHIFT-FILE INTO ZONE-SHIFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00" OR "23"
               GO TO CHECK-ZSHFT-EXIT
           ELSE
               STRING
                 "READ ERROR IN ZONE-SHIFT-FILE       FILE STATUS = "
                               FILE-STAT
                               DELIMITED BY SIZE
                               INTO MESSAGE-BUFFER.


       CHECK-ZSHFT-EXIT.       EXIT.

       ADJUST-FOUR.
           MOVE A3             TO A4.
           MOVE A2             TO A3.
           MOVE A1             TO A2.
           MOVE "0"            TO A1.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               ZONE-SHIFT-FILE.
           GOBACK.

      *************  END OF FILE  ************************************
