       IDENTIFICATION DIVISION.
       PROGRAM-ID.        TNFTARPT.
       AUTHOR.            CA YODER.
       DATE-WRITTEN.      SEPTEMBER 1998.
       DATE-COMPILED.
      *INSTALLATION.      THE GOODYEAR TIRE & RUBBER COMPANY.
      *
      ******************************************************************
      *D   T N F T A R P T                                             *
      *D                                                               *
      *D     THIS PROGRAM CREATES A REPORT TO SHOW NAFTA TRACKING      *
      *D     RECORDS FROM MCFPCSNFTA.                                  *
      *D                                                               *
      *D     THIS REPORT IS SET UP TO RUN ON THE FIRST DAY OF THE      *
      *D     MONTH.  IT WILL DISPLAY RECORDS FROM THE PREVIOUS MONTH.  *
      *D                                                               *
      *D     THE ROUTING NAME FOR THE REPORT IS IN THE BATCH JOB       *
      *D     BNFTARPT.                                                 *
      *D                                                               *
      ******************************************************************
      *  C H A N G E S :                                               *
      *                                                                *
      *C                                                               *
      ******************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.     IBM-AS400.
       OBJECT-COMPUTER.     IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT NFTA-I
               ASSIGN        TO DATABASE-MCFLCSNFTA
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                                WITH DUPLICATES
               FILE STATUS   IS FILE-STATUS.

           SELECT DVENDOR-I
               ASSIGN        TO DATABASE-MCFLCS0701
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                                WITH DUPLICATES
               FILE STATUS   IS FILE-STATUS.

           SELECT REPORT-FILE
               ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE
               ASSIGN TO DISK-SORT.

       DATA DIVISION.
       FILE SECTION.
       FD  NFTA-I
           LABEL RECORDS ARE STANDARD.
       01  NFTA-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCSNFTA.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0701.

       FD  REPORT-FILE
           DATA RECORD IS REPORT-FILE-REC.
       01  REPORT-FILE-REC      PIC X(80).

       SD  SORT-FILE
           RECORD CONTAINS 42 CHARACTERS.
       01  SORT-REC.
           05  FILLER           PIC X.
           05  SORT-KEY-3       PIC X(13).
           05  SORT-KEY-2       PIC X(10).
           05  FILLER           PIC X(8).
           05  FILLER           PIC X(6).
           05  SORT-KEY-1       PIC X(4).

       WORKING-STORAGE SECTION.

      *----------------------------------------------------------------*
      *             D A T A B A S E   B U F F E R S                    *
      *----------------------------------------------------------------*

       COPY NFTAFILE IN COPYLIB.

       COPY DVENDOR IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

      *----------------------------------------------------------------*
      *                    H O L D   A R E A S                         *
      *----------------------------------------------------------------*

       01  PAGE-NUM                      PIC 9(3) VALUE 0.
       01  NUM-LINES                     PIC 9(2) VALUE 0.

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X    VALUE "0".
           05  FILE-STATUS-2             PIC X    VALUE "0".

       01  NFTAFILE-EOF-SW               PIC X    VALUE "N".
       01  SORT-EOF-SW                   PIC X    VALUE "N".

       01  DATE-ARG.
           05  ARG-CC                    PIC X(2).
           05  ARG-YMD.
               10  ARG-YY                PIC X(2).
               10  ARG-MM                PIC X(2).
               10  ARG-DD                PIC X(2).

       01  DATE-ARG-2.
           05  ARG-CC-2                  PIC X(2).
           05  ARG-YMD-2.
               10  ARG-YY-2              PIC X(2).
               10  ARG-MM-2              PIC X(2).
               10  ARG-DD-2              PIC X(2).

       01  CURRENT-DATE                    VALUE SPACES.
           05  CUR-YY             PIC X(2).
           05  CUR-YY-9   REDEFINES  CUR-YY  PIC 9(2).
           05  CUR-MM             PIC X(2).
           05  CUR-MM-9   REDEFINES  CUR-MM  PIC 9(2).
           05  CUR-DD             PIC X(2).

       01  CURRENT-YEAR           PIC 9(4).
       01  CURRENT-YEAR-R  REDEFINES  CURRENT-YEAR.
           05  CY-CC              PIC 9(2).
           05  CY-YY              PIC 9(2).

       01  CURRENT-TIME                    VALUE SPACES.
           05  CUR-HR             PIC X(2).
           05  CUR-MIN            PIC X(2).
           05  CUR-SEC            PIC X(2).

       01  MONTH-ENTRIES.
           05  FILLER             PIC X(9)  VALUE " JANUARY ".
           05  FILLER             PIC X(9)  VALUE " FEBRUARY".
           05  FILLER             PIC X(9)  VALUE "  MARCH  ".
           05  FILLER             PIC X(9)  VALUE "  APRIL  ".
           05  FILLER             PIC X(9)  VALUE "   MAY   ".
           05  FILLER             PIC X(9)  VALUE "   JUNE  ".
           05  FILLER             PIC X(9)  VALUE "   JULY  ".
           05  FILLER             PIC X(9)  VALUE "  AUGUST ".
           05  FILLER             PIC X(9)  VALUE "SEPTEMBER".
           05  FILLER             PIC X(9)  VALUE " OCTOBER ".
           05  FILLER             PIC X(9)  VALUE " NOVEMBER".
           05  FILLER             PIC X(9)  VALUE " DECEMBER".

       01  MONTH-TABLE REDEFINES MONTH-ENTRIES.
           05  MONTH-VALUE  OCCURS 12 TIMES  PIC X(9).

       01  ROUTE-NAME             PIC X(20).

      *----------------------------------------------------------------*
      *               R E P O R T   L I N E S                          *
      *----------------------------------------------------------------*

       01  ROUTE-1.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(35) VALUE ALL "*".
           05  FILLER             PIC X(40) VALUE SPACES.

       01  ROUTE-2.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(35) VALUE
               "*                                 *".
           05  FILLER             PIC X(40) VALUE SPACES.

       01  ROUTE-3.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(35) VALUE
               "*  PLEASE ROUTE THIS REPORT TO:   *".
           05  FILLER             PIC X(40) VALUE SPACES.

       01  ROUTE-4.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(8)  VALUE "*       ".
           05  R4-NAME            PIC X(20).
           05  FILLER             PIC X(7)  VALUE "      *".
           05  FILLER             PIC X(40) VALUE SPACES.

       01  HEADING-1.
           05  H1-DATE            PIC X(8).
           05  FILLER             PIC X(12) VALUE SPACES.
           05  FILLER             PIC X(41) VALUE
             "N A F T A   T R A C K I N G   R E P O R T".
           05  FILLER             PIC X(11) VALUE SPACES.
           05  FILLER             PIC X(8)  VALUE "TNFTARPT".

       01  HEADING-2.
           05  H2-HR              PIC X(2).
           05  FILLER             PIC X     VALUE ":".
           05  H2-MIN             PIC X(2).
           05  FILLER             PIC X     VALUE ":".
           05  H2-SEC             PIC X(2).
           05  FILLER             PIC X(18) VALUE SPACES.
           05  MONTHLY-HDG.
               10  FILLER         PIC X(7).
               10  H2-MONTH       PIC X(9).
               10  FILLER         PIC X.
               10  H2-CENT        PIC X(2).
               10  H2-YEAR        PIC X(2).
               10  FILLER         PIC X(7).
           05  FILLER             PIC X(18) VALUE SPACES.
           05  FILLER             PIC X(5)  VALUE "PAGE ".
           05  H2-PAGE-NUM        PIC ZZ9.

       01  HEADING-3.
           05  FILLER             PIC X(4)  VALUE "BUYR".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(10) VALUE "  VENDOR  ".
           05  FILLER             PIC X(4)  VALUE SPACES.
           05  FILLER             PIC X(9)  VALUE "PO NUMBER".
           05  FILLER             PIC X(6)  VALUE SPACES.
           05  FILLER             PIC X(4)  VALUE "DATE".
           05  FILLER             PIC X(3)  VALUE SPACES.
           05  FILLER             PIC X(4)  VALUE "TIME".
           05  FILLER             PIC X(2)  VALUE SPACES.
           05  FILLER             PIC X(11) VALUE "VENDOR NAME".
           05  FILLER             PIC X(22) VALUE SPACES.

       01  HEADING-4.
           05  FILLER             PIC X(4)  VALUE ALL "-".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(10) VALUE ALL "-".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(15) VALUE ALL "-".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(8)  VALUE ALL "-".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(5)  VALUE ALL "-".
           05  FILLER             PIC X     VALUE SPACES.
           05  FILLER             PIC X(33) VALUE ALL "-".

       01  DETAIL-LINE.
           05  DET-BUYER          PIC X(4).
           05  FILLER             PIC X     VALUE SPACES.
           05  DET-VEN-CODE       PIC X(10).
           05  FILLER             PIC X     VALUE SPACES.
           05  DET-PO             PIC X(7).
           05  FILLER             PIC X     VALUE "-".
           05  DET-RLSE           PIC X(3).
           05  FILLER             PIC X     VALUE "-".
           05  DET-RCVR           PIC X(3).
           05  FILLER             PIC X     VALUE SPACES.
           05  DET-DATE           PIC X(8).
           05  FILLER             PIC X     VALUE SPACES.
           05  DET-TIME           PIC X(5).
           05  FILLER             PIC X     VALUE SPACES.
           05  DET-VEN-NAME       PIC X(33).

      *----------------------------------------------------------------*
      *               U T I L I T Y   A R E A                          *
      *----------------------------------------------------------------*

       COPY TBLOWUP    IN COPYLIB.

       COPY VCOMAREA   IN COPYLIB.

       COPY DATAB      IN COPYLIB.


      *--------- P R O C E D U R E   D I V I S I O N ------------------*

       PROCEDURE DIVISION.

       MAINLINE SECTION.
       0-MAINLINE-BEGIN.
           PERFORM 1-HSK.
           SORT SORT-FILE
               ON ASCENDING KEY SORT-KEY-1
                                SORT-KEY-2
                                SORT-KEY-3
               INPUT  PROCEDURE IS 7-PROCESS-NFTAFILE
               OUTPUT PROCEDURE IS 8-PRINT-REPORT.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN INPUT  NFTA-I
                       DVENDOR-I
                OUTPUT REPORT-FILE.

           ACCEPT CURRENT-DATE FROM DATE.
           ACCEPT CURRENT-TIME FROM TIME.

           MOVE 1            TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT   TO  H1-DATE.
           MOVE CUR-HR       TO  H2-HR.
           MOVE CUR-MIN      TO  H2-MIN.
           MOVE CUR-SEC      TO  H2-SEC.

           PERFORM 10-MONTHLY-HEADING.

           PERFORM 12-ROUTING-INFO.

           PERFORM 8-62-PRINT-HEADINGS.

       10-MONTHLY-HEADING.
           MOVE SPACES              TO  MONTHLY-HDG.
           MOVE CUR-YY-9            TO  CY-YY.
           IF CUR-YY-9 < 90
               MOVE 20              TO  CY-CC
           ELSE
               MOVE 19              TO  CY-CC.
           SUBTRACT 1             FROM  CUR-MM-9.
           IF CUR-MM-9 < 1
               MOVE 12              TO  CUR-MM-9
               SUBTRACT 1         FROM  CURRENT-YEAR
               MOVE CY-YY           TO  CUR-YY-9.
           MOVE CUR-MM              TO  ARG-MM.
           MOVE 01                  TO  ARG-DD.
           MOVE CUR-YY-9            TO  H2-YEAR
                                        ARG-YY.
           IF CUR-YY < "90"
               MOVE "20"            TO  H2-CENT
                                        ARG-CC
           ELSE
               MOVE "19"            TO  H2-CENT
                                        ARG-CC.
           MOVE DATE-ARG            TO  DATE-ARG-2.
           MOVE "32"                TO  ARG-DD-2.
           DISPLAY "DATE-ARG:  " DATE-ARG.
           DISPLAY "DATE-ARG-2:  " DATE-ARG-2.
           MOVE MONTH-VALUE (CUR-MM-9)   TO  H2-MONTH.

       12-ROUTING-INFO.
           ACCEPT ROUTE-NAME.
           MOVE ROUTE-NAME TO  R4-NAME.

           WRITE REPORT-FILE-REC FROM HEADING-1 AFTER ADVANCING PAGE.
           WRITE REPORT-FILE-REC FROM ROUTE-1 AFTER ADVANCING 3.
           WRITE REPORT-FILE-REC FROM ROUTE-2 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-3 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-4 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-2 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-1 AFTER ADVANCING 1.

       2-EOJ.
           CLOSE       NFTA-I
                       DVENDOR-I
                       REPORT-FILE.

      *----------------------------------------------------------------*
      *                I N P U T   P R O C E D U R E                   *
      *----------------------------------------------------------------*

       7-PROCESS-NFTAFILE SECTION.
       7-BEGIN.
           PERFORM 7-1-HSK.
           PERFORM 7-6-PROCESS-A-REC
               UNTIL NFTAFILE-EOF-SW = "Y".
           GO TO 7-PROCESS-NFTAFILE-X.

       7-1-HSK.
           MOVE DATE-ARG TO DATECYMD OF NFTA-REC-I.
           START NFTA-I KEY >= DATECYMD OF NFTA-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
               MOVE "Y"             TO  NFTAFILE-EOF-SW
           ELSE
               PERFORM 7-60-READ-NEXT-NFTAFILE.

       7-6-PROCESS-A-REC.
           MOVE BUF-NFTAFILE        TO  SORT-REC.
           RELEASE SORT-REC FROM BUF-NFTAFILE.
           PERFORM 7-60-READ-NEXT-NFTAFILE.

       7-60-READ-NEXT-NFTAFILE.
           READ NFTA-I NEXT INTO BUF-NFTAFILE
               AT END MOVE "Y"     TO NFTAFILE-EOF-SW.
      *-------- STOP READING FILE IF MONTHLY REPORT AND NO MORE RECORDS
      *-------- FOR THAT MONTH EXIST.
           IF NFTAFILE-EOF-SW NOT = "Y"
               IF NFTA-DATE > DATE-ARG-2
                   MOVE "Y"    TO  NFTAFILE-EOF-SW.

       7-PROCESS-NFTAFILE-X.
           EXIT.

      *----------------------------------------------------------------*
      *              O U T P U T   P R O C E D U R E                   *
      *----------------------------------------------------------------*

       8-PRINT-REPORT SECTION.
       8-BEGIN.
           PERFORM 8-1-HSK.
           PERFORM 8-6-PRINT-RECORDS
               UNTIL SORT-EOF-SW = "Y".
           GO TO 8-PRINT-REPORT-X.

       8-1-HSK.
           RETURN SORT-FILE INTO BUF-NFTAFILE
               AT END MOVE "Y" TO SORT-EOF-SW.
           IF SORT-EOF-SW = "Y"
               MOVE "****** NO RECORDS QUALIFIED FOR REPORT ******"
                                TO  REPORT-FILE-REC
               WRITE REPORT-FILE-REC AFTER ADVANCING 2 LINES
               GO TO 8-PRINT-REPORT-X.

       8-6-PRINT-RECORDS.
           PERFORM 8-60-MOVE-FIELDS.
           PERFORM 8-61-WRITE-REPORT-LINE.
           RETURN SORT-FILE INTO BUF-NFTAFILE
               AT END MOVE "Y" TO SORT-EOF-SW.

       8-60-MOVE-FIELDS.
           MOVE NFTA-VEN-CODE      TO  DET-VEN-CODE.
           MOVE NFTA-PO            TO  DET-PO.
           MOVE NFTA-RLSE          TO  DET-RLSE.
           MOVE NFTA-RCVR          TO  DET-RCVR.
           MOVE 4                  TO  DATE-MODE.
           MOVE NFTA-YMD           TO  DATE-VALIDATE-IN.
           MOVE NFTA-BUYER         TO  DET-BUYER.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT     TO  DET-DATE.
           STRING NFTA-TIME (1:2) ":" NFTA-TIME (3:2)
               DELIMITED BY SIZE INTO DET-TIME.
           MOVE NFTA-VEN-CODE TO VENCDE OF DVENDOR-REC-I.
           MOVE "00"          TO VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "*** VENDOR NOT FOUND ***          "
                                   TO  DET-VEN-NAME
           ELSE
               MOVE VEN-NAME       TO  DET-VEN-NAME.

       8-61-WRITE-REPORT-LINE.
           WRITE REPORT-FILE-REC FROM DETAIL-LINE AFTER ADVANCING 2.
           ADD 2                 TO  NUM-LINES.
           IF NUM-LINES > 55
               PERFORM 8-62-PRINT-HEADINGS.

       8-62-PRINT-HEADINGS.
           ADD 1                 TO  PAGE-NUM.
           MOVE PAGE-NUM         TO  H2-PAGE-NUM.
           WRITE REPORT-FILE-REC FROM HEADING-1 AFTER ADVANCING PAGE.
           WRITE REPORT-FILE-REC FROM HEADING-2 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM HEADING-3 AFTER ADVANCING 2.
           WRITE REPORT-FILE-REC FROM HEADING-4 AFTER ADVANCING 1.
           MOVE 4                TO  NUM-LINES.

       8-PRINT-REPORT-X.
           EXIT.

