000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TNRQDESC.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        4/29/85.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.   THIS SUBPROGRAM RETURNS UP TO 5 LINES OF FREE-FORMAT
001000*           DESCRIPTION FOR ANY REQUISITION PASSED TO IT.
001100*
001200*
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  HP-3000.
001600 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DREQDESC
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

002000 DATA DIVISION.
       FILE SECTION.
       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

002100 WORKING-STORAGE SECTION.
002200
002300 77  SUB                     PIC 9(1)  VALUE 0.
002600
002700**************************************************************
002800**                                                          **
002900**            D A T A B A S E   W O R K                     **
003000**                                                          **
003100**************************************************************
003200
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

003300 01  DSET-NAMES.
003400     05  DSET-DREQDESC            PIC X(16) VALUE "DREQDESC;".
003500
003600 01  MODE-AREA.
003700     05  MODE1               PIC S9(4) COMP-4 VALUE 1.
003800     05  MODE5               PIC S9(4) COMP-4 VALUE 5.
003900     05  MODE7               PIC S9(4) COMP-4 VALUE 7.
004000
004100 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
004200 01  REQ-SEARCH                    PIC X(11) VALUE "REQ-NUMBER;".
004300
004400**************************************************************
004500**                                                          **
004600**           D A T A B A S E   B U F F E R S                **
004700**                                                          **
004800**************************************************************
004900
005000 COPY DREQDESC   IN COPYCSIS.
005100**************************************************************
005200**                                                          **
005300**                L I N K A G E   S E C T I O N             **
005400**                                                          **
005500**************************************************************
005600
005700 LINKAGE SECTION.
005800
005900 01  RET-CODE                   PIC S9(4) COMP-4.
006000 01  BASE                       PIC X(10).
006100
006200 COPY DBSTAT     IN COPYCSIS.
006300
006400 01  REQ-NUMBER                    PIC X(12).
006500
006600 01  REQ-DESC-AREA.
006700     05  RQD-LINES                 PIC S9(4) COMP-4.
006800     05  RQD-ITEMS-DESC OCCURS 5 TIMES.
006900         10  RQD-ITEM              PIC X(4).
007000         10  RQD-DESC              PIC X(80).
007100
007200 01  BU-DISPLAY-MSG-AREA.
007300     05  BU-DISPLAY-MSG            PIC X(48).
007400     05  BU-REQ-NUMBER             PIC X(12).
007500
007600 PROCEDURE DIVISION USING RET-CODE, BASE, STATUS-AREA,
007700  REQ-NUMBER, REQ-DESC-AREA, BU-DISPLAY-MSG-AREA.
007800
007900 6000-MAIN.
           MOVE 0 TO SUB.
           OPEN INPUT DREQDESC.
008000     MOVE SPACES TO RQD-DESC (1), RQD-DESC (2), RQD-DESC (3),
008100                    RQD-DESC (4), RQD-DESC (5).
008200
008300*    CALL "DBFIND" USING BASE, DSET-DREQDESC, MODE1,
008400*      STATUS-AREA, REQ-SEARCH, REQ-NUMBER.
           MOVE 0 TO COND-WORD.
           MOVE REQ-NUMBER TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
008500     IF COND-WORD NOT = 0
008600         MOVE "TNRQDESC DBFIND ERROR 6000-M" TO BU-DISPLAY-MSG
008700         MOVE 1                     TO RET-CODE
008800         MOVE REQ-NUMBER            TO BU-REQ-NUMBER
008900         GO TO 6990-MAIN-X.
009000
009100 6100-GET-REQDESC-LOOP.
009200*    CALL "DBGET" USING BASE, DSET-DREQDESC, MODE5,
009300*      STATUS-AREA, ALL-ITEMS, BUF-DREQDESC, REQ-NUMBER.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC NOT = REQ-NUMBER
               MOVE 15 TO COND-WORD.
009400     IF COND-WORD = 15
009500         GO TO 6990-MAIN-X
009600     ELSE
009700     IF COND-WORD NOT = 0
009800         MOVE "TNRQDESC ERR 6100-GDL" TO BU-DISPLAY-MSG
009900         MOVE 2                       TO  RET-CODE
010000         MOVE REQ-NUMBER              TO  BU-REQ-NUMBER
010100         GO TO 6990-MAIN-X.
010200
010300     IF REQDESC-LINE-NO = "95" OR "96"
010400         GO TO 6100-GET-REQDESC-LOOP.
010500
010600     ADD 1 TO SUB.
010700     IF SUB > RQD-LINES
010800         GO TO 6990-MAIN-X.
010900
011000     MOVE REQDESC-DATA           TO  RQD-DESC (SUB).
011100     MOVE REQDESC-ITEM-NO        TO  RQD-ITEM (SUB).
011200
011300     GO TO 6100-GET-REQDESC-LOOP.
011400
011500 6990-MAIN-X.
           CLOSE DREQDESC.
011600     GOBACK.
