001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TNUMRECS.
001300 AUTHOR.              C.I.HILLES.
001400 DATE-WRITTEN.       JAN, 1991.
003200 DATE-COMPILED.
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.  HP-3000.
003700 OBJECT-COMPUTER.  HP-3000.
003800 SPECIAL-NAMES.  C01 IS NEW-PAGE.
004000
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT OBJECTS-FILE ASSIGN TO DATABASE-MCFPFD.

004600 DATA DIVISION.
004700 FILE SECTION.
004900 FD  PRINT-FILE
005000     LABEL RECORDS ARE OMITTED
005100     RECORD CONTAINS 132 CHARACTERS
005200     DATA RECORD IS PRINT-REC.
005300 01  PRINT-REC                  PIC X(132).
005500
       FD  OBJECTS-FILE
           LABEL RECORDS ARE STANDARD.
       01  OBJECTS-REC.
           COPY DDS-ALL-FORMATS  OF MCFPFD.

006200 WORKING-STORAGE SECTION.
       01  EOF-FLAG             PIC X(1).
       01  DETAIL-LINE.
           05  PRT-FILE         PIC X(10).
           05  FILLER           PIC X(2).
           05  PRT-RECS         PIC ZZZZZZZ9.

       LINKAGE SECTION.
       01  FILESPEC             PIC X(10).
       01  LIBRARY-NAME         PIC X(10).

022000 PROCEDURE DIVISION USING FILESPEC, LIBRARY-NAME.
022100 6000-MAIN.
           CALL "MCXDSPFD" USING FILESPEC, LIBRARY-NAME.
           OPEN INPUT OBJECTS-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE "N" TO EOF-FLAG.
           READ OBJECTS-FILE AT END MOVE "Y" TO EOF-FLAG.
           PERFORM UNTIL EOF-FLAG = "Y"
               MOVE MBFILE TO PRT-FILE
               MOVE MBNRCD TO PRT-RECS
               WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 1
               READ OBJECTS-FILE AT END MOVE "Y" TO EOF-FLAG
               END-READ
           END-PERFORM.
           CLOSE OBJECTS-FILE.
           CLOSE PRINT-FILE.
       6990-MAIN-X.
           GOBACK.
