       IDENTIFICATION DIVISION.
       PROGRAM-ID.        TOEMCMPL.
       AUTHOR.            CA YODER.
       DATE-WRITTEN.      OCTOBER 2000.
       DATE-COMPILED.
      *INSTALLATION.      THE GOODYEAR TIRE & RUBBER COMPANY.
      *
      ******************************************************************
      *D   T M N F C M P L                                             *
      *D                                                               *
      *D     THIS PROGRAM UPDATES THE "COMPLETE DATE" FIELD IN FILE    *
      *D     MCFPCSMANF FOR OEM RECORDS.                               *
      *D                                                               *
      ******************************************************************
      *  C H A N G E S :                                               *
      *                                                                *
      *C                                                               *
      *C  2/27/2001   CA YODER   (J. THOMAS REQUEST)                   *
      *C    IF "N/C" IS ENTERED IN BOTH MANUFACTURER NAME & PART       *
      *C    NUMBER FIELDS, MARK IT AS COMPLETE & SET TO "NONE".        *
      *C                                                               *
      ******************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.     IBM-AS400.
       OBJECT-COMPUTER.     IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MANUF-IO
               ASSIGN        TO DATABASE-MCFLCSMNF1
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                                WITH DUPLICATES
               FILE STATUS   IS FILE-STATUS.

           SELECT DMANPART-I
               ASSIGN        TO DATABASE-MCFLCS3603
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
                                WITH DUPLICATES
               FILE STATUS   IS FILE-STATUS.

           SELECT MSTORERM-I
               ASSIGN        TO DATABASE-MCFLCS0201
               ORGANIZATION  IS INDEXED
               ACCESS MODE   IS DYNAMIC
               RECORD KEY    IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS   IS FILE-STATUS.

           SELECT OEMMANF-I
               ASSIGN        TO DATABASE-OEMMANF
               ORGANIZATION  IS SEQUENTIAL
               ACCESS MODE   IS SEQUENTIAL
               FILE STATUS   IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MANUF-IO
           LABEL RECORDS ARE STANDARD.
       01  MANUF-REC-IO.
           COPY DDS-ALL-FORMATS OF MCFLCSMNF1.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  OEMMANF-I
           LABEL RECORDS ARE STANDARD.
       01  OEMMANF-REC-I.
           COPY DDS-ALL-FORMATS OF OEMMANF.

       WORKING-STORAGE SECTION.

       77  NUM-UPDATES            PIC 9(4)  VALUE 0.
       77  CODE-ARG               PIC X(8).
       77  HOLD-CODE              PIC X(8).
       77  SUB                    PIC 99   VALUE 0.
       77  SUBD                   PIC 9    VALUE 0.
       77  ALL-MNF-IN-LIST        PIC X    VALUE "Y".

      *----------------------------------------------------------------*
      *             D A T A B A S E   B U F F E R S                    *
      *----------------------------------------------------------------*

       COPY MANFFILE IN COPYLIB.

       COPY DMANPART IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

      *----------------------------------------------------------------*
      *                    H O L D   A R E A S                         *
      *----------------------------------------------------------------*

       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X    VALUE "0".
           05  FILE-STATUS-2             PIC X    VALUE "0".

       01  MANUF-EOF-SW                  PIC X    VALUE "N".
       01  OEMMANF-EOF-SW                PIC X    VALUE "N".
       01  DMANPART-EOF-SW               PIC X    VALUE "N".

       01  HOLD-COMPLDATE.
           05  HOLD-CC                   PIC X(2)   VALUE "20".
           05  HOLD-DATE                 PIC X(6).

       01  OEMMANF-TABLE.
           05  OEMMANF-VALUE   OCCURS 50 TIMES   INDEXED BY SUBT
                                  PIC X(26).

       01  OEM-HOLD-REC.
           05  OEM-CODE                  PIC X(8).
           05  OEM-KWM                   PIC X(50).
           05  OEM-MPN-TABLE   OCCURS 8 TIMES.
               10  OEM-MANUF             PIC X(26).
               10  OEM-PART              PIC X(20).

      *----------------------------------------------------------------*
      *               U T I L I T Y   A R E A                          *
      *----------------------------------------------------------------*

       COPY TBLOWUP    IN COPYLIB.

       COPY VCOMAREA   IN COPYLIB.

       COPY DATAB      IN COPYLIB.


      *--------- P R O C E D U R E   D I V I S I O N ------------------*

       PROCEDURE DIVISION.

       MAINLINE SECTION.
       0-MAINLINE-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN  INPUT DMANPART-I
                       MSTORERM-I
                       OEMMANF-I
                   I-O MANUF-IO.

           ACCEPT HOLD-DATE FROM DATE.

      *---------- LOAD MANUFACTURER TABLE.
           INITIALIZE OEMMANF-TABLE.
           READ OEMMANF-I AT END MOVE "Y" TO OEMMANF-EOF-SW.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 50
                                              OR OEMMANF-EOF-SW = "Y"
               MOVE OEMMANF-REC-I TO OEMMANF-VALUE (SUB)
               READ OEMMANF-I
                   AT END MOVE "Y" TO OEMMANF-EOF-SW
               END-READ
           END-PERFORM.

       2-EOJ.
           DISPLAY "NUMBER OF RECORDS UPDATED:  " NUM-UPDATES.

           CLOSE       MANUF-IO
                       MSTORERM-I
                       OEMMANF-I
                       DMANPART-I.

      *----------------------------------------------------------------*
      *               M A I N   P A R A G R A P H                      *
      *----------------------------------------------------------------*

       6-MAIN.

           PERFORM 9999-START-MNFFILE.
           PERFORM 9999-READ-NEXT-MNFFILE.
           PERFORM 60-UPDATE-RECS UNTIL MANUF-EOF-SW = "Y".

       60-UPDATE-RECS.
           IF MNF-TYPE = "O"
               PERFORM 61-UPDATE.
           PERFORM 9999-READ-NEXT-MNFFILE.

       61-UPDATE.
      *--------- IF CODE NO LONGER EXISTS IN MSTORERM, REMOVE ENTRY
      *--------- FROM MCFPCSMANF.
           MOVE MNF-CORP-CODE              TO  CODE-ARG.
           PERFORM 9999-READ-MSTORERM.
           IF FILE-STATUS = "23"
               DELETE MANUF-IO
           ELSE
           IF MNF-MANUF = "N/C" AND MNF-PARTNO = "N/C" AND
                                    MNF-COMPL-DATE = SPACES
               MOVE "X"                    TO  MNF-NONE
               MOVE "NONE"                 TO  MNF-MANUF
                                               MNF-PARTNO
               MOVE HOLD-COMPLDATE         TO  MNF-COMPL-DATE
               REWRITE MANUF-REC-IO FROM BUF-MNFFILE
               ADD 1 TO NUM-UPDATES
           ELSE
           IF MNF-COMPL-DATE = SPACES
               PERFORM 9999-START-DMANPART
               PERFORM 9999-READ-DMANPART
               MOVE MAN-CORPCODE           TO  HOLD-CODE
               MOVE 1                      TO  SUBD
               MOVE "Y"                    TO  ALL-MNF-IN-LIST
               PERFORM  62-SEARCH-MANF
                   UNTIL MAN-CORPCODE NOT = HOLD-CODE
                      OR  DMANPART-EOF-SW = "Y"
               IF ALL-MNF-IN-LIST = "Y"
      *----------------- SKIP CODE.
                   NEXT SENTENCE
               ELSE
      *----------------- CODE IS COMPLETE.
                   MOVE HOLD-COMPLDATE     TO  MNF-COMPL-DATE
                   IF MNF-CHG-DATE = SPACES
                       MOVE HOLD-COMPLDATE TO  MNF-CHG-DATE
                       MOVE "TOEMCMPL"     TO  MNF-CHG-USER
                       ACCEPT MNF-CHG-TIME FROM TIME
                   END-IF
                   REWRITE MANUF-REC-IO FROM BUF-MNFFILE
                   ADD 1 TO NUM-UPDATES
               END-IF.

       62-SEARCH-MANF.
           SET SUBT TO 1.
           SEARCH OEMMANF-VALUE VARYING SUBT
               AT END MOVE "N"         TO  ALL-MNF-IN-LIST
               WHEN OEMMANF-VALUE (SUBT) = MAN-NAME
                   NEXT SENTENCE.
           PERFORM 9999-READ-DMANPART.

      *----------------------------------------------------------------*
      *               U T I L I T Y   S E C T I O N                    *
      *----------------------------------------------------------------*

       9999-UTILITY SECTION.

       9999-START-MNFFILE.
           MOVE LOW-VALUES TO CORPCDE OF MANUF-REC-IO.
           START MANUF-IO KEY > CORPCDE OF MANUF-REC-IO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-MNFFILE.
           READ MANUF-IO NEXT INTO BUF-MNFFILE
               AT END MOVE "Y" TO MANUF-EOF-SW.

       9999-START-DMANPART.
           MOVE CODE-ARG TO CORPCDE OF DMANPART-REC-I.
           START DMANPART-I KEY = CORPCDE OF DMANPART-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-DMANPART.
           READ DMANPART-I NEXT INTO BUF-DMANPART
               AT END MOVE "Y" TO DMANPART-EOF-SW.

       9999-READ-MSTORERM.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

