       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TOEMUPDT.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       OCTOBER 2000.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM ALLOWS UPDATES OF THE RECORDS IN THE MISSING
      *D*   MANUFACTURER/PART NUMBER FILE (MCFPCSMANF) FOR THE OEM
      *D*   (TYPE = "O") RECORDS.
      *D*
      *C* CHANGES
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZMNFUPDT-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT MNFFILE-I
               ASSIGN         TO DATABASE-MCFLCSMNF1
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                              WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  MNFFILE-I
           LABEL RECORDS ARE STANDARD.
       01  MNFFILE-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCSMNF1.

       WORKING-STORAGE SECTION.

       77  SUB                      PIC 9.
       77  HOLD-MATL                PIC X(8).
       77  NUM-RECS                 PIC 9(4)   VALUE 0.

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *--- BUFFER FOR FIRST DISPLAY SCREEN.
       01  DE-BUF.
           05  DE-START             PIC X(8).
           05  DE-MSGLINE           PIC X(78).

      *--- BUFFER FOR SUBFILE SCREEN LINES.
       01  BUF-SCREEN.
           05  SC-CORP-CODE         PIC X(8).
           05  SC-NONE              PIC X.
           05  SC-MANUF             PIC X(26).
           05  SC-PARTNO            PIC X(20).

       01  BUF-MSGLINE.
           05  SC-MSGLINE           PIC X(78).

       COPY MANFFILE OF COPYLIB.

       01  END-LIST-MSG.
           05  FILLER               PIC X(52) VALUE
               "STARTING PAST END OF LIST; ENTER ANOTHER START VALUE".

       COPY CATREAD OF COPYLIB.

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  MNFFILE-EOF-SW          PIC X  VALUE "N".
       01  MORE-RECORDS            PIC X  VALUE "Y".
       01  ERR-SW                  PIC X  VALUE "N".

       01  REC-COUNT               PIC 9(5) VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       01  MATL-ARG                 PIC X(30).

       COPY TDATECHK IN COPYLIB.

       01  CLRTVMBRD-FILE           PIC X(10)  VALUE "MCFPPICT  ".
       01  CLRTVMBRD-CHGDATE        PIC X(13).

       01  HOLD-CHGDATE.
           05  HOLD-CC              PIC X(2)   VALUE "20".
           05  HOLD-DATE            PIC X(6).

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O       MNFFILE-I
                          DISPLAY-FILE.

      *--------- FIND OUT USER INFO.
           CALL "WHO"          USING MOD CAP LATTR
                               USERNAME GRPNAME ACCTNAME
                               HOMEGRP TERMNUM.

           ACCEPT HOLD-DATE FROM DATE.

       2-EOJ.
           CLOSE          MNFFILE-I
                          DISPLAY-FILE.

       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.
           MOVE SPACES    TO  MATL-ARG.

       6-DISPLAY-SCREEN.
           MOVE DE-BUF                  TO  DISPLAY-REC.
      *--- SHOW FIRST SCREEN WHERE DATA IS ENTERED.
           WRITE DISPLAY-REC FORMAT IS "OEMSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SCREEN WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           READ DISPLAY-FILE
               FORMAT IS "OEMSCRN"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SCREEN" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           MOVE DISPLAY-REC    TO DE-BUF.

       6-CHECK-ERRORS.
           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           MOVE DE-START       TO MATL-ARG.

       60-LOAD-SCREEN.

           INITIALIZE REC-COUNT.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
               FORMAT IS "OEMSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       61-GET-LIST.

           INITIALIZE BUF-SCREEN.
           PERFORM 64-LIST-RECORDS.

       62-SHOW-SCREEN.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC FROM BUF-MSGLINE
               FORMAT IS "OEMREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "OEMSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

      *--- WAIT FOR USER TO PRESS A KEY.
           READ DISPLAY-FILE
               FORMAT IS "OEMSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SFL" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.


       63-ACTION.

      *--- THE ENTER KEY IS TREATED THE SAME AS PRESSING THE F3 KEY.
           IF F3-KEY-USED
               MOVE "N" TO MNFFILE-EOF-SW
               GO TO 6-BEGIN.

      *--- VALIDATE ENTRIES.
           MOVE "Y" TO MORE-RECORDS.
           MOVE "N" TO ERR-SW.
           PERFORM VARYING REC-COUNT FROM 1 BY 1 UNTIL
                                        REC-COUNT > NUM-RECS
                      OR ERR-SW = "Y"
               READ SUBFILE DISPLAY-FILE RECORD
                   INTO BUF-SCREEN
                   FORMAT IS "OEMSFL"
                   INVALID KEY MOVE "N" TO MORE-RECORDS
               END-READ
               IF MORE-RECORDS = "Y"
                   IF SC-MANUF > SPACES AND SC-PARTNO = SPACES
      *-------------------- MUST ENTER PART NUMBER
                       MOVE "Y" TO ERR-SW
                       MOVE 16181 TO CATREAD-MSG-NUMBER
                       PERFORM 9999-CATREAD
                       MOVE CATREAD-MSG-TEXT TO SC-MSGLINE
                       MOVE ON-SWITCH TO IND (11) IND (99)
                       PERFORM 9999-REWRITE-SUBFILE
                   END-IF
                   IF SC-PARTNO > SPACES AND SC-MANUF = SPACES
      *-------------------- MUST ENTER MANUFACTURER
                       MOVE "Y" TO ERR-SW
                       MOVE 13061 TO CATREAD-MSG-NUMBER
                       PERFORM 9999-CATREAD
                       MOVE CATREAD-MSG-TEXT TO SC-MSGLINE
                       MOVE ON-SWITCH TO IND (10) IND (99)
                       PERFORM 9999-REWRITE-SUBFILE
                   END-IF
                   IF SC-NONE > SPACES AND (SC-PARTNO > SPACES
                                       OR  SC-MANUF > SPACES)
      *-------------------- ENTER "NONE" OR MNF/PART NO
                       MOVE "Y" TO ERR-SW
                       MOVE 20078 TO CATREAD-MSG-NUMBER
                       PERFORM 9999-CATREAD
                       MOVE CATREAD-MSG-TEXT TO SC-MSGLINE
                       MOVE ON-SWITCH TO IND (12) IND (99)
                       PERFORM 9999-REWRITE-SUBFILE
                   END-IF
                   IF ERR-SW = "N"
                       MOVE OFF-SWITCH TO IND (10) IND (11) IND (99)
                       PERFORM 9999-REWRITE-SUBFILE
                   END-IF
               END-IF
           END-PERFORM.

           IF ERR-SW = "Y"
               GO TO 62-SHOW-SCREEN.

      *---- UPDATE MCFPCSMANF.
           PERFORM VARYING REC-COUNT FROM 1 BY 1 UNTIL
                                        REC-COUNT > NUM-RECS
               READ SUBFILE DISPLAY-FILE RECORD
                   INTO BUF-SCREEN
                   FORMAT IS "OEMSFL"
                   INVALID KEY MOVE "N" TO MORE-RECORDS
               END-READ
               IF (SC-MANUF > SPACES AND SC-PARTNO > SPACES)
                                     OR SC-NONE > " "
                   PERFORM 9999-FIND-MNFFILE-REC
                   IF SC-NONE = "X"
                       MOVE "NONE"       TO  MNF-MANUF
                       MOVE "NONE"       TO  MNF-PARTNO
                       MOVE "X"          TO  MNF-NONE
                       MOVE HOLD-CHGDATE TO  MNF-COMPL-DATE
                   ELSE
                       MOVE SC-MANUF     TO  MNF-MANUF
                       MOVE SC-PARTNO    TO  MNF-PARTNO
                   END-IF
                   MOVE HOLD-CHGDATE     TO  MNF-CHG-DATE
                   ACCEPT MNF-CHG-TIME FROM TIME
                   MOVE USERNAME         TO  MNF-CHG-USER
                   REWRITE MNFFILE-I-REC FROM BUF-MNFFILE
                       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                   END-REWRITE
      *            DISPLAY "REWRITE FILE-STAT: " FILE-STATUS
               END-IF
           END-PERFORM.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
               FORMAT IS "OEMSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SFL CLEAR" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).
           GO TO 6-BEGIN.

       64-LIST-RECORDS.

           MOVE "N" TO MNFFILE-EOF-SW.
           PERFORM 9999-START-MNFFILE.

           IF FILE-STATUS NOT = "00"
               INITIALIZE DE-BUF
      *       ***  START PAST END OF LIST ***
               MOVE END-LIST-MSG          TO DE-MSGLINE
               MOVE ON-SWITCH             TO IND (60)
               MOVE DE-BUF                TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           PERFORM 9999-READ-NEXT-MNFFILE.

           PERFORM UNTIL MNFFILE-EOF-SW = "Y"

      *------- ONLY DISPLAY RECORDS THAT DO NOT HAVE MANUFACTURER &
      *------- PART NUMBER FILLED IN.
             IF MNF-MANUF = SPACES AND MNF-PARTNO = SPACES
                                   AND MNF-TYPE = "O"
                                   AND MNF-COMPL-DATE = SPACES
      *------- MOVE FIELDS TO DISPLAY RECORD.
               MOVE MNF-CORP-CODE    TO  SC-CORP-CODE
               MOVE MNF-MANUF        TO  SC-MANUF
               MOVE MNF-PARTNO       TO  SC-PARTNO
               MOVE SPACE            TO  SC-NONE

      *------- MOVE THE SCREEN BUFFER AND WRITE OUT.
               MOVE BUF-SCREEN            TO DISPLAY-REC
               ADD 1                      TO REC-COUNT
               IF REC-COUNT > 9999
                   MOVE "SUBFILE TOO SMALL-INCREASE ZMNFUPDT"
                       TO BU-DISPLAY-MSG
                   MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
                   GO TO 9999-BLOWUP
               END-IF
               WRITE SUBFILE DISPLAY-REC
                   FORMAT IS "OEMSFL"
                   INDICATORS ARE SRF-INDICATORS
               IF DISPLAY-STATUS NOT = "00"
                   MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
                   MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
                   MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
                   GO TO 9999-BLOWUP
               END-IF
             END-IF
               INITIALIZE BUF-SCREEN
               PERFORM 9999-READ-NEXT-MNFFILE
           END-PERFORM.
           MOVE REC-COUNT TO NUM-RECS.
           IF REC-COUNT = 0

               INITIALIZE DE-BUF
      *       ***  START PAST END OF LIST ***
               MOVE END-LIST-MSG          TO DE-MSGLINE
               MOVE ON-SWITCH             TO IND (60)
               MOVE DE-BUF                TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.


       6-MAIN-X.
           EXIT.

       9999-UTILITY SECTION.

       9999-START-MNFFILE.
           MOVE MATL-ARG TO CORPCDE OF MNFFILE-I-REC.
           START MNFFILE-I KEY >= CORPCDE OF MNFFILE-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-MNFFILE.
           READ MNFFILE-I NEXT INTO BUF-MNFFILE
               AT END MOVE "Y" TO MNFFILE-EOF-SW.

       9999-FIND-MNFFILE-REC.
           MOVE SC-CORP-CODE TO CORPCDE OF MNFFILE-I-REC.
           READ MNFFILE-I INTO BUF-MNFFILE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-REWRITE-SUBFILE.
           REWRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
               FORMAT IS "OEMSFL"
               INDICATORS ARE SRF-INDICATORS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

       9999-BLOWUP.
           MOVE "TOEMUPDT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
