       IDENTIFICATION DIVISION.
       PROGRAM-ID. TOFFSITE.
      *REMARKS.    THIS PROGRAM SHOWS THE CURRENT CODES THAT ARE
      *D           STORED OFFSITE WHICH MAY OR MAY NOT BE REPAIRABLE.
      *C
      *C  SEPT 06, 1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM-FILE
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.
       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  MSTORERM-FILE
           LABEL RECORDS ARE STANDARD.
       01  MF-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.
       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE           PIC X(132).
008000 SD  SORT-FILE
008100     RECORD CONTAINS 80 CHARACTERS
008200     DATA RECORD IS SORTF.
008300 01  SORTF.
           05  SORT-CODE            PIC X(8).
           05  SORT-ONHAND          PIC S9(9).
           05  SORT-ONORDER         PIC S9(9).
           05  SORT-MAX             PIC S9(9).
           05  SORT-RETRIEVE        PIC S9(9).
           05  SORT-GREEN           PIC X(12).
           05  SORT-RED             PIC X(12).
           05  FILLER               PIC X(12).
       WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG       PIC X(1)   VALUE "Y".
       77  LINE-CTR                 PIC 99.
       77  RECDS-CTR                PIC 9(5).
       77  RETRIEVE-WORK            PIC S9(9).
       77  STOCK-WORK               PIC S9(9).
       77  TOTAL-ONHAND             PIC S9(9).
       77  TOTAL-ONORDER            PIC S9(9).
       77  TOTAL-MAX                PIC S9(9).
       77  TOTAL-RETRIEVE           PIC S9(9).
       01  BLOWUP-BASE              PIC X(16).
       01  CDATE.
           05 YY                    PIC 99.
           05 MM                    PIC 99.
           05 DD                    PIC 99.
       01  CODE-ARG                 PIC X(8).
       01  COMPANY-SAVE.
           05  COMPANY-SAVE-1-2     PIC X(2).
               88  AKRON-PLANT                VALUE "11".
           05  FILLER               PIC X(1).
       COPY DATAB    IN COPYLIB.
       01  DDATE.
           05 DMM                   PIC 99.
           05 FILLER                PIC X      VALUE "/".
           05 DDD                   PIC 99.
           05 FILLER                PIC X      VALUE "/".
           05 DYY                   PIC 99.
       01  DETAIL-1.
           05  FILLER               PIC X(6)   VALUE SPACE.
           05  D-CODE               PIC X(8)   VALUE SPACES.
           05  FILLER               PIC X(6)   VALUE SPACES.
           05  D-ONHAND             PIC Z(8)9.
           05  FILLER               PIC X(4)   VALUE SPACES.
           05  D-ONORDER            PIC Z(8)9.
           05  FILLER               PIC X(5)   VALUE SPACES.
           05  D-MAX                PIC Z(8)9.
           05  FILLER               PIC X(5)   VALUE SPACE.
           05  D-RETRIEVE           PIC Z(8)9-.
           05  FILLER               PIC X(2)   VALUE SPACE.
           05  D-GREEN              PIC X(12)  VALUE SPACES.
           05  FILLER               PIC X(2)   VALUE SPACE.
           05  D-RED                PIC X(12)  VALUE SPACES.
       01  FILE-STATUS              PIC XX.
       01  HEADER-0.
           05  FILLER               PIC X(10)  VALUE SPACES.
           05  FILLER               PIC X(25)
               VALUE "PARTS TO BE BROUGHT BACK ".
           05  FILLER               PIC X(20)
               VALUE "FROM OFFSITE STORAGE".
           05  FILLER               PIC X(17) VALUE SPACES.
           05  H0-DATE              PIC X(8)  VALUE SPACES.
       01  HEADER-1.
           05  FILLER               PIC X     VALUE SPACE.
           05  FILLER               PIC X(38)
               VALUE "*OFFGREEN - parts not requiring repair".
           05  FILLER               PIC X(6)  VALUE SPACES.
           05  FILLER               PIC X(34)
               VALUE "*OFFRED   - parts requiring repair".
           05  FILLER               PIC X     VALUE SPACE.
       01  HEADER-2.
           05  FILLER               PIC X(6)  VALUE SPACE.
           05  FILLER               PIC X(7)  VALUE "CORPCDE".
           05  FILLER               PIC X(9)  VALUE SPACES.
           05  FILLER               PIC X(6)  VALUE "ONHAND".
           05  FILLER               PIC X(7)  VALUE SPACES.
           05  FILLER               PIC X(7)  VALUE "ONORDER".
           05  FILLER               PIC X(11) VALUE SPACES.
           05  FILLER               PIC X(3)  VALUE "MAX".
           05  FILLER               PIC X(6)  VALUE SPACES.
           05  FILLER               PIC X(8)  VALUE "RETRIEVE".
           05  FILLER               PIC X(3)  VALUE SPACES.
           05  FILLER               PIC X(8)  VALUE "OFFGREEN".
           05  FILLER               PIC X(6)  VALUE SPACES.
           05  FILLER               PIC X(12) VALUE "OFFRED   ".
           05  FILLER               PIC X(49) VALUE SPACES.
       01  HEADER-U.
           05  FILLER               PIC X(96) VALUE ALL "-".
       COPY IOFEEDBACK IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       COPY MPLTINFO   IN COPYLIB.
       COPY MSTORERM   IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.
       01  PLT-ARG                  PIC X(4)  VALUE SPACES.
       COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY VCOMLINK   IN COPYLIB.
       COPY SONORDER IN COPYLIB.
       01  TOTAL-1.
           05  FILLER               PIC X(12) VALUE "FINAL TOTALS".
           05  FILLER               PIC X(08) VALUE SPACES.
           05  T-ONHAND             PIC Z(8)9.
           05  FILLER               PIC X(4)   VALUE SPACES.
           05  T-ONORDER            PIC Z(8)9.
           05  FILLER               PIC X(5)   VALUE SPACES.
           05  T-MAX                PIC Z(8)9.
           05  FILLER               PIC X(5)   VALUE SPACE.
           05  T-RETRIEVE           PIC Z(8)9-.
           05  FILLER               PIC X(7).
       01  TOTAL-2.
           05  FILLER               PIC X(6)  VALUE "COUNT ".
           05  T-RECDS              PIC Z(4)9.
           05  FILLER               PIC X(69) VALUE SPACES.

       PROCEDURE DIVISION.
       START-PGM SECTION.
       BEGIN-PGM.
           PERFORM 1-HSK.
           SORT SORT-FILE ON ASCENDING KEY SORT-CODE
               INPUT PROCEDURE  7-SORT-RECORDS
               OUTPUT PROCEDURE 8-WRITE-OUTPUT.
       2-EOJ.
           CLOSE MPLTINFO-PK-I.
           CLOSE MSTORERM-FILE.
           CLOSE ONLINE-PRT.
           GOBACK.
       2-BLOWUP.
           MOVE "TOFFSITE" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.
       1-HSK.
           OPEN INPUT  MPLTINFO-PK-I.
           OPEN INPUT  MSTORERM-FILE.
           MOVE "MCPRT"          TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           ACCEPT CDATE          FROM DATE.
           MOVE CDATE            TO H0-DATE.
           MOVE MM               TO DMM.
           MOVE DD               TO DDD.
           MOVE YY               TO DYY.
           MOVE 59               TO LINE-CTR.
           MOVE 0                TO RECDS-CTR.
           MOVE "P 01"           TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE MPLTINFO-COMPANY TO  COMPANY-SAVE.
       COPY OVRPFCALL IN COPYLIB.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2-BLOWUP.

       7-SORT-RECORDS SECTION.
       7-SR.
           READ MSTORERM-FILE NEXT INTO BUF-MSTORERM
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
           IF COND-WORD = 11 GO TO 7-SR-EXIT.
           IF CORP-CODE = "NON-STR " GO TO 7-SR.
           IF STR-LOC-1-2 (5) = "SU" OR STR-LOC-1-2 (6) = "SU"
               NEXT SENTENCE
           ELSE
           GO TO 7-SR.
           MOVE CORP-CODE            TO CODE-ARG.
           MOVE "Y"                  TO SONORDER-CALC-DIR-ORD-SW.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SONORDER" USING BASE,
                                 CODE-ARG,
                                 SONORDER-PARMS,
                                 COMPANY-SAVE,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           IF COMPANY-SAVE-1-2 = "11"
               MOVE SONORDER-TOTAL-ONORDER TO SORT-ONORDER
           ELSE
           MOVE SONORDER-STR-ONORDER TO SORT-ONORDER.
           IF STR-LOC-1-2 (5) = "SU"
               COMPUTE STOCK-WORK = STR-ONHAND + SORT-ONORDER
               COMPUTE RETRIEVE-WORK = STOCK-WORK - STR-REORDER
               IF RETRIEVE-WORK < 0
                   MOVE SPACES       TO SORT-RED
                   MOVE STR-LOC (5)  TO SORT-GREEN
               ELSE
               GO TO 7-SR
           ELSE
           IF STR-LOC-1-2 (6) = "SU"
               COMPUTE STOCK-WORK = STR-ONHAND + SORT-ONORDER
               COMPUTE RETRIEVE-WORK = STOCK-WORK - STR-REORDER
               IF RETRIEVE-WORK < 0
                   MOVE SPACES       TO SORT-GREEN
                   MOVE STR-LOC (6)  TO SORT-RED
               ELSE
               GO TO 7-SR
           ELSE
           GO TO 7-SR.
           MOVE CORP-CODE            TO SORT-CODE.
           MOVE STR-ONHAND           TO SORT-ONHAND.
           MOVE STR-MAX              TO SORT-MAX.
           MOVE RETRIEVE-WORK        TO SORT-RETRIEVE.
           RELEASE SORTF.
           GO TO 7-SR.
       7-SR-EXIT.    EXIT.

       8-WRITE-OUTPUT SECTION.
       8-WO.
           RETURN SORT-FILE AT END
               GO TO 8-WO-TOTALS.
           ADD 1                      TO RECDS-CTR.
           MOVE SORT-CODE             TO D-CODE.
           MOVE SORT-ONHAND           TO D-ONHAND.
           ADD SORT-ONHAND            TO TOTAL-ONHAND.
           MOVE SORT-ONORDER          TO D-ONORDER.
           ADD SORT-ONORDER           TO TOTAL-ONORDER.
           MOVE SORT-MAX              TO D-MAX.
           ADD SORT-MAX               TO TOTAL-MAX.
           MOVE SORT-RETRIEVE         TO D-RETRIEVE.
           ADD SORT-RETRIEVE          TO TOTAL-RETRIEVE.
           MOVE SORT-GREEN            TO D-GREEN.
           MOVE SORT-RED              TO D-RED.
           ADD 1                      TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER
                   ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-2 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
               WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1
               MOVE 5                 TO LINE-CTR
           ELSE
           WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1.
           GO TO 8-WO.

       8-WO-TOTALS.
           MOVE RECDS-CTR         TO T-RECDS.
           MOVE TOTAL-ONHAND      TO T-ONHAND.
           MOVE TOTAL-ONORDER     TO T-ONORDER.
           MOVE TOTAL-MAX         TO T-MAX.
           MOVE TOTAL-RETRIEVE    TO T-RETRIEVE.
           ADD 3                  TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER
                   ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-2 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
               WRITE PRINT-RCD FROM TOTAL-1  AFTER ADVANCING 1
               WRITE PRINT-RCD FROM TOTAL-2  AFTER ADVANCING 1
               GO TO 8-WO-EXIT
           ELSE
           WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
           WRITE PRINT-RCD FROM TOTAL-1  AFTER ADVANCING 1
           WRITE PRINT-RCD FROM TOTAL-2  AFTER ADVANCING 1
           GO TO 8-WO-EXIT.

       8-WO-EXIT.    EXIT.
