       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TOOIPINQ.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
      *REMARKS.       OPEN/ACTIVE VERBAL WORKORDER INQUIRY
      *               FOR THE CRAFTSMAN EXECUTIVE PROGRAM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          REQUESTOR IS WORK-STATION
                               SYSTEM-CONSOLE IS CONSOLE
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-ZONE-PRTY
                  ASSIGN       TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1002
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT LAB-CURR-STAT
                  ASSIGN       TO DATABASE-MCFLMM1602
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-CRAFTS-REQD
                  ASSIGN       TO DATABASE-MCFLMM0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCFTHELP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN       TO DISK-OOIPFILE
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-ZONE-PRTY
           LABEL RECORDS ARE STANDARD.
       01  ZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PERS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  LAB-CURR-STAT
           LABEL RECORDS ARE STANDARD.
       01  LC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  WO-CRAFTS-REQD
           LABEL RECORDS ARE STANDARD.
       01  CR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD CONTAINS 104 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  DEPT-OUT           PIC X(4).
           05  ZONE-OUT.
               10  Z-OUT          PIC X(4).
               10  P-OUT          PIC X.
               10  FILLER         PIC X.
           05  WOSTAT-OUT.
               10  WOSTAT-O-1     PIC X.
               10  WOSTAT-O-2     PIC X.
           05  WONUM-OUT.
               10  WONO-OUT       PIC X(7).
               10  WOSU-OUT       PIC X(3).
           05  WODESC-OUT         PIC X(30).
           05  EQNUM-OUT          PIC X(6).
           05  EQDOWN-OUT         PIC XX.
           05  DATE-RCVD.
               10  DATE-RCVD-MM   PIC XX.
               10  DATE-RCVD-DD   PIC XX.
               10  DATE-RCVD-YY   PIC XX.
           05  TIME-RCVD          PIC XXXX.
           05  TIME-COMP-OUT      PIC XXXX.
           05  CRAFTSREQ-OUT.
               10  C1-OUT         PIC XX.
               10  C2-OUT         PIC XX.
               10  C3-OUT         PIC XX.
           05  CMAN-1-OUT         PIC XXXX.
           05  CMAN-2-OUT         PIC XXXX.
           05  CMAN-3-OUT         PIC XXXX.
           05  TSTRT-OUT          PIC XXXX.
           05  RETM-OUT           PIC XXXX.
           05  DTIM-OUT           PIC XXXX.

       SD  SORT-FILE RECORD CONTAINS 104 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-DEPT               PIC X(4).
           05  SORT-ZONE.
               10  SORT-Z              PIC X(4).
               10  SORT-P              PIC X.
               10  FILLER              PIC X.
           05  SORT-WOSTAT             PIC X(2).
           05  SORT-WONUM.
               10  SORT-WONO           PIC X(7).
               10  SORT-WOSU           PIC X(3).
           05  SORT-WODESC             PIC X(30).
           05  SORT-EQNUM.
               10  SORT-EQ1            PIC X.
               10  SORT-EQ2            PIC X.
               10  SORT-EQ3            PIC X.
               10  SORT-EQ4            PIC X.
               10  SORT-EQ5            PIC X.
               10  SORT-EQ6            PIC X.
           05  SORT-EQDOWN             PIC XX.
           05  SORT-DATE-RCVD.
               10  SORT-DATE-RCVD-MM   PIC XX.
               10  SORT-DATE-RCVD-DD   PIC XX.
               10  SORT-DATE-RCVD-YY   PIC XX.
           05  SORT-TIME-RCVD          PIC XXXX.
           05  TIME-COMP-SORT          PIC XXXX.
           05  SORT-CRAFTSREQ.
               10  SORT-C1             PIC XX.
               10  SORT-C2             PIC XX.
               10  SORT-C3             PIC XX.
           05  CMAN-1-SORT             PIC XXXX.
           05  CMAN-2-SORT             PIC XXXX.
           05  CMAN-3-SORT             PIC XXXX.
           05  TSTRT-SORT              PIC XXXX.
           05  RETM-SORT               PIC XXXX.
           05  DTIM-SORT               PIC XXXX.

       WORKING-STORAGE SECTION.
       77  FIELD-CTR                   PIC 99        VALUE 0.
       77  PRTY-CTR                    PIC 99999     VALUE 0.
       77  EOF-SW                      PIC 9         VALUE 0.
       77  SCREEN-FLAG                 PIC 9         VALUE 0.
       77  STAT-SAVE                   PIC X(4)      VALUE SPACES.
       77  PRIORITY-TAG                PIC X.
       77  WONUM-SAVE                  PIC X(10)     VALUE SPACES.
       77  ACT-KEY                     PIC 9999.
       77  ARG-NO                      PIC S9(9) COMP-4.
       77  RECS-READ-CTR               PIC 9(4).
       77  RECORDS-PROCESSED-SW        PIC X         VALUE SPACE.
       77  ALL-RECORDS-WRITTEN-SW      PIC X         VALUE SPACE.
       77  DISP-STATUS                 PIC XX        VALUE SPACES.
       77  FIELD-HOLD                  PIC X(79).
       77  TRUE-VAL                    PIC 1         VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TOOIPINQ".
           05  PROGRAM-TYPE    PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC1A PIC X(30) VALUE
                   "ACTIVE VERBAL WORKORDER INQUIR".
               10  PROG-DESC2A PIC X(30) VALUE
                   "Y FROM EXECUTIVE PROGRAM.     ".
               10  PROG-DESC1B PIC X(30) VALUE
                   "DISPLAYS OO AND IP STATUS VERB".
               10  PROG-DESC2B PIC X(30) VALUE
                   "AL WORKORDERS BY ZONE.        ".
               10  PROG-FUNC1  PIC X(30) VALUE
                   "RUNS FROM THE f6 KEY OF THE EX".
               10  PROG-FUNC2  PIC X(30) VALUE
                   "ECUTIVE SECONDARY MENU.       ".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  TIME-BUFFER.
           05  CUR-TIME.
               10  CUR-HRS     PIC XX.
               10  CUR-MINS    PIC XX.
           05  CUR-SECS        PIC XXXX.

       01  CATREAD-BUFFER.
           05  CAT-TEXT-1      PIC X(08).
           05  STAT-CD         PIC X(02).
           05  CAT-TEXT-2      PIC X(66).

       01  FORMS-BUFFER.
           05  ZONE-BUF        PIC XXXX.
           05  CRAFT-BUF       PIC XX.
           05  EQNUM-BUF.
               10  EQ1         PIC X.
               10  EQ2         PIC X.
               10  EQ3         PIC X.
               10  EQ4         PIC X.
               10  EQ5             PIC X.
               10  EQ6             PIC X.
           05  CMDMSG1         PIC X(79).
           05  ERRMSG1         PIC X(79).

       01  SCREEN-DATA.
           05  FIELD-1         PIC X(79).
           05  FIELD-2         PIC X(79).
           05  FIELD-3         PIC X(79).
           05  FIELD-4         PIC X(79).
           05  FIELD-5         PIC X(79).
           05  FIELD-6         PIC X(79).
           05  FIELD-7         PIC X(79).
           05  FIELD-8         PIC X(79).
           05  FIELD-9         PIC X(79).
           05  FIELD-10        PIC X(79).
           05  FIELD-11        PIC X(79).
           05  FIELD-12        PIC X(79).
           05  FIELD-13        PIC X(79).
           05  FIELD-14        PIC X(79).
           05  FIELD-15        PIC X(79).
           05  FIELD-16        PIC X(79).
           05  FIELD-17        PIC X(79).
           05  FIELD-18        PIC X(79).
           05  FIELD-19        PIC X(79).
           05  FIELD-20        PIC X(79).
           05  FIELD-21        PIC X(79).
           05  FIELD-22        PIC X(79).
           05  FIELD-23        PIC X(79).
           05  CMDMSG2         PIC X(79).
           05  ERRMSG2         PIC X(79).

       01  DATE-TIME-HOLD.
           05  DATE-HOLD.
               10  DHOLD-MM    PIC 99.
               10  DHOLD-DD    PIC 99.
               10  DHOLD-YY    PIC 99.
           05  TIME-HOLD.
               10  THOLD-HH    PIC 99.
               10  THOLD-MM    PIC 99.

       01  SYS-DATE.
           05  SYSD-YY         PIC XX.
           05  SYSD-MM         PIC XX.
           05  SYSD-DD         PIC XX.

       01  DATE-TEMP.
           05  DT-MM           PIC XX.
           05  FILLER          PIC X     VALUE "/".
           05  DT-DD           PIC XX.
           05  FILLER          PIC X     VALUE "/".
           05  DT-YY           PIC XX.

       01  WORK-ARGUMENTS.
           05  ARGUMENT-DEFN.
               10  ARG-STATUS  PIC XX.
           05  ARG-DEFN.
               10  WO-NUM-ARG  PIC X(7).
               10  WO-SUFF-ARG PIC X(3).
           05  ARG-DEFN-3      PIC X(04).

       01  SHIFT-DATA.
           05  LINK-ZONE       PIC X(04).
           05  TIME-IN.
               10  HRS-IN      PIC 99.
               10  MIN-IN      PIC 99.
           05  CODE-BUF        PIC X.
           05  SHIFTS.
               10  S-1         PIC 9999.
               10  E-1         PIC 9999.
               10  S-2         PIC 9999.
               10  E-2         PIC 9999.
               10  S-3         PIC 9999.
               10  E-3         PIC 9999.
               10  S-4         PIC 9999.
               10  E-4         PIC 9999.
           05  CURR-SHIFT      PIC 9.

       01  COUNTERS.
           05  LINE-K          PIC S99.
           05  MASTER-COUNTERS.
               10  PRTY1-K     PIC 9(4).
               10  PRTY2-K     PIC 9(4).
               10  PRTY3-K     PIC 9(4).
               10  PRTY4-K     PIC 9(4).
               10  PRTY5-K     PIC 9(4).
               10  PRTY6-K     PIC 9(4).
           05  OO-COUNTERS.
               10  PRTY1-OO    PIC 9(4).
               10  PRTY2-OO    PIC 9(4).
               10  PRTY3-OO    PIC 9(4).
               10  PRTY4-OO    PIC 9(4).
               10  PRTY5-OO    PIC 9(4).
               10  PRTY6-OO    PIC 9(4).
           05  IP-COUNTERS.
               10  PRTY1-IP    PIC 9(4).
               10  PRTY2-IP    PIC 9(4).
               10  PRTY3-IP    PIC 9(4).
               10  PRTY4-IP    PIC 9(4).
               10  PRTY5-IP    PIC 9(4).
               10  PRTY6-IP    PIC 9(4).

       01  DETAIL-REC.
           05  DETAIL-PREFIX.
               10  WONUM-7             PIC X(7).
               10  FILLER              PIC X  VALUE "-".
               10  WONUM-3             PIC X(3).
               10  FILLER              PIC XX VALUE SPACES.
               10  EQNUM               PIC X(6).
               10  DN-DT-1.
                   15  FILLER          PIC XX VALUE SPACES.
                   15  EQDOWN          PIC XX.
                   15  FILLER          PIC XX VALUE SPACE.
               10  DN-DT-2             REDEFINES DN-DT-1.
                   15  FILLER          PIC X.
                   15  EQDTIM          PIC XXXX.
                   15  FILLER          PIC X.
               10  WODESC              PIC X(25).
           05  DREC-OO.
               10  FILLER              PIC XXX.
               10  DRCV-OO.
                   15  DRCV-MM         PIC XX.
                   15  DRCV-DD         PIC XX.
                   15  DRCV-YY         PIC XX.
               10  FILLER              PIC XXX.
               10  TRCV-OO             PIC 9(4).
               10  FILLER              PIC XXX.
               10  CRAFTSREQ-1-OO      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-2-OO      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-3-OO      PIC XX.
               10  FILLER              PIC XXX.
           05  DREC-IP                 REDEFINES DREC-OO.
               10  FILLER              PIC XXX.
               10  CCNUM-IP            PIC XXXX.
               10  FILLER              PIC XXX.
               10  TSTR-IP             PIC X(4).
               10  FILLER              PIC XXX.
               10  CRAFTSREQ-1-IP      PIC XX.
               10  FILLER              PIC X(11).

       01  HEADING-DT-TM.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "PRINT DATE:  ".
           05  P-DATE  PIC X(08).
           05  FILLER  PIC X(15) VALUE "        TIME:  ".
           05  P-TIME  PIC X(04).
           05  FILLER  PIC X(20) VALUE SPACES.

       01  HEADING-1-H.
           05  FILLER      PIC X(18) VALUE "     W/O STATUS:  ".
           05  WOSTAT-1-H  PIC X(04).
           05  FILLER      PIC X(18) VALUE "     MAINT ZONE:  ".
           05  MZ-1-H      PIC X(04).
           05  FILLER      PIC X(16) VALUE SPACES.
           05  FILLER      PIC X(07) VALUE "DATE:  ".
           05  DATE-1-H    PIC X(08).
           05  FILLER      PIC X(05) VALUE SPACES.

       01  HEADING-2-COMP.
           05  HEADING-2         PIC X(79).

       01  HEADING-2-OO.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(16) VALUE "   DRCV     TRCV".
           05  FILLER            PIC X(13) VALUE "   CRFT REQ  ".

       01  HEADING-2-IP.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(17) VALUE "   CC #   TSTR   ".
           05  FILLER            PIC X(12) VALUE "CRFT IP     ".

       01  HEADING-DOTS.
           05 FILLER  PIC X(79) VALUE ALL "-".

       01  LITERAL-1-L.
           05  FILLER            PIC X(09) VALUE "PRIORITY:".
           05  PRTY-1-L          PIC X(01).
           05  FILLER            PIC X(15) VALUE " ***TOTAL WORK ".
           05  FILLER            PIC X(09) VALUE "ORDERS = ".
           05  NUM-1-L           PIC ZZZ9.
           05  FILLER            PIC X(41) VALUE SPACES.

       01  ZONE-ARGUMENT.
           05  Z-ARG-4         PIC X(4).
           05  Z-ARG-5         PIC X VALUE "1".
           05  FILLER          PIC X VALUE SPACE.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  PER-PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  ZONE-DATA.
           COPY MZONPRTY       IN COPYLIB.

       01  CRAFT-DATA.
           COPY MWOCRAFT       IN COPYLIB.

       01  LABOR-CURR-STAT-DATA.
           COPY DCURRLBR       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.

       INITIALIZATION SECTION 01.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO INITIALIZE-PROC.
           GOBACK.

       INITIALIZE-PROC.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-ZONE-PRTY.
           OPEN INPUT          WO-CRAFTS-REQD.
           OPEN INPUT          WO-BASIC.
           OPEN INPUT          LAB-CURR-STAT.
           OPEN INPUT          PER-PERSONNEL.
           MOVE SPACES         TO MESSAGE-BUFFER.

      *********************************************************
      **  IF JCW `OOIPJCW' IS SET TO ANY NON-BLANK VALUE,    **
      **  THE PROGRAM WILL DISPLAY `IP' WORKORDERS FIRST,    **
      **  IF THE JCW IS BLANK, THE PROGRAM DEFAULTS TO       **
      **  DISPLAY `OO' WORKORDERS FIRST.                     **
      *********************************************************
           MOVE "OO"           TO DISP-STATUS.
           IF JCW-OOIPJCW-268 > " "
               MOVE "IP"       TO DISP-STATUS.

           ACCEPT SYS-DATE     FROM DATE.
           MOVE SYSD-MM        TO DT-MM DHOLD-MM.
           MOVE SYSD-DD        TO DT-DD DHOLD-DD.
           MOVE SYSD-YY        TO DT-YY DHOLD-YY.
           IF DATE-FLAG = 3
               MOVE SYSD-MM    TO DT-DD DHOLD-DD
               MOVE SYSD-DD    TO DT-MM DHOLD-MM.
           MOVE DATE-TEMP      TO P-DATE DATE-1-H.
           MOVE SPACES         TO FORMS-BUFFER.

       WRITE-SCREEN.
           MOVE 0              TO ACT-KEY.
           MOVE 0              TO PRTY-CTR.
           ACCEPT TIME-BUFFER  FROM TIME.
           MOVE CUR-TIME       TO P-TIME.
           MOVE SPACES         TO WORK-ARGUMENTS.
           MOVE SPACES         TO WONUM-SAVE.
           MOVE "N"            TO RECORDS-PROCESSED-SW
                                  ALL-RECORDS-WRITTEN-SW.
           MOVE ZEROS          TO COUNTERS.
           MOVE "VSELECT"      TO SCREEN-NAME.
           MOVE JCW-ZJCW-269   TO ZONE-FIELD ZONE-BUF.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE FORMS-BUFFER   TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO FORMS-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0 GO TO SHOWFORM.

       ZONE-VALIDATION.
           IF ZONE-BUF = SPACES
      **********************************************************************
      **    MESSAGE 052/001:
      ** ZONE IS REQUIRED
      **********************************************************************
               MOVE  52        TO CATREAD-MSG-SET
               MOVE   1        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2          TO FIELD-NUMBER
               PERFORM DB-ERROR
               GO TO SHOWFORM.

           MOVE ZONE-BUF       TO Z-ARG-4 MZ-1-H
           MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-ZONE-PRTY.
           READ WO-ZONE-PRTY   INTO ZONE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/044:
      ** INVALID ZONE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2          TO FIELD-NUMBER
               PERFORM DB-ERROR
               GO TO SHOWFORM.

           MOVE ZONE-BUF       TO JCW-ZJCW-269 SETJCW-VALUE.
           MOVE 269            TO SETJCW-STARTING-POS.
           MOVE 4              TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE
                               SETJCW-STARTING-POS
                               SETJCW-LENGTH
                               SETJCW-STATUS.

       CRAFT-VALIDATION.
           IF CRAFT-BUF = SPACES
               GO TO SORT-INPUT.

           MOVE CRAFT-BUF      TO CRAFTREQD OF WO-CRAFTS-REQD.
           READ WO-CRAFTS-REQD INTO CRAFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/037:
      ** INVALID CRAFT
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  37        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3          TO FIELD-NUMBER
               PERFORM DB-ERROR
               GO TO SHOWFORM.

       SORT-INPUT.
           SORT SORT-FILE ASCENDING KEY RETM-SORT SORT-P
                            SORT-EQNUM SORT-WONUM CMAN-1-SORT
               INPUT  PROCEDURE  SORT-IN-FILE
               OUTPUT PROCEDURE  SORT-WRITE-FILE.

       DISPLAY-OUTPUT.
           OPEN INPUT          OUT-FILE.
           MOVE "VFULSCRN"     TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA.

       STAND-PROC.
           MOVE OO-COUNTERS    TO MASTER-COUNTERS.
           PERFORM SETUP THRU SETUP-EXIT.
           PERFORM MAIN THRU MAIN-EXIT UNTIL
                       ALL-RECORDS-WRITTEN-SW = "Y".
           MOVE 1              TO KEY-HIT.
           GO TO END-OF-JOB.

       MAIN.
           IF FIELD-CTR > 22 OR LINE-K > 16
               MOVE  42        TO CATREAD-MSG-SET
               MOVE  69        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 4          TO FIELD-CTR
               PERFORM MAIN-SHOWFORM.

           MOVE SPACES         TO DETAIL-REC.
           MOVE WONO-OUT       TO WONUM-7.
           MOVE WOSU-OUT       TO WONUM-3.
           MOVE EQNUM-OUT      TO EQNUM.
           MOVE EQDOWN-OUT     TO EQDOWN.
           MOVE WODESC-OUT     TO WODESC.

           IF WOSTAT-OUT = "OO"
               PERFORM OO-DETAIL-RECORD
           ELSE
           IF WOSTAT-OUT = "IP"
               PERFORM IP-DETAIL-RECORD

           IF WONUM-OUT = WONUM-SAVE
               MOVE SPACES     TO DETAIL-PREFIX
               MOVE WONUM-OUT  TO WONUM-SAVE
           ELSE
               MOVE WONUM-OUT  TO WONUM-SAVE.

           IF P-OUT NOT = PRIORITY-TAG
               MOVE P-OUT      TO PRIORITY-TAG
               PERFORM PRTY-LITERAL.

           MOVE DETAIL-REC     TO FIELD-HOLD.
           PERFORM WRITE-FIELDS.
           IF FIELD-CTR > 22
               MOVE 1          TO SCREEN-FLAG.

           ADD 1               TO LINE-K.
           IF DETAIL-PREFIX NOT = SPACES
               ADD 1           TO PRTY-CTR.

           ADD 1               TO ACT-KEY.
           READ OUT-FILE       INVALID KEY
               PERFORM INVALID-KEY-FUNCTION
               MOVE "Y"        TO ALL-RECORDS-WRITTEN-SW
               GO TO MAIN-SHOWFORM.

           IF WOSTAT-OUT = STAT-SAVE
               NEXT SENTENCE
           ELSE
               MOVE STAT-SAVE  TO STAT-CD
               MOVE IP-COUNTERS TO MASTER-COUNTERS
               MOVE  31        TO CATREAD-MSG-SET
               MOVE  96        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT-1
               MOVE  31        TO CATREAD-MSG-SET
               MOVE 101        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO CAT-TEXT-2
               MOVE CATREAD-BUFFER TO MESSAGE-BUFFER
               MOVE WOSTAT-OUT TO WOSTAT-1-H STAT-SAVE
               MOVE SPACE      TO PRIORITY-TAG
               MOVE 24         TO LINE-K
               MOVE 1          TO SCREEN-FLAG.

           IF SCREEN-FLAG = 0
               GO TO MAIN-EXIT.
           MOVE 0              TO SCREEN-FLAG.

       MAIN-SHOWFORM.
           MOVE 0              TO LINE-K FIELD-CTR.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1
               MOVE "Y"        TO ALL-RECORDS-WRITTEN-SW
           ELSE
           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
               IF EOF-SW = 0
                   PERFORM HEADINGS
               ELSE
                   MOVE "Y"    TO ALL-RECORDS-WRITTEN-SW.

       MAIN-EXIT.    EXIT.

       OO-DETAIL-RECORD.
           MOVE DATE-RCVD      TO DRCV-OO.
           IF DATE-FLAG = 3
               MOVE DATE-RCVD-MM TO DRCV-DD
               MOVE DATE-RCVD-DD TO DRCV-MM.
           MOVE TIME-RCVD      TO TRCV-OO.
           MOVE C1-OUT         TO CRAFTSREQ-1-OO.
           MOVE C2-OUT         TO CRAFTSREQ-2-OO.
           MOVE C3-OUT         TO CRAFTSREQ-3-OO.

       IP-DETAIL-RECORD.
           MOVE CMAN-1-OUT     TO CCNUM-IP.
           MOVE TSTRT-OUT      TO TSTR-IP.
           MOVE C1-OUT         TO CRAFTSREQ-1-IP.

       INVALID-KEY-FUNCTION.
           MOVE  31            TO CATREAD-MSG-SET.
           MOVE  88            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 1              TO EOF-SW.

       SETUP.
           MOVE 0              TO EOF-SW.
           MOVE 1              TO ACT-KEY.
           READ OUT-FILE       INVALID KEY
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  11        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1          TO FIELD-NUMBER
               PERFORM DB-ERROR
               MOVE 1          TO KEY-HIT
               GO TO END-OF-JOB.

           MOVE WOSTAT-OUT     TO WOSTAT-1-H STAT-SAVE.
           PERFORM HEADINGS.
           MOVE P-OUT          TO PRIORITY-TAG.
           PERFORM PRTY-LITERAL.

       SETUP-EXIT.    EXIT.

       HEADINGS.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE HEADING-1-H    TO FIELD-1.
           IF WOSTAT-OUT = "OO"
               MOVE HEADING-2-OO TO HEADING-2
           ELSE
               MOVE HEADING-2-IP TO HEADING-2.
           MOVE HEADING-2-COMP TO FIELD-3.
           MOVE HEADING-DOTS   TO FIELD-4.
           MOVE 4              TO FIELD-CTR.

       PRTY-LITERAL.
           MOVE P-OUT          TO PRIORITY-TAG PRTY-1-L.
           IF PRTY-1-L = 1
               MOVE PRTY1-K    TO NUM-1-L
           ELSE
           IF PRTY-1-L = 2
               MOVE PRTY2-K    TO NUM-1-L
           ELSE
           IF PRTY-1-L = 3
               MOVE PRTY3-K    TO NUM-1-L
           ELSE
           IF PRTY-1-L = 4
               MOVE PRTY4-K    TO NUM-1-L
           ELSE
           IF PRTY-1-L = 5
               MOVE PRTY5-K    TO NUM-1-L
           ELSE
           IF PRTY-1-L = 6
               MOVE PRTY6-K    TO NUM-1-L.

           MOVE LITERAL-1-L    TO FIELD-HOLD.
           PERFORM WRITE-FIELDS.
           ADD 1               TO LINE-K.

       WRITE-FIELDS.
           ADD 1               TO FIELD-CTR.
           IF FIELD-CTR = 5
               MOVE FIELD-HOLD TO FIELD-5
           ELSE
           IF FIELD-CTR = 6
               MOVE FIELD-HOLD TO FIELD-6
           ELSE
           IF FIELD-CTR = 7
               MOVE FIELD-HOLD TO FIELD-7
           ELSE
           IF FIELD-CTR = 8
               MOVE FIELD-HOLD TO FIELD-8
           ELSE
           IF FIELD-CTR = 9
               MOVE FIELD-HOLD TO FIELD-9
           ELSE
           IF FIELD-CTR = 10
               MOVE FIELD-HOLD TO FIELD-10
           ELSE
           IF FIELD-CTR = 11
               MOVE FIELD-HOLD TO FIELD-11
           ELSE
           IF FIELD-CTR = 12
               MOVE FIELD-HOLD TO FIELD-12
           ELSE
           IF FIELD-CTR = 13
               MOVE FIELD-HOLD TO FIELD-13
           ELSE
           IF FIELD-CTR = 14
               MOVE FIELD-HOLD TO FIELD-14
           ELSE
           IF FIELD-CTR = 15
               MOVE FIELD-HOLD TO FIELD-15
           ELSE
           IF FIELD-CTR = 16
               MOVE FIELD-HOLD TO FIELD-16
           ELSE
           IF FIELD-CTR = 17
               MOVE FIELD-HOLD TO FIELD-17
           ELSE
           IF FIELD-CTR = 18
               MOVE FIELD-HOLD TO FIELD-18
           ELSE
           IF FIELD-CTR = 19
               MOVE FIELD-HOLD TO FIELD-19
           ELSE
           IF FIELD-CTR = 20
               MOVE FIELD-HOLD TO FIELD-20
           ELSE
           IF FIELD-CTR = 21
               MOVE FIELD-HOLD TO FIELD-21
           ELSE
           IF FIELD-CTR = 22
               MOVE FIELD-HOLD TO FIELD-22
           ELSE
           IF FIELD-CTR = 23
               MOVE FIELD-HOLD TO FIELD-23.

       END-OF-JOB.
           CLOSE               OUT-FILE.
           IF KEY-HIT = 1 GO TO WRITE-SCREEN.
           CLOSE               WO-ZONE-PRTY.
           CLOSE               WO-CRAFTS-REQD.
           CLOSE               WO-BASIC.
           CLOSE               LAB-CURR-STAT.
           CLOSE               PER-PERSONNEL.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       DB-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG1.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

       SORT-IN-FILE SECTION 02.
           MOVE "OO"           TO ARG-STATUS.
           MOVE ZEROS          TO MASTER-COUNTERS.
           MOVE "N"            TO RECORDS-PROCESSED-SW.
           MOVE 0 TO RECS-READ-CTR.
           PERFORM SORT-MAIN THRU SORT-M-EXIT UNTIL
                       RECORDS-PROCESSED-SW = "Y".
           MOVE MASTER-COUNTERS TO OO-COUNTERS.
           MOVE "IP"           TO ARG-STATUS.
           MOVE ZEROS          TO MASTER-COUNTERS.
           MOVE "N"            TO RECORDS-PROCESSED-SW.
           MOVE 0 TO RECS-READ-CTR.
           PERFORM SORT-MAIN THRU SORT-M-EXIT UNTIL
                       RECORDS-PROCESSED-SW = "Y".
           MOVE MASTER-COUNTERS TO IP-COUNTERS.
           GO TO SORT-IP-EXIT.

       SORT-MAIN.
           MOVE ARG-STATUS     TO WOSTATUS OF WO-BASIC.
           START WO-BASIC      KEY = WOSTATUS OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   MOVE "Y"        TO RECORDS-PROCESSED-SW
                   GO TO SORT-M-EXIT
               ELSE
                   STRING
                   "START WO-BASIC ERROR.  FILE-STATUS = " FILE-STAT
                   DELIMITED BY SIZE INTO ERRMSG2
                   MOVE 2      TO FIELD-NUMBER
                   PERFORM DB-ERROR
                   MOVE 1      TO KEY-HIT
                   GO TO END-OF-JOB.

           PERFORM SORT-DBGET THRU SORT-DBGET-EXIT.
           MOVE "Y"            TO RECORDS-PROCESSED-SW.

       SORT-M-EXIT.    EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ WO-BASIC       NEXT INTO WO-BASIC-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           ADD 1 TO RECS-READ-CTR.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO SORT-DBGET-EXIT
               ELSE
                   STRING
                   "READ WO-BASIC ERROR.  FILE-STATUS = " FILE-STAT
                   DELIMITED BY SIZE INTO ERRMSG2
                   MOVE 2      TO FIELD-NUMBER
                   PERFORM DB-ERROR
                   MOVE 1      TO KEY-HIT
                   GO TO END-OF-JOB.

           IF WO-STATUS NOT = ARG-STATUS
               GO TO SORT-DBGET-EXIT.

           IF ZONE-BUF NOT = ZONE OF WO-BASIC-DATA
               GO TO SORT-DBGET.

           IF TIME-RECD = SPACES
               MOVE ZEROS      TO TIME-RECD.
           IF TIME-RECD-HH > 23
               MOVE 00         TO TIME-RECD-HH.
           IF TIME-STRT = SPACES
               MOVE ZEROS      TO TIME-STRT.
           IF TIME-STRT-HH > 23
               MOVE 00         TO TIME-STRT-HH.
           IF TIME-COMP = SPACES
               MOVE ZEROS      TO TIME-COMP.
           IF TIME-COMP-HH > 23
               MOVE 00         TO TIME-COMP-HH.

           IF WO-STATUS = "OO"
               MOVE DATE-RECD  TO DATE-HOLD
               MOVE TIME-RECD  TO TIME-HOLD
           ELSE
           IF WO-STATUS = "IP"
               MOVE DATE-STRT  TO DATE-HOLD
               MOVE TIME-STRT  TO TIME-HOLD
           ELSE
               MOVE "000000"   TO DATE-HOLD
               MOVE "0000"     TO TIME-HOLD.

           MOVE ZONE           TO LINK-ZONE.
           MOVE TIME-HOLD      TO TIME-IN.
           CALL "TGETSHFT" USING SHIFT-DATA
                                 DBPARAMETERS.

           MOVE DEPT           TO SORT-DEPT.
           MOVE ZONE-PRIORITY  TO SORT-ZONE.
           MOVE WO-STATUS      TO SORT-WOSTAT.
           MOVE WO-NUM         TO SORT-WONUM.
           MOVE DESCRIPTION-1  TO SORT-WODESC.
           MOVE EQUIP-NUM      TO SORT-EQNUM.
           MOVE EQUIP-DOWN     TO SORT-EQDOWN.
           MOVE CRAFTS-REQD-1  TO SORT-C1.
           MOVE CRAFTS-REQD-2  TO SORT-C2.
           MOVE CRAFTS-REQD-3  TO SORT-C3.
           MOVE CRAFTSMEN-1    TO CMAN-1-SORT.
           MOVE CRAFTSMEN-2    TO CMAN-2-SORT.
           MOVE CRAFTSMEN-3    TO CMAN-3-SORT.

           IF WO-STATUS = DISP-STATUS
               MOVE 1          TO RETM-SORT
           ELSE
               MOVE 2          TO RETM-SORT.

           IF ARG-STATUS = "OO"
               MOVE DATE-RECD-YY TO SORT-DATE-RCVD-YY
               MOVE DATE-RECD-MM TO SORT-DATE-RCVD-MM
               MOVE DATE-RECD-DD TO SORT-DATE-RCVD-DD
               MOVE TIME-RECD    TO SORT-TIME-RCVD
           ELSE
               MOVE TIME-STRT  TO TSTRT-SORT
               MOVE SPACES     TO SORT-DATE-RCVD
               MOVE TIME-STRT  TO SORT-TIME-RCVD
               IF CRAFTSMEN-2 = SPACES
                   MOVE CRAFTSMEN-1 TO CMAN-1-SORT
               ELSE
               IF CRAFTSMEN-3 = SPACES
                   MOVE CRAFTSMEN-2 TO CMAN-1-SORT
               ELSE
                   MOVE CRAFTSMEN-3 TO CMAN-1-SORT.

           IF EQ1 = SORT-EQ1 OR SPACES
             IF EQ2 = SORT-EQ2 OR SPACES
               IF EQ3 = SORT-EQ3 OR SPACES
                 IF EQ4 = SORT-EQ4 OR SPACES
                   IF EQ5 = SORT-EQ5 OR SPACES
                     IF EQ6 = SORT-EQ6 OR SPACES
                         NEXT SENTENCE
                     ELSE
                         GO TO SORT-DBGET
                   ELSE
                       GO TO SORT-DBGET
                 ELSE
                     GO TO SORT-DBGET
               ELSE
                   GO TO SORT-DBGET
             ELSE
                 GO TO SORT-DBGET
           ELSE
               GO TO SORT-DBGET.

           IF CRAFT-BUF = SORT-C1 OR SORT-C2 OR SORT-C3 OR SPACES
               IF SORT-Z = ZONE-BUF
                   PERFORM SORT-RELEASE-REC THRU SORT-RR-EXIT
                   IF SORT-P = 1
                       ADD 1   TO PRTY1-K
                   ELSE
                   IF SORT-P = 2
                       ADD 1   TO PRTY2-K
                   ELSE
                   IF SORT-P = 3
                       ADD 1   TO PRTY3-K
                   ELSE
                   IF SORT-P = 4
                       ADD 1   TO PRTY4-K
                   ELSE
                   IF SORT-P = 5
                       ADD 1   TO PRTY5-K
                   ELSE
                   IF SORT-P = 6
                       ADD 1   TO PRTY6-K.

           GO TO SORT-DBGET.

       SORT-DBGET-EXIT.    EXIT.

       SORT-RELEASE-REC.
           IF ARG-STATUS = "IP"
               PERFORM IP-CHECK-LABOR
               GO TO SORT-RR-EXIT
           ELSE
               RELEASE SORT-REC.

       SORT-RR-EXIT.    EXIT.

       IP-CHECK-LABOR.
           MOVE WO-NUM         TO ARG-DEFN.
           MOVE SPACES         TO CMAN-1-SORT.
           MOVE ARG-DEFN       TO WONUM OF LAB-CURR-STAT.
           START LAB-CURR-STAT KEY = WONUM OF LAB-CURR-STAT
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
                   MOVE SPACES TO CMAN-1-SORT
                   MOVE SPACES TO TSTRT-SORT SORT-C1
                   RELEASE SORT-REC
               ELSE
                   STRING
                   "START LABOR-CURR-STAT ERROR.  FILE-STATUS = "
                       FILE-STAT
                   DELIMITED BY SIZE INTO ERRMSG2
                   MOVE 2      TO FIELD-NUMBER
                   PERFORM DB-ERROR
                   MOVE 1      TO KEY-HIT
                   GO TO END-OF-JOB
           ELSE
               PERFORM IP-DBGET THRU IP-DBG-EXIT.

       IP-DBGET.
           READ LAB-CURR-STAT  NEXT INTO LABOR-CURR-STAT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   IF CMAN-1-SORT = SPACES
                       MOVE SPACES TO TSTRT-SORT SORT-C1
                       RELEASE SORT-REC
                       GO TO IP-DBG-EXIT
                   ELSE
                       GO TO IP-DBG-EXIT
               ELSE
                   STRING
                   "READ LABOR-CURR-STAT ERROR.  FILE-STATUS = "
                       FILE-STAT
                   DELIMITED BY SIZE INTO ERRMSG2
                   MOVE 2      TO FIELD-NUMBER
                   PERFORM DB-ERROR
                   MOVE 1      TO KEY-HIT
                   GO TO END-OF-JOB.

           IF LCS-WO-NUM NOT = ARG-DEFN
               GO TO IP-DBG-EXIT.

           MOVE LCS-EMPL-NUM   TO CMAN-1-SORT.
           MOVE LCS-START-TIME TO TSTRT-SORT.
           PERFORM IP-GET-CRAFT.
           RELEASE SORT-REC.
           GO TO IP-DBGET.

       IP-DBG-EXIT.    EXIT.

       IP-GET-CRAFT.
           MOVE LCS-EMPL-NUM   TO ARG-DEFN-3.
           MOVE ARG-DEFN-3     TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PER-PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT-1 = "2"
               MOVE SPACES         TO SORT-C1
           ELSE
           IF FILE-STAT NOT = "00"
               STRING
               "READ PER-PERSONNEL ERROR.  FILE-STATUS = "
                   FILE-STAT
               DELIMITED BY SIZE INTO ERRMSG2
               MOVE 2      TO FIELD-NUMBER
               PERFORM DB-ERROR
               MOVE 1      TO KEY-HIT
               GO TO END-OF-JOB
           ELSE
               MOVE PER-CRAFT      TO SORT-C1.

       SORT-IP-EXIT.    EXIT.

       SORT-WRITE-FILE SECTION 03.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SORT-LOOP THRU SORT-LOOP-EXIT.
           CLOSE               OUT-FILE.
           GO TO SORT-WF-EXIT.

       SORT-LOOP.
           RETURN SORT-FILE AT END
               GO TO SORT-LOOP-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           IF SORT-WOSTAT = "OO  "
               MOVE SORT-DATE-RCVD-YY TO DATE-RCVD-YY
               MOVE SORT-DATE-RCVD-MM TO DATE-RCVD-MM
               MOVE SORT-DATE-RCVD-DD TO DATE-RCVD-DD.
           WRITE OUT-REC INVALID KEY
               GO TO SORT-LOOP-EXIT.
           GO TO SORT-LOOP.

       SORT-LOOP-EXIT.    EXIT.

       SORT-WF-EXIT.    EXIT.
