000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPADD1.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*        ########################################################
000700*        # This is the personnel basic information add program. #
000800*        # ---------------------------------------------------- #
000900*        ########################################################.
      *C
      *C  09/09/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    INCLUDE CENTURY FOR CSD DATE.
      *C
      *C  10/15/97  JEFF BUNGO
      *C    CHANGE THE CENTURY WINDOW FROM YEAR OF 70 TO YEAR
      *C    OF 40 FOR CONTINUOUS SERVICE DATE.
      *C
      *C  11/15/02  JEFF BUNGO
      *C    ADDED USERID TO THE PERSONNEL FILE (REQUIRED)
      *C
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.      AS400.
001400 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-CREW-MSTR
               ASSIGN TO DATABASE-MCFLMM3401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PCM-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
           SELECT WO-ZONE-PRTY-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-CREW-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PCMREC.
       01  PCMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3401.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.
       FD  WO-ZONE-PRTY-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPFREC.
       01  WZPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
001600 WORKING-STORAGE SECTION.
002900 01  ARG-VALUE                    PIC XX.
003000 01  ARG-VALUE1.
           05  ARG-ZONE                 PIC X(4).
           05  ARG-PRTY                 PIC XX VALUE "1 ".
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
003700 01  CREW-BUF                     PIC X(2).
004200 COPY TDATESUB OF COPYLIB.
003600 01  ERROR-BUFFER.
           05  FILLER                   PIC X(12).
           05  ERR-CC                   PIC XXXX.
           05  FILLER                   PIC X(64).
003100 01  FIELDNUM                     PIC S9(4) COMP-4.
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PCM-STATUS               PIC XX.
           05  PF-STATUS                PIC XX.
           05  WCRF-STATUS              PIC XX.
           05  WZPF-STATUS              PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPADD1  ".
001900     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A     PIC X(60) VALUE
002300             "PERSONNEL BASIC INFORMATION ADD PROGRAM "          .
002400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG       PIC X.
004000 01  PER-PERSONNEL.               COPY MPERSONL OF COPYLIB.
004100 COPY DBSTAT OF COPYLIB.
004400 01  TERM-BUFFER.
004500     05  TDATE-MD-OR-DM           PIC X(6).
004600     05  TERM-BUF-AREA.
004700         10  TBUF-CC-NO.
004800             15  TBUF-CC-NO-1     PIC X.
004900             15  FILLER           PIC XXX.
005000         10  TBUF-EMPL-NAME       PIC X(16).
005100         10  TBUF-CSD.
005200             15  TBUF-CSD-MM      PIC 99.
005300             15  TBUF-CSD-DD      PIC 99.
005400             15  TBUF-CSD-YY      PIC 99.
005500         10  TBUF-CRAFT           PIC XX.
005600         10  TBUF-MAINT-ZONE      PIC X(4).
005700         10  TBUF-DEPT            PIC X(4).
005800         10  TBUF-LABOR-RATE.
005900             15  TBUF-DOLLARS     PIC X(6).
006000             15  TBUF-CENTS       PIC X(4).
006100         10  TBUF-EMPL-RATE       PIC XX.
006200         10  TBUF-SHIFT-CREW.
006300             15 TBUF-SHIFT        PIC X.
006400             15 TBUF-CREW         PIC X.
               10  TBUF-USRID           PIC X(10).
           05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
003400 01  ZONE-SW                      PIC X.
006600 LINKAGE SECTION.
006700 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
006800 COPY VCOMLINK OF COPYLIB.
006900 01  PLT-IDT                      PIC X(4).
007100 01  CC-FIELD                     PIC X(4).
007200
007300 PROCEDURE DIVISION USING DBPARAMETERS
007400                          VIEW-COMAREA
007500                          PLT-IDT
007700                          CC-FIELD.
008600 BEGIN-PAR.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
011300 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-CREW-MSTR.
           CLOSE PERSONNEL-FILE.
           CLOSE WO-CRAFTS-REQD-FILE.
           CLOSE WO-ZONE-PRTY-FILE.
011500     GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PER-CREW-MSTR.
           OPEN I-O   PERSONNEL-FILE.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
           OPEN INPUT WO-ZONE-PRTY-FILE.
008700     MOVE SPACES TO ERROR-BUFFER.
007900     CALL "TPWORD" USING PASSWORD-INFORMATION.
008300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
009300     MOVE SPACES TO PER-PERSONNEL TERM-BUFFER.
           MOVE ZEROES TO TBUF-LABOR-RATE.
009400     MOVE CC-FIELD TO TBUF-CC-NO.
009500     MOVE DATE-FLAG TO DATE-CODE.
009600     IF DATE-FLAG = 1
009700         MOVE 39002 TO CATREAD-MSG-NUMBER
009900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
010000         MOVE ERROR-BUFFER TO TDATE-MD-OR-DM
010100     ELSE
010200     MOVE 30003 TO CATREAD-MSG-NUMBER
010400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
010500     MOVE ERROR-BUFFER TO TDATE-MD-OR-DM.
       6-MAIN.
008800     MOVE "FPADD1" TO VIEW-CFNAME.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO TERM-ERR-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO TERM-BUFFER.
012700     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
012800     IF VIEW-LASTKEY NOT = 0 GO TO 6-MAIN.
014900     MOVE 0 TO DATE-RET-CODE.
015000     MOVE TBUF-CSD TO DATE-VALIDATE-IN.
015100     MOVE 3 TO DATE-MODE.
015200     CALL "TDATECHK" USING DATE-CHECK-AREA.
015300     IF DATE-RET-CODE = 1
015500         MOVE 35028 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (2) INDS (99)
016300         GO TO 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE TBUF-CRAFT TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WCRF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
016900     IF COND-WORD = 17
017100         MOVE 35037 TO CATREAD-MSG-NUMBER
017300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
017500         MOVE TRUE-VAL TO INDS (3) INDS (99)
018100         GO TO 6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE TBUF-MAINT-ZONE TO ARG-ZONE.
           MOVE ARG-VALUE1 TO ZONEPRTY OF WZPFREC.
           START WO-ZONE-PRTY-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WZPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
023600     IF COND-WORD = 17
024200         MOVE 35044 TO CATREAD-MSG-NUMBER
024400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024600         MOVE TRUE-VAL TO INDS (4) INDS (99)
025200         GO TO 6-MAIN.
025300     IF SPACES = TBUF-SHIFT AND TBUF-CREW
025500         MOVE 31057 TO CATREAD-MSG-NUMBER
025700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
025900         MOVE TRUE-VAL TO INDS (8) INDS (99)
026500         GO TO 6-MAIN.
           IF TBUF-USRID = SPACES
               MOVE SPACES TO ERROR-BUFFER
               MOVE "USERID REQUIRED" TO ERROR-BUFFER
               MOVE TRUE-VAL TO INDS (10) INDS (99)
               GO TO 6-MAIN.
026600     IF TBUF-CREW = SPACES
026700         NEXT SENTENCE
026800     ELSE
           PERFORM 69-START-PER-CREW-MSTR
027400     IF COND-WORD = 17
027600         MOVE 35026 TO CATREAD-MSG-NUMBER
027800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
028000         MOVE TRUE-VAL TO INDS (9) INDS (99)
028600         GO TO 6-MAIN.
029000     MOVE TBUF-CSD TO DATE-VALIDATE-IN.
029100     MOVE 3 TO DATE-MODE.
029200     CALL "TDATECHK" USING DATE-CHECK-AREA.
029300     MOVE DATE-DB TO PER-CSD.
      *-----COMPUTE CENTURY FOR CSD DATE
           IF PER-CSD-YY = "  "
               NEXT SENTENCE
           ELSE
           IF PER-CSD-YY > 40
               MOVE 19 TO PER-CSD-CC
           ELSE
               MOVE 20 TO PER-CSD-CC.
029400     MOVE TBUF-CC-NO TO PER-CC-NUM.
029500     MOVE TBUF-EMPL-NAME TO PER-EMP-NAME.
029600     MOVE TBUF-CRAFT TO PER-CRAFT.
029700     MOVE TBUF-MAINT-ZONE TO PER-MAINT-ZONE.
029800     MOVE TBUF-DEPT TO PER-DEPT.
029900     MOVE TBUF-LABOR-RATE TO PER-LABOR-RATE.
030000     MOVE TBUF-EMPL-RATE TO PER-RATING.
030100     MOVE TBUF-SHIFT-CREW TO PER-SHIFT-CREW.
           MOVE TBUF-USRID TO PER-USRID.
030200     MOVE SPACES TO PER-TEMP-ZONE         PER-PAD
030300                    PER-YEAR1 PER-YEAR2 PER-YEAR3.
           MOVE 0 TO COND-WORD.
           WRITE PFREC FROM PER-PERSONNEL
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
031100     IF COND-WORD = 17
031300         MOVE 29069 TO CATREAD-MSG-NUMBER
031500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (99)
032100         GO TO 6-MAIN.
           MOVE 66181 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE TBUF-CC-NO TO ERR-CC.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
           MOVE TRUE-VAL TO INDS (98).
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".

       69-START-PER-CREW-MSTR.
           MOVE 0 TO COND-WORD.
           MOVE TBUF-CREW TO CREWMASTER OF PCMREC.
           START PER-CREW-MSTR KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PCM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

032600 999-CATREAD.
032700     MOVE SPACES TO ERROR-BUFFER.
032800     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
033700 999-CATREAD-EXIT.
033800     EXIT.
