000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPADD.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*        ########################################################
000700*        #  This is the personnel main add program ...........  #
000800*        #  --------------------------------------------------  #
000900*        ########################################################.
      *C
      *C 09/09/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.      AS400.
001400 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-FREE
               ASSIGN TO DATABASE-MCFLMM3201
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PFC-STATUS.
           SELECT PER-CONFIDENTIAL
               ASSIGN TO DATABASE-MCFLMM3301
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PC-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-FREE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFCREC.
       01  PFCREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3201.
       FD  PER-CONFIDENTIAL
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PCREC.
       01  PCREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3301.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
001600 WORKING-STORAGE SECTION.
       77  CC-SW                        PIC X.
       COPY CATREAD  OF COPYLIB.
       01  CC-BUF.
           05  CC-FIELD                 PIC X(4).
           05  CC-CMD-LINE              PIC X(79).
           05  CC-ERR-LINE              PIC X(79).
       COPY CPYIND   OF COPYLIB.
003200 01  ERROR-BUFFER                 PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PFC-STATUS               PIC XX.
           05  PC-STATUS                PIC XX.
           05  PF-STATUS                PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPADD   ".
001900     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A     PIC X(60) VALUE
002300             "PERSONNEL MAIN ADD PROGRAM "                       .
002400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG       PIC X.
003300 01  PER-PERSONNEL.               COPY MPERSONL OF COPYLIB.
003400 COPY DBSTAT OF COPYLIB.
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
003900 LINKAGE SECTION.
004000 01  DBPARAMETERS.                COPY DBPARMS  OF COPYLIB.
004100 COPY VCOMLINK OF COPYLIB.
004200 01  PLT-IDT                      PIC X(4).
004400 PROCEDURE DIVISION USING DBPARAMETERS
004500                          VIEW-COMAREA
004600                          PLT-IDT.
005600 BEGIN-PROC.
           PERFORM 1-HSK.
           PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
006900 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-FREE.
           CLOSE PER-CONFIDENTIAL.
           CLOSE PERSONNEL-FILE.
007000     GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PER-FREE.
           OPEN INPUT PER-CONFIDENTIAL.
           OPEN INPUT PERSONNEL-FILE.
005700     MOVE SPACES TO ERROR-BUFFER.
004900     CALL "TPWORD" USING PASSWORD-INFORMATION.
005300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE SPACES TO DSPLY-REC CC-BUF.
       6-MAIN.
005800     MOVE "FPADD" TO VIEW-CFNAME.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO CC-ERR-LINE.
           MOVE CC-BUF TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO CC-BUF.
008200     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE 0 TO COND-WORD.
           MOVE CC-FIELD TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY   MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
               PERFORM 69-READ-PERSONNEL-FILE
               IF COND-WORD = 15
                   MOVE "N" TO CC-SW
               ELSE
               MOVE "Y" TO CC-SW
           ELSE
           MOVE "N" TO CC-SW.
011900     IF VIEW-LASTKEY = 1
               IF CC-SW = "N"
012100             CALL "TPADD1" USING DBPARAMETERS VIEW-COMAREA
012200                             PLT-IDT CC-FIELD
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               MOVE 29069 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN
013300     ELSE
013400     IF VIEW-LASTKEY = 2
               IF CC-SW = "Y"
013600             IF SPACES = PER-YEAR1 OR PER-YEAR2 OR PER-YEAR3
013700                 CALL "TPADD2" USING DBPARAMETERS VIEW-COMAREA
013800                                 PLT-IDT PER-PERSONNEL
                       MOVE 0 TO VIEW-LASTKEY
013900             ELSE
014000             MOVE 46033 TO CATREAD-MSG-NUMBER
014200             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
014300             MOVE TRUE-VAL TO INDS (99)
014400             GO TO 6-MAIN
               ELSE
               MOVE 29023 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN
016100     ELSE
016200     IF VIEW-LASTKEY = 4
               IF CC-SW = "Y"
                   PERFORM 69-START-PER-FREE
                   IF COND-WORD = 17
017100                 CALL "TPADD3" USING DBPARAMETERS VIEW-COMAREA
017200                                 PLT-IDT PER-PERSONNEL
                       MOVE 0 TO VIEW-LASTKEY
                   ELSE
017400             MOVE 46034 TO CATREAD-MSG-NUMBER
017600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (1) INDS (99)
                   GO TO 6-MAIN
               ELSE
               MOVE 29023 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN
019500     ELSE
019600     IF VIEW-LASTKEY = 5
               IF CC-SW = "Y"
                   PERFORM 69-START-PER-CONFIDENTIAL
                   IF COND-WORD = 17
020500                 CALL "TPADD4" USING DBPARAMETERS VIEW-COMAREA
020600                                 PLT-IDT PER-PERSONNEL
                       MOVE 0 TO VIEW-LASTKEY
020700             ELSE
020800             MOVE 35053 TO CATREAD-MSG-NUMBER
021000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
021100             MOVE TRUE-VAL TO INDS (1) INDS (99)
021800             GO TO 6-MAIN
021900         ELSE
022000         MOVE 29023 TO CATREAD-MSG-NUMBER
022200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
022300         MOVE TRUE-VAL TO INDS (1) INDS (99)
022800         GO TO 6-MAIN.

       69-START-PER-FREE.
           MOVE 0 TO COND-WORD.
           MOVE PER-CC-NUM TO PERCCNUM OF PFCREC.
           START PER-FREE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF PFC-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-PER-CONFIDENTIAL.
           MOVE 0 TO COND-WORD.
           MOVE PER-CC-NUM TO PERCCNUM OF PCREC.
           START PER-CONFIDENTIAL KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PC-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-PERSONNEL-FILE.
           MOVE 0 TO COND-WORD.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

023900 999-CATREAD.
024000     MOVE SPACES TO ERROR-BUFFER.
024100     CALL "CCATREAD" USING CATREAD-PARMS.
024200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
025000 999-CATREAD-EXIT.
025100     EXIT.
