000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPADD3.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*       #########################################################
000700*       # This is the personnel training and experience add pro #
000800*       # gram ------------------------------------------------ #
000900*       #########################################################.
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.      AS400.
001400 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-FREE-FILE
               ASSIGN TO DATABASE-MCFLMM3201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS PFF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
       FD  PER-FREE-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFFREC.
       01  PFFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3201.
001600 WORKING-STORAGE SECTION.
       01  ACT-KEY                      PIC 9(9).
003100 01  ADD-SW                       PIC X VALUE "N".
004100 01  BYTE-99                      PIC 99.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
004200 01  CS                           PIC S9(4) COMP.
003800 01  ERROR-BUFFER                 PIC X(80) VALUE SPACES.
003200 01  ERROR-SW                     PIC X.
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PFF-STATUS               PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001800 01  PASSWORD-INFORMATION.
001900     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPADD3  ".
002000     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002100     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002200     05  PROGRAM-DESCRIPTION.
002300         10  PROG-DESC-A     PIC X(60) VALUE
002400             " PERSONNEL TRAINING AND EXPERIENCE ADD PROGRAM "   .
002500         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002700         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002900     05  PASSWORD-FLAG       PIC X.
003600 01  SAVE-KEY                     PIC S9(4) COMP-4.
005300 01  SCREEN-TABLES.
005400     05 SCREEN OCCURS 10 TIMES.
005500         10 SLINE OCCURS 15 TIMES  PIC X(66).
           05  SCREEN-CMD-LINE          PIC X(79).
           05  SCREEN-ERR-LINE          PIC X(79).
004000 01  SUB1                         PIC S9(4) COMP-4.
004300 COPY DBSTAT  OF COPYLIB.
004400 01  PER-FREE-WS.                 COPY DPERFREE OF COPYLIB.
004500 01  TERM-BUFFER.
004600     05 T-CC                      PIC X(4).
004700     05 T-SCREEN-NO               PIC 99.
004800     05 T-SCREEN-NO-X REDEFINES T-SCREEN-NO
004900                                  PIC XX.
005000     05 T-TRNG-EXP.
005100        10 T-REC OCCURS 15 TIMES  PIC X(66).
           05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
005200 COPY WSCONTROL OF COPYLIB.
005700 LINKAGE SECTION.
005800 01  DBPARAMETERS.                COPY DBPARMS  OF COPYLIB.
005900 COPY VCOMLINK OF COPYLIB.
006000 01  PLT-IDT                      PIC X(4).
006200 01  PER-PERSONNEL.               COPY MPERSONL OF COPYLIB.
006400 PROCEDURE DIVISION USING DBPARAMETERS
006500                          VIEW-COMAREA
006600                          PLT-IDT
006800                          PER-PERSONNEL.
007800 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
010100 2-EOJ.
010200     IF ERROR-BUFFER = SPACES
010300         IF ADD-SW = "Y"
010400             IF SCREEN-TABLES NOT = SPACES
010500                 PERFORM 2-ADD-TRNG-EXP.
           CLOSE DISPLAY-FILE.
           CLOSE PER-FREE-FILE.
011000     GOBACK.

022400 2-ADD-TRNG-EXP.
022500     MOVE 27007 TO CATREAD-MSG-NUMBER.
022700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
           MOVE TRUE-VAL TO INDS (98).
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
023800     PERFORM 2-ADD-TRNG-EXP-CONT VARYING CS FROM 1 BY 1
023900         UNTIL CS > 10.
024100 2-ADD-TRNG-EXP-CONT.
024200     PERFORM 2-ADD-TRNG-EXP-CONT1 THRU 2-A-T-E-C-E
024300         VARYING SUB1 FROM 1 BY 1 UNTIL SUB1 > 15.
024400 2-ADD-TRNG-EXP-CONT1.
024500     IF SLINE (CS, SUB1) = SPACES GO TO 2-A-T-E-C-E.
024600     MOVE PER-CC-NUM TO PER-FREE-CC.
024700     MOVE CS TO BYTE-99.
024800     MOVE BYTE-99 TO PER-FREE-PAGE.
024900     MOVE SUB1 TO BYTE-99.
025000     MOVE BYTE-99 TO PER-FREE-LINE.
025100     MOVE SLINE (CS, SUB1) TO PER-FREE-DATA.
           MOVE 0 TO COND-WORD.
025200     WRITE PFFREC FROM PER-FREE-WS
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PFF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
025600 2-A-T-E-C-E.    EXIT.

008200 1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN I-O    PER-FREE-FILE.
007100     CALL "TPWORD" USING PASSWORD-INFORMATION.
007500     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
008300     MOVE 1 TO CS.
008400     MOVE SPACES TO SCREEN-TABLES.
008600     MOVE "FPADD3" TO VIEW-CFNAME.
009100     MOVE SPACES TO TERM-BUFFER.
           MOVE PER-CC-NUM TO T-CC.
           MOVE 1 TO T-SCREEN-NO.
           MOVE 66200 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
008500     MOVE SPACES TO ERROR-BUFFER.
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
009200     MOVE PER-CC-NUM TO T-CC.
009300     MOVE 1 TO T-SCREEN-NO.
011100 6-MAIN.
011200     PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO TERM-BUFFER.
019200     MOVE T-TRNG-EXP TO SCREEN (CS).
012300     IF VIEW-LASTKEY = 3
012400         MOVE "N" TO ADD-SW
012500         GO TO 2-EOJ.
012700     IF VIEW-LASTKEY = 7
012800         MOVE "Y" TO ADD-SW
012900         GO TO 2-EOJ.
013700     MOVE VIEW-LASTKEY TO SAVE-KEY.
014200     IF SAVE-KEY = 1
014300         ADD 1 TO CS
014400         IF CS > 10
014500             SUBTRACT 1 FROM CS
                   PERFORM 99-SCREEN-WRITE
014700             GO TO 6-MAIN
014800         ELSE
014900         MOVE SCREEN (CS) TO T-TRNG-EXP
015000         MOVE CS TO T-SCREEN-NO
               MOVE TERM-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
015400         GO TO 6-MAIN.
015500     IF SAVE-KEY = 2
015600         SUBTRACT 1 FROM CS
015700         IF CS < 1
015800             ADD 1 TO CS
                   PERFORM 99-SCREEN-WRITE
016000             GO TO 6-MAIN
016100         ELSE
016200         MOVE SCREEN (CS) TO T-TRNG-EXP
016300         MOVE CS TO T-SCREEN-NO
               MOVE TERM-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
016700         GO TO 6-MAIN.
016800
016900     IF SAVE-KEY = 6
017000         MOVE "FPADD3A" TO VIEW-CFNAME
               MOVE 31026 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE SPACES TO T-SCREEN-NO-X
               MOVE SPACES TO T-TRNG-EXP
               MOVE ERROR-BUFFER TO T-REC (1)
               PERFORM 99-SCREEN-WRITE
019800         PERFORM 98-SCREEN-READ
               MOVE DSPLY-REC TO TERM-BUFFER
021000         MOVE "FPADD3" TO VIEW-CFNAME
021200         MOVE T-SCREEN-NO TO CS
021300         MOVE SCREEN (CS) TO T-TRNG-EXP
021400         PERFORM 99-SCREEN-WRITE
               GO TO 6-MAIN.

           PERFORM 99-SCREEN-WRITE.
019400     GO TO 6-MAIN.
019500

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

025800 999-CATREAD.
025900     MOVE SPACES TO ERROR-BUFFER.
026000     CALL "CCATREAD" USING CATREAD-PARMS.
026100     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
026800 999-CATREAD-EXIT.
026900     EXIT.
