       IDENTIFICATION DIVISION.
       PROGRAM-ID. TPASSAPP.
      *C
      *C 09/10/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       01  DBPARAMETERS.    COPY DBPARMS IN COPYLIB.
       01  FILE-STATUSES.
           05  WBF-STATUS               PIC XX.
           05  WPF-STATUS               PIC XX.
           COPY DBSTAT  IN COPYLIB.
       01  WO-BASIC-DATA.   COPY DWOBASIC IN COPYLIB.
       01  WO-PLANNED-DATA. COPY DWOPLAN  IN COPYLIB.
       LINKAGE SECTION.
       01  BASE-MMISA                   PIC X(24).
       01  APPROVAL-WORKAREA.
           05  APPROVAL-WO              PIC X(10).
           05  APPROVAL-STATUS          PIC X.
       PROCEDURE DIVISION USING BASE-MMISA APPROVAL-WORKAREA.
       START-SUB.
           PERFORM 1-HSK THRU 1-HSK-X.
           IF COND-WORD NOT = 0
               GO TO 2-EOJ.
           PERFORM 6-MAIN THRU 6-MAIN-X.
       2-EOJ.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           MOVE LOW-VALUES TO STATUS-AREA.
           MOVE "N" TO APPROVAL-STATUS.
       1-HSK-X.
            EXIT.

       6-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE APPROVAL-WO TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6-MAIN-CONT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF APPROVAL-CODE-P = "A" MOVE "Y" TO APPROVAL-STATUS.
           IF COND-WORD = 0 GO TO 6-MAIN-X.
       6-MAIN-CONT.
           MOVE 0 TO COND-WORD.
           MOVE APPROVAL-WO TO WONUM OF WO-BASIC-FILE.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6-MAIN-X.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 6-MAIN-X.
           IF APPROVAL-CODE = "A" MOVE "Y" TO APPROVAL-STATUS.
       6-MAIN-X.
           EXIT.
