       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TPAVRPTD.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       AUGUST 1999.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM IS THE SCREEN PROGRAM FOR ENTERING A
      *D*   PARTICULAR DAY TO RUN THE COMMITMENT VS. ACTUAL REPORT.
      *D*
      *
      *C* CHANGES
      *C*
      *C* 01/26/00    CA YODER    (C. AGNEW REQUEST)
      *C*    ADDED OPTION TO SELECT WHICH VARIANCE COLUMNS TO SHOW
      *C*    ON THE REPORT (EITHER TIRES/TONS OR % VARIANCE TO
      *C*    BUDGET).
      *C*
      *C* 02/07/00    CA YODER    (C. AGNEW REQUEST)
      *C*    ADDED OPTION TO PRINT ALL 4 REPORTS AUTOMATICALLY (MTD
      *C*    & WTD TIRES/TONS AND % VARIANCE REPORTS).
      *C*
      *C* 04/06/00    CA YODER    (C. AGNEW REQUEST)
      *C*    ADDED FIELD TO SPECIFY A PRINTER FOR THE REPORT.  THE
      *C*    DEFAULT IS QZHX.
      *C*
      *C* 04/22/03    CA YODER
      *C*    CHANGE USER-ID ON RJE JOB TO MATCH THE USER RUNNING THE
      *C*    REPORT INSTEAD OF DEFAULTING TO LARRY JAMISON'S USER-ID.
      *C*    THIS WILL MAKE IT EASIER TO TRACK PROBLEMS ON THE MAINFRAME.
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZPAVSCRN-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT RJEFL-I
                ASSIGN        TO DATABASE-PRTPAVRPT.

           SELECT NEWRJEFL-O
                ASSIGN        TO DATABASE-PRTPAVRPTD.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  RJEFL-I
           LABEL RECORDS ARE STANDARD.
       01  RJEFL-I-REC        PIC X(90).

       FD  NEWRJEFL-O
           LABEL RECORDS ARE STANDARD.
       01  NEWRJEFL-O-REC     PIC X(90).

       WORKING-STORAGE SECTION.

       77  RJEFL-EOF-SW             PIC X     VALUE "N".

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *------- BUFFER FOR DISPLAY SCREEN.
       01  DE-SCREEN-BUF.
           05  DE-OPTION            PIC X.
           05  DE-DATE.
               10  DE-MONTH         PIC X(2).
               10  DE-DAY           PIC X(2).
               10  DE-YEAR          PIC X(2).
           05  DE-VAR-OPTION        PIC X.
           05  DE-PRINTER           PIC X(4).
           05  DE-SC1-MSGLINE       PIC X(78).

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  REC-COUNT               PIC 9(5) VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY TLSHIFT    IN COPYLIB.

       COPY TRSHIFT    IN COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN INPUT     RJEFL-I
                OUTPUT    NEWRJEFL-O
                I-O       DISPLAY-FILE.
      *--------- FIND OUT USER INFO.
           CALL "WHO"     USING MOD CAP LATTR
                          USERNAME GRPNAME ACCTNAME
                          HOMEGRP TERMNUM.

       2-EOJ.
           CLOSE          RJEFL-I
                          NEWRJEFL-O
                          DISPLAY-FILE.

       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.

       6-DISPLAY-SCREEN.

      *------ SET DEFAULT TO CHUCK'S PRINTER; HOWEVER, USER CAN CHANGE.
           MOVE "QZHX"    TO DE-PRINTER.
      *------ SHOW SCREEN TO SELECT MONTH, DAY, & YEAR.
           WRITE DISPLAY-REC FROM DE-SCREEN-BUF
               FORMAT IS "DATESCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SCREEN WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           READ DISPLAY-FILE INTO DE-SCREEN-BUF
               FORMAT IS "DATESCRN"
               INDICATORS ARE SRF-INDICATORS.

           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           MOVE ALL B"0" TO SRF-INDICATORS.

      *---------- VALIDATE REPORT OPTION
           IF DE-OPTION < "1" OR DE-OPTION > "3"
               MOVE "** CHOOSE OPTION 1, 2, OR 3 **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (19) IND (99)
               MOVE DE-SCREEN-BUF  TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           IF DE-DATE > SPACES
      *---------- VALIDATE MONTH
             IF DE-MONTH < "01" OR DE-MONTH > "12"
               MOVE "** INVALID MONTH ENTERED **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (20) IND (99)
               MOVE DE-SCREEN-BUF  TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN
             ELSE
      *---------- VALIDATE DAY
             IF DE-DAY < "01" OR DE-DAY > "31"
               MOVE "** INVALID DAY ENTERED **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (21) IND (99)
               MOVE DE-SCREEN-BUF  TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN
             ELSE
      *---------- VALIDATE YEAR
             IF DE-YEAR NOT NUMERIC
               MOVE "** INVALID YEAR ENTERED **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (22) IND (99)
               MOVE DE-SCREEN-BUF  TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

      *---------- VALIDATE VARIANCE OPTION
           IF DE-OPTION NOT = "3"
             IF DE-VAR-OPTION < "1" OR DE-VAR-OPTION > "2"
               MOVE "** CHOOSE OPTION 1 OR 2 **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (23) IND (99)
               MOVE DE-SCREEN-BUF  TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           MOVE "N"                TO  RJEFL-EOF-SW.
           READ RJEFL-I AT END MOVE "Y" TO  RJEFL-EOF-SW.
           IF DE-OPTION = "3"
               PERFORM 61-READ-COPY-RJEFL-1-4
           ELSE
               PERFORM 60-READ-COPY-RJEFL
                   UNTIL RJEFL-EOF-SW = "Y".

       6-MAIN-X.
           EXIT.

       60-READ-COPY-RJEFL.
      *------- INSERT THE USER-ID INTO JOBCARD.
           IF RJEFL-I-REC (13:9) = "//XXXXXXX"
               MOVE USERNAME TO RJEFL-I-REC (15:7).
           IF RJEFL-I-REC (13:11) = "// MSGLEVEL"
               MOVE USERNAME TO RJEFL-I-REC (55:7).
      *------- INSERT THE DATE INTO THE PARAMETER LINE.
           IF RJEFL-I-REC (13:7) = "//STEP1"
               MOVE DE-DATE TO RJEFL-I-REC (50:6)
      *------------ IF A WEEKLY REPORT REQUESTED, CHANGE PARAMETER.
               IF DE-OPTION = "2"
                   MOVE "W" TO RJEFL-I-REC (57:1)
               END-IF
               IF DE-VAR-OPTION = "2"
                   MOVE "X" TO RJEFL-I-REC (56:1).
           IF RJEFL-I-REC (13:10) = "//GDYRPRNT"
               MOVE DE-PRINTER TO RJEFL-I-REC (57:4).
           WRITE NEWRJEFL-O-REC FROM RJEFL-I-REC.
           READ RJEFL-I AT END MOVE "Y" TO  RJEFL-EOF-SW.

       61-READ-COPY-RJEFL-1-4.
      ********** MTD REPORT
           PERFORM UNTIL RJEFL-EOF-SW = "Y"
      *------- INSERT THE USER-ID INTO JOBCARD.
               IF RJEFL-I-REC (13:9) = "//XXXXXXX"
                   MOVE USERNAME TO RJEFL-I-REC (15:7)
               END-IF
               IF RJEFL-I-REC (13:11) = "// MSGLEVEL"
                   MOVE USERNAME TO RJEFL-I-REC (55:7)
               END-IF
      *------- INSERT THE DATE INTO THE PARAMETER LINE.
               IF RJEFL-I-REC (13:7) = "//STEP1"
                   MOVE DE-DATE TO RJEFL-I-REC (50:6)
               END-IF
               IF RJEFL-I-REC (13:10) = "//GDYRPRNT"
                   MOVE DE-PRINTER TO RJEFL-I-REC (57:4)
               END-IF
               WRITE NEWRJEFL-O-REC FROM RJEFL-I-REC
               READ RJEFL-I
                   AT END MOVE "Y" TO  RJEFL-EOF-SW
               END-READ
           END-PERFORM.
           PERFORM 610-CLOSE-OPEN-FILE.

      ********** MTD REPORT % OPTION
           PERFORM UNTIL RJEFL-EOF-SW = "Y"
      *------- INSERT THE DATE INTO THE PARAMETER LINE.
               IF RJEFL-I-REC (13:7) = "//STEP1"
                   MOVE DE-DATE TO RJEFL-I-REC (50:6)
                   MOVE "X"     TO RJEFL-I-REC (56:1)
                   MOVE "2"     TO RJEFL-I-REC (19:1)
               END-IF
               IF RJEFL-I-REC (13:10) = "//GDYRPRNT"
                   MOVE DE-PRINTER TO RJEFL-I-REC (57:4)
               END-IF
               WRITE NEWRJEFL-O-REC FROM RJEFL-I-REC
               READ RJEFL-I
                   AT END MOVE "Y" TO  RJEFL-EOF-SW
               END-READ
           END-PERFORM.
           PERFORM 610-CLOSE-OPEN-FILE.

      ********** WTD REPORT
           PERFORM UNTIL RJEFL-EOF-SW = "Y"
      *------- INSERT THE DATE INTO THE PARAMETER LINE.
               IF RJEFL-I-REC (13:7) = "//STEP1"
                   MOVE DE-DATE TO RJEFL-I-REC (50:6)
                   MOVE "W"     TO RJEFL-I-REC (57:1)
                   MOVE "3"     TO RJEFL-I-REC (19:1)
               END-IF
               IF RJEFL-I-REC (13:10) = "//GDYRPRNT"
                   MOVE DE-PRINTER TO RJEFL-I-REC (57:4)
               END-IF
               WRITE NEWRJEFL-O-REC FROM RJEFL-I-REC
               READ RJEFL-I
                   AT END MOVE "Y" TO  RJEFL-EOF-SW
               END-READ
           END-PERFORM.
           PERFORM 610-CLOSE-OPEN-FILE.

      ********** WTD REPORT % OPTION
           PERFORM UNTIL RJEFL-EOF-SW = "Y"
      *------- INSERT THE DATE INTO THE PARAMETER LINE.
               IF RJEFL-I-REC (13:7) = "//STEP1"
                   MOVE DE-DATE TO RJEFL-I-REC (50:6)
                   MOVE "W"     TO RJEFL-I-REC (57:1)
                   MOVE "X"     TO RJEFL-I-REC (56:1)
                   MOVE "4"     TO RJEFL-I-REC (19:1)
               END-IF
               IF RJEFL-I-REC (13:10) = "//GDYRPRNT"
                   MOVE DE-PRINTER TO RJEFL-I-REC (57:4)
               END-IF
               WRITE NEWRJEFL-O-REC FROM RJEFL-I-REC
               READ RJEFL-I
                   AT END MOVE "Y" TO  RJEFL-EOF-SW
               END-READ
           END-PERFORM.

       610-CLOSE-OPEN-FILE.
           CLOSE        RJEFL-I.
           OPEN  INPUT  RJEFL-I.
           MOVE "N"     TO  RJEFL-EOF-SW.
           PERFORM UNTIL RJEFL-I-REC (13:7) = "//STEP1"
               READ RJEFL-I
                   AT END MOVE "Y" TO  RJEFL-EOF-SW
               END-READ
           END-PERFORM.


      ******************************************************************
      **             U T I L I T Y   S E C T I O N                    **
      ******************************************************************

       9999-UTILITY SECTION.

       9999-BLOWUP.
           MOVE "TPAVRPTD" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
