       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TPAVSCRN.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       AUGUST 1999.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM IS THE SCREEN PROGRAM FOR ENTERING
      *D*   6+6 CONSTANT INFORMATION FOR TMIS (PAV00000).
      *D*
      *
      *C* CHANGES
      *C*
      *C* 02/08/00     CA YODER     (C. AGNEW REQUEST)
      *C*    ADDED DUNLOP PLANTS TO BUDGET ENTRY TABLE.
      *C*
      *C* 10/03/00     CA YODER     (C. AGNEW REQUEST)
      *C*    ADDED MEXICO PLANT TO BUDGET ENTRY TABLE.
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZPAVSCRN-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT PAVFL-IO
               ASSIGN         TO DATABASE-PAVFL6601
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                                 WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  PAVFL-IO
           LABEL RECORDS ARE STANDARD.
       01  PAVFL-IO-REC.
           COPY DDS-ALL-FORMATS OF PAVFL6601.

       WORKING-STORAGE SECTION.

       77  SUB                      PIC 9(5).
       77  SUB2                     PIC 9(5).
       77  MORE-RECORDS             PIC X     VALUE "Y".
       77  DEFAULT-EXISTS-SW        PIC X     VALUE "N".
       77  DEPT-EXISTS-SW           PIC X     VALUE "N".
       77  PAVFL-EOF-SW             PIC X     VALUE "N".
       77  TBL-LIMIT                PIC 9(5)  VALUE 14.

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *------- BUFFER FOR FIRST DISPLAY SCREEN.
       01  DE-SCREEN1-BUF.
           10  DE-MONTH1            PIC X(2).
           10  DE-MONTH1-R  REDEFINES  DE-MONTH1
                                    PIC 9(2).
           10  DE-YEAR1             PIC X(4).
           10  DE-SC1-MSGLINE       PIC X(78).

       01  DE-HDR-BUF.
           10  DE-HDR-MONTH         PIC X(14).

       01  DE-INPUT-BUF.
           10  DE-PLANT-NAME      PIC X(8).
           10  DE-WORKDAYS        PIC 99V9.
           10  DE-TIRES-DAY       PIC 9(7).
           10  DE-TIRES-MO        PIC 9(8).
           10  DE-TONS-MO         PIC 9(6).
           10  DE-TONS-DAY        PIC 9(4)V9.

       01  DE-RPT-MSG             PIC X(78).

       01  DE-COPY-BUF.
           10  DE-COPY-SELECT       PIC X.
           10  DE-COPY-DESC         PIC X(40).
           10  DE-COPY-PROG         PIC X(8).
           10  DE-COPY-KEY-DESC     PIC X(10).
           10  DE-COPY-ID           PIC X(4).

       01  DE-COPY2-BUF.
           10  DE-COPY2-SELECT      PIC X.
           10  DE-COPY2-DESC        PIC X(40).
           10  DE-COPY2-PROG        PIC X(8).
           10  DE-COPY2-ID          PIC X(4).


       01  BUF-PAVFL.
           10  PAV-YEAR             PIC X(4).
           10  PAV-MONTH            PIC X(2).
           10  PAV-PLANT-ID         PIC X(2).
           10  PAV-WORKDAYS         PIC 99V9.
           10  PAV-TIRES-DAY        PIC 9(7).
           10  PAV-TIRES-MO         PIC 9(9).
           10  PAV-TONS-MO          PIC 9(7).
           10  PAV-TONS-DAY         PIC 9(5)V9.
           10  FILLER               PIC X(5).

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  REC-COUNT               PIC 9(5) VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY TLSHIFT    IN COPYLIB.

       COPY TRSHIFT    IN COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

      *--------- THESE ARE THE PLANTS/PLANT CODES DEFINED TO
      *--------- TMIS.
       01  PLANT-DATA.
           05  FILLER   PIC X(10)  VALUE "D DANVILLE".
           05  FILLER   PIC X(10)  VALUE "G GADSDEN ".
           05  FILLER   PIC X(10)  VALUE "W LAWTON  ".
           05  FILLER   PIC X(10)  VALUE "T TOPEKA  ".
           05  FILLER   PIC X(10)  VALUE "U UN CITY ".
           05  FILLER   PIC X(10)  VALUE "V FAYETTE ".
           05  FILLER   PIC X(10)  VALUE "F FREEPORT".
           05  FILLER   PIC X(10)  VALUE "Y TYLER   ".
           05  FILLER   PIC X(10)  VALUE "H MED HAT ".
           05  FILLER   PIC X(10)  VALUE "N NAPANEE ".
           05  FILLER   PIC X(10)  VALUE "Q VALLEYFL".
           05  FILLER   PIC X(10)  VALUE "B BUFFALO ".
           05  FILLER   PIC X(10)  VALUE "A HUNTSVIL".
           05  FILLER   PIC X(10)  VALUE "MEMEXICO  ".

       01  PLANT-TABLE  REDEFINES  PLANT-DATA.
           05  PLANT-ENTRY                OCCURS 14 TIMES.
               10  PLANT-ID     PIC X(2).
               10  PLANT-NAME   PIC X(8).

       01  DATA-INPUT-TABLE.
           05  DATA-INPUT-LINE   OCCURS 14 TIMES   INDEXED BY I.
               10  I-PLANT-ID         PIC X(2).
               10  I-PLANT-NAME       PIC X(8).
               10  I-WORKDAYS         PIC 99V9.
               10  I-TIRES-DAY        PIC 9(7).
               10  I-TIRES-MO         PIC 9(8).
               10  I-TONS-MO          PIC 9(6).
               10  I-TONS-DAY         PIC 9(4)V9.

       01  MAX-REPORTS          PIC 9(2)  VALUE 2.

       01  MONTH-ENTRIES.
           05  FILLER             PIC X(9)  VALUE "JANUARY  ".
           05  FILLER             PIC X(9)  VALUE "FEBRUARY ".
           05  FILLER             PIC X(9)  VALUE "MARCH    ".
           05  FILLER             PIC X(9)  VALUE "APRIL    ".
           05  FILLER             PIC X(9)  VALUE "MAY      ".
           05  FILLER             PIC X(9)  VALUE "JUNE     ".
           05  FILLER             PIC X(9)  VALUE "JULY     ".
           05  FILLER             PIC X(9)  VALUE "AUGUST   ".
           05  FILLER             PIC X(9)  VALUE "SEPTEMBER".
           05  FILLER             PIC X(9)  VALUE "OCTOBER  ".
           05  FILLER             PIC X(9)  VALUE "NOVEMBER ".
           05  FILLER             PIC X(9)  VALUE "DECEMBER ".

       01  MONTH-TABLE REDEFINES MONTH-ENTRIES.
           05  MONTH-VALUE  OCCURS 12 TIMES  PIC X(9).

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN I-O       PAVFL-IO
                          DISPLAY-FILE.

       2-EOJ.
           CLOSE          PAVFL-IO
                          DISPLAY-FILE.

       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.

       6-DISPLAY-SCREEN.

      *------ SHOW FIRST SCREEN TO SELECT MONTH & YEAR.
           WRITE DISPLAY-REC FROM DE-SCREEN1-BUF
               FORMAT IS "SELECT"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SCREEN WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           READ DISPLAY-FILE INTO DE-SCREEN1-BUF
               FORMAT IS "SELECT"
               INDICATORS ARE SRF-INDICATORS.

           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           MOVE ALL B"0" TO SRF-INDICATORS.

      *---------- VALIDATE MONTH
           IF DE-MONTH1 < "01" OR DE-MONTH1 > "12"
               MOVE "** INVALID MONTH ENTERED **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (10) IND (99)
               MOVE DE-SCREEN1-BUF TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

      *---------- VALIDATE YEAR
           IF DE-YEAR1 < "1990" OR DE-YEAR1 (1:2) < "19" OR
                                   DE-YEAR1 (1:2) > "20"
               MOVE "** INVALID YEAR ENTERED **" TO DE-SC1-MSGLINE
               MOVE ON-SWITCH      TO  IND (11) IND (99)
               MOVE DE-SCREEN1-BUF TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           MOVE SPACES TO DE-HDR-MONTH.
           STRING MONTH-VALUE (DE-MONTH1-R) DELIMITED BY SPACE
                  " " DE-YEAR1              DELIMITED BY SIZE
               INTO DE-HDR-MONTH.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SCREEN" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

           PERFORM 60-INPUT-TABLE  THRU  60-IT-X.

           GO TO 6-BEGIN.

       6-MAIN-X.
           EXIT.

      ******************************************************************
      **               I N P U T   S C R E E N                        **
      ******************************************************************

       60-INPUT-TABLE.
           INITIALIZE DISPLAY-REC.

       60-LOAD-SCREEN.

           INITIALIZE REC-COUNT.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM DE-HDR-BUF
               FORMAT IS "ADDSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       60-GET-LIST.

           INITIALIZE DE-INPUT-BUF
                      DATA-INPUT-TABLE.
           MOVE "00" TO FILE-STATUS.
      *---------- LOAD PLANT-TABLE.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > TBL-LIMIT
               MOVE PLANT-ID (SUB)   TO  I-PLANT-ID (SUB)
               MOVE PLANT-NAME (SUB) TO  I-PLANT-NAME (SUB)
           END-PERFORM.
           MOVE "N"                  TO  PAVFL-EOF-SW.
           MOVE DE-MONTH1 TO RPTMM OF PAVFL-IO-REC.
           MOVE DE-YEAR1  TO RPTYEAR OF PAVFL-IO-REC.
           START PAVFL-IO KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ PAVFL-IO NEXT INTO BUF-PAVFL
                   AT END MOVE "Y" TO PAVFL-EOF-SW
               END-READ
               PERFORM 601-LOAD-REPORT UNTIL PAVFL-EOF-SW = "Y"
               PERFORM 9999-RESET-PAVFL.

           SET I TO 1.
           MOVE 0                     TO  REC-COUNT.
           PERFORM UNTIL I > TBL-LIMIT
               MOVE I-PLANT-NAME (I)  TO  DE-PLANT-NAME
               MOVE I-WORKDAYS (I)    TO  DE-WORKDAYS
               MOVE I-TIRES-DAY (I)   TO  DE-TIRES-DAY
               MOVE I-TIRES-MO (I)    TO  DE-TIRES-MO
               MOVE I-TONS-MO (I)     TO  DE-TONS-MO
               MOVE I-TONS-DAY (I)    TO  DE-TONS-DAY
               ADD 1                  TO  REC-COUNT
               WRITE SUBFILE DISPLAY-REC FROM DE-INPUT-BUF
                   FORMAT IS "ADDSFL"
                   INDICATORS ARE SRF-INDICATORS
               END-WRITE
               IF DISPLAY-STATUS NOT = "00"
                   MOVE "SUBFILE WRITE ERROR*RPT" TO BU-DISPLAY-MSG
                   MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
                   MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
               END-IF
               SET I UP BY 1
           END-PERFORM.

       60-SHOW-SCREEN.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC FROM DE-INPUT-BUF
               FORMAT IS "ADDSFLREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC FROM DE-HDR-BUF
               FORMAT IS "ADDSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE*RPT" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

      *--- WAIT FOR USER TO PRESS A KEY.
           READ DISPLAY-FILE INTO DE-RPT-MSG
               FORMAT IS "ADDSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SFL*RPT" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

       60-ACTION.
           IF F3-KEY-USED
               GO TO 60-IT-X.

           PERFORM 603-DELETE-ENTRIES.
           MOVE 1 TO REC-COUNT.
           MOVE "Y" TO MORE-RECORDS.
           PERFORM UNTIL REC-COUNT > TBL-LIMIT
               READ SUBFILE DISPLAY-FILE
                   INTO DE-INPUT-BUF
                   FORMAT IS "ADDSFL"
               END-READ
               PERFORM 602-WRITE-PAVFL
               ADD 1 TO REC-COUNT
           END-PERFORM.

       60-IT-X.
           EXIT.

       601-LOAD-REPORT.
           SET I TO 1.
           SEARCH DATA-INPUT-LINE
               WHEN I-PLANT-ID (I) = PAV-PLANT-ID
                   MOVE PAV-WORKDAYS    TO  I-WORKDAYS (I)
                   MOVE PAV-TIRES-DAY   TO  I-TIRES-DAY (I)
                   MOVE PAV-TIRES-MO    TO  I-TIRES-MO  (I)
                   MOVE PAV-TONS-MO     TO  I-TONS-MO (I)
                   MOVE PAV-TONS-DAY    TO  I-TONS-DAY (I).
           PERFORM 9999-READ-NEXT-PAVFL.

       602-WRITE-PAVFL.
           SET I TO REC-COUNT.

           INITIALIZE BUF-PAVFL.
           MOVE DE-MONTH1       TO  PAV-MONTH.
           MOVE DE-YEAR1        TO  PAV-YEAR.
           MOVE I-PLANT-ID (I)  TO  PAV-PLANT-ID.
           MOVE DE-WORKDAYS     TO  PAV-WORKDAYS.
           MOVE DE-TIRES-DAY    TO  PAV-TIRES-DAY.
           MOVE DE-TIRES-MO     TO  PAV-TIRES-MO.
           MOVE DE-TONS-MO      TO  PAV-TONS-MO.
           MOVE DE-TONS-DAY     TO  PAV-TONS-DAY.

           WRITE PAVFL-IO-REC FROM BUF-PAVFL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       603-DELETE-ENTRIES.
           MOVE "N" TO  PAVFL-EOF-SW.
           MOVE DE-MONTH1 TO RPTMM OF PAVFL-IO-REC.
           MOVE DE-YEAR1  TO RPTYEAR OF PAVFL-IO-REC.
           START PAVFL-IO KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               READ PAVFL-IO NEXT INTO BUF-PAVFL
                   AT END MOVE "Y" TO PAVFL-EOF-SW
               END-READ
               PERFORM UNTIL PAVFL-EOF-SW = "Y"
                   DELETE PAVFL-IO
                   PERFORM 9999-READ-NEXT-PAVFL
               END-PERFORM.

      ******************************************************************
      **             U T I L I T Y   S E C T I O N                    **
      ******************************************************************

       9999-UTILITY SECTION.

       9999-READ-NEXT-PAVFL.
           READ PAVFL-IO NEXT INTO BUF-PAVFL
               AT END MOVE "Y" TO PAVFL-EOF-SW.
           IF PAV-MONTH NOT = DE-MONTH1 OR
              PAV-YEAR  NOT = DE-YEAR1
               MOVE "Y"        TO PAVFL-EOF-SW.

       9999-RESET-PAVFL.
           MOVE HIGH-VALUES TO RPTMM OF PAVFL-IO-REC
                               RPTYEAR OF PAVFL-IO-REC.
           START PAVFL-IO KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-BLOWUP.
           MOVE "TPAVSCRN" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
