       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TPCATINQ.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       SEPTEMBER 1997.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM DISPLAYS THE RECORDS IN THE PRICE CATALOG
      *D*   FILE (MCFPCSPCAT).
      *D*   THE DISPLAY FILE IS ZPCATINQ.
      *D*
      *C* CHANGES
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZPCATINQ-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT PCAT-DT-I
               ASSIGN         TO DATABASE-MCFLCSPCA1
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                              WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT MSTORERM-I
               ASSIGN           TO DATABASE-MCFLCS0201
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS      IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  PCAT-DT-I
           LABEL RECORDS ARE STANDARD.
       01  PCAT-DT-REC.
           COPY DDS-ALL-FORMATS OF MCFLCSPCA1.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-I-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       WORKING-STORAGE SECTION.

       77  HOLD-DIFF                PIC S9(6)V9(4)  VALUE +0.
       77  HOLD-PERCENT             PIC S9V9(4)     VALUE +0.
       77  HOLD-CALC                PIC S9(6)V9(4)  VALUE +0.

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *--- BUFFER FOR FIRST DISPLAY SCREEN.
       01  DE-BUF.
           05  DE-DATE1.
               10  DE-MD1           PIC X(2).
               10  DE-DM1           PIC X(2).
               10  DE-YY1           PIC X(2).
           05  DE-DATE2.
               10  DE-MD2           PIC X(2).
               10  DE-DM2           PIC X(2).
               10  DE-YY2           PIC X(2).
           05  DE-CODE1             PIC X(7).
           05  DE-CODE2             PIC X(7).
           05  DE-PERCENT           PIC 9(2).
           05  DE-REPORT-OPT        PIC X.
           05  DE-ROUTE-NAME        PIC X(20).
           05  DE-MSGLINE           PIC X(78).

       01  BUF-SCREEN.
           05  SC-CORP-CODE         PIC X(7).
           05  FILLER               PIC X(1).
           05  SC-EFFECT-DATE       PIC X(8).
           05  FILLER               PIC X(1).
           05  SC-CATALOG           PIC X(10).
           05  SC-CUR-PRICE         PIC Z(6)9.9999.
           05  SC-CUR-PRICE-X  REDEFINES  SC-CUR-PRICE
                                    PIC X(12).
           05  FILLER               PIC X(1).
           05  SC-CUR-UM            PIC X(2).
           05  SC-NEW-PRICE         PIC Z(6)9.9999.
           05  FILLER               PIC X(1).
           05  SC-NEW-UM            PIC X(2).
           05  FILLER               PIC X(1).
           05  SC-DIFF              PIC Z(4)9.9999-.
           05  FILLER               PIC X(1).
           05  SC-CHANGE-DATE       PIC X(8).

       COPY CSISPCAT      OF COPYLIB.

       COPY MSTORERM IN COPYLIB.

       01  DATE-HOLD.
           05  HOLD-MM              PIC X(2).
           05  HOLD-DD              PIC X(2).
           05  HOLD-YY              PIC X(2).

      *--- PASSED PARAMETERS TO "TRPTPCAT".
       01  TRPTPCAT-PARMS.
           05  PASS-DATE1           PIC X(8).
           05  PASS-DATE2           PIC X(8).
           05  PASS-CODE1           PIC X(7).
           05  PASS-CODE2           PIC X(7).
           05  PASS-PERCENT         PIC 9(2).
           05  PASS-ROUTE-NAME      PIC X(20).

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  PCAT-EOF-SW             PIC X  VALUE "N".

       01  REC-COUNT               PIC 9(5) VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY CATREAD OF COPYLIB.

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY CSTRMJB2 OF COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       01  DATE-ARG1.
           05  ARG-CC1               PIC X(2).
           05  ARG-YMD1.
               10  ARG-YY1           PIC X(2).
               10  ARG-MM1           PIC X(2).
               10  ARG-DD1           PIC X(2).

       01  DATE-ARG2.
           05  ARG-CC2               PIC X(2).
           05  ARG-YMD2.
               10  ARG-YY2           PIC X(2).
               10  ARG-MM2           PIC X(2).
               10  ARG-DD2           PIC X(2).

       COPY TDATECHK IN COPYLIB.

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN INPUT     PCAT-DT-I
                          MSTORERM-I
                I-O       DISPLAY-FILE.

       2-EOJ.
           CLOSE          PCAT-DT-I
                          MSTORERM-I
                          DISPLAY-FILE.


       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.
           MOVE 0         TO  DE-PERCENT.

       6-DISPLAY-SCREEN.
           MOVE DE-BUF    TO  DISPLAY-REC.

      *--- SHOW FIRST SCREEN WHERE DATA IS ENTERED.
           WRITE DISPLAY-REC FORMAT IS "PCATSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SCREEN WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           READ DISPLAY-FILE
               FORMAT IS "PCATSCRN"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SCREEN" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           MOVE DISPLAY-REC    TO DE-BUF.

       6-CHECK-ERRORS.
           IF F3-KEY-USED
               GO TO 6-MAIN-X.

           INITIALIZE DATE-ARG1
                      DATE-ARG2
                      DATE-CHECK-AREA.

      *------- VALIDATE DATES.
           IF DE-DATE1 > SPACES
               MOVE DE-DATE1        TO  DATE-VALIDATE-IN
                                        DATE-HOLD
               MOVE 3                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               IF DATE-MSG NOT = SPACES
                   MOVE DATE-MSG        TO  DE-MSGLINE
                   MOVE ON-SWITCH       TO  IND (60)
                   MOVE ON-SWITCH       TO  IND (10) IND (11) IND (12)
                   MOVE DE-BUF          TO  DISPLAY-REC
                   GO TO 6-DISPLAY-SCREEN
               ELSE
                   MOVE DATE-YMD-OUT    TO  ARG-YMD1
                   IF ARG-YY1 < "90"
                       MOVE "20"        TO  ARG-CC1
                   ELSE
                       MOVE "19"        TO  ARG-CC1.

           IF DE-DATE2 > SPACES
               MOVE DE-DATE2        TO  DATE-VALIDATE-IN
                                        DATE-HOLD
               MOVE 3                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               IF DATE-MSG NOT = SPACES
                   MOVE DATE-MSG        TO  DE-MSGLINE
                   MOVE ON-SWITCH       TO  IND (60)
                   MOVE ON-SWITCH       TO  IND (13) IND (14) IND (15)
                   MOVE DE-BUF          TO  DISPLAY-REC
                   GO TO 6-DISPLAY-SCREEN
               ELSE
                   MOVE DATE-YMD-OUT    TO  ARG-YMD2
                   IF ARG-YY2 < "90"
                       MOVE "20"        TO  ARG-CC2
                   ELSE
                       MOVE "19"        TO  ARG-CC2.

           IF DATE-ARG1 > SPACES AND DATE-ARG2 = SPACES
               MOVE HIGH-VALUES         TO  DATE-ARG2.

           IF DE-REPORT-OPT = "X" AND DE-ROUTE-NAME = SPACES
      *       ***  ENTER ROUTING INFORMATION ***
               MOVE 05102 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH       TO  IND (60)
               MOVE ON-SWITCH       TO  IND (21) IND (22)
               MOVE DE-BUF          TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

      *------- START JOB TO PRINT REPORT.
           IF DE-REPORT-OPT = "X"
               MOVE DATE-ARG1       TO  PASS-DATE1
               MOVE DATE-ARG2       TO  PASS-DATE2
               MOVE DE-CODE1        TO  PASS-CODE1
               MOVE DE-CODE2        TO  PASS-CODE2
               MOVE DE-PERCENT      TO  PASS-PERCENT
               MOVE DE-ROUTE-NAME   TO  PASS-ROUTE-NAME
               MOVE TRPTPCAT-PARMS  TO  CSTRM-RUN-CARD (1)
               MOVE "BPCATTOP"      TO  CSTRM-TOP-FILE
               MOVE "BPCATBOT"      TO  CSTRM-BOTTOM-FILE
               CALL "CSTRMJB2" USING CSTRMJB2-PARMS, VIEW-COMAREA
               INITIALIZE DE-BUF
      *       ***  REPORT PRINTED ***
               MOVE 18092 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH       TO  IND (60)
               MOVE DE-BUF          TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           IF DE-CODE1 > SPACES AND DE-CODE2 = SPACES
               MOVE HIGH-VALUES     TO  DE-CODE2.

           IF DE-PERCENT NUMERIC
               COMPUTE HOLD-PERCENT ROUNDED = DE-PERCENT / 100
           ELSE
               MOVE 0               TO  DE-PERCENT.

       60-LOAD-SCREEN.

           INITIALIZE REC-COUNT.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
               FORMAT IS "PCATSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       61-GET-LIST.

           MOVE SPACES  TO  BUF-SCREEN.
           PERFORM 64-LIST-RECORDS.

       62-SHOW-SCREEN.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC
               FORMAT IS "PCATREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "PCATSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

      *--- WAIT FOR USER TO PRESS A KEY.
           READ DISPLAY-FILE
               FORMAT IS "PCATSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SFL" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.


       63-ACTION.

      *--- THE ENTER KEY IS TREATED THE SAME AS PRESSING THE F3 KEY.
           IF F3-KEY-USED OR ENTER-KEY-USED
               MOVE "N" TO PCAT-EOF-SW
               GO TO 6-DISPLAY-SCREEN.


       6-MAIN-X.
           EXIT.

       64-LIST-RECORDS.

           MOVE "N" TO PCAT-EOF-SW.

           IF DE-DATE1 > SPACES
               MOVE DATE-ARG1 TO EFFECTDATE OF PCAT-DT-REC
           ELSE
               MOVE LOW-VALUES TO EFFECTDATE OF PCAT-DT-REC.

           PERFORM 9999-START-PCAT-DT.
           IF FILE-STATUS = "00"
               PERFORM 9999-READ-NEXT-PCAT-DT.

           IF PCAT-EOF-SW = "Y" OR FILE-STATUS NOT = "00"
               INITIALIZE DE-BUF
      *       ***  NO DATA TO DISPLAY ***
               MOVE 14129 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH             TO IND (60)
               MOVE DE-BUF                TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           PERFORM 64-CHECK-RANGE THRU 64-CR-X
               UNTIL PCAT-EOF-SW = "Y".
           IF REC-COUNT = 0
      *       ***  NO DATA TO DISPLAY ***
               MOVE 14134 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DISPLAY-REC
               ADD 1                      TO REC-COUNT
               WRITE SUBFILE DISPLAY-REC
                   FORMAT IS "PCATSFL"
                   INDICATORS ARE SRF-INDICATORS.

       64-CHECK-RANGE.
           IF DE-CODE1 > SPACES OR DE-CODE2 > SPACES
               IF PCAT-CORP-CODE < DE-CODE1 OR
                  PCAT-CORP-CODE > DE-CODE2
                   GO TO 64-READ-NEXT.

           IF DATE-ARG1 > SPACES OR DATE-ARG2 > SPACES
               IF PCAT-EFFECT-DATE-CN < DATE-ARG1 OR
                  PCAT-EFFECT-DATE-CN > DATE-ARG2
                   GO TO 64-READ-NEXT.

           PERFORM 65-MOVE-SCREEN-FIELDS THRU 65-MSF-X.

       64-READ-NEXT.
           PERFORM 9999-READ-NEXT-PCAT-DT.

       64-CR-X.
           EXIT.

       65-MOVE-SCREEN-FIELDS.
           MOVE SPACES  TO  BUF-SCREEN.
           MOVE PCAT-CORP-CODE  TO  CORPCDE OF MSTORERM-I-REC.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF HOLD-PERCENT NOT = 0
                   GO TO 65-MSF-X
               END-IF
               MOVE " *NOT IN DB*"    TO SC-CUR-PRICE-X
               MOVE "--"              TO SC-CUR-UM
               MOVE 0                 TO SC-DIFF
           ELSE
               COMPUTE HOLD-DIFF = PCAT-UNIT-PRICE - STR-MKT-COST
               IF HOLD-PERCENT NOT = 0
                   COMPUTE HOLD-CALC = HOLD-DIFF
                                     / STR-MKT-COST
                   IF HOLD-CALC NEGATIVE
                       COMPUTE HOLD-CALC = HOLD-CALC * -1
                   END-IF
                   IF HOLD-CALC < HOLD-PERCENT
                       GO TO 65-MSF-X
                   END-IF
               END-IF
               MOVE STR-MKT-COST      TO SC-CUR-PRICE
               MOVE STR-UM            TO SC-CUR-UM
               MOVE HOLD-DIFF         TO SC-DIFF.
           MOVE PCAT-CORP-CODE        TO SC-CORP-CODE.
           MOVE PCAT-UNIT-PRICE       TO SC-NEW-PRICE.
           MOVE PCAT-PRICE-UM         TO SC-NEW-UM.
           MOVE PCAT-CATALOG-NUM      TO SC-CATALOG.
           MOVE 4                     TO DATE-MODE.
           MOVE PCAT-EFFECT-YMD       TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT        TO SC-EFFECT-DATE
           IF PCAT-APPLY-DATE-CN > SPACES
               MOVE 4                 TO DATE-MODE
               MOVE PCAT-APPLY-YMD    TO DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT    TO SC-CHANGE-DATE.
           MOVE BUF-SCREEN            TO DISPLAY-REC.
           ADD 1                      TO REC-COUNT.
           IF REC-COUNT > 9999
               MOVE "SUBFILE TOO SMALL-INCREASE ZRELINQ"
                   TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               GO TO 9999-BLOWUP.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "PCATSFL"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
               MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

       65-MSF-X.
           EXIT.

       9999-UTILITY SECTION.

       9999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

       9999-START-PCAT-DT.
           START PCAT-DT-I KEY >= EFFECTDATE OF PCAT-DT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-PCAT-DT.
           READ PCAT-DT-I NEXT INTO BUF-CSISPCAT
               AT END MOVE "Y" TO PCAT-EOF-SW.

       9999-BLOWUP.
           MOVE "TPCATINQ" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
