000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPCONSEC.
000500*REMARKS.
000600*               This program loads consecutive days of absence
000700*               into the absence screen tables.
000800*
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER.      AS400.
001300 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-ABSENCE
               ASSIGN TO DATABASE-MCFLMM2901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS PA-STATUS.
001600 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-ABSENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PAREC.
       01  PAREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2901.
001700 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
003400 01  CS                           PIC S9(4) COMP-4.
003600 01  DAY1                         PIC 9.
003800 01  DAY2                         PIC 9.
004000 01  DAY3                         PIC 9.
004200 01  DAY4                         PIC 9.
004400 01  DAY5                         PIC 9.
004600 01  DAY6                         PIC 9.
004800 01  DAY7                         PIC 9.
005000 COPY TDATESUB OF COPYLIB.
       01  DSPLY-STATUS                 PIC XX.
006700 01  ERROR-BUFFER                 PIC X(80) VALUE SPACES.
005400 01  ERROR-SW                     PIC X.
       01  INDATE.
           05  IN-DATE.
               10  IN-YY                PIC 99.
               10  IN-MM                PIC 99.
               10  IN-DD                PIC 99.
           05  IN-JULDATE REDEFINES IN-DATE.
               10  IN-JUL               PIC 9(5).
               10  FILLER               PIC X.
       COPY IOFEEDBACK OF COPYLIB.

       01  OUTDATE.
           05  OUT-JULDATE.
               10  OUT-JULIAN.
                   15  FILLER           PIC XX.
                   15  OUT-JUL          PIC 999.
               10  FILLER               PIC X.
           05  OUT-DATE REDEFINES OUT-JULDATE.
               10  OUT-YY               PIC XX.
               10  OUT-MM               PIC XX.
               10  OUT-DD               PIC XX.

       01  PA-STATUS                    PIC XX.
001900 01  PASSWORD-INFORMATION.
002000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPCONSEC".
002100     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002200     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002300     05  PROGRAM-DESCRIPTION.
002400         10  PROG-DESC-A     PIC X(60) VALUE
002500         "LOADS INPUT SCREENS WITH CONSECUTIVE DAYS OF ABSENCE " .
002600         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002800         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003000     05  PASSWORD-FLAG       PIC X.
007100 01  PER-ABSENCE-DATA.            COPY DPERABS  OF COPYLIB.
007200
007900 01  SPOT-SW                      PIC X.
007300 01  SUB1                         PIC S9(4) COMP-4.
007500 01  SUB2                         PIC S9(4) COMP-4.
007700 01  SUB3                         PIC S9(4) COMP-4.
008100 COPY DBSTAT   OF COPYLIB.
008200
008300 01  TERM-BUFFER.
008400     05  T-DATE                   PIC X(6).
008500     05  T-DAYS                   PIC 99.
008600     05  T-CODE                   PIC XX.
008700     05  T-HOUR                   PIC 99.
008800     05  T-DAY1                   PIC X.
008900     05  T-DAY2                   PIC X.
009000     05  T-DAY3                   PIC X.
009100     05  T-DAY4                   PIC X.
009200     05  T-DAY5                   PIC X.
009300     05  T-DAY6                   PIC X.
009400     05  T-DAY7                   PIC X.
           05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
009500 COPY WSCONTROL OF COPYLIB.
009600 01  YR-SW                        PIC X.
009800 LINKAGE SECTION.
010000 01  DBPARAMETERS.                COPY DBPARMS  OF COPYLIB.
010100 COPY VCOMLINK OF COPYLIB.
010300 01  SCREEN-TABLES.
010400     05 TABLES OCCURS 3 TIMES.
010500        10 TABL.
010600           15 TAB OCCURS 50 TIMES.
010700              20 T1.
                       25 TAB-CODE      PIC XX.
                       25 TAB-DATE      PIC X(6).
                       25 TAB-HOUR      PIC XX.
010800
010900 01  T-YR                         PIC XX.
011200 PROCEDURE DIVISION USING DBPARAMETERS
011300                          VIEW-COMAREA
011500                          SCREEN-TABLES
011600                          T-YR.
011700 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-ABSENCE.
           GOBACK.
011800 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PER-ABSENCE.
011900     CALL "TPWORD" USING PASSWORD-INFORMATION.
012300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
012800     MOVE SPACES TO ERROR-BUFFER.
013400     MOVE SPACES TO TERM-BUFFER.
013500     MOVE "08" TO T-HOUR.
       6-MAIN.
012900     MOVE "FPCONSEC" TO VIEW-CFNAME.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO TERM-ERR-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
014300     PERFORM 99-SCREEN-WRITE.
015400     PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO TERM-BUFFER.
016400     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
016500     IF VIEW-LASTKEY = 0
016600         NEXT SENTENCE
016700     ELSE
016900     GO TO 6-MAIN.
018800     MOVE 0 TO COND-WORD.
           MOVE T-CODE TO PERABSCODE OF PAREC.
           START PER-ABSENCE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PA-STATUS NOT = "00" MOVE 17 TO COND-WORD.
019600     IF COND-WORD = 17
019700       MOVE 35042 TO CATREAD-MSG-NUMBER
019900       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (3) INDS (99)
020800       GO TO 6-MAIN.
021200
021300     MOVE DATE-FLAG TO DATE-CODE.
021400     MOVE 3         TO DATE-MODE.
021500     MOVE T-DATE TO DATE-VALIDATE-IN.
021600     CALL "TDATECHK" USING DATE-CHECK-AREA.
021700     IF DATE-RET-CODE = 1
021800       MOVE 35028 TO CATREAD-MSG-NUMBER
022000       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (1) INDS (99)
022900       GO TO 6-MAIN.
023000
023100     IF DATE-DB-YY NOT = T-YR
023200         MOVE 35032 TO CATREAD-MSG-NUMBER
023400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
024300         GO TO 6-MAIN.
024400
024500     MOVE "N" TO ERROR-SW.
024600     IF T-HOUR NUMERIC
024700         IF T-HOUR > 0
024800             IF T-HOUR < 25
024900                 NEXT SENTENCE
025000             ELSE
025100             MOVE "Y" TO ERROR-SW
025200         ELSE
025300         MOVE "Y" TO ERROR-SW
025400     ELSE
025500     MOVE "Y" TO ERROR-SW.
025600
025700     IF ERROR-SW = "Y"
025800         MOVE 35055 TO CATREAD-MSG-NUMBER
026000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (4) INDS (99)
026900         GO TO 6-MAIN.
027000
027100     MOVE "N" TO ERROR-SW.
027200     IF T-DAYS NUMERIC
027300         IF T-DAYS > 0
027400             NEXT SENTENCE
027500         ELSE
027600         MOVE "Y" TO ERROR-SW
027700     ELSE
027800     MOVE "Y" TO ERROR-SW.
027900
028000     IF ERROR-SW = "Y"
028100         MOVE 35105 TO CATREAD-MSG-NUMBER
028300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (99)
029200         GO TO 6-MAIN.
029300
029400     MOVE 0 TO DAY1 DAY2 DAY3 DAY4 DAY5 DAY6 DAY7.
029500
029600     IF T-DAY1 NOT = SPACE MOVE 1 TO DAY1.
029700     IF T-DAY2 NOT = SPACE MOVE 2 TO DAY2.
029800     IF T-DAY3 NOT = SPACE MOVE 3 TO DAY3.
029900     IF T-DAY4 NOT = SPACE MOVE 4 TO DAY4.
030000     IF T-DAY5 NOT = SPACE MOVE 5 TO DAY5.
030100     IF T-DAY6 NOT = SPACE MOVE 6 TO DAY6.
030200     IF T-DAY7 NOT = SPACE MOVE 7 TO DAY7.
030600     PERFORM 60-LOAD-TABLE.

030800 60-LOAD-TABLE.
030900     MOVE 1 TO SUB1 SUB2 SUB3.
031000     MOVE "N" TO YR-SW.
031200     PERFORM 601-LOAD-TABLE1 THRU 601-LOAD-TABLE1-EXIT UNTIL
031300         SUB1 > 3         OR
031400         YR-SW = "Y"      OR
031500         SUB3  > T-DAYS.
031600
031700 601-LOAD-TABLE1.
031800     MOVE DATE-DB-MM TO IN-MM.
031900     MOVE DATE-DB-DD TO IN-DD.
032000     MOVE DATE-DB-YY TO IN-YY.
076900     CALL "JULIANDATE" USING INDATE OUTDATE.
032400
032500*    IF WKDY-P = DAY1 OR
032600*                DAY2 OR
032700*                DAY3 OR
032800*                DAY4 OR
032900*                DAY5 OR
033000*                DAY6 OR
033100*                DAY7
033200*      GO TO NEXT-DATE.
033300
033400     MOVE "N" TO SPOT-SW.
033500     PERFORM 6011-LOCATE-SPOT UNTIL SPOT-SW = "Y".
033600     IF SUB1 > 3 GO TO 601-LOAD-TABLE1-EXIT.
033700
           MOVE T-CODE   TO TAB-CODE (SUB1 SUB2)
           MOVE DATE-OUT TO TAB-DATE (SUB1 SUB2)
           MOVE T-HOUR   TO TAB-HOUR (SUB1 SUB2).
034200
034300     ADD 1 TO SUB3.
034400     IF SUB3 > T-DAYS GO TO 601-LOAD-TABLE1-EXIT.
034500
034600 601-NEXT-DATE.
034700
034800     ADD 1 TO OUT-JUL.
034900     IF OUT-JUL > 365
035000       MOVE "Y" TO YR-SW
035100       GO TO 601-LOAD-TABLE1-EXIT.
035200     MOVE OUT-JULIAN  TO IN-JULDATE.
035300     CALL "GREGDATE" USING INDATE OUTDATE.
035500
035600     MOVE OUT-MM TO DATE-DB-MM.
035700     MOVE OUT-DD TO DATE-DB-DD.
035800     MOVE OUT-YY TO DATE-DB-YY.
035900
036000     MOVE DATE-FLAG TO DATE-CODE.
036100     MOVE 4         TO DATE-MODE.
036200     MOVE DATE-DB TO DATE-VALIDATE-IN.
036300     CALL "TDATECHK" USING DATE-CHECK-AREA.
036400
036500 601-LOAD-TABLE1-EXIT.
036600     EXIT.
036700
036800 6011-LOCATE-SPOT.
036900     IF TAB (SUB1 SUB2) = SPACES
037000         MOVE "Y" TO SPOT-SW
037100     ELSE
037200     ADD 1 TO SUB2
037300     IF SUB2 > 50
037400         ADD  1 TO SUB1
037500         MOVE 1 TO SUB2
037600         IF SUB1 > 3
037700             MOVE "Y" TO SPOT-SW.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

032600 999-CATREAD.
032700     MOVE SPACES TO ERROR-BUFFER.
032800     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
033700 999-CATREAD-EXIT.
033800     EXIT.
