000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPCREW.
000500*REMARKS.
000600*        ###############################################
000700*        #  Mass changes personnel  crew assignments  ##
00080 *        ###############################################.
00090 *
      *C
      *C 09/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER. AS400.
001300 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-CREW-MSTR
               ASSIGN TO DATABASE-MCFLMM3401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PCM-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001400 DATA DIVISION.
001900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                 PIC X(2000).
       FD  PER-CREW-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PCMREC.
       01  PCMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3401.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
001600 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
003300 01  CREW                      PIC X(2).
003400 01  CREW-BUF                  PIC X(2).
003900 01  ERROR-BUFFER.
           05  FILLER                PIC X(12).
           05  ERR-CC                PIC X(4).
           05  FILLER                PIC X(64).
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  PCM-STATUS            PIC XX.
           05  PF-STATUS             PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM       PIC X(08) VALUE "TPCREW  ".
001900     05  PROGRAM-TYPE          PIC X(02) VALUE "MA".
002000     05  PROGRAM-RELEASE       PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A       PIC X(60) VALUE
002300            "CHANGES THE  CREWS IN THE PERSONNEL FILE "          .
002400         10  PROG-DESC-B       PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION     PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG         PIC X.
004600 01  PER-PERSONNEL.            COPY MPERSONL OF COPYLIB.

004000 01  SCREEN-BUFFER.
004100     05  CREW1                 PIC X.
004200     05  CREW2                 PIC X.
004300     05  ZONE                  PIC X(4).
004400     05  DEPT                  PIC X(4).
004500     05  CRAFT                 PIC X(2).
           05  SCREEN-CMD-LINE       PIC X(79).
           05  SCREEN-ERR-LINE       PIC X(79).
003600 01  SUB1                      PIC S9(4) COMP-4.
003700 01  SUB2                      PIC S9(4) COMP-4.
004700 COPY DBSTAT    OF COPYLIB.

004800 01  TEMP-SHIFT-CREW.
004900     05 TEMP-SHIFT             PIC X.
005000     05 TEMP-CREW              PIC X.
       01  TRUE-VAL                  PIC 1 VALUE B"1".

005100 COPY WSCONTROL OF COPYLIB.
005200 LINKAGE SECTION.
005300 01  DBPARAMETERS.             COPY DBPARMS  OF COPYLIB.
005400 COPY VCOMLINK  OF COPYLIB.
005500 01  PLT-IDT                   PIC X(4).
005700
005800 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
005900                      PLT-IDT.
006000 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-CREW-MSTR.
           CLOSE PERSONNEL-FILE.
           GOBACK.
006100 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   PER-CREW-MSTR.
           OPEN I-O   PERSONNEL-FILE.
006200     CALL "TPWORD" USING PASSWORD-INFORMATION.
006600     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
008600     MOVE SPACES TO SCREEN-BUFFER.
009300     MOVE SPACES TO ERROR-BUFFER.
       6-MAIN.
008200     MOVE "FPCREW" TO VIEW-CFNAME.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
010100     PERFORM 61-READ-AND-UPDATE-PERSONNEL THRU 61-RAUP-EXIT.
010300
010400 61-READ-AND-UPDATE-PERSONNEL.
010500     PERFORM 98-SCREEN-READ.
011500     IF VIEW-LASTKEY = 3 GO TO 61-RAUP-EXIT.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
013600     MOVE 0 TO COND-WORD.
           START PER-CREW-MSTR KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PCM-STATUS NOT = "00" MOVE 17 TO COND-WORD.
014200     IF COND-WORD = 17
014400       MOVE 35026 TO CATREAD-MSG-NUMBER
014600       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
014700       MOVE TRUE-VAL TO INDS (1) INDS (99)
             MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
             MOVE SCREEN-BUFFER TO DSPLY-REC
014800       PERFORM 99-SCREEN-WRITE
015400       GO TO 61-READ-AND-UPDATE-PERSONNEL.
015800     MOVE CREW2 TO CREW.
           MOVE 0 TO COND-WORD.
           START PER-CREW-MSTR KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PCM-STATUS NOT = "00" MOVE 17 TO COND-WORD.
016100     IF COND-WORD = 17
016300       MOVE 35026 TO CATREAD-MSG-NUMBER
016500       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
016600       MOVE TRUE-VAL TO INDS (2) INDS (99)
             MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
             MOVE SCREEN-BUFFER TO DSPLY-REC
017300       GO TO 61-READ-AND-UPDATE-PERSONNEL.
019300
019400 61-RAUP-CONT.
           MOVE 0 TO COND-WORD.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL
               AT END    MOVE 11 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
019800     IF COND-WORD = 11 GO TO 61-RAUP-EXIT.
020400     MOVE PER-SHIFT-CREW TO TEMP-SHIFT-CREW.
020600     IF CREW1 = TEMP-CREW
020700         NEXT SENTENCE
020800     ELSE
020900     GO TO 61-RAUP-CONT.
021000
021100     IF ZONE = SPACES
021200         NEXT SENTENCE
021300     ELSE
021400     IF ZONE = PER-MAINT-ZONE
021500         NEXT SENTENCE
021600     ELSE
021700     GO TO 61-RAUP-CONT.
021800
021900     IF DEPT = SPACES
022000         NEXT SENTENCE
022100     ELSE
022200     IF DEPT = PER-DEPT
022300         NEXT SENTENCE
022400     ELSE
022500     GO TO 61-RAUP-CONT.
022600
022700     IF CRAFT = SPACES
022800         NEXT SENTENCE
022900     ELSE
023000     IF CRAFT = PER-CRAFT
023100         NEXT SENTENCE
023200     ELSE
023300     GO TO 61-RAUP-CONT.
023400
023500     MOVE CREW2 TO TEMP-CREW.
023600     MOVE TEMP-SHIFT-CREW TO PER-SHIFT-CREW.
023700
023800     MOVE 0 TO COND-WORD.
           REWRITE PFREC FROM PER-PERSONNEL
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 2-EOJ.
           MOVE 66193 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE PERCCNUM OF PFREC TO ERR-CC.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           MOVE TRUE-VAL TO INDS (98).
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE SPACES TO ERROR-BUFFER.
024400     GO TO 61-RAUP-CONT.

024600 61-RAUP-EXIT.
024700     EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

025900 999-CATREAD.
026000     MOVE SPACES TO ERROR-BUFFER.
026100     CALL "CCATREAD" USING CATREAD-PARMS.
026200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
027000 999-CATREAD-EXIT.
027100     EXIT.
