000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPDELABS.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*        ########################################################
000700*        #  Delete one year's absence records  ...............  #
000900*        ########################################################.
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.      AS400.
001400 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-ABSENCE
               ASSIGN TO DATABASE-MCFLMM3101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS PA-STATUS.
           SELECT PER-PERSONNEL
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PP-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-ABSENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PAREC.
       01  PAREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3101.
       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PPREC.
       01  PPREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
001600 WORKING-STORAGE SECTION.
       77  ABSDELE-CTR                  PIC 9(5).
       77  ABSREAD-CTR                  PIC 9(5).
       77  PER-YEAR-HOLD                PIC XX.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
003900 01  ERROR-BUFFER.
           05  ERR-LIT1                 PIC X(22).
           05  ERR-READCTR              PIC 9(5).
           05  ERR-LIT2                 PIC X(27).
           05  ERR-DELECTR              PIC 9(5).
           05  ERR-LIT3                 PIC X(21).
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PA-STATUS                PIC XX.
           05  PP-STATUS                PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
002300 01  PASSWORD-INFORMATION.
002400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPERSON6".
002500     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002700     05  PROGRAM-DESCRIPTION.
002800         10  PROG-DESC-A     PIC X(60) VALUE
002900             "PERSONNEL PROGRAM THAT ALLOWS USER TO DELETE "     .
003000         10  PROG-DESC-B     PIC X(60) VALUE
                   "A SPECIFIED YEAR OF ABSENCE DATA ".
003200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003400     05  PASSWORD-FLAG       PIC X.
004100 01  PER-ABSENCE-DATA.            COPY DPERABS  OF COPYLIB.
       01  PERSONNEL-DATA.              COPY MPERSONL OF COPYLIB.
003400 01  SCREEN-D.
           05  SCREEN-DEL-YR            PIC XX.
           05  SCREEN-CMD-LINE          PIC X(79).
           05  SCREEN-ERR-LINE          PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
005300 COPY WSCONTROL OF COPYLIB.
       01  YR-DATE-FROM-TO.
003500     05  YR-DATE-FROM.
               10  YCF                  PIC XX.
               10  YDF                  PIC XX.
               10  YDFR                 PIC XXXX.
           05  YR-DATE-TO.
               10  YCT                  PIC XX.
               10  YDT                  PIC XX.
               10  YDTR                 PIC XXXX.
       LINKAGE SECTION.
       01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK  OF COPYLIB.
       01  PLT-IDT                      PIC X(4).
005900 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
                            PLT-IDT.
007000 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-ABSENCE.
           CLOSE PER-PERSONNEL.
           GOBACK.
007100 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   PER-ABSENCE.
           OPEN I-O   PER-PERSONNEL.
006600     CALL "TPWORD" USING PASSWORD-INFORMATION.
007000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
007200     MOVE SPACES TO ERROR-BUFFER SCREEN-D.
009100 6-MAIN.
           PERFORM 60-CLEAR-PER-ABSENCE-YR THRU 60-CPAY-EXIT.
           PERFORM 61-SHUFFLE-PERS-ABS-YRS THRU 61-SPAY-EXIT.
           MOVE TRUE-VAL TO INDS (98).
           MOVE 66377 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ABSDELE-CTR TO ERR-DELECTR.
           MOVE ABSREAD-CTR TO ERR-READCTR.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-D TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
       6-MAIN-EXIT.    EXIT.

       60-CLEAR-PER-ABSENCE-YR.
           MOVE SPACES TO SCREEN-D.
           MOVE "FPDELABS" TO VIEW-CFNAME.
           MOVE SCREEN-D TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE DSPLY-REC TO SCREEN-D.
           MOVE SCREEN-DEL-YR TO YDF YDT.
           IF SCREEN-DEL-YR > "70"
              MOVE "19" TO YCF YCT
           ELSE
              MOVE "20" TO YCF YCT.
           MOVE "0000" TO YDFR.
           MOVE "9999" TO YDTR.
           MOVE TRUE-VAL TO INDS (98).
           MOVE 66376 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-D TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE 0 TO ABSDELE-CTR ABSREAD-CTR.
       60-CPAY-LOOP.
036000     READ PER-ABSENCE NEXT INTO PER-ABSENCE-DATA
036100         AT END    GO TO 60-CPAY-EXIT.
036200     IF PA-STATUS NOT = "00" GO TO 60-CPAY-EXIT.
           ADD 1 TO ABSREAD-CTR.
036300     IF PER-ABS-DATE-CN > YR-DATE-FROM
               AND PER-ABS-DATE-CN < YR-DATE-TO
               DELETE PER-ABSENCE RECORD
               ADD 1 TO ABSDELE-CTR.
           GO TO 60-CPAY-LOOP.
       60-CPAY-EXIT.    EXIT.

       61-SHUFFLE-PERS-ABS-YRS.
           READ PER-PERSONNEL NEXT INTO PERSONNEL-DATA
               AT END    GO TO 61-SPAY-EXIT.
           IF PER-YEAR1 = "  "
               IF PER-YEAR2 = "  "
                   IF PER-YEAR3 = "  "
                       GO TO 61-SHUFFLE-PERS-ABS-YRS
                   ELSE
                   MOVE PER-YEAR3 TO PER-YEAR1
                   MOVE "  "      TO PER-YEAR3
               ELSE
               IF PER-YEAR3 = "  "
                   MOVE PER-YEAR2 TO PER-YEAR1
                   MOVE "  "      TO PER-YEAR2
               ELSE
               IF PER-YEAR2 < PER-YEAR3 OR
                   (PER-YEAR2 > "70" AND PER-YEAR3 < "71")
                   MOVE PER-YEAR2 TO PER-YEAR1
                   MOVE PER-YEAR3 TO PER-YEAR2
                   MOVE "  "      TO PER-YEAR3
               ELSE
               MOVE PER-YEAR3 TO PER-YEAR1
               MOVE "  "      TO PER-YEAR3
           ELSE
           IF PER-YEAR2 = "  "
               IF PER-YEAR3 = "  "
                   NEXT SENTENCE
               ELSE
               MOVE PER-YEAR3 TO PER-YEAR2
               MOVE "  " TO PER-YEAR3
           ELSE
           IF PER-YEAR1 < PER-YEAR2 OR
              (PER-YEAR1 > "70" AND PER-YEAR2 < "71")
               IF PER-YEAR1 < PER-YEAR3 OR
                 (PER-YEAR1 > "70" AND PER-YEAR3 < "71")
                   NEXT SENTENCE
               ELSE
               IF PER-YEAR2 < PER-YEAR3 OR
                 (PER-YEAR2 > "70" AND PER-YEAR3 < "71")
                   NEXT SENTENCE
               ELSE
               MOVE PER-YEAR2 TO PER-YEAR-HOLD
               MOVE PER-YEAR3 TO PER-YEAR2
               MOVE PER-YEAR-HOLD TO PER-YEAR3
           ELSE
           IF PER-YEAR2 < PER-YEAR3 OR
             (PER-YEAR2 > "70" AND PER-YEAR3 < "71")
               MOVE PER-YEAR1 TO PER-YEAR-HOLD
               MOVE PER-YEAR2 TO PER-YEAR1
               MOVE PER-YEAR-HOLD TO PER-YEAR3
           ELSE
           MOVE PER-YEAR1 TO PER-YEAR-HOLD
           MOVE PER-YEAR3 TO PER-YEAR1
           MOVE PER-YEAR-HOLD TO PER-YEAR3.
           IF PER-YEAR1 = YDF
               MOVE PER-YEAR2 TO PER-YEAR1
               MOVE PER-YEAR3 TO PER-YEAR2
               MOVE SPACES    TO PER-YEAR3
           ELSE
           IF PER-YEAR2 = YDF
               IF PER-YEAR1 < PER-YEAR3 OR
                  (PER-YEAR1 > "70" AND PER-YEAR3 < "71")
                   MOVE PER-YEAR3 TO PER-YEAR2
                   MOVE SPACES    TO PER-YEAR3
               ELSE
               MOVE PER-YEAR1 TO PER-YEAR2
               MOVE PER-YEAR3 TO PER-YEAR1
               MOVE SPACES    TO PER-YEAR3
           ELSE
           IF PER-YEAR3 = YDF
               IF PER-YEAR1 < PER-YEAR2 OR
                 (PER-YEAR1 > "70" AND PER-YEAR2 < "71")
                   MOVE SPACES TO PER-YEAR3
               ELSE
               MOVE PER-YEAR2 TO PER-YEAR3
               MOVE PER-YEAR1 TO PER-YEAR2
               MOVE PER-YEAR3 TO PER-YEAR1
               MOVE SPACES    TO PER-YEAR3.
           REWRITE PPREC FROM PERSONNEL-DATA.
           GO TO 61-SHUFFLE-PERS-ABS-YRS.
       61-SPAY-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

050100 999-CATREAD.
050200     MOVE SPACES TO ERROR-BUFFER.
050300     CALL "CCATREAD" USING CATREAD-PARMS.
050400     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
051100 999-CATREAD-EXIT.
051200     EXIT.
