000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPDISP3.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*       #########################################################
000700*       # This is the personnel training and experience display #
000800*       # program --------------------------------------------- #
000900*       #########################################################.
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.      AS400.
001400 OBJECT-COMPUTER.      AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-FREE
               ASSIGN TO DATABASE-MCFLMM3201
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-FREE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3201.
001600 WORKING-STORAGE SECTION.
005800 01  ADD-SW                       PIC X VALUE "N".
006800 01  BYTE-99                      PIC 99.
       COPY CATREAD OF COPYLIB.
006700 01  CL                           PIC S9(4) COMP.
       COPY CPYIND  OF COPYLIB.
006900 01  CS                           PIC S9(4) COMP-4.
005900 01  ERROR-SW                     PIC X.
006500 01  ERROR-BUFFER                 PIC X(80) VALUE SPACES.
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PF-STATUS                PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
004700 01  PASSED-SPOOL-PRT             PIC S9(2) COMP VALUE 0.
001800 01  PASSWORD-INFORMATION.
001900     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPDISP3 ".
002000     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002100     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002200     05  PROGRAM-DESCRIPTION.
002300         10  PROG-DESC-A     PIC X(60) VALUE
002400            "PERSONNEL TRAINING AND EXPERIENCE DISPLAY PROGRAM " .
002500         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002700         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002900     05  PASSWORD-FLAG       PIC X.
003000 01  PASSWORD-INFORMATION1.
003100     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPMOD3  ".
003200     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
003300     05  PROGRAM-RELEASE     PIC X(12) VALUE " C0100010001".
003400     05  PROGRAM-DESCRIPTION.
003500         10  PROG-DESC-A     PIC X(60) VALUE
003600             "PERSONNEL TRAINING AND EXPERIENCE MODIFY PROGRAM " .
003700         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003900         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004100     05  PASSWORD-FLAG       PIC X.
007100 01  PER-FREE-WS.                 COPY DPERFREE OF COPYLIB.
006300 01  SAVE-KEY                     PIC S9(4) COMP.
004300 01  SCREEN-PRINT-PARMS.
004400     05 PRINTCNTL                 PIC S9(4) COMP VALUE 0.
004500     05 PAGECNTL                  PIC S9(4) COMP VALUE 49.
004600     05 SPOOLFIL-OPEN-SW          PIC X VALUE "N".
008000 01  SCREEN-TABLES.
008100     05 SCREEN OCCURS 10 TIMES.
008200         10 SLINE OCCURS 15 TIMES PIC X(66).
007000 COPY DBSTAT OF COPYLIB.
007200 01  TERM-BUFFER.
007300     05 T-CC                      PIC X(4).
007400     05 T-SCREEN-NO               PIC 99.
007500     05 T-SCREEN-NO-X REDEFINES T-SCREEN-NO
007600                                  PIC XX.
007700     05 T-TRNG-EXP.
007800        10 T-REC OCCURS 15 TIMES  PIC X(66).
007900     05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
008300 COPY WSCONTROL OF COPYLIB.
008400 LINKAGE SECTION.
008500 01  DBPARAMETERS.                COPY DBPARMS  OF COPYLIB.
008600 COPY VCOMLINK OF COPYLIB.
008700 01  PLT-IDT                      PIC X(4).
008900 01  PER-PERSONNEL.               COPY MPERSONL OF COPYLIB.
009000
009100 PROCEDURE DIVISION USING DBPARAMETERS
009200                          VIEW-COMAREA
009300                          PLT-IDT
009500                          PER-PERSONNEL.
009600 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
016900     IF ADD-SW = "Y"
017200         PERFORM 63-DEL-TRNG-EXP THRU 63-DTE-EXIT
017300         PERFORM 64-ADD-TRNG-EXP.
           CLOSE DISPLAY-FILE.
           CLOSE PER-FREE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   PER-FREE.
009800     CALL "TPWORD" USING PASSWORD-INFORMATION.
010200     IF PASSWORD-FLAG OF PASSWORD-INFORMATION = "N"
010300         GO TO 2-EOJ.
010500 6-MAIN.
010600     PERFORM 60-GATHER-TRNG-EXP-DATA.
010700     PERFORM 61-SHOW.
010800     PERFORM 62-READ-SCREEN.
011000 60-GATHER-TRNG-EXP-DATA.
011300     MOVE SPACES TO ERROR-BUFFER.
012300     MOVE SPACES TO SCREEN-TABLES.
012600     PERFORM 69-START-PER-FREE.
013000     IF COND-WORD = 17 GO TO 2-EOJ.
013100     PERFORM 69-READ-PER-FREE.
013400     IF COND-WORD = 15 GO TO 2-EOJ.
013500     PERFORM 60-GATHER-CONT UNTIL COND-WORD = 15.
013600 60-GATHER-CONT.
013700     MOVE PER-FREE-PAGE TO BYTE-99.
013800     MOVE BYTE-99 TO CS.
013900     MOVE PER-FREE-LINE TO BYTE-99.
014000     MOVE BYTE-99 TO CL.
014100     MOVE PER-FREE-DATA TO SLINE (CS, CL).
014200     PERFORM 69-READ-PER-FREE.
014800 61-SHOW.
014900     MOVE 1 TO CS.
015000     MOVE SPACES TO ERROR-BUFFER.
015100     MOVE "FPDISP3" TO VIEW-CFNAME.
015600     MOVE SPACES TO TERM-BUFFER.
015700     MOVE PER-CC-NUM TO T-CC.
015800     MOVE 1 TO T-SCREEN-NO.
015900     MOVE SCREEN (1) TO T-TRNG-EXP.
           MOVE 66203 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
016000     PERFORM 99-SCREEN-WRITE.
018100 62-READ-SCREEN.
018200     PERFORM 98-SCREEN-READ.
019300     IF VIEW-LASTKEY = 3
019400         MOVE "N" TO ADD-SW
019500         GO TO 2-EOJ.
022000     MOVE VIEW-LASTKEY TO SAVE-KEY.
           MOVE DSPLY-REC TO TERM-BUFFER.
           MOVE T-TRNG-EXP TO SCREEN (CS).
           IF VIEW-LASTKEY = 7
               MOVE "Y" TO ADD-SW
               GO TO 2-EOJ.
022500     IF SAVE-KEY = 1
022600         ADD 1 TO CS
022700         IF CS > 10
022800             SUBTRACT 1 FROM CS
                   PERFORM 99-SCREEN-WRITE
023000             GO TO 62-READ-SCREEN
023100         ELSE
023200         MOVE SCREEN (CS) TO T-TRNG-EXP
023300         MOVE CS TO T-SCREEN-NO
               MOVE TERM-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
023700         GO TO 62-READ-SCREEN.
023800
023900     IF SAVE-KEY = 2
024000         SUBTRACT 1 FROM CS
024100         IF CS < 1
024200             ADD 1 TO CS
                   PERFORM 99-SCREEN-WRITE
024400             GO TO 62-READ-SCREEN
024500         ELSE
024600         MOVE SCREEN (CS) TO T-TRNG-EXP
024700         MOVE CS TO T-SCREEN-NO
               MOVE TERM-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
025100         GO TO 62-READ-SCREEN.
025200
025300     IF SAVE-KEY = 6
025400         MOVE "FPDISP3B" TO VIEW-CFNAME
026000         MOVE 31026 TO CATREAD-MSG-NUMBER
026200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026300         MOVE SPACES TO T-SCREEN-NO-X
026400         MOVE SPACES TO T-TRNG-EXP
026500         MOVE ERROR-BUFFER TO T-REC (1)
026600         PERFORM 99-SCREEN-WRITE
027000         GO TO 62-READ-SCREEN.
027100
027200********************
027300* VIEW-LASTKEY = 5 *
027400********************
027500     IF VIEW-CFNAME = "FPDISP3"
027600         CALL "TPWORD" USING PASSWORD-INFORMATION1
028000         IF PASSWORD-FLAG OF PASSWORD-INFORMATION1 = "N"
028100             MOVE "N" TO ADD-SW
028200             GO TO 2-EOJ
028300         ELSE
028400         MOVE "FPDISP3A" TO VIEW-CFNAME
               MOVE 66204 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO TERM-CMD-LINE
               MOVE TERM-BUFFER TO DSPLY-REC
028800         PERFORM 99-SCREEN-WRITE
028900         GO TO 62-READ-SCREEN.
029700     MOVE T-TRNG-EXP TO SCREEN (CS).
           PERFORM 99-SCREEN-WRITE.
029900     GO TO 62-READ-SCREEN.
033000
033100 63-DEL-TRNG-EXP.
033400     PERFORM 69-START-PER-FREE.
033700     IF COND-WORD = 17 GO TO 63-DTE-EXIT.
033900     PERFORM 69-READ-PER-FREE.
           IF COND-WORD = 15 GO TO 63-DTE-EXIT.
           PERFORM 69-DELETE-PER-FREE.
           IF COND-WORD = 17
               GO TO 63-DTE-EXIT
           ELSE
           GO TO 63-DEL-TRNG-EXP.
       63-DTE-EXIT.    EXIT.
035800 64-ADD-TRNG-EXP.
035900     MOVE 39014 TO CATREAD-MSG-NUMBER.
036100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
           MOVE TRUE-VAL TO INDS (98).
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
037000     PERFORM 64-ADD-TRNG-EXP-CONT VARYING CS FROM 1 BY 1
037100         UNTIL CS > 10.
037200 64-ADD-TRNG-EXP-CONT.
037300     PERFORM 64-ADD-TRNG-EXP-CONT1 THRU 64-A-T-E-C-E
037400         VARYING CL FROM 1 BY 1 UNTIL CL > 15.
037500 64-ADD-TRNG-EXP-CONT1.
037600     IF SLINE (CS, CL) = SPACES GO TO 64-A-T-E-C-E.
037700     MOVE PER-CC-NUM TO PER-FREE-CC.
037800     MOVE CS TO BYTE-99.
037900     MOVE BYTE-99 TO PER-FREE-PAGE.
038000     MOVE CL TO BYTE-99.
038100     MOVE BYTE-99 TO PER-FREE-LINE.
038200     MOVE SLINE (CS, CL) TO PER-FREE-DATA.
038300     PERFORM 69-WRITE-PER-FREE.
038700 64-A-T-E-C-E.
038800     EXIT.

       69-DELETE-PER-FREE.
           MOVE 0 TO COND-WORD.
           DELETE PER-FREE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-PER-FREE.
           MOVE 0 TO COND-WORD.
           READ PER-FREE NEXT INTO PER-FREE-WS
               AT END    MOVE 15 TO COND-WORD.
           IF PER-CC-NUM NOT = PERCCNUM OF PFREC
               MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-PER-FREE.
           MOVE 0 TO COND-WORD.
           MOVE PER-CC-NUM TO PERCCNUM OF PFREC.
           START PER-FREE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-PER-FREE.
           MOVE 0 TO COND-WORD.
           WRITE PFREC FROM PER-FREE-WS
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

051100 999-CATREAD.
024000     MOVE SPACES TO ERROR-BUFFER.
024100     CALL "CCATREAD" USING CATREAD-PARMS.
024200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
052100 999-CATREAD-EXIT.
052200     EXIT.
