000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPDISP1.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*        #######################################################
000700*        # This is the personnel basic information display pro #
000800*        # gram .............................................. #
000900*        #######################################################.
      *C  09/09/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    COMPUTE CENTURY AFTER DISPLAY BEFORE REWRITING.
      *C
      *C  11/15/02  JEFF BUNGO
      *C    ADDED USERID TO THE PERSONNEL FILE (REQUIRED)
      *C
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.    AS400.
001400 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PER-CREW-FILE
               ASSIGN TO DATABASE-MCFLMM3401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PCF-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
           SELECT WO-ZONE-PRTY-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  PER-CREW-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PCFREC.
       01  PCFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3401.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.
       FD  WO-ZONE-PRTY-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPFREC.
       01  WZPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
001600 WORKING-STORAGE SECTION.
005500 01  ARG-VALUE                    PIC XX.
005600 01  ARG-VALUE1.
           05  ARG-ZONE                 PIC X(4).
           05  ARG-PRTY                 PIC XX.
       01  BLOWUP-BASE                  PIC X(16).
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
006300 01  CREW-BUF                     PIC X(2).
006700 COPY TDATESUB IN COPYLIB.
006200 01  ERROR-BUFFER.
           05  FILLER                   PIC X(12).
           05  ERR-CC                   PIC XXXX.
           05  FILLER                   PIC X(64).
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PCF-STATUS               PIC XX.
           05  PF-STATUS                PIC XX.
           05  WCRF-STATUS              PIC XX.
           05  WZPF-STATUS              PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPDISP1 ".
001900     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A     PIC X(60) VALUE
002300            "PERSONNEL BASIC INFORMATION DISPLAY PROGRAM "       .
002400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG       PIC X.
002900 01  PASSWORD-INFORMATION1.
003000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPMOD1  ".
003100     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
003200     05  PROGRAM-RELEASE     PIC X(12) VALUE " C0100010001".
003300     05  PROGRAM-DESCRIPTION.
003400         10  PROG-DESC-A     PIC X(60) VALUE
003500             "PERSONNEL BASIC INFORMATION MODIFY PROGRAM "       .
003600         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003800         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004000     05  PASSWORD-FLAG       PIC X.
004100 01  SCREEN-PRINT-PARMS.
004200     05 PRINTCNTL                 PIC S9(4) COMP VALUE 0.
004300     05 PAGECNTL                  PIC S9(4) COMP VALUE 49.
004400     05 SPOOLFIL-OPEN-SW          PIC X VALUE "N".
004500 01  PASSED-SPOOL-PRT             PIC S9(2) COMP VALUE 0.
006600 COPY DBSTAT IN COPYLIB.
       COPY TBLOWUP OF COPYLIB.
006900 01  TERM-BUFFER.
007000     05  TDATE-MD-OR-DM           PIC X(6).
007100     05  TERM-BUF-AREA.
007200         10  TBUF-CC-NO.
007300             15  TBUF-CC-NO-1     PIC X.
007400             15  FILLER           PIC XXX.
007500         10  TBUF-EMPL-NAME       PIC X(16).
007600         10  TBUF-CSD.
007700             15  TBUF-CSD-MM      PIC 99.
007800             15  TBUF-CSD-DD      PIC 99.
007900             15  TBUF-CSD-YY      PIC 99.
008000         10  TBUF-CRAFT           PIC XX.
008100         10  TBUF-MAINT-ZONE      PIC X(4).
008200         10  TBUF-DEPT            PIC X(4).
008300         10  TBUF-LABOR-RATE      PIC 9(6)V9(4).
008600         10  TBUF-EMPL-RATE       PIC XX.
008700         10  TBUF-SHIFT-CREW.
008800             15  TBUF-SHIFT       PIC X.
008900             15  TBUF-CREW        PIC X.
               10  TBUF-USRID           PIC X(10).
           05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       01  WHO-PARMS.
           05  USERNAME                 PIC X(10).
           05  TERMNUM                  PIC X(10).
           05  CURRLIB                  PIC X(10).
           05  JOBLIBX                  PIC X.
       COPY WSCONTROL OF COPYLIB.
006000 01  ZONE-SW                      PIC X.
006400 01  ZONE-PRTY.                   COPY MZONPRTY OF COPYLIB.
009100 LINKAGE SECTION.
009200 01  DBPARAMETERS.                COPY DBPARMS  OF COPYLIB.
009300 COPY VCOMLINK IN COPYLIB.
009400 01  PLT-IDT                      PIC X(4).
009600 01  PER-PERSONNEL.               COPY MPERSONL OF COPYLIB.
009800 PROCEDURE DIVISION USING DBPARAMETERS
009900                          VIEW-COMAREA
010000                          PLT-IDT
010200                          PER-PERSONNEL.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-CONT
               UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PER-CREW-FILE.
           CLOSE PERSONNEL-FILE.
           CLOSE WO-CRAFTS-REQD-FILE.
           CLOSE WO-ZONE-PRTY-FILE.
           GOBACK.
011100 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PER-CREW-FILE.
           OPEN I-O   PERSONNEL-FILE.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
           OPEN INPUT WO-ZONE-PRTY-FILE.
010400     CALL "TPWORD" USING PASSWORD-INFORMATION.
010800     IF PASSWORD-FLAG OF PASSWORD-INFORMATION = "N" GO TO 2-EOJ.
011200     MOVE SPACES TO ERROR-BUFFER BLOWUP-BASE.
011300     MOVE "FPDISP1A" TO VIEW-CFNAME.
011800     MOVE SPACES TO TERM-BUFFER.
           MOVE ZEROES TO TBUF-LABOR-RATE.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
011900     MOVE DATE-FLAG TO DATE-CODE.
012000     IF DATE-FLAG = 1
012100       MOVE 39002 TO CATREAD-MSG-NUMBER
012300       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
012400       MOVE ERROR-BUFFER TO TDATE-MD-OR-DM
012500     ELSE
012600     MOVE 30003 TO CATREAD-MSG-NUMBER
012800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
012900     MOVE ERROR-BUFFER TO TDATE-MD-OR-DM.
       6-MAIN.
013000     MOVE PER-CC-NUM TO TBUF-CC-NO.
013100     MOVE PER-EMP-NAME TO TBUF-EMPL-NAME.
013200     MOVE DATE-FLAG TO DATE-CODE.
013300     MOVE 4 TO DATE-MODE.
           IF PER-CSD = "      "
                NEXT SENTENCE
           ELSE
013400     MOVE PER-CSD TO DATE-VALIDATE-IN
013500     CALL "TDATECHK" USING DATE-CHECK-AREA
013600     MOVE DATE-OUT TO TBUF-CSD.
013700     MOVE PER-CRAFT TO TBUF-CRAFT.
013800     MOVE PER-MAINT-ZONE TO TBUF-MAINT-ZONE.
013900     MOVE PER-DEPT TO TBUF-DEPT.
014000     MOVE PER-LABOR-RATE TO TBUF-LABOR-RATE.
014100     MOVE PER-RATING TO TBUF-EMPL-RATE.
014200     MOVE PER-SHIFT-CREW TO TBUF-SHIFT-CREW.
           MOVE PER-USRID TO TBUF-USRID.
           MOVE 66182 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
       6-MAIN-CHECK.
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
015600     PERFORM 98-SCREEN-READ.
016600     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
017900     IF VIEW-LASTKEY = 5
               IF TBUF-CC-NO = "9999"
                   IF USERNAME = "PD01      " OR "T881S03  "
                       NEXT SENTENCE
                   ELSE
                   MOVE 3640 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO TERM-CMD-LINE
                   GO TO 6-MAIN-CHECK
               ELSE
018000         NEXT SENTENCE
018100     ELSE
018300     GO TO 6-MAIN.
018400     CALL "TPWORD" USING PASSWORD-INFORMATION1.
018800     IF PASSWORD-FLAG OF PASSWORD-INFORMATION1 = "N"
018900         GO TO 2-EOJ.
           MOVE SPACES TO TERM-CMD-LINE.
       6-MAIN-CONT.
019000     MOVE "FPDISP1B" TO VIEW-CFNAME.
           IF INDS (99) = TRUE-VAL
               MOVE ERROR-BUFFER TO TERM-CMD-LINE
           ELSE
           MOVE 66184 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO TERM-CMD-LINE.
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
020300     PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO TERM-BUFFER.
021300     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
023500     MOVE 0 TO DATE-RET-CODE.
           IF TBUF-CSD = "      "
               NEXT SENTENCE
           ELSE
023600     MOVE TBUF-CSD TO DATE-VALIDATE-IN
023700     MOVE 3 TO DATE-MODE
023800     CALL "TDATECHK" USING DATE-CHECK-AREA
023900     IF DATE-RET-CODE = 1
024100         MOVE DATE-MSG TO ERROR-BUFFER
               MOVE TRUE-VAL TO INDS (99)
024900         GO TO 6-MAIN-CONT.
           MOVE 0 TO COND-WORD.
025100     MOVE TBUF-CRAFT TO ARG-VALUE.
           MOVE ARG-VALUE TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WCRF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
025500     IF COND-WORD = 17
025700         MOVE 35037 TO CATREAD-MSG-NUMBER
025900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (03) INDS (99)
026700         GO TO 6-MAIN-CONT.
           MOVE 0 TO COND-WORD.
027200     MOVE TBUF-MAINT-ZONE TO ARG-ZONE.
           MOVE "1 " TO ARG-PRTY.
027300     MOVE ARG-VALUE1 TO ZONEPRTY OF WZPFREC.
027400     MOVE "N" TO ZONE-SW.
027500     START WO-ZONE-PRTY-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
027600         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WZPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
027700     IF COND-WORD = 0
027800         MOVE "Y" TO ZONE-SW.
032600     IF ZONE-SW = "N"
032800         MOVE 35044 TO CATREAD-MSG-NUMBER
032900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (4) INDS (99)
               GO TO 6-MAIN-CONT.
033900     IF SPACES = TBUF-SHIFT AND TBUF-CREW
034100         MOVE 31057 TO CATREAD-MSG-NUMBER
034300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
034400         MOVE TRUE-VAL TO INDS (8) INDS (99)
035100         GO TO 6-MAIN-CONT.
           IF TBUF-USRID = SPACES
               MOVE SPACES TO ERROR-BUFFER
               MOVE "USERID REQUIRED" TO ERROR-BUFFER
               MOVE TRUE-VAL TO INDS (10) INDS (99)
               GO TO 6-MAIN-CONT.
035200     IF TBUF-CREW = SPACES
035300         NEXT SENTENCE
035400     ELSE
035500     MOVE 0 TO COND-WORD
035600     MOVE TBUF-CREW TO ARG-VALUE
035700     MOVE ARG-VALUE TO CREWMASTER OF PCFREC
035800     PERFORM 69-START-PER-CREW-FILE
036000     IF COND-WORD = 17
036200         MOVE 35026 TO CATREAD-MSG-NUMBER
036400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (9) INDS (99)
037200         GO TO 6-MAIN-CONT.
038000     MOVE 0 TO COND-WORD.
           MOVE PER-CC-NUM TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
038300     IF COND-WORD = 17 GO TO 2-EOJ.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 2-EOJ.
           IF TBUF-CSD = "      "
               NEXT SENTENCE
           ELSE
038500     MOVE TBUF-CSD TO DATE-VALIDATE-IN
038600     MOVE 3 TO DATE-MODE
038700     CALL "TDATECHK" USING DATE-CHECK-AREA
038800     MOVE DATE-DB TO PER-CSD
      *-----COMPUTE CENTURY FOR CSD DATE
           IF PER-CSD-YY > 40
               MOVE 19 TO PER-CSD-CC
           ELSE
               MOVE 20 TO PER-CSD-CC.
038900     MOVE TBUF-CC-NO TO PER-CC-NUM.
039000     MOVE TBUF-EMPL-NAME TO PER-EMP-NAME.
039100     MOVE TBUF-CRAFT TO PER-CRAFT.
039200     MOVE TBUF-MAINT-ZONE TO PER-MAINT-ZONE.
039300     MOVE TBUF-DEPT TO PER-DEPT.
039400     MOVE TBUF-LABOR-RATE TO PER-LABOR-RATE.
039500     MOVE TBUF-EMPL-RATE TO PER-RATING.
039600     MOVE TBUF-SHIFT-CREW TO PER-SHIFT-CREW.
           MOVE TBUF-USRID TO PER-USRID.
039700     MOVE 0 TO COND-WORD.
039800     REWRITE PFREC FROM PER-PERSONNEL
039900         INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE "REWRITE FAILED * TPDISP1 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP
           ELSE
           MOVE 66183 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TBUF-CC-NO TO ERR-CC
           MOVE ERROR-BUFFER TO TERM-CMD-LINE
           MOVE TERM-BUFFER TO DSPLY-REC
           MOVE TRUE-VAL TO INDS (98)
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE 3 TO VIEW-LASTKEY.

       69-START-PER-CREW-FILE.
           MOVE 0 TO COND-WORD.
           START PER-CREW-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PCF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TPDISP1" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

040500 999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
041500 999-CATREAD-EXIT.
041600     EXIT.
