       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPERPASS.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
       DATE-WRITTEN.           SEPTEMBER 1987.
      *REMARKS.                THE PERSONNEL PASSWORD SYSTEM ****
      *                        THIS IS THE SUBROUTINE CALLED TO ENTER
      *                        AND CHANGE INDIVIDUAL PASSWORDS FOR PLANT
      *                        PERSONNEL WHEN EXECUTING SPECIFIC PROGRAMS.
      *                        PASSWORD CHANGES ARE FORCED EVERY 35 DAYS.
      *                        ****.
      *C
      *C  03/11/1998   CA YODER   REQ #97-1125
      *C    EXPANDED PASSWORD FIELD FROM 6 TO 8 CHARACTERS.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PERS-READ
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PERS-UPDATE
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPERPASS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PERS-READ
           LABEL RECORDS       ARE STANDARD.
       01  READ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  PERS-UPDATE
           LABEL RECORDS       ARE STANDARD.
       01  UPDATE-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZPERPASS.

       WORKING-STORAGE SECTION.
       77  FILE-STAT           PIC XX.
      *-------- EXPANDED PASSWORD FIELD.
      *77  VERIFY-PWORD        PIC X(06).
       77  VERIFY-PWORD        PIC X(08).
      *77  TRAN-LEN            PIC 9(5)    VALUE 6   COMP-3.
       77  TRAN-LEN            PIC 9(5)    VALUE 8   COMP-3.
      *77  TRAN-BUF            PIC X(06).
       77  TRAN-BUF            PIC X(08).
       77  TRAN-CODE           PIC X.
       77  CYCLE-DATE          PIC 9(4)    VALUE 0   COMP-4.
       77  CURR-DATE           PIC 9(4)    VALUE 0   COMP-4.
       77  SHOW-SW             PIC S9(4)   VALUE 0   COMP-4.
       77  CC-SW               PIC S9(4)   VALUE 0   COMP-4.
           88  CC-FOUND                    VALUE 0.
       77  EXPIRE-SW           PIC S9(4)   VALUE 0   COMP-4.
           88  EXPIRED                     VALUE 1.
       77  HELP-KEY            PIC XXXX    VALUE "#$%&".
       77  TRUE-VAL            PIC 1       VALUE B"1".
       77  NEG-VAL             PIC 1       VALUE B"0".
       77  S90                 PIC 1       VALUE B"0".
       77  S91                 PIC 1       VALUE B"0".
       77  S92                 PIC 1       VALUE B"0".
       77  D-PARM              PIC X.
       77  L-PARM              PIC X.
       77  CMDSAV              PIC X(79).

       01  CUR-DATE-CN.
           05  CC-BUFFER         PIC XX.
           05  CUR-DATE.
               10  YY-BUFFER     PIC XX.
               10  MM-BUFFER     PIC XX.
               10  DD-BUFFER     PIC XX.

      *-------- EXPANDED PASSWORD FIELD.
       01  SCREEN-DATA.
           05  CC-NUMBER       PIC X(04).
           05  CC-NAME         PIC X(16).
      **** 05  OLD-PWORD       PIC X(06).
           05  OLD-PWORD       PIC X(08).
           05  PW-MESSAGE      PIC X(30).
           05  NEW-PWORD.
               10  FIRST-BUF   PIC X.
               10  FILLER      PIC XXX.
      ******   10  LAST-TWO    PIC XX.
               10  LAST-FOUR   PIC XXXX.
           05  HELP-MSG        PIC X(26).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  HELP-LINE.
           05  HELP-NAME       PIC X(16).
           05  HELP-E1         PIC X(02).
           05  HELP-E2         PIC X(04).
           05  HELP-E3         PIC X(04).

       01  GREG-DATE.
           05  G-YEAR          PIC XXXX.
           05  G-MONTH         PIC XX.
           05  G-DAY           PIC XX.

       01  JUL-SIGN            PIC S9(06).
       01  JUL-DATE            PIC  X(07).
       01  JULIAN-DATE         REDEFINES JUL-DATE
                               PIC  9(07).
       01  FILLER              REDEFINES JUL-DATE.
           05  J-YEAR          PIC 9999.
           05  J-DAY           PIC 999.

           COPY CATREAD        IN COPYLIB.

           COPY SCREENIO       IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  YREND-BUF           PIC 9(4).
       01  YREND-WORK          PIC S9(4).

       LINKAGE SECTION.
       01  CLOCK-CARD          PIC XXXX.

       01  NAME-BUFFER         PIC X(16).

       01  PWORD-BUFFER.
      **** 05  PWORD-BUF       PIC X(06).
           05  PWORD-BUF       PIC X(08).
           05  PWD-X           PIC XX.
           05  DATE-BUF        REDEFINES PWD-X PIC 9(4) COMP-4.

       01  PWORD-SWITCH        PIC X.

       PROCEDURE DIVISION      USING CLOCK-CARD
                               NAME-BUFFER
                               PWORD-BUFFER
                               PWORD-SWITCH.
       MAIN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          PERS-READ.
           MOVE "N"            TO PWORD-SWITCH.
           MOVE 0              TO SHOW-SW
                                  CC-SW
                                  EXPIRE-SW
                                  CYCLE-DATE
                                  CURR-DATE.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE NEG-VAL        TO S90 S91 S92.
           MOVE SPACES         TO SCREEN-DATA.

           ACCEPT CUR-DATE     FROM DATE.
           MOVE 20             TO CC-BUFFER.
           IF YY-BUFFER > 70
               MOVE 19         TO CC-BUFFER.

           MOVE CUR-DATE-CN    TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE J-DAY          TO JUL-SIGN CURR-DATE.
           SUBTRACT 35         FROM JUL-SIGN.
           IF JUL-SIGN < 0
               ADD 365         TO JUL-SIGN.
           MOVE JUL-SIGN       TO CYCLE-DATE.

           IF CLOCK-CARD = SPACES
               MOVE 1          TO CC-SW
           ELSE
               MOVE "1"        TO TRAN-CODE
               MOVE PWORD-BUF  TO TRAN-BUF
               CALL "CTRANSLATE" USING TRAN-LEN
                                 TRAN-BUF
                                 TRAN-CODE.

           MOVE HELP-KEY       TO PERCCNUM OF PERS-READ.
           READ PERS-READ      INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO PERSONNEL-DATA
               GO TO CONTINUE-PROC.

           IF PER-CC-NUM NOT = HELP-KEY
               MOVE SPACES     TO PERSONNEL-DATA.

       CONTINUE-PROC.
           MOVE PER-EMP-NAME   TO HELP-NAME.
           MOVE PER-CRAFT      TO HELP-E1.
           MOVE PER-MAINT-ZONE TO HELP-E2.
           MOVE PER-TEMP-ZONE  TO HELP-E3.

           IF CC-FOUND
               MOVE CLOCK-CARD  TO CC-NUMBER
               MOVE NAME-BUFFER TO CC-NAME
           ELSE
               MOVE SPACES     TO CC-NUMBER CC-NAME
      **********************************************************************
      **    MESSAGE 031/095:
      ** ENTER YOUR IDENTIFICATION NUMBER AND PASSWORD AND PRESS `ENTER':
      **********************************************************************
               MOVE 31095      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO CMDMSG CMDSAV
               MOVE TRUE-VAL   TO IND (23).

           MOVE HELP-LINE      TO HELP-MSG.

       SHOWFORM.
           ADD 1               TO SHOW-SW.
           PERFORM READ-WRITE-SCREEN.
           MOVE SPACES         TO CMDMSG.
           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               SUBTRACT 1      FROM SHOW-SW
               GO TO SHOWFORM.

           IF OLD-PWORD = "NORKA0  "
      *    CHANGED FROM "ITOBOR" 10/28/99 PER RIC HARRIS REQUEST
               MOVE CC-NUMBER  TO CLOCK-CARD
               MOVE "Y"        TO PWORD-SWITCH
               GO TO END-OF-JOB.

           IF CC-FOUND         GO TO CONTINUE-PROCESSING.

           MOVE CC-NUMBER      TO PERCCNUM OF PERS-READ.
           READ PERS-READ      INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/089:
      ** INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE 35089      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE CMDSAV     TO CMDMSG
               MOVE TRUE-VAL   TO IND (99) IND (23)
               MOVE 0          TO SHOW-SW
               GO TO SHOWFORM.

           IF PER-CC-NUM NOT = CC-NUMBER
      **********************************************************************
      **    MESSAGE 035/089:
      ** INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE 35089      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE CMDSAV     TO CMDMSG
               MOVE TRUE-VAL   TO IND (99) IND (23)
               MOVE 0          TO SHOW-SW
               GO TO SHOWFORM.

           MOVE 0              TO CC-SW.
           MOVE PER-CC-NUM     TO CLOCK-CARD.
           MOVE PER-EMP-NAME   TO CC-NAME NAME-BUFFER.
           MOVE PER-PWORD      TO PWORD-BUFFER.

           PERFORM UNTIL DATE-BUF < 1000
               COMPUTE DATE-BUF = DATE-BUF - 1000
               IF DATE-BUF = 0 MOVE 1 TO DATE-BUF END-IF
           END-PERFORM.

           MOVE "1"            TO TRAN-CODE.
           MOVE PWORD-BUF      TO TRAN-BUF.
           CALL "CTRANSLATE"   USING TRAN-LEN
                               TRAN-BUF
                               TRAN-CODE.

       CONTINUE-PROCESSING.
           IF OLD-PWORD = TRAN-BUF
               MOVE "Y"        TO PWORD-SWITCH
               MOVE SPACES     TO PW-MESSAGE
               IF NEW-PWORD NOT = SPACES
                   GO TO GETFORM-2
               ELSE
               IF DATE-BUF < CYCLE-DATE AND CURR-DATE > 35
                   MOVE 1      TO EXPIRE-SW
                   GO TO GETFORM-2
               ELSE
      **********************************************************************
      **   ADDED THE FOLLOWING CHANGES TO CIRCUMVENT A PROBLEM REPORTED   **
      **   BY UNION CITY WHEREBY THE USER CHANGED HIS PASSWORD IN LATE    **
      **   NOVEMBER AND WAS NEVER PROMPTED IN THE FIRST PART OF THE NEW   **
      **   YEAR TO CHANGE IT. THE OLD LOGIC WOULD NOT HAVE FORCED THE     **
      **   CHANGE UNLESS THE USER LOGGED ON THE FOLLOWING YEAR 35 DAYS    **
      **   LATER THAN THE PREVIOUS YEAR'S DATE.                           **
      **********************************************************************
               IF CURR-DATE < 36
                   ADD 35 TO DATE-BUF GIVING YREND-WORK
                   IF YREND-WORK > 365
                       SUBTRACT 365 FROM YREND-WORK
                   END-IF
                   MOVE YREND-WORK TO YREND-BUF
                   IF YREND-BUF < CURR-DATE
                       MOVE 1 TO EXPIRE-SW
                       GO TO GETFORM-2
                   ELSE
                   GO TO END-OF-JOB
               ELSE
               GO TO END-OF-JOB.

           IF SHOW-SW = 1
      **********************************************************************
      **    MESSAGE 035/132:
      ** INVALID PASSWORD:  Try Again      << MAXIMUM 30 CHAR.>>
      **********************************************************************
               MOVE 35132      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO PW-MESSAGE
               MOVE SPACES     TO OLD-PWORD
               GO TO SHOWFORM.

           IF SHOW-SW = 2
               MOVE SPACES     TO OLD-PWORD
               GO TO SHOWFORM.

           IF SHOW-SW > 2
               GO TO END-OF-JOB.

       GETFORM-2.
           IF EXPIRED
               MOVE TRUE-VAL   TO S90 IND (22)
               MOVE NEG-VAL    TO S91 S92
           ELSE
               GO TO EDIT-INPUT.

       SHOWFORM-2.
           PERFORM READ-WRITE-SCREEN.
           IF KEY-HIT NOT = 0
               MOVE TRUE-VAL   TO IND (22)
               GO TO SHOWFORM-2.

       EDIT-INPUT.
           IF NEW-PWORD = TRAN-BUF
      **********************************************************************
      **    MESSAGE 042/130:
      ** PASSWORD MUST BE DIFFERENT FROM OLD PASSWORD
      **********************************************************************
               MOVE 42130      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (99) IND (22)
               GO TO SHOWFORM-2.

           IF FIRST-BUF IS NUMERIC
      **********************************************************************
      **    MESSAGE 042/128:
      ** PASSWORD MUST START WITH A LETTER
      **********************************************************************
               MOVE 42128      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (99) IND (22)
               GO TO SHOWFORM-2.

      *-------- CHECK LAST 4 CHARACTERS SINCE PASSWORD EXPANDED TO 8.
      **** IF LAST-TWO = SPACES
           IF LAST-FOUR = SPACES
      **********************************************************************
      **    MESSAGE 042/129:
      ** PASSWORD MUST BE AT LEAST 5 CHARACTERS LONG
      **********************************************************************
               MOVE 42129      TO CATREAD-MSG-NUMBER
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (99) IND (22)
               GO TO SHOWFORM-2.

           MOVE NEW-PWORD      TO VERIFY-PWORD.
           MOVE SPACES         TO NEW-PWORD.

      **********************************************************************
      ** PASSWORD ACCEPTED - ENTER PASSWORD AGAIN TO VERIFY
      **********************************************************************
           MOVE TRUE-VAL       TO S91 IND (22).
           MOVE NEG-VAL        TO S90 S92.

       SHOWFORM-3.
           PERFORM READ-WRITE-SCREEN.
           IF KEY-HIT NOT = 0
               MOVE TRUE-VAL   TO IND (22)
               GO TO SHOWFORM-3.

           IF NEW-PWORD = VERIFY-PWORD
               GO TO UPDATE-PWORD.

      **********************************************************************
      ** PASSWORD NOT VERIFIED - ENTER NEW PASSWORD AGAIN
      **********************************************************************
           MOVE TRUE-VAL       TO S92 IND (22).
           MOVE NEG-VAL        TO S90 S91.
           MOVE SPACES         TO NEW-PWORD VERIFY-PWORD.
           GO TO SHOWFORM-2.

       UPDATE-PWORD.
           MOVE "0"            TO TRAN-CODE.
           MOVE NEW-PWORD      TO TRAN-BUF.
           CALL "CTRANSLATE"   USING TRAN-LEN
                               TRAN-BUF
                               TRAN-CODE.

           MOVE TRAN-BUF       TO PWORD-BUF.
           MOVE CURR-DATE      TO DATE-BUF.

           OPEN I-O            PERS-UPDATE.
           MOVE CC-NUMBER      TO PERCCNUM OF PERS-UPDATE.
           READ PERS-UPDATE    INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               PERFORM ERROR-DISPLAY
               GO TO END-UPDATE.

           MOVE PWORD-BUFFER   TO PER-PWORD.
           REWRITE UPDATE-REC  FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               PERFORM ERROR-DISPLAY
               GO TO END-UPDATE.

       END-UPDATE.
           CLOSE               PERS-UPDATE.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               PERS-READ.
           GOBACK.

       READ-WRITE-SCREEN.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE S90            TO IND (90).
           MOVE S91            TO IND (91).
           MOVE S92            TO IND (92).
           WRITE DISPLAY-REC   FORMAT IS "PERPASS"
                               INDIC ARE SCREEN-INDICATORS.
      *    IF FILE-STAT NOT = "00"
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ/WRITE FAILURE: TPWORD,"
                               " ERROR:  " FILE-STAT
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS "PERPASS"
                               INDIC ARE SCREEN-INDICATORS.
      *    IF FILE-STAT NOT = "00"
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ/WRITE FAILURE: TPWORD,"
                               " ERROR:  " FILE-STAT
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

       ERROR-DISPLAY.
           DISPLAY "*******************************************"
                   "  UPDATE ERROR - PERSONAL PASSWORD SYSTEM  "
                   "  ATTEMPTED PASSWORD UPDATE BY:"
                   "    CRAFTSMAN - " CLOCK-CARD " - " NAME-BUFFER
                   "  HAS FAILED.  OLD PASSWORD STILL IN EFFECT"
                   " PLEASE NOTIFY PASSWORD MANAGER IMMEDIATELY."
                   "*******************************************".

