000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPERSON.
000300 INSTALLATION.  GOODYEAR.
000400*REMARKS.
000500*         #######################################################
000600*         #  This is the main program of the personnel system.  #
000700*         #  -------------------------------------------------  #
000800*         #######################################################.
      *C
      *C 09/09/96  JEFF BUNGO
      *C  EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C  RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C 09/10/96  JEFF BUNGO
      *C  INCREASE SIZE OF TEMPORARY FILE TEMPPERS FOR
      *C  DATE FIELD INCREASE IN TPLIST PROGRAM.
      *C
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
001800 DATA DIVISION.
001900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
002100 WORKING-STORAGE SECTION.
003800 01  ARG-NO                      PIC 9(9).
       01  BLOWUP-BASE                 PIC X(16).
002200
       COPY CATREAD  OF COPYLIB.
       COPY CPYIND   OF COPYLIB.
       COPY CCRTFILE OF COPYLIB.

008300 01  DBPARAMETERS.               COPY DBPARMS OF COPYLIB.

       01  DELETE-FILE                 PIC X(10) VALUE "TEMPPERS".

004000 01  ERROR-BUFFER                PIC X(80) VALUE SPACES.

       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  WLNU-STATUS             PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

005500 01  LAST-WO-BUFF.               COPY MLASTWO OF COPYLIB.
005600
006000 01  MASS-CHANGE-MENU-SW         PIC X VALUE "N".
006100     88  MASS-CHANGE-MENU-COMPLETED        VALUE "Y".
006200
002300 01  PASSWORD-INFORMATION.
002400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPERSON ".
002500     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002700     05  PROGRAM-DESCRIPTION.
002800         10  PROG-DESC-A     PIC X(60) VALUE
002900             "MAIN PROGRAM CONTROLLING THE PERSONNEL SYSTEM "    .
003000         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003400     05  PASSWORD-FLAG       PIC X.
003700
008700 01  PLT-IDT                     PIC X(4).

005400 COPY DBSTAT IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

008400 COPY VCOMLINK IN COPYLIB.

       COPY WSCONTROL OF COPYLIB.
009000 PROCEDURE DIVISION.
009200 BEGIN-PROC.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
016400 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-LAST-NUM-USED.
017700     GOBACK.
       1-HSK.
009300     MOVE LOW-VALUES TO STATUS-AREA VIEW-COMAREA.
           MOVE 0 TO VIEW-LASTKEY.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
015300     CALL "TPWORD" USING PASSWORD-INFORMATION.
015700     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
016000     MOVE PLANT-IDENT TO PLT-IDT.
016100     MOVE DATE-FLAG-SW TO DATE-FLAG.
       6-MAIN.
016200     PERFORM 60-WRITE-MENU THRU 60-WM-EXIT
016300             UNTIL VIEW-LASTKEY = 3.
017800 60-WRITE-MENU.
018000     MOVE "FPERSON" TO VIEW-CFNAME.
           MOVE SPACES TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
020000     IF VIEW-LASTKEY = 3
               GO TO 2-EOJ
           ELSE
020500     IF VIEW-LASTKEY = 1
020600         CALL "TPDISP"   USING DBPARAMETERS VIEW-COMAREA
020700                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
020800     ELSE
020900     IF VIEW-LASTKEY = 2
021000         CALL "TPADD"    USING DBPARAMETERS VIEW-COMAREA
021100                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
021200     ELSE
021300     IF VIEW-LASTKEY = 4
021400         CALL "TPDEL"    USING DBPARAMETERS VIEW-COMAREA
021500                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
021600     ELSE
021700     IF VIEW-LASTKEY = 5
021800         CALL "TPCHG"    USING DBPARAMETERS VIEW-COMAREA
021900                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
022000     ELSE
022100     IF VIEW-LASTKEY = 6
               MOVE "*CURLIB"     TO CCRTFILE-LIBRARY
               MOVE "TEMPPERS"    TO CCRTFILE-FILE
               MOVE "0052"        TO CCRTFILE-RECORD-LENGTH
               MOVE "02000"       TO CCRTFILE-NO-RECORDS
               MOVE "02000"       TO CCRTFILE-INCREMENT-AMT
               MOVE "03"          TO CCRTFILE-NO-INCREMENTS
               CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                     CCRTFILE-FILE
                                     CCRTFILE-RECORD-LENGTH
                                     CCRTFILE-NO-RECORDS
                                     CCRTFILE-INCREMENT-AMT
                                     CCRTFILE-NO-INCREMENTS
                                     CCRTFILE-STATUS
               IF CCRTFILE-STATUS NOT = "00"
                   MOVE "CCRTFILE CREATE OF 'TEMPPERS' FAILED"
                      TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               CALL "TPLIST" USING DBPARAMETERS VIEW-COMAREA
                               PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
               CALL "MCDLT" USING DELETE-FILE
022400     ELSE
022500     IF VIEW-LASTKEY = 7
022600         CALL "TPERSON6" USING DBPARAMETERS VIEW-COMAREA
022700                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY
022800     ELSE
022900     IF VIEW-LASTKEY = 8
023000         CALL "TPERSON7" USING DBPARAMETERS VIEW-COMAREA
023100                           PLT-IDT
               MOVE 0 TO VIEW-LASTKEY.
023400 60-WM-EXIT.    EXIT.
023600
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

045400 998-BLOWUP.
045500     MOVE "TPERSON" TO BU-PGM-NAME.
045600     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
045700                      VIEW-COMAREA DUMMY-KSAM-STAT
045800                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

025900 999-CATREAD.
026000     MOVE SPACES TO ERROR-BUFFER.
026100     CALL "CCATREAD" USING CATREAD-PARMS.
026200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
027000 999-CATREAD-EXIT.
027100     EXIT.
