000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPERSON6.
000500*REMARKS.
000600*         #######################################################
000700*         #  This is the controlling program for personnel mass #
000800*         #  change  functions ...............................  #
000900*         #######################################################.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.    AS400.
001600 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001900 DATA DIVISION.
002000 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
002200 WORKING-STORAGE SECTION.
004300 01  ARE-ALL-MENUS-COMPLETED     PIC X VALUE "N".
004400     88  ALL-MENUS-ARE-COMPLETED       VALUE "Y".
004500
003700 01  ARG-NO                      PIC 9(9).
003800
       01  DSPLY-STATUS                PIC XX.

       COPY CATREAD OF COPYLIB.

       COPY CPYIND  OF COPYLIB.

003900 01  ERROR-BUFFER                PIC X(80) VALUE SPACES.
004000
       COPY IOFEEDBACK OF COPYLIB.

004800 01  LM                          PIC 9999.
004900
004600 01  LS                          PIC 9999.
004700
002300 01  PASSWORD-INFORMATION.
002400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPERSON6".
002500     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002700     05  PROGRAM-DESCRIPTION.
002800         10  PROG-DESC-A     PIC X(60) VALUE
002900             "PERSONNEL PROGRAM THAT CONTROLS MASS CHANGES "     .
003000         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003400     05  PASSWORD-FLAG       PIC X.
005000 COPY DBSTAT    OF COPYLIB.
005100 COPY WSCONTROL OF COPYLIB.
005200 LINKAGE SECTION.
005300 01  DBPARAMETERS.               COPY DBPARMS  OF COPYLIB.
005400 COPY VCOMLINK  OF COPYLIB.
005500 01  PLT-IDT                     PIC X(4).
006000 PROCEDURE DIVISION USING DBPARAMETERS
006100                          VIEW-COMAREA
006200                          PLT-IDT.
006400 BEGIN-PGM.
006500     PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
006600     CALL "TPWORD" USING PASSWORD-INFORMATION.
007000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
       6-MAIN.
007400     PERFORM 6-WRITE-MENU THRU 6-WM-EXIT UNTIL
007500             ALL-MENUS-ARE-COMPLETED.
007800 6-WRITE-MENU.
008000     MOVE "FPERSON6" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
010000     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
010700     IF VIEW-LASTKEY = 1
010800         CALL "TPRATE"   USING DBPARAMETERS VIEW-COMAREA
010900                           PLT-IDT
011000     ELSE
011100     IF VIEW-LASTKEY = 2
011200         CALL "TPZONE"   USING DBPARAMETERS VIEW-COMAREA
011300                           PLT-IDT
011400     ELSE
011500     IF VIEW-LASTKEY = 4
011600         CALL "TPSHIFT"  USING DBPARAMETERS VIEW-COMAREA
011700                           PLT-IDT
011800     ELSE
011900     IF VIEW-LASTKEY = 5
012000         CALL "TPCREW"   USING DBPARAMETERS VIEW-COMAREA
012100                           PLT-IDT
012200     ELSE
           IF VIEW-LASTKEY = 6
               CALL "TPDELABS" USING DBPARAMETERS VIEW-COMAREA
                                 PLT-IDT.
012400
012500 6-WM-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

013500 999-CATREAD.
013600     MOVE SPACES TO ERROR-BUFFER.
013700     CALL "CCATREAD" USING CATREAD-PARMS.
013800     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
014600 999-CATREAD-EXIT.
014700     EXIT.
