000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPERSON7.
000500*REMARKS.
000600*         #######################################################
000700*         #  This is the controlling program for maintenance on #
000800*         #  absence codes and item definitions ............... #
000900*         #######################################################.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.    AS400.
001600 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001900 DATA DIVISION.
002000 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
002200 WORKING-STORAGE SECTION.
       COPY CPYIND OF COPYLIB.

       01  DSPLY-STATUS                PIC XX.
004000
       COPY IOFEEDBACK OF COPYLIB.
004700
002300 01  PASSWORD-INFORMATION.
002400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPERSON7".
002500     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002700     05  PROGRAM-DESCRIPTION.
002800         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE "PERSONNEL SYSTEM ".
                   15  FILLER      PIC X(13) VALUE "PROGRAM THAT ".
                   15  FILLER      PIC X(09) VALUE "CONTROLS ".
                   15  FILLER      PIC X(15) VALUE "MAINTENANCE ON ".
                   15  FILLER      PIC X(06) VALUE "ABSENC".
003000         10  PROG-DESC-B     PIC X(60) VALUE
003100              "E CODES AND ITEM DEFINITIONS "                    .
003200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003400     05  PASSWORD-FLAG       PIC X.
003600
005000 COPY DBSTAT    OF COPYLIB.
005100 COPY WSCONTROL OF COPYLIB.
005200 LINKAGE SECTION.
005300 01  DBPARAMETERS.               COPY DBPARMS  OF COPYLIB.
005400 COPY VCOMLINK  OF COPYLIB.
005500 01  PLT-IDT                     PIC X(4).
006000 PROCEDURE DIVISION USING DBPARAMETERS
006100                          VIEW-COMAREA
006200                          PLT-IDT.
006400 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT
               UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           GOBACK.
006500 1-HSK.
           OPEN I-O   DISPLAY-FILE.
006600     CALL "TPWORD" USING PASSWORD-INFORMATION.
007000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
007300 6-MAIN.
008000     MOVE "FPERSON7" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
010000     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
010500     IF VIEW-LASTKEY = 1
010600         CALL "TCODE" USING DBPARAMETERS VIEW-COMAREA
010700                        PLT-IDT
010800     ELSE
010900     IF VIEW-LASTKEY = 2
011000         CALL "TITEM" USING DBPARAMETERS VIEW-COMAREA
011100                        PLT-IDT.
       6-MAIN-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

