000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPINQ.
000400 INSTALLATION.  GOODYEAR.
000500*REMARKS.
000600*        #######################################################
000700*        # This is the personnel inquiry subprogram for the    #
000800*        # planner/engineer/manager and supervisor signons     #
000900*        #######################################################.
      *C
      *C 09/10/96 JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
001100 ENVIRONMENT DIVISION.
001200 CONFIGURATION SECTION.
001300 SOURCE-COMPUTER.    AS400.
001400 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001500 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
001600 WORKING-STORAGE SECTION.
005500 01  ARG-VALUE                    PIC XX.
005600 01  ARG-VALUE1.
           05  ARG-ZONE                 PIC X(4).
           05  ARG-PRTY                 PIC XX.
       01  BLOWUP-BASE                  PIC X(16).
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
006300 01  CREW-BUF                     PIC X(2).
006200 01  ERROR-BUFFER.
           05  FILLER                   PIC X(12).
           05  ERR-CC                   PIC XXXX.
           05  FILLER                   PIC X(64).
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  PF-STATUS                PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
001700 01  PASSWORD-INFORMATION.
001800     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPINQ   ".
001900     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
002000     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002100     05  PROGRAM-DESCRIPTION.
002200         10  PROG-DESC-A     PIC X(60) VALUE
002300            "PERSONNEL BASIC INFORMATION INQUIRY PROGRAM "       .
002400         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002600         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
002800     05  PASSWORD-FLAG       PIC X.
       01  PERSONNEL-DATA.              COPY MPERSONL OF COPYLIB.
       COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP OF COPYLIB.
006900 01  TERM-BUFFER.
007100     05  TERM-BUF-AREA.
007200         10  TBUF-CC-NO.
007300             15  TBUF-CC-NO-1     PIC X.
007400             15  FILLER           PIC XXX.
           05  TERM-CMD-LINE            PIC X(79).
           05  TERM-ERR-LINE            PIC X(79).
006900 01  TERM-BUFFER-2.
007100     05  TERM-BUF-AREA-2.
007200         10  TBUF-CC-NO-2.
007300             15  TBUF-CC-NO-1-2   PIC X.
007400             15  FILLER           PIC XXX.
007500         10  TBUF-EMPL-NAME-2     PIC X(16).
007600         10  TBUF-CSD-2.
007700             15  TBUF-CSD-MM-2    PIC 99.
007800             15  TBUF-CSD-DD-2    PIC 99.
007900             15  TBUF-CSD-YY-2    PIC 99.
008000         10  TBUF-CRAFT-2         PIC XX.
008100         10  TBUF-MAINT-ZONE-2    PIC X(4).
008200         10  TBUF-DEPT-2          PIC X(4).
008300         10  TBUF-LABOR-RATE-2    PIC 9(6)V9(4).
008600         10  TBUF-EMPL-RATE-2     PIC XX.
008700         10  TBUF-SHIFT-CREW-2.
008800             15  TBUF-SHIFT-2     PIC X.
008900             15  TBUF-CREW-2      PIC X.
           05  TERM-CMD-LINE-2          PIC X(79).
           05  TERM-ERR-LINE-2          PIC X(79).
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
006000 01  ZONE-SW                      PIC X.
006400 01  ZONE-PRTY.                   COPY MZONPRTY OF COPYLIB.
009100 LINKAGE SECTION.
009200 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
009800 PROCEDURE DIVISION USING DBPARAMETERS
009900                          VIEW-COMAREA.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PERSONNEL-FILE.
           GOBACK.
011100 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT PERSONNEL-FILE.
010400     CALL "TPWORD" USING PASSWORD-INFORMATION.
010800     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
011200     MOVE SPACES TO ERROR-BUFFER BLOWUP-BASE.
011800     MOVE SPACES TO TERM-BUFFER.
       6-MAIN.
           MOVE "FPINQ" TO VIEW-CFNAME.
           MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
015600     PERFORM 98-SCREEN-READ.
016600     IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
           MOVE DSPLY-REC TO TERM-BUFFER.
           MOVE SPACES TO TERM-CMD-LINE.
038000     MOVE 0 TO COND-WORD.
           MOVE TBUF-CC-NO TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
038300     IF COND-WORD = 17
               MOVE 35047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO TERM-ERR-LINE
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN.
           READ PERSONNEL-FILE NEXT INTO PERSONNEL-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 35047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO TERM-ERR-LINE
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 6-MAIN.
           MOVE "FPINQ2" TO VIEW-CFNAME.
           MOVE PER-CSD TO TBUF-CSD-2.
           MOVE PER-CC-NUM TO TBUF-CC-NO-2.
           MOVE PER-EMP-NAME TO TBUF-EMPL-NAME-2.
           MOVE PER-CRAFT TO TBUF-CRAFT-2.
           MOVE PER-MAINT-ZONE TO TBUF-MAINT-ZONE-2.
           MOVE PER-DEPT TO TBUF-DEPT-2.
           MOVE PER-LABOR-RATE TO TBUF-LABOR-RATE-2.
           MOVE PER-RATING TO TBUF-EMPL-RATE-2.
           MOVE PER-SHIFT-CREW TO TBUF-SHIFT-CREW-2.
           MOVE 66352 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO TERM-CMD-LINE-2.
           MOVE TERM-BUFFER-2 TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
           MOVE SPACES TO TERM-BUFFER.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076200 998-BLOWUP.
076300     MOVE "TPINQ" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

040500 999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
041500 999-CATREAD-EXIT.    EXIT.
