000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TPLIST.
      *C
      *C 09/10/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON SORT BY CSD DATE.
      *C
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SOURCE-COMPUTER.    AS400.
001200 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001300 INPUT-OUTPUT SECTION.
001400 FILE-CONTROL.
001500     SELECT DISK-TEMP
               ASSIGN TO DATABASE-TEMPPERS
               ORGANIZATION IS RELATIVE
001600         ACCESS MODE IS RANDOM
001700         RELATIVE KEY IS AKEY
               FILE STATUS IS DT-STATUS.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS SEQUENTIAL
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001800     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
002100 DATA DIVISION.
002200 FILE SECTION.
002300 FD  DISK-TEMP RECORD CONTAINS 52 CHARACTERS
002400     LABEL RECORD IS OMITTED
002500     DATA RECORD IS DISK-REC.
002600 01  DISK-REC                PIC X(52).
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
002800 SD  SORT-FILE RECORD CONTAINS 52 CHARACTERS
002900     DATA RECORD IS SORT-REC.
003000 01  SORT-REC.
003100     05  PER-CC-NUM          PIC X(4).
003200     05  PER-EMP-NAME        PIC X(16).
003300     05  PER-CRAFT           PIC X(2).
003400     05  PER-MAINT-ZONE      PIC X(4).
003500     05  PER-DEPT            PIC X(4).
003600     05  PER-LABOR-RATE.
003700         10 LAB-DOL          PIC X(6).
003800         10 LAB-PEN          PIC X(4).
003900     05  PER-RATING          PIC X(2).
004000     05  PER-SHIFT-CREW      PIC X(2).
004100     05  PER-CSD-CN.
               10 PER-CSD-CC       PIC X(2).
               10 PER-CSD.
004200             15 PER-CSD-YY   PIC X(2).
004300             15 PER-CSD-MM   PIC X(2).
004400             15 PER-CSD-DD   PIC X(2).
004600 WORKING-STORAGE SECTION.
004800 77  NO-ARG                  PIC X     VALUE SPACE.
005200 77  SAVE-INDEX              PIC 99 COMP-4.
005300 77  AKEY                    PIC 9(9).

       COPY CATREAD OF COPYLIB.

       01  COMP-DATE1-CN.
           05  CC-COMP1            PIC XX.
007100     05  COMP-DATE1.
007200         10 YY-COMP1         PIC XX.
007300         10 MM-COMP1         PIC XX.
007400         10 DD-COMP1         PIC XX.
007500
       01  COMP-DATE2-CN.
           05  CC-COMP2            PIC XX.
007600     05  COMP-DATE2.
007700         10 YY-COMP2         PIC XX.
007800         10 MM-COMP2         PIC XX.
007900         10 DD-COMP2         PIC XX.
005400
012800 01  COMPARE-SORT.
012900     05 C-ZONE               PIC X.
013000     05 C-CRAFT              PIC X.
013100     05 C-CSD                PIC X.
013200     05 C-NAME               PIC X.
013300     05 C-CC-NUM             PIC X.
013400
       COPY CPYIND OF COPYLIB.

018700 COPY TDATESUB OF COPYLIB.
018800
008100 01  ERROR-BUFFER            PIC X(80) VALUE SPACES.
008200
       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  DT-STATUS           PIC XX.
           05  PF-STATUS           PIC XX.

018900 01  FNAMEP                PIC X(8) VALUE "PRNT1".
019000
       COPY IOFEEDBACK OF COPYLIB.

005500 01  PASSWORD-INFORMATION.
005600     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPLIST  ".
005700     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
005800     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
005900     05  PROGRAM-DESCRIPTION.
006000         10  PROG-DESC-A     PIC X(60) VALUE
006100             "PERSONNEL INQUIRIES AND REPORTS "                  .
006200         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
006400         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
006600     05  PASSWORD-FLAG       PIC X.

008500 01  PER-PERSONNEL.        COPY MPERSONL OF COPYLIB.
008600
012600 01  PV                      PIC X.
012700
013500 01  SORT-TABLE1.
013600        10 FILLER            PIC X(5) VALUE "1    ".
013700        10 FILLER            PIC X(5) VALUE "12   ".
013800        10 FILLER            PIC X(5) VALUE "1 2  ".
013900        10 FILLER            PIC X(5) VALUE "1  2 ".
014000        10 FILLER            PIC X(5) VALUE "1   2".
014100        10 FILLER            PIC X(5) VALUE " 1   ".
014200        10 FILLER            PIC X(5) VALUE "21   ".
014300        10 FILLER            PIC X(5) VALUE " 12  ".
014400        10 FILLER            PIC X(5) VALUE " 1 2 ".
014500        10 FILLER            PIC X(5) VALUE " 1  2".
014600        10 FILLER            PIC X(5) VALUE "  1  ".
014700        10 FILLER            PIC X(5) VALUE "2 1  ".
014800        10 FILLER            PIC X(5) VALUE " 21  ".
014900        10 FILLER            PIC X(5) VALUE "  12 ".
015000        10 FILLER            PIC X(5) VALUE "  1 2".
015100        10 FILLER            PIC X(5) VALUE "   1 ".
015200        10 FILLER            PIC X(5) VALUE "    1".
015300        10 FILLER            PIC X(5) VALUE "123  ".
015400        10 FILLER            PIC X(5) VALUE "12 3 ".
015500        10 FILLER            PIC X(5) VALUE "12  3".
015600        10 FILLER            PIC X(5) VALUE "132  ".
015700        10 FILLER            PIC X(5) VALUE "1 23 ".
015800        10 FILLER            PIC X(5) VALUE "1 2 3".
015900        10 FILLER            PIC X(5) VALUE "213  ".
016000        10 FILLER            PIC X(5) VALUE "21 3 ".
016100        10 FILLER            PIC X(5) VALUE "21  3".
016200        10 FILLER            PIC X(5) VALUE "312  ".
016300        10 FILLER            PIC X(5) VALUE " 123 ".
016400        10 FILLER            PIC X(5) VALUE " 12 3".
016500        10 FILLER            PIC X(5) VALUE "231  ".
016600        10 FILLER            PIC X(5) VALUE "2 13 ".
016700        10 FILLER            PIC X(5) VALUE "2 1 3".
016800        10 FILLER            PIC X(5) VALUE "321  ".
016900        10 FILLER            PIC X(5) VALUE " 213 ".
017000        10 FILLER            PIC X(5) VALUE " 21 3".
017100        10 FILLER            PIC X(5) VALUE "1234 ".
017200        10 FILLER            PIC X(5) VALUE "123 4".
017300        10 FILLER            PIC X(5) VALUE "1324 ".
017400        10 FILLER            PIC X(5) VALUE "132 4".
017500        10 FILLER            PIC X(5) VALUE "2134 ".
017600        10 FILLER            PIC X(5) VALUE "213 4".
017700        10 FILLER            PIC X(5) VALUE "3124 ".
017800        10 FILLER            PIC X(5) VALUE "312 4".
017900        10 FILLER            PIC X(5) VALUE "2314 ".
018000        10 FILLER            PIC X(5) VALUE "231 4".
018100        10 FILLER            PIC X(5) VALUE "3214 ".
018200        10 FILLER            PIC X(5) VALUE "321 4".
018300
018400 01  SORT-TABLE2 REDEFINES SORT-TABLE1.
018500     05 SORT-ORDER OCCURS 47 TIMES INDEXED BY SORT-INDEX PIC X(5).
018600
008700 COPY DBSTAT  OF COPYLIB.
009500
009600 01  TERM-BUFFER.
           05  TERM-BUF.
009700         10  TERM-CC-NUM     PIC X.
009800         10  TERM-NAME       PIC X.
009900         10  TERM-CSD        PIC X.
010000         10  TERM-DATE1.
010100             15 MM-BUF1      PIC XX.
010200             15 DD-BUF1      PIC XX.
010300             15 YY-BUF1      PIC XX.
010400         10  TERM-DATE2.
010500             15 MM-BUF2      PIC XX.
010600             15 DD-BUF2      PIC XX.
010700             15 YY-BUF2      PIC XX.
010800         10  TERM-CRAFT      PIC X.
010900         10  TERM-C1         PIC XX.
011000         10  TERM-C2         PIC XX.
011100         10  TERM-C3         PIC XX.
011200         10  TERM-C4         PIC XX.
011300         10  TERM-C5         PIC XX.
011400         10  TERM-ZONE       PIC X.
011500         10  TERM-Z1         PIC X(4).
011600         10  TERM-Z2         PIC X(4).
011700         10  TERM-Z3         PIC X(4).
011800         10  TERM-Z4         PIC X(4).
011900         10  TERM-Z5         PIC X(4).
012000         10  TERM-S1         PIC X(2).
012100         10  TERM-S2         PIC X(2).
012200         10  TERM-S3         PIC X(2).
012300         10  TERM-S4         PIC X(2).
012400         10  TERM-PV         PIC X.
           05  TERM-CMD-LINE       PIC X(79).
           05  TERM-ERR-LINE       PIC X(79).
012500 01  TRUE-VAL                PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
019100 LINKAGE SECTION.
019200 01  DBPARAMETERS.         COPY DBPARMS  OF COPYLIB.
019300 COPY VCOMLINK OF COPYLIB.
019400 01  PLT-IDT               PIC X(4).
019900 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
020000                      PLT-IDT.
020100 BEGIN-PROG.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-CONT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PERSONNEL-FILE.
086800     CLOSE DISK-TEMP.
           GOBACK.
020200 1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN I-O    PERSONNEL-FILE.
           MOVE SPACES TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY >= PERCCNUM OF PFREC
               INVALID KEY MOVE PF-STATUS TO PF-STATUS.
           IF PF-STATUS NOT = "00" GO TO 2-EOJ.
021600     OPEN OUTPUT DISK-TEMP.
020300     CALL "TPWORD" USING PASSWORD-INFORMATION.
020700     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
021500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE 0 TO AKEY.
           MOVE SPACES TO TERM-BUFFER.
       6-MAIN.
021900     MOVE "FPLIST" TO VIEW-CFNAME.
023300     MOVE TERM-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO TERM-BUFFER.
           MOVE SPACES    TO TERM-ERR-LINE.
024300     IF VIEW-LASTKEY = 3 PERFORM 2-EOJ.
025900     MOVE TERM-CC-NUM TO C-CC-NUM.
026000     MOVE TERM-NAME TO C-NAME.
026100     MOVE TERM-CSD TO C-CSD.
026200     MOVE TERM-CRAFT TO C-CRAFT.
026300     MOVE TERM-ZONE TO C-ZONE.
026700     SET SORT-INDEX TO 1.
026800     SEARCH SORT-ORDER
026900           AT END
027000             PERFORM PRE-MESSAGE-DISPLAY
027100           WHEN COMPARE-SORT = SORT-ORDER (SORT-INDEX)
027200             SET SAVE-INDEX TO SORT-INDEX.
027600     IF TERM-PV = SPACE
027700       MOVE "V" TO PV
027800     ELSE
027900     MOVE "P" TO PV.
028300     IF TERM-DATE1 NOT = SPACES
028400         IF TERM-DATE2   = SPACES
028500             MOVE 30020 TO CATREAD-MSG-NUMBER
028700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
028800             MOVE TRUE-VAL TO INDS (7) INDS (99)
029500             GO TO 6-MAIN
029600         ELSE
029700         NEXT SENTENCE
029800     ELSE
029900     IF TERM-DATE2 = SPACES
030000         MOVE SPACES TO COMP-DATE1-CN COMP-DATE2-CN
030100         GO TO 6-MAIN-CONT
030200     ELSE
030300     MOVE 30020 TO CATREAD-MSG-NUMBER
030500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030600     MOVE TRUE-VAL TO INDS (6) INDS (99)
031300     GO TO 6-MAIN.
031500     MOVE DATE-FLAG TO DATE-CODE.
031600     MOVE 3 TO DATE-MODE.
031700     MOVE TERM-DATE1 TO DATE-VALIDATE-IN.
031800     CALL "TDATECHK" USING DATE-CHECK-AREA.
031900     IF DATE-RET-CODE = 1
032000         MOVE DATE-MSG TO ERROR-BUFFER
032100         MOVE TRUE-VAL TO INDS (6) INDS (99)
032500         GO TO 6-MAIN.
032600     MOVE DATE-DB TO COMP-DATE1.
      *------USE A COMPARE YEAR OF LESS THAN 70
      *------SINCE WE ARE DEALING WITH CSD DATES
           IF YY-COMP1 > "40"
               MOVE "19" TO CC-COMP1
           ELSE
               MOVE "20" TO CC-COMP1.
032800     MOVE DATE-FLAG TO DATE-CODE.
032900     MOVE 3 TO DATE-MODE.
033000     MOVE TERM-DATE2 TO DATE-VALIDATE-IN.
033100     CALL "TDATECHK" USING DATE-CHECK-AREA.
033200     IF DATE-RET-CODE = 1
033300         MOVE DATE-MSG TO ERROR-BUFFER
033400         MOVE TRUE-VAL TO INDS (7) INDS (99)
033800         GO TO 6-MAIN.
033900     MOVE DATE-DB TO COMP-DATE2.
      *------USE A COMPARE YEAR OF LESS THAN 70
      *------SINCE WE ARE DEALING WITH CSD DATES
           IF YY-COMP2 > "40"
               MOVE "19" TO CC-COMP2
           ELSE
               MOVE "20" TO CC-COMP2.
034200 6-MAIN-CONT.
034900     GO TO SORT01 SORT02 SORT03 SORT04 SORT05 SORT06 SORT07
035000           SORT08 SORT09 SORT10 SORT11 SORT12 SORT13 SORT14
035100           SORT15 SORT16 SORT17 SORT18 SORT19 SORT20 SORT21
035200           SORT22 SORT23 SORT24 SORT25 SORT26 SORT27 SORT28
035300           SORT29 SORT30 SORT31 SORT32 SORT33 SORT34 SORT35
035400           SORT36 SORT37 SORT38 SORT39 SORT40 SORT41 SORT42
035500           SORT43 SORT44 SORT45 SORT46 SORT47
035600           DEPENDING ON SAVE-INDEX.
035700 SORT01.
035800     SORT SORT-FILE
035900          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
036000          INPUT PROCEDURE 8-INPUT-RECORDS
036100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
036200     PERFORM 60-CALL-TPPRNT.
036500     GO TO 2-EOJ.
036600 SORT02.
036700     SORT SORT-FILE
036800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
036900                        PER-CRAFT OF SORT-REC
037000          INPUT PROCEDURE 8-INPUT-RECORDS
037100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
037200     PERFORM 60-CALL-TPPRNT.
037500     GO TO 2-EOJ.
037600 SORT03.
037700     SORT SORT-FILE
037800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
037900                        PER-CSD-CN OF SORT-REC
038000          INPUT PROCEDURE 8-INPUT-RECORDS
038100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
038200     PERFORM 60-CALL-TPPRNT.
038500     GO TO 2-EOJ.
038600 SORT04.
038700     SORT SORT-FILE
038800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
038900                        PER-EMP-NAME OF SORT-REC
039000          INPUT PROCEDURE 8-INPUT-RECORDS
039100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
039200     PERFORM 60-CALL-TPPRNT.
039500     GO TO 2-EOJ.
039600 SORT05.
039700     SORT SORT-FILE
039800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
039900                        PER-CC-NUM OF SORT-REC
040000          INPUT PROCEDURE 8-INPUT-RECORDS
040100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
040200     PERFORM 60-CALL-TPPRNT.
040500     GO TO 2-EOJ.
040600 SORT06.
040700     SORT SORT-FILE
040800          ASCENDING KEY PER-CRAFT OF SORT-REC
040900          INPUT PROCEDURE 8-INPUT-RECORDS
041000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
041100     PERFORM 60-CALL-TPPRNT.
041400     GO TO 2-EOJ.
041500 SORT07.
041600     SORT SORT-FILE
041700          ASCENDING KEY PER-CRAFT OF SORT-REC
041800                        PER-MAINT-ZONE OF SORT-REC
041900          INPUT PROCEDURE 8-INPUT-RECORDS
042000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
042100     PERFORM 60-CALL-TPPRNT.
042400     GO TO 2-EOJ.
042500 SORT08.
042600     SORT SORT-FILE
042700          ASCENDING KEY PER-CRAFT OF SORT-REC
042800                        PER-CSD-CN OF SORT-REC
042900          INPUT PROCEDURE 8-INPUT-RECORDS
043000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
043100     PERFORM 60-CALL-TPPRNT.
043400     GO TO 2-EOJ.
043500 SORT09.
043600     SORT SORT-FILE
043700          ASCENDING KEY PER-CRAFT OF SORT-REC
043800                        PER-EMP-NAME OF SORT-REC
043900          INPUT PROCEDURE 8-INPUT-RECORDS
044000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
044100     PERFORM 60-CALL-TPPRNT.
044400     GO TO 2-EOJ.
044500 SORT10.
044600     SORT SORT-FILE
044700          ASCENDING KEY PER-CRAFT OF SORT-REC
044800                        PER-CC-NUM OF SORT-REC
044900          INPUT PROCEDURE 8-INPUT-RECORDS
045000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
045100     PERFORM 60-CALL-TPPRNT.
045400     GO TO 2-EOJ.
045500 SORT11.
045600     SORT SORT-FILE
045700          ASCENDING KEY PER-CSD-CN OF SORT-REC
045800          INPUT PROCEDURE 8-INPUT-RECORDS
045900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
046000     PERFORM 60-CALL-TPPRNT.
046300     GO TO 2-EOJ.
046400 SORT12.
046500     SORT SORT-FILE
046600          ASCENDING KEY PER-CSD-CN OF SORT-REC
046700                        PER-MAINT-ZONE OF SORT-REC
046800          INPUT PROCEDURE 8-INPUT-RECORDS
046900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
047000     PERFORM 60-CALL-TPPRNT.
047300     GO TO 2-EOJ.
047400 SORT13.
047500     SORT SORT-FILE
047600          ASCENDING KEY PER-CSD-CN OF SORT-REC
047700                        PER-CRAFT OF SORT-REC
047800          INPUT PROCEDURE 8-INPUT-RECORDS
047900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
048000     PERFORM 60-CALL-TPPRNT.
048300     GO TO 2-EOJ.
048400 SORT14.
048500     SORT SORT-FILE
048600          ASCENDING KEY PER-CSD-CN OF SORT-REC
048700                        PER-EMP-NAME OF SORT-REC
048800          INPUT PROCEDURE 8-INPUT-RECORDS
048900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
049000     PERFORM 60-CALL-TPPRNT.
049300     GO TO 2-EOJ.
049400 SORT15.
049500     SORT SORT-FILE
049600          ASCENDING KEY PER-CSD-CN OF SORT-REC
049700                        PER-CC-NUM OF SORT-REC
049800          INPUT PROCEDURE 8-INPUT-RECORDS
049900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
050000     PERFORM 60-CALL-TPPRNT.
050300     GO TO 2-EOJ.
050400 SORT16.
050500     SORT SORT-FILE
050600          ASCENDING KEY PER-EMP-NAME OF SORT-REC
050700          INPUT PROCEDURE 8-INPUT-RECORDS
050800          OUTPUT PROCEDURE 9-WRITE-RECORDS.
050900     PERFORM 60-CALL-TPPRNT.
051200     GO TO 2-EOJ.
051300 SORT17.
051400     SORT SORT-FILE
051500          ASCENDING KEY PER-CC-NUM OF SORT-REC
051600          INPUT PROCEDURE 8-INPUT-RECORDS
051700          OUTPUT PROCEDURE 9-WRITE-RECORDS.
051800     PERFORM 60-CALL-TPPRNT.
052100     GO TO 2-EOJ.
052200 SORT18.
052300     SORT SORT-FILE
052400          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
052500                        PER-CRAFT OF SORT-REC
052600                        PER-CSD-CN OF SORT-REC
052700          INPUT PROCEDURE 8-INPUT-RECORDS
052800          OUTPUT PROCEDURE 9-WRITE-RECORDS.
052900     PERFORM 60-CALL-TPPRNT.
053200     GO TO 2-EOJ.
053300 SORT19.
053400     SORT SORT-FILE
053500          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
053600                        PER-CRAFT OF SORT-REC
053700                        PER-EMP-NAME OF SORT-REC
053800          INPUT PROCEDURE 8-INPUT-RECORDS
053900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
054000     PERFORM 60-CALL-TPPRNT.
054300     GO TO 2-EOJ.
054400 SORT20.
054500     SORT SORT-FILE
054600          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
054700                        PER-CRAFT OF SORT-REC
054800                        PER-CC-NUM OF SORT-REC
054900          INPUT PROCEDURE 8-INPUT-RECORDS
055000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
055100     PERFORM 60-CALL-TPPRNT.
055400     GO TO 2-EOJ.
055500 SORT21.
055600     SORT SORT-FILE
055700          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
055800                        PER-CSD-CN OF SORT-REC
055900                        PER-CRAFT OF SORT-REC
056000          INPUT PROCEDURE 8-INPUT-RECORDS
056100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
056200     PERFORM 60-CALL-TPPRNT.
056500     GO TO 2-EOJ.
056600 SORT22.
056700     SORT SORT-FILE
056800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
056900                        PER-CSD-CN OF SORT-REC
057000                        PER-EMP-NAME OF SORT-REC
057100          INPUT PROCEDURE 8-INPUT-RECORDS
057200          OUTPUT PROCEDURE 9-WRITE-RECORDS.
057300     PERFORM 60-CALL-TPPRNT.
057600     GO TO 2-EOJ.
057700 SORT23.
057800     SORT SORT-FILE
057900          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
058000                        PER-CSD-CN OF SORT-REC
058100                        PER-CC-NUM OF SORT-REC
058200          INPUT PROCEDURE 8-INPUT-RECORDS
058300          OUTPUT PROCEDURE 9-WRITE-RECORDS.
058400     PERFORM 60-CALL-TPPRNT.
058700     GO TO 2-EOJ.
058800 SORT24.
058900     SORT SORT-FILE
059000          ASCENDING KEY PER-CRAFT OF SORT-REC
059100                        PER-MAINT-ZONE OF SORT-REC
059200                        PER-CSD-CN OF SORT-REC
059300          INPUT PROCEDURE 8-INPUT-RECORDS
059400          OUTPUT PROCEDURE 9-WRITE-RECORDS.
059500     PERFORM 60-CALL-TPPRNT.
059800     GO TO 2-EOJ.
059900 SORT25.
060000     SORT SORT-FILE
060100          ASCENDING KEY PER-CRAFT OF SORT-REC
060200                        PER-MAINT-ZONE OF SORT-REC
060300                        PER-EMP-NAME OF SORT-REC
060400          INPUT PROCEDURE 8-INPUT-RECORDS
060500          OUTPUT PROCEDURE 9-WRITE-RECORDS.
060600     PERFORM 60-CALL-TPPRNT.
060900     GO TO 2-EOJ.
061000 SORT26.
061100     SORT SORT-FILE
061200          ASCENDING KEY PER-CRAFT OF SORT-REC
061300                        PER-MAINT-ZONE OF SORT-REC
061400                        PER-CC-NUM OF SORT-REC
061500          INPUT PROCEDURE 8-INPUT-RECORDS
061600          OUTPUT PROCEDURE 9-WRITE-RECORDS.
061700     PERFORM 60-CALL-TPPRNT.
062000     GO TO 2-EOJ.
062100 SORT27.
062200     SORT SORT-FILE
062300          ASCENDING KEY PER-CRAFT OF SORT-REC
062400                        PER-CSD-CN OF SORT-REC
062500                        PER-MAINT-ZONE OF SORT-REC
062600          INPUT PROCEDURE 8-INPUT-RECORDS
062700          OUTPUT PROCEDURE 9-WRITE-RECORDS.
062800     PERFORM 60-CALL-TPPRNT.
063100     GO TO 2-EOJ.
063200 SORT28.
063300     SORT SORT-FILE
063400          ASCENDING KEY PER-CRAFT OF SORT-REC
063500                        PER-CSD-CN OF SORT-REC
063600                        PER-EMP-NAME OF SORT-REC
063700          INPUT PROCEDURE 8-INPUT-RECORDS
063800          OUTPUT PROCEDURE 9-WRITE-RECORDS.
063900     PERFORM 60-CALL-TPPRNT.
064200     GO TO 2-EOJ.
064300 SORT29.
064400     SORT SORT-FILE
064500          ASCENDING KEY PER-CRAFT OF SORT-REC
064600                        PER-CSD-CN OF SORT-REC
064700                        PER-CC-NUM OF SORT-REC
064800          INPUT PROCEDURE 8-INPUT-RECORDS
064900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
065000     PERFORM 60-CALL-TPPRNT.
065300     GO TO 2-EOJ.
065400 SORT30.
065500     SORT SORT-FILE
065600          ASCENDING KEY PER-CSD-CN OF SORT-REC
065700                        PER-MAINT-ZONE OF SORT-REC
065800                        PER-CRAFT OF SORT-REC
065900          INPUT PROCEDURE 8-INPUT-RECORDS
066000          OUTPUT PROCEDURE 9-WRITE-RECORDS.
066100     PERFORM 60-CALL-TPPRNT.
066400     GO TO 2-EOJ.
066500 SORT31.
066600     SORT SORT-FILE
066700          ASCENDING KEY PER-CSD-CN OF SORT-REC
066800                        PER-MAINT-ZONE OF SORT-REC
066900                        PER-EMP-NAME OF SORT-REC
067000          INPUT PROCEDURE 8-INPUT-RECORDS
067100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
067200     PERFORM 60-CALL-TPPRNT.
067500     GO TO 2-EOJ.
067600 SORT32.
067700     SORT SORT-FILE
067800          ASCENDING KEY PER-CSD-CN OF SORT-REC
067900                        PER-MAINT-ZONE OF SORT-REC
068000                        PER-CC-NUM OF SORT-REC
068100          INPUT PROCEDURE 8-INPUT-RECORDS
068200          OUTPUT PROCEDURE 9-WRITE-RECORDS.
068300     PERFORM 60-CALL-TPPRNT.
068600     GO TO 2-EOJ.
068700 SORT33.
068800     SORT SORT-FILE
068900          ASCENDING KEY PER-CSD-CN OF SORT-REC
069000                        PER-CRAFT OF SORT-REC
069100                        PER-MAINT-ZONE OF SORT-REC
069200          INPUT PROCEDURE 8-INPUT-RECORDS
069300          OUTPUT PROCEDURE 9-WRITE-RECORDS.
069400     PERFORM 60-CALL-TPPRNT.
069700     GO TO 2-EOJ.
069800 SORT34.
069900     SORT SORT-FILE
070000          ASCENDING KEY PER-CSD-CN OF SORT-REC
070100                        PER-CRAFT OF SORT-REC
070200                        PER-EMP-NAME OF SORT-REC
070300          INPUT PROCEDURE 8-INPUT-RECORDS
070400          OUTPUT PROCEDURE 9-WRITE-RECORDS.
070500     PERFORM 60-CALL-TPPRNT.
070800     GO TO 2-EOJ.
070900 SORT35.
071000     SORT SORT-FILE
071100          ASCENDING KEY PER-CSD-CN OF SORT-REC
071200                        PER-CRAFT OF SORT-REC
071300                        PER-CC-NUM OF SORT-REC
071400          INPUT PROCEDURE 8-INPUT-RECORDS
071500          OUTPUT PROCEDURE 9-WRITE-RECORDS.
071600     PERFORM 60-CALL-TPPRNT.
071900     GO TO 2-EOJ.
072000 SORT36.
072100     SORT SORT-FILE
072200          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
072300                        PER-CRAFT OF SORT-REC
072400                        PER-CSD-CN OF SORT-REC
072500                        PER-EMP-NAME OF SORT-REC
072600          INPUT PROCEDURE 8-INPUT-RECORDS
072700          OUTPUT PROCEDURE 9-WRITE-RECORDS.
072800     PERFORM 60-CALL-TPPRNT.
073100     GO TO 2-EOJ.
073200 SORT37.
073300     SORT SORT-FILE
073400          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
073500                        PER-CRAFT OF SORT-REC
073600                        PER-CSD-CN OF SORT-REC
073700                        PER-CC-NUM OF SORT-REC
073800          INPUT PROCEDURE 8-INPUT-RECORDS
073900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
074000     PERFORM 60-CALL-TPPRNT.
074300     GO TO 2-EOJ.
074400 SORT38.
074500     SORT SORT-FILE
074600          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
074700                        PER-CSD-CN OF SORT-REC
074800                        PER-CRAFT OF SORT-REC
074900                        PER-EMP-NAME OF SORT-REC
075000          INPUT PROCEDURE 8-INPUT-RECORDS
075100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
075200     PERFORM 60-CALL-TPPRNT.
075500     GO TO 2-EOJ.
075600 SORT39.
075700     SORT SORT-FILE
075800          ASCENDING KEY PER-MAINT-ZONE OF SORT-REC
075900                        PER-CSD-CN OF SORT-REC
076000                        PER-CRAFT OF SORT-REC
076100                        PER-CC-NUM OF SORT-REC
076200          INPUT PROCEDURE 8-INPUT-RECORDS
076300          OUTPUT PROCEDURE 9-WRITE-RECORDS.
076400     PERFORM 60-CALL-TPPRNT.
076700     GO TO 2-EOJ.
076800 SORT40.
076900     SORT SORT-FILE
077000          ASCENDING KEY PER-CRAFT OF SORT-REC
077100                        PER-MAINT-ZONE OF SORT-REC
077200                        PER-CSD-CN OF SORT-REC
077300                        PER-EMP-NAME OF SORT-REC
077400          INPUT PROCEDURE 8-INPUT-RECORDS
077500          OUTPUT PROCEDURE 9-WRITE-RECORDS.
077600     PERFORM 60-CALL-TPPRNT.
077900     GO TO 2-EOJ.
078000 SORT41.
078100     SORT SORT-FILE
078200          ASCENDING KEY PER-CRAFT OF SORT-REC
078300                        PER-MAINT-ZONE OF SORT-REC
078400                        PER-CSD-CN OF SORT-REC
078500                        PER-CC-NUM OF SORT-REC
078600          INPUT PROCEDURE 8-INPUT-RECORDS
078700          OUTPUT PROCEDURE 9-WRITE-RECORDS.
078800     PERFORM 60-CALL-TPPRNT.
079100     GO TO 2-EOJ.
079200 SORT42.
079300     SORT SORT-FILE
079400          ASCENDING KEY PER-CRAFT OF SORT-REC
079500                        PER-CSD-CN OF SORT-REC
079600                        PER-MAINT-ZONE OF SORT-REC
079700                        PER-EMP-NAME OF SORT-REC
079800          INPUT PROCEDURE 8-INPUT-RECORDS
079900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
080000     PERFORM 60-CALL-TPPRNT.
080300     GO TO 2-EOJ.
080400 SORT43.
080500     SORT SORT-FILE
080600          ASCENDING KEY PER-CRAFT OF SORT-REC
080700                        PER-CSD-CN OF SORT-REC
080800                        PER-MAINT-ZONE OF SORT-REC
080900                        PER-CC-NUM OF SORT-REC
081000          INPUT PROCEDURE 8-INPUT-RECORDS
081100          OUTPUT PROCEDURE 9-WRITE-RECORDS.
081200     PERFORM 60-CALL-TPPRNT.
081500     GO TO 2-EOJ.
081600 SORT44.
081700     SORT SORT-FILE
081800          ASCENDING KEY PER-CSD-CN OF SORT-REC
081900                        PER-MAINT-ZONE OF SORT-REC
082000                        PER-CRAFT OF SORT-REC
082100                        PER-EMP-NAME OF SORT-REC
082200          INPUT PROCEDURE 8-INPUT-RECORDS
082300          OUTPUT PROCEDURE 9-WRITE-RECORDS.
082400     PERFORM 60-CALL-TPPRNT.
082700     GO TO 2-EOJ.
082800 SORT45.
082900     SORT SORT-FILE
083000          ASCENDING KEY PER-CSD-CN OF SORT-REC
083100                        PER-MAINT-ZONE OF SORT-REC
083200                        PER-CRAFT OF SORT-REC
083300                        PER-CC-NUM OF SORT-REC
083400          INPUT PROCEDURE 8-INPUT-RECORDS
083500          OUTPUT PROCEDURE 9-WRITE-RECORDS.
083600     PERFORM 60-CALL-TPPRNT.
083900     GO TO 2-EOJ.
084000 SORT46.
084100     SORT SORT-FILE
084200          ASCENDING KEY PER-CSD-CN OF SORT-REC
084300                        PER-CRAFT OF SORT-REC
084400                        PER-MAINT-ZONE OF SORT-REC
084500                        PER-EMP-NAME OF SORT-REC
084600          INPUT PROCEDURE 8-INPUT-RECORDS
084700          OUTPUT PROCEDURE 9-WRITE-RECORDS.
084800     PERFORM 60-CALL-TPPRNT.
085100     GO TO 2-EOJ.
085200 SORT47.
085300     SORT SORT-FILE
085400          ASCENDING KEY PER-CSD-CN OF SORT-REC
085500                        PER-CRAFT OF SORT-REC
085600                        PER-MAINT-ZONE OF SORT-REC
085700                        PER-CC-NUM OF SORT-REC
085800          INPUT PROCEDURE 8-INPUT-RECORDS
085900          OUTPUT PROCEDURE 9-WRITE-RECORDS.
086000     PERFORM 60-CALL-TPPRNT.
086300     GO TO 2-EOJ.
087100
       60-CALL-TPPRNT.
           IF AKEY = 0
103000         MOVE 40011        TO CATREAD-MSG-NUMBER
103200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO TERM-CMD-LINE
               MOVE TRUE-VAL     TO INDS (98)
               MOVE TERM-BUFFER  TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               MOVE SPACES       TO TERM-BUF
               CALL "CLPAUSE2"
           ELSE
           CLOSE DISK-TEMP
           CALL "TPPRNT" USING DBPARAMETERS VIEW-COMAREA
                           PLT-IDT PV SAVE-INDEX.

       PRE-MESSAGE-DISPLAY.
           MOVE 35095 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           GO TO 6-MAIN.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

087200 999-CATREAD.
087300     MOVE SPACES TO ERROR-BUFFER.
087400     CALL "CCATREAD" USING CATREAD-PARMS.
087500     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
088200 999-CATREAD-EXIT.    EXIT.

088400 8-INPUT-RECORDS.
088600     PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT.
089000
089100 81-PROCESS-INPUT-RECORDS.
089200     MOVE 0 TO COND-WORD.
089300     READ PERSONNEL-FILE INTO PER-PERSONNEL
089400         AT END    MOVE 11 TO COND-WORD.
089500     IF COND-WORD = 11
089700         GO TO 81-PIR-EXIT.
090100     IF SPACES = COMP-DATE1-CN AND COMP-DATE2-CN
090200         NEXT SENTENCE
090300     ELSE
090400     IF (COMP-DATE1-CN < PER-CSD-CN OF PER-PERSONNEL OR
090500        COMP-DATE1-CN = PER-CSD-CN OF PER-PERSONNEL)  AND
090600        (PER-CSD-CN OF PER-PERSONNEL < COMP-DATE2-CN OR
090700        PER-CSD-CN OF PER-PERSONNEL = COMP-DATE2-CN)
090800       NEXT SENTENCE
090900     ELSE
091000     GO TO 81-PROCESS-INPUT-RECORDS.
091100     IF TERM-C1 = SPACES MOVE "**" TO TERM-C1.
091200     IF TERM-C2 = SPACES MOVE "**" TO TERM-C2.
091300     IF TERM-C3 = SPACES MOVE "**" TO TERM-C3.
091400     IF TERM-C4 = SPACES MOVE "**" TO TERM-C4.
091500     IF TERM-C5 = SPACES MOVE "**" TO TERM-C5.
091600     IF "**" = TERM-C1 AND TERM-C2 AND TERM-C3
091700                       AND TERM-C4 AND TERM-C5
091800*        IF PER-CRAFT OF PER-PERSONNEL = "SS"
091900*            GO TO 81-PROCESS-INPUT-RECORDS
092000*        ELSE
092100         NEXT SENTENCE
092200     ELSE
092300     IF PER-CRAFT OF PER-PERSONNEL = TERM-C1 OR TERM-C2 OR
092400                                     TERM-C3 OR TERM-C4 OR
092500                                     TERM-C5
092600         NEXT SENTENCE
092700     ELSE
092800     GO TO 81-PROCESS-INPUT-RECORDS.
092900     IF TERM-Z1 = SPACES MOVE "****" TO TERM-Z1.
093000     IF TERM-Z2 = SPACES MOVE "****" TO TERM-Z2.
093100     IF TERM-Z3 = SPACES MOVE "****" TO TERM-Z3.
093200     IF TERM-Z4 = SPACES MOVE "****" TO TERM-Z4.
093300     IF TERM-Z5 = SPACES MOVE "****" TO TERM-Z5.
093400     IF "****" = TERM-Z1 AND TERM-Z2 AND TERM-Z3
093500                         AND TERM-Z4 AND TERM-Z5
093600         NEXT SENTENCE
093700     ELSE
093800     IF PER-MAINT-ZONE OF PER-PERSONNEL = TERM-Z1 OR TERM-Z2 OR
093900                                          TERM-Z3 OR TERM-Z4 OR
094000                                          TERM-Z5
094100         NEXT SENTENCE
094200     ELSE
094300     GO TO 81-PROCESS-INPUT-RECORDS.
094400     IF TERM-S1 = SPACES MOVE "**" TO TERM-S1.
094500     IF TERM-S2 = SPACES MOVE "**" TO TERM-S2.
094600     IF TERM-S3 = SPACES MOVE "**" TO TERM-S3.
094700     IF TERM-S4 = SPACES MOVE "**" TO TERM-S4.
094800     IF "**" = TERM-S1 AND TERM-S2 AND TERM-S3 AND TERM-S4
094900         NEXT SENTENCE
095000     ELSE
095100     IF PER-SHIFT-CREW OF PER-PERSONNEL = TERM-S1 OR TERM-S2 OR
095200                                          TERM-S3 OR TERM-S4
095300         NEXT SENTENCE
095400     ELSE
095500     GO TO 81-PROCESS-INPUT-RECORDS.
095600     MOVE CORR PER-PERSONNEL TO SORT-REC.
095700     RELEASE SORT-REC.
           GO TO 81-PROCESS-INPUT-RECORDS.
095900
096000 81-PIR-EXIT.    EXIT.
096100
096800 9-WRITE-RECORDS.
           MOVE 0 TO AKEY.
           PERFORM 9-WR THRU 9-WR-EXIT.
       9-WR.
096900     RETURN SORT-FILE AT END GO TO 9-WR-EXIT.
097800     ADD 1 TO AKEY.
097900     WRITE DISK-REC FROM SORT-REC INVALID KEY
098100         MOVE 44017 TO CATREAD-MSG-NUMBER
098300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (99)
               GO TO 2-EOJ.
097000     GO TO 9-WR.
100000 9-WR-EXIT.    EXIT.
