000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPLNNDCW.
000500 INSTALLATION.  GOODYEAR.
000700*REMARKS.       THIS PROGRAM CREATES AND SUBMITS A QUERY JOB
000800*               TO LOCATE PLANNED 'CW' WORK ORDERS THAT HAVE
000900*               A COMPLETION DATE THAT IS BEFORE A CERTAIN
001000*               DATE. THE INTENT IS TO IDENTIFY WORK ORDERS
001100*               THAT NEED TO BE MOVED INTO 'DW' STATUS.
      *C
      *C 09/11/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    INCLUDE DATE ON COMPLETION DATE IN SORT AND
      *C    IN COMPARISON OF DATE ENTERED.
      *C
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.   AS400.
001700 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
001800 INPUT-OUTPUT SECTION.
001900 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZREPORT-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
002800     SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
002500 DATA DIVISION.
002600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS PRINTF.
       01  PRINTF                  PIC X(132).
004500 SD  SORT-FILE
004600     RECORD CONTAINS 66 CHARACTERS
004700     DATA RECORD IS SORT-REC.
004800 01  SORT-REC.
           05  SORT-WO             PIC X(10).
           05  SORT-PLNR           PIC X(4).
           05  SORT-ENGR           PIC X(4).
           05  SORT-DESC           PIC X(30).
           05  SORT-DATECOMP-CN.
               10  SORT-DATECOMP-CC PIC X(2).
               10  SORT-DATECOMP   PIC X(6).
           05  SORT-ZONE           PIC X(6).
           05  SORT-DEPT           PIC X(4).
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
003700 WORKING-STORAGE SECTION.
       77  LINE-CTR                     PIC 99 VALUE 61.
       77  SORT-RECS-CTR                PIC 9(5).
003900 01  ARG-NO                       PIC 9(9).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
       COPY TDATESUB OF COPYLIB.

       01  TEMP-DATE-CN.
           05  TEMP-DATE-CC             PIC X(2).
           05  TEMP-DATE-YMD.
               10  TEMP-DATE-YY         PIC X(2).
               10  FILLER               PIC X(4).

005300 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       01  D1.
           05  FILLER   PIC X.
           05  D1-WO    PIC X(10).
           05  FILLER   PIC XX.
           05  D1-PLNR  PIC X(4).
           05  FILLER   PIC XX.
           05  D1-ENGR  PIC X(4).
           05  FILLER   PIC XX.
           05  D1-DESC  PIC X(30).
           05  FILLER   PIC XX.
           05  D1-DATE  PIC X(6).
           05  FILLER   PIC XX.
           05  D1-ZONE  PIC X(6).
           05  FILLER   PIC XX.
           05  D1-DEPT  PIC X(4).
           05  FILLER   PIC XXX.
       01  ERROR-BUFFER                 PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  WLNU-STATUS              PIC XX.
           05  WPF-STATUS               PIC XX.
       01  H1.
           05  FILLER   PIC X(27) VALUE SPACES.
           05  FILLLER  PIC X(26)
               VALUE "PLANNED 'CW' WORK ORDERS".
           05  FILLER   PIC X(27) VALUE SPACES.
       01  H2.
           05  FILLER   PIC X     VALUE SPACE.
           05  FILLER   PIC X(10) VALUE "Work Order".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(4)  VALUE "Plnr".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(4)  VALUE "Engr".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(30) VALUE "Description ".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(6)  VALUE "Date..".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(6)  VALUE "Zone..".
           05  FILLER   PIC XX    VALUE SPACES.
           05  FILLER   PIC X(4)  VALUE "Dept".
           05  FILLER   PIC XXX   VALUE SPACES.
       COPY IOFEEDBACK IN COPYLIB.
       COPY LANGSUB OF COPYLIB.
007100 01  LAST-WO-BUFF.                COPY MLASTWO OF COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
008900 01  SCREEN-BUFFER.
           05  SCREEN-DATA.
009000         10  S-DATE               PIC X(6).
009100         10  S-DEVICE             PIC X(3).
               10  S-DEV-9 REDEFINES S-DEVICE   PIC 9(3).
009200         10  S-PLNR               PIC X(4).
009300         10  S-ENGR               PIC X(4).
009400         10  S-ZONE               PIC X(4).
009500         10  S-DEPT               PIC X(4).
           05  SCREEN-CMD-LINE          PIC XX.
           05  SCREEN-ERR-LINE          PIC XX.
       COPY DBSTAT OF COPYLIB.
       01  THREE-BYTE-WA.
           05  TBWA OCCURS 3 TIMES.
               10  TB-WA                PIC X.
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY VCOMLINK OF COPYLIB.
       01  WO-PLANNED-DATA.             COPY DWOPLAN OF COPYLIB.
       01  ZONE-P6.
           05  ZONE-WA                  PIC X(4).
           05  P-WA                     PIC X.
           05  FILLER                   PIC X.
       COPY WSCONTROL IN COPYLIB.
011200 PROCEDURE DIVISION.
011400 BEGIN-PAR.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PRINT-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
017700     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
018300     MOVE DATE-FLAG-SW TO DATE-CODE.
           MOVE 0 TO VIEW-LASTKEY.

022700 6-MAIN.
           IF TRUE-VAL = INDS (99)
               NEXT SENTENCE
           ELSE
022800     MOVE "FPLNNDCW" TO VIEW-CFNAME
           MOVE SPACES TO SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
024000     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
025100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
025200     IF VIEW-LASTKEY = 0
025300         NEXT SENTENCE
025400     ELSE
025600     GO TO 6-MAIN.
028100     IF S-DATE = SPACES MOVE "000000" TO S-DATE.
028400     MOVE S-DATE TO DATE-VALIDATE-IN.
028500     MOVE 3 TO DATE-MODE.
028600     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
028700     IF DATE-RET-CODE = 1
028800         MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE "DATE ERRORONEOUS" TO SCREEN-ERR-LINE
029900         GO TO 6-MAIN.
030000     MOVE DATE-DB TO S-DATE.
           MOVE S-DEVICE TO THREE-BYTE-WA.
           PERFORM 6-RIGHT-JUSTIFY-DEV.
           MOVE THREE-BYTE-WA TO S-DEVICE.
           MOVE S-DEV-9 TO OVRPRTF-TOFILE-NUM.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE 0 TO SORT-RECS-CTR.
           SORT SORT-FILE    ASCENDING KEY SORT-DATECOMP-CN SORT-WO
               INPUT PROCEDURE  7-INPUT-RECORDS
               OUTPUT PROCEDURE 8-WRITE-RECORDS.

       6-MAIN-EXIT.    EXIT.

       6-RIGHT-JUSTIFY-DEV.
           IF TB-WA (3) = " "
                MOVE TB-WA (2) TO TB-WA (3)
                MOVE TB-WA (1) TO TB-WA (2)
                MOVE "0" TO TB-WA (1)
           ELSE
           IF TB-WA (2) = " "
               MOVE TB-WA (1) TO TB-WA (2)
               MOVE "0" TO TB-WA (1)
           ELSE
           IF TB-WA (1) = " " MOVE "0" TO TB-WA (1).

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE "CW" TO WOSTATUS OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WOSTATUS OF WPFREC NOT = "CW"
               MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       COPY OVRPFCALL IN COPYLIB.

049900 999-CATREAD.
050000     MOVE SPACES TO ERROR-BUFFER.
050100     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
051000 999-CATREAD-EXIT.    EXIT.

       7-INPUT-RECORDS.
           PERFORM 7-SORT-RECS THRU 7-SR-EXIT.

       7-SORT-RECS.
           PERFORM 69-START-WO-PLANNED-FILE.
           IF COND-WORD = 17 GO TO 7-SR-EXIT.
       7-SR-LOOP.
           PERFORM 69-READ-WO-PLANNED-FILE.
           IF COND-WORD = 15 GO TO 7-SR-EXIT.
           MOVE S-DATE TO TEMP-DATE-YMD.
           IF TEMP-DATE-YY > "70"
               MOVE "19" TO TEMP-DATE-CC
           ELSE
               MOVE "20" TO TEMP-DATE-CC.
           IF TEMP-DATE-CN > DATE-COMP-P-CN
               NEXT SENTENCE
           ELSE
           GO TO 7-SR-LOOP.
           IF S-PLNR = SPACES
               IF S-ENGR = SPACES
                   NEXT SENTENCE
               ELSE
               IF ENGINEER = S-ENGR
                   NEXT SENTENCE
               ELSE
               GO TO 7-SR-LOOP
           ELSE
           IF PLANNER = S-PLNR
               NEXT SENTENCE
           ELSE
           GO TO 7-SR-LOOP.
           MOVE ZONE-PRIORITY-P TO ZONE-P6.
           IF S-ZONE = SPACES
               NEXT SENTENCE
           ELSE
           IF S-ZONE NOT = ZONE-WA
               GO TO 7-SR-LOOP.
           IF S-DEPT = SPACES
               NEXT SENTENCE
           ELSE
           IF S-DEPT NOT = DEPT-P
               GO TO 7-SR-LOOP.
           MOVE WO-NUM-PLANNED  TO SORT-WO.
           MOVE PLANNER         TO SORT-PLNR.
           MOVE ENGINEER        TO SORT-ENGR.
           MOVE DESCRIPTION-1-P TO SORT-DESC.
           MOVE DATE-COMP-P-CN  TO SORT-DATECOMP-CN.
           MOVE ZONE-WA         TO SORT-ZONE.
           MOVE DEPT-P          TO SORT-DEPT.
           ADD 1 TO SORT-RECS-CTR.
           RELEASE SORT-REC.
           GO TO 7-SR-LOOP.

       7-SR-EXIT.    EXIT.

       8-WRITE-RECORDS.
           PERFORM 8-WRITE-RECS THRU 8-WR-EXIT.

       8-WRITE-HEADERS.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF FROM H1 AFTER ADVANCING NEW-PAGE.
           WRITE PRINTF FROM H2 AFTER ADVANCING 1 LINES.
           MOVE 0 TO LINE-CTR.

       8-WRITE-RECS.
           IF LINE-CTR > 60 PERFORM 8-WRITE-HEADERS.
           IF SORT-RECS-CTR = 0
               MOVE "NO PLANNED CW RECORDS RETRIEVED " TO PRINTF
               WRITE PRINTF AFTER ADVANCING 1 LINES
               GO TO 8-WR-EXIT.
       8-WR-LOOP.
           RETURN SORT-FILE AT END GO TO 8-WR-EXIT.
           MOVE SPACES TO D1.
           MOVE SORT-WO       TO D1-WO.
           MOVE SORT-PLNR     TO D1-PLNR.
           MOVE SORT-ENGR     TO D1-ENGR.
           MOVE SORT-DESC     TO D1-DESC.
           MOVE SORT-DATECOMP TO D1-DATE.
           MOVE SORT-ZONE     TO D1-ZONE.
           MOVE SORT-DEPT     TO D1-DEPT.
           WRITE PRINTF FROM D1 AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60 PERFORM 8-WRITE-HEADERS.
           GO TO 8-WR-LOOP.

       8-WR-EXIT.    EXIT.
