       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TPLTRPTS.
       AUTHOR.         ANNETTE M. KRAUSS.
       INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   JUNE 6, 1986.
      *REMARKS.
      *          PLANT START UP REPORTS.
      *
      *************************************************************
      *************************************************************
      *                     TPLTRPTS                              *
      *                                                           *
      *         THIS PROGRAM WILL PRINT REPORTS GENERATED         *
      *         BY THE PLANT STARTUP PROGRAM.                     *
      *                                                           *
      *************************************************************
      *************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE
           RECORD CONTAINS 132 CHARACTERS.
       01  PRINT-REC                              PIC X(132).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500   OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE SPACES.
           05  FILE-STATUS-2          PIC X      VALUE SPACES.

       01  PLANT-NUMBER               PIC X(3)   VALUE SPACES.

      *-------------- ESCAPE SEQUENCES
       COPY ESCNAM2  IN COPYCSIS.

       01  ESC-INFO.
           05  COMPRESS-PRINT         PIC X(8).
           05  NORMAL-PRINT           PIC X(8).
           05  EXPAND-PRINT           PIC X(8).

       COPY TBLOWUP  IN COPYCSIS.
       01  VIEW-COMAREA.
           05  FILLER                  PIC X(118)  VALUE ALL "0".
           05  FILLER                  PIC S9(4)   COMP VALUE 9999.
       01  KSAM-STATUS                 PIC X(2)    VALUE SPACES.


      *---------- PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       01  HD-RET-CODE                 PIC S9(4) COMP VALUE 0.
       01  HD-FILE-NAME                PIC X(17) VALUE SPACES.
       01  FNUM                        PIC S9(4) COMP VALUE 0.

      *------------- DATABASE AREA
       COPY DATAB  IN COPYCSIS.

       01  DSET-NAME-AREA.
           05  DSET-NAME               PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO           PIC X(16)  VALUE "MPLTINFO;".

       01  DATABASE-ARGS.
           05  PLT-ARG                 PIC X(4)   VALUE "P 01".

       01  SEARCH-ITEMS.
           05  ALL-ITEM-LIST           PIC X(2)   VALUE "@;".

      *------------- DATABASE BUFFERS
       COPY MPLTINFO IN COPYCSIS.

       COPY CCHKOBJ IN COPYCSIS.
       COPY CCRTFILE IN COPYCSIS.
       COPY OVRPFDATA IN COPYCSIS.

       LINKAGE SECTION.
       COPY THDPRTB IN COPYCSIS.
       01  DATA-LINE.
           05  STD-INST-RPT           PIC X(1).
           05  BUYERS-RPT             PIC X(1).
           05  TERMS-RPT              PIC X(1).
           05  TAX-CODES-RPT          PIC X(1).
           05  UNIT-OF-MEAS-RPT       PIC X(1).
           05  CURRENCY-RPT           PIC X(1).
           05  FOB-CODES-RPT          PIC X(1).
           05  REQ-HOLD-STAT-RPT      PIC X(1).
           05  FILLER                 PIC X(104).
      *************************************************************
      *************************************************************
      *           P R O C E D U R E     D I V I S I O N           *
      *************************************************************
      *************************************************************
       PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.

       00-BEGIN-HERE.
           PERFORM 10-OPEN-FILES     THRU 10-EXIT.
           PERFORM 30-GET-PARAMETERS THRU 30-EXIT.
           PERFORM 60-MAIN           THRU 60-EXIT.
           PERFORM 20-CLOSE-FILES    THRU 20-EXIT.
           GOBACK.


       10-OPEN-FILES.
           MOVE "TPLTRPTS"                 TO BU-PGM-NAME.
           OPEN INPUT MPLTINFO-I.

       10-EXIT.  EXIT.

      *************************************************************
      *************************************************************
      *   ACCEPT TWO LINES OF DATA: 1) ALL HEADER INFORMATION -   *
      *     WHO AND WHERE THIS REPORT WILL BE ROUTED TO  2) WHICH *
      *     REPORTS ARE TO BE RUN.                                *
      *                                                           *
      *************************************************************
      *************************************************************
       30-GET-PARAMETERS.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.
           MOVE CHAR-5PI        TO EXPAND-PRINT.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.

           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           MOVE "DHDR21.PUB"   TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * PLTRPT" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "         TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE              TO BU-DISPLAY-FLD9 (1)
               GO TO 2-BLOWUP.

      *------------- GET RECORD FOR PLANT NUMBER
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET ERROR IN 010-OPEN-FILES"
                   TO BU-DISPLAY-MSG
               MOVE "P 01" TO BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-COMPANY TO PLANT-NUMBER.

       30-EXIT.  EXIT.


       20-CLOSE-FILES.
           CLOSE PRINT-FILE.
           CLOSE MPLTINFO-I.

       20-EXIT.  EXIT.


      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       2-BLOWUP.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

       60-MAIN.
           IF STD-INST-RPT      NOT = SPACES
               CALL "SINSTRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                      HD-PAPER-FLAG.
           IF BUYERS-RPT        NOT = SPACES
               CALL "SBUYRRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                      HD-PAPER-FLAG.
           IF TERMS-RPT         NOT = SPACES
               CALL "STERMRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                      HD-PAPER-FLAG.
           IF TAX-CODES-RPT     NOT = SPACES
               CALL "STAXRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                     HD-PAPER-FLAG.
           IF UNIT-OF-MEAS-RPT  NOT = SPACES
               CALL "SUMREPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                     HD-PAPER-FLAG.
           IF CURRENCY-RPT      NOT = SPACES
               CALL "SCURRRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                      HD-PAPER-FLAG.
           IF FOB-CODES-RPT     NOT = SPACES
               CALL "SFOBRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                     HD-PAPER-FLAG.
           IF REQ-HOLD-STAT-RPT NOT = SPACES
               CALL "SRQHSRPT" USING BASE, PLANT-NUMBER, ESC-INFO,
                                      HD-PAPER-FLAG.

       60-EXIT.  EXIT.
       COPY OVRPFCALL IN COPYCSIS.
