001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID. TPLTMAIN.
001400
001500 AUTHOR. KURT MOVSESIAN.
020221
000800**************************************************************
000900*                                                            *
001000*   T P L T M A I N                                          *
001100*                                                            *
001200*     THIS PROGRAM IS THE MAIN PROGRAM FOR CALLING           *
001300*     'TPLTMAST' WHICH MODIFIES CORPORATE CODE INFORMATION   *
001400*     EXCEPT DESCRIPTION.                                    *
001600*                                                            *
001700**************************************************************
020300
020400
020500 ENVIRONMENT DIVISION.
020600 CONFIGURATION SECTION.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.


020700 DATA DIVISION.
020800 FILE SECTION.
020900
021000
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

021100
021200 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
021300 77  FATAL-ERR-SW                PIC X       VALUE "N".
021400 77  PASS-CORP-CODE              PIC X(8)    VALUE SPACES.
021500 77  PASS-COMPANY-CODE           PIC X(3)    VALUE SPACES.
021600
       COPY VCOMAREA IN COPYLIB.
022400
022500*********************************
022600*                               *
022700*  BELOW ARE THE BUFFER AREAS   *
022800*    SET UP FOR EACH DATASET IN *
022900*    THE DATABASE - STORES      *
023000*                               *
023100*********************************
023200
023300 COPY MPLT0 IN COPYLIB.

       COPY MPLTP01 IN COPYLIB.
024500
024600 COPY DATAB IN COPYLIB.
025000
025100 01 ARG-VALUES.
025200     05  PLT-ARG                PIC X(4)  VALUE SPACES.
025300
025400
025500 COPY TBLOWUP IN COPYLIB.
025510
025520************************************
025530*   NATIVE LANGUAGE SUPPORT AREA   *
025540************************************
025550
025560 COPY LANGUAGE IN COPYLIB.
025600
025700
025800 PROCEDURE DIVISION.
025900
026000 PROC-DIV SECTION.
026100
026200 BEGIN-HERE.
026300     PERFORM 1-HSK THRU 1-H-X.
026600
026700     CALL "TPLTMAST" USING BASE,
026800                           VIEW-COMAREA,
026900                           PASS-CORP-CODE,
027000                           PASS-COMPANY-CODE,
027010                           LANGUAGE-PARMS.
027100
027200     PERFORM 2-EOJ  THRU  2-EOJ-X.

027500     GOBACK.
027600
027700
027800 1-HSK.
           OPEN INPUT MPLTINFO-I.
030500
030600     MOVE "P 01"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
031000         MOVE "1-HSK"   TO  BU-DISPLAY-MSG
031100         MOVE PLT-ARG   TO  BU-DISPLAY-FLD (1)
031300         GO TO 2-BLOWUP.
031400
031500     MOVE MPLTINFO-COMPANY  TO  PASS-COMPANY-CODE.
031600
031700 1-H-X.
031800     EXIT.
031900
032000
032100 2-EOJ.
           CLOSE MPLTINFO-I.
034200 2-EOJ-X.
034300      EXIT.
034400
034500*********************************************
034600*                                           *
034700*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
034800*  FATAL ERROR OCCURS                       *
034900*                                           *
035000*********************************************
035100
035200 2-BLOWUP.
027900     MOVE "TPLTMAIN"  TO  BU-PGM-NAME.
035300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
035400         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
035500                 BU-DISPLAY-FLDS.
035600
035700 2-BLOWUP-X.
035800     EXIT.
035900
