000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID. TPLTMAS3.
      *REMARKS.

000700******************************************************
000800*   T P L T M A S 3                                  *
      *                                                    *
      *   (COPIED FROM TPLTMAS2 AND MODIFIED.)             *
000900*                                                    *
001000*   THIS SUB PROGRAM MODIFIES DESCRIPTION ONLY.      *
      *                                                    *
001100******************************************************
001200
      *C
      *C
007600
007700 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.  HP-3000.
003900 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                       LOCAL-DATA IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPLTMAS3-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDPLTDATA-I
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-O
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MTAX-I
                  ASSIGN TO DATABASE-MCFLCS3701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003500
           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003500
           SELECT MBUYER-I
                  ASSIGN TO DATABASE-MCFLCS0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003500
           SELECT DREQD-I
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DWLITEM-I
                  ASSIGN TO DATABASE-MCFLCS1502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DDESC-O
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-O
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

004000
004100
007800 DATA DIVISION.
007900 FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZPLTMAS2.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0401.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  MVALIDPLTDATA-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDATA-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1701.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS4901.

       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1801.

       FD  MSTORERM-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MTAX-I
           LABEL RECORDS ARE STANDARD.
       01  MTAX-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS3701.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0601.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2101.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1001.

       FD  DWLITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1502.

       FD  DDESC-O
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1401.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

       FD  USAGEFIL
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

008000 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
008500 77  EDIT-ERR-SW                 PIC X       VALUE "N".
008600 77  EOJ-SW                      PIC X       VALUE "N".
008700 77  PO-SW                       PIC X       VALUE SPACES.
008800 77  WO-SW                       PIC X       VALUE SPACES.
008900 77  CHANGING-STOREROOM-UM-SW    PIC X       VALUE "N".
009000 77  REORD-MSG-SW                PIC X       VALUE "N".
009100 77  TC-ID-1-SW                  PIC X       VALUE "N".
009200 77  TC-ID-2-SW                  PIC X       VALUE "N".
009300 77  TC-ID-3-SW                  PIC X       VALUE "N".
009400 77  TC-ID-4-SW                  PIC X       VALUE "N".
009500 77  TC-ID-5-SW                  PIC X       VALUE "N".
009600 77  TC-ID-6-SW                  PIC X       VALUE "N".
009700 77  CLASS-CHG-SW                PIC X       VALUE "N".
009800 77  LOC1-SAVE                   PIC S9(8)   COMP-4.
009900 77  LOC2-SAVE                   PIC S9(8)   COMP-4.
010000 77  LOC3-SAVE                   PIC S9(8)   COMP-4.
010100 77  LOC4-SAVE                   PIC S9(8)   COMP-4.
010200 77  LOC5-SAVE                   PIC S9(8)   COMP-4.
010300 77  LOC6-SAVE                   PIC S9(8)   COMP-4.
010400 77  TOTAL-LOCS-SAVE             PIC 9(8)   VALUE ZEROS.
010500 77  LOC-DIFF-SAVE               PIC 9(8)   VALUE ZEROS.
010600 77  CONV-FACTOR-SAVE            PIC 9(6)V9(4).
010700 77  OLD-ONHAND-SAVE             PIC S9(8)  VALUE ZEROS.
010800 77  OLD-CLASS-SAVE              PIC X(3)   VALUE SPACES.
010900 77  UM-CHECK                    PIC XX     VALUE SPACES.
       77  SAVE-PDER-SW                PIC X.
       77  RESTRICT-TYPE               PIC X(1)   VALUE SPACES.
       77  RET-CODE                    PIC X(2)   VALUE "00".
       77  ALT-KEY-ARG                 PIC X(40).
       77  ALT-CORP-CODE               PIC X(8).
       77  BASE-TALTKEY                PIC X(20).

      *---4/15/97, JSB HOLDING AREA FOR FRANCHISERS
       01  FRAN-TABLE.
           05  FRAN-ENTRY OCCURS 4 TIMES INDEXED BY FRAN-IDX.
               10  FRAN-ID             PIC X(1).
               10  FRAN-NAME           PIC X(4).
               10  FRAN-VEN0CODE       PIC X(10).
       01  BIN-SUB               PIC 9.
       01  ERROR-FLAG            PIC X(1).
           88  ERR                          VALUE "Y".
           88  NOERR                        VALUE "N".
       01  OLD-FRAN-ID           PIC X(1).

011000 01  NEW-VALUES.
011100     05  NEW-ONHAND        PIC 9(8).
011200     05  NEW-RESERVED      PIC 9(8).
011300     05  NEW-RSRV-ONORDER  PIC 9(8).
011400     05  NEW-MFCST         PIC 9(8).
011500     05  NEW-REORD         PIC 9(8).
011600     05  NEW-MAX           PIC 9(8).
011700     05  NEW-SOQ           PIC 9(8).
011800     05  NEW-EOQ           PIC 9(8).
011900     05  NEW-EXPEDITE      PIC 9(8).
012000     05  NEW-UNPAID        PIC 9(8).
012100     05  NEW-AVGCST        PIC 9(11)V9(4).
012200     05  NEW-STDCST        PIC 9(11)V9(4).
012300     05  NEW-MKTCST        PIC 9(11)V9(4).
012400     05  NEW-PREVAVG       PIC 9(11)V9(4).
012500     05  NEW-UM1-CF        PIC 9(6)V9(4).
012600     05  NEW-UM2-CF        PIC 9(6)V9(4).
012700
012800
012900*** SPOCDESC PARMS ***
013000 01  PO-DESC-PARMS.
013100     05 PODESC-COMPANY-SAVE        PIC X(3)  VALUE SPACES.
013200     05 SAVE-MANUFACTURER-DESC     PIC X(26) VALUE SPACES.
013300
013400*****************************
013500**  PARAMETERS FOR CALLING
013600**  'SONORDER'
013700*****************************
013800 COPY SONORDER IN COPYLIB.

       01  NEW-CODE                  PIC X(08)    VALUE SPACES.
014200
014300 01  MESSAGE-BUFFER.
014400     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
014500     05  MSG-FLD               PIC X(10)    VALUE SPACE.
014600     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZZZ9.
014700 01  REORD-MSG.
014800     05  MSG-REORD-TEXT        PIC X(42).
014900     05  MSG-REQ-NO            PIC X(6).
015000     05  MSG-REQ-STAT-MSG      PIC X(12).
015100     05  MSG-REQ-STAT.
015200         10  MSG-PO-LIT        PIC X(9).
015300         10  MSG-REQ-PO-NUM    PIC X(10).
015400
015900 01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.
016000
016100 01  SCREEN-PRINT-PARMS.
016200     05  PRINTCNTL             PIC S9(4)    VALUE 0     COMP-4.
016300     05  PAGECNTL              PIC S9(4)    VALUE 49    COMP-4.
016400     05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".
016500
016600 01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS COMP-4.
016700
016800 01  WHO-VARIABLES.
016900     05  MOD                      PIC S9(4) COMP.
017000     05  CAP                      PIC S9(8) COMP.
017100     05  LATTR                    PIC S9(8) COMP.
017200     05  USERNAME                 PIC X(8).
017300     05  GRPNAME                  PIC X(8).
017400     05  ACCTNAME                 PIC X(8).
017500     05  HOMEGRP                  PIC X(8).
017600     05  TNUM                     PIC 99 COMP VALUE 0.
017700     05  FILLER                   PIC XX.
017800
017900 01  SEARCH-DEPT.
018000     05  SEARCH-IDENTIFIER       PIC X(2)  VALUE "DP".
018100     05  DEPARTMENT.
018200         10  DEPT-1-4            PIC X(4)      VALUE SPACES.
018300         10  FILLER              PIC X(4)      VALUE SPACES.
018400
018500 01  SEARCH-EXPENSE.
018600     05  FILLER                  PIC X(2)      VALUE "EC".
018700     05  EXPENSE-CLASS           PIC X(6)      VALUE SPACES.
018800     05  FILLER                  PIC X(2)      VALUE SPACES.
018900
019000 01  SEARCH-NEW-WORK.
019100     05  FILLER                  PIC X(2)      VALUE "NW".
019200     05  NEW-WORK                PIC X(6)      VALUE SPACES.
019300     05  FILLER                  PIC X(2)      VALUE SPACES.
019400
019500 01  BUILD-COMMENT-NO.
019600     05  BUILD-COM-PREFIX     PIC X     VALUE "C".
019700     05  BUILD-COM-NO         PIC X(3)  VALUE SPACES.
019800
019900 01  BUILD-TAX-CODE.
020000     05  FILLER               PIC X(2)  VALUE "T ".
020100     05  BUILD-TAX-NO         PIC X(2)  VALUE SPACES.
020200
020300 COPY DDAILYTC IN COPYLIB.
020400 COPY TC300    IN COPYLIB.
020500 COPY TC301    IN COPYLIB.
020600 COPY TC311    IN COPYLIB.
020700 COPY TC334    IN COPYLIB.
020800 COPY TC411    IN COPYLIB.
020900
021000 COPY DDESC    IN COPYLIB.
021100
021200 COPY DPOITEM  IN COPYLIB.
021300
021400 COPY DREQD    IN COPYLIB.
021500
021600 COPY DWLITEM  IN COPYLIB.
021700
       COPY MCLASS   IN COPYLIB.

       COPY MPLT0    IN COPYLIB.

       COPY MPLTPDER IN COPYLIB.

       COPY MPLTFRAN IN COPYLIB.

022200 COPY MREQ     IN COPYLIB.
022300
022400 COPY MSTORERM IN COPYLIB.
025900
026000 COPY DBSTAT   IN COPYLIB.
026100
026700 01 ARG-VALUES.
026800     05  CODE-ARG               PIC X(8)  VALUE SPACES.
026900     05  REQ-ARG                PIC X(12) VALUE SPACES.
027000     05  BUYER-ARG              PIC X(4)  VALUE SPACES.
027100     05  UM-ARG                 PIC XX    VALUE SPACES.
027200     05  COMMENT-ARG            PIC X(4)  VALUE SPACES.
027300     05  TAX-ARG                PIC X(2)  VALUE SPACES.
027400     05  PLT-ARG                PIC X(4)  VALUE SPACES.
027700
027800 01  SCREEN-1.
027900     05  DISP-COMP-1    PIC X(3).
028000     05  DE-CODE-ENTRY  PIC X(12).
           05  DE1-COMMAND-LINE PIC X(79).
           05  DE1-MESSAGE-LINE PIC X(79).
028100
028200 01  SCREEN-2.
028300     05  STORERM-BUFF.
028400         10  DISP-COMP-2        PIC X(3).
028500         10  DISP-CORP-CODE     PIC X(7).
028600         10  DE-PREV-CODE       PIC X(12).
028700         10  DE-AUTHOR          PIC X(10).
028800         10  DISP-KEY-ADJ       PIC X(50).
028900         10  DE-CLASS           PIC X(3).
029000         10  DE-DFLT-DEPT       PIC X(6).
029100         10  DE-DIR-CHRG        PIC X(4).
029200         10  DE-AVG-COST        PIC 9(11)V9(4).
029300         10  DE-MKT-COST        PIC 9(11)V9(4).
029400         10  DE-STD-COST        PIC 9(11)V9(4).
029500         10  DE-EXPENSE-CLASS   PIC X(6).
029600         10  DISP-ONHAND        PIC -(8)9.
029700         10  DE-MAX             PIC 9(8).
029800         10  DE-MAX-X REDEFINES DE-MAX
029900                                PIC X(8).
030000         10  DE-MAINT           PIC X(1).
030100         10  DE-STOCK-OT        PIC X(1).
030200         10  DE-REORDER         PIC 9(8).
030300         10  DE-REORDER-X REDEFINES DE-REORDER
030400                                PIC X(8).
030500         10  DE-INS-ITM         PIC X(1).
030600         10  DE-IMPORT          PIC X(1).
030700         10  DE-EXPEDITE        PIC 9(8).
030800         10  DE-EXPEDITE-X REDEFINES DE-EXPEDITE
030900                                PIC X(8).
031000         10  DE-OUT-REP         PIC X(1).
031100         10  DE-ORD-ENG         PIC X(1).
031200         10  DE-SOQ             PIC 9(8).
031300         10  DE-SOQ-X REDEFINES DE-SOQ
031400                                PIC X(8).
031500         10  DE-WR-DOWN         PIC X(1).
031600         10  DE-CONSIGNMENT     PIC X(1).
               10  DE-SARA-REPORTABLE PIC X(1).
               10  DE-RESTRICTED-FLG  PIC X(1).
               10  DE-REQ-CHG-OVERRD  PIC X(1).
031700         10  DE-DISB-INSTR      PIC X(30).
031800         10  DE-LOC-DESC        PIC X(50).
031900         10  DE-UM              PIC X(2).
032000         10  DE-UM1             PIC X(2).
032100         10  DE-UM1-CF          PIC 9(6)V9(4).
032200         10  DE-UM2             PIC X(2).
032300         10  DE-UM2-CF          PIC 9(6)V9(4).
032400         10  DE-HIGH-USAGE-AREAS.
032500             15  DE-HU-AREA     PIC X(2) OCCURS 6 TIMES.
032600         10  DE-PHY-INV-CYL     PIC X(4).
032700         10  DE-EST-LT          PIC 9(4).
032800         10  DE-BUYER-CODE      PIC X(4).
032900         10  DE-STD-INST-AREA.
033000             15  DE-SNGL-INST   PIC X(3) OCCURS 4 TIMES.
033100         10  DE-TAX-CODE        PIC X(2).
033200         10  DE-TAX-PCT         PIC 9(2)V9(2).
               10  DE-AUTH-FLAG       PIC X.
               10  DE-RCV-STD-INST-AREA.
                   15  DE-RCV-INST    PIC X(3) OCCURS 4 TIMES.
               10  DE-FRAN-ID         PIC X(1).
               10  DE-FRAN-NAME       PIC X(4).
               10  DE-QS9000-TRACK    PIC X(1).
               10  DE-EARLY-DAYS      PIC 9(4).
               10  DE-LATE-DAYS       PIC 9(4).
               10  DE2-COMMAND-LINE   PIC X(79).
               10  DE2-MESSAGE-LINE   PIC X(79).
033300
033400 01  SCREEN-3.
033500     05  DISP-COMP-3              PIC X(3).
033600     05  DISP-CORP-CODE-3         PIC X(7).
033700     05  DISP-OLD-UM              PIC X(2).
033800     05  DISP-NEW-UM              PIC X(2).
033900     05  DE-CONV-FACTOR           PIC 9(6)V9(4).
034000     05  DISP-OLD-ONHAND          PIC ZZZZZZZ9.
034100     05  DISP-NEW-ONHAND          PIC ZZZZZZZ9.
034200     05  DISP-PO-MSG1             PIC X(32).
034300     05  DISP-OLD-MAX             PIC ZZZZZZZ9.
034400     05  DISP-NEW-MAX             PIC ZZZZZZZ9.
034500     05  DISP-PO-MSG2             PIC X(32).
034600     05  DISP-OLD-REORD           PIC ZZZZZZZ9.
034700     05  DISP-NEW-REORD           PIC ZZZZZZZ9.
034800     05  DISP-PO-MSG3             PIC X(32).
034900     05  DISP-OLD-EXPEDITE        PIC ZZZZZZZ9.
035000     05  DISP-NEW-EXPEDITE        PIC ZZZZZZZ9.
035100     05  DISP-PO-MSG4             PIC X(32).
035200     05  DISP-OLD-SOQ             PIC ZZZZZZZ9.
035300     05  DISP-NEW-SOQ             PIC ZZZZZZZ9.
035400     05  DISP-PO-MSG5             PIC X(31).
035500     05  DISP-OLD-AVGCOST         PIC Z(10)9.9(4).
035600     05  DISP-NEW-AVGCOST         PIC Z(10)9.9(4).
035700     05  DISP-PO-MSG6             PIC X(31).
035800     05  DISP-OLD-MKTCOST         PIC Z(10)9.9(4).
035900     05  DISP-NEW-MKTCOST         PIC Z(10)9.9(4).
036000     05  DISP-OLD-UM1-CF          PIC ZZZZZ9.9(4).
036100     05  DISP-NEW-UM1-CF          PIC ZZZZZ9.9(4).
036200     05  DISP-OLD-UM2-CF          PIC ZZZZZ9.9(4).
036300     05  DISP-NEW-UM2-CF          PIC ZZZZZ9.9(4).
036400     05  DISP-OLD-LOC1            PIC ZZZZZZZ9.
036500     05  DISP-NEW-LOC1            PIC ZZZZZZZ9.
036600     05  DISP-OLD-LOC2            PIC ZZZZZZZ9.
036700     05  DISP-NEW-LOC2            PIC ZZZZZZZ9.
036800     05  DISP-OLD-LOC3            PIC ZZZZZZZ9.
036900     05  DISP-NEW-LOC3            PIC ZZZZZZZ9.
037000     05  DISP-OLD-LOC4            PIC ZZZZZZZ9.
037100     05  DISP-NEW-LOC4            PIC ZZZZZZZ9.
037200     05  DISP-OLD-LOC5            PIC ZZZZZZZ9.
037300     05  DISP-NEW-LOC5            PIC ZZZZZZZ9.
037400     05  DISP-OLD-LOC6            PIC ZZZZZZZ9.
037500     05  DISP-NEW-LOC6            PIC ZZZZZZZ9.
037600     05  DISP-INST-MSG            PIC X(78).
           05  DE3-COMMAND-LINE         PIC X(79).
           05  DE3-MESSAGE-LINE         PIC X(79).
037700

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.

037800*01  UM-CHANGE-MSG.
037900*    05  FILLER  PIC X(19) VALUE "PRESS ENTER IF NEW ".
038000*    05  FILLER  PIC X(20) VALUE "VALUES ARE CORRECT E".
038100*    05  FILLER  PIC X(20) VALUE "LSE CHANGE CONVERSIO".
038200*    05  FILLER  PIC X(18) VALUE "N AND PRESS ENTER ".
038300
038400 01  PO-MSG1.
038500     05  PO-MSG1-TEXT1             PIC X(4) VALUE "PO #".
038600     05  FILLER                    PIC X(1) VALUE SPACES.
038700     05  PO-NUM-OUT                PIC X(7) VALUE SPACES.
038800     05  FILLER                    PIC X(1) VALUE SPACES.
038900     05  RLS-NUM-OUT               PIC X(3) VALUE SPACES.
039000     05  FILLER                    PIC X(2) VALUE SPACES.
039100     05  PO-MSG1-TEXT2             PIC X(6) VALUE "ITEM #".
039200     05  FILLER                    PIC X(1) VALUE SPACES.
039300     05  ITEM-NUM-OUT              PIC ZZZ9 VALUE ZEROES.
039400     05  FILLER                    PIC X(3) VALUE SPACES.
039500
039600*01  PO-MSG2.
039700*    05  FILLER  PIC X(20) VALUE "USES THE OLD STR UM.".
039800*    05  FILLER  PIC X(12) VALUE " THE OLD STR".
039900*
040000*01  PO-MSG3.
040100*    05  FILLER  PIC X(20) VALUE "UM HAS BEEN ASSIGNED".
040200*    05  FILLER  PIC X(11) VALUE " AS AN ALT.".
040300*
040400*01  PO-MSG4.
040500*    05  FILLER  PIC X(17) VALUE "UNIT OF MEASURE :".
040600
040700 01  PO-MSG5.
040800     05  PO-MSG5-TEXT1             PIC X(3) VALUE "UM1".
040900     05  FILLER                    PIC X(1) VALUE SPACES.
041000     05  UM1-OUT                   PIC X(2) VALUE SPACES.
041100     05  FILLER                    PIC X(2) VALUE SPACES.
041200     05  PO-MSG5-TEXT2             PIC X(11) VALUE "CONV FACTOR".
041300     05  FILLER                    PIC X(1) VALUE SPACES.
041400     05  CONV1-FACT-OUT            PIC ZZZZZ9.9(4) VALUE ZEROES.
041500
041600 01  PO-MSG6.
041700     05  PO-MSG6-TEXT1             PIC X(3) VALUE "UM2".
041800     05  FILLER                    PIC X(1) VALUE SPACES.
041900     05  UM2-OUT                   PIC X(2) VALUE SPACES.
042000     05  FILLER                    PIC X(2) VALUE SPACES.
042100     05  PO-MSG6-TEXT2             PIC X(11) VALUE "CONV FACTOR".
042200     05  FILLER                    PIC X(1) VALUE SPACES.
042300     05  CONV2-FACT-OUT            PIC ZZZZZ9.9(4) VALUE ZEROES.
042400
042500 01 SUB-AREA    COMP-4.
042600     05  SUB              PIC 99      VALUE 0.
042700     05  SUB2             PIC S9(4)   VALUE ZEROS.
043100
043200 COPY TDATECHK IN COPYLIB.
       COPY TRSHIFT  IN COPYLIB.
043700
043800**************************************************************
043900**                                                          **
044000**               K S A M   W O R K                          **
044100**                                                          **
044200**************************************************************
044300
045000 01  USAGE-REC.
045100     05  FILLER                   PIC XX.
045200     05  K-CORP-CODE              PIC X(8).
045300     05  K-MONTHS                 OCCURS 14 TIMES.
045400         10  K-MTH-USAGE          PIC S9(9) COMP-4.
045300     05  K-MONTHS-DD              OCCURS 14 TIMES.
045400         10  K-MTH-USAGE-DD       PIC S9(9) COMP-4.
045500
046600
046700 COPY TBLOWUP IN COPYLIB.
046800
       01  LDA.
           05  FILLER                   PIC X(107).
           05  SC-CURRENT-TRAN          PIC X(4).
           05  FILLER                   PIC X(401).
046900
047000 LINKAGE SECTION.
047100
047200 01  BASE                PIC X(10).
047300
047400 COPY VCOMLINK IN COPYLIB.
047500
047600 01  PASS-CORP-CODE      PIC X(8).
047700
047800 01  PASS-COMPANY-CODE   PIC X(3).
047900
048000 COPY LANGSUB IN COPYLIB.
048100
048200 PROCEDURE DIVISION USING BASE,
048300                          VIEW-COMAREA,
048400                          PASS-CORP-CODE,
048500                          PASS-COMPANY-CODE,
048600                          LANGUAGE-PARMS.
048700
048800 MODIFY-CODE SECTION 05.
       BEGIN-HERE.
           MOVE "N" TO EDIT-ERR-SW, EOJ-SW, CHANGING-STOREROOM-UM-SW,
               REORD-MSG-SW, TC-ID-1-SW, TC-ID-2-SW, TC-ID-3-SW,
               TC-ID-4-SW, TC-ID-5-SW, TC-ID-6-SW, CLASS-CHG-SW.
           MOVE SPACES TO PO-SW, WO-SW, OLD-CLASS-SAVE, UM-CHECK,
               NEW-CODE, DEPARTMENT, EXPENSE-CLASS, NEW-WORK,
               BUILD-COM-NO, BUILD-TAX-NO, ARG-VALUES.
           MOVE ZEROES TO TOTAL-LOCS-SAVE, LOC-DIFF-SAVE,
               OLD-ONHAND-SAVE.
           OPEN INPUT MVALIDUM-I, MPLTINFO-I, MVALIDPLTDATA-I,
                      DWLITEM-I, MBUYER-I, MCOMMENT-I, MTAX-I, MREQ-I,
                      DREQD-I, DPOITEM-I, MCLASS-I.
           OPEN I-O DISPLAY-FILE, MSTORERM-O, DDESC-O, DDAILYTC-O,
                    USAGEFIL.
048900
049000*-------- THE "WHO" INTRINSIC IS USED TO FIND OUT USER AND
049100*-------- ACCT NAME.  THE ONLY PURPOSE FOR THIS CALL IS TO KNOW
049200*-------- WHETHER THE USE OF THE 'f6' KEY (GENERATE COMPARE
049300*-------- RECORD) IS AUTHORIZED (MGR.CME ONLY).
049400     CALL "WHO" USING MOD, CAP, LATTR,
049500       USERNAME, GRPNAME, ACCTNAME, HOMEGRP, TNUM.
049600
           MOVE "Y"                      TO  SAVE-PDER-SW.
           MOVE "PDER"                   TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "Y"                  TO   SAVE-PDER-SW
           ELSE
           MOVE MPLTINFO-PDER-SW         TO   SAVE-PDER-SW.

      *-----4/15/97 JSB, GET VALID FRANCHISERS
           MOVE "FRAN"                   TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE SPACES               TO   FRAN-TABLE
           ELSE
           MOVE MPLTINFO-FRANCHISES      TO   FRAN-TABLE.

      *-----01/12/98 JSB, RETRIEVE *LDA TO FIND ORIGINATING
      *----  GLOBAL MENU TRANSACTION.  IF MENU TRANSACTIONS IS
      *----  MP1I, THEN PROTECT FIELDS THAT ISC MAT. CONTROL
      *----  USERS SHOULD NOT CHANGE.  SET UP FOR DANVILLE FOR
      *----  FRANCHISE USERS.
           ACCEPT LDA FROM LOCAL-DATA-AREA.

049700     PERFORM 6-MAIN  THRU  6-M-X.
049800
           CLOSE MVALIDUM-I, MPLTINFO-I, MVALIDPLTDATA-I,
                 DWLITEM-I, MBUYER-I, MCOMMENT-I, MTAX-I, MREQ-I,
                 DREQD-I, DPOITEM-I, USAGEFIL, MCLASS-I,
                 DISPLAY-FILE, MSTORERM-O, DDESC-O, DDAILYTC-O.
049900     GOBACK.
050000
050100*********************************************
050200*                                           *
050300*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
050400*  FATAL ERROR OCCURS                       *
050500*                                           *
050600*********************************************
050700
050800 2-BLOWUP.
050900     MOVE "TPLTMAS3"              TO  BU-PGM-NAME.
051000     MOVE CODE-ARG                TO  BU-DISPLAY-FLD (1).
051100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
051200         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
051300                 BU-DISPLAY-FLDS.
051400
051500 2-BLOWUP-X.
051600     EXIT.
054500
054600 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER), IND (99).
           MOVE MESSAGE-BUFFER TO DE1-MESSAGE-LINE,
                                  DE2-MESSAGE-LINE,
                                  DE3-MESSAGE-LINE.
055400
055500 4-PGM-ERROR-X.
055600     EXIT.
057600
057700 4-DBGET-MVALIDUM.
057800     MOVE "N"                     TO EDIT-ERR-SW.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           START MVALIDUM-I KEY = VALIDUM OF MVALIDUM-REC-I
               INVALID KEY MOVE "2" TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
058500***          INVALID UNIT OF MEASURE
058600             MOVE   9 TO LANG-SETNUM
058700             MOVE  12 TO LANG-MSGNUM
058800             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
059000             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
059100             MOVE "Y"             TO  EDIT-ERR-SW
059200     ELSE
059300         MOVE "GET MVALIDUM *4-DM"  TO  BU-DISPLAY-MSG
059400         GO TO 2-BLOWUP.
059500
059600 4-DGU-X.
059700     EXIT.
059800
059900 4-DBPUT-DDAILYTC.
           WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
060200 4-DDT-X.
060300     EXIT.
060400
063300****************************************
063400*                                      *
063500*    6  M A I N                        *
063600*                                      *
063700****************************************
063800
063900 6-MAIN.
064000     IF PASS-CORP-CODE  =  SPACES
064100         PERFORM 61-WRITE-FIRST-SCREEN THRU 61-WFS-X
064200     ELSE
064300         MOVE PASS-CORP-CODE    TO  DE-CODE-ENTRY,
064400                                    CODE-ARG.
064500     IF EOJ-SW = "Y"
064600         GO TO 6-M-X.
064700     PERFORM 62-UPDATE-CORP-CODE THRU 62-UCC-X.
064800     IF PASS-CORP-CODE  NOT = SPACES
064900         MOVE "Y"  TO  EOJ-SW.
065000     IF EOJ-SW = "Y"
065100         GO TO 6-M-X.
065200     GO TO 6-MAIN.
065300
065400 6-M-X.
065500     EXIT.
065600
065700*****************************************
065800*                                       *
065900*    WRITE SCREEN 1 WHICH IS THE CORP   *
066000*    CODE ENTRY SCREEN. THEN CHECK FOR  *
066100*    VALID CORP CODE AND FOR ANY WORK   *
066200*    SHEETS                             *
066300*                                       *
066400*****************************************
066500
066600 61-WRITE-FIRST-SCREEN.
066700     MOVE "PLTMAST1"  TO  VIEW-NFNAME.
067300     MOVE SPACES  TO  SCREEN-1.
067400     MOVE PASS-COMPANY-CODE  TO  DISP-COMP-1
067500                                 PODESC-COMPANY-SAVE.
069000
069100 61-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
070800
070900     IF VIEW-LASTKEY = 3
071000         MOVE "Y"  TO  EOJ-SW
071100         GO TO 61-WFS-X
071200     ELSE
072500     IF VIEW-LASTKEY = 1 OR
072600        VIEW-LASTKEY = 2 OR
072700        VIEW-LASTKEY = 4 OR
072800        VIEW-LASTKEY = 5 OR
072900        VIEW-LASTKEY = 6 OR
073000        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
073200***      INVALID FUNCTION KEY
073300         MOVE   9 TO LANG-SETNUM
073400         MOVE  10 TO LANG-MSGNUM
073500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
073700         MOVE 2  TO  FIELD-NUMBER
073800         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
073900         GO TO 61-SHOWFORM-SCREEN-1.

      *-------- FIELD EDITS
           IF DE-CODE-ENTRY = SPACES
      *         YOU MUST ENTER A CORPORATE CODE
               MOVE 66170 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 2  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 61-SHOWFORM-SCREEN-1.
075900
      *-----------------------------------------------------------*
      *  10/18/94           C A ZUBEK                             *
      *  LOGIC TO CALL THE SUBROUTINE "TALTKEY" TO SEE IF USER    *
      *  ENTERED AN ALTERNATE KEY.  IF SO, THE CORPORATE CODE     *
      *  WILL BE RETURNED.                                        *
      *-----------------------------------------------------------*

           MOVE DE-CODE-ENTRY           TO ALT-KEY-ARG.
           CALL "TALTKEY" USING RET-CODE,
                                BASE-TALTKEY,
                                STATUS-AREA,
                                ALT-KEY-ARG,
                                ALT-CORP-CODE.
           MOVE ALT-CORP-CODE           TO CODE-ARG.
           IF RET-CODE NOT EQUAL "00"
               MOVE "TALTKEY ERROR 62-UCC" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
           MOVE ALT-CORP-CODE             TO CODE-ARG.

           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
076400     IF FILE-STATUS NOT = "00"
076500         IF FILE-STATUS-1 = "2"
076600***          STORES CODE DOES NOT EXIST
076700             MOVE  19 TO LANG-SETNUM
076800             MOVE   9 TO LANG-MSGNUM
076900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
077100             MOVE CODE-ARG  TO  MSG-FLD
077200             MOVE 2         TO  FIELD-NUMBER
077300             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
077400             GO TO 61-SHOWFORM-SCREEN-1
077500         ELSE
077600             MOVE "DBGET 61-GET-CODE" TO BU-DISPLAY-MSG
077700             GO TO 2-BLOWUP.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-REC-O.
           START MSTORERM-O KEY > CORPCDE OF MSTORERM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
077800
077900 61-WFS-X.
078000     EXIT.
078100
078200*********************************************
078300*                                           *
078400*    UPDATE CORP CODE SECTION               *
078500*                                           *
078600*********************************************
078700*                                           *
079400
079500 62-UPDATE-CORP-CODE.
080000     MOVE "PLTMAST2"           TO  VIEW-NFNAME.
080300
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
076400     IF FILE-STATUS NOT = "00"
082000         MOVE "DBGET 62-UPDATE-CORP-CODE" TO BU-DISPLAY-MSG
082100         GO TO 2-BLOWUP.

      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-REC-O.
           START MSTORERM-O KEY > CORPCDE OF MSTORERM-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
082200
082300     MOVE SPACES            TO SCREEN-2.
082400     MOVE PASS-COMPANY-CODE TO DISP-COMP-2.
082500     MOVE CORP-CODE         TO DISP-CORP-CODE.
082600     MOVE STR-ONHAND        TO DISP-ONHAND.
082700
082800 62-MOVE-AND-WRITE-DATA.
082900     MOVE STR-PREV-CODE   TO     DE-PREV-CODE.
083000     MOVE STR-AUTHOR      TO     DE-AUTHOR.
083100     MOVE STR-CLASS       TO     DE-CLASS.
083200     MOVE STR-DFLT-DEPT   TO     DE-DFLT-DEPT.
083300     MOVE STR-DIR-CHRG-DEPT TO   DE-DIR-CHRG.
083400     MOVE STR-AVG-COST    TO     DE-AVG-COST.
083500     MOVE STR-MKT-COST    TO     DE-MKT-COST.
083600     MOVE STR-STD-COST    TO     DE-STD-COST.
083700     MOVE STR-EXPENSE-CLASS TO   DE-EXPENSE-CLASS.
083800
083900     MOVE STR-MAX               TO     DE-MAX.
084400     MOVE STR-MAINT             TO     DE-MAINT.
084500     MOVE STR-STOCK-OT          TO     DE-STOCK-OT.
084700     MOVE STR-REORDER           TO     DE-REORDER.
085200     MOVE STR-INS-ITM           TO     DE-INS-ITM.
085300     MOVE STR-IMPORT-IND        TO     DE-IMPORT.
085500     MOVE STR-EXPEDITE          TO     DE-EXPEDITE.
086000     MOVE STR-OUT-REP           TO     DE-OUT-REP.
086100     MOVE STR-ORD-ENG           TO     DE-ORD-ENG.
086300     MOVE STR-SOQ               TO     DE-SOQ.
086800     MOVE STR-WR-DOWN           TO     DE-WR-DOWN.
086900     MOVE STR-CONS-IND          TO     DE-CONSIGNMENT.
           MOVE STR-SARA-REPORTABLE   TO     DE-SARA-REPORTABLE.
087000     MOVE STR-RESTRICTED-FLG    TO     DE-RESTRICTED-FLG.
087000     MOVE STR-REQ-CHG-OVERRD    TO     DE-REQ-CHG-OVERRD.
087000     MOVE STR-DISB-INSTR        TO     DE-DISB-INSTR.
087100     MOVE STR-UM                TO     DE-UM.
087200     MOVE STR-UM1               TO     DE-UM1.
087300     MOVE STR-UM1-CF            TO     DE-UM1-CF.
087400     MOVE STR-UM2               TO     DE-UM2.
087500     MOVE STR-UM2-CF            TO     DE-UM2-CF.
087600     MOVE STR-HIGH-USAGE        TO     DE-HIGH-USAGE-AREAS.
087700     MOVE STR-PHY-INV-CYL       TO     DE-PHY-INV-CYL.
087800     MOVE STR-EST-LT            TO     DE-EST-LT.
087900     MOVE STR-BUYER             TO     DE-BUYER-CODE.
088000     MOVE STR-STD-INST          TO     DE-STD-INST-AREA.
088100     MOVE STR-TAX-CODE          TO     DE-TAX-CODE.
088200     MOVE STR-TAX-PERCENT       TO     DE-TAX-PCT.
           MOVE STR-AUTH-FLAG         TO     DE-AUTH-FLAG.
           MOVE STR-RCV-STD-INST      TO     DE-RCV-STD-INST-AREA.
      *------4/15/97 JSB, ADD FRANCHISE ID AND NAME
           MOVE STR-CODE-OWNER        TO     DE-FRAN-ID
                                             OLD-FRAN-ID.
           SET FRAN-IDX TO 1.
           IF STR-CODE-OWNER NOT = SPACES
               SEARCH FRAN-ENTRY
                  AT END
                      MOVE SPACES TO DE-FRAN-NAME
                  WHEN FRAN-ID (FRAN-IDX) = STR-CODE-OWNER
                      MOVE FRAN-NAME(FRAN-IDX) TO DE-FRAN-NAME
           ELSE
               MOVE SPACES TO DE-FRAN-NAME.
           MOVE STR-QS9000-TRACK      TO     DE-QS9000-TRACK.
           IF STR-QS9000-EARLY-DAYS NOT NUMERIC
               MOVE ZERO              TO     DE-EARLY-DAYS
           ELSE
               MOVE STR-QS9000-EARLY-DAYS TO DE-EARLY-DAYS.
           IF STR-QS9000-LATE-DAYS NOT NUMERIC
               MOVE ZERO              TO     DE-LATE-DAYS
           ELSE
               MOVE STR-QS9000-LATE-DAYS  TO DE-LATE-DAYS.
088300
088400 62-IS-THERE-LOC-DESC.
089100     MOVE SPACES TO DE-LOC-DESC, DESC-DATA, DISP-KEY-ADJ,
                          BUF-DDESC.
089400
089500 62-GET-KEYWORD-ADJ.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-O.
           MOVE "00" TO DESCIDNUM OF DDESC-REC-O.
           READ DDESC-O INTO BUF-DDESC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
089900         MOVE "GET 62-GET-KEYWORD-ADJ" TO BU-DISPLAY-MSG
090000         GO TO 2-BLOWUP
           ELSE
090100         MOVE DESC-KWM  TO  DISP-KEY-ADJ.
090200
090300 62-GET-LOCAL-DESC.
           MOVE SPACES  TO BUF-DDESC.
           MOVE "99" TO DESCIDNUM OF DDESC-REC-O.
           READ DDESC-O INTO BUF-DDESC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
091600         MOVE "GET 62-GET-LOCAL-DESC" TO BU-DISPLAY-MSG
091700         GO TO 2-BLOWUP
           ELSE
090900         MOVE DESC-DATA TO DE-LOC-DESC.
091800
           MOVE HIGH-VALUES TO CORPCDE OF DDESC-REC-O.
           START DDESC-O KEY > CORPCDE OF DDESC-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

091900 62-PUT-BUFFER-2.
092600     MOVE SPACES  TO  REORD-MSG-SW.
092700
092800 62-SHOWFORM-SCREEN-2.
      *------IF FRANCHISERS, THEN DISPLAY FRANCHISER FIELD
           IF FRAN-TABLE NOT = SPACES
              MOVE B"1" TO IND(90).
      *------IF CODE IS FRANCHISE CODE THEN PROTECT MKT COST
           IF STR-CODE-OWNER NOT = SPACES
              MOVE B"1" TO IND(95).
           MOVE SCREEN-2       TO DISPLAY-REC.
      *------IF ORIGINATING GLOBAL TRANSATION IS MP1I, THEN
      *------  PROTECT STD COST, MKT COST, AND QS9000 FIELDS.
           IF SC-CURRENT-TRAN = "MP1I"
              MOVE B"1" TO IND(96).
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
094500
095300     IF VIEW-LASTKEY = 3
095400         MOVE "Y"  TO  EOJ-SW
095500         GO TO 62-UCC-X
095600     ELSE
095700     IF VIEW-LASTKEY = 7
095800         GO TO 62-UCC-X
096300     ELSE
097600     IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
097900        VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 8
098100***      INVALID FUNCTION KEY
098200         MOVE   9 TO LANG-SETNUM
098300         MOVE  10 TO LANG-MSGNUM
098400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
098600         MOVE 2  TO  FIELD-NUMBER
098700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
098800         GO TO 62-SHOWFORM-SCREEN-2.
098900
172800 62-PROCESS-SCREEN.
172900***  NOW PROCESSING
173000     MOVE  14 TO LANG-SETNUM.
173100     MOVE   2 TO LANG-MSGNUM.
173200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE B"1" TO IND (98).
           MOVE MESSAGE-BUFFER TO DE2-COMMAND-LINE.
           MOVE SCREEN-2 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-AUTO-READ-SCREEN.

228200*******************************************
228300*                                         *
228400*  LOCK MSTORERM AND DDESC AT ITEM LEVEL  *
228700*                                         *
228800*******************************************
228900
229000 62-GET-LOCK-MSTORERM-DDESC.
229800
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-O.
           READ MSTORERM-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
231400         MOVE "62-GET-LOCK-MSTORERM-DDESC" TO BU-DISPLAY-MSG
231500         GO TO 2-BLOWUP.
231600
231700*******************************************
231800*                                         *
231900*  CHECK WHICH FIELDS CHANGED AND SET THE *
232000*  THE CORRESPONDING TC-ID-SW SO THAT YOU *
232100*  CAN LATER CUT THE APPROPRIATE TC-ID    *
232200*  LATER                                  *
232300*                                         *
232400*******************************************
232500
232600 62-CHECK-WHICH-DATA-CHANGED.
234200
234300******************************************
234400**                                      **
234500**  NOTE A TC 311 ID 1 IS NOW BEING     **
234600**  CUT EVERYTIME THE 'ENTER' BUTTON    **
234700**  IS PRESSED REGARDLESS OF WHETHER    **
234800**  OR NOT ANY OF THE FIELDS WERE       **
234900**  CHANGED.                            **
235000**                                      **
235100******************************************
235200
235300     MOVE "Y"  TO  TC-ID-1-SW.
235400
           IF DESC-DATA = DE-LOC-DESC
               MOVE "N"  TO TC-ID-2-SW
           ELSE
               MOVE "Y"  TO TC-ID-2-SW.

      **************************************************
      *                                                *
      *  UPDATE DDESC WITH LOCAL PLANT DESC IF IT HAS  *
      *  BEEN MODIFIED OR WAS JUST ADDED NEW AND HAS   *
      *  NEVER EXISTED BEFORE THIS                     *
      *                                                *
      **************************************************

       62-CHECK-DDESC.
           IF (DESC-ID-NUM = 99)
                   AND (DE-LOC-DESC = DESC-DATA)
               GO TO 62-WRITE-DAILYTC.
           IF (DESC-ID-NUM NOT = 99)
                   AND (DE-LOC-DESC = SPACES)
               GO TO 62-WRITE-DAILYTC.

       62-MODIFY-DDESC.
           MOVE SPACES TO BUF-DDESC.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-O.
           MOVE "99" TO DESCIDNUM OF DDESC-REC-O.
           READ DDESC-O INTO BUF-DDESC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               NEXT SENTENCE
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "READ DDESC *62-MD" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
           IF (DESC-ID-NUM = 99)
                   AND (DE-LOC-DESC = SPACES)
               DELETE DDESC-O
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-DELETE
               IF FILE-STATUS = "00"
                   GO TO 62-WRITE-DAILYTC
               ELSE
                   MOVE "DELETE 62-MODIFY-DDESC" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF (DESC-ID-NUM = 99)
                   AND (DE-LOC-DESC NOT = DESC-DATA)
               MOVE DE-LOC-DESC TO DESC-DATA
               REWRITE DDESC-REC-O FROM BUF-DDESC
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-REWRITE
               IF FILE-STATUS = "00"
                   GO TO 62-WRITE-DAILYTC
               ELSE
                   MOVE "UPDATE 62-MODIFY-DDESC" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF (DESC-ID-NUM NOT = 99)
                   AND (DE-LOC-DESC NOT = SPACES)
               MOVE CORP-CODE TO DESC-CORP-CODE
               MOVE DE-LOC-DESC TO DESC-DATA
               MOVE "99" TO DESC-ID-NUM
               WRITE DDESC-REC-O FROM BUF-DDESC
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-WRITE
               IF FILE-STATUS = "00"
                   GO TO 62-WRITE-DAILYTC
               ELSE
                   MOVE "PUT 62-MODIFY-DDESC" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

264100****************************************************
264200*                                                  *
264300*   UPDATE DDAILYTC WITH ALL THE 311 TC NECESSARY  *
264400*   TO CONVEY ALL CHANGES MADE UP THE FIVE         *
264500*   TC 311's CAN BE CUT ID 1-5. NOW TC 311 ID 1 IS *
264600*   ALWAYS CUT EVEN IT NO VALUES WERE MODIFIED IN  *
264700*   THAT TC                                        *
264800*                                                  *
264900****************************************************
265000
265100 62-WRITE-DAILYTC.
265200     MOVE 1                         TO DATE-MODE.
265300     CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
265400     MOVE DATE-YMD-OUT              TO DDAILYTC-DATE.
265500     ACCEPT DDAILYTC-TIME FROM TIME.
265600     MOVE "311"                     TO DDAILYTC-TC.
265700     MOVE PASS-COMPANY-CODE         TO DDAILYTC-PLT.
265800     MOVE CORP-CODE                 TO TC311-CORP-CODE.
265900
266700***************************
266800*                         *
266900*  TC 311 ID 1            *
267000*                         *
267100***************************
267200
267300 62-CHECK-DATA-ID-1.
267400     IF TC-ID-1-SW = "N"
267500         GO TO 62-CHECK-DATA-ID-2.
267600     MOVE SPACES         TO TC311-TC-DATA.
267700     MOVE "1"            TO TC311-ID-1.
267800     MOVE DE-PREV-CODE   TO TC311-PREV-CODE.
267900     MOVE DE-AUTHOR      TO TC311-AUTHOR.
268000     MOVE DE-CLASS       TO TC311-CLASS.
268100     MOVE DE-DIR-CHRG    TO TC311-DIR-CHRG.
268200     MOVE DE-DFLT-DEPT   TO TC311-DEPT-CHG.
268300     MOVE DE-WR-DOWN     TO TC311-WR-DOWN.
268400     MOVE DE-STOCK-OT    TO TC311-STOCK-OT.
268500     MOVE DE-IMPORT      TO TC311-IMPORT.
268600     MOVE DE-INS-ITM     TO TC311-INS-ITM.
268700     MOVE DE-ORD-ENG     TO TC311-ORD-ENG.
268800     MOVE DE-OUT-REP     TO TC311-OUT-REP.
268900     MOVE DE-MAINT       TO TC311-MAINT.
269000     MOVE STR-LOC (1)    TO TC311-STOCK-LOC.
269100     PERFORM 4-DBPUT-DDAILYTC THRU 4-DDT-X.
269200     IF FILE-STATUS NOT = "00"
269300         MOVE "PUT DDAILYTC TC331-1" TO BU-DISPLAY-MSG
269400         GO TO 2-BLOWUP.
269500
      ***************************
      *                         *
      *  TC 311 ID 2            *
      *                         *
      ***************************

       62-CHECK-DATA-ID-2.
           IF TC-ID-2-SW = "N"
               GO TO 62-UCC-X.
           MOVE SPACES         TO TC311-TC-DATA.
           MOVE "2"            TO TC311-ID-2.
           MOVE DE-LOC-DESC    TO TC311-LOC-DESC.
           PERFORM 4-DBPUT-DDAILYTC THRU 4-DDT-X.
           IF FILE-STATUS NOT = "00"
               MOVE "PUT DDAILYTC TC331-2" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

       62-UCC-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.

       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

312200 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
313800
313900 999-CATREAD-EXIT.
314000     EXIT.
