       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPMDELQ.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-OPEN-QUEUE
                  ASSIGN       TO DATABASE-MCFLMM3901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMDELQ-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PM-OPEN-QUEUE
           LABEL RECORDS       ARE STANDARD.
       01  PMQ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM3901.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  WO-KEY              PIC X(10)  VALUE SPACES.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  TEXT-1          PIC X(70).
           05  TEXT-2          PIC X(70).
           05  TEXT-3          PIC X(70).
           05  TEXT-4          PIC X(70).
           05  TEXT-5          PIC X(70).
           05  TEXT-6          PIC X(70).
           05  TEXT-7          PIC X(70).
           05  TEXT-8          PIC X(70).
           05  TEXT-9          PIC X(70).
           05  TEXT-10         PIC X(70).
           05  RESPONSE.
               10  R1          PIC X(01).
               10  REST        PIC X(09).
           05  SCREEN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  FILE-STAT-TEXT.
           05  FILLER          PIC X(16) VALUE "  FILE-STATUS = ".
           05  FILE-STATUS     PIC X(02) VALUE "00".

           COPY SCREENIO       IN COPYLIB.

       01  PM-QUEUE-DATA.
           COPY DPMOPENQ       IN COPYLIB.

       PROCEDURE DIVISION.
       START-PROCESSING.
           MOVE "VPMDELQ"      TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            PM-OPEN-QUEUE.
           IF FILE-STAT NOT = "00"
               MOVE "****  A FATAL ERROR HAS OCCURED"
                               TO TEXT-3
               MOVE "****  OPEN ON FILE PM-OPEN-QUEUE FAILED"
                               TO TEXT-4
               MOVE "****      FILENAME:  MCFLMM3901"
                               TO TEXT-5
               MOVE FILE-STAT  TO FILE-STATUS
               MOVE FILE-STAT-TEXT
                               TO TEXT-6
               MOVE "PRESS 'ENTER' OR 'F3' KEY TO END PROGRAM."
                               TO TEXT-10
               PERFORM SHOWFORM THRU SHOWFORM-EXIT
               GOBACK.

       START-LOOP.
           MOVE SPACES         TO WO-KEY SCREEN-DATA.
           MOVE "ENTER FULL 10 CHAR. WORKORDER NUMBER"
                               TO TEXT-9.
           MOVE "   Enter blanks to end program."
                               TO TEXT-10.
           PERFORM SHOWFORM    THRU SHOWFORM-EXIT.
           MOVE RESPONSE       TO WO-KEY.
           IF WO-KEY = SPACES  GO TO END-OF-JOB.

           MOVE WO-KEY         TO WONUM OF PM-OPEN-QUEUE.
           READ PM-OPEN-QUEUE  INTO PM-QUEUE-DATA
               INVALID KEY
               MOVE SPACES     TO SCREEN-DATA
               STRING " WORKORDER " WO-KEY " NOT FOUND IN PM QUEUE"
                               DELIMITED BY SIZE
                               INTO TEXT-6
               MOVE
               "READ ERROR - RECORD NOT DELETED FROM PM QUEUE"
                               TO TEXT-7
               MOVE FILE-STAT  TO FILE-STATUS
               MOVE FILE-STAT-TEXT
                               TO TEXT-8
               MOVE "PRESS 'ENTER' KEY TO CONTINUE."
                               TO TEXT-10
               PERFORM SHOWFORM THRU SHOWFORM-EXIT
               GO TO START-LOOP.

       VERIFY-DELETE.
           MOVE SPACES         TO SCREEN-DATA.
           STRING " ****  WORKORDER " WO-KEY
                               DELIMITED BY SIZE
                               INTO TEXT-1
           MOVE " ****  WILL BE DELETED FROM THE PM-OPEN-QUEUE."
                               TO TEXT-2.
           MOVE "WORKORDER   EQUIP.  ZONE  DESCRIPTION"
                               TO TEXT-4.
           MOVE
           "----------  ------  ----  ------------------------------"
                               TO TEXT-5.
           STRING PMQ-WO-NUM "  " PMQ-EQUIP-NUM "  " PMQ-ZONE "  "
                   PMQ-DESCRIPTION
                               DELIMITED BY SIZE
                               INTO TEXT-6.

           MOVE " ARE YOU SURE YOU WANT TO DELETE THIS RECORD?"
                               TO TEXT-9.
           MOVE "  Enter 'Y' to delete record, 'N' to reset."
                               TO TEXT-10.
           PERFORM SHOWFORM    THRU SHOWFORM-EXIT.

           IF R1 = "N" OR "n"  GO TO START-LOOP
           ELSE
           IF R1 = "Y" OR "y"  NEXT SENTENCE
           ELSE
           GO TO VERIFY-DELETE.

           DELETE PM-OPEN-QUEUE
               INVALID KEY
               MOVE SPACES     TO SCREEN-DATA
               MOVE
               "DELETE ERROR - RECORD NOT DELETED FROM PM QUEUE"
                               TO TEXT-7
               MOVE FILE-STAT  TO FILE-STATUS
               MOVE FILE-STAT-TEXT
                               TO TEXT-8
               MOVE "PRESS 'ENTER' KEY TO CONTINUE."
                               TO TEXT-10
               PERFORM SHOWFORM THRU SHOWFORM-EXIT
               GO TO START-LOOP.

           MOVE SPACES         TO SCREEN-DATA.
           STRING " ****  WORKORDER " WO-KEY
                               DELIMITED BY SIZE
                               INTO TEXT-7
           MOVE " ****  HAS BEEN DELETED FROM THE PM-OPEN-QUEUE."
                               TO TEXT-8.
           MOVE "PRESS 'ENTER' KEY TO CONTINUE."
                               TO TEXT-10.
           PERFORM SHOWFORM    THRU SHOWFORM-EXIT.
           GO TO START-LOOP.

       SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

       SHOWFORM-EXIT.          EXIT.

       END-OF-JOB.
           CLOSE               PM-OPEN-QUEUE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

