       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPMEDIT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.                THIS IS THE MAIN MENU FOR THE
      *                        PREVENTIVE MAINTENANCE SYSTEM
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
                  ASSIGN       TO DATABASE-MCFPMM0800
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ARG-NO
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS       ARE STANDARD.
       01  WO-LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9(9).
       77  PLANT-CODE          PIC X(03).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TPMEDIT ".
           05  PROGRAM-TYPE    PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A PIC X(60) VALUE
           "DRIVER PROGRAM FOR THE PREVENTIVE MAINTENANCE JOBPLAN     ".
               10  PROG-DESC-B PIC X(60) VALUE
           "EDITOR.  ALLOWS EDITOR TO BE RUN AS A STAND-ALONE PROGRAM.".
               10  PROG-FUNC   PIC X(60) VALUE
           "CARRYOVER FROM HP - PROBABLY NOT USED ON THE AS/400.      ".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  DB-ERROR.
           05  DB-TYPE   PIC X(08) VALUE SPACES.
           05  FILLER    PIC X(21) VALUE " ERROR - FILE-STAT = ".
           05  CON-WORD  PIC -9999.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

           COPY VCOMAREA       IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  LAST-WO-USED-DATA.
           COPY MLASTWO        IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           MOVE SPACES         TO DBPARAMETERS
                                  WO-PERS-DATA.
           OPEN INPUT          WO-LAST-NUM-USED.
           MOVE SPACES         TO LAST-WO-USED-DATA.
           MOVE 1              TO DATE-FLAG-SW ARG-NO.

           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           MOVE PLANT-IDENT    TO PLANT-CODE.
           MOVE DATE-FLAG-SW   TO DATE-FLAG.
           CLOSE               WO-LAST-NUM-USED.

           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           CALL "SPMMASTJ"     USING PLANT-CODE
                               WO-PERS-DATA
                               DBPARAMETERS
                               VIEW-COMAREA
                               LANGUAGE-PARMS.

       END-OF-JOB.
           GOBACK.

