       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPMNEWYR.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER.
      *REMARKS.
      *    1. PM MASTER WORKORDER IN WO-PLANNED OF MMISA DATABASE
      *       IS DUPLICATED WITH A NEW WORKORDER NUMBER FOR THE NEW YEAR.
      *    2. WORK ORDER NO IS CHANGED IN ALL RECORDS OF PM-SCHEDULE.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-PLANNED1
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED2
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PM-SCHEDULE1
                  ASSIGN       TO DATABASE-MCFLMM4404
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PM-SCHEDULE2
                  ASSIGN       TO DATABASE-MCFLMM4404
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PM-OPEN-QUEUE
                  ASSIGN       TO DATABASE-MCFLMM3902
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-PLANNED1
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-PLANNED2
           LABEL RECORDS ARE STANDARD.
       01  PWO-REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  PM-SCHEDULE1
           LABEL RECORDS ARE STANDARD.
       01  PM-REC-1.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  PM-SCHEDULE2
           LABEL RECORDS ARE STANDARD.
       01  PM-REC-2.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  PM-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  PMQ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM3902.

       FD  PRINT-FILE
           RECORD CONTAINS 80 CHARACTERS.
       01  PRINT-REC           PIC X(80).

       WORKING-STORAGE SECTION.
       77  ARG-NO              PIC 9999  VALUE 1.
       77  CODE-RETURN         PIC 9999  VALUE 0.
       77  FIND-SW             PIC X     VALUE SPACE.
           88  RECORD-NOT-FOUND          VALUE SPACE.
       77  WS-EQUIP-NUM        PIC X(06) VALUE SPACES.
       77  UNDER-LINE          PIC X(80) VALUE ALL "-".
       77  WS-LINE-CT          PIC 99    VALUE 60 COMP.
       77  WS-PAGE-CT          PIC 9(05) VALUE  0 COMP.
       77  ERROR-SW            PIC S9(4) VALUE  0 COMP.
       77  CONDIT-CODE         PIC X     VALUE SPACE.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X     VALUE "0".
           05 FILE-STAT-2      PIC X     VALUE "0".

       01  SAVE-OLD-WO.
           05  SO-WONUM7       PIC X(07) VALUE SPACES.
           05  SO-WOSUFF       PIC X(03) VALUE SPACES.

       01  WS-WO-NUM.
           05  WS-WO-NO-Y      PIC X(07) VALUE SPACES.
           05  WS-WO-SUFFIX    PIC XXX   VALUE SPACES.

       01  ERROR-MESSAGE.
           05  ERROR-MSG       PIC X(70) VALUE SPACES.
           05  ERR-CODE        PIC X(06) VALUE SPACES.
           05  ERR-MSG-9       REDEFINES ERR-CODE
                               PIC -99999.

       01  SYS-TIME.
           05  SYS-TIME-HH     PIC 99.
           05  SYS-TIME-MM     PIC 99.

       01  TODAYS-DATE.
           05  TD-CC           PIC 99.
           05  DATE-HOLD.
               10  DH-YY       PIC 99.
               10  DH-MM       PIC 99.
               10  DH-DD       PIC 99.

       01  TIME-BUF.
           05  TIME-HHMM       PIC 9(04).
           05  TIME-REST       PIC 9(04).

       01  REPLACE-MSG.
           05  RMSG-1          PIC X(28)
               VALUE "PROGRAM TPMNEWYR HAS GENERAT".
           05  RMSG-2          PIC X(28)
               VALUE "ED A NEW MASTER WO NUMBER:  ".
           05  RWONUM          PIC X(10).

       01  HEADING-1.
           05  FILLER          PIC X(13)     VALUE "TPMNEWYR     ".
           05  FILLER          PIC X(36)
                        VALUE "AUDIT TRAIL OF YEAR-END PM WO CHANGE".
           05  FILLER          PIC X(09) VALUE SPACES.
           05  PL-DATE         PIC X(06) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE "     PAGE:  ".
           05  PL-PAGE-NO      PIC Z(04).

       01  DETAIL-LINE.
           05  FILLER          PIC X(13) VALUE
               "PM MASTER WO ".
           05  PL-OLD-WO-NO    PIC X(11) VALUE SPACES.
           05  FILLER          PIC X(14) VALUE
               "FOR EQUIPMENT ".
           05  PL-EQUIP-NO     PIC X(06) VALUE SPACES.
           05  FILLER          PIC X(24) VALUE
               " HAS BEEN CHANGED TO WO ".
           05  PL-NEW-WO-NO    PIC X(10) VALUE SPACES.

       01  DETAIL-LINE2.
           05  FILLER          PIC X(30) VALUE
               "        MASTER JOBPLAN NAME:  ".
           05  PL-JOBPLAN      PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(25) VALUE
               "  MASTER SCHEDULE NAME:  ".
           05  PL-SCHEDULE     PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE SPACES.

       01  LS-WO-NUM.
           05  LS-WO-NUM1-7    PIC X(7).
           05  LS-WO-SUFFIX    PIC X(3).

       01  RETURN-ERROR.
           05  ERROR-TEXT      PIC X(68).
           05  ERROR-NUM       PIC X(08).
           05  ERROR-CODE      REDEFINES ERROR-NUM
                               PIC ZZZZZZZ9.

       01  DB-ERROR.
           05  DB-TYPE         PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(30)
                               VALUE " TPMNEWYR ERROR - COND-WORD = ".
           05  CON-WORD        PIC XX.
           05  FILLER          PIC X(12) VALUE " ON DATASET ".
           05  DB-DSET         PIC X(16) VALUE SPACES.

           COPY DBSTAT         IN COPYLIB.

           COPY LANGSUB        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  PM-QUEUE-DATA.
           COPY DPMOPENQ       IN COPYLIB.

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

       01  PM-SCHEDULE-DATA.
           COPY DPMSCHED       IN COPYLIB.

       01  PM-AUDIT-DATA.
           COPY DPMAUDIT       IN COPYLIB.

       PROCEDURE DIVISION.
       MAIN-PROCESS.
           ACCEPT DATE-HOLD    FROM DATE.
           ACCEPT SYS-TIME     FROM TIME.
           MOVE DATE-HOLD      TO PL-DATE
           MOVE 20             TO TD-CC.
           IF DH-YY > 70
               MOVE 19         TO TD-CC.

           MOVE SPACES         TO FIND-SW LANGUAGE-PARMS.
           OPEN INPUT          WO-PLANNED1.
           OPEN I-O            WO-PLANNED2.
           OPEN INPUT          PM-SCHEDULE1.
           OPEN I-O            PM-SCHEDULE2.
           OPEN INPUT          PM-OPEN-QUEUE.
           OPEN OUTPUT         PRINT-FILE.

           MOVE SPACES         TO WO-TRACK-DATA.
           CALL "WHO"          USING MOD CAP LATTR
                               USERNAME GRPNAME ACCTNAME
                               HOMEGRP TERMNUM.
           MOVE USERNAME       TO USER-NAME.
           MOVE "0010"         TO USER-TERM.

           PERFORM             PRINT-HEADINGS.
           PERFORM DBGET-START THRU DS-EXIT.

       SHUT-FILES.
           IF RECORD-NOT-FOUND
               MOVE
               "  NO PM MASTERS FOUND TO BE UPDATED."
                               TO PRINT-REC
               WRITE           PRINT-REC AFTER ADVANCING 6.
           CLOSE               WO-PLANNED1.
           CLOSE               WO-PLANNED2.
           CLOSE               PM-SCHEDULE1.
           CLOSE               PM-SCHEDULE2.
           CLOSE               PM-OPEN-QUEUE.
           CLOSE               PRINT-FILE.
           GOBACK.

       DBGET-START.
           READ WO-PLANNED1    FIRST INTO WO-PLANNED-DATA
               AT END          GO TO DS-EXIT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DS-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ FST" TO DB-TYPE
               MOVE "WO-PLANNED1" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC AFTER ADVANCING 6
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  SEQUENTIAL FILE READ FAILED ON WO-PLANNED"
                               TO PRINT-REC
               WRITE           PRINT-REC
               GO TO DS-EXIT.

           GO TO DBGET-CONTINUE.

       DBGET-LOOP.
           READ WO-PLANNED1    NEXT INTO WO-PLANNED-DATA
               AT END          GO TO DS-EXIT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DS-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ NXT" TO DB-TYPE
               MOVE "WO-PLANNED1" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC AFTER ADVANCING 6
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  SEQUENTIAL FILE READ FAILED ON WO-PLANNED"
                               TO PRINT-REC
               WRITE           PRINT-REC
               GO TO DS-EXIT.

       DBGET-CONTINUE.
           IF WO-START-STATUS NOT = "AA"
               GO TO DBGET-LOOP.

           IF WO-NUM-SUFF-P NOT = "000"
               GO TO DBGET-LOOP.

           IF WO-STATUS-P NOT = "OO"
               GO TO DBGET-LOOP.

           IF APPROVAL-CODE-P NOT = "A"
               GO TO DBGET-LOOP.

           IF DATE-RECD-P-CN = TODAYS-DATE
               GO TO DBGET-LOOP.

           IF DATE-RECD-P-YY = DH-YY
               GO TO DBGET-LOOP.

           MOVE WO-NUM-PLANNED TO WS-WO-NUM
                                  SAVE-OLD-WO
                                  WONUM OF PM-SCHEDULE1.
           MOVE EQUIP-NUM-P    TO WS-EQUIP-NUM.

           START PM-SCHEDULE1  KEY = WONUM OF PM-SCHEDULE1
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO DBGET-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "START  "  TO DB-TYPE
               MOVE "PM-SCHEDULE1" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING
               "  RECORD SEARCH ON PM-SCHEDULE FAILED FOR " WS-WO-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  ABORT SEARCH AND CONTINUE TO NEXT WORKORDER..."
                               TO PRINT-REC
               WRITE           PRINT-REC
               GO TO DBGET-LOOP.

           MOVE "X"            TO FIND-SW.
           PERFORM DUPLICATE-WO THRU DWO-EXIT.
           GO TO DBGET-LOOP.

       DS-EXIT.                EXIT.

       DUPLICATE-WO.
           MOVE SPACES         TO T-WO-DATA T-STATUS-DATA.
           MOVE "TPMNEWYR"     TO PROGRAM-NAME.
           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           MOVE TODAYS-DATE    TO DATE-STAMP-CN.
           MOVE SYS-TIME       TO TIME-STAMP.
           MOVE WO-START-STATUS TO WO-TYPE-STATUS.
           MOVE "PMYR"         TO USER-ID.
           MOVE SPACES         TO CLOCK-CARD.
           MOVE WO-STATUS-P    TO WO-STATUS-TRACK TRANS-STATUS.
           CALL "TWOTRACK"     USING WO-TRACK-DATA.

           MOVE SPACES         TO LS-WO-NUM.
           CALL "TNEWWONU"     USING DBPARAMETERS
                                     STATUS-AREA
                                     LS-WO-NUM
                                     ERROR-SW
           MOVE "000"          TO LS-WO-SUFFIX
           IF ERROR-SW NOT = 0
               MOVE "    WORKORDER WAS NOT INITIATED!"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  PLEASE NOTIFY MMIS SYSTEM MANAGER OR"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  HP SYSTEM OPERATOR OF THE FOLLOWING:"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  PROGRAM NAME:  TPMNEWYR"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  SUBROUTINE:    TNEWWONU"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "WORKORDER WAS NOT INITIATED!" TO ERROR-MESSAGE
               MOVE ERROR-SW                       TO ERR-MSG-9
               WRITE           PRINT-REC FROM ERROR-MESSAGE
               GO TO BLOWUP.

           MOVE LS-WO-NUM      TO WO-NUM-PLANNED.
           MOVE TODAYS-DATE    TO DATE-RECD-P-CN.
           MOVE SYS-TIME       TO TIME-RECD-P.
           MOVE "000 "         TO LAST-SUFFIX-INIT.

           CALL "TADDWOII"     USING DBPARAMETERS
                               STATUS-AREA
                               WO-PLANNED-DATA
                               CONDIT-CODE
                               ERROR-SW.
           IF ERROR-SW NOT = 0
               MOVE "    WORKORDER WAS NOT INITIATED!"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  PLEASE NOTIFY MMIS SYSTEM MANAGER OR"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  HP SYSTEM OPERATOR OF THE FOLLOWING:"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  PROGRAM NAME:  TPMNEWYR"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "  SUBROUTINE:    TADDWOVP"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE "WORKORDER WAS NOT INITIATED!" TO ERROR-MESSAGE
               MOVE ERROR-SW                       TO ERR-MSG-9
               WRITE           PRINT-REC FROM ERROR-MESSAGE
               GO TO BLOWUP.

           MOVE LS-WO-NUM      TO PL-NEW-WO-NO.

       CONTINUE-PROCESSING.
           MOVE SPACES         TO T-WO-DATA T-STATUS-DATA.
           MOVE "TPMNEWYR"     TO PROGRAM-NAME.
           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           MOVE DATE-RECD-P-CN TO DATE-STAMP-CN.
           MOVE TIME-RECD-P    TO TIME-STAMP.
           MOVE WO-START-STATUS TO WO-TYPE-STATUS.
           MOVE "PMYR"         TO USER-ID.
           MOVE SPACES         TO CLOCK-CARD.
           MOVE WO-STATUS-P    TO WO-STATUS-TRACK TRANS-STATUS.
           CALL "TWOTRACK"     USING WO-TRACK-DATA.

       WRITE-AUDIT.
           MOVE SPACES         TO  PM-AUDIT-DATA RETURN-ERROR.
           MOVE TODAYS-DATE    TO  AUDIT-DATE AUDIT-YRMO.
           ACCEPT TIME-BUF     FROM TIME.
           MOVE TIME-HHMM      TO  AUDIT-TIME.
           MOVE "OO"           TO  AUDIT-TRANS AUDIT-WO-STATUS.
           MOVE EQUIP-NUM-P    TO  AUDIT-EQUIP-NUM.
           MOVE WO-NUM-PLANNED TO  AUDIT-WO-NUM.
           MOVE "  "           TO  AUDIT-PM-LEVEL-X.
           MOVE "TPMNEWYR CREATED PM MASTER WO "
                               TO  AUDIT-DESC.

           CALL "SPMAUDIT"     USING PM-AUDIT-DATA
                               DBPARAMETERS
                               RETURN-ERROR.

           PERFORM CHANGE-PM-SCHEDULE THRU CPS-EXIT.

       WRITE-AUDIT-TRAIL.
           IF WS-LINE-CT > 55
               PERFORM         PRINT-HEADINGS.
           MOVE SAVE-OLD-WO    TO PL-OLD-WO-NO.
           MOVE EQUIP-NUM-P    TO PL-EQUIP-NO.
           WRITE PRINT-REC     FROM DETAIL-LINE.
           MOVE PM-JOBPLAN-KEY TO PL-JOBPLAN.
           MOVE PM-SCHEDULE-KEY TO PL-SCHEDULE.
           WRITE PRINT-REC     FROM DETAIL-LINE2.
           MOVE SPACES         TO PRINT-REC.
           WRITE               PRINT-REC.
           ADD 3               TO WS-LINE-CT.

       CHECK-QUEUE.
           MOVE EQUIP-NUM-P    TO EQPNUM OF PM-OPEN-QUEUE.
           START PM-OPEN-QUEUE KEY = EQPNUM OF PM-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DWO-EXIT.

       CHECK-Q-LOOP.
           READ PM-OPEN-QUEUE  NEXT INTO PM-QUEUE-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO DWO-EXIT.

           IF PMQ-EQUIP-NUM NOT = EQUIP-NUM-P
               GO TO DWO-EXIT.

           IF PMQ-WONUM7 NOT = SO-WONUM7
               GO TO CHECK-Q-LOOP.

           PERFORM UPDATE-SUFF-WO THRU USW-EXIT.
           GO TO CHECK-Q-LOOP.

       DWO-EXIT.               EXIT.

       UPDATE-SUFF-WO.
           MOVE PMQ-WO-NUM     TO WONUM OF WO-PLANNED2.
           READ WO-PLANNED2    INTO WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO USW-EXIT.

           MOVE LS-WO-NUM      TO RWONUM
           MOVE REPLACE-MSG    TO SPECL-EQUIP.

           REWRITE PWO-REC2    FROM WO-PLANNED-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO USW-EXIT.

       USW-EXIT.               EXIT.

       CHANGE-PM-SCHEDULE.
           MOVE SAVE-OLD-WO    TO WONUM OF PM-SCHEDULE1.
           START PM-SCHEDULE1  KEY = WONUM OF PM-SCHEDULE1
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO DELETE-OLD-SCHEDULE
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "START   " TO DB-TYPE
               MOVE "PM-SCHEDULE1" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  START ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  PM SCHEDULE NOT DUPLICATED IN PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

       CHECK-PM-LOOP.
           READ PM-SCHEDULE1   NEXT INTO PM-SCHEDULE-DATA
               AT END          GO TO DELETE-OLD-SCHEDULE.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO DELETE-OLD-SCHEDULE
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ NXT" TO DB-TYPE
               MOVE "PM-SCHEDULE1" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  READ NEXT RECORD ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  PM SCHEDULE NOT DUPLICATED IN PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

           IF SAVE-OLD-WO NOT = SCH-WO-NUM
               GO TO DELETE-OLD-SCHEDULE.

           MOVE LS-WO-NUM      TO SCH-WO-NUM.
           WRITE PM-REC-2      FROM PM-SCHEDULE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "WRITE   " TO DB-TYPE
               MOVE "PM-SCHEDULE2" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  WRITE ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  PM SCHEDULE NOT DUPLICATED IN PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

           GO TO CHECK-PM-LOOP.

       DELETE-OLD-SCHEDULE.
           MOVE SAVE-OLD-WO    TO WONUM OF PM-SCHEDULE2.
           START PM-SCHEDULE2  KEY = WONUM OF PM-SCHEDULE2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO CPS-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "START   " TO DB-TYPE
               MOVE "PM-SCHEDULE2" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  SECOND START ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  OLD PM SCHEDULE NOT DELETED FROM PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

       DELETE-PM-LOOP.
           READ PM-SCHEDULE2   NEXT INTO PM-SCHEDULE-DATA
               AT END          GO TO DELETE-OLD-SCHEDULE.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO CPS-EXIT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ NXT" TO DB-TYPE
               MOVE "PM-SCHEDULE2" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  DELETE DBGET ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  OLD PM SCHEDULE NOT DELETED FROM PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

           IF SAVE-OLD-WO NOT = SCH-WO-NUM
               GO TO CPS-EXIT.

           DELETE PM-SCHEDULE2
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "DELETE  " TO DB-TYPE
               MOVE "PM-SCHEDULE2" TO DB-DSET
               MOVE FILE-STAT  TO CON-WORD
               MOVE "* ERROR * ERROR * ERROR * ERROR *"
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE DB-ERROR   TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  DELETE ON DATASET PM-SCHEDULE FAILED."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE
               "  OLD PM SCHEDULE NOT DELETED FROM PM SCHEDULE FILE."
                               TO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  MASTER WORKORDER:  " SAVE-OLD-WO
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               MOVE SPACES     TO PRINT-REC
               STRING "  EQUIPMENT NUMBER:  " WS-EQUIP-NUM
                               DELIMITED BY SIZE
                               INTO PRINT-REC
               WRITE           PRINT-REC
               GO TO CPS-EXIT.

           GO TO DELETE-PM-LOOP.

       CPS-EXIT.               EXIT.

       PRINT-HEADINGS.
           ADD 1               TO WS-PAGE-CT.
           MOVE WS-PAGE-CT     TO PL-PAGE-NO.
           WRITE PRINT-REC     FROM HEADING-1 AFTER PAGE.
           WRITE PRINT-REC     FROM UNDER-LINE AFTER 1.
           MOVE SPACES         TO PRINT-REC.
           WRITE               PRINT-REC.
           MOVE 3              TO WS-LINE-CT.

       BLOWUP.
           MOVE ERROR-MESSAGE  TO PRINT-REC
           WRITE               PRINT-REC.
           MOVE "    RUN ABORTED PREMATURELY"
                               TO PRINT-REC.
           WRITE               PRINT-REC.
           GO TO SHUT-FILES.

      ***************  END OF FILE  **************************************
