       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPMQUEUE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PM-OPEN-QUEUE
                  ASSIGN       TO DATABASE-MCFLMM3901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PM-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  PMQ-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM3901.

       WORKING-STORAGE SECTION.
       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  PM-QUEUE-DATA.
           COPY DPMOPENQ       IN COPYLIB.

       01  ACD-SW              PIC X.
       01  ERROR-MESSAGE.
           05  ERROR-TEXT      PIC X(70).
           05  ERROR-FILL      PIC X(06).
           05  ERROR-CODE      REDEFINES ERROR-FILL PIC 9(06).

       PROCEDURE DIVISION      USING DBPARAMETERS
                               PM-QUEUE-DATA
                               ACD-SW
                               ERROR-MESSAGE.

       START-PROCESSING.
           OPEN I-O            PM-OPEN-QUEUE.
           MOVE SPACES         TO ERROR-MESSAGE.
           MOVE "1 "           TO PMQ-PRTY.

           IF ACD-SW = "A"
               GO TO ADD-FUNCTION
           ELSE
           IF ACD-SW = "C"
               GO TO CHG-FUNCTION
           ELSE
           IF ACD-SW = "D"
               GO TO DEL-FUNCTION
           ELSE
               MOVE "QUEUE-SW NOT SET - PM QUEUE NOT UPDATED"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

       ADD-FUNCTION.
           MOVE PMQ-WO-NUM     TO WONUM OF PM-OPEN-QUEUE.
           START PM-OPEN-QUEUE KEY = WONUM OF PM-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE "F"        TO RETURN-BYTE
               GO TO END-OF-JOB.

           WRITE PMQ-REC       FROM PM-QUEUE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "WRITE ERROR - RECORD NOT ADDED TO PM QUEUE"
                               TO ERROR-TEXT.

           GO TO END-OF-JOB.

       CHG-FUNCTION.
           MOVE PMQ-WO-NUM     TO WONUM OF PM-OPEN-QUEUE.
           START PM-OPEN-QUEUE KEY = WONUM OF PM-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "START ERROR - RECORD NOT CHANGED IN PM QUEUE"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

           READ PM-OPEN-QUEUE  NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "READ ERROR - RECORD NOT CHANGED IN PM QUEUE"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

           IF PMQ-WO-NUM NOT = WONUM OF PM-OPEN-QUEUE
               MOVE "READ ERROR - RECORD NOT CHANGED IN PM QUEUE"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

           REWRITE PMQ-REC     FROM PM-QUEUE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "REWRITE ERROR - RECORD NOT CHANGED IN PM QUEUE"
                               TO ERROR-TEXT.

           GO TO END-OF-JOB.

       DEL-FUNCTION.
           MOVE PMQ-WO-NUM     TO WONUM OF PM-OPEN-QUEUE.
           START PM-OPEN-QUEUE KEY = WONUM OF PM-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "23"
                   GO TO END-OF-JOB
               ELSE
                   MOVE FILE-STAT TO ERROR-FILL
                   MOVE "START ERROR - RECORD NOT DELETED IN PM QUEUE"
                               TO ERROR-TEXT
                   GO TO END-OF-JOB.

           READ PM-OPEN-QUEUE  NEXT RECORD
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "READ ERROR - RECORD NOT DELETED IN PM QUEUE"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

           IF PMQ-WO-NUM NOT = WONUM OF PM-OPEN-QUEUE
               MOVE "READ ERROR - RECORD NOT DELETED IN PM QUEUE"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

           DELETE PM-OPEN-QUEUE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO ERROR-FILL
               MOVE "DELETE ERROR - RECORD NOT DELETED FROM PM QUEUE"
                               TO ERROR-TEXT.

       END-OF-JOB.
           CLOSE               PM-OPEN-QUEUE.
           GOBACK.

