       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPMSINIT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER COMPANY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPMSCHED-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  EQP-EQUIPMENT
           LABEL RECORDS       ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  FILE-STAT           PIC XX.
       77  TRUE-VAL            PIC 1  VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPMSINIT".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A1    PIC X(30) VALUE
                  "ROUTINE TO ALLOW INPUT OF EQUI".
               10  PROG-DESC-A2    PIC X(30) VALUE
                  "PMENT NUMBER TO START THE PM  ".
               10  PROG-DESC-B1    PIC X(30) VALUE
                  "SCHEDULER PROGRAM TO INITATE A".
               10  PROG-DESC-B2    PIC X(30) VALUE
                  " PM SCHEDULE.                 ".
               10  PROG-FUNCTION1  PIC X(30) VALUE
                  "                              ".
               10  PROG-FUNCTION2  PIC X(30) VALUE
                  "                              ".
           05  PASSWORD-FLAG       PIC X.

       01  SCREEN-DATA.
           05  EQP-NUM-BUF     PIC X(06).
           05  INIT-DATE.
               10  ID-YY       PIC XX.
               10  ID-MM       PIC XX.
               10  ID-DD       PIC XX.
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  INFO-PARAMETERS.
           05  INFO-DATA       PIC X(06).
           05  INFO-PARM       PIC XX.
           05  INFO-DATE       PIC X(06).

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  EQP-EQUIP-DATA.
           COPY MEQPFILE       IN COPYLIB.

       PROCEDURE DIVISION.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO WRITE-SCREEN.
           GOBACK.

       WRITE-SCREEN.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          EQP-EQUIPMENT.
           MOVE SPACES         TO SCREEN-DATA INFO-PARAMETERS.
           ACCEPT INIT-DATE    FROM DATE.
           MOVE "VINITIATE"    TO SCREEN-NAME.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

           IF EQP-NUM-BUF = SPACES
               GO TO SHOWFORM.

           MOVE EQP-NUM-BUF    TO EQPNUM OF EQP-EQUIPMENT.
           START EQP-EQUIPMENT KEY = EQPNUM OF EQP-EQUIPMENT
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/004:
      **  INVALID EQUIPMENT NUMBER
      **********************************************************************
               MOVE   35       TO CATREAD-MSG-SET
               MOVE    4       TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (1)  IND (99)
               GO TO SHOWFORM.

           IF ID-YY IS NUMERIC
               IF ID-MM > 0 AND ID-MM < 13
                   IF ID-DD > 0 AND ID-DD < 32
                       NEXT SENTENCE
                   ELSE
      **********************************************************************
      **    MESSAGE 035/030:
      ** INVALID DAY
      **********************************************************************
                       MOVE 35 TO CATREAD-MSG-SET
                       MOVE 30 TO CATREAD-MSG-NUM
                       CALL "CCATREAD" USING CATREAD-PARMS
                       MOVE CATREAD-MSG-TEXT TO ERRMSG
                       MOVE TRUE-VAL TO IND (4)  IND (99)
                       GO TO SHOWFORM
               ELSE
      **********************************************************************
      **    MESSAGE 035/031:
      ** INVALID MONTH
      **********************************************************************
                   MOVE 35     TO CATREAD-MSG-SET
                   MOVE 31     TO CATREAD-MSG-NUM
                   CALL "CCATREAD" USING CATREAD-PARMS
                   MOVE CATREAD-MSG-TEXT TO ERRMSG
                   MOVE TRUE-VAL TO IND (3)  IND (99)
                   GO TO SHOWFORM
           ELSE
      **********************************************************************
      **    MESSAGE 035/032:
      ** INVALID YEAR
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  32        TO CATREAD-MSG-NUM
               CALL "CCATREAD" USING CATREAD-PARMS
               MOVE CATREAD-MSG-TEXT TO ERRMSG
               MOVE TRUE-VAL   TO IND (2)  IND (99)
               GO TO SHOWFORM.

           MOVE EQP-NUM-BUF    TO INFO-DATA.
           MOVE "00"           TO INFO-PARM.
           MOVE INIT-DATE      TO INFO-DATE.
           CALL "CLPMSCHED"    USING INFO-PARAMETERS.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               EQP-EQUIPMENT.
           GOBACK.

