001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    TPOBYVEN.
001300 AUTHOR.        CA KRIST.
001400 DATE-WRITTEN.  FEBRUARY 10, 1984.
001500*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001600*REMARKS.
001700*D   PO INQUIRY BY VENDOR CODE MAIN PROGRAM
004300 ENVIRONMENT DIVISION.
004400 CONFIGURATION SECTION.
004500 SOURCE-COMPUTER.    HP-3000.
004600 OBJECT-COMPUTER.    HP-3000.
004700
004800 DATA DIVISION.
004900
005000 WORKING-STORAGE SECTION.
005600 COPY VCOMAREA OF COPYCSIS.
005700
005800 01  FORMFILE.
005900     05  FORM-FNAME                PIC X(8)  VALUE "FPOBYVEN".
006000     05  FILLER                    PIC X     VALUE ".".
006100     05  FORM-GNAME.
006200         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
006300         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
006400     05  FILLER                    PIC X(19) VALUE SPACES.
006800
011900 COPY DATAB OF COPYCSIS.
013200
019500 COPY LANGUAGE OF COPYCSIS.
019600
019700
019800 PROCEDURE DIVISION.
019900 0-BEGIN.
020100
020200     CALL "SPOBYVEN" USING BASE,
020220                           VIEW-COMAREA,
020230                           LANGUAGE-PARMS,
020240                           FORMFILE.
020400
020500     GOBACK.
020800
