000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TPOHDELT.
000400 AUTHOR.  KURT MOVSESIAN.
000500 DATE-WRITTEN. MAR. 21, 1988.
000700
000800***********************************************************
000900**                                                       **
001000**    T P O H D E L T                                    **
001100**                                                       **
001200*D      THIS PROGRAM IS THE MAIN PROGRAM FOR DELETING    **
001300*D      PURCHASE ORDERS OUT OF THE HISTORY DB 'STHIST'.  **
001400*D      THE POs ELIGIBLE FOR DELETION ARE WRITTEN TO     **
001500*D      AN MPE FILE 'POHIST01' BEFORE THEY ARE DELETED   **
001600*D      BY THE SUBROUTINE 'SPOHTDL'.                     **
001700**                                                       **
001800***********************************************************
      *C  02/21/94  JEFF BUNGO  REQ #6449
      *C      FIELDS WERE ADDED TO THE DPORECD HISTORY FILE TO
      *C      MATCH THE LIVE DATABASE.  THE DPORECD RECORD PRINTED
      *C      TO THE POHIST01 FILE HAD TO BE INCREASED FOR THESE
      *C      ADDITIONAL FIELDS.
      *C
      *C  09/11/96  JEFF BUNGO
      *C      EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C      INCLUDE CENTURY ON DELETION DATE AND USE ON
      *C      COMPARISON OF PO DELETE DATE.  ALSO INCLUDE
      *C      CENTURY ON DELETION DATE OF DPODELETE RECORD.
      *C
      *C  05/21/98  CA YODER
      *C      INCREASED DPORECD-DATA FIELD LENGTH TO 252.  IT
      *C      DID NOT ACCOUNT FOR THE INCREASE OF THE RECORD
      *C      LENGTH FOR Y2K.
001900
002000
002100
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.   HP-3000.
002500 OBJECT-COMPUTER.   HP-3000.
002600 SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
002800
002900 INPUT-OUTPUT SECTION.
003000 FILE-CONTROL.

003100     SELECT PO-DELETE-FILE ASSIGN TO DISK-PODELTH.
003200     SELECT SORT-FILE ASSIGN TO DISK-SORT.
003300     SELECT PO-HISTORY-FILE ASSIGN TO DISK-POHIST01.

           SELECT DPORECDH-I
                  ASSIGN TO DATABASE-MCFLST0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODELETE-O
                  ASSIGN TO DATABASE-MCFLST1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEMH-I
                  ASSIGN TO DATABASE-MCFLST0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODESCH-I
                  ASSIGN TO DATABASE-MCFLST0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDORH-I
                  ASSIGN TO DATABASE-MCFLST0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOFREIGHTH-I
                  ASSIGN TO DATABASE-MCFLST0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVITEMH-I
                  ASSIGN TO DATABASE-MCFLST0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I
                  ASSIGN TO DATABASE-MCFLST0802
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITMH-I
                  ASSIGN TO DATABASE-MCFLST0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCTH-I
                  ASSIGN TO DATABASE-MCFLST1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DRCVCORRH-I
                  ASSIGN TO DATABASE-MCFLST5401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
003800 FD  PO-DELETE-FILE
003900     LABEL RECORDS ARE OMITTED
004000     RECORD CONTAINS 14 CHARACTERS.
004100 01  PO-DEL-RCD.
004200     05  PO-DEL-NUM               PIC X(14).
004300
004400 SD  SORT-FILE
004500     DATA RECORD IS SORT-REC
004600     RECORD CONTAINS 14 CHARACTERS.
004700 01  SORT-REC.
004800     05  SORT-PO-NUM              PIC X(14).
004900
005000********************************************************
005100**
005200**   FILE NAME IS 'POHIST01' AND IS VARIABLE IN LENGTH
005300**   FROM 54 TO 520 BYTES
005400**
005500********************************************************
005600
005700 FD  PO-HISTORY-FILE
005900     LABEL RECORDS ARE OMITTED
006000     DATA RECORD IS PO-HISTORY-REC.
006100 01  PO-HISTORY-REC.
006200     05  PO-HIST-PO-NUM           PIC X(14).
006300     05  PO-HIST-DSET-NAME        PIC X(10).
006400     05  PO-HIST-DATA             PIC X(496).
006800
       FD  DPORECDH-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECDH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0301.

       FD  DPODELETE-O
           LABEL RECORDS ARE STANDARD.
       01  DPODELETE-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLST1101.

       FD  DPOITEMH-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEMH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0401.

       FD  DPODESCH-I
           LABEL RECORDS ARE STANDARD.
       01  DPODESCH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0501.

       FD  DVENDORH-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDORH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0201.

       FD  DPOFREIGHTH-I
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHTH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0701.

       FD  DRCVITEMH-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEMH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST0601.

       FD  DINVRCDH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLST0802.

       FD  DINVITMH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITMH-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLST0901.

       FD  DINVACCTH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCTH-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLST1001.
003700
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DRCVCORRH-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVCORRH-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLST5401.

006900 WORKING-STORAGE SECTION.
007000 77  COMPANY-SAVE                 PIC X(3)  VALUE SPACES.
007100 77  PO-DELETE-MONTHS             PIC 9(2)  VALUE ZEROS.
007200 77  PO-HIST-REC-SIZE             PIC 9(4)  VALUE ZEROS.
007300 77  END-OF-DPODESC-ENTRIES       PIC X(1)  VALUE SPACES.
007400 77  END-OF-DPOITEM-ENTRIES       PIC X(1)  VALUE SPACES.
007500 77  END-OF-DRCVITEM-ENTRIES      PIC X(1)  VALUE SPACES.
007600 77  END-OF-DINVRCD-ENTRIES       PIC X(1)  VALUE SPACES.
007700 77  END-OF-DINVITM-ENTRIES       PIC X(1)  VALUE SPACES.
007800 77  END-OF-DINVACCT-ENTRIES      PIC X(1)  VALUE SPACES.
       77  END-OF-DRCVCORR-ENTRIES      PIC X(1)  VALUE SPACES.
007900 77  PO-DELETE-CTR                PIC 9(5)  VALUE ZEROS.
008100 77  PO-DELETE-NO                 PIC S9(5) VALUE ZEROS.
008200
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

008300 01  BUILD-DPORECD-BUFFER.
008400     05  DPORECD-DATA             PIC X(252).
008500     05  DVENDOR-NAME             PIC X(44).
008600
008700
008800**************************************************************
008900**************************************************************
009000**                                                          **
009100**                DATABASE I/O BUFFER AREA                  **
009200**                                                          **
009300**************************************************************
009400**************************************************************
009500
009600 COPY DPORECDH IN COPYLIB.
009700
009800 COPY DPOITEMH IN COPYLIB.
009900
010000 COPY DPODESCH IN COPYLIB.
010100
010200 COPY DRCVITMH IN COPYLIB.
010300
010400 COPY DPOFRTH IN COPYLIB.
010500
010600 COPY DINVRCDH IN COPYLIB.
010700
010800 COPY DINVITMH IN COPYLIB.
010900
011000 COPY DINVACTH IN COPYLIB.
011100
011200 COPY DVENDORH IN COPYLIB.
011300
011400 COPY MPLTINFO IN COPYLIB.
011500
011600 COPY DPODELET IN COPYLIB.

       COPY DRCVCORH IN COPYLIB.
011700
011800*********************
011900*                   *
012000*   DATA SET NAMES  *
012100*                   *
012200*********************
012300
012400 01  DSET-NAMES.
012500     05  DSET-NAME              PIC X(16)  VALUE SPACES.
012600     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
012700     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
012800     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
012900     05  DSET-DPODESC           PIC X(16)  VALUE "DPODESC;".
013000     05  DSET-DRCVITEM          PIC X(16)  VALUE "DRCVITEM;".
013100     05  DSET-DPOFREIGHT        PIC X(16)  VALUE "DPOFREIGHT;".
013200     05  DSET-DINVRCD           PIC X(16)  VALUE "DINVRCD;".
013300     05  DSET-DINVITM           PIC X(16)  VALUE "DINVITM;".
013400     05  DSET-DINVACCT          PIC X(16)  VALUE "DINVACCT;".
013500     05  DSET-DVENDOR           PIC X(16)  VALUE "DVENDOR;".
013600     05  DSET-DPODELETE         PIC X(16)  VALUE "DPODELETE;".
           05  DSET-DRCVCORR          PIC X(16)  VALUE "DRCVCORR;".
013700
013800 COPY DATAB IN COPYLIB.
013900
014000 COPY DBSTHIST IN COPYLIB.
014100
014200 01 ITEMS-LISTING.
014300     05  ALL-ITEMS              PIC XX    VALUE "@;".
014400     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
014500     05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".
014600     05  REG-SEARCH             PIC X(16)
014700                                  VALUE "REGISTER-NUMBER;".
014800
014900 01 ARG-VALUES.
015000     05  PO-ARG                 PIC X(14) VALUE SPACES.
015100     05  VEN-ARG                PIC X(10) VALUE SPACES.
015200     05  PLT-ARG                PIC X(4)  VALUE SPACES.
015300     05  REG-ARG                PIC X(6)  VALUE SPACES.
015400     05  RCVR-ARG.
015500         10  RCVR-PO-NUM        PIC X(10) VALUE SPACES.
015600         10  BUILD-RCVR-NO      PIC 9(3)  VALUE ZEROS.
015700         10  FILLER             PIC X(1)  VALUE SPACES.
015800
015900
016000 01  DATES-AND-TIMES.
016100     05  TODAYS-DATE.
016200         10  YY               PIC 99.
016300         10  MM               PIC 99.
016400         10  DD               PIC 99.
016500
           05  DELETE-DATE-CN.
               10  DELETE-DATE-CC   PIC 99.
016600         10  DELETE-DATE.
016700             15  DELETE-DATE-YY   PIC 99.
016800             15  DELETE-DATE-MM   PIC 99.
016900             15  DELETE-DATE-DD   PIC 99.
017000
017100     05  SAVE-PO-DELETE-DATE  PIC 9(8) VALUE ZEROS.
017200
           05  TIME-OF-DAY          PIC X(8) VALUE SPACES.
017300
017400 COPY TDATECHK IN COPYLIB.
017500
017600 COPY TBLOWUP IN COPYLIB.

       LINKAGE SECTION.
       01 NUMBER-POS-TO-DELETE.
008000    05 PO-DELETE-MAX-NO             PIC X(5).
017700
017800
017900 PROCEDURE DIVISION USING NUMBER-POS-TO-DELETE.
018000 BEGIN SECTION.
       BEGIN-HERE.
018100
018200     PERFORM 1-HSK  THRU  1-HSK-X.
018300     PERFORM 6-MAIN  THRU  6-MAIN-X.
018400     PERFORM 2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.
018500     GOBACK.
018600
018700
018800 1-HSK.
           OPEN INPUT DPORECDH-I, DPOITEMH-I, DPODESCH-I, DRCVITEMH-I,
                      DPOFREIGHTH-I, DINVRCDH-I, DINVITMH-I,
                      DINVACCTH-I, DVENDORH-I, MPLTINFO-I,
                      DRCVCORRH-I.
           OPEN I-O DPODELETE-O.

020900******************************************
021000*   GET CO. CODE FROM MPLTINFO
021100******************************************
021200
021300     MOVE "P 01"       TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
021700         MOVE "GET MPLTINFO 'P 01' *1-HSK" TO BU-DISPLAY-MSG
021800         GO TO 2-BLOWUP
021900     ELSE
022000         MOVE MPLTINFO-COMPANY  TO  COMPANY-SAVE.
022100
022200**********************************************
022300*    GET NO. OF MONTHS PO SHOULD STAY IN THE
022400*    HISTORY DATA BASE BEFORE BEING DELETED
022500**********************************************
022600
022700     MOVE "PODL"       TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
023100         MOVE "GET MPLTINFO 'PODL' *1-HSK" TO BU-DISPLAY-MSG
023200         GO TO 2-BLOWUP.
023300
023400     IF MPLTINFO-PO-HIST-DEL-MTH  NOT NUMERIC
023500         MOVE "NO. OF MONTHS TO DELETE IS MISSING"
023600             TO BU-DISPLAY-MSG
023700         GO TO 2-BLOWUP
023800     ELSE
023900         MOVE MPLTINFO-PO-HIST-DEL-MTH TO PO-DELETE-MONTHS.
024000
024100***********************************************
024200*  CALL 'TDATECHK' FOR TODAYS DATE
024300***********************************************
024400
024500     MOVE 1               TO  DATE-MODE.
024600     CALL "TDATECHK" USING DATE-CHECK-AREA.
024700     MOVE DATE-YMD-OUT    TO  TODAYS-DATE.
024800     MOVE TODAYS-DATE     TO  DELETE-DATE.
024900     MOVE ZERO            TO  DELETE-DATE-DD.
           IF DELETE-DATE-YY > 70
               MOVE 19 TO DELETE-DATE-CC
           ELSE
               MOVE 20 TO DELETE-DATE-CC.
025000
025100     PERFORM 11-CALC-DELETE-DATE
025200         UNTIL DELETE-DATE-MM > PO-DELETE-MONTHS.
025300
025400     SUBTRACT PO-DELETE-MONTHS  FROM  DELETE-DATE-MM.
025500     DISPLAY "DELETE DATE ", DELETE-DATE-CN.
025600
026200 1-HSK-X.
026300     EXIT.
026400
026500 11-CALC-DELETE-DATE.
      *-----USE CENTURY IN CALCULATION
           IF DELETE-DATE-YY > 0
               SUBTRACT 1                   FROM DELETE-DATE-YY
           ELSE
               SUBTRACT 1 FROM DELETE-DATE-CC
               MOVE 99 TO DELETE-DATE-YY.
026700     ADD 12                       TO DELETE-DATE-MM.
026800
026900 2-CLOSE-FILES.
           CLOSE DPORECDH-I, DPOITEMH-I, DPODESCH-I, DRCVITEMH-I,
                 DPOFREIGHTH-I, DINVRCDH-I, DINVITMH-I,
                 DINVACCTH-I, DVENDORH-I, DPODELETE-O, MPLTINFO-I,
027500           DRCVCORRH-I.
027600 2-CLOSE-FILES-X.
027700     EXIT.
027800
027900
028000
028100******************************************************
028200**                                                  **
028300**   BLOWUP ROUTINE                                 **
028400**                                                  **
028500******************************************************
028600
028700 2-BLOWUP.
028800     MOVE "TPOHDELT"              TO BU-PGM-NAME.
028900     MOVE PO-ARG                  TO BU-DISPLAY-FLD (1).
029000     MOVE RCVR-ARG                TO BU-DISPLAY-FLD (2).
029100     MOVE REG-ARG                 TO BU-DISPLAY-FLD (3).
029200     CALL "TBLOWUP" USING BASE-STHIST, BU-PGM-NAME, STATUS-AREA,
029300         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
029400             BU-DISPLAY-FLDS.
029500
029600
029700
029800 6-MAIN.
029900     PERFORM 60-ACCEPT-OPTIONS.
030000
           ACCEPT TIME-OF-DAY FROM TIME.
030100     DISPLAY "** BEGINNING SEARCH FOR POs TO DELETE ",
030200         TIME-OF-DAY.
030300
030400     OPEN OUTPUT PO-DELETE-FILE.
           MOVE 0 TO COND-WORD.
030500     PERFORM 61-READ-PO-HEADER-DSET  THRU 61-RPHD-X
030600         UNTIL END-OF-FILE  OR PO-DELETE-CTR > PO-DELETE-NO.
030700     CLOSE PO-DELETE-FILE.
030800
           ACCEPT TIME-OF-DAY FROM TIME.
030900     DISPLAY "** END OF SEARCH FOR POs TO DELETE ", TIME-OF-DAY.
031000     DISPLAY PO-DELETE-CTR, " POs WILL BE DELETED FROM HISTORY".
           ACCEPT TIME-OF-DAY FROM TIME.
031100     DISPLAY "** SORTING PO-DELETE-FILE ", TIME-OF-DAY.
031200
031300     SORT SORT-FILE ON ASCENDING KEY SORT-PO-NUM
031400         USING PO-DELETE-FILE
031500         GIVING PO-DELETE-FILE.
031600
           ACCEPT TIME-OF-DAY FROM TIME.
031700     DISPLAY "** STARTING TO COPY POs TO 'POHIST01' ",
031800         TIME-OF-DAY.
031900
032000     OPEN INPUT PO-DELETE-FILE.
032100     OPEN OUTPUT PO-HISTORY-FILE.
032200     MOVE SPACES                  TO PO-HISTORY-REC.
032300     PERFORM 62-UPDATE-PO-HISTORY THRU  62-UPH-X.
032400     CLOSE PO-DELETE-FILE,
032500           PO-HISTORY-FILE.
032600
           ACCEPT TIME-OF-DAY FROM TIME.
032700     DISPLAY "** COMPLETED COPY OF ALL POs ELIGIBLE DELETION ",
032800         TIME-OF-DAY.
           ACCEPT TIME-OF-DAY FROM TIME.
032900     DISPLAY "** STARTING TO DELETE POs FROM HISTORY DB 'STHIST' ",
033000         TIME-OF-DAY.
033100
033200     OPEN INPUT PO-DELETE-FILE.
033300     PERFORM 63-DELETE-PO  THRU 63-DP-X.
033400     CLOSE PO-DELETE-FILE.
033500
           ACCEPT TIME-OF-DAY FROM TIME.
033600     DISPLAY " ".
033700     DISPLAY "**************************************************".
033800     DISPLAY "** DELETION PROCESS COMPLETED. ", TIME-OF-DAY.
033900     DISPLAY "** BE SURE TO BACKUP UP 'POHIST01' TO TAPE AND ".
034000     DISPLAY "** SAVE THE TAPE(S).  ONCE A SUCCESSFUL BACKUP IS ".
034100     DISPLAY "** COMPLETE YOU MAY PURGE 'POHIST01'.  MAKE SURE".
034200     DISPLAY "** 2 GOOD BACKUPS ARE MADE OF 'POHIST01' BEFORE".
034300     DISPLAY "** PURGING IT FROM THE SYSTEM|".
034400     DISPLAY "**************************************************".
034500
034600 6-MAIN-X.
034700     EXIT.
034800
034900 60-ACCEPT-OPTIONS.
035000*    DISPLAY "ENTER MAXIMUM NO. OF POs TO DELETE 'nnnnn' ".
035100*    ACCEPT PO-DELETE-MAX-NO.
035200     IF PO-DELETE-MAX-NO NUMERIC
035300         DISPLAY "MAX. NO. OF POs TO DELETE= ", PO-DELETE-MAX-NO
035400         MOVE PO-DELETE-MAX-NO    TO PO-DELETE-NO
035500         SUBTRACT 1 FROM PO-DELETE-NO
035600     ELSE
035700         MOVE "NUMBER OF POS TO DELETE VALUE NOT NUMERIC"
                   TO BU-DISPLAY-MSG
               MOVE PO-DELETE-MAX-NO TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
035900
036000
036100 61-READ-PO-HEADER-DSET.
036200**************************************
036300*                                    *
036400*  SERIAL READ ON DPORECD TO FIND    *
036500*  HEADER DATA                       *
036600*                                    *
036700**************************************
036800
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 11 TO COND-WORD
                   GO TO 61-RPHD-X
037400         ELSE
037500             MOVE "GET DPORECD *61-RPHD" TO BU-DISPLAY-MSG
037600             GO TO 2-BLOWUP.
037700
037800*****************************************************************
037900**   CHECK PO DELETION DATE TO SEE IF IT IS OLDER THAN DELETE
038000**   DATE. IF SO THEN WRITE IT TO THE DELETE FILE FOR
038100**   DELETION.  PO DELETION DATE IS THE DATE THE PO WAS
038200**   DELETED FROM THE LIVE DATA BASE AND PLACED IN HISTORY
038300**   DATA BASE
038400*****************************************************************
038500
038600     MOVE POH-DELETION-DATE    TO SAVE-PO-DELETE-DATE.
038700     IF SAVE-PO-DELETE-DATE < DELETE-DATE-CN
038800         ADD 1                    TO PO-DELETE-CTR
038900         MOVE POH-RCV-NO          TO PO-DEL-NUM
039000         WRITE PO-DEL-RCD.
039200
039300 61-RPHD-X.
039400     EXIT.
039500
039600
039700 62-UPDATE-PO-HISTORY.
039800     READ PO-DELETE-FILE
039900         AT END GO TO 62-UPH-X.
040000
040100     MOVE PO-DEL-NUM              TO  PO-ARG.
           MOVE PO-ARG       TO PORCVNO OF DPORECDH-REC-I.
           START DPORECDH-I KEY = PORCVNO OF DPORECDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
040600             GO TO 62-UPDATE-PO-HISTORY
040700         ELSE
040800             MOVE "FIND DPORECD *62-UPH" TO BU-DISPLAY-MSG
040900             GO TO 2-BLOWUP.
041000
           READ DPORECDH-I NEXT INTO BUF-DPORECD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
040600             GO TO 62-UPDATE-PO-HISTORY
               ELSE
041400             MOVE "GET DPORECD*62-UPH" TO BU-DISPLAY-MSG
041500             GO TO 2-BLOWUP.
           IF PORCVNO OF DPORECDH-REC-I NOT = PO-ARG
040600         GO TO 62-UPDATE-PO-HISTORY.
041600
041700     MOVE SPACES                  TO BUILD-DPORECD-BUFFER.
041800     MOVE BUF-DPORECD-H           TO DPORECD-DATA.
041900     PERFORM 621-GET-VENDOR-NAME.
042000
042100     MOVE "DPORECD"               TO PO-HIST-DSET-NAME.
042200     MOVE 236                     TO PO-HIST-REC-SIZE.
042300     MOVE BUILD-DPORECD-BUFFER    TO PO-HIST-DATA.
042400     PERFORM 70-WRITE-PO-HIST-REC.
042500
042600     PERFORM 701-LOAD-PO-ITEMS.
042700
042800     IF POH-LAST-RCVR = ZEROS
042900         NEXT SENTENCE
043000     ELSE
043100         MOVE PO-ARG              TO RCVR-ARG
043200         PERFORM 710-LOAD-RCVRS  THRU 710-LR-X.
043300
043400     PERFORM 720-LOAD-INVOICES.
043500
043600     GO TO 62-UPDATE-PO-HISTORY.
043700
043800 62-UPH-X.
043900     EXIT.
044000
044100 621-GET-VENDOR-NAME.
044200     MOVE POH-VEN-CODE            TO VEN-ARG.
           MOVE VEN-ARG TO VENCDE OF DVENDORH-REC-I.
           START DVENDORH-I KEY = VENCDE OF DVENDORH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
044600             MOVE "FIND DVENDOR * 621-GVN" TO BU-DISPLAY-MSG
044700             GO TO 2-BLOWUP.
044800
           READ DVENDORH-I NEXT INTO BUF-DVENDOR-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   NEXT SENTENCE
               ELSE
045500             MOVE "GET DVENDOR*621-GVN" TO BU-DISPLAY-MSG
045600             GO TO 2-BLOWUP
           ELSE
               IF VENCDE OF DVENDORH-REC-I NOT = VEN-ARG
                   NEXT SENTENCE
               ELSE
045800             MOVE VENH-NAME       TO DVENDOR-NAME.
045900
046100 63-DELETE-PO.
046200     READ PO-DELETE-FILE
046300         AT END
046400             GO 63-DP-X.
046500
046600     MOVE PO-DEL-NUM              TO  PO-ARG.
046700     PERFORM 631-UPDATE-DPODELETE.
046800
046900     CALL "SPOHTDL" USING BASE-STHIST,
047000                          PO-ARG.
047100
047200     GO TO 63-DELETE-PO.
047300
047400 63-DP-X.
047500     EXIT.
047600
047700 631-UPDATE-DPODELETE.
048400     MOVE PO-ARG                  TO PODEL-PO-RCV-NO.
048500     MOVE 1                       TO DATE-MODE.
048600     CALL "TDATECHK" USING DATE-CHECK-AREA.
048700     MOVE DATE-YMD-OUT            TO PODEL-DELETE-DATE
                                           TODAYS-DATE.
           IF YY > 70
              ADD 19000000 TO PODEL-DELETE-DATE
           ELSE
              ADD 20000000 TO PODEL-DELETE-DATE.
           WRITE DPODELETE-REC-O FROM BUF-DPODELETE-H
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
049100         MOVE "PUT DPODELETE 631-UD" TO BU-DISPLAY-MSG
049200         GO TO 2-BLOWUP.
049300
050000
050100 70-WRITE-PO-HIST-REC.
050200     MOVE PO-ARG                  TO PO-HIST-PO-NUM.
050300     WRITE PO-HISTORY-REC.
050400     MOVE SPACES                  TO PO-HISTORY-REC.
050500
050600
050700 701-LOAD-PO-ITEMS.
           MOVE PO-ARG TO PORCVNO OF DPOITEMH-REC-I.
           START DPOITEMH-I KEY = PORCVNO OF DPOITEMH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
051100             MOVE "FIND DPOITEM * 701-LPI" TO BU-DISPLAY-MSG
051200             GO TO 2-BLOWUP.
051300
           MOVE PO-ARG TO PORCVNO OF DPODESCH-REC-I.
           START DPODESCH-I KEY = PORCVNO OF DPODESCH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
051700             MOVE "FIND DPODESC * 701-LPI" TO BU-DISPLAY-MSG
051800             GO TO 2-BLOWUP.
051900
052000     MOVE ZEROS                   TO DPODESCH-ITEM-NO.
052100     MOVE "N"                     TO END-OF-DPODESC-ENTRIES.
052200     PERFORM 702-GET-DPODESC-COMMENTS
052300         UNTIL END-OF-DPODESC-ENTRIES = "Y"  OR
052400               DPODESCH-ITEM-NO NOT = ZEROS.
052500
052600     MOVE "N"                     TO END-OF-DPOITEM-ENTRIES.
052700     PERFORM 703-GET-DPOITEM
052800         UNTIL END-OF-DPOITEM-ENTRIES = "Y".
052900
053000
053100 702-GET-DPODESC-COMMENTS.
           READ DPODESCH-I NEXT INTO BUF-DPODESC-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
053600             MOVE "Y"             TO END-OF-DPODESC-ENTRIES
               ELSE
053800             MOVE "GET DPODESC * 702-GDC" TO BU-DISPLAY-MSG
053900             GO TO 2-BLOWUP
           ELSE
               IF PORCVNO OF DPODESCH-REC-I NOT = PO-ARG
                   MOVE "Y"             TO END-OF-DPODESC-ENTRIES
               ELSE
054100             IF DPODESCH-ITEM-NO = ZEROS
054200                 MOVE "DPODESC"       TO PO-HIST-DSET-NAME
054300                 MOVE 100             TO PO-HIST-REC-SIZE
054400                 MOVE BUF-DPODESC-H   TO PO-HIST-DATA
054500                 PERFORM 70-WRITE-PO-HIST-REC.
054600
054700
054800 703-GET-DPOITEM.
           READ DPOITEMH-I NEXT INTO BUF-DPOITEM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
055300             MOVE "Y"             TO END-OF-DPOITEM-ENTRIES
               ELSE
055500             MOVE "GET DPOITEM * 703-GD" TO BU-DISPLAY-MSG
055600             GO TO 2-BLOWUP
           ELSE
               IF PORCVNO OF DPOITEMH-REC-I NOT = PO-ARG
055300             MOVE "Y"             TO END-OF-DPOITEM-ENTRIES
055700         ELSE
055800             MOVE "DPOITEM"           TO PO-HIST-DSET-NAME
055900             MOVE 110                 TO PO-HIST-REC-SIZE
056000             MOVE BUF-DPOITEM-H       TO PO-HIST-DATA
056100             PERFORM 70-WRITE-PO-HIST-REC
056200             PERFORM 704-GET-DPODESC
056300                 UNTIL END-OF-DPODESC-ENTRIES = "Y" OR
056400                       DPODESCH-ITEM-NO > ITMH-NUMBER.
056500
056600
056700 704-GET-DPODESC.
056800     IF DPODESCH-ITEM-NO < ITMH-NUMBER
056900         NEXT SENTENCE
057000     ELSE
057100     IF DPODESCH-ITEM-NO = ITMH-NUMBER
057200         MOVE "DPODESC"           TO PO-HIST-DSET-NAME
057300         MOVE 100                 TO PO-HIST-REC-SIZE
057400         MOVE BUF-DPODESC-H       TO PO-HIST-DATA
057500         PERFORM 70-WRITE-PO-HIST-REC.
057600
057700     IF DPODESCH-ITEM-NO > ITMH-NUMBER
057800         NEXT SENTENCE
057900     ELSE
               READ DPODESCH-I NEXT INTO BUF-DPODESC-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS END-READ
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
053600                 MOVE "Y"             TO END-OF-DPODESC-ENTRIES
                   ELSE
058600                 MOVE "GET DPODESC * 704-GD" TO BU-DISPLAY-MSG
058700                 GO TO 2-BLOWUP
               ELSE
                   IF PORCVNO OF DPODESCH-REC-I NOT = PO-ARG
                       MOVE "Y"             TO END-OF-DPODESC-ENTRIES.
058900
059000 710-LOAD-RCVRS.
059100     ADD 1                        TO BUILD-RCVR-NO.
           MOVE RCVR-ARG TO PORCVNO OF DPOFREIGHTH-REC-I.
           START DPOFREIGHTH-I KEY = PORCVNO OF DPOFREIGHTH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
059600             GO TO 710-CHECK-RCVR-NO
059700         ELSE
059800             MOVE "FIND DPOFREIGHT * 710-LR" TO BU-DISPLAY-MSG
059900             GO TO 2-BLOWUP.
060000
           MOVE ZEROS TO COND-WORD.
060100     PERFORM 711-GET-DPOFREIGHT
060200         UNTIL END-OF-CHAIN.
060300
           MOVE RCVR-ARG TO PORCVNO OF DRCVITEMH-REC-I.
           START DRCVITEMH-I KEY = PORCVNO OF DRCVITEMH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
060700             MOVE "FIND DRCVITEM * 710-LR" TO BU-DISPLAY-MSG
060800             GO TO 2-BLOWUP.
060900
           MOVE RCVR-ARG TO PORCVNO OF DPODESCH-REC-I.
           START DPODESCH-I KEY = PORCVNO OF DPODESCH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
061300             MOVE "FIND DPODESC * 710-LR" TO BU-DISPLAY-MSG
061400             GO TO 2-BLOWUP.
061500
           MOVE RCVR-ARG TO PORCVNO OF DRCVCORRH-REC-I.
           START DRCVCORRH-I KEY = PORCVNO OF DRCVCORRH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
061300             MOVE "FIND DRCVCORR * 710-LR" TO BU-DISPLAY-MSG
061400             GO TO 2-BLOWUP.
061500
061600     MOVE SPACES                  TO BUF-DPODESC-H
                                           BUF-DRCVCORR-H.
061700     MOVE "N"                     TO END-OF-DRCVITEM-ENTRIES,
061800                                     END-OF-DPODESC-ENTRIES
                                           END-OF-DRCVCORR-ENTRIES.
061900     PERFORM 712-GET-DRCVITEM
062000         UNTIL END-OF-DRCVITEM-ENTRIES = "Y".
062100
062200 710-CHECK-RCVR-NO.
062300     IF BUILD-RCVR-NO = POH-LAST-RCVR
062400         NEXT SENTENCE
062500     ELSE
062600         GO TO 710-LOAD-RCVRS.
062700
062800 710-LR-X.
062900     EXIT.
063000
063100
063200 711-GET-DPOFREIGHT.
           READ DPOFREIGHTH-I NEXT INTO BUF-DPOFREIGHT-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
063900             MOVE "GET DPOFREIGHT * 711-GD" TO BU-DISPLAY-MSG
064000             GO TO 2-BLOWUP
           ELSE
           IF PORCVNO OF DPOFREIGHTH-REC-I NOT = RCVR-ARG
               MOVE 15 TO COND-WORD
064100     ELSE
064200         MOVE "DPOFREIGHT"        TO PO-HIST-DSET-NAME
064300         MOVE 192                 TO PO-HIST-REC-SIZE
064400         MOVE BUF-DPOFREIGHT-H    TO PO-HIST-DATA
064500         PERFORM 70-WRITE-PO-HIST-REC.
064600
064700
064800 712-GET-DRCVITEM.
           READ DRCVITEMH-I NEXT INTO BUF-DRCVITEM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
065300             MOVE "Y"         TO END-OF-DRCVITEM-ENTRIES
065400         ELSE
065500             MOVE "GET DRCVITEM * 712-GD" TO BU-DISPLAY-MSG
065600             GO TO 2-BLOWUP
           ELSE
           IF PORCVNO OF DRCVITEMH-REC-I NOT = RCVR-ARG
065300         MOVE "Y"         TO END-OF-DRCVITEM-ENTRIES
064100     ELSE
065800         MOVE "DRCVITEM"          TO PO-HIST-DSET-NAME
065900         MOVE 36                  TO PO-HIST-REC-SIZE
066000         MOVE BUF-DRCVITEM-H      TO PO-HIST-DATA
066100         PERFORM 70-WRITE-PO-HIST-REC
066200         PERFORM 713-GET-DPODESC
066300             UNTIL END-OF-DPODESC-ENTRIES = "Y" OR
066400                   DPODESCH-ITEM-NO > RCVH-ITEM-NUMBER.
               PERFORM 714-GET-DRCVCORR
                   UNTIL END-OF-DRCVCORR-ENTRIES = "Y" OR
                          CORR-ITEM-H > RCVH-ITEM-NUMBER.
066500
066600 713-GET-DPODESC.
066700     IF DPODESCH-ITEM-NO < RCVH-ITEM-NUMBER
066800         NEXT SENTENCE
066900     ELSE
067000     IF DPODESCH-ITEM-NO = RCVH-ITEM-NUMBER
067100         MOVE "DPODESC"           TO PO-HIST-DSET-NAME
067200         MOVE 100                 TO PO-HIST-REC-SIZE
067300         MOVE BUF-DPODESC-H       TO PO-HIST-DATA
067400         PERFORM 70-WRITE-PO-HIST-REC.
067500
067600     IF DPODESCH-ITEM-NO > RCVH-ITEM-NUMBER
067700         NEXT SENTENCE
067800     ELSE
               READ DPODESCH-I NEXT INTO BUF-DPODESC-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS END-READ
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
053600                 MOVE "Y"             TO END-OF-DPODESC-ENTRIES
                   ELSE
068500                 MOVE "GET DPODESC * 713-GD" TO BU-DISPLAY-MSG
068600                 GO TO 2-BLOWUP
               ELSE
                   IF PORCVNO OF DPODESCH-REC-I NOT = RCVR-ARG
                       MOVE "Y"             TO END-OF-DPODESC-ENTRIES.
068700
       714-GET-DRCVCORR.
066700     IF CORR-ITEM-H < RCVH-ITEM-NUMBER
066800         NEXT SENTENCE
066900     ELSE
067000     IF CORR-ITEM-H = RCVH-ITEM-NUMBER
067100         MOVE "DRCVCORR"          TO PO-HIST-DSET-NAME
067200         MOVE 174                 TO PO-HIST-REC-SIZE
067300         MOVE BUF-DRCVCORR-H      TO PO-HIST-DATA
067400         PERFORM 70-WRITE-PO-HIST-REC.
067500
067600     IF CORR-ITEM-H > RCVH-ITEM-NUMBER
067700         NEXT SENTENCE
067800     ELSE
               READ DRCVCORRH-I NEXT INTO BUF-DRCVCORR-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS END-READ
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
053600                 MOVE "Y"             TO END-OF-DRCVCORR-ENTRIES
                   ELSE
068500                 MOVE "GET DRCVCORR* 714-GD" TO BU-DISPLAY-MSG
068600                 GO TO 2-BLOWUP
               ELSE
                   IF PORCVNO OF DRCVCORRH-REC-I NOT = RCVR-ARG
                       MOVE "Y"             TO END-OF-DRCVCORR-ENTRIES.
068800
068900 720-LOAD-INVOICES.
           MOVE PO-ARG TO PORCVNO OF DINVRCDH-REC-I.
           START DINVRCDH-I KEY = PORCVNO OF DINVRCDH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
069300             MOVE "FIND DINVRCD * 720-LI" TO BU-DISPLAY-MSG
069400             GO TO 2-BLOWUP.
069500
069600     MOVE "N"                     TO END-OF-DINVRCD-ENTRIES.
069700     PERFORM 721-GET-DINVRCD
069800         UNTIL END-OF-DINVRCD-ENTRIES = "Y".
069900
070000 721-GET-DINVRCD.
           READ DINVRCDH-I NEXT INTO BUF-DINVRCD-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
070500             MOVE "Y"         TO END-OF-DINVRCD-ENTRIES
               ELSE
070700             MOVE "GET DINVRCD * 721-GD" TO BU-DISPLAY-MSG
070800             GO TO 2-BLOWUP
           ELSE
           IF PORCVNO OF DINVRCDH-REC-I NOT = PO-ARG
070500         MOVE "Y"         TO END-OF-DINVRCD-ENTRIES
070900     ELSE
071000         MOVE "DINVRCD"           TO PO-HIST-DSET-NAME
071100         MOVE 496                 TO PO-HIST-REC-SIZE
071200         MOVE BUF-DINVRCD-H       TO PO-HIST-DATA
071300         PERFORM 70-WRITE-PO-HIST-REC
071400         PERFORM 722-LOAD-INVOICE-ITEMS.
071500
071600 722-LOAD-INVOICE-ITEMS.
071700     MOVE INVH-REG-NO             TO REG-ARG.
           MOVE REG-ARG TO REGISTERNO OF DINVITMH-REC-I.
           START DINVITMH-I KEY = REGISTERNO OF DINVITMH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
072100             MOVE "FIND DINVITM * 722-LII" TO BU-DISPLAY-MSG
072200             GO TO 2-BLOWUP.
072300
           MOVE REG-ARG TO REGISTERNO OF DINVACCTH-REC-I.
           START DINVACCTH-I KEY = REGISTERNO OF DINVACCTH-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
072700             MOVE "FIND DINVACCT * 722-LII" TO BU-DISPLAY-MSG
072800             GO TO 2-BLOWUP.
072900
073000     MOVE SPACES                  TO BUF-DINVACCT-H.
073100     MOVE ZEROS                   TO INVACCTH-ITEM.
073100     MOVE ZEROS                   TO INVACCTH-LINE.
073200     MOVE "N"                     TO END-OF-DINVITM-ENTRIES,
073300                                     END-OF-DINVACCT-ENTRIES.
073400     PERFORM 723-GET-DINVITM
073500         UNTIL END-OF-DINVITM-ENTRIES = "Y".
073600
073700 723-GET-DINVITM.
           READ DINVITMH-I NEXT INTO BUF-DINVITM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
074200             MOVE "Y"             TO END-OF-DINVITM-ENTRIES
               ELSE
074400             MOVE "GET DINVITM * 723-GD" TO BU-DISPLAY-MSG
074500             GO TO 2-BLOWUP
           ELSE
           IF REGISTERNO OF DINVITMH-REC-I NOT = REG-ARG
074200         MOVE "Y"             TO END-OF-DINVITM-ENTRIES
074600     ELSE
074700         IF INVITMH-PO-NUM = INVH-PO-RLSE
074800             MOVE "DINVITM"       TO PO-HIST-DSET-NAME
074900             MOVE 66              TO PO-HIST-REC-SIZE
075000             MOVE BUF-DINVITM-H   TO PO-HIST-DATA
075100             PERFORM 70-WRITE-PO-HIST-REC
075200             PERFORM 724-GET-DINVACCT
075300                 UNTIL END-OF-DINVACCT-ENTRIES = "Y" OR
075400                       INVACCTH-ITEM > INVITMH-ITEM-NO.
075500
075600 724-GET-DINVACCT.
075700     IF INVACCTH-ITEM < INVITMH-ITEM-NO
075800         NEXT SENTENCE
075900     ELSE
076000     IF INVACCTH-ITEM = INVITMH-ITEM-NO
076100         IF INVACCTH-PO-NUM = INVH-PO-RLSE
076200             MOVE "DINVACCT"      TO PO-HIST-DSET-NAME
076300             MOVE 40              TO PO-HIST-REC-SIZE
076400             MOVE BUF-DINVACCT-H  TO PO-HIST-DATA
076500             PERFORM 70-WRITE-PO-HIST-REC.
076600
076700     IF INVACCTH-ITEM > INVITMH-ITEM-NO
076800         NEXT SENTENCE
076900     ELSE
               READ DINVACCTH-I NEXT INTO BUF-DINVACCT-H
                   AT END MOVE FILE-STATUS TO FILE-STATUS END-READ
               IF FILE-STATUS NOT = "00"
                   IF FILE-STATUS = "10" OR "14" OR "46"
077400                 MOVE "Y"         TO END-OF-DINVACCT-ENTRIES
                   ELSE
077600                 MOVE "GET DINVACCT * 724-GD" TO BU-DISPLAY-MSG
077700                 GO TO 2-BLOWUP
               ELSE
               IF REGISTERNO OF DINVACCTH-REC-I NOT = REG-ARG
077400             MOVE "Y"         TO END-OF-DINVACCT-ENTRIES.
