$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$      DO NOT RECOMPILE THIS PROGRAM.  THIS NEEDS TO BE COMPILED $$
$$$$$      AT A PRE H01 RELEASE OF CSIS/MMIS.  FOR RELEASE H01 AND   $$
$$$$$      AND ABOVE, USE THE TPOHPRNT OBJECT.                       $$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPOHPRNT.
000400 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000500 DATE-WRITTEN.  MAR. 21, 1988.
000700
000800***********************************************************
000900**                                                       **
001000**    T P O H P R N T                                    **
001100**                                                       **
001200**   THIS PROGRAM PRINTS ALL PURCHASE ORDER, RECEIPT,    **
001300**   AND INVOICE INFORMATION ON A PARTICULAR PURCHASE    **
001400**   ORDER THAT HAS BEEN DELETED FROM THE HISTORY DATA   **
001500**   BASE AND SAVED IN AN MPE FILE 'POHIST01'.  THIS     **
001600**   FILE 'POHIST01' IS SAVED TO TAPE AND RESTORED       **
001700**   ONTO THE SYSTEM WHEN A USER WISHES TO PRINT INFO.   **
001800**   ON A DESIRED PO.  THE CORRECT TAPE CONTAINING THE   **
001900**   PURCHASE ORDER MUST BE RESTORED.  THE DELETION      **
002000**   DATE FROM HISTORY WILL BE PROVIDED BY THE USER      **
002100**   SO THE CORRECT TAPE CAN BE USED TO DO THE RESTORE.  **
002200**                                                       **
002300**       XRSCREEN REPORT NO. - 85                        **
002400**       REPORT HEADER       - DHDRPT85.PUB              **
002500**       FORM FILE IN FRSCREEN - POHPRNT                 **
002600**                                                       **
002700***********************************************************
002800
002900
003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.   HP-3000.
003300 OBJECT-COMPUTER.   HP-3000.
003400 SPECIAL-NAMES.  C01 IS NEW-PAGE.
003600
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
004000     SELECT PO-HISTORY-FILE ASSIGN TO DISK-POHIST01.
004100
004200 DATA DIVISION.
004300 FILE SECTION.
004400
004500 FD  ONLINE-PRT
004600     DATA RECORD IS PRT-REC
004700     RECORD CONTAINS 133 CHARACTERS
004800     LABEL RECORDS ARE OMITTED.
004900 01  PRT-REC                       PIC X(133).
005000
005100********************************************************
005200**
005300**   FILE NAME IS 'POHIST01' AND IS VARIABLE IN LENGTH
005400**   FROM 54 TO 520 BYTES
005500**
005600********************************************************
005700
005800 FD  PO-HISTORY-FILE
006000     LABEL RECORDS ARE OMITTED
006100     DATA RECORD IS PO-HISTORY-REC.
006200 01  PO-HISTORY-REC.
006300     05  PO-HIST-PO-NUM.
006400         10  PO-HIST-PO-REL       PIC X(10).
006500         10  FILLER               PIC X(4).
006600     05  PO-HIST-DSET-NAME        PIC X(10).
006700     05  PO-HIST-DATA             PIC X(496).
006800
006900 WORKING-STORAGE SECTION.
007000 77  END-OF-FILE-SW               PIC X(1)     VALUE SPACES.
007100 77  PAGE-CTR                     PIC 9(4) COMP-4 VALUE ZEROS.
007200 77  LINE-CTR                     PIC 9(4) COMP-4 VALUE ZEROS.
007300 77  FIRST-RCVR-RECORD            PIC X(1)     VALUE SPACES.
007400 77  FIRST-INV-RECORD             PIC X(1)     VALUE SPACES.
007500 77  CE-SUB                       PIC S9(4) COMP-4 VALUE ZEROS.
007600 77  TAX-SUB                      PIC S9(4) COMP-4 VALUE ZEROS.
007700 77  FOUND-CE-AMT-SW              PIC X(1)     VALUE SPACES.
007800 77  FOUND-ACCRUED-TAX-SW         PIC X(1)     VALUE SPACES.
007900 77  PO-FOUND-SW                  PIC X(1)     VALUE SPACES.
008000
008500 01  BUILD-DPORECD-BUFFER.
008600     05  DPORECD-DATA             PIC X(192).
008700     05  DVENDOR-NAME             PIC X(44).
008800
008900***************************************************************
009000**                                                           **
009100**                 REPORT PRINT LINES                        **
009200**                                                           **
009300***************************************************************
009400
009500 01  HEADER1.
009600     05  FILLER  PIC X(9)  VALUE " TPOHPRNT".
009700     05  FILLER  PIC X(21) VALUE SPACES.
009800     05  FILLER  PIC X(23) VALUE "PURCHASE ORDER HISTORY ".
009900     05  FILLER  PIC X(13) VALUE "PRINT FOR PO ".
010000     05  PRT-PO-NUM-HDR  PIC X(7) VALUE SPACES.
010100     05  FILLER  PIC X(1)  VALUE "-".
010200     05  PRT-PO-REL-HDR  PIC X(3) VALUE SPACES.
010300     05  FILLER  PIC X(9)  VALUE SPACES.
010400     05  FILLER  PIC X(5)  VALUE "DATE ".
010500     05  PRT-DATE  PIC X(8)  VALUE SPACES.
010600     05  FILLER  PIC X(6)  VALUE " TIME ".
010700     05  PRT-TIME  PIC X(8)  VALUE SPACES.
010800     05  FILLER  PIC X(9)  VALUE "    PAGE ".
010900     05  PRT-PAGE-NO  PIC ZZZ9 VALUE ZEROS.
011000
011100 01  DASH-LINE.
011200     05  FILLER  PIC X(132) VALUE ALL "-".
011300
011400 01  DETAIL-LINE-PO1.
011500     05  FILLER  PIC X(14) VALUE SPACES.
011600     05  FILLER  PIC X(26) VALUE "PO DATE EXP DATE RCV DEPT ".
011700     05  FILLER  PIC X(29) VALUE "FOR DEPT    BUDGET NO BUDGET ".
011800     05  FILLER  PIC X(20) VALUE "AMOUNT  TERMS       ".
011900     05  FILLER  PIC X(16) VALUE "BUYER/TYPIST    ".
012000     05  FILLER  PIC X(15) VALUE "ADDITIONAL INFO".
012100
012200 01  DETAIL-LINE-PO2.
012300     05  PRT-PO-NUM2 PIC X(7).
012400     05  FILLER PIC X(1).
012500     05  PRT-PO-REL2 PIC X(3).
012600     05  FILLER PIC X(2).
012700     05  PRT-PO-DATE PIC X(8).
012800     05  FILLER PIC X(1).
012900     05  PRT-EXP-DATE PIC X(8).
013000     05  FILLER PIC X(3).
013100     05  PRT-RCV-DEPT PIC X(6).
013200     05  FILLER PIC X(3).
013300     05  PRT-FOR-DEPT PIC X(6).
013400     05  FILLER PIC X(1).
013500     05  PRT-BUDGET-NO PIC X(12).
013600     05  FILLER PIC X(2).
013700     05  PRT-BUDGET-AMT PIC Z(11)9.
013800     05  FILLER PIC X(4).
013900     05  PRT-TERMS PIC X(2).
014000     05  FILLER PIC X(2).
014100     05  PRT-BUYER PIC X(15).
014200     05  FILLER PIC X(1).
014300     05  PRT-TYPIST  PIC X(3).
014400     05  FILLER PIC X(3).
014500     05  PRT-ADDL-INFO PIC X(16).
014600
014700 01  DETAIL-LINE-PO3.
014800     05  FILLER  PIC X(11) VALUE SPACES.
014900     05  FILLER  PIC X(3) VALUE "VIA".
015000     05  FILLER  PIC X(18) VALUE SPACES.
015100     05  FILLER  PIC X(3) VALUE "FOB".
015200     05  FILLER  PIC X(13) VALUE SPACES.
015300     05  FILLER  PIC X(29) VALUE "VENDOR CODE  NO. OF RECEIVERS".
015400     05  FILLER  PIC X(29) VALUE "  CURRENCY CODE DELETION DATE".
015500     05  FILLER  PIC X(14) VALUE "  LAST PAYMENT".
015600
015700 01  DETAIL-LINE-PO4.
015800     05  FILLER  PIC X(5).
015900     05  PRT-VIA PIC X(20).
016000     05  FILLER  PIC X(1).
016100     05  PRT-FOB PIC X(20).
016200     05  FILLER  PIC X(3).
016300     05  PRT-VENDOR-CODE PIC X(10).
016400     05  FILLER  PIC X(2).
016500     05  PRT-NON-RCVR-LIT PIC X(14).
016600     05  PRT-NO-OF-RCVR-AREA REDEFINES PRT-NON-RCVR-LIT.
016700         10  FILLER  PIC X(5).
016800         10  PRT-NO-OF-RCVRS  PIC ZZ9.
016900         10  FILLER  PIC X(6).
017000     05  FILLER  PIC X(9).
017100     05  PRT-CURR-CODE  PIC X(2).
017200     05  FILLER  PIC X(9).
017300     05  PRT-DELETE-DATE PIC X(8).
017400     05  FILLER PIC X(9).
017500     05  PRT-LAST-PAYMENT PIC X(4).
017600
017700 01  DETAIL-LINE-PO5.
017800     05  FILLER PIC X(10) VALUE SPACES.
017900     05  FILLER  PIC X(13) VALUE "VENDOR NAME: ".
018000     05  PRT-VENDOR-NAME  PIC X(44) VALUE SPACES.
018100
018200 01  DETAIL-LINE-PO6.
018300     05  FILLER  PIC X(20) VALUE "     ITEM   CODE    ".
018400     05  FILLER  PIC X(24) VALUE "REQ NUMBER      QUANTITY".
018500     05  FILLER  PIC X(9)  VALUE SPACES.
018600     05  FILLER  PIC X(9)  VALUE "DELIVERED".
018700     05  FILLER  PIC X(10) VALUE SPACES.
018800     05  FILLER  PIC X(26) VALUE "PAID      UM    UNIT PRICE".
018900     05  FILLER  PIC X(23) VALUE "    UM ACCOUNTING INFO ".
019000     05  FILLER  PIC X(8)  VALUE "TAX CODE".
019100
019200 01  DETAIL-LINE-PO7.
019300     05  FILLER PIC X(5).
019400     05  PRT-ITEM PIC X(4).
019500     05  FILLER PIC X(1).
019600     05  PRT-CODE PIC X(7).
019700     05  FILLER PIC X(1).
019800     05  PRT-REQ  PIC X(12).
019900     05  FILLER PIC X(1).
020000     05  PRT-PO-QTY PIC Z(10)9.9999.
020100     05  FILLER PIC X(1).
020200     05  PRT-DLVR-QTY PIC Z(10)9.9999.
020300     05  FILLER PIC X(1).
020400     05  PRT-PAID-QTY PIC Z(10)9.9999.
020500     05  FILLER PIC X(1).
020600     05  PRT-QTY-UM PIC X(2).
020700     05  FILLER PIC X(1).
020800     05  PRT-UNIT-PRICE PIC Z(10)9.9999.
020900     05  FILLER PIC X(1).
021000     05  PRT-PRICE-UM PIC X(2).
021100     05  FILLER PIC X(1).
021200     05  PRT-CLASS PIC X(3).
021300     05  FILLER PIC X(1).
021400     05  PRT-DEPT PIC X(4).
021500     05  FILLER PIC X(1).
021600     05  PRT-ACCT PIC X(6).
021700     05  FILLER PIC X(4).
021800     05  PRT-ITEM-TAX-CODE PIC X(2).
021900
022000 01  DETAIL-LINE-PO8.
022100     05  FILLER PIC X(10) VALUE SPACES.
022200     05  FILLER PIC X(24) VALUE "DATE RCVD  DATE STORED  ".
022300     05  FILLER PIC X(11) VALUE "ZBILL VALUE".
022400
022500 01  DETAIL-LINE-PO9.
022600     05  FILLER  PIC X(11).
022700     05  PRT-RCVR-DATE PIC X(8).
022800     05  FILLER  PIC X(4).
022900     05  PRT-STORED-DATE PIC X(8).
023000     05  FILLER  PIC X(2).
023100     05  PRT-ZBILL-VALUE PIC Z(12).
023200
023300 01  DETAIL-LINE-DESC.
023400     05  FILLER PIC X(20).
023500     05  PRT-DESC PIC X(80).
023600
023700 01  DETAIL-LINE-RCVR1.
023800     05  FILLER  PIC X(5) VALUE SPACES.
023900     05  FILLER  PIC X(32) VALUE ALL "*".
024000     05  FILLER  PIC X(18) VALUE "  RECEIVING DATA  ".
024100     05  FILLER  PIC X(70) VALUE ALL "*".
024200
024300 01  DETAIL-LINE-RCVR2.
024400     05  FILLER  PIC X(5) VALUE SPACES.
024500     05  FILLER  PIC X(29) VALUE "RECEIVER NO  SEQ. NO PACKING ".
024600     05  FILLER  PIC X(23) VALUE "SLIP EMPL TYPE CARRIER ".
024700     05  FILLER  PIC X(28) VALUE "FREIGHT BILL NO.     CHARGES".
024800     05  FILLER  PIC X(27) VALUE "     BILL DATE  DATE RCVD  ".
024900     05  FILLER  PIC X(12) VALUE "ARRIVAL DATE".
025000
025100 01  DETAIL-LINE-RCVR3.
025200     05  FILLER  PIC X(8).
025300     05  PRT-RCVR-NO  PIC X(3).
025400     05  FILLER  PIC X(8).
025500     05  PRT-RCVR-SEQ-NO PIC X(6).
025600     05  FILLER PIC X(1).
025700     05  PRT-PACKING-SLIP PIC X(12).
025800     05  FILLER PIC X(1).
025900     05  PRT-EMPL PIC X(4).
026000     05  FILLER PIC X(2).
026100     05  PRT-FRT-TYPE PIC X(1).
026200     05  FILLER PIC X(5).
026300     05  PRT-CARRIER PIC X(4).
026400     05  FILLER PIC X(2).
026500     05  PRT-FRT-BILL-NO PIC X(16).
026600     05  FILLER PIC X(1).
026700     05  PRT-CHARGES PIC Z(10)9.99.
026800     05  FILLER PIC X(2).
026900     05  PRT-BILL-DATE PIC X(8).
027000     05  FILLER PIC X(4).
027100     05  PRT-DATE-RCVD PIC X(8).
027200     05  FILLER PIC X(4).
027300     05  PRT-ARRIVAL-DATE PIC X(8).
027400
027500 01  DETAIL-LINE-RCVR4.
027600     05  FILLER  PIC X(13) VALUE SPACES.
027700     05  FILLER PIC X(30) VALUE "SPLC    CARRIER WT   OUR WT   ".
027800     05  FILLER PIC X(25) VALUE "RAIL CAR  LOT NO.  OSD   ".
027900     05  FILLER PIC X(11) VALUE "INV REG. NO".
028000
028100 01  DETAIL-LINE-RCVR5.
028200     05  FILLER  PIC X(10).
028300     05  PRT-SPLC PIC X(10).
028400     05  FILLER PIC X(2).
028500     05  PRT-CARRIER-WT PIC Z(8).
028600     05  FILLER PIC X(1).
028700     05  PRT-OUR-WT PIC Z(8).
028800     05  FILLER PIC X(1).
028900     05  PRT-RAIL-CAR  PIC X(10).
029000     05  FILLER PIC X(3).
029100     05  PRT-LOT-NO PIC X(4).
029200     05  FILLER PIC X(4).
029300     05  PRT-OSD PIC X(3).
029400     05  FILLER PIC X(4).
029500     05  PRT-INV-REG-NO PIC X(6).
029600
029700 01  DETAIL-LINE-RCVR6.
029800     05  FILLER PIC X(10) VALUE SPACES.
029900     05  FILLER PIC X(21) VALUE "ITEM    CODE     QTY ".
030000     05  FILLER PIC X(13) VALUE "DELIVERED  UM".
030100
030200 01  DETAIL-LINE-RCVR7.
030300     05  FILLER PIC X(10).
030400     05  PRT-RCVR-ITEM PIC X(4).
030500     05  FILLER PIC X(2).
030600     05  PRT-RCVR-CODE PIC X(7).
030700     05  FILLER PIC X(1).
030800     05  PRT-RCVR-QTY PIC Z(10)9.9999.
030900     05  FILLER PIC X(2).
031000     05  PRT-RCVR-UM PIC X(2).
031100
031200 01  DETAIL-LINE-INV1.
031300     05  FILLER PIC X(5) VALUE SPACES.
031400     05  FILLER PIC X(32) VALUE ALL "*".
031500     05  FILLER PIC X(16) VALUE "  INVOICE DATA  ".
031600     05  FILLER PIC X(71) VALUE ALL "*".
031700
031800 01  DETAIL-LINE-INV2.
031900     05  FILLER PIC X(5) VALUE SPACES.
032000     05  FILLER PIC X(28) VALUE "REGISTER  MANIFEST  INVOICE ".
032100     05  FILLER PIC X(28) VALUE "NO  INVOICE DATE ENTRY DATE ".
032200     05  FILLER PIC X(29) VALUE "DUE DATE MOD DATE CHECK DATE ".
032300     05  FILLER PIC X(30) VALUE "CHECK NO TERMS ADD MODIFY  CPW".
032400
032500 01  DETAIL-LINE-INV3.
032600     05  FILLER PIC X(7).
032700     05  PRT-REGISTER-NO PIC X(6).
032800     05  FILLER PIC X(3).
032900     05  PRT-MANIFEST-NO PIC X(3).
033000     05  FILLER PIC X(1).
033100     05  PRT-MANIFEST-YY PIC X(2).
033200     05  FILLER PIC X(3).
033300     05  PRT-INV-NO PIC X(10).
033400     05  FILLER PIC X(4).
033500     05  PRT-INV-DATE PIC X(8).
033600     05  FILLER PIC X(4).
033700     05  PRT-ENTRY-DATE PIC X(8).
033800     05  FILLER PIC X(2).
033900     05  PRT-DUE-DATE PIC X(8).
034000     05  FILLER PIC X(1).
034100     05  PRT-MOD-DATE PIC X(8).
034200     05  FILLER PIC X(2).
034300     05  PRT-CHECK-DATE PIC X(8).
034400     05  FILLER PIC X(2).
034500     05  PRT-CHECK-NO PIC X(8).
034600     05  FILLER PIC X(2).
034700     05  PRT-INV-TERMS PIC X(2).
034800     05  FILLER PIC X(3).
034900     05  PRT-ADD-CLERK PIC X(4).
035000     05  FILLER PIC X(1).
035100     05  PRT-MOD-CLERK PIC X(4).
035200     05  FILLER PIC X(3).
035300     05  PRT-CPW PIC X(4).
035400     05  FILLER PIC X(2).
035500     05  PRT-NO-CHECK-LIT PIC X(8).
035600
035700 01  DETAIL-LINE-INV4.
035800     05  FILLER PIC X(13) VALUE SPACES.
035900     05  FILLER PIC X(23) VALUE "PO EXTENSION   INVOICE ".
036000     05  FILLER PIC X(16) VALUE "EXTENSION     ".
036100     05  FILLER PIC X(25) VALUE "ADDITIONAL CHARGES       ".
036200     05  FILLER PIC X(22) VALUE "CLASS OF ENTRIES      ".
036300     05  FILLER PIC X(11) VALUE "ACCRUED TAX".
036400
036500 01  DETAIL-LINE-INV5.
036600     05  FILLER PIC X(10).
036700     05  PRT-PO-EXT PIC -(11)9.9999.
036800     05  FILLER PIC X(1).
036900     05  PRT-INV-EXT PIC -(11)9.9999.
037000     05  FILLER PIC X(3).
037100     05  PRT-FRT-LIT PIC X(8).
037200     05  PRT-FRT-CHARGES PIC -(10)9.99.
037300     05  FILLER PIC X(2).
037400     05  PRT-CE-CODE1 PIC X(1).
037500     05  FILLER PIC X(1).
037600     05  PRT-CE-AMT1 PIC -(10)9.99.
037700     05  FILLER PIC X(1).
037800     05  PRT-CE-ACCT1 PIC X(9).
037900     05  FILLER PIC X(1).
038000     05  PRT-ACCRUED-TAX1 PIC -(10)9.99.
038100     05  FILLER PIC X(1).
038200     05  PRT-ACCRUED-TAX-ACCT1 PIC X(9).
038300
038400 01  DETAIL-LINE-INV6.
038500     05  FILLER PIC X(10).
038600     05  PRT-PAYMENT-IND-LIT PIC X(12).
038700     05  PRT-PAYMENT-IND PIC X(2).
038800     05  FILLER PIC X(5).
038900     05  PRT-NET-VENDOR-LIT PIC X(14).
039000     05  FILLER PIC X(5).
039100     05  PRT-TAX-LIT PIC X(8).
039200     05  PRT-TAX-CHARGES PIC -(10)9.99.
039300     05  FILLER PIC X(2).
039400     05  PRT-CE-CODE2 PIC X(1).
039500     05  FILLER PIC X(1).
039600     05  PRT-CE-AMT2 PIC -(10)9.99.
039700     05  FILLER PIC X(1).
039800     05  PRT-CE-ACCT2 PIC X(9).
039900     05  FILLER PIC X(1).
040000     05  PRT-ACCRUED-TAX2 PIC -(10)9.99.
040100     05  FILLER PIC X(1).
040200     05  PRT-ACCRUED-TAX-ACCT2 PIC X(9).
040300
040400 01  DETAIL-LINE-INV7.
040500     05  FILLER PIC X(10).
040600     05  PRT-DIST-COST-LIT PIC X(16).
040700     05  FILLER PIC X(3).
040800     05  PRT-NET-DUE-VENDOR PIC -(10)9.99.
040900     05  FILLER PIC X(5).
041000     05  PRT-CONTAINER-LIT PIC X(8).
041100     05  PRT-CONTAINER-CHARGES PIC -(10)9.99.
041200     05  FILLER PIC X(2).
041300     05  PRT-CE-CODE3 PIC X(1).
041400     05  FILLER PIC X(1).
041500     05  PRT-CE-AMT3 PIC -(10)9.99.
041600     05  FILLER PIC X(1).
041700     05  PRT-CE-ACCT3 PIC X(9).
041800     05  FILLER PIC X(1).
041900     05  PRT-ACCRUED-TAX3 PIC -(10)9.99.
042000     05  FILLER PIC X(1).
042100     05  PRT-ACCRUED-TAX-ACCT3 PIC X(9).
042200
042300 01  DETAIL-LINE-INV8.
042400     05  FILLER PIC X(12).
042500     05  PRT-DIST-COST PIC -(10)9.99.
042600     05  FILLER PIC X(2).
042700     05  PRT-COLLECT-FRT-LIT  PIC X(15).
042800     05  FILLER PIC X(5).
042900     05  PRT-INS-LIT PIC X(8).
043000     05  PRT-INS-CHARGES PIC -(10)9.99.
043100     05  FILLER PIC X(2).
043200     05  PRT-CE-CODE4 PIC X(1).
043300     05  FILLER PIC X(1).
043400     05  PRT-CE-AMT4 PIC -(10)9.99.
043500     05  FILLER PIC X(1).
043600     05  PRT-CE-ACCT4 PIC X(9).
043700     05  FILLER PIC X(1).
043800     05  PRT-ACCRUED-TAX4 PIC -(10)9.99.
043900     05  FILLER PIC X(1).
044000     05  PRT-ACCRUED-TAX-ACCT4 PIC X(9).
044100
044200 01  DETAIL-LINE-INV9.
044300     05  FILLER PIC X(10).
044400     05  PRT-VENDOR-LIT  PIC X(7).
044500     05  PRT-INV-VEN-CODE PIC X(10).
044600     05  FILLER  PIC X(2).
044700     05  PRT-COLLECT-FRT PIC -(10)9.99.
044800     05  FILLER PIC X(5).
044900     05  PRT-OTHER-LIT PIC X(8).
045000     05  PRT-OTHER-CHARGES PIC -(10)9.99.
045100     05  FILLER PIC X(2).
045200     05  PRT-CE-CODE5 PIC X(1).
045300     05  FILLER PIC X(1).
045400     05  PRT-CE-AMT5 PIC -(10)9.99.
045500     05  FILLER PIC X(1).
045600     05  PRT-CE-ACCT5 PIC X(9).
045700
045800 01  DETAIL-LINE-INV10.
045900     05  FILLER PIC X(72).
046000     05  PRT-CE-CODE6 PIC X(1).
046100     05  FILLER PIC X(1).
046200     05  PRT-CE-AMT6 PIC -(10)9.99.
046300     05  FILLER PIC X(1).
046400     05  PRT-CE-ACCT6 PIC X(9).
046500
046600 01  DETAIL-LINE-INV11.
046700     05  FILLER PIC X(10) VALUE SPACES.
046800     05  FILLER PIC X(30) VALUE "ITEM  CODE   PO QUANTITY PAID ".
046900     05  FILLER PIC X(30) VALUE "    PO PRICE      INV QUANTITY".
047000     05  FILLER PIC X(28) VALUE " PAID   INVOICE PRICE   UM  ".
047100     05  FILLER PIC X(8) VALUE "TAX CODE".
047200
047300 01  DETAIL-LINE-INV12.
047400     05  FILLER PIC X(10).
047500     05  PRT-INV-ITEM PIC X(4).
047600     05  FILLER PIC X(1).
047700     05  PRT-INV-CODE PIC X(7).
047800     05  FILLER PIC X(1).
047900     05  PRT-PO-QTY-PAID PIC -(10)9.9999.
048000     05  FILLER PIC X(1).
048100     05  PRT-PO-PRICE-PAID PIC -(11)9.9999.
048200     05  FILLER PIC X(2).
048300     05  PRT-INV-QTY-PAID PIC -(10)9.9999.
048400     05  FILLER PIC X(1).
048500     05  PRT-INV-PRICE-PAID PIC -(11)9.9999.
048600     05  FILLER PIC X(1).
048700     05  PRT-INV-UM PIC X(2).
048800     05  FILLER PIC X(4).
048900     05  PRT-INV-TAX-CODE PIC X(2).
049000     05  FILLER PIC X(5).
049100     05  PRT-MEMO-QTY-LIT PIC X(14).
049200
049300 01  DETAIL-LINE-INV13.
049400     05  FILLER PIC X(23) VALUE SPACES.
049500     05  FILLER PIC X(26) VALUE "ACCOUNTING DATA    PERCENT".
049600
049700 01  DETAIL-LINE-INV14.
049800     05  FILLER PIC X(20).
049900     05  PRT-INV-PRIME PIC X(3).
050000     05  FILLER PIC X(1).
050100     05  PRT-INV-SUB PIC X(3).
050200     05  FILLER PIC X(1).
050300     05  PRT-INV-SUBD PIC X(4).
050400     05  FILLER PIC X(1).
050500     05  PRT-INV-ACCT PIC X(6).
050600     05  FILER PIC X(3).
050700     05  PRT-INV-PERCENT  PIC ZZZ9.99.
050800
050900 01  PO-NOT-FOUND-MSG1.
051000     05  FILLER  PIC X(10) VALUE SPACES.
051100     05  FILLER  PIC X(23) VALUE "***  PO WAS NOT FOUND. ".
051200
051300 01  PO-NOT-FOUND-MSG2.
051400     05  FILLER  PIC X(10) VALUE SPACES.
051500     05  FILLER  PIC X(29) VALUE "*** PLEASE VERIFY CORRECT PO ".
051600     05  FILLER  PIC X(21) VALUE "NUMBER WAS REQUESTED.".
051700
051800 01  PO-NOT-FOUND-MSG3.
051900     05  FILLER  PIC X(10) VALUE SPACES.
052000     05  FILLER  PIC X(25) VALUE "*** ALSO VERIFY THAT THE ".
052100     05  FILLER  PIC X(24) VALUE "CORRECT PO HISTORY TAPE ".
052200     05  FILLER  PIC X(14) VALUE "WAS RETREIVED.".
052300
052500
052600 COPY ESCNAM2 IN COPYLIB.
052700
052800 01  COMPRESS-PRINT             PIC X(8).
052900
053000 01  NORMAL-PRINT               PIC X(8).
053100
053200
053300**************************************************************
053400**************************************************************
053500**                                                          **
053600**                DATABASE I/O BUFFER AREA                  **
053700**                                                          **
053800**************************************************************
053900**************************************************************
054000
054100 COPY DPORECDH IN COPYLIB.
054200
054300 COPY DPOITEMH IN COPYLIB.
054400
054500 COPY DPODESCH IN COPYLIB.
054600
054700 COPY DRCVITMH IN COPYLIB.
054800
054900 COPY DPOFRTH IN COPYLIB.
055000
055100 COPY DINVRCDH IN COPYLIB.
055200
055300 COPY DINVITMH IN COPYLIB.
055400
055500 COPY DINVACTH IN COPYLIB.
055600
055700 COPY DVENDORH IN COPYLIB.
056000
056100*********************
056200*                   *
056300*   DATA SET NAMES  *
056400*                   *
056500*********************
056600
056700 01  DSET-NAMES.
056800     05  DSET-NAME              PIC X(16)  VALUE SPACES.
056900     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
057000     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
057100     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
057200     05  DSET-DPODESC           PIC X(16)  VALUE "DPODESC;".
057300     05  DSET-DRCVITEM          PIC X(16)  VALUE "DRCVITEM;".
057400     05  DSET-DPOFREIGHT        PIC X(16)  VALUE "DPOFREIGHT;".
057500     05  DSET-DINVRCD           PIC X(16)  VALUE "DINVRCD;".
057600     05  DSET-DINVITM           PIC X(16)  VALUE "DINVITM;".
057700     05  DSET-DINVACCT          PIC X(16)  VALUE "DINVACCT;".
057800     05  DSET-DVENDOR           PIC X(16)  VALUE "DVENDOR;".
057900
058000 COPY DATAB IN COPYLIB.
058100
058200 COPY DBSTHIST IN COPYLIB.
058300
058400 01 ITEMS-LISTING.
058500     05  ALL-ITEMS              PIC XX    VALUE "@;".
058600     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
058700     05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".
058800     05  REG-SEARCH             PIC X(16)
058900                                  VALUE "REGISTER-NUMBER;".
059000
059100 01 ARG-VALUES.
059200     05  PO-ARG                 PIC X(14) VALUE SPACES.
059300     05  VEN-ARG                PIC X(10) VALUE SPACES.
059400     05  PLT-ARG                PIC X(4)  VALUE SPACES.
059500     05  REG-ARG                PIC X(6)  VALUE SPACES.
059600     05  RCVR-ARG.
059700         10  RCVR-PO-NUM        PIC X(10) VALUE SPACES.
059800         10  BUILD-RCVR-NO      PIC 9(3)  VALUE ZEROS.
059900         10  FILLER             PIC X(1)  VALUE SPACES.
060000
060100
060200 01  DATES-AND-TIMES.
060300     05  TODAYS-DATE.
060400         10  YY               PIC 99.
060500         10  MM               PIC 99.
060600         10  DD               PIC 99.
060700
060800
060900 COPY TDATECHK IN COPYLIB.
061000
061100 COPY TBLOWUP IN COPYLIB.
061200
010700************* PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG
010800
010900 01  HD-RET-CODE                PIC S9(4)  COMP-4 VALUE 0.
011000 01  HD-FILE-NAME               PIC X(17)  VALUE SPACES.
011100 01  FNUM                       PIC S9(4)  COMP-4 VALUE 0.
012500
       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

       LINKAGE SECTION.

030600 COPY THDPRTB IN COPYLIB.
030700
       01  OPTION-AREA.
008100     05  ACCEPT-PO-NUMBER.
008200         10  ACCEPT-PO-NUM      PIC X(7).
008300         10  ACCEPT-PO-REL      PIC X(3).
           05  FILLER                 PIC X(102).

020200
020300 PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-AREA.
061300
061500 BEGIN SECTION.
061600
061700     PERFORM 1-HSK  THRU  1-HSK-X.
061800     PERFORM 6-MAIN  THRU  6-MAIN-X.
061900**** PERFORM 2-CLOSE-FILES  THRU  2-CLOSE-FILES-X.
062000     GOBACK.
062100
062200
062300 1-HSK.
062400     CALL "TESCSEQ" USING ESC-NAME.
062500     MOVE CHAR-1636PI             TO COMPRESS-PRINT.
062600     MOVE CHAR-10PI               TO NORMAL-PRINT.
062700
063700***********************************************
063800*  CALL 'TDATECHK' FOR TODAYS DATE
063900***********************************************
064000
064100     MOVE 1               TO  DATE-MODE.
064200     CALL "TDATECHK" USING DATE-CHECK-AREA.
064300     MOVE DATE-YMD-OUT    TO  TODAYS-DATE.
064400
064500 1-HSK-X.
064600     EXIT.
064700
064800*2-CLOSE-FILES.
065300*
065400*2-CLOSE-FILES-X.
065500*    EXIT.
065600
065700
065800
065900******************************************************
066000**                                                  **
066100**   BLOWUP ROUTINE                                 **
066200**                                                  **
066300******************************************************
066400
066500 2-BLOWUP.
066600     MOVE "TPOHPRNT"              TO BU-PGM-NAME.
066700     CALL "TBLOWUP" USING BASE-STHIST, BU-PGM-NAME, STATUS-AREA,
066800         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
066900             BU-DISPLAY-FLDS.
067000
067100
067200
067300 6-MAIN.
067400     OPEN INPUT PO-HISTORY-FILE.
067600     PERFORM 60-ACCEPT-OPTIONS.
067700
082000     MOVE HD-SPOOLER-NUMBER       TO  OVRPRTF-TOFILE-NUM.
           MOVE "*YES"                  TO  OVRPRTF-SHARED.
082100     MOVE HD-NO-OF-COPIES         TO  OVRPRTF-COPIES.
           PERFORM 996-OVERRIDE-PRINT-FILE.
067500     OPEN OUTPUT ONLINE-PRT.
067900
068000     MOVE "DHDRPT85.PUB"          TO HD-FILE-NAME.
068100     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
068200          HD-ROUTE-DATA, ESC-NAME.
068300     IF HD-RET-CODE NOT = 0
068400         MOVE "THDPRT2 ERR 6-MAIN" TO BU-DISPLAY-MSG
068500         MOVE HD-RET-CODE       TO BU-DISPLAY-FLD (1)
068600         GO TO 2-BLOWUP.
068700
068800***********************************************************
068900**   IF PRINTING ON A CHARACTER PRINTER (HD-PAPER-FLAG   **
069000**   NOT = "X"), WE USE COMPRESSED PRINT TO FIT 132      **
069100**   CHARACTERS ON 8.5 IN WIDE PAPER.  ALSO, IF CP, WE   **
069200**   CHANGE THE TEXT LENGTH TO 61 LINES.                 **
069300***********************************************************
069400
069500     IF PAPER-IS-132-COLS
069600         NEXT SENTENCE
069700     ELSE
069800         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
069900
070000     PERFORM 70-PRINT-HEADINGS.
070100
070200     MOVE "N"                     TO END-OF-FILE-SW,
070300                                     PO-FOUND-SW.
070400     PERFORM 61-READ-PO-HISTORY-FILE  THRU 61-RPHF-X
070500         UNTIL END-OF-FILE-SW = "Y".
070600
070700     IF PO-FOUND-SW = "Y"
070800         NEXT SENTENCE
070900     ELSE
071000         WRITE PRT-REC FROM PO-NOT-FOUND-MSG1 AFTER 3
071100         WRITE PRT-REC FROM PO-NOT-FOUND-MSG2 AFTER 2
071200         WRITE PRT-REC FROM PO-NOT-FOUND-MSG3 AFTER 1.
071300
071400     IF PAPER-IS-132-COLS
071500         NEXT SENTENCE
071600     ELSE
071700         WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
071800
071900     CLOSE PO-HISTORY-FILE,
072000           ONLINE-PRT.
072100
072200 6-MAIN-X.
072300     EXIT.
072400
072500 60-ACCEPT-OPTIONS.
072700     DISPLAY "HD-ROUTE DATA = ", HD-ROUTE-DATA.
072800
072900******************************************************
073000**   ACCEPT THE PO NUMBER FOR PRINT REQUEST
073100******************************************************
073200
073300**** DISPLAY "ENTER PO NUMBER OF PRINT REQUEST 'xxxxxxxxxx'".
073400**** ACCEPT ACCEPT-PO-NUMBER.
           IF ACCEPT-PO-REL NOT NUMERIC
               MOVE "000" TO ACCEPT-PO-REL.
073500     DISPLAY "PO NUMBER REQUESTED IS ", ACCEPT-PO-NUMBER.
073600     MOVE ACCEPT-PO-NUM           TO PRT-PO-NUM-HDR.
073700     MOVE ACCEPT-PO-REL           TO PRT-PO-REL-HDR.
073800
073900
074000 61-READ-PO-HISTORY-FILE.
074100     READ PO-HISTORY-FILE
074200         AT END
074300             MOVE "Y"             TO END-OF-FILE-SW
074400             GO TO 61-RPHF-X.
074500
074600     IF ACCEPT-PO-NUMBER > PO-HIST-PO-REL
074700         NEXT SENTENCE
074800     ELSE
074900     IF ACCEPT-PO-NUMBER = PO-HIST-PO-REL
075000         PERFORM 611-PRINT-HISTORY-RECORD
075100     ELSE
075200         MOVE "Y"                 TO END-OF-FILE-SW.
075300
075400 61-RPHF-X.
075500     EXIT.
075600
075700
075800 70-PRINT-HEADINGS.
075900     ADD 1                        TO PAGE-CTR.
076000     MOVE PAGE-CTR                TO PRT-PAGE-NO.
076100     MOVE 1                       TO DATE-MODE.
076200     CALL "TDATECHK" USING DATE-CHECK-AREA.
076300     MOVE DATE-SLASH-OUT          TO PRT-DATE.
076400     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
076500     MOVE ZEROS                   TO LINE-CTR.
076600     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
076700     WRITE PRT-REC FROM DASH-LINE AFTER 2.
076800     MOVE SPACES                  TO PRT-REC.
076900     WRITE PRT-REC AFTER 1.
077000
077100
077200 611-PRINT-HISTORY-RECORD.
077300     MOVE "Y"                     TO PO-FOUND-SW.
077400     MOVE PO-HIST-PO-NUM          TO BU-DISPLAY-FLD (1).
077500     MOVE PO-HIST-DSET-NAME       TO BU-DISPLAY-FLD (2).
077600
077700     IF PO-HIST-DSET-NAME = "DPORECD"
077800         PERFORM 701-PRINT-DPORECD
077900     ELSE
078000     IF PO-HIST-DSET-NAME = "DPOITEM"
078100         PERFORM 702-PRINT-DPOITEM
078200     ELSE
078300     IF PO-HIST-DSET-NAME = "DPODESC"
078400         PERFORM 703-PRINT-DPODESC
078500     ELSE
078600     IF PO-HIST-DSET-NAME = "DPOFREIGHT"
078700         PERFORM 704-PRINT-DPOFREIGHT
078800     ELSE
078900     IF PO-HIST-DSET-NAME = "DRCVITEM"
079000         PERFORM 705-PRINT-DRCVITEM
079100     ELSE
079200     IF PO-HIST-DSET-NAME = "DINVRCD"
079300         PERFORM 706-PRINT-DINVRCD
079400     ELSE
079500     IF PO-HIST-DSET-NAME = "DINVITM"
079600         PERFORM 707-PRINT-DINVITM
079700     ELSE
079800     IF PO-HIST-DSET-NAME = "DINVACCT"
079900         PERFORM 708-PRINT-DINVACCT
080000     ELSE
080100         MOVE "INVALID RECORD TYPE * 611-PHR" TO BU-DISPLAY-MSG
080200         GO TO 2-BLOWUP.
080300
080400     IF LINE-CTR > 55
080500         PERFORM 70-PRINT-HEADINGS.
080600
080700
080800 701-PRINT-DPORECD.
080900     MOVE PO-HIST-DATA            TO BUILD-DPORECD-BUFFER.
081000     MOVE DPORECD-DATA            TO BUF-DPORECD-H.
081100     MOVE SPACES                  TO DETAIL-LINE-PO2,
081200                                     DETAIL-LINE-PO4.
081300     MOVE POH-POH-NO              TO PRT-PO-NUM2.
081400     MOVE POH-RLS-NO              TO PRT-PO-REL2.
081500     MOVE 4                       TO DATE-MODE.
081600     MOVE POH-DATE                TO DATE-VALIDATE-IN.
081700     CALL "TDATECHK" USING DATE-CHECK-AREA.
081800     MOVE DATE-SLASH-OUT          TO PRT-PO-DATE.
081900     IF POH-EXPECT-DATE = ZEROS
082000         NEXT SENTENCE
082100     ELSE
082200         MOVE POH-EXPECT-DATE     TO DATE-VALIDATE-IN
082300         CALL "TDATECHK" USING DATE-CHECK-AREA
082400         MOVE DATE-SLASH-OUT      TO PRT-EXP-DATE.
082500     MOVE POH-RCV-DEPT            TO PRT-RCV-DEPT.
082600     MOVE POH-FOR-DEPT            TO PRT-FOR-DEPT.
082700     MOVE POH-BUDGET-NUMBER       TO PRT-BUDGET-NO.
082800     MOVE POH-BUDGET-AMT          TO PRT-BUDGET-AMT.
082900     MOVE POH-TERMS               TO PRT-TERMS.
083000     MOVE POH-BUYER               TO PRT-BUYER.
083100     MOVE POH-TYPIST              TO PRT-TYPIST.
083200     MOVE POH-ADDL-INFO           TO PRT-ADDL-INFO.
083300     MOVE POH-VIA                 TO PRT-VIA.
083400     MOVE POH-FOB                 TO PRT-FOB.
083500     MOVE POH-VEN-CODE            TO PRT-VENDOR-CODE.
083600     IF POH-NON-RCV-INDIC = SPACES
083700         MOVE POH-LAST-RCVR       TO PRT-NO-OF-RCVRS
083800     ELSE
083900         MOVE "NON-RECEIVABLE"    TO PRT-NON-RCVR-LIT.
084000     MOVE POH-CURRENCY-CODE       TO PRT-CURR-CODE.
084100     MOVE POH-DELETION-DATE       TO DATE-VALIDATE-IN.
084200     CALL "TDATECHK" USING DATE-CHECK-AREA.
084300     MOVE DATE-SLASH-OUT          TO PRT-DELETE-DATE.
084400     MOVE POH-LAST-PAYMENT        TO PRT-LAST-PAYMENT.
084500     MOVE DVENDOR-NAME            TO PRT-VENDOR-NAME.
084600     WRITE PRT-REC FROM DETAIL-LINE-PO1 AFTER 1.
084700     WRITE PRT-REC FROM DETAIL-LINE-PO2 AFTER 1.
084800     WRITE PRT-REC FROM DETAIL-LINE-PO3 AFTER 1.
084900     WRITE PRT-REC FROM DETAIL-LINE-PO4 AFTER 1.
085000     WRITE PRT-REC FROM DETAIL-LINE-PO5 AFTER 1.
085100     MOVE SPACES                  TO PRT-REC.
085200     WRITE PRT-REC AFTER 1.
085300     ADD 6                        TO LINE-CTR.
085400     MOVE "N"                     TO FIRST-RCVR-RECORD,
085500                                     FIRST-INV-RECORD.
085600
085700 702-PRINT-DPOITEM.
085800     MOVE PO-HIST-DATA            TO BUF-DPOITEM-H.
085900     MOVE SPACES                  TO DETAIL-LINE-PO7,
086000                                     DETAIL-LINE-PO9.
086100     MOVE ITMH-NUMBER             TO PRT-ITEM.
086200     IF ITMH-CORP-CODE = SPACES
086300         MOVE "NON-STR"           TO PRT-CODE
086400     ELSE
086500         MOVE ITMH-CORP-CODE      TO PRT-CODE.
086600     MOVE ITMH-REQ-NUMBER         TO PRT-REQ.
086700     MOVE ITMH-QTY-ORD            TO PRT-PO-QTY.
086800     MOVE ITMH-QTY-DLVR           TO PRT-DLVR-QTY.
086900     MOVE ITMH-QTY-PAID           TO PRT-PAID-QTY.
087000     MOVE ITMH-QTY-UM             TO PRT-QTY-UM.
087100     MOVE ITMH-UNIT-PRICE         TO PRT-UNIT-PRICE.
087200     MOVE ITMH-PRICE-UM           TO PRT-PRICE-UM.
087300     MOVE ITMH-SUB                TO PRT-CLASS.
087400     MOVE ITMH-SUB-DETL           TO PRT-DEPT.
087500     MOVE ITMH-ADDL-DATA          TO PRT-ACCT.
087600     MOVE ITMH-TAX-CODE           TO PRT-ITEM-TAX-CODE.
087700     IF ITMH-DATE-RCVD = ZEROS
087800         NEXT SENTENCE
087900     ELSE
088000         MOVE 4                   TO DATE-MODE
088100         MOVE ITMH-DATE-RCVD      TO DATE-VALIDATE-IN
088200         CALL "TDATECHK" USING DATE-CHECK-AREA
088300         MOVE DATE-SLASH-OUT      TO PRT-RCVR-DATE.
088400     IF ITMH-DATE-STORED NUMERIC
088500         MOVE 4                   TO DATE-MODE
088600         MOVE ITMH-DATE-STORED    TO DATE-VALIDATE-IN
088700         CALL "TDATECHK" USING DATE-CHECK-AREA
088800         MOVE DATE-SLASH-OUT      TO PRT-STORED-DATE.
088900     MOVE ITMH-ZBILL-VALUE        TO PRT-ZBILL-VALUE.
089000     WRITE PRT-REC FROM DETAIL-LINE-PO6 AFTER 1.
089100     WRITE PRT-REC FROM DETAIL-LINE-PO7 AFTER 1.
089200     WRITE PRT-REC FROM DETAIL-LINE-PO8 AFTER 1.
089300     WRITE PRT-REC FROM DETAIL-LINE-PO9 AFTER 1.
089400     ADD 4                        TO LINE-CTR.
089500
089600 703-PRINT-DPODESC.
089700     MOVE PO-HIST-DATA            TO BUF-DPODESC-H.
089800     IF DPODESCH-ITEM-NO = ZEROS
089900         NEXT SENTENCE
090000     ELSE
090100         MOVE SPACES              TO DETAIL-LINE-DESC
090200         MOVE PODESCH-DESC        TO PRT-DESC
090300         WRITE PRT-REC FROM DETAIL-LINE-DESC AFTER 1
090400         ADD 1                    TO LINE-CTR.
090500
090600 704-PRINT-DPOFREIGHT.
090700     MOVE PO-HIST-DATA            TO BUF-DPOFREIGHT-H.
090800     MOVE SPACES                  TO DETAIL-LINE-RCVR3,
090900                                     DETAIL-LINE-RCVR5.
091000     MOVE FRTH-PO-RS              TO PRT-RCVR-NO.
091100     MOVE FRTH-RCVR-SEQ-NO        TO PRT-RCVR-SEQ-NO.
091200     MOVE FRTH-PACK-SLIP          TO PRT-PACKING-SLIP.
091300     MOVE FRTH-EMPL               TO PRT-EMPL.
091400     MOVE FRTH-TYPE               TO PRT-FRT-TYPE.
091500     MOVE FRTH-CARRIER            TO PRT-CARRIER.
091600     MOVE FRTH-BILL-NO            TO PRT-FRT-BILL-NO.
091700     MOVE FRTH-CHARGES            TO PRT-CHARGES.
091800     MOVE 4                       TO DATE-MODE.
091900     IF FRTH-BILL-DATE = ZEROS
092000         NEXT SENTENCE
092100     ELSE
092200         MOVE FRTH-BILL-DATE      TO DATE-VALIDATE-IN
092300         CALL "TDATECHK" USING DATE-CHECK-AREA
092400         MOVE DATE-SLASH-OUT      TO PRT-BILL-DATE.
092500     MOVE FRTH-DATE-RCVD          TO DATE-VALIDATE-IN.
092600     CALL "TDATECHK" USING DATE-CHECK-AREA.
092700     MOVE DATE-SLASH-OUT          TO PRT-DATE-RCVD.
092800     IF FRTH-DATE-ARRIVAL = ZEROS
092900         NEXT SENTENCE
093000     ELSE
093100         MOVE FRTH-DATE-ARRIVAL   TO DATE-VALIDATE-IN
093200         CALL "TDATECHK" USING DATE-CHECK-AREA
093300         MOVE DATE-SLASH-OUT      TO PRT-ARRIVAL-DATE.
093400     MOVE FRTH-SPLC               TO PRT-SPLC.
093500     MOVE FRTH-CARRIER-WT         TO PRT-CARRIER-WT.
093600     MOVE FRTH-OUR-WT             TO PRT-OUR-WT.
093700     MOVE FRTH-RAIL-CAR           TO PRT-RAIL-CAR.
093800     MOVE FRTH-LOT                TO PRT-LOT-NO.
093900     MOVE FRTH-OSD                TO PRT-OSD.
094000     MOVE FRTH-REG-NO             TO PRT-INV-REG-NO.
094100     IF FIRST-RCVR-RECORD = "N"
094200         MOVE "Y"                 TO FIRST-RCVR-RECORD
094300         MOVE SPACES              TO PRT-REC
094400         WRITE PRT-REC AFTER 1
094500         WRITE PRT-REC FROM DETAIL-LINE-RCVR1 AFTER 1
094600         ADD 2                    TO LINE-CTR.
094700     MOVE SPACES                  TO PRT-REC.
094800     WRITE PRT-REC AFTER 1.
094900     WRITE PRT-REC FROM DETAIL-LINE-RCVR2 AFTER 1.
095000     WRITE PRT-REC FROM DETAIL-LINE-RCVR3 AFTER 1.
095100     WRITE PRT-REC FROM DETAIL-LINE-RCVR4 AFTER 1.
095200     WRITE PRT-REC FROM DETAIL-LINE-RCVR5 AFTER 1.
095300     ADD 5                        TO LINE-CTR.
095400
095500 705-PRINT-DRCVITEM.
095600     MOVE PO-HIST-DATA            TO BUF-DRCVITEM-H.
095700     MOVE SPACES                  TO DETAIL-LINE-RCVR7.
095800     MOVE RCVH-ITEM-NUMBER        TO PRT-RCVR-ITEM.
095900     IF RCVH-CORP-CODE = SPACES
096000         MOVE "NON-STR"           TO PRT-RCVR-CODE
096100     ELSE
096200         MOVE RCVH-CORP-CODE      TO PRT-RCVR-CODE.
096300     MOVE RCVH-ITM-QTY-DLVR       TO PRT-RCVR-QTY.
096400     MOVE RCVH-ITEM-UM            TO PRT-RCVR-UM.
096500     WRITE PRT-REC FROM DETAIL-LINE-RCVR6 AFTER 1.
096600     WRITE PRT-REC FROM DETAIL-LINE-RCVR7 AFTER 1.
096700     ADD 2                        TO LINE-CTR.
096800
096900 706-PRINT-DINVRCD.
097000     MOVE PO-HIST-DATA            TO BUF-DINVRCD-H.
097100     MOVE SPACES                  TO DETAIL-LINE-INV3,
097200                                     DETAIL-LINE-INV5,
097300                                     DETAIL-LINE-INV6,
097400                                     DETAIL-LINE-INV7,
097500                                     DETAIL-LINE-INV8,
097600                                     DETAIL-LINE-INV9,
097700                                     DETAIL-LINE-INV10.
097800     MOVE ZEROS                   TO CE-SUB,
097900                                     TAX-SUB.
098000
098100**********************************************************
098200**   LOAD 'DETAIL-LINE-INV3' PRINT LINE
098300**********************************************************
098400     MOVE INVH-REG-NO             TO PRT-REGISTER-NO.
098500     MOVE INVH-MFEST-NO           TO PRT-MANIFEST-NO.
098600     MOVE INVH-MFEST-YY           TO PRT-MANIFEST-YY.
098700     MOVE INVH-NO                 TO PRT-INV-NO.
098800     MOVE 4                       TO DATE-MODE.
098900     MOVE INVH-DATE               TO DATE-VALIDATE-IN.
099000     CALL "TDATECHK" USING DATE-CHECK-AREA.
099100     MOVE DATE-SLASH-OUT          TO PRT-INV-DATE.
099200     MOVE INVH-ENTRY-DATE         TO DATE-VALIDATE-IN.
099300     CALL "TDATECHK" USING DATE-CHECK-AREA.
099400     MOVE DATE-SLASH-OUT          TO PRT-ENTRY-DATE.
099500     IF INVH-DUE-DATE = ZEROS
099600         NEXT SENTENCE
099700     ELSE
099800         MOVE INVH-DUE-DATE       TO DATE-VALIDATE-IN
099900         CALL "TDATECHK" USING  DATE-CHECK-AREA
100000         MOVE DATE-SLASH-OUT          TO PRT-DUE-DATE.
100100     IF INVH-MOD-DATE = ZEROS
100200         NEXT SENTENCE
100300     ELSE
100400         MOVE INVH-MOD-DATE       TO DATE-VALIDATE-IN
100500         CALL "TDATECHK" USING DATE-CHECK-AREA
100600         MOVE DATE-SLASH-OUT      TO PRT-MOD-DATE.
100700     IF INVH-CHECK-DATE = ZEROS
100800         NEXT SENTENCE
100900     ELSE
101000         MOVE INVH-CHECK-DATE     TO DATE-VALIDATE-IN
101100         CALL "TDATECHK" USING DATE-CHECK-AREA
101200         MOVE DATE-SLASH-OUT      TO PRT-CHECK-DATE.
101300     MOVE INVH-CHECK-NO           TO PRT-CHECK-NO.
101400     MOVE INVH-TERMS              TO PRT-INV-TERMS.
101500     MOVE INVH-ADD-CLERK          TO PRT-ADD-CLERK.
101600     MOVE INVH-MOD-CLERK          TO PRT-MOD-CLERK.
101700     MOVE INVH-CPW-CODE           TO PRT-CPW.
101800     IF INVH-NO-CHECK-INDIC NOT = SPACES
101900         MOVE "NO CHECK"          TO PRT-NO-CHECK-LIT.
102000
102100**********************************************************
102200**   LOAD 'DETAIL-LINE-INV5' PRINT LINE
102300**********************************************************
102400     MOVE INVH-P-MATL-EXT         TO PRT-PO-EXT.
102500     MOVE INVH-I-MATL-EXT         TO PRT-INV-EXT.
102600     MOVE "FREIGHT"               TO PRT-FRT-LIT.
102700     MOVE INVH-ADD-VFRT           TO PRT-FRT-CHARGES.
102800     MOVE "N"                     TO FOUND-CE-AMT-SW.
102900     PERFORM 7061-FIND-CE-CHARGES
103000         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
103100     IF FOUND-CE-AMT-SW = "Y"
103200         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE1
103300         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT1
103400         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT1.
103500     MOVE "N"                     TO FOUND-ACCRUED-TAX-SW.
103600     PERFORM 7062-FIND-ACCRUED-TAX
103700         UNTIL TAX-SUB > 4  OR FOUND-ACCRUED-TAX-SW = "Y".
103800     IF FOUND-ACCRUED-TAX-SW = "Y"
103900         MOVE INVH-ATAX-AMT (TAX-SUB)   TO PRT-ACCRUED-TAX1
104000         MOVE INVH-ATAX-ACCTG (TAX-SUB) TO PRT-ACCRUED-TAX-ACCT1.
104100
104200**********************************************************
104300**   LOAD 'DETAIL-LINE-INV6' PRINT LINE
104400**********************************************************
104500     MOVE "PAYMENT IND"           TO PRT-PAYMENT-IND-LIT.
104600     MOVE INVH-PAYMENT-IND        TO PRT-PAYMENT-IND.
104700     MOVE "NET DUE VENDOR"        TO PRT-NET-VENDOR-LIT.
104800     MOVE "TAX"                   TO PRT-TAX-LIT.
104900     MOVE INVH-ADD-TAX            TO PRT-TAX-CHARGES.
105000     MOVE "N"                     TO FOUND-CE-AMT-SW.
105100     PERFORM 7061-FIND-CE-CHARGES
105200         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
105300     IF FOUND-CE-AMT-SW = "Y"
105400         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE2
105500         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT2
105600         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT2.
105700     MOVE "N"                     TO FOUND-ACCRUED-TAX-SW.
105800     PERFORM 7062-FIND-ACCRUED-TAX
105900         UNTIL TAX-SUB > 4  OR FOUND-ACCRUED-TAX-SW = "Y".
106000     IF FOUND-ACCRUED-TAX-SW = "Y"
106100         MOVE INVH-ATAX-AMT (TAX-SUB)   TO PRT-ACCRUED-TAX2
106200         MOVE INVH-ATAX-ACCTG (TAX-SUB) TO PRT-ACCRUED-TAX-ACCT2.
106300
106400**********************************************************
106500**   LOAD 'DETAIL-LINE-INV7' PRINT LINE
106600**********************************************************
106700     MOVE "DISTRIBUTED COST"      TO PRT-DIST-COST-LIT.
106800     MOVE INVH-NET-DUE-VENDOR     TO PRT-NET-DUE-VENDOR.
106900     MOVE "CONTAIN"               TO PRT-CONTAINER-LIT.
107000     MOVE INVH-ADD-CTNRS          TO PRT-CONTAINER-CHARGES.
107100     MOVE "N"                     TO FOUND-CE-AMT-SW.
107200     PERFORM 7061-FIND-CE-CHARGES
107300         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
107400     IF FOUND-CE-AMT-SW = "Y"
107500         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE3
107600         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT3
107700         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT3.
107800     MOVE "N"                     TO FOUND-ACCRUED-TAX-SW.
107900     PERFORM 7062-FIND-ACCRUED-TAX
108000         UNTIL TAX-SUB > 4  OR FOUND-ACCRUED-TAX-SW = "Y".
108100     IF FOUND-ACCRUED-TAX-SW = "Y"
108200         MOVE INVH-ATAX-AMT (TAX-SUB)   TO PRT-ACCRUED-TAX3
108300         MOVE INVH-ATAX-ACCTG (TAX-SUB) TO PRT-ACCRUED-TAX-ACCT3.
108400
108500**********************************************************
108600**   LOAD 'DETAIL-LINE-INV8' PRINT LINE
108700**********************************************************
108800     MOVE INVH-DIST-COST          TO PRT-DIST-COST.
108900     MOVE "COLLECT FREIGHT"       TO PRT-COLLECT-FRT-LIT.
109000     MOVE "INSUR."                TO PRT-INS-LIT.
109100     MOVE INVH-ADD-INS            TO PRT-INS-CHARGES.
109200     MOVE "N"                     TO FOUND-CE-AMT-SW.
109300     PERFORM 7061-FIND-CE-CHARGES
109400         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
109500     IF FOUND-CE-AMT-SW = "Y"
109600         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE4
109700         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT4
109800         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT4.
109900     MOVE "N"                     TO FOUND-ACCRUED-TAX-SW.
110000     PERFORM 7062-FIND-ACCRUED-TAX
110100         UNTIL TAX-SUB > 4  OR FOUND-ACCRUED-TAX-SW = "Y".
110200     IF FOUND-ACCRUED-TAX-SW = "Y"
110300         MOVE INVH-ATAX-AMT (TAX-SUB)   TO PRT-ACCRUED-TAX4
110400         MOVE INVH-ATAX-ACCTG (TAX-SUB) TO PRT-ACCRUED-TAX-ACCT4.
110500
110600**********************************************************
110700**   LOAD 'DETAIL-LINE-INV9' PRINT LINE
110800**********************************************************
110900     MOVE "VENDOR"                TO PRT-VENDOR-LIT.
111000     MOVE INVH-VEN-CODE           TO PRT-INV-VEN-CODE.
111100     MOVE INVH-TOTAL-CFRT         TO PRT-COLLECT-FRT.
111200     MOVE "OTHER"                 TO PRT-OTHER-LIT.
111300     MOVE INVH-ADD-OTHER          TO PRT-OTHER-CHARGES.
111400     MOVE "N"                     TO FOUND-CE-AMT-SW.
111500     PERFORM 7061-FIND-CE-CHARGES
111600         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
111700     IF FOUND-CE-AMT-SW = "Y"
111800         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE5
111900         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT5
112000         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT5.
112100
112200     IF FIRST-INV-RECORD = "N"
112300         MOVE "Y"                 TO FIRST-INV-RECORD
112400         MOVE SPACES              TO PRT-REC
112500         WRITE PRT-REC AFTER 1
112600         WRITE PRT-REC FROM DETAIL-LINE-INV1 AFTER 1
112700         ADD 2                    TO LINE-CTR.
112800
112900     MOVE SPACES                  TO PRT-REC.
113000     WRITE PRT-REC AFTER 1.
113100     WRITE PRT-REC FROM DETAIL-LINE-INV2 AFTER 1.
113200     WRITE PRT-REC FROM DETAIL-LINE-INV3 AFTER 1.
113300     ADD 3                        TO LINE-CTR.
113400     IF LINE-CTR > 55
113500         PERFORM 70-PRINT-HEADINGS.
113600     WRITE PRT-REC FROM DETAIL-LINE-INV4 AFTER 1.
113700     WRITE PRT-REC FROM DETAIL-LINE-INV5 AFTER 1.
113800     ADD 2                        TO LINE-CTR.
113900     IF LINE-CTR > 55
114000         PERFORM 70-PRINT-HEADINGS.
114100     WRITE PRT-REC FROM DETAIL-LINE-INV6 AFTER 1.
114200     WRITE PRT-REC FROM DETAIL-LINE-INV7 AFTER 1.
114300     WRITE PRT-REC FROM DETAIL-LINE-INV8 AFTER 1.
114400     WRITE PRT-REC FROM DETAIL-LINE-INV9 AFTER 1.
114500     ADD 4                        TO LINE-CTR.
114600     IF LINE-CTR > 55
114700         PERFORM 70-PRINT-HEADINGS.
114800     PERFORM 7063-PRINT-MORE-CE
114900         UNTIL CE-SUB > 10.
115000
115100     MOVE SPACES                  TO PRT-REC.
115200     WRITE PRT-REC AFTER 1.
115300     ADD 1                        TO LINE-CTR.
115400
115500 707-PRINT-DINVITM.
115600     MOVE PO-HIST-DATA            TO BUF-DINVITM-H.
115700     MOVE SPACES                  TO DETAIL-LINE-INV12.
115800     MOVE INVITMH-ITEM-NO         TO PRT-INV-ITEM.
115900     MOVE INVITMH-CORPCODE        TO PRT-INV-CODE.
116000     MOVE INVITMH-PO-QTY-PD       TO PRT-PO-QTY-PAID.
116100     MOVE INVITMH-PO-UPRICE       TO PRT-PO-PRICE-PAID.
116200     MOVE INVITMH-INV-QTY-PD      TO PRT-INV-QTY-PAID.
116300     MOVE INVITMH-INV-UPRICE      TO PRT-INV-PRICE-PAID.
116400     MOVE INVITMH-PO-UM           TO PRT-INV-UM.
116500     MOVE INVITMH-TAX-CODE        TO PRT-INV-TAX-CODE.
116600     IF INVITMH-MEMO-INDIC NOT = SPACES
116700         MOVE "MEMO QUANTITY"     TO PRT-MEMO-QTY-LIT.
116800     WRITE PRT-REC FROM DETAIL-LINE-INV11 AFTER 1.
116900     WRITE PRT-REC FROM DETAIL-LINE-INV12 AFTER 1.
117000     WRITE PRT-REC FROM DETAIL-LINE-INV13 AFTER 1.
117100     ADD 3                        TO LINE-CTR.
117200
117300 708-PRINT-DINVACCT.
117400     MOVE PO-HIST-DATA            TO BUF-DINVACCT-H.
117500     MOVE SPACES                  TO DETAIL-LINE-INV14.
117600     MOVE INVACCTH-PRIME          TO PRT-INV-PRIME.
117700     MOVE INVACCTH-SUB            TO PRT-INV-SUB.
117800     MOVE INVACCTH-SUBD           TO PRT-INV-SUBD.
117900     MOVE INVACCTH-ADDL-DATA      TO PRT-INV-ACCT.
118000     MOVE INVACCTH-PCT            TO PRT-INV-PERCENT.
118100     WRITE PRT-REC FROM DETAIL-LINE-INV14 AFTER 1.
118200     ADD 1                        TO LINE-CTR.
118300
118400
118500 7061-FIND-CE-CHARGES.
118600     ADD 1                        TO CE-SUB.
118700     IF CE-SUB > 10
118800         NEXT SENTENCE
118900     ELSE
119000         IF CEH-VALUE (CE-SUB) = ZEROS
119100             NEXT SENTENCE
119200         ELSE
119300             MOVE "Y"             TO FOUND-CE-AMT-SW.
119400
119500 7062-FIND-ACCRUED-TAX.
119600     ADD 1                        TO TAX-SUB.
119700     IF TAX-SUB > 4
119800         NEXT SENTENCE
119900     ELSE
120000         IF INVH-ATAX-AMT (TAX-SUB) = ZEROS
120100             NEXT SENTENCE
120200         ELSE
120300             MOVE "Y"             TO FOUND-ACCRUED-TAX-SW.
120400
120500 7063-PRINT-MORE-CE.
120600     MOVE SPACES                  TO DETAIL-LINE-INV10.
120700     MOVE "N"                     TO FOUND-CE-AMT-SW.
120800     PERFORM 7061-FIND-CE-CHARGES
120900         UNTIL CE-SUB > 10 OR FOUND-CE-AMT-SW = "Y".
121000     IF FOUND-CE-AMT-SW = "Y"
121100         MOVE CEH-CODE (CE-SUB)   TO PRT-CE-CODE6
121200         MOVE CEH-VALUE (CE-SUB)  TO PRT-CE-AMT6
121300         MOVE CEH-ACCTG-DATA (CE-SUB)  TO PRT-CE-ACCT6
121400         WRITE PRT-REC FROM DETAIL-LINE-INV10 AFTER 1
121500         ADD 1                    TO LINE-CTR
121600         IF LINE-CTR > 55
121700             PERFORM 70-PRINT-HEADINGS.

       COPY OVRPFCALL IN COPYLIB.
