000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPOINQ.
000400 AUTHOR.        LS BAKER.
000500 DATE-WRITTEN.  MAY 31, 1983.
000800*D   PO INQUIRY MAIN PROGRAM THAT PERFORMS ALL OPENS AND CLOSES
000900
005300
005400 ENVIRONMENT DIVISION.
005500 CONFIGURATION SECTION.
005600 SOURCE-COMPUTER.    HP-3000.
005700 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                       LOCAL-DATA IS LOCAL-DATA-AREA.

005800 INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

003800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
005900
006300 01  SAVE-COMPANY                  PIC X(3) VALUE SPACES.
006400
006500 COPY VCOMAREA IN COPYLIB.
006600
007500 COPY DATAB IN COPYLIB.
007600
007700 COPY DBSTHIST IN COPYLIB.
008200
008300 COPY MPLTINFO IN COPYLIB.

       01  PLT-ARG PIC X(4) VALUE SPACES.
008400
008500 COPY TBLOWUP IN COPYLIB.
008600
008700 COPY LANGUAGE IN COPYLIB.
008800
008900
009000
009100 PROCEDURE DIVISION.
009200 0-BEGIN.
009300     PERFORM 1-HSK THRU 1-HSK-X.
009400
009500     CALL "SPOINQ" USING BASE, BASE-STHIST, VIEW-COMAREA,
009600          SAVE-COMPANY,  LANGUAGE-PARMS.
009700
009800     PERFORM 2-CLOSE-FILES THRU 2-CLOSE-FILES-X.
009900
010000     GOBACK.
010100
010200 1-HSK.
           OPEN INPUT MPLTINFO-I.

014300*----------  PLANT INQUIRY
014400     MOVE "P 01"     TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
045300         MOVE "GET MPLTINFO  * 6-HSK" TO BU-DISPLAY-MSG
045400         MOVE PLT-ARG  TO  BU-DISPLAY-FLD (4)
045500         GO TO 2-BLOWUP
045600     ELSE
015300         MOVE MPLTINFO-COMPANY  TO  SAVE-COMPANY.
           MOVE "ZCSISINQ" TO VIEW-CFNAME.
015700 1-HSK-X.
015800     EXIT.
015900
016000 2-CLOSE-FILES.
           CLOSE MPLTINFO-I.
018900
019000 2-CLOSE-FILES-X.
019100     EXIT.
019200
019300************************************************************
019400************************************************************
019500*                    B L O W U P                           *
019600*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
019700*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
019800*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
019900*                                                          *
020000*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
020100*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
020200*                                                          *
020300*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
020400************************************************************
020500************************************************************
020600 2-BLOWUP.
020700     MOVE "TPOINQ" TO BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
020800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
020900           VIEW-COMAREA, FILE-STATUS,  BU-DISPLAY-MSG,
021000           BU-DISPLAY-FLDS.
021100 2-BLOWUP-X.
021200     EXIT.
