       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TPOINQI.
       AUTHOR.        LS BAKER/MOVSESIAN/JIM COFFMAN.
       DATE-WRITTEN.  JUNE 29, 1983.

      *****************************************************************
      *   SUBROUTINE THAT SHOWS PURCHASE ORDER ITEM INFO
      *****************************************************************


      *****************************************************************
      **          M O D I F I C A T I O N    H I S T O R Y
      *****************************************************************
      *C   SEPT. 94   JE COFFMAN  REQ #6527
      *C   ADDED LOGIC TO DISPLAY THE CHAT NUMBER IF THE USER
      *C   HAS SELECTED THE OPTION TO INCLUDE CHAT NUMBERS WITH
      *C   CSIS CORPORATE CODED ITEMS.
      *C
      *C   JUNE 10, 1996  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP NEW DATE FORMATS.
      *C
      *C   11/20/96  JEFF BUNGO
      *C   IF QS9000-TRACKING ITEM THEN DISPLAY F5 INSTRUCTIONS
      *C   AND ALLOW F5 TO DISPLAY TRACKING SCREEN.
      *C
      *C   04/03/2002    CA YODER     NAPANEE REQUEST
      *C   ADDED CALL TO "CCRQDESC" TO DISPLAY COMPLIANCE
      *C   REQUIREMENTS ON THE SCREEN, IF ANY EXIST.
      *C
      *C   12/31/2003    GEISER
      *C   ADDED ITEM NUMBER ON BLOWUP CALL FOR DEBUGGING.
      *C---------------------------------------------------------------
      *C MAR 10, 2005  D.RAUCH       DCR01    REQUEST# 2005-78515
      *C    DISPLAY FILE PROCESSING CHANGED FROM USING ZCSISINQ
      *C    NEW DISPLAY FILE ZTPOINQI  CREATED - FORMATS COPIED
      *C    FROM ZCSISINQ.
      *C---------------------------------------------------------------
      *C MMM DD, CCYY  XXXNAMEXXX    XXX01    REQUEST# 2005-XXXXX
      *C    XXXXXXXXXXXXXXXXXX DESC XXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *****************************************************************


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

       SPECIAL-NAMES.
           LOCAL-DATA IS LOCAL-DATA-AREA
           I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPODATAITM-I
               ASSIGN TO DATABASE-MCFLCS1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD-I
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZTPOINQI-SI
               ORGANIZATION IS TRANSACTION
               CONTROL-AREA IS WS-CONTROL
               FILE STATUS IS DISPLAY-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  DPODATAITM-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1101.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1002.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS2102.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                  PIC X(2000).

       WORKING-STORAGE SECTION.
       77  SAVE-PCPO-SW                 PIC X.
       77  TRAK-FUNCTION                PIC X VALUE "D".
       77  PRINT-DCOMPL-SW              PIC X VALUE "N".

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  Z-BILL-STATUS             PIC X      VALUE SPACE.
           88  MEMO-Z-BILL                      VALUE "1".

       01  PO-ARRAY.
           05  PO-ARR OCCURS 7 INDEXED BY PO-INDEX.
               10  PO-CHAR              PIC X.

       01  PLT-NUMBER.
           05  PLT-DIGIT-1              PIC X.
               88  A-KELLY-PLANT                  VALUE "2".
           05  FILLER                   PIC X(2).
       01  KELLY-CF                     PIC S9(8)V9(4).
       01  CHECK-QTY                    PIC S9(8)V9(4).

      **********************************************
      *                                            *
      *   JCW PARAMETERS                           *
      *                                            *
      **********************************************

       COPY JCWAREA IN COPYLIB.

       01  PRICE-CAPABILITY-SW     PIC X      VALUE SPACES.
           88  PRICE-ALLOWED                  VALUE "Y".

       COPY TBLOWUP IN COPYLIB.

      *************************************************************
      **                                                         **
      **               V I E W   W O R K   A R E A               **
      **                                                         **
      *************************************************************

       01  DATE-WS.
           05  DISPLAY-DATE          PIC X(5)    VALUE SPACES.
           05  FILLER                PIC X(3)    VALUE SPACES.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(68)    VALUE SPACE.
           05  MSG-FLD               PIC X(8)     VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
           05  FILLER                PIC X(4).

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1 BINARY.


       01 BCSF-REVIEW-MSG.
          05 FILLER                  PIC X  VALUE SPACES.
          05 BCSF-REVIEW-MSG-TEXT    PIC X(78).
      **   f2 - START THIS ITEM * f4- CONT THIS ITEM * f6 - PREV ITEMS *
      **   f7 - MORE ITEMS


       01  CSF-REVIEW-MSG.
           05  FILLER                PIC X(4) VALUE SPACES.
           05  CSF-REVIEW-MSG-TEXT   PIC X(75).
      **   ** PRESS:  f2 - START THIS ITEM * f4 - CONTINUE THIS ITEM *
      **   f7 - MORE ITEMS **


       01  BSF-REVIEW-MSG.
           05  FILLER                PIC X(7) VALUE SPACES.
           05  BSF-REVIEW-MSG-TEXT   PIC X(72).
      **   *** PRESS:  f2 - START THIS ITEM ** f6 - PREV ITEMS **
      **   f7 - MORE ITEMS  ***


       01  SF-REVIEW-MSG.
           05  FILLER              PIC X(16) VALUE SPACES.
           05  SF-REVIEW-MSG-TEXT    PIC X(63).
      **   *** PRESS: f2 - START THIS ITEM ** f7 - MORE ITEMS ***


       01  BS-REVIEW-MSG.
           05  FILLER                PIC X(16) VALUE SPACES.
           05  BS-REVIEW-MSG-TEXT    PIC X(63).
      **   ***  PRESS:  f2 - START THIS ITEM ** f6 - PREV ITEMS  ***


       01  S-REVIEW-MSG.
           05  FILLER                PIC X(25) VALUE SPACES.
           05  S-REVIEW-MSG-TEXT     PIC X(54).
      **   ***  PRESS:  f2 - START THIS ITEM ***


       01  BCF-REVIEW-MSG.
           05  FILLER                PIC X(6) VALUE SPACES.
           05  BCF-REVIEW-MSG-TEXT   PIC X(73).
      **   ***  PRESS:  f4 - CONTINUE THIS ITEM * f6 - PREV ITEMS *
      **   f7 - MORE ITEMS  ***


       01  BC-REVIEW-MSG.
           05  FILLER                PIC X(15) VALUE SPACES.
           05  BC-REVIEW-MSG-TEXT    PIC X(64).
      **   ***  PRESS:  f4 - CONTINUE THIS ITEM ** f6 - PREV ITEMS ***


       01  CF-REVIEW-MSG.
           05  FILLER                PIC X(15) VALUE SPACES.
           05  CF-REVIEW-MSG-TEXT    PIC X(64).
      **   ***  PRESS:  f4 - CONTINUE THIS ITEM ** f7 - MORE ITEMS  ***


       01  C-REVIEW-MSG.
           05  FILLER                PIC X(24) VALUE SPACES.
           05  C-REVIEW-MSG-TEXT     PIC X(55).
      **   ***  PRESS:  f4 - CONTINUE THIS ITEM  ***


       01  BF-REVIEW-MSG.
           05  FILLER                PIC X(19) VALUE SPACES.
           05  BF-REVIEW-MSG-TEXT    PIC X(60).
      **   ***  PRESS:  f6 - PREV ITEMS ** f7 - MORE ITEMS  ***


       01  B-REVIEW-MSG.
           05  FILLER                 PIC X(28) VALUE SPACES.
           05  B-REVIEW-MSG-TEXT     PIC X(51).
      **   ***  PRESS:  f6 - PREV ITEMS  ***


       01  F-REVIEW-MSG.
           05  FILLER                PIC X(28) VALUE SPACES.
           05  F-REVIEW-MSG-TEXT     PIC X(51).
      **   ***  PRESS:  f7 - MORE ITEMS  ***


       01  NOT-FOUND-ITEM-MSG.
           05  FILLER                PIC X(18).
           05  NF-ITEM-NUMBER        PIC Z(4).
           05  FILLER                PIC X(57).
      **   ITEM NUMBER      ¢      ! DOES NOT EXIST - PRESS 'f8'
      **   TO TRY AGAIN **


       01  NOT-FOUND-CORPCODE-MSG.
           05  FILLER                PIC X(18).
           05  NF-CORPCODE           PIC X(8).
           05  FILLER                PIC X(55).
      **   CORPORATE CODE ¢       !  DOES NOT EXIST - PRESS 'f8'
      **   TO TRY AGAIN


       01  CAPACITY-EXCEEDED-MSG.
           05  FILLER                PIC X(25)  VALUE SPACES.
           05  CAPACITY-EXCEEDED-MSG-TEXT  PIC X(54).
      **   ***  ITEM TABLE CAPACITY EXCEEDED  ***


       COPY TDATECHK IN COPYLIB.

      *************************************************************
      **                                                         **
      **           D A T A   E N T R Y   B U F F E R S           **
      **                                                         **
      *************************************************************

       01  DE-BUFFER1.
           05  DE1-CCD               PIC X(3).
           05  DE1-HISTORY-DB-LIT    PIC X(20).
           05  DE1-PO-RLSE.
               10  DE1-PO            PIC X(7).
               10  DE1-RLSE          PIC X(3).
           05  DE1-ITEM-NUMBER       PIC X(4).
           05  DE1-CORP-CODE         PIC X(7).
           05  DE1-TAX-CODE          PIC X(2).
           05  DE1-LANGUAGE-TYPE     PIC X(10).
           05  DE1-MASTER-STOCK-LIT  PIC X(12).
           05  DE1-MASTER-STOCK      PIC X(7).
           05  DE1-ITEM-TABLE.
               10  DE1-ITEM-LINE  OCCURS  9  TIMES.
                   15  DE1-ITM-LINE      PIC X(79).
           05  DE1-MSG-LINE              PIC X(79).
           05  DE1-COMMAND-LINE          PIC X(79).
           05  DE1-MESSAGE-LINE          PIC X(79).

       01  ITEM-DETAIL.
           05  DE1-ITEM-PRICE           PIC Z(10)9.9999.
           05  DE1-ITEM-PRICE-X  REDEFINES DE1-ITEM-PRICE.
               10  FILLER               PIC X(14).
               10  DE1-ITEM-PRICE-D34   PIC XX.
           05  FILLER                   PIC X.
           05  DE1-ITEM-PRICE-UM        PIC X(2).
           05  FILLER                   PIC X.
           05  DE1-ITEM-QTY-ORD         PIC Z(7)9.9999.
           05  DE1-ITEM-QTY-ORD-X  REDEFINES  DE1-ITEM-QTY-ORD.
               10  FILLER               PIC X(8).
               10  DE1-ITEM-QTY-DEC-DIG.
                   15  DE1-ITEM-QTY-DEC PIC X.
                   15  DE1-ITEM-QTY-D12 PIC XX.
                   15  DE1-ITEM-QTY-D34 PIC XX.
           05  FILLER                   PIC X.
           05  DE1-ORD-UM               PIC X(2).
           05  FILLER                   PIC X.
           05  DE1-ITEM-QTY-DLV         PIC Z(7)9.9999.
           05  DE1-ITEM-QTY-DLV-X  REDEFINES  DE1-ITEM-QTY-DLV.
               10  FILLER               PIC X(8).
               10  DE1-ITEM-DLV-DEC-DIG.
                   15  DE1-ITEM-DLV-DEC PIC X.
                   15  DE1-ITEM-DLV-D12 PIC XX.
                   15  DE1-ITEM-DLV-D34 PIC XX.
           05  FILLER                   PIC X.
           05  DE1-ITEM-QTY-STR         PIC Z(7)9.9999.
           05  DE1-ITEM-QTY-STR-X  REDEFINES  DE1-ITEM-QTY-STR.
               10  FILLER               PIC X(8).
               10  DE1-ITEM-STR-DEC-DIG.
                   15  DE1-ITEM-STR-DEC PIC X.
                   15  DE1-ITEM-STR-D12 PIC XX.
                   15  DE1-ITEM-STR-D34 PIC XX.
           05  FILLER                   PIC X(3).
           05  DE1-DATE-DLVR.
               10  DE1-DLVR-MM       PIC X(2).
               10  DE1-DLVR-SLASH    PIC X.
               10  DE1-DLVR-DD       PIC X(2).
           05  FILLER                PIC X(2).
           05  DE1-DATE-STOR.
               10  DE1-STOR-MM       PIC X(2).
               10  DE1-STOR-SLASH    PIC X.
               10  DE1-STOR-DD       PIC X(2).


       01  ACCTING-REQ-DATA.
           05  ACCTING-DATA.
               10  FILLER            PIC X      VALUE SPACE.
               10  CLASS-LIT         PIC X(6)   VALUE "CLASS ".
               10  AR-SUB            PIC X(3)   VALUE SPACES.
               10  FILLER            PIC X(2)   VALUE SPACES.
               10  DEPT-LIT          PIC X(6)   VALUE "DEPT. ".
               10  AR-SUB-DETL       PIC X(4)   VALUE SPACE.
               10  FILLER            PIC X(2)   VALUE SPACES.
               10  EXPENSE-NW-LIT    PIC X(7)   VALUE "EXP/NW ".
               10  AR-ADDL-DATA      PIC X(6)   VALUE SPACES.
               10  FILLER            PIC X(2)   VALUE SPACES.
               10  CHAT-LIT          PIC X(6)   VALUE "CHAT# ".
               10  AR-CHAT-NO        PIC X(6)   VALUE SPACES.
           05  REQ-DATA.
               10  FILLER            PIC X(2)   VALUE SPACES.
               10  REQ-NO-LIT        PIC X(10)  VALUE "REQ. NO.  ".
               10  FILLER            PIC X(1)   VALUE SPACES.
               10  AR-REQ-NO         PIC X(12)  VALUE SPACE.

       01  ACCTING-REQ-DATA-2.
           05  ACCTING-DATA-2.
               10  COMP-LIT-2        PIC X(2)   VALUE "CO".
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  AR-COMP-2         PIC X(3)   VALUE SPACES.
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  PRIME-LIT-2       PIC X(5)   VALUE "PRIME".
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  AR-PRIME-2        PIC X(3)   VALUE SPACES.
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  CLASS-LIT-2       PIC X(3)   VALUE "CLS".
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  AR-SUB-2          PIC X(3)   VALUE SPACES.
               10  FILLER            PIC X(1)   VALUE SPACE.
               10  DEPT-LIT-2        PIC X(4)   VALUE "DEPT".
               10  FILLER            PIC X(1)   VALUE SPACES.
               10  AR-SUB-DETL-2     PIC X(4)   VALUE SPACE.
               10  FILLER            PIC X(2)   VALUE SPACES.
               10  EXPENSE-NW-LIT-2  PIC X(7)   VALUE "NW/A.D.".
               10  AR-ADDL-DATA-2    PIC X(6)   VALUE SPACE.
               10  FILLER            PIC X(1)   VALUE SPACE.
           05  REQ-DATA.
               10  FILLER            PIC X(3)   VALUE SPACES.
               10  REQ-NO-LIT-2      PIC X(10)  VALUE "REQ. NO.  ".
               10  FILLER            PIC X(1)   VALUE SPACES.
               10  AR-REQ-NO-2       PIC X(12)  VALUE SPACE.

       01  STANDARD-INST-DATA.
           05  FILLER                PIC X(3)  VALUE SPACES.
           05  STD-INST-LIT          PIC X(22)
                                      VALUE "STANDARD INSTRUCTIONS ".
           05  STD-INSTS-LIST-OUT.
               10  STD-INST-TABLE-OUT  OCCURS 4 TIMES.
                   15  FILLER        PIC X(2).
                   15  STD-INST-OUT  PIC X(3).

       01  STD-INST-TABLE.
           05  STD-INST-ENTRIES  OCCURS 4 TIMES  PIC X(3).

       01  UNIT-VALUE-AREA.
           05  FILLER                PIC X(3)  VALUE SPACES.
           05  UNIT-VALUE-LIT        PIC X(20)
                                      VALUE "ESTIMATED UNIT VALUE".
           05  FILLER                PIC X(1)  VALUE SPACES.
           05  DE1-ITEM-UNIT-VALUE   PIC Z(10)9 VALUE ZEROS.

       01  PRIMARY-LIT               PIC X(10)  VALUE "PRIMARY   ".

       01  SECONDARY-LIT             PIC X(10)  VALUE "SECONDARY ".

       01  MASTER-STOCK-LIT          PIC X(12)  VALUE "MASTER STOCK".

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.


      *************************************************************
      **                                                         **
      **  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
      **                                                         **
      *************************************************************

       COPY DBSTAT IN COPYLIB.

       01  DATASET-NAMES.
           05  DSET-DPOITEM          PIC X(16)    VALUE "DPOITEM;".
           05  DSET-DPODATAITM       PIC X(16)    VALUE "DPODATAITM;".
           05  DSET-DREQD            PIC X(16)    VALUE "DREQD;".
           05  DSET-MPLTINFO         PIC X(16)    VALUE "MPLTINFO;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS             PIC X(2)     VALUE "@;".
           05  PO-SEARCH             PIC X(10)    VALUE "PO-RCV-NO;".

       01  SUB-ARGUMENT-VALUES.
           05  CODE-ARG              PIC X(8)     VALUE SPACE.

       01  BUILD-PO-KEY-VALUE.
           05  B-PO-PREFIX           PIC X        VALUE "P".
           05  B-PO-NO               PIC X(7)     VALUE SPACE.
           05  B-PO-RLSE             PIC X(3)     VALUE SPACE.
           05  B-PO-RCV              PIC X(3)     VALUE ZERO.

       01  ITEM-ADDRESS-TABLE.
           05  ITEM-ADDRESS  OCCURS  1001  TIMES
                                     PIC X(4).

       01  SUBSCRIPTS BINARY.
           05  LINE-SUB              PIC S9(4)    VALUE ZERO.
           05  PAGE-SUB              PIC S9(4)    VALUE ZERO.
           05  DESC-SUB              PIC S9(4)    VALUE ZERO.
           05  INST-SUB              PIC S9(4)    VALUE ZERO.
           05  DCOMPL-SUB            PIC S9(4)    VALUE ZERO.

       01  SAVE-AREAS.
           05  SAVE-CONT-DSET        PIC X        VALUE SPACE.
           05  SAVE-ITEM-SEQ         PIC X(6)     VALUE SPACES.
           05  CONTINUED-SCREEN      PIC X        VALUE "N".
           05  REQUEST-ITEM-SW       PIC X        VALUE "N".
           05  REQUEST-CORPCODE-SW   PIC X        VALUE "N".
           05  ANOTHER-ITEM-SW       PIC X        VALUE SPACES.

      *************************************************************
      **                                                         **
      **             D A T A B A S E   B U F F E R S             **
      **                                                         **
      *************************************************************

       COPY DPOITEM  IN COPYLIB.

       COPY DPODATA  IN COPYLIB.

       COPY DREQD    IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.
      *******************************
      **  PARAMETERS FOR CALLING
      **  'CDESC'
      *******************************

       COPY CDESC IN COPYLIB.

       01  RET-CODE                     PIC X(2)  VALUE SPACES.

       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).

       COPY CCHKOBJ IN COPYLIB.

       LINKAGE SECTION.
       01  BASE                      PIC X(10).
      *************************************************************
      **                                                         **
      **      S C R E E N   P R I N T   P A R A M E T E R S      **
      **                                                         **
      *************************************************************

       01  SCREEN-PRINT-PARMS.
           05  PRINT-CTL             PIC S9(4) BINARY.
           05  PAGE-CTL              PIC S9(4) BINARY.
           05  SPOOLFIL-OPEN-SW      PIC X.

       01  PASS-SPOOL-PRT-NO         PIC S9(2) BINARY.

       COPY VCOMLINK IN COPYLIB.

       01  MAIN-ARGUMENT-VALUES.
           05  PLT-ARG               PIC X(4).
           05  PO-ARG                PIC X(14).
           05  VEN-ARG               PIC X(10).
           05  REQ-ARG               PIC X(12).

       01  SAVE-POINQ-AREA.
           05  SAVE-COMPANY          PIC X(3).
           05  SAVE-ITEM-NUMBER      PIC 9(4).
           05  SAVE-CORPCODE-MAIN    PIC X(7).
           05  SAVE-PO-COUNT         PIC 9(2).

       COPY LANGSUB IN COPYLIB.


       PROCEDURE DIVISION USING  BASE,
                                 SCREEN-PRINT-PARMS,
                                 PASS-SPOOL-PRT-NO,
                                 VIEW-COMAREA,
                                 MAIN-ARGUMENT-VALUES,
                                 SAVE-POINQ-AREA,
                                 LANGUAGE-PARMS.

       PO-INQUIRY SECTION 01.
       BEGIN-HERE.
           OPEN INPUT DPODATAITM-I, DPOITEM-I, DREQD-I, MPLTINFO-I,
               MSTORERM-I.
           OPEN I-O DISPLAY-FILE.

           PERFORM  1-HOUSEKEEPING THRU 1-H-X.
           PERFORM  6-DETERMINE-PO-TYPE  THRU
                    6-DETERMINE-PO-TYPE-X.

           CLOSE DPODATAITM-I, DPOITEM-I, DREQD-I, MSTORERM-I,
                 DISPLAY-FILE.
           GOBACK.

       1-HOUSEKEEPING.
           MOVE  66 TO LANG-SETNUM.
           MOVE 130 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BCSF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  38 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CSF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  39 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BSF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  40 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  41 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BS-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  42 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO S-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  48 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BCF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  49 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BC-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  67 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  68 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO C-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  69 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO BF-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  70 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO B-REVIEW-MSG-TEXT.
           MOVE  16 TO LANG-SETNUM.
           MOVE  74 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO F-REVIEW-MSG-TEXT.
           MOVE   9 TO LANG-SETNUM.
           MOVE   1 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO NOT-FOUND-ITEM-MSG.
           MOVE   3 TO LANG-SETNUM.
           MOVE  21 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO NOT-FOUND-CORPCODE-MSG.
           MOVE   9 TO LANG-SETNUM.
           MOVE   2 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CAPACITY-EXCEEDED-MSG-TEXT.
           MOVE  55 TO LANG-SETNUM.
           MOVE  13 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CLASS-LIT.
           MOVE  04 TO LANG-SETNUM.
           MOVE  08 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DEPT-LIT.
           MOVE  55 TO LANG-SETNUM.
           MOVE  15 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO EXPENSE-NW-LIT.
           MOVE  18 TO LANG-SETNUM.
           MOVE  38 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO REQ-NO-LIT.
           MOVE  19 TO LANG-SETNUM.
           MOVE  23 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO STD-INST-LIT.
           MOVE  14 TO LANG-SETNUM.
           MOVE  47 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO PRIMARY-LIT.
           MOVE  19 TO LANG-SETNUM.
           MOVE  25 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SECONDARY-LIT.
           MOVE  55 TO LANG-SETNUM.
           MOVE  23 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO UNIT-VALUE-LIT.
           MOVE  13 TO LANG-SETNUM.
           MOVE  46 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MASTER-STOCK-LIT.

      ***********************************************************
      *    READ OF PCPO RECORD IN MPLTINFO IS DONE SO THAT      *
      *    PROGRAM CAN DECIDE WHETHER COMPANY AND PRIME ARE TO  *
      *    APPEAR ON THE ITEM SCREEN                            *
      ***********************************************************
028100     MOVE "PCPO"                   TO   PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "N"                  TO   SAVE-PCPO-SW
           ELSE
           MOVE MPLTINFO-PCPO-SW         TO   SAVE-PCPO-SW.

      *------- CHECK TO SEE IF COMPLIANCE REQMTS NEED TO BE DISPLAYED.
           MOVE "MCFPCS7000"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING    CHKOBJ-FILE-NAME,
                                   CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "Y"        TO  PRINT-DCOMPL-SW
           ELSE
               MOVE "N"        TO  PRINT-DCOMPL-SW.

       1-H-X.
           EXIT.

      ************************************************************
      ************************************************************
      *                    B L O W U P                           *
      *     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
      *     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
      *     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
      *                                                          *
      *     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
      *     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
      *                                                          *
      *         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
      ************************************************************
      ************************************************************
       2-BLOWUP.
           MOVE "TPOINQI"        TO BU-PGM-NAME.
           MOVE VEN-ARG          TO BU-DISPLAY-FLD (1).
           MOVE PO-ARG           TO BU-DISPLAY-FLD (2).
           MOVE SAVE-ITEM-NUMBER TO BU-DISPLAY-FLD (3).
           MOVE REQ-ARG          TO BU-DISPLAY-FLD (4).
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS,  BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.
       2-BLOWUP-X.
           EXIT.


       6-DETERMINE-PO-TYPE.
      **************************************************
      **  DETERMINE IF PO IS CODED OR NON-CODED.      **
      **************************************************

           IF SAVE-ITEM-NUMBER EQUAL ZERO
               MOVE "N"  TO  REQUEST-ITEM-SW
           ELSE
               MOVE "Y"  TO  REQUEST-ITEM-SW.

           IF SAVE-CORPCODE-MAIN EQUAL SPACE
               MOVE "N"  TO  REQUEST-CORPCODE-SW
           ELSE
               MOVE "Y"  TO  REQUEST-CORPCODE-SW.

      *****************************************************
      *                                                   *
      *    GET THE JCW  'PRICE'.                          *
      *    IF THE 'PRICE' JCW IS FOUND AND IS SET TO '1'  *
      *    THEN THE USER CAN SEE PRICING INFO.            *
      *                                                   *
      *****************************************************

      *******************************************
      **  ACCEPT LOCAL DATA AREA FOR JCW-ITONLY
      *******************************************

           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.

      ********* 19JUN91 REPLACED THE FOLLOWING IF STMT.
      ********* SHOWING PRICE/COST BECOMES THE DEFAULT. DAP.
      ***  IF JCW-PRICE-258 = "1"
      ***      MOVE "Y"  TO PRICE-CAPABILITY-SW
      ***  ELSE
      ***      MOVE "N"    TO PRICE-CAPABILITY-SW.

           IF JCW-PRICE-258 = "0"
               MOVE "N"  TO PRICE-CAPABILITY-SW
           ELSE
               MOVE "Y"  TO PRICE-CAPABILITY-SW.

           MOVE PO-ARG                  TO BUILD-PO-KEY-VALUE.

           PERFORM 61-CHECK-FOR-MEMO-Z.

           PERFORM  61-PO-ITEMS  THRU  61-PO-ITEMS-X.

       6-DETERMINE-PO-TYPE-X.
           EXIT.


       61-CHECK-FOR-MEMO-Z.
           MOVE SPACE                   TO Z-BILL-STATUS.
           MOVE B-PO-NO                 TO PO-ARRAY.
           PERFORM 611-FIND-M VARYING PO-INDEX FROM 7 BY -1 UNTIL
             PO-INDEX = 0 OR MEMO-Z-BILL.

       611-FIND-M.
           IF PO-CHAR (PO-INDEX) = "M"
               MOVE "1" TO Z-BILL-STATUS
           ELSE
               IF PO-CHAR (PO-INDEX) NOT = SPACE
                   SET PO-INDEX TO 1.

       61-PO-ITEMS.
           MOVE "FPOINQSI"      TO  VIEW-NFNAME.

           MOVE SPACE              TO  DE-BUFFER1.
           MOVE SAVE-COMPANY       TO  DE1-CCD.
           MOVE B-PO-NO            TO  DE1-PO.
           MOVE B-PO-RLSE          TO  DE1-RLSE.
           MOVE "N"                TO  CONTINUED-SCREEN.
           MOVE SPACES             TO  SAVE-CONT-DSET,
                                       SAVE-ITEM-SEQ,
                                       ITEM-ADDRESS-TABLE.
           MOVE ZERO               TO  PAGE-SUB,
                                       LINE-SUB.

      **************************************************
      **  GET DPOITEM FOR PRICE, QTY, AND DATE DATA.  **
      **************************************************

           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *            ***  PURCHASE ORDER CONTAINS NO ITEMS  ***
                   MOVE  16 TO LANG-SETNUM
                   MOVE  56 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO DE1-ITEM-LINE (3)
                   GO TO  61-WRITE-MSG-LINE
               ELSE
                   MOVE "FIND DPOITEM*61-PI"  TO  BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

       61-GET-DPOITEM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.

           IF COND-WORD EQUAL ZERO
               IF PAGE-SUB GREATER THAN 999
                   MOVE "N"  TO  REQUEST-ITEM-SW
                   ADD 1  TO  PAGE-SUB
                   MOVE CAPACITY-EXCEEDED-MSG  TO  DE1-ITEM-LINE (3)
                   GO TO  61-WRITE-MSG-LINE
               ELSE
                   ADD 1                TO  PAGE-SUB
                   MOVE ITM-NUMBER      TO  ITEM-ADDRESS (PAGE-SUB)
                   IF REQUEST-ITEM-SW EQUAL "Y"
                       IF ITM-NUMBER EQUAL SAVE-ITEM-NUMBER
                           MOVE "N"  TO  REQUEST-ITEM-SW
                       ELSE
                           IF ITM-NUMBER GREATER THAN SAVE-ITEM-NUMBER
                               MOVE SAVE-ITEM-NUMBER  TO  NF-ITEM-NUMBER
                               MOVE NOT-FOUND-ITEM-MSG
                                             TO  DE1-ITEM-LINE (3)
                               MOVE "N"  TO  REQUEST-ITEM-SW
                               MOVE "Y" TO ANOTHER-ITEM-SW
                               SUBTRACT 1 FROM PAGE-SUB
                               GO TO  61-WRITE-MSG-LINE-CONT
                           ELSE
                               GO TO  61-GET-DPOITEM-LOOP
                   ELSE
                       IF REQUEST-CORPCODE-SW EQUAL "Y"
                           IF ITM-CORP-CODE EQUAL SAVE-CORPCODE-MAIN
                               MOVE "N"  TO  REQUEST-CORPCODE-SW
                           ELSE
                               GO TO  61-GET-DPOITEM-LOOP
                       ELSE
                           NEXT SENTENCE
               ELSE
                   IF COND-WORD EQUAL 15
                       IF REQUEST-ITEM-SW EQUAL "Y"
                           MOVE SAVE-ITEM-NUMBER  TO  NF-ITEM-NUMBER
                           MOVE NOT-FOUND-ITEM-MSG
                                         TO  DE1-ITEM-LINE (3)
                           MOVE "N"  TO  REQUEST-ITEM-SW
                           ADD 1  TO  PAGE-SUB
                           GO TO  61-WRITE-MSG-LINE
                       ELSE
                           IF REQUEST-CORPCODE-SW EQUAL "Y"
                               MOVE SAVE-CORPCODE-MAIN  TO  NF-CORPCODE
                               MOVE NOT-FOUND-CORPCODE-MSG
                                             TO  DE1-ITEM-LINE (3)
                               MOVE "N"  TO  REQUEST-CORPCODE-SW
                               ADD 1  TO  PAGE-SUB
                               GO TO  61-WRITE-MSG-LINE
                           ELSE
                               GO TO  61-WRITE-MSG-LINE
                   ELSE
                       MOVE "GET5 DPOITEM*61-GDL" TO BU-DISPLAY-MSG
                       GO TO 2-BLOWUP.

       61-GATHER-ITEM-DATA.
           MOVE 1 TO LINE-SUB.
           MOVE SPACES  TO  DE1-ITEM-TABLE.
           MOVE "N"  TO  CONTINUED-SCREEN.
           MOVE SPACE  TO  ITEM-DETAIL.
           MOVE SPACE  TO  AR-COMP-2, AR-PRIME-2,
                           AR-SUB, AR-SUB-2,
                           AR-SUB-DETL, AR-SUB-DETL,
                           AR-ADDL-DATA, AR-ADDL-DATA-2,
                           AR-CHAT-NO,
                           AR-REQ-NO, AR-REQ-NO-2,
                           STD-INSTS-LIST-OUT.

           IF PAGE-SUB GREATER THAN 999
               MOVE "N" TO ANOTHER-ITEM-SW
               MOVE CAPACITY-EXCEEDED-MSG  TO  DE1-ITEM-LINE (3)
               GO TO  61-WRITE-MSG-LINE-CONT.

           IF ITM-CLASS = SPACES
               MOVE "***"               TO  AR-SUB
                                            AR-SUB-2
           ELSE
               MOVE ITM-CLASS           TO  AR-SUB
                                            AR-SUB-2.
           IF ITM-SUB-DETL = SPACES
               MOVE "****"              TO  AR-SUB-DETL
                                            AR-SUB-DETL-2
           ELSE
               MOVE ITM-SUB-DETL        TO  AR-SUB-DETL
                                            AR-SUB-DETL-2.
           IF ITM-ADDL-DATA = SPACES
               MOVE "*********"         TO  AR-ADDL-DATA
                                            AR-ADDL-DATA-2
           ELSE
               MOVE ITM-ADDL-DATA       TO  AR-ADDL-DATA
                                            AR-ADDL-DATA-2.
           IF ITM-CHAT-NO = SPACES
               MOVE "******"            TO  AR-CHAT-NO
           ELSE
           MOVE ITM-CHAT-NO             TO  AR-CHAT-NO.

           IF SAVE-PCPO-SW = "Y"
               MOVE ITM-COMPANY         TO  AR-COMP-2
               MOVE ITM-PRIME           TO  AR-PRIME-2.
           MOVE ITM-NUMBER              TO  DE1-ITEM-NUMBER.
           IF ITM-CORP-CODE = "NON-STR"
               MOVE SPACES              TO  CODE-ARG
               MOVE "NC"                TO  DE1-CORP-CODE
           ELSE
               MOVE ITM-CORP-CODE       TO  DE1-CORP-CODE,
                                            CODE-ARG.
           MOVE ITM-TAX-CODE            TO  DE1-TAX-CODE.
           IF ITM-CORP-CODE = "NON-STR"
               MOVE SPACES              TO  DE1-LANGUAGE-TYPE
           ELSE
               IF ITM-SECOND-DESC-INDIC = "X"
                   MOVE SECONDARY-LIT   TO  DE1-LANGUAGE-TYPE
               ELSE
                   MOVE PRIMARY-LIT     TO  DE1-LANGUAGE-TYPE.

           IF ITM-MASTER-STOCK = SPACES
               MOVE SPACES              TO  DE1-MASTER-STOCK-LIT,
                                            DE1-MASTER-STOCK
           ELSE
               MOVE MASTER-STOCK-LIT    TO  DE1-MASTER-STOCK-LIT
               MOVE ITM-MASTER-STOCK    TO  DE1-MASTER-STOCK.

           MOVE ITM-UNIT-PRICE     TO  DE1-ITEM-PRICE.
           IF DE1-ITEM-PRICE-D34  = "00"
               MOVE SPACES         TO  DE1-ITEM-PRICE-D34.

           MOVE ITM-PRICE-UM       TO  DE1-ITEM-PRICE-UM.

           IF PRICE-ALLOWED
               NEXT SENTENCE
           ELSE
               MOVE SPACES         TO  DE1-ITEM-PRICE-X,
                                       DE1-ITEM-PRICE-UM.

           IF NOT A-KELLY-PLANT
             MOVE ITM-QTY-ORD      TO  DE1-ITEM-QTY-ORD
           ELSE
             MOVE ITM-KELLY-PO-QTY TO  DE1-ITEM-QTY-ORD.
           IF DE1-ITEM-QTY-D12 = "00"   AND
              DE1-ITEM-QTY-D34 = "00"
               MOVE SPACES         TO  DE1-ITEM-QTY-DEC-DIG
           ELSE
               IF DE1-ITEM-QTY-D34 = "00"
                   MOVE SPACES     TO  DE1-ITEM-QTY-D34.

           IF NOT A-KELLY-PLANT
             MOVE ITM-UM             TO  DE1-ORD-UM
           ELSE
             MOVE ITM-KELLY-PO-UM    TO  DE1-ORD-UM.

           IF A-KELLY-PLANT
               IF ITM-QTY-ORD = ZERO OR ITM-KELLY-PO-QTY = ZERO
                   MOVE 1 TO KELLY-CF
               ELSE
                   DIVIDE ITM-QTY-ORD BY ITM-KELLY-PO-QTY
                     GIVING KELLY-CF ROUNDED.
           IF NOT A-KELLY-PLANT
               MOVE ITM-QTY-DLVR       TO  DE1-ITEM-QTY-DLV
           ELSE
               DIVIDE ITM-QTY-DLVR BY KELLY-CF
                 GIVING CHECK-QTY ROUNDED
               MOVE CHECK-QTY          TO  DE1-ITEM-QTY-DLV.
           IF DE1-ITEM-DLV-D12 = "00"   AND
              DE1-ITEM-DLV-D34 = "00"
               MOVE SPACES         TO  DE1-ITEM-DLV-DEC-DIG
           ELSE
               IF DE1-ITEM-DLV-D34 = "00"
                   MOVE SPACES     TO  DE1-ITEM-DLV-D34.

           IF NOT A-KELLY-PLANT
               MOVE ITM-QTY-STORED     TO  DE1-ITEM-QTY-STR
           ELSE
               DIVIDE ITM-QTY-STORED BY KELLY-CF
                 GIVING CHECK-QTY ROUNDED
               MOVE CHECK-QTY          TO  DE1-ITEM-QTY-STR.
           IF DE1-ITEM-STR-D12 = "00"   AND
              DE1-ITEM-STR-D34 = "00"
               MOVE SPACES         TO  DE1-ITEM-STR-DEC-DIG
           ELSE
               IF DE1-ITEM-STR-D34 = "00"
                   MOVE SPACES     TO  DE1-ITEM-STR-D34.

           IF ITM-DATE-RCVD EQUAL SPACE
               MOVE SPACE          TO  DE1-DATE-DLVR
           ELSE
               MOVE 4 TO DATE-MODE
               MOVE ITM-DATE-RCVD TO DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT TO DATE-WS
               MOVE DISPLAY-DATE TO DE1-DATE-DLVR.

           IF ITM-DATE-STORED EQUAL SPACE
               MOVE SPACE              TO  DE1-DATE-STOR
           ELSE
               MOVE 4 TO DATE-MODE
               MOVE ITM-DATE-STORED TO DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT TO DATE-WS
               MOVE DISPLAY-DATE TO DE1-DATE-STOR.

           MOVE ITEM-DETAIL         TO  DE1-ITEM-LINE (LINE-SUB).

      ***********************************************
      **  IF THIS IS A NON-CODED ITEM THEN SKIP
      **  LOGIC FOR 'CDESC'
      **  SINCE THIS DOESN'T APPLY TO NON-CODED ITEMS
      ***********************************************

           IF ITM-CORP-CODE = "NON-STR"
               GO TO 61-FIND-DPODATAITM.


       61-FIND-DDESC.
      **************************************************
      **  CALL CDESC FOR DESCRIPTION LINES.           **
      **************************************************

           IF ITM-SECOND-DESC-INDIC  =  "X"
               MOVE "S"                 TO  CDESC-LANGUAGE-OPTION
           ELSE
               MOVE "P"                 TO  CDESC-LANGUAGE-OPTION.
           CALL "CDESC" USING RET-CODE,
                              BASE,
                              STATUS-AREA,
                              BU-DISPLAY-MSG,
                              CODE-ARG,
                              CDESC-DATA.
           IF BU-DISPLAY-MSG-1  NOT = SPACES
               MOVE CODE-ARG            TO  BU-DISPLAY-FLD (5)
               GO TO 2-BLOWUP.

           IF CDESC-LINES-GOT  =  0
               ADD 1  TO  LINE-SUB
      *       *** NO DESCRIPTION ON FILE ***
               MOVE  14 TO LANG-SETNUM
               MOVE   3 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO DE1-ITEM-LINE (LINE-SUB)
               GO TO  61-FIND-DPODATAITM.

           MOVE ZEROS                   TO  DESC-SUB.

       61-GET-DESC-LOOP.
           ADD 1                        TO  DESC-SUB.
           IF DESC-SUB > CDESC-LINES-GOT
               GO TO 61-FIND-DPODATAITM.

           ADD 1  TO  LINE-SUB.

           IF LINE-SUB GREATER THAN 9
               MOVE "D"     TO  SAVE-CONT-DSET
               GO TO  61-WRITE-MSG-LINE
           ELSE
               MOVE CDESC (DESC-SUB)    TO  DE1-ITEM-LINE (LINE-SUB)
               GO TO  61-GET-DESC-LOOP.

       61-FIND-DPODATAITM.
      **************************************************
      **  GET DPODATAITM FOR DESC/COMMENT LINES.      **
      **************************************************

           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-I.
           START DPODATAITM-I KEY = PORCVNO OF DPODATAITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      *************GO TO 61-PRINT-ITEM-VALUE
                   GO TO 61-PRINT-DCOMPL
               ELSE
                   MOVE "FIND DPODATAITM * 61-FD"  TO  BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

       61-GET-DPODATAITM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-I NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
      *    CALL DBGET USING BASE,
      *                        DSET-DPODATAITM,
      *                        MODE5,
      *                        STATUS-AREA,
      *                        ALL-ITEMS,
      *                        BUF-DPODATAITM,
      *                        PO-ARG.
           IF COND-WORD EQUAL ZERO
               NEXT SENTENCE
           ELSE
               IF COND-WORD EQUAL 15
      *************GO TO  61-PRINT-ITEM-VALUE
                   GO TO  61-PRINT-DCOMPL
               ELSE
                   MOVE "GET5 DPODATAITM *61-GDL"  TO  BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           IF DATAITM-ITEM-NO EQUAL DE1-ITEM-NUMBER
               NEXT SENTENCE
           ELSE
           IF DATAITM-ITEM-NO  >  DE1-ITEM-NUMBER
      *********GO TO  61-PRINT-ITEM-VALUE
               GO TO  61-PRINT-DCOMPL
           ELSE
               GO TO  61-GET-DPODATAITM-LOOP.

           ADD 1      TO  LINE-SUB.

           IF LINE-SUB GREATER THAN 9
               MOVE "I"     TO  SAVE-CONT-DSET
               MOVE DATAITM-LINE TO SAVE-ITEM-SEQ
               GO TO  61-WRITE-MSG-LINE
           ELSE
               MOVE DATAITM-INFO  TO  DE1-ITEM-LINE (LINE-SUB)
               GO TO  61-GET-DPODATAITM-LOOP.

       61-PRINT-DCOMPL.
           IF PRINT-DCOMPL-SW = "Y"
               MOVE CODE-ARG       TO  CCRQDESC-CODE
               MOVE SPACES         TO  CCRQDESC-LINES
               CALL "CCRQDESC" USING CCRQDESC-PARMS
           ELSE
               GO TO 61-PRINT-ITEM-VALUE.
           IF CCRQDESC-LINES = SPACES
               GO TO 61-PRINT-ITEM-VALUE.
           MOVE 0                       TO  DCOMPL-SUB.

       61-DCOMPL-LOOP.
           ADD 1                        TO  DCOMPL-SUB.
           IF DCOMPL-SUB > 6 OR CCRQDESC-LINE (DCOMPL-SUB) = SPACES
               GO TO 61-PRINT-ITEM-VALUE.

           ADD 1  TO  LINE-SUB.

           IF LINE-SUB > 9
               MOVE "C"     TO  SAVE-CONT-DSET
               SUBTRACT 1   FROM DCOMPL-SUB
               GO TO  61-WRITE-MSG-LINE
           ELSE
               MOVE CCRQDESC-LINE (DCOMPL-SUB)
                                        TO  DE1-ITEM-LINE (LINE-SUB)
               GO TO  61-DCOMPL-LOOP.

       61-PRINT-ITEM-VALUE.
           IF MEMO-Z-BILL  AND  PRICE-ALLOWED
               ADD 1                    TO  LINE-SUB
               IF LINE-SUB > 9
                   MOVE "Z"             TO  SAVE-CONT-DSET
                   GO TO 61-WRITE-MSG-LINE
               ELSE
                   MOVE ITM-ZBILL-VALUE TO  DE1-ITEM-UNIT-VALUE
                   MOVE UNIT-VALUE-AREA TO  DE1-ITEM-LINE (LINE-SUB).

       61-PRINT-STD-INSTS.
           IF ITM-STD-INST = SPACES
               NEXT SENTENCE
           ELSE
               ADD 1                    TO  LINE-SUB
               IF LINE-SUB > 9
                   MOVE "S"             TO  SAVE-CONT-DSET
                   GO TO 61-WRITE-MSG-LINE
               ELSE
                   MOVE ITM-STD-INST    TO  STD-INST-TABLE
                   PERFORM 611-LOAD-STD-INSTS  THRU  611-LSI-X
                       VARYING INST-SUB FROM 1 BY 1
                           UNTIL INST-SUB > 4
                   MOVE STANDARD-INST-DATA TO DE1-ITEM-LINE (LINE-SUB).

      **********************************
      **  IF ITEM IS NON-CODED
      **  SKIP GET OF MSTORERM FOR CLASS
      **********************************

           IF ITM-CORP-CODE = "NON-STR"
               GO TO 61-FIND-REQ.

      *61-GET-MSTORERM.
      *    IF AR-SUB = "***"
      *        NEXT SENTENCE
      *    ELSE
      *        GO TO 61-FIND-REQ.

      **************************************************
      **  GET MSTORERM FOR STR CLASS IN ACCTING LINE. **
      **************************************************

      *    CALL "DBGET" USING  BASE,
      *                        DSET-MSTORERM,
      *                        MODE7,
      *                        STATUS-AREA,
      *                        ALL-ITEMS,
      *                        BUF-MSTORERM,
      *                        CODE-ARG.
      *    IF COND-WORD NOT EQUAL ZERO
      *        MOVE "GET7 MSTORERM*61-GM" TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *    IF STR-CLASS EQUAL SPACE
      *        MOVE "***"      TO  AR-SUB
      *    ELSE
      *        MOVE STR-CLASS  TO  AR-SUB.

      ****************************************************
      *    FIND REQ NUMBER AND MOVE TO ACCTING LINE      *
      ****************************************************
       61-FIND-REQ.
           PERFORM 63-FIND-REQ THRU 63-EXIT.

       61-PRINT-ACCTG-LINE.
           ADD 1  TO  LINE-SUB.

           IF LINE-SUB GREATER THAN 9
               MOVE "A"     TO  SAVE-CONT-DSET
               GO TO  61-WRITE-MSG-LINE.

           IF SAVE-PCPO-SW = "Y"
               MOVE ACCTING-REQ-DATA-2 TO DE1-ITEM-LINE (LINE-SUB)
           ELSE
           MOVE ACCTING-REQ-DATA       TO DE1-ITEM-LINE (LINE-SUB).

       61-WRITE-MSG-LINE.
           IF CONTINUED-SCREEN = "Y"
               GO TO 61-WRITE-MSG-LINE-CONT.
           MOVE "N" TO ANOTHER-ITEM-SW.
           READ DPOITEM-I NEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE SPACES TO PORCVNO OF DPOITEM-REC-I
               ELSE
                   MOVE "READ DPOITEM *61-WML" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               NEXT SENTENCE
           ELSE
               MOVE "Y" TO ANOTHER-ITEM-SW
               ADD 1 TO PAGE-SUB
               MOVE ITEMNO OF DPOITEM-REC-I TO ITEM-ADDRESS (PAGE-SUB)
               SUBTRACT 1 FROM PAGE-SUB.

       61-WRITE-MSG-LINE-CONT.
           IF LINE-SUB GREATER THAN 9
               IF PAGE-SUB GREATER THAN 1
                   IF ANOTHER-ITEM-SW = "Y"
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE BCSF-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE BCF-REVIEW-MSG  TO  DE1-MSG-LINE
                   ELSE
                       MOVE BC-REVIEW-MSG  TO  DE1-MSG-LINE
               ELSE
                   IF ANOTHER-ITEM-SW = "Y"
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE CSF-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE CF-REVIEW-MSG  TO  DE1-MSG-LINE
                   ELSE
                       MOVE C-REVIEW-MSG  TO  DE1-MSG-LINE
           ELSE
               IF PAGE-SUB GREATER THAN 1
                   IF ANOTHER-ITEM-SW = "Y"
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE BSF-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE BF-REVIEW-MSG  TO  DE1-MSG-LINE
                   ELSE
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE BS-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE B-REVIEW-MSG  TO  DE1-MSG-LINE
               ELSE
                   IF ANOTHER-ITEM-SW = "Y"
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE SF-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE F-REVIEW-MSG  TO  DE1-MSG-LINE
                   ELSE
                       IF CONTINUED-SCREEN EQUAL "Y"
                           MOVE S-REVIEW-MSG  TO  DE1-MSG-LINE
                       ELSE
                           MOVE SPACE  TO  DE1-MSG-LINE.

       61-PROCESS-FORM1.
      *-----DETERMINE TO DISPLAY "F4 FOR QS9000 TRACKING"
           IF ITM-QS9000-TRACK = "X"
              MOVE B"1" TO IND(1).

           MOVE DE-BUFFER1     TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO DE-BUFFER1.

           IF VIEW-LASTKEY EQUAL 3
               GO TO  61-PO-ITEMS-X.

           IF VIEW-LASTKEY EQUAL 1
               GO TO  61-PO-ITEMS-X.

           IF VIEW-LASTKEY EQUAL 2
               IF CONTINUED-SCREEN EQUAL "Y"
                   GO TO  61-GET-DPOITEM-CALC
               ELSE
      *            ***  INVALID FUNCTION KEY ENTERED  ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99 TO FIELD-NUMBER
                   PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X
                   GO TO  61-PROCESS-FORM1.

           IF VIEW-LASTKEY EQUAL 4
               IF LINE-SUB GREATER THAN 9
                   GO TO  61-DETERMINE-CONT-DATASET
               ELSE
      *            ***  INVALID FUNCTION KEY ENTERED  ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99 TO FIELD-NUMBER
                   PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X
                   GO TO  61-PROCESS-FORM1.

           IF VIEW-LASTKEY EQUAL 5
               IF ITM-QS9000-TRACK = "X"
                   MOVE "D" TO TRAK-FUNCTION
                   CALL "SRCVTRAK" USING ITM-PO-RCV-NO
                                         ITM-NUMBER
                                         VEN-ARG
                                         ITM-CORP-CODE
                                         TRAK-FUNCTION
                                         ITM-QTY-ORD
                   GO TO  61-PROCESS-FORM1
               ELSE
      *            ***  INVALID FUNCTION KEY ENTERED  ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99 TO FIELD-NUMBER
                   PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X
                   GO TO  61-PROCESS-FORM1.

           IF VIEW-LASTKEY EQUAL 6
               IF PAGE-SUB GREATER THAN 1
                   SUBTRACT 1  FROM  PAGE-SUB
                   GO TO  61-GET-DPOITEM-CALC
               ELSE
      *            ***  INVALID FUNCTION KEY ENTERED  ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99 TO FIELD-NUMBER
                   PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X
                   GO TO  61-PROCESS-FORM1.

           IF VIEW-LASTKEY EQUAL 7
               IF ANOTHER-ITEM-SW = "Y"
                   ADD 1 TO PAGE-SUB
                   GO TO  61-GET-DPOITEM-CALC
               ELSE
      *            ***  INVALID FUNCTION KEY ENTERED  ***
                   MOVE   9 TO LANG-SETNUM
                   MOVE  10 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 99 TO FIELD-NUMBER
                   PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X
                   GO TO  61-PROCESS-FORM1.

           IF VIEW-LASTKEY EQUAL 5  OR
              VIEW-LASTKEY EQUAL 8
      *        ***  INVALID FUNCTION KEY ENTERED  ***
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 99  TO  FIELD-NUMBER
               PERFORM  73-PGM-ERROR  THRU 73-PGM-ERROR-X
               GO TO  61-PROCESS-FORM1.

      *    ***  PRESS DESIRED FUNCTION KEY - NOT 'ENTER'  ***
           MOVE  16 TO LANG-SETNUM.
           MOVE  30 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE 99 TO FIELD-NUMBER.
           PERFORM  73-PGM-ERROR   THRU  73-PGM-ERROR-X.
           GO TO  61-PROCESS-FORM1.

       61-DETERMINE-CONT-DATASET.
           MOVE SPACE  TO  DE1-ITEM-TABLE.
           MOVE "Y"  TO  CONTINUED-SCREEN.

           IF SAVE-CONT-DSET EQUAL "D"
               MOVE ZERO                TO   LINE-SUB
               SUBTRACT 1               FROM DESC-SUB
               GO TO  61-GET-DESC-LOOP
           ELSE
           IF SAVE-CONT-DSET EQUAL "I"
               GO TO  61-GET-DPODATAITM-CALC
           ELSE
           IF SAVE-CONT-DSET EQUAL "Z"
               MOVE ZEROS               TO  LINE-SUB
               GO TO  61-PRINT-ITEM-VALUE
           ELSE
           IF SAVE-CONT-DSET EQUAL "S"
               MOVE ZEROS               TO  LINE-SUB
               GO TO  61-PRINT-STD-INSTS
           ELSE
           IF SAVE-CONT-DSET EQUAL "A"
               MOVE ZEROS               TO  LINE-SUB
               GO TO  61-PRINT-ACCTG-LINE
           ELSE
           IF SAVE-CONT-DSET EQUAL "C"
               MOVE ZEROS               TO  LINE-SUB
               GO TO  61-DCOMPL-LOOP
           ELSE
               MOVE "ITEM CONTINUATION*61-DCD"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

       61-GET-DPOITEM-CALC.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           MOVE ITEM-ADDRESS (PAGE-SUB)  TO  ITEMNO OF DPOITEM-REC-I.
           READ DPOITEM-I INTO BUF-DPOITEM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET4 DPOITEM*61-GDC"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP
           ELSE
               GO TO 61-GATHER-ITEM-DATA.

       61-GET-DPODATAITM-CALC.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-I.
           MOVE SAVE-ITEM-SEQ TO ITEMSEQNO OF DPODATAITM-REC-I.
           READ DPODATAITM-I INTO BUF-DPODATAITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET4 DPODATAITM"  TO  BU-DISPLAY-MSG
               MOVE SAVE-ITEM-SEQ      TO  BU-DISPLAY-FLD (5)
               GO TO 2-BLOWUP.

           MOVE ZERO  TO  LINE-SUB.

           IF DATAITM-ITEM-NO EQUAL DE1-ITEM-NUMBER
               ADD 1  TO  LINE-SUB
               MOVE DATAITM-INFO  TO  DE1-ITEM-LINE (LINE-SUB).

           GO TO  61-GET-DPODATAITM-LOOP.

       61-PO-ITEMS-X.
           EXIT.


       611-LOAD-STD-INSTS.
           MOVE STD-INST-ENTRIES (INST-SUB)
                                        TO STD-INST-OUT (INST-SUB).

       611-LSI-X.
           EXIT.



      *************************************************************
      *      FIND REQ NUMBER AND MOVE IT TO ACCTING LINE          *
      *************************************************************
       63-FIND-REQ.
           MOVE ALL "*" TO AR-REQ-NO.
           MOVE PO-ARG TO PORCVNO OF DREQD-REC-I.
           START DREQD-I KEY = PORCVNO OF DREQD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 63-EXIT
               ELSE
                  MOVE "FIND DREQD* 63-FR" TO BU-DISPLAY-MSG
                  GO TO 2-BLOWUP.

       63-FIND-REQ-LOOP.
           READ DREQD-I NEXT INTO BUF-DREQD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   GO TO 63-EXIT
               ELSE
                   MOVE "GET DREQD *63-FRL" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF PORCVNO OF DREQD-REC-I NOT = PO-ARG
               GO TO 63-EXIT.

           IF DREQD-PO-ITM-NO = DE1-ITEM-NUMBER
               MOVE DREQD-REQ-NUMBER TO AR-REQ-NO
           ELSE
               GO TO 63-FIND-REQ-LOOP.

       63-EXIT.
           EXIT.

       73-PGM-ERROR.
           MOVE B"1"   TO IND (FIELD-NUMBER) IND (99).
           MOVE MESSAGE-BUFFER TO DE1-MESSAGE-LINE.

       73-PGM-ERROR-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
