000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TPOMISC.
000400 AUTHOR.         ANNETTE M. KRAUSS.
000700 INSTALLATION.   THE GOODYEAR TIRE AND RUBBER COMPANY - AKRON.
000500 DATE-WRITTEN.   AUGUST 11, 1986.
000800*REMARKS.
000900**************************************************************
001000*                                                            *
001100*D   TPOMISC         MISCELLANEOUS PURCHASING PROGRAM        *
001200*                                                            *
001300*D    THIS PROGRAM IS USED TO LOAD MISCELLANEOUS             *
001400*D    PURCHASING INFORMATION.                                *
001500*D                                                           *
001600*D    SUBPROGRAMS CALLED :                                   *
001700*D                                                           *
001800*D           1.  SBUYCODE  ---  BUYER CODE SUBPROGRAM        *
001900*D           2.  SFOBCODE  ---  FOB   CODE SUBPROGRAM        *
002000*D           3.  SCURCODE  ---  CURRENCY CODE SUBPROGRAM     *
002100*D           4.  SPAYTERM  ---  PAYMENT  TERM SUBPROGRAM     *
002200*D           5.  SUNMEAS   ---  UNIT OF MEASURES SUBPROGRAM  *
002300*D           6.  SFLLOWUP  ---  STND FOLLOWUP SUBPROGRAM     *
      *D           7.  SEDIQUES  ---  SET "EDI READY" SUBPROGRAM   *
      *D           8.  SEDITRAN  ---  SET TRANSPORT MODE AND       *
      *D                              TERMS OF DELIVERY            *
002400*D                                                           *
002500**************************************************************
002600*                                                            *
002700*   8/12/86  THIS PROGRAM NOW READS DCURCODE.PUB.CME         *
002800*            FOR THE LOADING OF THE AKRON CONTROLLED         *
002900*            CURRENCY CODES.                                 *
003000*                                     ANNETTE KRAUSS         *
003100*                                                            *
003200*    6/18/87  ADD SUBROUTINE SFLLOWUP -  THIS SUBROUTINE     *
003300*             WILL ALLOW THE USER TO SPECIFY THE DEFAULT     *
003400*             STANDARD INSTRUCTIONS FOR FOLLOWUPS.           *
003500**************************************************************
003600 ENVIRONMENT DIVISION.
003700 CONFIGURATION SECTION.
003800 SOURCE-COMPUTER.  IBM-AS400.
003900 OBJECT-COMPUTER.  IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
004000
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPLTSTUP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MVALIDUM-O
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
004300     SELECT DCURCODE-FILE
                  ASSIGN TO DATABASE-MCFPCSCUCD
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.
004400
004500 DATA DIVISION.
004600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                PIC X(2000).

       FD  MVALIDUM-O
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-O-REC.
           COPY DDS-MCRPCS0400  OF MCFLCS0401.
004700
004800 FD  DCURCODE-FILE
004900     LABEL RECORDS ARE OMITTED
005000     RECORD CONTAINS 14 CHARACTERS.
005100 01  DCURCODE-REC.
005200     05  DCURCODE-KEY           PIC X(2).
005400     05  DCURCODE-DESCRIPTION   PIC X(12).
005600
005700 WORKING-STORAGE SECTION.
005800
005900 77  EOF-SW                        PIC X(1)  VALUE "N".
006000 77  PASSED-SPOOL-PRT              PIC S9(2) COMP-4 VALUE 0.
006100
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X     VALUE SPACES.
           05  FILE-STATUS-2             PIC X     VALUE SPACES.
       01  COMMAND-AREA.
           05  OVERRIDE-ZPLTSTUP         PIC X(34) VALUE
               "OVRDSPF FILE(ZPLTSTUP) SHARE(*YES)".
           05  OVERRIDE-PARM2          PIC S9(10)V9(5) COMP-3 VALUE 34.
006200*************************************************************
006300*************************************************************
006400**                                                         **
006500**              D A T A    B A S E    A R E A              **
006600**                                                         **
006700*************************************************************
006800*************************************************************
006900
007000 01  BASE                       PIC X(10)  VALUE "  STORES;".
007100 01  PASSWORD                   PIC X(5)   VALUE "JADE;".
007200 01  DSET-NAME                  PIC X(16)  VALUE SPACES.
007300 COPY MVALIDUM   IN COPYLIB.
007400
007500 01  DSET-INFO.
007600     05  DSET-MVALIDUM          PIC X(16)  VALUE "MVALIDUM;".
007700     05  MVALIDUM-ARG           PIC X(2).
007800
007900 01  SEARCH-ITEMS.
008000     05  ALL-ITEMS             PIC X(2)  VALUE "@;".
008100
008200 COPY DBMODES    IN COPYLIB.
008300
008400 COPY DBSTAT     IN COPYLIB.
008500
008600 COPY VCOMAREA   IN COPYLIB.
008700
008800
008900 01  FORMFILE.
009000     05  FORM-FNAME                PIC X(8)  VALUE "FPLTSTUP".
009100     05  FILLER                    PIC X(1)  VALUE ".".
009200     05  FORM-GNAME.
009300         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009400         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009500     05  FILLER                    PIC X(19) VALUE SPACES.
009600
009700 COPY MULTLOCK   IN COPYLIB.
009800
009900 01  MESSAGE-BUFFER.
010000     05  MSG-TEXT                    PIC X(64)  VALUE SPACES.
010100     05  MSG-FLD                     PIC X(12)  VALUE SPACES.
010200     05  MSG-FLD-9 REDEFINES MSG-FLD
010300                                     PIC Z(11)9.
010500 01  MESSAGE-BUFLEN                  PIC S9(4)  COMP VALUE 76.
010600 01  MESSAGE-ACTLEN                  PIC S9(4)  COMP VALUE 76.
010700 01  FIELD-NUMBER                    PIC S9(4)  COMP VALUE 1.
011000*************************************************************
011100*************************************************************
011200**                                                         **
011300**                 TERMINAL I/O DATA AREA                  **
011400**                                                         **
011500*************************************************************
011600*************************************************************
011700
011800 01  MAIN-MENU-SCREEN.
011900     05  PAYMENT-TERMS             PIC X(1).
012000     05  BUYER-INFORMATION         PIC X(1).
012100     05  FOB-CODES                 PIC X(1).
012200     05  UNIT-OF-MEASURES          PIC X(1).
012300     05  CURRENCY-CODES            PIC X(1).
012400     05  STND-FLLOWUP              PIC X(1).
           05  EDI-QUES                  PIC X(1).
           05  TRANS-MODE                PIC X(1).
           05  CMD-LINE                  PIC X(79).
           05  MSG-LINE                  PIC X(79).
012500*************************************************************
012600*************************************************************
012700**                                                         **
012800**                 COMMUNICATIONS AREAS                    **
012900**                                                         **
013000*************************************************************
013100*************************************************************
015300 COPY TBLOWUP    IN COPYLIB.
015400
015500 COPY LANGUAGE   IN COPYLIB.
015600
       COPY CATREAD    IN COPYLIB.

       COPY DISPDATA   IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

015700*************************************************************
015800**#########################################################**
015900*************************************************************
016000**                                                         **
016100**          P R O C E D U R E    D I V I S I O N           **
016200**                                                         **
016300*************************************************************
016400**#########################################################**
016500*************************************************************
016600
016700 PROCEDURE DIVISION.
016800
016900 MAIN-PGM SECTION 01.
017000
017100 BEGIN-HERE.
017200     PERFORM 1-HSK  THRU 1-HSK-X.
017300     PERFORM 6-MAIN THRU 6-MAIN-X.
017400     PERFORM 2-EOJ  THRU 2-EOJ-X.
017500     GOBACK.
017600
017700 1-HSK.
017800     MOVE "TPOMISC" TO BU-PGM-NAME.
017900
           CALL "QCMDEXC" USING OVERRIDE-ZPLTSTUP, OVERRIDE-PARM2.
           OPEN I-O   DISPLAY-FILE, MVALIDUM-O.
021700     OPEN INPUT DCURCODE-FILE.
021800
021900     PERFORM 3-INITIAL-LOADS THRU 3-INITIAL-LOADS-X.
022000 1-HSK-X.
           EXIT.
022100
022200 2-EOJ.
           CLOSE MVALIDUM-O.
023900     CLOSE DCURCODE-FILE.
024000
024100 2-EOJ-X.
024200      EXIT.
024300
024400******************************************************
024500**                 BLOWUP ROUTINE                   **
024600******************************************************
024700
024800 2-BLOWUP.
024900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
025000         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
025100         BU-DISPLAY-AREA.
025200
025300******************************************************
025400**              INITIAL DATABASE LOADS              **
025500******************************************************
025600
025700 3-INITIAL-LOADS.
026700     PERFORM 321-READ-DCURCODE-FILE THRU 321-RDF-EXIT.
026800     PERFORM 32-LOAD-CURRENCY-SEG       THRU 32-LCS-EXIT.
027600
027700 3-INITIAL-LOADS-X.
027800     EXIT.
027900
028000 32-LOAD-CURRENCY-SEG.
028100     MOVE DCURCODE-KEY TO MVALIDUM-ARG.
           MOVE MVALIDUM-ARG TO VALIDUM OF MVALIDUM-O-REC.
           READ MVALIDUM-O INTO BUF-MVALIDUM.
           IF FILE-STATUS-1 = "2"
               MOVE SPACES               TO BUF-MVALIDUM
               MOVE DCURCODE-KEY         TO VALID-UM
               MOVE DCURCODE-DESCRIPTION TO VALID-CURRENCY-DESC
               WRITE MVALIDUM-O-REC FROM BUF-MVALIDUM
           ELSE
           IF FILE-STATUS = "00"
               IF DCURCODE-DESCRIPTION = VALID-CURRENCY-DESC
                   NEXT SENTENCE
               ELSE
                   MOVE DCURCODE-DESCRIPTION TO VALID-CURRENCY-DESC
                   REWRITE MVALIDUM-O-REC FROM BUF-MVALIDUM
           ELSE
               MOVE "READ MVALIDUM ERR 32-LOAD-CURRENCY-SEG"
                   TO BU-DISPLAY-MSG
               MOVE DCURCODE-KEY TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           IF FILE-STATUS NOT = "00"
               MOVE "W/RW MVALIDUM ERR 32-LOAD-CURRENCY-SEG"
                   TO BU-DISPLAY-MSG
               MOVE DCURCODE-KEY TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           PERFORM 321-READ-DCURCODE-FILE THRU 321-RDF-EXIT.
           IF EOF-SW = "N"
               GO TO 32-LOAD-CURRENCY-SEG.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO VALIDUM OF MVALIDUM-O-REC.
           START MVALIDUM-O KEY > VALIDUM OF MVALIDUM-O-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.

       32-LCS-EXIT.
           EXIT.

       321-READ-DCURCODE-FILE.
           READ DCURCODE-FILE AT END
              MOVE "Y" TO EOF-SW.

           IF DCURCODE-KEY = "**"
               GO TO 321-READ-DCURCODE-FILE.

034100 321-RDF-EXIT.
034200     EXIT.
038600
038700**************************************************
038800*                                                *
038900*                  6 - M A I N                   *
039000*                                                *
039100**************************************************
039200
039300 6-MAIN.
           MOVE SPACES   TO MAIN-MENU-SCREEN.
039400     MOVE "POMENU" TO VIEW-NFNAME.
042100
042200 6-MAIN-SHOW-FORM.
           MOVE MAIN-MENU-SCREEN TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC      TO MAIN-MENU-SCREEN.
042800
042900 6-MAIN-READ-FIELDS.
043600     IF VIEW-LASTKEY = 3
043700         GO TO 6-MAIN-X.
043800
044300     IF VIEW-LASTKEY = 1 OR
044400        VIEW-LASTKEY = 2 OR
044600        VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
044700        VIEW-LASTKEY = 6 OR
044800        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
044900*****    INVALID FUNCTION KEY    *****
045000         MOVE   9 TO LANG-SETNUM
045100         MOVE  10 TO LANG-MSGNUM
045200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO  MSG-LINE
               MOVE B"1" TO IND(99)
045400         GO TO 6-MAIN-SHOW-FORM.
045500
046800 6-GET-BUFFER.
047700     IF BUYER-INFORMATION = "X"
                CALL "SBUYRCDE" USING BASE, VIEW-COMAREA,
049100                   LANGUAGE-PARMS
047900     ELSE
048000     IF UNIT-OF-MEASURES = "X"
                CALL "SUNMEAS" USING BASE, VIEW-COMAREA,
049100                   LANGUAGE-PARMS
048200     ELSE
048300     IF CURRENCY-CODES = "X"
                CALL "SCURCODE" USING BASE, VIEW-COMAREA,
049100                   LANGUAGE-PARMS
048500     ELSE
048600     IF PAYMENT-TERMS = "X"
                CALL "SPAYTERM" USING BASE, VIEW-COMAREA,
049100                   LANGUAGE-PARMS
048800     ELSE
048900     IF FOB-CODES = "X"
049000          CALL "SFOBCODE" USING BASE, VIEW-COMAREA,
049100                   LANGUAGE-PARMS
049200     ELSE
049300     IF STND-FLLOWUP = "X"
049400          CALL "SFLLOWUP" USING BASE, VIEW-COMAREA,
049500                   LANGUAGE-PARMS
           ELSE
           IF EDI-QUES = "X"
                CALL "SEDIQUES" USING BASE, VIEW-COMAREA,
                         LANGUAGE-PARMS
           ELSE
           IF TRANS-MODE = "X"
                CALL "SEDITRAN" USING BASE, VIEW-COMAREA,
                         LANGUAGE-PARMS.
049600
049700     GO TO 6-MAIN.
049800
049900 6-MAIN-X.
050000     EXIT.
050100
       COPY DISPCALL IN COPYLIB.
050200*********************************************************
050300 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
052000 999-CATREAD-EXIT.
052100     EXIT.
