000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.  TPOPRNT.
000500 AUTHOR.      KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900******************************************************
001000*                                                    *
001100*     T P O P R N T                                  *
001200*   THIS SUB PROGRAM DOES THE ACTUAL PRINTING        *
001300*   OF A PURCHASE ORDER                              *
001400*                                                    *
001500******************************************************
001600*   N O T E    T H I S   S U B R O U T I N E   I S   *
001700*         C A L L E D    B Y :                       *
 01800*      1. TPOPRTSL                                   *
001900*      2. TRELEASE                                   *
002000*      3. TRELBATC                                   *
002100*      4. TPOPRTBT                                   *
002200*      5. TPURORD                                    *
002300*      6. TUDCDOCK                                   *
002400******************************************************
002500
      *C  09/25/1992      DAVE PLUM      REQUEST #6204
      *C  REVISED PARAGRAPHS 661-CHECK-FOR-ITEMS AND
      *C  62-CHECK-FOR-ITEMS TO AVOID EXECUTING STATEMENTS
      *C  SUCH AS, "IF PO-ITEM (SUB1) ...", WHEN SUB1 IS
      *C  GREATER THAN 15.  THE PO REPRINT FUNCTION ABENDED
      *C  WHENEVER A USER SPECIFIED EXACTLY 15 SPECIFIC PO
      *C  ITEMS TO BE PRINTED, AND AN IF STATEMENT LIKE THE
      *C  ONE ABOVE WAS EXECUTED WITH SUB1 = 16.
      *C
      *C 03/30/93         JEFF BUNGO    REQUEST #6282
      *C  UPDATED THE PO PRINT TO PRINT THE GAS ACCOUNTING
      *C  STRUCTURE IF THE PACD SWITCH IS SET TO "N".
      *C
      *C SEPT. 1994  JIM COFFMAN
      *C   ADDED CODE TO PRINT CHAT NUMBER AND ITS MANUFACTURER AND
      *C   TRADE NAME IF A CHAT NUMBER IS REFERENCED ON THE PURCHASE
      *C   ORDER ITEM.
      *C
      *C 12/01/1995  CA YODER   REQUEST #95-034
      *C   ADDED LOGIC TO PRINT THE BUYER NAME AND DATE AT THE BOTTOM
      *C   OF THE PO FOR AUSTRALIA.  THESE TWO LINES AREN'T WRITTEN
      *C   TO THE TEMPORARY FILE (PRNTWORK); IT WAS EASIER TO WRITE
      *C   THE LINES WHEN THE PO IS BEING PRINTED.  IN ORDER TO
      *C   UTILIZE THIS FUNCTION, THE FIELD "MPLTINFO-PRNT-PO-FOOTER"
      *C   IN MPLTINFO (KEY=POPT) MUST BE SET TO "Y".
      *C
      *C 03/20/1996  JE COFFMAN VERBAL REQUEST FROM NANCY PRITCHETT
      *C   DUE TO A CHANGE IN THE WAY THAT THE POST OFFICE HANDLES
      *C   GOODYEAR, IT BECAME APPARENT THAT THEY NEEDED TO HAVE A
      *C   P.O. BOX ESTABLISHED. SINCE THEY COULD NOT GET ALL OF THE
      *C   NECESSARY ADDRESS INFORMATION PRINTED, WE DECIDED TO USE
      *C   THE ALTERNATE ADDRESS TO HANDLE THE DIFFERENCES. THEIR
      *C   PO HEADER INFORMATION IS NOW IN THE NORMAL ADDRESS AREA
      *C   AND THEIR SHIP TO ADDRESS IS IN THE ALTERNATE ADDRESS.
      *C
      *C 06/06/1996    JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C 11/06/1996    CA YODER    REQ #96-005
      *C   ADDED THE WORDS "CANCELLED" OR "MODIFIED" TO THE PO
      *C   IN THE MIDDLE OF THE PAGE (WHEN AN ORDER IS CANCELLED
      *C   OR MODIFIED).  ALSO REMOVED THE "CONFIRMING ORDER"
      *C   LITERAL FROM THESE POS.  THESE CHANGES ALLOW FOR
      *C   BETTER COMMUNCIATIONS TO THE VENDOR.
      *C
      *C 04/02/1997    CA YODER    REQ #6651
      *C   ADDED A CHECK TO SEE IF PLANT WANTS PURCHASE ORDERS TO
      *C   ALWAYS PRINT WITHOUT SPECIAL PRINT CHARACTERS.  IF SO,
      *C   THIS PROGRAM WILL CALL "TPOPRNT2" INSTEAD AND THEN
      *C   RETURN TO THE CALLING PROGRAM.
      *C
      *C 01/19/1998    CA YODER
      *C   TOOK OUT CALLS TO CLPAUSE2 SINCE IT WAS CAUSING A VERY
      *C   LONG DELAY TO PRINT LARGER PURCHASE ORDERS.
      *C
      *C 06/01/1998    CA YODER
      *C   ADDED COMMAND TO ATTACH Y2K VERBAGE TO FAXSTAR ORDERS
      *C   FOR LAWTON.
      *C
      *C 01/11/2001    CA YODER     (REQUEST:  K. ANDERSON)
      *C   REMOVED Y2K FAXSTAR LOGIC FOR LAWTON.
      *C
      *C 01/18/2001    CA YODER     (REQUEST:  K. ANDERSON)
      *C   MOVED FAX NUMBER FROM BUYER LINE TO THE PREVIOUS
      *C   LINE FOR LAWTON.
      *C
      *C 03/21/02  CA YODER        (NAPANEE REQUEST)
      *C   ADDED LOGIC TO PRINT COMMENTS FROM MCFPCS7000 ON
      *C   PURCHASE ORDER, IF THE FILE EXISTS.
      *C
      *C 04/04/2003    GEISER
      *C   ADDED LOGIC TO PRINT ON SPECIAL FORM FOR SOCIAL CIRCLE.
      *C   THIS IS TO ACCOMMODATE MULITPLE PLANTS/BUYERS USING THE
      *C   SAME FAX*STAR SYSTEM.
      *C
      *C 05/30/2003    GEISER
      *C   ADDED LOGIC TO PRINT TERMS AND CONDITIONS PAGE FOR
      *C   SPARTANBURG AND SOCIAL CIRCLE USING FAX*STAR.
      *C
      *C 04/27/2004    CA YODER
      *C   ADDED LOGIC TO PRINT TERMS AND CONDITIONS PAGE FOR
      *C   LAWTON.
      *C
      *C 11/01/2004    CA YODER   REQUEST #2004-31751
      *C   CHANGED LAWTON'S TERMS AND CONDITIONS PAGE FROM "T&CS"
      *C   TO "T&C4F".
      *C
025400
025500
025600 ENVIRONMENT DIVISION.
025700 CONFIGURATION SECTION.
025800 SOURCE-COMPUTER.  HP-3000.
025900 OBJECT-COMPUTER.  HP-3000.
026000
026100 SPECIAL-NAMES. C01 IS NEWPAGE
026300       LOCAL-DATA IS LOCAL-DATA-AREA.

026400 INPUT-OUTPUT SECTION.
026500 FILE-CONTROL.
026600     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
026700     SELECT PRNT-WORK-FILE ASSIGN TO DISK-PRNTWORK
                  ORGANIZATION IS SEQUENTIAL
                  ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.
             SELECT DCHATNO
                  ASSIGN TO DATABASE-MCFLCS5501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM-I
                  ASSIGN TO DATABASE-MCFLCS1002
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MBUYER-I
                  ASSIGN TO DATABASE-MCFLCS0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MVALIDUM-I
                  ASSIGN TO DATABASE-MCFLCS0401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DPODATAITM-I
                  ASSIGN TO DATABASE-MCFLCS1101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
026800
026900 DATA DIVISION.
027000 FILE SECTION.
027100
027200 FD  ONLINE-PRT
027300     LABEL RECORDS ARE OMITTED
027400     RECORD CONTAINS 132 CHARACTERS
027500     DATA RECORD IS PRINT-RCD.
027600 01  PRINT-RCD.
           05  FILLER            PIC X(6).
027700     05  PRINT-LINE        PIC X(126).
027800
027900 FD  PRNT-WORK-FILE
028000     LABEL RECORDS ARE OMITTED
028100     RECORD CONTAINS 133 CHARACTERS
028200     DATA RECORD IS PRNT-WORK-RCD.
028300 01  PRNT-WORK-RCD.
028400     05  CTL              PIC 9.
028500     05  PRNT-WORK-LINE   PIC X(132).
028600
       FD  DCHATNO
           LABEL RECORDS ARE STANDARD.
       01  DCHATNO-REC.
           COPY DDS-MCRPCS5500 OF MCFLCS5501.

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1002.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0601.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0401.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

       FD  DPODATAITM-I
           LABEL RECORDS ARE STANDARD.
       01  DPODATAITM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1101.

       FD  DCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1901.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0701.

028700 WORKING-STORAGE SECTION.
028800 77  LINE-ADV              PIC 9(4)    VALUE ZEROS.
028900 77  TERRITORY-SAVE        PIC X(4)   VALUE SPACES.
029100 77  SAVE-VENDOR-CODE      PIC X(10)  VALUE SPACES.
029200 77  USA-PO-HEADING        PIC X(18)  VALUE "PURCHASE ORDER    ".
029300 77  MODIFIED-HEADING      PIC X(18)  VALUE "MODIFIED ORDER    ".
029400 77  CANCELLED-HEADING     PIC X(18)  VALUE "CANCELLED ORDER   ".
029500 77  CAN-PO-HEADING        PIC X(18)  VALUE "P.O. DOCUMENT     ".
029600 77  RELEASE-HEADING       PIC X(18)  VALUE "SHIPPING RELEASE  ".
029700 77  INTERNAL-HEADING      PIC X(18)  VALUE "INTERNAL ORDER    ".
       77  GAS-STRUCTURE-SW      PIC X(1)   VALUE "N".
       77  SAVE-CHAT-SW          PIC X(1)   VALUE "N".
       77  SAVE-PO-SPECIAL       PIC 9(2).
       77  SAVE-DOLLAR-AMOUNT    PIC 9(6).
       77  PRINT-DCOMPL-SW       PIC X      VALUE "N".
029800
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
029900
030000**********************
030100*                    *
030200*  S W I T C H E S   *
030300*                    *
030400**********************
030500
030600 01  SWITCH-AREA.
030700     05  END-PRT-SW              PIC X     VALUE SPACES.
030800     05  DATAITM-READY-SW        PIC X     VALUE SPACES.
031000     05  PRINT-ITEM-HDR-SW       PIC X     VALUE SPACES.
031100     05  ITEM-JUST-PRINTED-SW    PIC X     VALUE SPACES.
031200     05  PRINT-SPECIFIC-ITEMS-SW PIC X     VALUE SPACES.
031300     05  PRINT-TAX-CODES-ITEM-SW PIC X     VALUE SPACES.
031400     05  FOREIGN-DECIMAL-SW      PIC X     VALUE SPACES.
031500     05  SW-VENDOR-ADDR-SW       PIC X     VALUE SPACES.
031600     05  Z-BILL-STATUS           PIC X     VALUE SPACE.
031700         88  PO-IS-Z-BILL                  VALUE "1".
031800     05  MPE-SPOOLED-PRINTER-SW  PIC X     VALUE SPACES.
031900         88  PO-PRT-MPE-SPOOLED            VALUE "Y".
032000         88  PO-PRT-NOT-MPE-SPOOLED        VALUE "N".
           05  SAVE-PO-HP-PRINTER-SW   PIC X     VALUE SPACES.
           05  PRINT-PO-FOOTER-SW      PIC X     VALUE "N".
032100
032200
032300 01  PO-ARRAY.
032400     05  PO-ARR OCCURS 7 TIMES INDEXED BY PO-INDEX.
032500         10  PO-CHAR              PIC X.
032600
032700 01  SUB-AREA  COMP-4.
032800     05  SUB                      PIC S99     VALUE ZEROS.
032900     05  SUB1                     PIC S9(4)   VALUE ZEROS.
033000     05  SUB2                     PIC S9(4)   VALUE ZEROS.
033100     05  VEN-SUB                  PIC S99     VALUE ZEROS.
033200     05  I-SUB                    PIC S9(2)   VALUE ZERO.
033300     05  J-SUB                    PIC S9(2)   VALUE ZERO.
033400
033500 01  TEMP-ITEM                    PIC X(4)    VALUE ZERO.
033600
033700 01  COMPANY-SAVE.
033800     05  COMPANY-SAVE-1-DIGIT     PIC X       VALUE SPACES.
033900     05  FILLER                   PIC X(2)    VALUE SPACES.
034000
034100 01  WORK-AREA.
034200     05  PAGE-CTR                 PIC 9(3) VALUE ZEROS.
034300     05  LINE-CTR                 PIC 9(2) VALUE ZEROS.
034400     05  SAVE-ITEM-TAX-CODE       PIC X(2) VALUE SPACES.
034500     05  SAVE-VENDOR-ADDRESS      PIC X(34) VALUE SPACES.
034600     05  WORK-QTY-ORD             PIC S9(8)V9(4) VALUE ZEROS.
034700     05  WORK-QTY-ORD-X  REDEFINES  WORK-QTY-ORD.
034800         10  WORK-QTY-ORD-W       PIC 9(8).
034900         10  WORK-QTY-ORD-D       PIC 9(4).
035000
035100     05  BUILD-COMMENT-NO.
035200         10  BUILD-COM-PREFIX     PIC X     VALUE "C".
035300         10  BUILD-COM-NO         PIC X(3)  VALUE SPACES.
035400
035500     05  BUILD-TAX-CODE.
035600         10  FILLER               PIC X(2)  VALUE "T ".
035700         10  BUILD-TAX-NO         PIC X(2)  VALUE SPACES.
035800
035900     05  BUILD-TM-DISCOUNT-KEY.
036000         10  FILLER                   PIC X(3)  VALUE "TMP".
036100         10  BUILD-TM-DISCOUNT-VALUE  PIC X     VALUE SPACES.
036200
036300     05  BUILD-TM-DUE-DATE-KEY.
036400         10  FILLER                   PIC X(3)  VALUE "TMD".
036500         10  BUILD-TM-DATE-VALUE      PIC X     VALUE SPACES.
036600
036700 01  REFORM-PO-NUMBER.
036800     05  R-PO-NUMBER         PIC X(7).
036900     05  R-HYPEN             PIC X.
037000     05  R-PO-REL            PIC X(3).
037100 01  REFORM-PO-NUMBER-TABLE  REDEFINES  REFORM-PO-NUMBER.
037200     05  PO-NUMBER-CHAR      PIC X  OCCURS 11 TIMES.
037300
037400 01  NO-PAY-VENDOR-ON-FILE-MSG.
037500     05  FILLER        PIC X(15) VALUE "** PAYTO VENDOR".
037600     05  FILLER        PIC X(15) VALUE " NOT ON FILE **".
037700
       01  SAVE-FAX.
           05  SAVE-FAX-FIRST-CHAR    PIC X(1)  VALUE SPACES.
           05  SAVE-FAX-NO            PIC X(23) VALUE SPACES.
       01  PRT-FAX-END                PIC X(5)  VALUE "**END".
       01  PRT-FAX-FORM               PIC X(9)  VALUE "**FORM PO".
       01  PRT-FAX-FORM-SS            PIC X(12) VALUE "**FORM PORSS".
       01  REF-LINE.
           05  PRT-REF-LIT            PIC X(9)  VALUE "**(REF) P".
           05  PRT-PO-REF             PIC X(10) VALUE SPACES.
       01  PRT-FAX-Y2K                PIC X(14) VALUE "**(ATTACH) Y2K".
       01  PRT-FAX-TC                 PIC X(14) VALUE "**(ATTACH) T&C".
      *------ CHANGE LAWTON'S T&C PAGE FROM T&CS TO T&C4F.
       01  PRT-FAX-TC2              PIC X(16) VALUE "**(ATTACH) T&C4F".

037800 COPY TDATECHK IN COPYLIB.
037900
       COPY CCRTFILE IN COPYLIB.

       01  CCRQDESC-PARMS.
           05  CCRQDESC-CODE          PIC X(7).
           05  CCRQDESC-LINES.
               10  CCRQDESC-LINE  OCCURS 10 TIMES
                                      PIC X(80).
038000
038100**********************************************
038200*                                            *
038300*   JCW PARAMETERS                           *
038400*                                            *
038500**********************************************
038600
038700 COPY JCWAREA IN COPYLIB.
039100
039200 01  PRICE-CAPABILITY-SW      PIC X      VALUE SPACES.
039300     88  PRICE-ALLOWED                  VALUE "Y".
039400
039500**************************************************************
039600**
039700**        DATABASE I/O WORK AREA
039800**
039900**************************************************************
040000
       COPY DCHATNO  IN COPYLIB.

040100 COPY DPORECD  IN COPYLIB.
040200
040300 COPY DPOITEM  IN COPYLIB.
040400
       COPY MBUYER   IN COPYLIB.

040500 COPY MSTORERM IN COPYLIB.
040600
040700 COPY MPLTINFO IN COPYLIB.
040800
040900 COPY DVENDOR  IN COPYLIB.
041000
041100 COPY MVALIDUM IN COPYLIB.
041200
041300 COPY DPODATA  IN COPYLIB.
041400
041500 COPY DCOMMENT IN COPYLIB.
041600
041700
041800*********************
041900*                   *
042000*   DATA SET NAMES  *
042100*                   *
042200*********************
042300
042400 01  DSET-NAMES.
042500     05  DSET-NAME              PIC X(16)  VALUE SPACES.
042600     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
042700     05  DSET-DVENDOR           PIC X(16)  VALUE "DVENDOR;".
042800     05  DSET-DPOITEM           PIC X(16)  VALUE "DPOITEM;".
042900     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
043000     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
043100     05  DSET-DCOMMENT          PIC X(16)  VALUE "DCOMMENT;".
043200     05  DSET-MVALIDUM          PIC X(16)  VALUE "MVALIDUM;".
043300     05  DSET-DPODATAITM        PIC X(16)  VALUE "DPODATAITM;".
           05  DSET-MBUYER            PIC X(16)  VALUE "MBUYER;".
043400
043500 COPY DBSTAT IN COPYLIB.
043600
043900 01 ITEMS-LISTING.
044000     05  ALL-ITEMS              PIC XX    VALUE "@;".
044100     05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
044200     05  VEN-SEARCH             PIC X(10) VALUE "VEN-CODE;".
044300     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
044400     05  COMMENT-SEARCH  PIC X(16) VALUE "MCOM-COMMENT-NO;".
044500
044600 01 ARG-VALUES.
044700     05  CODE-ARG               PIC X(8)  VALUE SPACES.
044800     05  PLT-ARG                PIC X(4)  VALUE SPACES.
044900     05  VEN-ARG                PIC X(10) VALUE SPACES.
045000     05  PO-ARG                 PIC X(14) VALUE SPACES.
045100     05  COMMENT-ARG            PIC X(4)  VALUE SPACES.
045200     05  UM-ARG                 PIC X(2)  VALUE SPACES.
045300
045400
       COPY OVRPFDATA IN COPYLIB.
045600
       COPY CCHKOBJ IN COPYLIB.
045700
045800**************************************************************
045900**
046000**            P.O. HEADINGS AREA
046100**
046200**************************************************************
046300
046400 01  PRINT-HEADER-AREA.
046500     05  PRINT-HDR1.
046600         10  FILLER  PIC X(19) VALUE SPACES.
046700         10  EXPAND-1  PIC X(8)  VALUE SPACES.
046800         10  PO-HEAD PIC X(18) VALUE SPACES.
046900         10  NORMAL-1  PIC X(8)  VALUE SPACES.
047000         10  FILLER  PIC X(1)  VALUE SPACES.
047100         10  PRT-PAGE  PIC X(7)  VALUE "   PAGE".
047200         10  FILLER  PIC X     VALUE SPACES.
047300         10  PG-FROM PIC ZZ9   VALUE ZEROS.
047400         10  FILLER  PIC X     VALUE SPACES.
047500         10  PRT-TO  PIC X(2)  VALUE "OF".
047600         10  FILLER  PIC X     VALUE SPACES.
047700         10  PG-TO   PIC ZZ9   VALUE ZEROS.
047800
047900     05  PRINT-HDR2.
048000         10  FILLER       PIC X(19) VALUE SPACES.
048100         10  HDR2-DATA    PIC X(50) VALUE SPACES.
048200
048300     05  PRINT-HDR3.
048400         10  FILLER       PIC X(19) VALUE SPACES.
048500         10  HDR3-DATA    PIC X(50) VALUE SPACES.
048600
048700     05  PRINT-HDR4.
048800         10  FILLER       PIC X(19) VALUE SPACES.
048900         10  HDR4-DATA    PIC X(50) VALUE SPACES.
049000
049100     05  PRINT-HDR5.
049200         10  FILLER       PIC X(19) VALUE SPACES.
049300         10  HDR5-DATA    PIC X(50) VALUE SPACES.
049400
049500     05  PRINT-ITEM-HDR.
049600         10  PRT-QTY-LIT PIC X(18) VALUE "ITEM      QUANTITY".
049700         10  FILLER  PIC X(30) VALUE SPACES.
049800         10  PRT-UNIT-PRICE  PIC X(10) VALUE "UNIT PRICE".
049900         10  FILLER  PIC X(2)  VALUE SPACES.
050000         10  CURRENCY-LIT-OUT  PIC X(12) VALUE SPACES.
050100
      *--------- LINE IN MIDDLE OF PO TO TELL IF ORDER IS MODIFIED
      *--------- OR CANCELLED.
           05  MOD-CANC-LINE.
               10  FILLER                 PIC X(15)  VALUE ALL "*".
               10  FILLER                 PIC X(3)   VALUE SPACES.
               10  EXP-MOD-CANC           PIC X(8).
               10  MOD-CANC-LITERAL       PIC X(18).
               10  NORM-MOD-CANC          PIC X(8).
               10  FILLER                 PIC X(15)  VALUE ALL "*".

050200     05  PRINT-HDR-LAST.
050300         10  FILLER  PIC X(4)  VALUE SPACES.
050400         10  PRT-PART-LIT PIC X(23)
050500                              VALUE "GOODYEAR STOREROOM I.D.".
050600         10  FILLER  PIC X(1)  VALUE SPACES.
050700         10  EXPAND-2  PIC X(8)  VALUE SPACES.
050800         10  PRINT-CORP-CODE  PIC X(8) VALUE SPACES.
050900         10  NORMAL-2  PIC X(8)  VALUE SPACES.
051000         10  FILLER  PIC X(5)  VALUE SPACES.
051100
051200 01  PRINT-WORKAREA.
051300     05  PRTWK-AREA            PIC X(132).
051400     05  PRTWK-FIELD REDEFINES PRTWK-AREA.
051500         10  PRTWK-ITEM-NO     PIC Z999.
051600         10  PRTWK-QTY         PIC ZZ,ZZZ,ZZ9.9999.
051700         10  PRTWK-QTY-FOR-DEC REDEFINES PRTWK-QTY
051800                               PIC Z(10).9(4).
051900         10  PRTWK-QTY-FOR-WHL REDEFINES PRTWK-QTY
052000                               PIC Z(14)9.
052100         10  PRTWK-QTY-SPACE REDEFINES PRTWK-QTY
052200                               PIC X(15).
052300         10  FILLER            PIC X.
052400         10  PRTWK-QTY-UM      PIC X(12).
052500         10  FILLER            PIC X(16).
052600         10  PRTWK-PRICE       PIC $(12).9999.
052700         10  PRTWK-PRICE-SPACE REDEFINES PRTWK-PRICE
052800                               PIC X(17).
052900         10  PRTWK-ZERO-CHECK REDEFINES PRTWK-PRICE.
053000             15  FILLER     PIC X(15).
053100             15  LAST-TWO-POSTIONS.
053200                 20  THIRD-DEC-PRICE-POS      PIC X.
053300                 20  FOURTH-DEC-PRICE-POS     PIC X.
053400         10  FILLER            PIC X.
053500         10  PRTWK-PRICE-UM    PIC X(12).
053600         10  FILLER            PIC X(54).
053700
053800     05  PRTWK-DESC REDEFINES PRTWK-AREA.
053900         10  FILLER            PIC X(20).
054000         10  PRTWK-FUNC1       PIC X(8).
054100         10  PRTWK-DESC-LINE.
054200             15  FILLER        PIC X(30).
054300             15  PRTWK-VALUE-LIT  PIC X(21).
054400             15  PRTWK-ITEM-VALUE PIC $(11)9.
054500             15  PRTWK-ITEM-VALUE-SPACE  REDEFINES
054600                 PRTWK-ITEM-VALUE   PIC X(12).
054700             15  FILLER        PIC X(27).
054800         10  PRTWK-DESC-MANUF-LINE REDEFINES PRTWK-DESC-LINE.
054900             15  PRTWK-MAN-NAME  PIC X(26).
055000             15  FILLER          PIC X.
055100             15  PRTWK-PART-DESC PIC X(4).
055200             15  PRTWK-PART-NO   PIC X(20).
055300             15  FILLER          PIC X(39).
055400         10  PRTWK-FUNC2       PIC X(8).
055500         10  FILLER            PIC X(6).
055600

055700     05  PRTWK-STD-INST-LINE  REDEFINES PRTWK-AREA.
055800         10  FILLER            PIC X(4).
055900         10  PRTWK-STD-INST    PIC X(88).
               10  PRTWK-STD-INST-C REDEFINES PRTWK-STD-INST.
                   15  PRTWK-STD-INST-COMP-START  PIC X(8).
                   15  PRTWK-STD-INST-COMP        PIC X(72).
                   15  PRTWK-STD-INST-COMP-END    PIC X(8).
               10  PRTWK-STD-INST-E REDEFINES PRTWK-STD-INST.
                   15  PRTWK-STD-INST-EXP-START   PIC X(8).
                   15  PRTWK-STD-INST-EXP         PIC X(40).
                   15  PRTWK-STD-INST-EXP-END     PIC X(8).
                   15  FILLER                     PIC X(32).
056000         10  FILLER            PIC X(40).
056100
056200     05  PRTWK-TAX-MSG   REDEFINES PRTWK-AREA.
056300         10  FILLER            PIC X(3).
056400         10  PRTWK-TAX-DESC.
                   15  PRTWK-TAX-DESC-EXP-START  PIC X(8).
                   15  PRTWK-TAX-DESC-EXP        PIC X(40).
                   15  PRTWK-TAX-DESC-EXP-END    PIC X(8).
                   15  FILLER                    PIC X(14).
056500         10  FILLER            PIC X(59).
056600
056700
056800     05  P-HEAD1 REDEFINES PRTWK-AREA.
056900         10  FILLER            PIC X(2).
057000         10  P-PO-DATE-AREA    PIC X(23).
057100         10  FILLER            PIC X(107).
057200
057300     05  P-HEAD2 REDEFINES PRTWK-AREA.
057400         10  FILLER            PIC X(4).
057500         10  P-REQ             PIC X(12).
057600         10  FILLER            PIC X(3).
057700         10  P-PLT             PIC X(4).
057800         10  FILLER            PIC X(2).
057900         10  P-BLDG            PIC X(4).
058000         10  FILLER            PIC X(2).
058100         10  P-REC-DEPT        PIC X(6).
058200         10  FILLER            PIC X(12).
058300         10  P-EXP-PRT         PIC X(8).
058400         10  PRINT-PO-NUMBER   PIC X(11).
058500         10  P-REG-PRT         PIC X(8).
058600         10  FILLER            PIC X(56).
058700
058800     05  P-HEAD3 REDEFINES PRTWK-AREA.
058900         10  FILLER            PIC X.
059000         10  P-SHIP-HDR-1      PIC X(35).
059100         10  FILLER            PIC X(9).
059200         10  P-SHIP-DATE       PIC X(8).
059300         10  FILLER            PIC X(79).
059400
059500     05  P-HEAD4 REDEFINES PRTWK-AREA.
059600         10  FILLER            PIC X.
059700         10  P-SHIP-HDR-2      PIC X(35).
059800         10  FILLER            PIC X(96).
059900
060000     05  P-HEAD5 REDEFINES PRTWK-AREA.
060100         10  FILLER            PIC X.
060200         10  P-SHIP-HDR-3      PIC X(29).
060300         10  P-REC-DEPT-2      PIC X(6).
060400         10  FILLER            PIC X(7).
060500         10  P-FOB             PIC X(20).
060600         10  FILLER            PIC X(69).
060700
060800     05  P-HEAD6 REDEFINES PRTWK-AREA.
060900         10  FILLER            PIC X.
061000         10  P-SHIP-HDR-4      PIC X(35).
061100         10  FILLER            PIC X(96).
061200
061300     05  P-HEAD7 REDEFINES PRTWK-AREA.
061400         10  FILLER            PIC X.
061500         10  P-SHIP-HDR-5      PIC X(35).
061600         10  FILLER            PIC X(7).
061700         10  P-VIA             PIC X(20).
061800         10  FILLER            PIC X(69).
061900
062000     05  P-HEAD8 REDEFINES PRTWK-AREA.
062100         10  FILLER            PIC X(43).
062200         10  P-TERMS-PC        PIC X(5).
062300         10  P-TERMS-DD        PIC X(18).
062400         10  FILLER            PIC X(66).
062500
062600     05  P-HEAD9 REDEFINES PRTWK-AREA.
062700         10  P-TERR-NO         PIC X(4).
062800         10  FILLER            PIC X.
062900         10  P-CO              PIC X(3).
063000         10  FILLER            PIC X.
063100         10  P-PRIME           PIC X(3).
063200         10  FILLER            PIC X.
063300         10  P-SUB             PIC X(3).
063400         10  FILLER            PIC X.
063500         10  P-SUB-DET         PIC X(4).
063600         10  FILLER            PIC X.
063700         10  P-ADDL-DATA       PIC X(6).
063800         10  FILLER            PIC X(2).
063900         10  P-BUDGT-NO        PIC X(12).
064000         10  FILLER            PIC X(1).
064100         10  P-BUDGT-AMT       PIC Z(10)9.
064200         10  FILLER            PIC X(09).
064300         10  P-VENDOR-CD       PIC X(7).
064400         10  FILLER            PIC X.
064500         10  P-ORD-VEND        PIC X(3).
064600         10  FILLER            PIC X(58).
064700
064800     05  P-HEAD10 REDEFINES PRTWK-AREA.
064900         10  FILLER            PIC X(42).
065000         10  P-BUYER           PIC X(15).
065100         10  FILLER            PIC X(2).
065200         10  P-TYPIST          PIC X(3).
065300         10  FILLER            PIC X(6).
065400         10  P-REPRINT-FLAG    PIC X.
065500         10  FILLER            PIC X(63).
065700
064800     05  P-HEAD10A REDEFINES PRTWK-AREA.
064900         10  FILLER            PIC X(38).
               10  P-COMPRESS-10A    PIC X(8).
065000         10  P-BUYERA          PIC X(15).
               10  P-PAREN1A         PIC X.
               10  P-BUYER-PHNUMA    PIC X(18).
               10  P-PAREN2A         PIC X.
065100         10  FILLER            PIC X(2).
065200         10  P-TYPISTA         PIC X(3).
               10  P-NORMAL-10A      PIC X(8).
065300         10  FILLER            PIC X(6).
065400         10  P-REPRINT-FLAGA   PIC X.
065500         10  FILLER            PIC X(31).
065700
065800 01  BUILD-VENDOR-PRINT.
065900     05  VEN-WRKAREA OCCURS 9 TIMES.
066000         10  FILLER            PIC X.
066100         10  ORDFRM-VEN-INFO   PIC X(34).
               10  FILLER            PIC X.
066900         10  PAYTO-VEN-INFO    PIC X(34).
067000 01  PRINT-SAVE-AREA REDEFINES BUILD-VENDOR-PRINT.
067100     05  PRNT-LINE1-SAVE       PIC X(80).
067200     05  BUYER-TYP-SAVE        PIC X(132).
067300     05  VEND-NAME-SAVE        PIC X(36).
067400     05  SAVE-PRNT-WORK-RCD    PIC X(133).
067500     05  FILLER                PIC X(301).
067600
       01  CHAT-INFO-LINE.
           05  FILLER                   PIC X(5)   VALUE SPACES.
           05  PRT-CHAT-HDR             PIC X(5)   VALUE "CHAT:".
           05  FILLER                   PIC X(01)  VALUE SPACES.
           05  PRT-CHATNO               PIC X(6)   VALUE SPACES.
           05  FILLER                   PIC X(1)   VALUE SPACES.
           05  PRT-CHAT-MFR             PIC X(26)  VALUE SPACES.
           05  FILLER                   PIC X(1)   VALUE SPACES.
           05  PRT-CHAT-TRADE           PIC X(79)  VALUE SPACES.
           05  FILLER                   PIC X(7)   VALUE SPACES.

067700 01  ITEM-ACCTG-DATA-LINE.
067800     05  FILLER                   PIC X(5)  VALUE SPACES.
067900     05  PRT-CLASS-LIT            PIC X(6)  VALUE "CLASS ".
068000     05  PRT-SUB-ITM              PIC X(3)  VALUE SPACES.
068100     05  FILLER                   PIC X     VALUE SPACES.
068200     05  PRT-DEPT-LIT             PIC X(6)  VALUE "DEPT. ".
068300     05  PRT-SUBD-ITM             PIC X(4)  VALUE SPACES.
068400     05  FILLER                   PIC X     VALUE SPACES.
068500     05  PRT-EXP-LIT              PIC X(12) VALUE "EXPENSE/NW".
068600     05  PRT-ADDTL-DATA-ITM       PIC X(6)  VALUE SPACES.
068700
       01  ITEM-ACCTG-DATA-LINE-L.
            05  FILLER                  PIC X(5)  VALUE SPACES.
            05  PRT-CO-LIT-L            PIC X(3)  VALUE "CO ".
            05  PRT-CO-ITM-L            PIC X(3)  VALUE SPACES.
            05  FILLER                  PIC X(1)  VALUE SPACES.
            05  PRT-PRM-LIT-L           PIC X(4)  VALUE "PRM ".
            05  PRT-PRM-ITM-L           PIC X(3)  VALUE SPACES.
            05  FILLER                  PIC X(1)  VALUE SPACES.
            05  PRT-CLASS-LIT-L         PIC X(6)  VALUE "CLASS ".
            05  PRT-SUB-ITM-L           PIC X(3)  VALUE SPACES.
            05  FILLER                  PIC X(1)  VALUE SPACES.
            05  PRT-DEPT-LIT-L          PIC X(6)  VALUE "DEPT  ".
            05  PRT-SUBD-ITM-L          PIC X(4)  VALUE SPACES.
            05  FILLER                  PIC X(1)  VALUE SPACES.
            05  PRT-EXP-LIT-L           PIC X(8)  VALUE "NW/A.D. ".
            05  PRT-ADDTL-DATA-ITM-L    PIC X(6)  VALUE SPACES.

068800 01  BUILD-ADDL-INFO-LINE.
068900     05  FILLER                PIC X(4)    VALUE SPACES.
069000     05  P-ADDL-INFO           PIC X(16)   VALUE SPACES.
069100     05  FILLER                PIC X(8)    VALUE SPACES.
069200     05  P-FOR-DEPT            PIC X(6)    VALUE SPACES.
069300
      *
      * FIELDS USED BY 920-FIND-POSITION PARAGRAPH
      *
       01  TOTAL-LENGTH                  PIC S9(3) VALUE 34 BINARY.
       01  FIND-POSITION.
           05  CHAR-POS OCCURS 34 TIMES  PIC X.

       01  PRINT-POSITION                PIC S9(3) BINARY.

      *
      * SAVE FIELDS USED IN PRINTING VENDOR ADDRESS
      *
       01  SAVE-ZIP-LOC-FLAG             PIC X.
           88  SAVE-ZIP-BEFORE-CITY    VALUE "1".
           88  SAVE-ZIP-AFTER-COUNTRY  VALUE "2".
       01  SAVE-ZIP                      PIC X(09).
       01  SAVE-STATE-CODE               PIC X(02).
       01  SAVE-PROV-CODE                PIC X(04).
      *

070500 01  UNIT-VALUE-LIT            PIC X(20)
070600                                  VALUE "ESTIMATED UNIT VALUE".
070700 01  CONFIRMING-ORDER-LIT.
070800     05  FILLER      PIC X(11) VALUE "*********  ".
070900     05  EXPAND-3  PIC X(8)  VALUE SPACES.
071000     05  PRT-CONFIRM-LIT PIC X(20) VALUE "CONFIRMING  ORDER   ".
071100     05  NORMAL-3      PIC X(8)  VALUE SPACES.
071200     05  FILLER      PIC X(12) VALUE "  **********".
071300     05  FILLER      PIC X(65) VALUE SPACES.
071400
071500 01  CONFIRMING-ORDER-LIT2.
071600     05  FILLER      PIC X(11) VALUE "*********  ".
071700     05  CONFIRMING-VERB-OUT  PIC X(34).
071800     05  FILLER      PIC X(12) VALUE "  **********".
071900
072000 01  MODIFIED-ORD-LIT-1.
072100     05  FILLER   PIC X(10) VALUE ALL "*".
072200     05  EXPAND-4    PIC X(8)  VALUE SPACES.
072300***      MODIFICATION  OF  ORDER
072400     05  PRT-MOD-LIT  PIC X(25) VALUE SPACES.
072500     05  NORMAL-4  PIC X(8)  VALUE SPACES.
072600     05  FILLER   PIC X(10) VALUE ALL "*".
072700     05  FILLER   PIC X(52) VALUE SPACES.
072800
072900 01  MODIFIED-ORD-LIT-2.
073000     05  FILLER   PIC X(10) VALUE ALL "*".
073100     05  FILLER   PIC X(5)  VALUE SPACES.
073200     05  EXPAND-5    PIC X(8)  VALUE SPACES.
073300***      DO  NOT  DUPLICATE
073400     05  PRT-DONT-DUP-LIT  PIC X(20)  VALUE SPACES.
073500     05  NORMAL-5    PIC X(8)  VALUE SPACES.
073600     05  FILLER   PIC X(5)  VALUE SPACES.
073700     05  FILLER   PIC X(10) VALUE ALL "*".
073800     05  FILLER   PIC X(52) VALUE SPACES.
073900
       01  CANCELLED-ORD-LIT-A.
           05  FILLER         PIC X(17) VALUE ALL "*".
           05  FILLER         PIC X(3)  VALUE SPACES.
           05  EXP-CANC       PIC X(8)  VALUE SPACES.
      ***      ORDER CANCELLED
           05  PRT-CANC-LIT   PIC X(16) VALUE SPACES.
           05  NORM-CANC      PIC X(8)  VALUE SPACES.
           05  FILLER         PIC X(3)  VALUE SPACES.
           05  FILLER         PIC X(17) VALUE ALL "*".

074000 01  CANCELLED-ORD-LIT.
074100     05  FILLER   PIC X(14) VALUE ALL "*".
074200     05  PRT-CAN-LIT  PIC X(44)  VALUE SPACES.
074300     05  FILLER   PIC X(14) VALUE ALL "*".
074400     05  FILLER   PIC X(60) VALUE SPACES.
074500
074600
074700 01  PRT-PO-DATE.
074800     05  P-PO-DATE       PIC X(8).
074900     05  FILLER          PIC X(15) VALUE SPACES.
075000
075100 01  PRT-PO-DATE-REV.
075200     05  FILLER          PIC X(2) VALUE SPACES.
075300     05  P-PO-DATE-R     PIC X(8).
075400     05  FILLER          PIC X    VALUE SPACES.
075500     05  REV-LIT         PIC X(4) VALUE "REV ".
075600     05  P-PO-REV-DATE   PIC X(8).
075700
      *------ LINE TO PRINT THE BUYER NAME AT THE BOTTOM OF THE PO
      *------ (ORIGINALLY FOR AUSTRALIA).
       01  PO-BUYER-LINE.
           05  FILLER                 PIC X(15).
           05  P-BUYER-NAME           PIC X(15).

      *------ LINE TO PRINT THE DATE AT THE BOTTOM OF THE PO
      *------ (ORIGINALLY FOR AUSTRALIA).
       01  PO-DATE-LINE.
           05  FILLER                 PIC X(28).
           05  P-DATE                 PIC X(08).

       01  CURRENT-DATE.
           05  CURRENT-YY            PIC X(2).
           05  CURRENT-MM            PIC X(2).
           05  CURRENT-DD            PIC X(2).

075900 01  EXP-PRT-SEQ           PIC X(8)  VALUE SPACES.
076000
076100 01  COMP-PRT-SEQ          PIC X(8)  VALUE SPACES.
076200
076300 01  REG-PRT-SEQ           PIC X(8)  VALUE SPACES.
076400
       01  DBL-WIDE-OFF-SEQ      PIC X(8)  VALUE SPACES.

076500 01  PO-STD-INSTRUCTIONS.
076600     05  PO-STD-INST-1             PIC X(3)  VALUE SPACES.
           05  PO-STD-INST-2             PIC X(3)  VALUE SPACES.
076700     05  PO-STD-INST-3-8           PIC X(18) VALUE SPACES.
076800 01  PO-STD-INST-TABLE  REDEFINES  PO-STD-INSTRUCTIONS.
076900     05  PO-STD-INST  OCCURS 8 TIMES   PIC X(3).
077000
077100 01  STD-INST-SAVED.
077200     05  SAVE-STD-INST-BEFORE       PIC X(18).
077300     05  SAVE-STD-INST-AFTER        PIC X(18).
077400     05  SAVE-CONFIRM-FLAG          PIC X.
077500     05  SAVE-CONFIRM-VERBAGE       PIC X(34).
077600
077700 01  MESSAGE-BUFFER                 PIC X(72) VALUE SPACES.
077800
078000 COPY CDESC IN COPYLIB.
078100
078200 01  RET-CODE                     PIC X(2)   VALUE SPACES.
078300
       COPY CATREAD IN COPYLIB.

078400 COPY TBLOWUP IN COPYLIB.
078500
078600 COPY VIEWDUM IN COPYLIB.
078700
079400 01  HP-PRINTER-ESC-SEQ.
079500     05  COMPRESS-PRINT.
               10  FILLER       PIC S9(12) BINARY VALUE 000000196879.
079600*        10  FILLER               PIC X     VALUE %33.
079700*        10  FILLER               PIC X(4)  VALUE "&k2S".
079800*        10  FILLER               PIC X     VALUE %0.
079900*        10  FILLER               PIC X     VALUE %0.
080000*        10  FILLER               PIC X     VALUE %0.
080100     05  REGULAR-PRINT.
               10  FILLER       PIC S9(12) BINARY VALUE 000000196882.
080200*        10  FILLER               PIC X     VALUE %33.
080300*        10  FILLER               PIC X(4)  VALUE "&k0S".
080400*        10  FILLER               PIC X     VALUE %0.
080500*        10  FILLER               PIC X     VALUE %0.
080600*        10  FILLER               PIC X     VALUE %0.
080700     05  EXPAND-PRINT.
               10  FILLER       PIC S9(12) BINARY VALUE 012937025281.
080800*        10  FILLER               PIC X     VALUE %33.
080900*        10  FILLER               PIC X(4)  VALUE "&k1S".
081000*        10  FILLER               PIC X     VALUE %0.
081100*        10  FILLER               PIC X     VALUE %0.
081200*        10  FILLER               PIC X     VALUE %0.
081300      05 EXPAND-PRINT-OFF PIC S9(12) BINARY VALUE 012937025280.
081400
      *****************************************
      *   PARAMETERS FOR CALLING 'SEDIVNCK'
      *   WHICH IS THE ROUTINE TO DETERMINE
      *   IF VENDOR IS EDI OR NOT
      *****************************************

       COPY SEDIVNCK IN COPYLIB.

081500 LINKAGE SECTION.
081600
081700 01  BASE                        PIC X(10).
081800
081900 01  PO-PRINT-PARMS.
082000     05  PO-NUMBER.
082100         10  FILLER            PIC X.
               10  PO-RLSE-NO.
082200             15  PETTY-PO-CHECK    PIC X.
082300             15  FILLER            PIC X(12).
082400     05  PO-REPRINT            PIC X.
082500     05  PO-PRINT-TYPE         PIC X.
082600     05  PO-MODIFIED-ORDER     PIC X.
082700     05  PO-CANCELLED-ORDER    PIC X.
082800     05  SPOOL-PRINT-NUM        PIC S9(2)  COMP-4.
082900     05  PO-ITEMS OCCURS 15 INDEXED BY P-INDEX.
083000         10  PO-ITEM            PIC X(4).
083100
083200 COPY ESCNAME IN COPYLIB.
083300
083400 COPY LANGSUB IN COPYLIB.
083500
083600
083700
083800 PROCEDURE DIVISION USING  BASE,
083900                           PO-PRINT-PARMS,
084000                           ESC-NAME,
084100                           LANGUAGE-PARMS.
084200
084300
084400 BEGIN-HERE.
           OPEN INPUT DPOITEM-I, MVALIDUM-I, MSTORERM-I, MPLTINFO-I,
                      DPORECD-I, DPODATAITM-I, DCOMMENT-I, DVENDOR-I,
                      DCHATNO, MBUYER-I.
      *-------- FIND OUT IF PLANT WANTS TO PRINT PO WITH NO SPECIAL
      *-------- CHARACTERS.  IF SO, CALL "TPOPRNT2" INSTEAD AND RETURN.
           MOVE "POPT"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
               IF MPLTINFO-ASCII-PO-PRNTS = "N"
                   CALL "TPOPRNT2"    USING BASE,
                                            PO-PRINT-PARMS,
                                            ESC-NAME,
                                            LANGUAGE-PARMS
                   GOBACK.

084600     MOVE CHAR-1636PI TO COMP-PRT-SEQ.
           MOVE CHAR-10PI   TO REG-PRT-SEQ.
084700     MOVE IBM-DOUBLE-WIDE-OFF  TO NORMAL-1, NORMAL-2, NORMAL-3,
084800                            NORMAL-4, NORMAL-5, DBL-WIDE-OFF-SEQ,
                                  NORM-MOD-CANC, NORM-CANC.
084900     MOVE CHAR-5PI    TO EXPAND-1, EXPAND-2, EXPAND-3,
085000                         EXPAND-4, EXPAND-5, EXP-PRT-SEQ,
                               EXP-MOD-CANC, EXP-CANC.

           MOVE SPACES      TO SEDIVNCK-PARMS.
085100
085200     MOVE PO-NUMBER      TO  PO-ARG,
                                   SEDIVNCK-PO-NUMBER
085300                             BU-DISPLAY-FLD (1).
           CALL "SEDIVNCK" USING BASE, SEDIVNCK-PARMS.

           MOVE "N"    TO SAVE-CHAT-SW.
           MOVE "CHAT" TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 17 TO COND-WORD.
085700     IF COND-WORD = 17
085800         NEXT SENTENCE
           ELSE
           MOVE MPLTINFO-CHAT-PURCH-REQUIRED TO  SAVE-CHAT-SW.

085400     MOVE "PDEC"         TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
085500*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
085600*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
085700     IF COND-WORD NOT = ZERO
085800         IF COND-WORD = 17
085900             MOVE "N"  TO  FOREIGN-DECIMAL-SW
086000         ELSE
086100             MOVE "GET MPLTINFO 'PDEC'*1H" TO BU-DISPLAY-MSG
086200             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
086300             GO TO 2-BLOWUP
086400     ELSE
086500         MOVE "Y"  TO  FOREIGN-DECIMAL-SW.
086600
086700***************************************************************
086800**                                                           **
086900**   GET 'POPT' IN MPLTINFO TO DETERMINE IF THE PO PRINTER   **
087000**   IS MPE SPOOLED.   IF IT IS DONT ADVANCE THE PO PRINTER  **
087100**   BEFORE STARTING THE PO PRINTOUT                         **
087200**                                                           **
087300***************************************************************
087400
           MOVE SPOOL-PRINT-NUM TO  SAVE-PO-SPECIAL.
           MOVE 999999          TO  SAVE-DOLLAR-AMOUNT.
087500     MOVE "POPT"          TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
087600*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
087700*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
087800     IF COND-WORD NOT = ZERO
087900         IF COND-WORD = 17
088000             MOVE "N"  TO  MPE-SPOOLED-PRINTER-SW
088100                           MPLTINFO-PO-HP-PRINTER-SW
088200                           MPLTINFO-SW-VENDOR-ADDR-SW
                   MOVE SPOOL-PRINT-NUM TO SAVE-PO-SPECIAL
                   MOVE 999999          TO SAVE-DOLLAR-AMOUNT
088300         ELSE
088400             MOVE "GET MPLTINFO 'POPT'*1H" TO BU-DISPLAY-MSG
088500             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
088600             GO TO 2-BLOWUP
088700     ELSE
           MOVE MPLTINFO-PO-SPECIAL     TO SAVE-PO-SPECIAL
           MOVE MPLTINFO-PO-SP-AMOUNT   TO SAVE-DOLLAR-AMOUNT
088800     IF MPLTINFO-PO-PRT-MPE-SPOOLED = "Y"
088900         MOVE "Y"                 TO MPE-SPOOLED-PRINTER-SW
089000     ELSE
089100     MOVE "N"                     TO MPE-SPOOLED-PRINTER-SW.
089200
091700******************************************************
091800**   IF MPLTINFO-SW-VENDOR-ADDR-SW = 'Y' THEN THIS
091900**   MEANS SWITCH THE SELLER ADDRESS TO THE RIGHT
092000**   SIDE OF THE PURCHASE ORDER PRINT AND IF THERE
092100**   IS A DIFFERENT REMIT (PAYTO) VENDOR ADDRES THEN
092200**   PRINT IT ON THE LEFT.  IN OTHER WORDS THE ADDRESSES
092300**   ARE REVERSED.
092400******************************************************
092500
092600     IF MPLTINFO-SW-VENDOR-ADDR-SW = "Y"
092700         MOVE "Y"                 TO SW-VENDOR-ADDR-SW
092800     ELSE
092900         MOVE "N"                 TO SW-VENDOR-ADDR-SW.
093000
093100
      *------- SEE IF FOOTER NEEDS TO BE PRINTED (AUSTRALIA).
           IF MPLTINFO-PRNT-PO-FOOTER = "Y"
               MOVE "Y"                 TO PRINT-PO-FOOTER-SW
               MOVE 1                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT      TO  P-DATE
           ELSE
               MOVE "N"                 TO  PRINT-PO-FOOTER-SW.

093200*****************************************************
093300*                                                   *
093400*    GET THE JCW  'PRICE'.                          *
093500*    IF THE 'PRICE' JCW IS FOUND AND IS SET TO '1'  *
093600*    THEN THE USER CAN SEE PRICING INFO.            *
093700*                                                   *
093800*****************************************************
093900
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           IF JCW-PRICE-258 = "1"
               MOVE "Y"  TO PRICE-CAPABILITY-SW
           ELSE
               MOVE "N"  TO PRICE-CAPABILITY-SW.
      *********************************************************
      **   OVERRIDE THE PO PRICE CHECK AT THIS TIME SINCE
      **   I AM NOT SURE IT IS NECESSARY TO SCREEN THE PO
      **   PRICE FROM ALL THE USERS ANYMORE.
      **   IT WILL BE MORE COMPLICATED TRYING TO PREVENT
      **   PRICE SURPRESSION ON PO PRINTS AND INQUIRIES AND
      **   BEFORE THIS IS DONE I WANT TO SEE WHO COMPLAINS
      *********************************************************
           MOVE "Y"   TO PRICE-CAPABILITY-SW.

094000*    MOVE "PRICE;"   TO  JCW-NAME.
094100*    CALL INTRINSIC "FINDJCW" USING JCW-NAME, JCW-VALUE,
094200*        JCW-STATUS.
094300*    IF JCW-STATUS  NOT = 0
094400*        IF JCW-STATUS = 3
094500*            MOVE "N"  TO  PRICE-CAPABILITY-SW
094600*        ELSE
094700*            MOVE "FINDJCW PRICE *BH" TO BU-DISPLAY-MSG
094800*            MOVE JCW-STATUS            TO BU-DISPLAY-FLD9 (1)
094900*            GO TO 2-BLOWUP
095000*    ELSE
095100*        IF JCW-VALUE = 1
095200*            MOVE "Y"  TO  PRICE-CAPABILITY-SW.
095300
           MOVE "PACD"      TO PLT-ARG.
           MOVE 0           TO COND-WORD.
           MOVE PLT-ARG     TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF COND-WORD NOT = 0
               IF COND-WORD = 17
                   MOVE "N" TO GAS-STRUCTURE-SW
               ELSE
               MOVE "GET MPLTINFO *PACD* " TO BU-DISPLAY-MSG
               MOVE PLT-ARG                TO BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP
           ELSE
           IF MPLTINFO-PACD-SW NOT = "N"
               MOVE "N"     TO GAS-STRUCTURE-SW
           ELSE
           MOVE "Y"         TO GAS-STRUCTURE-SW.

095400***********************************
095500**  LOAD PRINT BUFFERS
095600***********************************
095700     MOVE 55                      TO  LANG-SETNUM.
           IF SEDIVNCK-EDI-IND = "Y"
               MOVE 24                  TO  LANG-MSGNUM
           ELSE
095800     MOVE 1                       TO  LANG-MSGNUM.
095900     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
096000     MOVE MESSAGE-BUFFER          TO  USA-PO-HEADING.
096100     MOVE 2                       TO  LANG-MSGNUM.
096200     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
096300     MOVE MESSAGE-BUFFER          TO  MODIFIED-HEADING.
096400     MOVE 3                       TO  LANG-MSGNUM.
096500     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
096600     MOVE MESSAGE-BUFFER          TO  CANCELLED-HEADING.
096700     MOVE 4                       TO  LANG-MSGNUM.
096800     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
096900     MOVE MESSAGE-BUFFER          TO  CAN-PO-HEADING.
           IF SEDIVNCK-EDI-IND = "Y"
               MOVE 25                  TO  LANG-MSGNUM
           ELSE
097000     MOVE 5                       TO  LANG-MSGNUM.
097100     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
097200     MOVE MESSAGE-BUFFER          TO  RELEASE-HEADING.
097300     MOVE 6                       TO  LANG-MSGNUM.
097400     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
097500     MOVE MESSAGE-BUFFER          TO  INTERNAL-HEADING.
097600     MOVE 8                       TO  LANG-MSGNUM.
097700     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
097800     MOVE MESSAGE-BUFFER          TO  PRT-PAGE.
097900     MOVE 9                       TO  LANG-MSGNUM.
098000     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
098100     MOVE MESSAGE-BUFFER          TO  PRT-TO.
098200     MOVE 10                      TO  LANG-MSGNUM.
098300     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
098400     MOVE MESSAGE-BUFFER          TO  PRT-QTY-LIT.
098500     MOVE 11                      TO  LANG-MSGNUM.
098600     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
098700     MOVE MESSAGE-BUFFER          TO  PRT-UNIT-PRICE.
098800     MOVE 12                      TO  LANG-MSGNUM.
098900     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
099000     MOVE MESSAGE-BUFFER          TO  PRT-PART-LIT.
099100     MOVE 13                      TO  LANG-MSGNUM.
099200     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
099300     MOVE MESSAGE-BUFFER          TO  PRT-CLASS-LIT.
099400     MOVE 14                      TO  LANG-MSGNUM.
099500     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
099600     MOVE MESSAGE-BUFFER          TO  PRT-DEPT-LIT.
099700     MOVE 15                      TO  LANG-MSGNUM.
099800     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
099900     MOVE MESSAGE-BUFFER          TO  PRT-EXP-LIT.
100000     MOVE 23                      TO  LANG-MSGNUM.
100100     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
100200     MOVE MESSAGE-BUFFER          TO  UNIT-VALUE-LIT.
100300     MOVE 22                      TO  LANG-MSGNUM.
100400     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
100500     MOVE MESSAGE-BUFFER          TO  REV-LIT.

           MOVE "MCFPCS7000"   TO  CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING    CHKOBJ-FILE-NAME,
                                   CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS  = "00"
               MOVE "Y"        TO  PRINT-DCOMPL-SW
           ELSE
               MOVE "N"        TO  PRINT-DCOMPL-SW.
100600
100700     PERFORM 6-PRINT-PO  THRU  6-PP-X.

           CLOSE DPOITEM-I, MVALIDUM-I, MSTORERM-I, MPLTINFO-I,
                 DPORECD-I, DPODATAITM-I, DCOMMENT-I, DVENDOR-I,
                 DCHATNO, MBUYER-I.
100800     GOBACK.
100900
101000
101100******************************************************
101200**                                                  **
101300**   BLOWUP ROUTINE                                 **
101400**                                                  **
101500******************************************************
101600
101700 2-BLOWUP.
101900     MOVE "TPOPRNT"        TO  BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS  TO COND-WORD.
102000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
102100         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
102200             BU-DISPLAY-FLDS.
102300
102400
102500
102600 6-PRINT-PO.
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE 'PRNTWORK'
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "PRNTWORK"    TO CCRTFILE-FILE.
           MOVE "0133"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "10000"       TO CCRTFILE-NO-RECORDS.
           MOVE "02000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE  10           TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'PRNTWORK' FAILED"
                  TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
102700     OPEN OUTPUT PRNT-WORK-FILE.
102800     PERFORM 61-BUILD-POTOP THRU 61-BP-X.
102900
103000     MOVE 1  TO  PAGE-CTR.
103100     MOVE 27 TO  LINE-CTR.
103200
103300     MOVE SPACES                  TO  PRINT-SPECIFIC-ITEMS-SW.
103400     MOVE 1                       TO  SUB2.
103500     PERFORM 61-LEFT-SHIFT-ITEM-NO  THRU  61-LSIN-X
103600         VARYING SUB1 FROM 1 BY 1  UNTIL SUB1 > 15.
103700     SUBTRACT 1 FROM SUB2
103800     IF PRINT-SPECIFIC-ITEMS-SW = "Y"
103900         PERFORM 61-SORT-PART-A VARYING I-SUB FROM 1 BY 1
104000             UNTIL I-SUB > SUB2.
104100
104200     MOVE SPACE TO Z-BILL-STATUS.
104300     PERFORM 61-CHECK-FOR-MEMO-Z.
104400     IF PO-IS-Z-BILL
104500         MOVE SPACE TO PO-STD-INST-TABLE
104600         MOVE "MZB" TO PO-STD-INST (2)
104700         PERFORM 64-PRINT-STD-INST THRU 64-PSI-X.
104800     MOVE SPACE TO PO-STD-INST-TABLE.
104900
105000     PERFORM 61-GET-STD-INST  THRU  61-GSI-X.
105100
           IF PO-INVOICELESS-IND = "X"
               MOVE "IVL"                     TO  PO-STD-INST-1
               IF PO-PRINT-TYPE = "S"
105300             MOVE "REL"                 TO  PO-STD-INST-2
105400             MOVE SAVE-STD-INST-BEFORE  TO  PO-STD-INST-3-8
               ELSE
               MOVE SAVE-STD-INST-BEFORE      TO  PO-STD-INST-3-8
           ELSE
105200     IF PO-PRINT-TYPE = "S"
105300         MOVE "REL"                     TO  PO-STD-INST-2
105400         MOVE SAVE-STD-INST-BEFORE      TO  PO-STD-INST-3-8
105500     ELSE
105600     MOVE SAVE-STD-INST-BEFORE          TO  PO-STD-INSTRUCTIONS.
105800     IF PO-STD-INST-TABLE  NOT =  SPACES
105900         PERFORM 64-PRINT-STD-INST  THRU  64-PSI-X.
106000
106100***********************************************
106200**
106300**  CHECK ALL ITEMS TO SEE IF THEY ALL HAVE THE
106400**  SAME TAX CODE. IF THEY DO THEN TAX CODED WILL
106500**  PRINT AT THE END OF THE PO. IF NOT THEN TAX
106600**  CODE FOR THE ITEM(S) WILL PRINT AFTER EACH
106700**  ITEM
106800**
106900***********************************************
107000
107100     PERFORM 66-CHECK-ITEM-TAX-CODES  THRU  66-CITC-X.
107200
107300     PERFORM 62-PRINT-ITEMS THRU 62-PI-X.
107400
107500     IF SAVE-STD-INST-AFTER  NOT =  SPACES
107600         MOVE SAVE-STD-INST-AFTER      TO  PO-STD-INSTRUCTIONS
107700         PERFORM 64-PRINT-STD-INST THRU 64-PSI-X.
107800
107900     PERFORM 64-TAX-MSG THRU 64-TM-X.
108000
108100     IF PO-MODIFIED-ORDER = "X"
108200         PERFORM 64-MOD-ORD-MSG  THRU  64-MOD-M-X.
108300
108400     IF PO-CANCELLED-ORDER  =  "X"
               PERFORM 64-CAN-ORD-LIT  THRU  64-COL-X
108500         PERFORM 64-CAN-ORD-MSG  THRU  64-COM-X
108600             VARYING LANG-MSGNUM FROM 19 BY 1
108700                 UNTIL LANG-MSGNUM > 21.
108800
      ***** REMOVED 01/11/2001
      *--------- ADD Y2K COMMAND FOR LAWTON.
      **   IF SAVE-FAX-FIRST-CHAR = "+"
      **     IF COMPANY-SAVE = "153"
      **       MOVE 1 TO CTL
      **       MOVE PRT-FAX-Y2K          TO  PRNT-WORK-LINE
      **       PERFORM 61-WRITE-PRNT-WORK-RCD.
      *****

      **-- ADD T&C COMMAND FOR SPARTANBURG AND SOCIAL CIRCLE
           IF SAVE-FAX-FIRST-CHAR = "+"
             IF COMPANY-SAVE = "120" OR "130"
               MOVE 1                    TO CTL
               MOVE PRT-FAX-TC           TO PRNT-WORK-LINE
               PERFORM 61-WRITE-PRNT-WORK-RCD.

      **-- ADD T&C COMMAND FOR LAWTON.
           IF SAVE-FAX-FIRST-CHAR = "+"
             IF COMPANY-SAVE = "153"
               MOVE 1                    TO CTL
               MOVE PRT-FAX-TC2          TO PRNT-WORK-LINE
               PERFORM 61-WRITE-PRNT-WORK-RCD.

108800     IF SAVE-FAX-FIRST-CHAR = "+"
163700         MOVE 1 TO CTL
163800         MOVE PRT-FAX-END          TO  PRNT-WORK-LINE
163900         PERFORM 61-WRITE-PRNT-WORK-RCD.
108800
108900     CLOSE PRNT-WORK-FILE.
109000     OPEN INPUT PRNT-WORK-FILE.
109500
109600*------IF AN AKRON PLANT, THE SPOOLER NUMBER WAS PASSED
      *------IF SPOOL-PRINT-NUM IS ZEROS THEN DEFAULT TO LOCAL
      *------PRINTER 'MCPRT' WHICH USES *JOB FOR OUTQ
109700
109800     IF SPOOL-PRINT-NUM < 1 OR > 99 OR = 00
109900        MOVE "MCPRT"            TO  OVRPRTF-TOFILE
110000     ELSE
110100        MOVE SPOOL-PRINT-NUM    TO  OVRPRTF-TOFILE-NUM.
           PERFORM 996-OVERRIDE-PRINT-FILE.
110200
111000     OPEN OUTPUT ONLINE-PRT.
111100     PERFORM 65-MAIN THRU 65-MAIN-X.
111200     CLOSE PRNT-WORK-FILE.
112000     CLOSE ONLINE-PRT.
112100
112200 6-PP-X.
112300     EXIT.
112400
112500 61-LEFT-SHIFT-ITEM-NO.
112600     IF PO-ITEM (SUB1) = "0000" OR SPACES
112700         NEXT SENTENCE
112800     ELSE
112900     IF SUB1 = SUB2
113000         ADD 1                    TO  SUB2
113100         MOVE "Y"                 TO  PRINT-SPECIFIC-ITEMS-SW
113200     ELSE
113300         MOVE PO-ITEM (SUB1)      TO  PO-ITEM (SUB2)
113400         MOVE "0000"              TO  PO-ITEM (SUB1)
113500         ADD 1                    TO  SUB2
113600         MOVE "Y"                 TO  PRINT-SPECIFIC-ITEMS-SW.
113700
113800 61-LSIN-X.
113900     EXIT.
114000
114100
114200 61-SORT-PART-A.
114300     PERFORM 611-SORT-PART-B VARYING J-SUB FROM SUB2 BY -1
114400         UNTIL J-SUB = I-SUB.
114500
114600 611-SORT-PART-B.
114700     IF PO-ITEM (I-SUB) > PO-ITEM (J-SUB)
114800         MOVE PO-ITEM (J-SUB) TO TEMP-ITEM
114900         MOVE PO-ITEM (I-SUB) TO PO-ITEM (J-SUB)
115000         MOVE TEMP-ITEM TO PO-ITEM (I-SUB).
115100
115200 61-CHECK-FOR-MEMO-Z.
115300     MOVE SPACE TO Z-BILL-STATUS.
115400     MOVE PO-PO-NO TO PO-ARRAY.
115500     PERFORM 611-FIND-M VARYING PO-INDEX FROM 7 BY -1 UNTIL
115600       PO-INDEX = 0 OR PO-IS-Z-BILL.
115700
115800 611-FIND-M.
115900     IF PO-CHAR (PO-INDEX) = "M"
116000         MOVE "1" TO Z-BILL-STATUS
116100     ELSE
116200         IF PO-CHAR (PO-INDEX) NOT = SPACE
116300             SET PO-INDEX TO 1.
116400
116500 61-BUILD-POTOP.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
116900         MOVE "FIND DPORECD * 61-BP" TO BU-DISPLAY-MSG
117000         GO TO 2-BLOWUP.
117100
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" OR
              PORCVNO OF DPORECD-REC-I NOT = PO-ARG
117500         MOVE "GET DPORECD * 61-BP" TO  BU-DISPLAY-MSG
117600         GO TO 2-BLOWUP.
117700
      *****************************************************
      **   ADDED THE FOLLOWING CHECK ON 10/26/94 PER A
      **   REQUEST BY UNION CITY (94-047) TO FORCE P.O'S
      **   GREATER THAN A PLANT-SPECIFIED DOLLAR AMOUNT
      **   TO BE DIRECTED TO A DIFFERENT OUTQ FOR REVIEW
      **   BY THE PLANT PURCHASING MANAGER PRIOR TO
      **   RELEASE. THE PRINTER AND DOLLAR AMOUNT ARE
      **   ESTABLISHED IN PLANT STARTUP PRINTER OPTIONS.
      *****************************************************
           IF PO-BUDGET-AMT > SAVE-DOLLAR-AMOUNT
               MOVE SAVE-PO-SPECIAL TO SPOOL-PRINT-NUM.

089300*****************************************************
089400**   CHECK THE HP PO PRINTER SWITCH IN THE 'POPT'
089500**   KEY IF IT IS SET TO 'Y' THEN OVERRIDE THE
089600**   PRINTER ESC SEQUENCES WITH HP PRINTER ESC
089700**   SEQUENCES SINCE THIS SWITCH SET TO 'Y' MEANS
089800**   THE PO PRINTER IS AN HP PRINTER.  BASICALLY FOR
089900**   INTERNATIONAL PLANTS THAT WANT AN HP PRINTER FOR
090000**   POs ONLY BUT HAVE OKIDATA FOR MOST OF THE PLANT
090100**
090200**   HOWEVER IT THIS ROUTINE IS CALLED TO PRINT
090300**   AN INTERNAL ORDER SKIP THIS CHECK FOR PO
090400**   PRINTER TYPE.
090500******************************************************
090600
090700     IF PO-INTERNAL-ORDER-INDIC = "X"
090800         NEXT SENTENCE
090900     ELSE
091000     IF MPLTINFO-PO-HP-PRINTER-SW = "Y"
091100         MOVE COMPRESS-PRINT   TO COMP-PRT-SEQ
               MOVE REGULAR-PRINT    TO REG-PRT-SEQ
091200         MOVE EXPAND-PRINT-OFF TO NORMAL-1, NORMAL-2, NORMAL-3,
091300                         NORMAL-4, NORMAL-5, DBL-WIDE-OFF-SEQ,
                               NORM-MOD-CANC, NORM-CANC
091400         MOVE EXPAND-PRINT     TO EXPAND-1, EXPAND-2, EXPAND-3,
091500                                  EXPAND-4, EXPAND-5, EXP-PRT-SEQ,
                                        EXP-MOD-CANC, EXP-CANC.
091600
117800     MOVE "P 01"               TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
117900*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
118000*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
118100     IF COND-WORD NOT = ZEROS
118200         MOVE "GET PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
118300         MOVE PLT-ARG           TO  BU-DISPLAY-FLD (2)
118400         GO TO 2-BLOWUP.
118500     MOVE MPLTINFO-COMPANY     TO  COMPANY-SAVE.
118600     MOVE MPLTINFO-TERR        TO  TERRITORY-SAVE.
118700
118800     MOVE 4            TO  DATE-MODE.
118900     MOVE PO-DATE      TO  DATE-VALIDATE-IN.
119000     CALL "TDATECHK" USING DATE-CHECK-AREA.
119100     MOVE SPACES               TO  PRTWK-AREA.
119200     IF PO-MODIFIED-ORDER = "X"
119300         MOVE DATE-SLASH-OUT   TO  P-PO-DATE-R
119400         MOVE 1                TO  DATE-MODE
119500         CALL "TDATECHK" USING DATE-CHECK-AREA
119600         MOVE DATE-SLASH-OUT   TO  P-PO-REV-DATE
119700         MOVE PRT-PO-DATE-REV  TO  P-PO-DATE-AREA
119800     ELSE
119900         MOVE DATE-SLASH-OUT   TO  P-PO-DATE
120000         MOVE PRT-PO-DATE      TO  P-PO-DATE-AREA.
120100     MOVE 1  TO  CTL.
120200     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
120300     PERFORM 61-WRITE-PRNT-WORK-RCD.
120400
120500     MOVE SPACES               TO  PRTWK-AREA.
120600     MOVE PO-REQ-NUMBER        TO  P-REQ.
120700     IF COMPANY-SAVE = "126"
120800         MOVE SPACES           TO  P-REC-DEPT
120900     ELSE
121000         MOVE PO-RCV-DEPT      TO  P-REC-DEPT.
121100     MOVE EXP-PRT-SEQ          TO  P-EXP-PRT.
121200     MOVE SPACES               TO  REFORM-PO-NUMBER.
121300     MOVE PO-PO-NO             TO  R-PO-NUMBER.
121400     IF PO-RLS-NO = ZERO
121500         NEXT SENTENCE
121600     ELSE
121700         MOVE "-"              TO  R-HYPEN
121800         MOVE PO-RLS-NO        TO  R-PO-REL
121900         MOVE 0                TO  SUB1
122000         MOVE 8                TO  SUB2
122100         PERFORM 611-RIGHT-JUST-RLSE  THRU  611-RJR-X.
122200     MOVE REFORM-PO-NUMBER     TO  PRINT-PO-NUMBER.
122300     MOVE DBL-WIDE-OFF-SEQ     TO  P-REG-PRT.
122400     MOVE 2  TO   CTL.
122500     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
122600     PERFORM 61-WRITE-PRNT-WORK-RCD.
122700
122800     MOVE SPACES               TO  PRTWK-AREA.
122900     MOVE "P 00"               TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
123000*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
123100*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
123200     IF COND-WORD NOT = ZEROS
123300         MOVE "GET2 PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
123400         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
123500         GO TO 2-BLOWUP.
123600     MOVE MPLTINFO-DATA        TO  P-SHIP-HDR-1,
123700                                   HDR2-DATA.
123800     IF PO-ALT-REMIT-INDIC = "X" OR COMPANY-SAVE = "126"
123900         MOVE "PA00"  TO  PLT-ARG
               MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I
               READ MPLTINFO-I INTO BUF-MPLTINFO
                   INVALID KEY MOVE "2" TO FILE-STATUS-1 END-READ
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
124600             MOVE "GET2A PLTINFO * 61-BP" TO  BU-DISPLAY-MSG
124700             MOVE PLT-ARG            TO  BU-DISPLAY-FLD (2)
124800             GO TO 2-BLOWUP
               ELSE
               IF COMPANY-SAVE = "126"
                   MOVE MPLTINFO-DATA TO P-SHIP-HDR-1
               ELSE
                   MOVE MPLTINFO-DATA TO HDR2-DATA.
125100
125200     IF PO-SHIP-DATE NUMERIC
125300         MOVE 4                TO  DATE-MODE
125400         MOVE PO-SHIP-DATE     TO  DATE-VALIDATE-IN
125500         CALL "TDATECHK" USING DATE-CHECK-AREA
125600         MOVE DATE-SLASH-OUT   TO  P-SHIP-DATE
125700     ELSE
125800         MOVE PO-SHIP-DATE     TO  P-SHIP-DATE.
125900     MOVE 1  TO  CTL.
126000     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
126100     PERFORM 61-WRITE-PRNT-WORK-RCD.
126200
126300     MOVE SPACES               TO  PRTWK-AREA.
126400     MOVE "P 01"               TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
126500*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
126600*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
126700     IF COND-WORD NOT = ZEROS
126800         MOVE "GET3 PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
126900         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
127000         GO TO 2-BLOWUP.
127100     MOVE MPLTINFO-PLT-NAME    TO  P-SHIP-HDR-2,
127200                                   HDR3-DATA.
127300     IF PO-ALT-REMIT-INDIC = "X" OR COMPANY-SAVE = "126"
127400         MOVE "PA01"  TO  PLT-ARG
               MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I
               READ MPLTINFO-I INTO BUF-MPLTINFO
                   INVALID KEY MOVE "2" TO FILE-STATUS-1 END-READ
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
124600             MOVE "GET4 PLTINFO * 61-BP" TO  BU-DISPLAY-MSG
124700             MOVE PLT-ARG            TO  BU-DISPLAY-FLD (2)
124800             GO TO 2-BLOWUP
               ELSE
               IF COMPANY-SAVE = "126"
                   MOVE MPLTINFO-PLT-NAME TO P-SHIP-HDR-2
               ELSE
                   MOVE MPLTINFO-DATA TO HDR3-DATA.
128600     MOVE 1  TO  CTL.
128700     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
128800     PERFORM 61-WRITE-PRNT-WORK-RCD.
128900
129000     MOVE SPACES               TO  PRTWK-AREA.
129100     MOVE "P 12"               TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
129200*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
129300*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
129400     IF COND-WORD NOT = ZEROS
129500         MOVE "GET5 PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
129600         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
129700         GO TO 2-BLOWUP.
129800     MOVE MPLTINFO-DATA        TO  P-SHIP-HDR-3.
129900     MOVE PO-RCV-DEPT          TO  P-REC-DEPT-2.
130000     MOVE PO-FOB               TO  P-FOB.
           IF COMPANY-SAVE = "126"
               NEXT SENTENCE
           ELSE
130100     MOVE 1  TO  CTL
130200     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE
130300     PERFORM 61-WRITE-PRNT-WORK-RCD.
130400
130500     MOVE SPACES               TO  PRTWK-AREA.
130600     MOVE "P 10"               TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
130700*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
130800*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
130900     IF COND-WORD NOT = ZEROS
131000         MOVE "GET6 PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
131100         MOVE PLT-ARG                TO  BU-DISPLAY-FLD (2)
131200         GO TO 2-BLOWUP.
131300     MOVE MPLTINFO-DATA        TO  P-SHIP-HDR-4,
131400                                   HDR4-DATA.
131500     IF PO-ALT-REMIT-INDIC = "X" OR COMPANY-SAVE = "126"
131600         MOVE "PA10"  TO  PLT-ARG
               MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I
               READ MPLTINFO-I INTO BUF-MPLTINFO
                   INVALID KEY MOVE "2" TO FILE-STATUS-1 END-READ
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
124600             MOVE "GET6 PLTINFO * 61-BP" TO  BU-DISPLAY-MSG
124700             MOVE PLT-ARG            TO  BU-DISPLAY-FLD (2)
124800             GO TO 2-BLOWUP
               ELSE
               IF COMPANY-SAVE = "126"
                   MOVE MPLTINFO-DATA TO P-SHIP-HDR-3
               ELSE
                   MOVE MPLTINFO-DATA TO HDR4-DATA.
133000     MOVE 1  TO  CTL.
133100     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
133200     PERFORM 61-WRITE-PRNT-WORK-RCD.
133300
133400     MOVE SPACES               TO  PRTWK-AREA.
133500     MOVE "P 11"               TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
133600*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
133700*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
133800     IF COND-WORD NOT = ZEROS
133900         MOVE "GET7 PLTINFO * 61-BP"  TO  BU-DISPLAY-MSG
134000         MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (2)
134100         GO TO 2-BLOWUP.
134200     MOVE MPLTINFO-DATA        TO  P-SHIP-HDR-5,
134300                                   HDR5-DATA.
134400     IF PO-ALT-REMIT-INDIC = "X" OR COMPANY-SAVE = "126"
134500         MOVE "PA11"  TO  PLT-ARG
               MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I
               READ MPLTINFO-I INTO BUF-MPLTINFO
                   INVALID KEY MOVE "2" TO FILE-STATUS-1 END-READ
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
124600             MOVE "GET8 PLTINFO * 61-BP" TO  BU-DISPLAY-MSG
124700             MOVE PLT-ARG            TO  BU-DISPLAY-FLD (2)
124800             GO TO 2-BLOWUP
               ELSE
               IF COMPANY-SAVE = "126"
                   MOVE MPLTINFO-DATA TO P-SHIP-HDR-4
                   MOVE 1            TO  CTL
                   MOVE PRTWK-AREA   TO  PRNT-WORK-LINE
                   PERFORM 61-WRITE-PRNT-WORK-RCD
                   MOVE SPACES       TO  P-SHIP-HDR-5
               ELSE
                   MOVE MPLTINFO-DATA TO HDR5-DATA.
           MOVE 2                    TO  CTL.
135900     MOVE PO-VIA               TO  P-VIA.
136100     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
136200     PERFORM 61-WRITE-PRNT-WORK-RCD.
136300
136400     MOVE SPACES               TO  PRTWK-AREA.
136500
136600     IF COMPANY-SAVE = "629" OR "630"
136700         IF PETTY-PO-CHECK = "P"
136800             IF PO-MODIFIED-ORDER = "X"
136900                 MOVE MODIFIED-HEADING   TO  PO-HEAD
137000             ELSE
137100             IF PO-CANCELLED-ORDER = "X"
137200                 MOVE CANCELLED-HEADING  TO  PO-HEAD
137300             ELSE
137400             IF PO-PRINT-TYPE = "S"
137500                 MOVE RELEASE-HEADING    TO  PO-HEAD
137600             ELSE
137700             IF PO-INTERNAL-ORDER-INDIC = "X"
137800                 MOVE INTERNAL-HEADING   TO  PO-HEAD
137900             ELSE
138000                 MOVE USA-PO-HEADING     TO  PO-HEAD
138100         ELSE
138200             IF PO-PRINT-TYPE = "S"
138300                 MOVE RELEASE-HEADING  TO  PO-HEAD
138400             ELSE
138500             IF PO-INTERNAL-ORDER-INDIC = "X"
138600                 MOVE INTERNAL-HEADING TO  PO-HEAD
138700             ELSE
138800                 MOVE CAN-PO-HEADING   TO  PO-HEAD
138900     ELSE
139000         IF PO-MODIFIED-ORDER = "X"
139100             MOVE MODIFIED-HEADING   TO  PO-HEAD
139200         ELSE
139300         IF PO-CANCELLED-ORDER = "X"
139400             MOVE CANCELLED-HEADING  TO  PO-HEAD
139500         ELSE
139600         IF PO-PRINT-TYPE = "S"
139700             MOVE RELEASE-HEADING    TO  PO-HEAD
139800         ELSE
139900         IF PO-INTERNAL-ORDER-INDIC = "X"
140000             MOVE INTERNAL-HEADING   TO  PO-HEAD
140100         ELSE
140200             MOVE USA-PO-HEADING     TO  PO-HEAD.
140300
140400*******************************************
140500*
140600*   GET PAYMENT TERMS DESC. FOR PRINT
140700*   FROM MPLTINFO USING THE KEYS 'TMPn' AND
140800*   'TMDn' FOR DISCOUNT AMOUNT AND DUE DATE
140900*
141000*******************************************
141100
141200 61-GET-PAYMENT-TERMS.
141300     MOVE PO-TERMS-PCT          TO  BUILD-TM-DISCOUNT-VALUE.
141400     MOVE BUILD-TM-DISCOUNT-KEY TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
141500*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
141600*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
141700     IF COND-WORD NOT = 0
141800         IF COND-WORD = 17
141900             GO TO 61-CONT-MOVE-DATA-TO-PRINT
142000         ELSE
142100             MOVE "GET MPLTINFO1 * 61-GPT" TO BU-DISPLAY-MSG
142200             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
142300             GO TO 2-BLOWUP
142400     ELSE
142500         MOVE MPLTINFO-DISC-AMNT-DESC TO P-TERMS-PC.
142600
142700     MOVE PO-TERMS-DUE-DATE     TO  BUILD-TM-DATE-VALUE.
142800     MOVE BUILD-TM-DUE-DATE-KEY TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
142900*    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7,
143000*        STATUS-AREA, ALL-ITEMS, BUF-MPLTINFO, PLT-ARG.
143100     IF COND-WORD NOT = 0
143200         IF COND-WORD = 17
143300             MOVE SPACES        TO  P-TERMS-PC
143400             GO TO 61-CONT-MOVE-DATA-TO-PRINT
143500         ELSE
143600             MOVE "GET MPLTINFO2 * 61-GPT" TO BU-DISPLAY-MSG
143700             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
143800             GO TO 2-BLOWUP
143900     ELSE
144000         MOVE MPLTINFO-TMD-DESC       TO P-TERMS-DD.
144100
144200 61-CONT-MOVE-DATA-TO-PRINT.
144300     MOVE 1  TO  CTL.
144400     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
144500     PERFORM 61-WRITE-PRNT-WORK-RCD.
144600
144700     MOVE SPACES               TO  PRTWK-AREA.
           IF GAS-STRUCTURE-SW = "N"
144800         MOVE TERRITORY-SAVE   TO  P-TERR-NO
144900         MOVE PO-CO            TO  P-CO
145000         MOVE PO-PRIME         TO  P-PRIME
145100         MOVE PO-SUB           TO  P-SUB
145200         MOVE PO-SUB-DET       TO  P-SUB-DET
145300         MOVE PO-ADDL-DATA     TO  P-ADDL-DATA
           END-IF.
145400     MOVE PO-BUDGET-NUMBER     TO  P-BUDGT-NO.
145500     MOVE PO-BUDGET-AMT        TO  P-BUDGT-AMT.
145600     IF PO-VEN-CODE-T = "T"
145700         NEXT SENTENCE
145800     ELSE
145900         MOVE PO-VEN-CODE1-7   TO  P-VENDOR-CD
146000         MOVE PO-VEN-CODE8-10  TO  P-ORD-VEND.
146100     MOVE 2  TO  CTL.
146200     MOVE PRTWK-AREA           TO  PRNT-WORK-LINE.
146300     PERFORM 61-WRITE-PRNT-WORK-RCD.
146400
146500     MOVE PO-ADDL-INFO         TO  P-ADDL-INFO.
146600     IF PO-PRINT-TYPE = "S"
146700         MOVE SPACES           TO  P-ADDL-INFO.
146800     MOVE PO-FOR-DEPT          TO  P-FOR-DEPT.
146900
147000 61-GET-CURRENCY-DESC.
148500     MOVE SPACES               TO  CURRENCY-LIT-OUT.
147100     IF PO-CURRENCY-CODE = SPACES
147200         NEXT SENTENCE
147300     ELSE
147400         MOVE PO-CURRENCY-CODE  TO  UM-ARG
               MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I
               READ MVALIDUM-I INTO BUF-MVALIDUM
                   INVALID KEY MOVE 17 TO COND-WORD END-READ
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "READ MVALIDUM *61-GCD" TO BU-DISPLAY-MSG
                   MOVE UM-ARG TO BU-DISPLAY-FLD (2)
                   GO TO 2-BLOWUP
148400         ELSE
148500             MOVE VALID-CURRENCY-DESC  TO  CURRENCY-LIT-OUT.
148600
148700**********************
148800*                    *
148900* V E N D O R  DATA  *
149000* FOR PRINT PURPOSES *
149100**********************
149200
149300 61-VENDOR-INFO.
149400     MOVE SPACES            TO  BUILD-VENDOR-PRINT,
149500                                SAVE-FAX.

149600**********************************************
149700*                                            *
149800*   LOAD ADDL DATA AND FOR DEPT LINE INTO    *
149900*   THE FIRST LINE OF PAYTO AREA OF VENDOR   *
150000*   ADDRESS TABLE                            *
150100*                                            *
150200**********************************************
150300
150400     MOVE BUILD-ADDL-INFO-LINE  TO  PAYTO-VEN-INFO (1).
150500
150600 61-GET-ORDFRM.
150700     MOVE PO-VEN-CODE  TO  VEN-ARG,
150800                           SAVE-VENDOR-CODE.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
150900*    CALL "DBFIND" USING BASE, DSET-DVENDOR, MODE1, STATUS-AREA,
151000*           VEN-SEARCH, VEN-ARG.
151100     IF COND-WORD NOT = 0
151200         MOVE "FIND DVENDOR * 61-GO"  TO  BU-DISPLAY-MSG
151300         MOVE VEN-ARG                 TO  BU-DISPLAY-FLD (2)
151400         GO TO 2-BLOWUP.
151500     MOVE 0 TO VEN-SUB.
151600
151700 61-GET-ORDFRM-LOOP.
151800     ADD 1 TO VEN-SUB.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
151900*    CALL "DBGET" USING BASE, DSET-DVENDOR, MODE5, STATUS-AREA,
152000*        ALL-ITEMS, BUF-DVENDOR, VEN-ARG.
152100     IF COND-WORD NOT = 0
152200       IF COND-WORD = 15
152300         GO TO 61-GET-PAYTO
152400       ELSE
152500         MOVE "GET DVENDOR * 61-GOL"  TO  BU-DISPLAY-MSG
152600         MOVE VEN-ARG                 TO  BU-DISPLAY-FLD (2)
152700         GO TO 2-BLOWUP.
152800     IF VEN-ITM-NO < 7
152900         MOVE VEN-ITM-DATA TO ORDFRM-VEN-INFO (VEN-SUB)
153000         GO TO 61-GET-ORDFRM-LOOP
153100     ELSE
153200     IF VEN-ITM-NO = 7
      *
      * 920-FIND-POSITION RETURNS THE POSITION TO PRINT THE NEXT ITEM
      * IN PRINT-POSITION
      *
                   IF ZIP-BEFORE-CITY

      *
      * ZIP CITY
      *
                     SET SAVE-ZIP-BEFORE-CITY TO TRUE
                     MOVE VEN-ZIP TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-CITY
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-STATE-CODE TO SAVE-STATE-CODE
                     MOVE VEN-PROV-CODE TO SAVE-PROV-CODE

                   ELSE

      *
      * CITY STATE PROVINCE
      *
                     SET SAVE-ZIP-AFTER-COUNTRY TO TRUE
                     MOVE VEN-CITY TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-STATE-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-PROV-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-ZIP TO SAVE-ZIP

                   END-IF
                   MOVE FIND-POSITION TO ORDFRM-VEN-INFO(VEN-SUB)
                   GO TO 61-GET-ORDFRM-LOOP

154500     ELSE
154600     IF VEN-ITM-NO = 8
             IF SAVE-ZIP-BEFORE-CITY

      *
      * STATE PROV COUNTRY
      *
               MOVE SAVE-STATE-CODE TO FIND-POSITION
               PERFORM 920-FIND-POSITION
               STRING SAVE-PROV-CODE
                 DELIMITED BY SIZE INTO FIND-POSITION
                 WITH POINTER PRINT-POSITION
               PERFORM 920-FIND-POSITION
               STRING VEN-COUNTRY
                 DELIMITED BY SIZE INTO FIND-POSITION
                 WITH POINTER PRINT-POSITION

             ELSE

      *
      * COUNTRY ZIP
      *
               MOVE VEN-COUNTRY TO FIND-POSITION
               PERFORM 920-FIND-POSITION
               STRING SAVE-ZIP DELIMITED BY SIZE
                 INTO FIND-POSITION WITH POINTER PRINT-POSITION

             END-IF
             MOVE FIND-POSITION TO ORDFRM-VEN-INFO(VEN-SUB)
             GO TO 61-GET-ORDFRM-LOOP
           ELSE
           IF VEN-ITM-NO = 9
             GO TO 61-GET-ORDFRM-LOOP
           ELSE
           IF VEN-ITM-NO = 10
      *
      * GET FAX NO FOR ELECTRONIC FAXING OF PO
      *
             MOVE VEN-FAX TO SAVE-FAX

           END-IF.
155100
155200 61-GET-PAYTO.
155300     IF PO-VEN-CODE-T = "T"
155400         GO TO 61-PRINT-VEN-INFO.
155500     IF PO-VEN-CODE8-10 = ZERO
155600         GO TO 61-PRINT-VEN-INFO.
155700     MOVE ZEROS  TO  PO-VEN-CODE8-10.
155800     MOVE PO-VEN-CODE TO VEN-ARG.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           MOVE 0 TO COND-WORD.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
155900*    CALL "DBFIND" USING BASE, DSET-DVENDOR, MODE1, STATUS-AREA,
156000*           VEN-SEARCH, VEN-ARG.
156100     IF COND-WORD NOT = 0
156200         IF COND-WORD = 17
156300             MOVE 7                  TO  LANG-MSGNUM
156400             PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT
156500             MOVE MESSAGE-BUFFER     TO  PAYTO-VEN-INFO (1)
156600             GO TO 61-PRINT-VEN-INFO
156700         ELSE
156800             MOVE "FIND DVENDOR *61-GP" TO  BU-DISPLAY-MSG
156900             MOVE VEN-ARG               TO  BU-DISPLAY-FLD (2)
157000             GO TO 2-BLOWUP.
157100     MOVE 1 TO VEN-SUB.
157200
157300 61-GET-PAYTO-LOOP.
157400     ADD 1 TO VEN-SUB.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
157500*    CALL "DBGET" USING BASE, DSET-DVENDOR, MODE5, STATUS-AREA,
157600*        ALL-ITEMS, BUF-DVENDOR, VEN-ARG.
157700     IF COND-WORD NOT = 0
157800         IF COND-WORD = 15
157900             GO TO 61-PRINT-VEN-INFO
158000         ELSE
158100             MOVE "GET DVENDOR * 61-GPL" TO  BU-DISPLAY-MSG
158200             MOVE VEN-ARG                TO  BU-DISPLAY-FLD (2)
158300             GO TO 2-BLOWUP.
158400     IF VEN-ITM-NO < 7
158500          MOVE VEN-ITM-DATA TO PAYTO-VEN-INFO (VEN-SUB)
158600          GO TO 61-GET-PAYTO-LOOP
158700     ELSE
158800     IF VEN-ITM-NO = 7
      *
      * 920-FIND-POSITION RETURNS THE POSITION TO PRINT THE NEXT ITEM
      * IN PRINT-POSITION
      *
                   IF ZIP-BEFORE-CITY

      *
      * ZIP CITY
      *
                     SET SAVE-ZIP-BEFORE-CITY TO TRUE
                     MOVE VEN-ZIP TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-CITY
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-STATE-CODE TO SAVE-STATE-CODE
                     MOVE VEN-PROV-CODE TO SAVE-PROV-CODE

                   ELSE

      *
      * CITY STATE PROVINCE
      *
                     SET SAVE-ZIP-AFTER-COUNTRY TO TRUE
                     MOVE VEN-CITY TO FIND-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-STATE-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     PERFORM 920-FIND-POSITION
                     STRING VEN-PROV-CODE
                       DELIMITED BY SIZE INTO FIND-POSITION
                       WITH POINTER PRINT-POSITION
                     MOVE VEN-ZIP TO SAVE-ZIP

                   END-IF
                   MOVE FIND-POSITION TO PAYTO-VEN-INFO(VEN-SUB)
                   GO TO 61-GET-PAYTO-LOOP

154500     ELSE
154600     IF VEN-ITM-NO = 8
             IF SAVE-ZIP-BEFORE-CITY

      *
      * STATE PROV COUNTRY
      *
               MOVE SAVE-STATE-CODE TO FIND-POSITION
               PERFORM 920-FIND-POSITION
               STRING SAVE-PROV-CODE
                 DELIMITED BY SIZE INTO FIND-POSITION
                 WITH POINTER PRINT-POSITION
               PERFORM 920-FIND-POSITION
               STRING VEN-COUNTRY
                 DELIMITED BY SIZE INTO FIND-POSITION
                 WITH POINTER PRINT-POSITION

             ELSE

      *
      * COUNTRY ZIP
      *
               MOVE VEN-COUNTRY TO FIND-POSITION
               PERFORM 920-FIND-POSITION
               STRING SAVE-ZIP DELIMITED BY SIZE
                 INTO FIND-POSITION WITH POINTER PRINT-POSITION

             END-IF
             MOVE FIND-POSITION TO PAYTO-VEN-INFO(VEN-SUB)

           END-IF.
160700
160800 61-PRINT-VEN-INFO.
160900     MOVE 0 TO VEN-SUB.
161000
161100 61-PRINT-VEN-LOOP.
161200     ADD 1 TO VEN-SUB.
161300     IF (VEN-SUB > 9)
161400             OR (VEN-WRKAREA (VEN-SUB)) = SPACES
161500         GO TO 61-SET-SPACING.
161600     MOVE SPACES TO PRNT-WORK-LINE.
161700     MOVE 1 TO CTL.
161800     IF SW-VENDOR-ADDR-SW = "Y"
161900         MOVE ORDFRM-VEN-INFO (VEN-SUB) TO SAVE-VENDOR-ADDRESS
162000         MOVE PAYTO-VEN-INFO (VEN-SUB)
162100                                  TO ORDFRM-VEN-INFO (VEN-SUB)
162200         MOVE SAVE-VENDOR-ADDRESS     TO PAYTO-VEN-INFO (VEN-SUB).
162300     MOVE VEN-WRKAREA (VEN-SUB) TO PRNT-WORK-LINE.
162400     PERFORM 61-WRITE-PRNT-WORK-RCD.
162500     GO TO 61-PRINT-VEN-LOOP.
162600
162700 61-SET-SPACING.
           IF COMPANY-SAVE = "153"
               SUBTRACT VEN-SUB FROM 9 GIVING CTL
           ELSE
162800         SUBTRACT VEN-SUB FROM 10 GIVING CTL.
162900     MOVE SPACES TO PRNT-WORK-LINE.
163000     PERFORM 61-WRITE-PRNT-WORK-RCD.
163100
163200     MOVE SPACES               TO  PRTWK-AREA.
           IF SAVE-FAX-FIRST-CHAR = "+"
               IF COMPANY-SAVE = "153"
                   MOVE 1            TO  CTL
               ELSE
                   MOVE ZERO         TO  CTL
               END-IF
               MOVE SAVE-FAX-NO      TO  PRNT-WORK-LINE
               PERFORM 61-WRITE-PRNT-WORK-RCD.

           MOVE PO-BUYER-CODE        TO  BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
           MOVE PO-BUYER         TO  P-BUYER
           MOVE PO-TYPIST        TO  P-TYPIST
           IF COMPANY-SAVE = "173" OR "174" OR "129"
               MOVE COMP-PRT-SEQ TO  P-COMPRESS-10A
               MOVE PO-BUYER     TO  P-BUYERA
               MOVE "("          TO  P-PAREN1A
               MOVE BPN-18       TO  P-BUYER-PHNUMA
               MOVE ")"          TO  P-PAREN2A
               MOVE REG-PRT-SEQ  TO  P-NORMAL-10A
               MOVE PO-TYPIST    TO  P-TYPISTA.
163500     IF PO-REPRINT = "R"
               IF COMPANY-SAVE = "173" OR "174" OR "129"
163600             MOVE "R"      TO  P-REPRINT-FLAGA
               ELSE
               MOVE "R"          TO  P-REPRINT-FLAG.
163700     MOVE 1 TO CTL.
163800     MOVE PRTWK-AREA       TO  PRNT-WORK-LINE.
163900     PERFORM 61-WRITE-PRNT-WORK-RCD.
           MOVE SPACES           TO  PRNT-WORK-LINE,
                                     PRTWK-AREA.

      *---------- IF MODIFIED OR CANCELLED ORDER, WRITE LITERAL.
           IF PO-MODIFIED-ORDER = "X" OR PO-CANCELLED-ORDER = "X"
               IF PO-MODIFIED-ORDER = "X"
                   MOVE MODIFIED-HEADING   TO  MOD-CANC-LITERAL
               ELSE
                   MOVE CANCELLED-HEADING  TO  MOD-CANC-LITERAL
               END-IF
               MOVE 1                      TO  CTL
               MOVE MOD-CANC-LINE          TO  PRNT-WORK-LINE
               PERFORM 61-WRITE-PRNT-WORK-RCD
               MOVE SPACES                 TO  PRNT-WORK-LINE.

164000     GO TO 61-BP-X.
164100
164200 61-WRITE-PRNT-WORK-RCD.
164300     WRITE PRNT-WORK-RCD.
164400 61-WPWR-X.
164500     EXIT.
164600
164700 61-BP-X.
164800     EXIT.
164900
165000
165100 61-GET-STD-INST.
165200     MOVE SPACES           TO  STD-INST-SAVED.
165300
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-I.
           START DPODATAITM-I KEY = PORCVNO OF DPODATAITM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF COND-WORD = 17
               GO TO 61-GSI-X.
165400*    CALL "DBFIND" USING BASE, DSET-DPODATAITM, MODE1,
165500*        STATUS-AREA, PO-SEARCH, PO-ARG.
165600     IF COND-WORD NOT = 0
165700         MOVE "FIND DPODATAITM *61-GSI" TO BU-DISPLAY-MSG
165800         GO TO 2-BLOWUP.
165900
166300 61-GET-DPODATAITM.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-I NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
166400*    CALL "DBGET" USING BASE, DSET-DPODATAITM, MODE5,
166500*        STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM, PO-ARG.
166600     IF COND-WORD NOT = 0
166700         IF COND-WORD = 15
166800             GO TO 61-GSI-X
166900         ELSE
167000             MOVE "GET DPODATAITM *61-GD" TO BU-DISPLAY-MSG
167100             GO TO 2-BLOWUP.
167200
167300     IF DATAITM-LINE = "000001"
167400         MOVE DATAITM-INFO  TO  STD-INST-SAVED
167500     ELSE
167600     IF DATAITM-LINE > "000001"
167700         NEXT SENTENCE
167800     ELSE
167900         GO TO 61-GET-DPODATAITM.
168000
168100 61-GSI-X.
168200     EXIT.
168300
168400
168500 611-RIGHT-JUST-RLSE.
168600     ADD 1  TO  SUB1.
168700     IF SUB1 > 11
168800         GO TO 611-RJR-X.
168900     IF PO-NUMBER-CHAR (SUB1) = SPACES
169000         MOVE PO-NUMBER-CHAR (SUB2)  TO  PO-NUMBER-CHAR (SUB1)
169100         MOVE SPACES                 TO  PO-NUMBER-CHAR (SUB2)
169200         ADD 1  TO  SUB2
169300         IF SUB2 > 11
169400             GO TO 611-RJR-X.
169500     GO TO 611-RIGHT-JUST-RLSE.
169600
169700 611-RJR-X.
169800     EXIT.
169900
170000
170100 62-PRINT-ITEMS.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPODATAITM-REC-I.
           START DPODATAITM-I KEY = PORCVNO OF DPODATAITM-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
170200*    CALL "DBFIND" USING BASE, DSET-DPODATAITM, MODE1,
170300*        STATUS-AREA, PO-SEARCH, PO-ARG.
170400     IF COND-WORD NOT = ZERO
170500         MOVE "FIND DPODATAITM *62-PI"  TO  BU-DISPLAY-MSG
170600         GO TO 2-BLOWUP.
170700
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
170800*    CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1, STATUS-AREA,
170900*        PO-SEARCH, PO-ARG.
171000     IF COND-WORD NOT = ZERO
171100         MOVE "FIND DPOITEM * 62-PI"  TO  BU-DISPLAY-MSG
171200         GO TO 2-BLOWUP.
171700
171800     IF LINE-CTR > 51
171900         MOVE 27  TO  LINE-CTR
172000         ADD 1    TO  PAGE-CTR
172100     ELSE
172200     IF LINE-CTR > 47
172300         MOVE SPACES  TO  PRNT-WORK-LINE
172400         SUBTRACT LINE-CTR FROM 52 GIVING CTL
172500         MOVE 27  TO  LINE-CTR
172600         ADD 1    TO  PAGE-CTR
172700         WRITE PRNT-WORK-RCD.
172800     MOVE PRINT-ITEM-HDR  TO  PRNT-WORK-LINE.
172900     MOVE 2  TO  CTL.
173000     ADD CTL  TO  LINE-CTR.
173100     WRITE PRNT-WORK-RCD.
173200     MOVE 1                     TO  SUB1.
173300
173400 62-ITEM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
173500*    CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5, STATUS-AREA,
173600*        ALL-ITEMS, BUF-DPOITEM, PO-ARG.
173700     IF COND-WORD NOT = ZERO
173800         IF COND-WORD = 15
173900             GO TO 62-PI-X
174000         ELSE
174100             MOVE "GET DPOITEM * 62-IL" TO BU-DISPLAY-MSG
174200             GO TO 2-BLOWUP.
174300
174400*************************************************************
174500**   CHECK IF USER WANTS TO PRINT ONLY SELECTED ITEMS FROM  *
174600**    THIS P.O.                                             *
174700*************************************************************
174800
174900 62-CHECK-FOR-ITEMS.
175000     IF PRINT-SPECIFIC-ITEMS-SW = "Y"
             IF SUB1 > 15
               GO TO 62-PI-X
             ELSE
175100         IF PO-ITEM (SUB1) = ITM-NUMBER
175200             ADD 1                TO  SUB1
175300         ELSE
175400         IF PO-ITEM (SUB1) > ITM-NUMBER
175500             GO TO 62-ITEM-LOOP
175600         ELSE
175700             ADD 1                TO  SUB1
175800             IF SUB1 > 15
175900                 GO TO 62-PI-X
176000             ELSE
176100                 GO TO 62-CHECK-FOR-ITEMS.
176200
176300     MOVE SPACES                      TO  PRTWK-AREA.
176400     MOVE ITM-NUMBER                  TO  PRTWK-ITEM-NO.
176500     MOVE ITM-QTY-ORD                 TO  WORK-QTY-ORD.
176600     IF FOREIGN-DECIMAL-SW = "Y"
176700         IF WORK-QTY-ORD-D  =  ZERO
176800             MOVE WORK-QTY-ORD-W      TO  PRTWK-QTY-FOR-WHL
176900         ELSE
177000             MOVE WORK-QTY-ORD        TO  PRTWK-QTY-FOR-DEC
177100             INSPECT PRTWK-QTY-SPACE
177200                 REPLACING ALL "." BY ","
177300     ELSE
177400         IF WORK-QTY-ORD-D  =  ZERO
177500             MOVE WORK-QTY-ORD-W      TO  PRTWK-QTY-FOR-WHL
177600         ELSE
177700             MOVE WORK-QTY-ORD        TO  PRTWK-QTY.
177800
177900     IF ITM-UNIT-PRICE  =  ZERO
178000         MOVE SPACES                  TO  PRTWK-PRICE-SPACE
178100     ELSE
178200         MOVE ITM-UNIT-PRICE          TO  PRTWK-PRICE.
178300
178400     PERFORM 66-FORMAT-PRICE  THRU  66-FP-X.
178500
178600******
178700**  FOR PRICE AND QUANTITY UM, IF THE UM DOES NOT EXIST IN
178800**  "MVALIDUM", WE WILL USE THE ABBREVIATION OF UM FROM THE P.O.
178900******
179000     MOVE ITM-UM                  TO UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
179100*    CALL "DBGET" USING BASE, DSET-MVALIDUM, MODE7, STATUS-AREA,
179200*        ALL-ITEMS, BUF-MVALIDUM, UM-ARG.
179300     IF COND-WORD = 17
179400         MOVE UM-ARG              TO  VALID-UM-DESC
179500     ELSE
179600     IF COND-WORD NOT = ZERO
179700         MOVE "GET MVALIDUM * 62-LPF"  TO  BU-DISPLAY-MSG
179800         MOVE UM-ARG                   TO  BU-DISPLAY-FLD (2)
179900         GO TO 2-BLOWUP.
180000
180100******
180200**  THE DESCRIPTION OF THE 2 DIGIT UM IS MOVED TO THE
180300**     QUANTITY-UM OF THE PRINTLINE
180400******
180500     MOVE VALID-UM-DESC           TO  PRTWK-QTY-UM.
180600
180700******
180800** THE PRICE UM IS CHECKED AGAINST THE DATABASE
180900******
181000
181100     MOVE ITM-PRICE-UM            TO  UM-ARG.
           MOVE 0 TO COND-WORD.
           MOVE UM-ARG TO VALIDUM OF MVALIDUM-REC-I.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
181200*    CALL "DBGET" USING BASE, DSET-MVALIDUM, MODE7, STATUS-AREA,
181300*        ALL-ITEMS, BUF-MVALIDUM, UM-ARG.
181400     IF COND-WORD = 17
181500         MOVE UM-ARG              TO  VALID-UM-DESC
181600     ELSE
181700     IF COND-WORD NOT = ZERO
181800         MOVE "GET2 MVALIDUM * 62-LPF" TO BU-DISPLAY-MSG
181900         MOVE UM-ARG                   TO  BU-DISPLAY-FLD (2)
182000         GO TO 2-BLOWUP.
182100******
182200**  THE DESCRIPTION OF THE 2 DIGIT UM IS MOVE TO THE
182300**     UNIT-PRICE-UM OF THE PRINTLINE
182400******
182500     MOVE VALID-UM-DESC           TO  PRTWK-PRICE-UM.
182600     MOVE 1                       TO  CTL.
182700     MOVE PRTWK-AREA              TO  PRNT-WORK-LINE.
182800     PERFORM 621-WRITE-PRT-WORK-RCD.
182900
183000***********************************************
183100**  IF THIS IS A NON-CODED ITEM THAN SKIP
183200**  CALL TO 'CDESC'.
183300***********************************************
183400
183500     IF ITM-CORP-CODE = "NON-STR"
183600         GO TO 62-DPODATAITM-LOOP.
183700
183800***********************************************
183900*                                             *
184000*   CALL 'CDESC' TO PRINT CORP-CODE DESC      *
184100*   CHECK DPOITEM TO SEE IF THE USER          *
184200*   SPECIFIED SECONDARY DESC.                 *
184300*   (ITM-SECOND-DESC-INDIC='X') BEFORE        *
184400*   CALLING 'CDESC'                           *
184500*                                             *
184600***********************************************
184700
184800
184900 62-CODE-DESC.
185000     MOVE SPACES                  TO  PRTWK-AREA.
185100     MOVE COMP-PRT-SEQ            TO  PRTWK-FUNC1.
185200     MOVE REG-PRT-SEQ             TO  PRTWK-FUNC2.
185300     MOVE ITM-CORP-CODE           TO  CODE-ARG.
185400     IF ITM-SECOND-DESC-INDIC  =  "X"
185500         MOVE "S"                 TO  CDESC-LANGUAGE-OPTION
185600     ELSE
185700         MOVE "P"                 TO  CDESC-LANGUAGE-OPTION.
185800     CALL "CDESC" USING RET-CODE,
185900                        BASE,
186000                        STATUS-AREA,
186100                        BU-DISPLAY-MSG,
186200                        CODE-ARG,
186300                        CDESC-DATA.
186400     IF BU-DISPLAY-MSG-1  NOT = SPACES
186500         MOVE CODE-ARG            TO  BU-DISPLAY-FLD (2)
186600         GO TO 2-BLOWUP.
186700     MOVE ZEROS                   TO  SUB.
186800
186900 62-DESC-LOOP.
187000     ADD 1                        TO  SUB.
187100     IF SUB > CDESC-LINES-GOT
187200         GO TO 62-DPODATAITM-LOOP.
187300     MOVE CDESC (SUB)             TO  PRTWK-DESC-LINE.
187400     MOVE 1                       TO  CTL.
187500     MOVE PRTWK-DESC              TO  PRNT-WORK-LINE.
187600     PERFORM 621-WRITE-PRT-WORK-RCD.
187700     GO TO 62-DESC-LOOP.
187800
187900**************************************************************
188000**  A CHECK IS MADE HERE FOR THE DPODATAITM SEGMENT.
188100**************************************************************
188200
188300 62-DPODATAITM-LOOP.
188400     IF DATAITM-READY-SW = "Y"
188500         MOVE SPACES              TO  DATAITM-READY-SW
188600         GO TO 62-CONT-DPODATAITM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DPODATAITM-I NEXT INTO BUF-DPODATAITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPODATAITM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
188700*    CALL "DBGET" USING BASE, DSET-DPODATAITM, MODE5,
188800*        STATUS-AREA, ALL-ITEMS, BUF-DPODATAITM, PO-ARG.
188900     IF COND-WORD NOT = ZERO
189000         IF COND-WORD = 15
189100             MOVE 9999  TO  DATAITM-ITEM-NO
189200             GO TO 62-PRINT-ZBILL-ITEM-VALUE
189300         ELSE
189400             MOVE "GET DPODATAITM *62-DL"  TO  BU-DISPLAY-MSG
189500             GO TO 2-BLOWUP.
189600
189700 62-CONT-DPODATAITM-LOOP.
189800     IF DATAITM-ITEM-NO < ITM-NUMBER
189900         MOVE SPACE TO DATAITM-READY-SW
190000         GO TO 62-DPODATAITM-LOOP
190100     ELSE
190200     IF DATAITM-ITEM-NO > ITM-NUMBER
190300         MOVE "Y"                 TO DATAITM-READY-SW
190400         GO TO 62-PRINT-ZBILL-ITEM-VALUE
190500     ELSE
190600*****************************************************
190700**   WHEN A DESCRIPTION LINE FOR THE ITEM CONTAINS
190800**   AN '@' IN THE FIRST COLUMN THIS DENOTES LOCAL
190900**   OR INTERNAL DESCRIPTION AND THEREFORE IT WILL
191000**   BE SKIPPED WHEN PRINTING THE ITEM ON A PO
191100*****************************************************
191200         IF DATAITM-INFO-FIRST-CHAR = "@"
191300             GO TO 62-DPODATAITM-LOOP
191400         ELSE
191500             MOVE SPACES          TO  PRTWK-AREA
191600             MOVE COMP-PRT-SEQ    TO  PRTWK-FUNC1
191700             MOVE REG-PRT-SEQ     TO  PRTWK-FUNC2
191800             MOVE DATAITM-INFO    TO  PRTWK-DESC-LINE
191900             MOVE 1               TO  CTL
192000             MOVE PRTWK-DESC      TO  PRNT-WORK-LINE
192100             PERFORM 621-WRITE-PRT-WORK-RCD
192200             GO TO 62-DPODATAITM-LOOP.
192300
192400 62-PRINT-ZBILL-ITEM-VALUE.
192500     IF PO-IS-Z-BILL
192600         MOVE SPACES           TO  PRTWK-AREA
192700         MOVE COMP-PRT-SEQ     TO  PRTWK-FUNC1
192800         MOVE REG-PRT-SEQ      TO  PRTWK-FUNC2
192900         MOVE UNIT-VALUE-LIT   TO  PRTWK-VALUE-LIT
193000         MOVE ITM-ZBILL-VALUE  TO  PRTWK-ITEM-VALUE
193100         PERFORM 66-FORMAT-UNIT-VALUE  THRU  66-FUV-X
193200         MOVE 1                TO  CTL
193300         MOVE PRTWK-DESC       TO  PRNT-WORK-LINE
193400         PERFORM 621-WRITE-PRT-WORK-RCD.
193500
       62-PRINT-DCOMPL.
           IF PRINT-DCOMPL-SW = "Y"
               MOVE ITM-CORP-CODE  TO  CCRQDESC-CODE
               MOVE SPACES         TO  CCRQDESC-LINES
               CALL "CCRQDESC" USING CCRQDESC-PARMS
           ELSE
               GO TO 62-PRINT-ACCTG-INFO.
           IF CCRQDESC-LINES = SPACES
               GO TO 62-PRINT-ACCTG-INFO.
           PERFORM VARYING SUB FROM 1 BY 1
                   UNTIL CCRQDESC-LINE (SUB) = SPACES OR
                            SUB > 6
               MOVE CCRQDESC-LINE (SUB)     TO  PRTWK-DESC-LINE
               MOVE PRTWK-DESC              TO  PRNT-WORK-LINE
               MOVE 1                       TO  CTL
               PERFORM 621-WRITE-PRT-WORK-RCD
           END-PERFORM.

193600 62-PRINT-ACCTG-INFO.
193700     IF ITM-CLASS NOT = SPACES
193800         NEXT SENTENCE
193900     ELSE
194000     IF ITM-CORP-CODE = "NON-STR"
194100         NEXT SENTENCE
194200     ELSE
194300         MOVE ITM-CORP-CODE           TO  CODE-ARG
               MOVE 0 TO COND-WORD
               MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I
               READ MSTORERM-I INTO BUF-MSTORERM
                   INVALID KEY MOVE "2" TO FILE-STATUS-1 END-READ
               IF FILE-STATUS NOT = "00"
194700             MOVE "READ MSTORERM * 62-PAI" TO  BU-DISPLAY-MSG
194800             GO TO 2-BLOWUP
               ELSE
                   MOVE STR-CLASS  TO ITM-CLASS.
195100
195200********************************************************
195300**    PRINT ACCOUNTING INFO FOR THE ITEM
195400********************************************************
195500     MOVE ITM-CLASS               TO  PRT-SUB-ITM
                                            PRT-SUB-ITM-L.
195600     MOVE ITM-SUB-DETL            TO  PRT-SUBD-ITM
                                            PRT-SUBD-ITM-L.
195700     MOVE ITM-ADDL-DATA           TO  PRT-ADDTL-DATA-ITM
                                            PRT-ADDTL-DATA-ITM-L.
           IF GAS-STRUCTURE-SW = "N"
               MOVE ITEM-ACCTG-DATA-LINE TO PRTWK-DESC-LINE
           ELSE
               MOVE ITM-COMPANY             TO  PRT-CO-ITM-L
               MOVE ITM-PRIME               TO  PRT-PRM-ITM-L
               MOVE ITEM-ACCTG-DATA-LINE-L   TO  PRTWK-DESC-LINE
           END-IF.
           MOVE 1                       TO  CTL.
195900     MOVE PRTWK-DESC              TO  PRNT-WORK-LINE.
196000     PERFORM 621-WRITE-PRT-WORK-RCD.
196100
       62-PRINT-CHAT-INFO.
           IF SAVE-CHAT-SW = "Y"
               NEXT SENTENCE
           ELSE
           GO TO 62-PRINT-STD-INST.
           IF ITM-CORP-CODE = "        " OR "NON-STR "
               GO TO 62-PRINT-STD-INST.
           IF ITM-CHAT-NO = "      " GO TO 62-PRINT-STD-INST.
           MOVE ITM-CORP-CODE           TO CORPCDE OF DCHATNO.
           START DCHATNO KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 62-PRINT-STD-INST.
       62-PCI-LOOP.
           READ DCHATNO NEXT INTO BUF-DCHATNO
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 62-PRINT-STD-INST.
           IF ITM-CHAT-NO NOT = CHAT-CHAT-NO GO TO 62-PCI-LOOP.
           MOVE ITM-CHAT-NO             TO  PRT-CHATNO.
           MOVE CHAT-MFR                TO  PRT-CHAT-MFR.
           MOVE CHAT-TRADE              TO  PRT-CHAT-TRADE.
           MOVE CHAT-INFO-LINE          TO  PRTWK-DESC-LINE.
           MOVE 1                       TO  CTL.
195900     MOVE PRTWK-DESC              TO  PRNT-WORK-LINE.
196000     PERFORM 621-WRITE-PRT-WORK-RCD.

196200 62-PRINT-STD-INST.
196300     IF ITM-STD-INST = SPACES
196400         NEXT SENTENCE
196500     ELSE
196600         MOVE ITM-STD-INST        TO  PO-STD-INSTRUCTIONS
196700         PERFORM 64-PRINT-STD-INST  THRU  64-PSI-X.
196800
196900 62-PRINT-TAX-CODE.
197000     IF PRINT-TAX-CODES-ITEM-SW = "Y"
197100         MOVE ITM-TAX-CODE      TO  BUILD-TAX-NO
197200         PERFORM 641-PRINT-TAX-MSG  THRU 641-PTM-X.
197300
197400 62-PRINT-CORP-CODE.
197500     IF ITM-CORP-CODE = "NON-STR"
197600         MOVE SPACES              TO  PRNT-WORK-LINE
197700         MOVE 1                   TO  CTL
197800     ELSE
197900         MOVE ITM-CORP-CODE       TO  PRINT-CORP-CODE
198000         MOVE PRINT-HDR-LAST      TO  PRNT-WORK-LINE
198100         MOVE 2                   TO  CTL.
198200     PERFORM 621-WRITE-PRT-WORK-RCD.
198300
198400     GO TO 62-ITEM-LOOP.
198500
198600 62-PI-X.
198700     EXIT.
198800
198900
199000 621-WRITE-PRT-WORK-RCD.
199100     IF LINE-CTR > 51
199200         MOVE 27                    TO  LINE-CTR
199300         ADD 1                      TO  PAGE-CTR
199400         MOVE PRNT-WORK-RCD         TO  SAVE-PRNT-WORK-RCD
      *---------- IF MODIFIED OR CANCELLED ORDER, WRITE LITERAL.
               IF PO-MODIFIED-ORDER = "X" OR PO-CANCELLED-ORDER = "X"
                   IF PO-MODIFIED-ORDER = "X"
                       MOVE MODIFIED-HEADING   TO  MOD-CANC-LITERAL
                   ELSE
                       MOVE CANCELLED-HEADING  TO  MOD-CANC-LITERAL
                   END-IF
                   MOVE 1                 TO  CTL
                   MOVE MOD-CANC-LINE     TO  PRNT-WORK-LINE
                   WRITE PRNT-WORK-RCD
                   ADD 1                  TO  LINE-CTR
               END-IF
199500         MOVE PRINT-ITEM-HDR        TO  PRNT-WORK-LINE
199600         MOVE 2                     TO  CTL
199700         ADD CTL                    TO  LINE-CTR
199800         WRITE PRNT-WORK-RCD
199900         MOVE SAVE-PRNT-WORK-RCD    TO  PRNT-WORK-RCD.
200000     ADD CTL                        TO  LINE-CTR.
200100     WRITE PRNT-WORK-RCD.
200200 621-WPR-X.
200300     EXIT.
200400
200500
200600
200700 64-TAX-MSG.
200800
200900*********************************************
201000*                                           *
201100*   CONFIRMING ORDER PRINT OUT              *
201200*   PRINT CONFIRMING ORDER LITERAL AND IF   *
201300*   FREE VERBAGE EXIST PRINT IT ON THE NEXT *
201400*   LINE                                    *
201500*                                           *
201600*********************************************
201700
201800
201900     IF SAVE-CONFIRM-FLAG = "X"
202000         NEXT SENTENCE
202100     ELSE
202200         GO TO 64-WRITE-TAX-MSG.

      *--------- IF MODIFIED OR CANCELLED ORDER, DON'T PRINT
      *--------- "CONFIRMING ORDER" LITERAL.
           IF PO-MODIFIED-ORDER = "X" OR PO-CANCELLED-ORDER = "X"
               GO TO 64-WRITE-TAX-MSG.

202300     IF SAVE-CONFIRM-VERBAGE  NOT = SPACES
202400         MOVE 1                         TO  CTL
202500     ELSE
202600         MOVE 2                         TO  CTL.
202700     MOVE 16                      TO  LANG-MSGNUM.
202800     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
202900     MOVE MESSAGE-BUFFER          TO  PRT-CONFIRM-LIT.
203000     MOVE CONFIRMING-ORDER-LIT    TO  PRINT-WORKAREA.
203100     MOVE PRINT-WORKAREA          TO  PRNT-WORK-LINE.
203200     PERFORM 641-WRITE-PRT-WORK-RCD.
203300     IF SAVE-CONFIRM-VERBAGE  NOT = SPACES
203400         MOVE SAVE-CONFIRM-VERBAGE      TO  CONFIRMING-VERB-OUT
203500         MOVE 1                         TO  CTL
203600         MOVE CONFIRMING-ORDER-LIT2     TO  PRINT-WORKAREA
203700         MOVE PRINT-WORKAREA            TO  PRNT-WORK-LINE
203800         PERFORM 641-WRITE-PRT-WORK-RCD.
203900
204000
204100 64-WRITE-TAX-MSG.
204200     IF PRINT-TAX-CODES-ITEM-SW = "Y"
204300         GO TO 64-TM-X.
204400     IF SAVE-ITEM-TAX-CODE  =  " N" OR "  " OR "NO"
204500         GO TO 64-TM-X.
204600     MOVE 1                          TO  CTL.
204700     MOVE SPACES                     TO  PRNT-WORK-LINE.
204800     PERFORM 641-WRITE-PRT-WORK-RCD.
204900     MOVE SAVE-ITEM-TAX-CODE         TO  BUILD-TAX-NO.
205000     PERFORM 641-PRINT-TAX-MSG  THRU  641-PTM-X.
205100
205200
205300 64-TM-X.
205400     EXIT.
205500
205600 64-MOD-ORD-MSG.
205700     MOVE 2                          TO  CTL.
205800     MOVE 17                         TO  LANG-MSGNUM.
205900     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
206000     MOVE MESSAGE-BUFFER             TO  PRT-MOD-LIT.
206100     MOVE MODIFIED-ORD-LIT-1         TO  PRNT-WORK-LINE.
206200     PERFORM 641-WRITE-PRT-WORK-RCD.
206300     MOVE 1                          TO  CTL.
206400     MOVE 18                         TO  LANG-MSGNUM.
206500     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
206600     MOVE MESSAGE-BUFFER             TO  PRT-DONT-DUP-LIT.
206700     MOVE MODIFIED-ORD-LIT-2         TO  PRNT-WORK-LINE.
206800     PERFORM 641-WRITE-PRT-WORK-RCD.
206900
207000 64-MOD-M-X.
207100     EXIT.
207200
      *--------- "ORDER CANCELLED" MESSAGE.
       64-CAN-ORD-LIT.
           MOVE 2                          TO  CTL.
           MOVE 26                         TO  LANG-MSGNUM.
           PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER             TO  PRT-CANC-LIT.
           MOVE CANCELLED-ORD-LIT-A        TO  PRNT-WORK-LINE.
           PERFORM 641-WRITE-PRT-WORK-RCD.

       64-COL-X.
           EXIT.

207300 64-CAN-ORD-MSG.
207400     MOVE 1                          TO  CTL.
207500     PERFORM 999-CATREAD  THRU  999-CATREAD-EXIT.
207600     MOVE MESSAGE-BUFFER             TO  PRT-CAN-LIT.
207700     MOVE CANCELLED-ORD-LIT          TO  PRNT-WORK-LINE.
207800     PERFORM 641-WRITE-PRT-WORK-RCD.
207900
208000 64-COM-X.
208100     EXIT.
208200
208300
208400
208500***************************************
208600*                                     *
208700*  WRITE ALL COMMENTS ENTERED ON THE  *
208800*  P.O.                               *
208900*                                     *
209000***************************************
209100
209200 64-PRINT-STD-INST.
209300     MOVE 0  TO  SUB.
209400
209500 64-FIND-DCOMMENT-TO-PRINT.
209600     ADD 1  TO SUB.
209700     IF SUB  >  8
209800         GO TO 64-PSI-X.
209900     IF PO-STD-INST (SUB)  = SPACES
210000         GO TO 64-FIND-DCOMMENT-TO-PRINT.
210100
210200     MOVE PO-STD-INST (SUB)          TO  BUILD-COM-NO.
210300     MOVE BUILD-COMMENT-NO           TO  COMMENT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-I.
           START DCOMMENT-I KEY = MCOMCOMMNT OF DCOMMENT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
210400*    CALL "DBFIND" USING BASE, DSET-DCOMMENT, MODE1,
210500*        STATUS-AREA, COMMENT-SEARCH, COMMENT-ARG.
210600     IF COND-WORD NOT = 0
210700         IF COND-WORD = 17
210800             GO TO 64-FIND-DCOMMENT-TO-PRINT
210900         ELSE
211000             MOVE "FIND DCOMMENT *64-FDTP"
211100                 TO BU-DISPLAY-MSG
211200             MOVE COMMENT-ARG        TO  BU-DISPLAY-FLD (2)
211300             GO TO 2-BLOWUP.
211400     MOVE 1                          TO  CTL.
211500     MOVE SPACES                     TO  PRNT-WORK-LINE.
211600     PERFORM 641-WRITE-PRT-WORK-RCD.
211700
211800 64-GET-DCOMMENT.
           MOVE 0 TO COND-WORD.
           READ DCOMMENT-I NEXT INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF MCOMCOMMNT OF DCOMMENT-REC-I NOT = COMMENT-ARG
               MOVE 15 TO COND-WORD.
211900*A   CALL "DBGET" USING BASE, DSET-DCOMMENT, MODE5,
212000*A       STATUS-AREA, ALL-ITEMS, BUF-DCOMMENT, COMMENT-ARG.
212100     IF COND-WORD NOT = 0
212200         IF COND-WORD = 15
212300             GO TO 64-FIND-DCOMMENT-TO-PRINT
212400         ELSE
212500             MOVE "GET DCOMMENT *64-GD" TO  BU-DISPLAY-MSG
212600             MOVE COMMENT-ARG           TO  BU-DISPLAY-FLD (2)
212700             GO TO 2-BLOWUP.
212800
212900     MOVE 1                       TO  CTL.
213000     MOVE SPACES                  TO  PRTWK-AREA.
           IF EXP-PRT-START = "*EXP*"
               MOVE EXP-PRT-SEQ         TO  PRTWK-STD-INST-EXP-START
               MOVE EXP-DATA-COMMENT    TO  PRTWK-STD-INST-EXP
               MOVE DBL-WIDE-OFF-SEQ    TO  PRTWK-STD-INST-EXP-END
           ELSE
           IF EXP-PRT-START = "*CMP*"
               MOVE COMP-PRT-SEQ        TO  PRTWK-STD-INST-COMP-START
               MOVE COMP-DATA-COMMENT   TO  PRTWK-STD-INST-COMP
               MOVE REG-PRT-SEQ         TO  PRTWK-STD-INST-COMP-END
           ELSE
213100         MOVE DCOM-DATA-LINE      TO  PRTWK-STD-INST.
213200     MOVE PRTWK-STD-INST-LINE     TO  PRNT-WORK-LINE.
213300     PERFORM 641-WRITE-PRT-WORK-RCD.
213400     GO TO 64-GET-DCOMMENT.
213500
213600 64-PSI-X.
213700     EXIT.
213800
213900
214000 641-PRINT-TAX-MSG.
214100     IF BUILD-TAX-NO = "  " OR " N" OR "NO"
214200         GO TO 641-PTM-X.
214300     MOVE BUILD-TAX-CODE            TO  COMMENT-ARG.
214500     MOVE SPACES                    TO  PRTWK-AREA.
           MOVE 0 TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-I.
           START DCOMMENT-I KEY = MCOMCOMMNT OF DCOMMENT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
214600*A   CALL "DBFIND" USING BASE, DSET-DCOMMENT, MODE1,
214700*A       STATUS-AREA, COMMENT-SEARCH, COMMENT-ARG.
214800     IF COND-WORD NOT = 0
214900         IF COND-WORD = 17
215000             GO TO 641-PTM-X
215100         ELSE
215200             MOVE "FIND DCOMMENT * 641-PTM" TO  BU-DISPLAY-MSG
215300             MOVE COMMENT-ARG             TO  BU-DISPLAY-FLD (2)
215400             GO TO 2-BLOWUP.
215500
           MOVE 1                     TO  CTL.
215600     MOVE SPACES                TO  PRNT-WORK-LINE.
215700     PERFORM 641-WRITE-PRT-WORK-RCD.
215800
215900 641-GET-TAX-DESC.
           MOVE 0 TO COND-WORD.
           READ DCOMMENT-I NEXT INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF MCOMCOMMNT OF DCOMMENT-REC-I NOT = COMMENT-ARG
               MOVE 15 TO COND-WORD.
216000*A   CALL "DBGET" USING BASE, DSET-DCOMMENT, MODE5,
216100*A       STATUS-AREA, ALL-ITEMS, BUF-DCOMMENT, COMMENT-ARG.
216200     IF COND-WORD NOT = 0
216300         IF COND-WORD = 15
216400             GO TO 641-PTM-X
216500         ELSE
216600             MOVE "GET DCOMMENT * 641-GTD" TO BU-DISPLAY-MSG
216700             MOVE COMMENT-ARG              TO BU-DISPLAY-FLD (2)
216800             GO TO 2-BLOWUP.

           MOVE 1                 TO  CTL.
           MOVE SPACES            TO  PRTWK-TAX-MSG.
           IF EXP-PRT-START = "*EXP*"
               MOVE EXP-PRT-SEQ      TO  PRTWK-TAX-DESC-EXP-START
               MOVE EXP-DATA-COMMENT TO  PRTWK-TAX-DESC-EXP
               MOVE DBL-WIDE-OFF-SEQ TO  PRTWK-TAX-DESC-EXP-END
           ELSE
217000         MOVE DCOM-DATA-LINE   TO  PRTWK-TAX-DESC.
217100     MOVE PRTWK-TAX-MSG        TO  PRNT-WORK-LINE.
217200     PERFORM 641-WRITE-PRT-WORK-RCD.
217300     GO TO 641-GET-TAX-DESC.
217400
217500 641-PTM-X.
217600     EXIT.
217700
217800 641-WRITE-PRT-WORK-RCD.
217900     IF LINE-CTR > 51
218000         MOVE 27    TO  LINE-CTR
218100         ADD 1      TO  PAGE-CTR.
218200     ADD CTL        TO  LINE-CTR.
218300     WRITE PRNT-WORK-RCD.
218400 641-WPR-X.
218500     EXIT.
218600
218700
218800**********************
218900*                    *
219000* P R I N T - R T N S*
219100*                    *
219200**********************
219300
219400
219500 65-MAIN.
219600     MOVE SPACES                     TO  END-PRT-SW.
           MOVE SPACES                     TO  PRINT-RCD.
219700     PERFORM 650-READWORK.
219800     IF END-PRT-SW = "Y"
219900         GO TO 65-MAIN-X.
220000     MOVE PAGE-CTR                   TO  PG-TO.
220100     MOVE ZERO                       TO  PAGE-CTR.
220200     PERFORM 652-HEADER.
220300     MOVE PRNT-WORK-LINE             TO  PRINT-LINE.
220400     MOVE CTL                        TO  LINE-ADV.
220500     PERFORM 651-PRINTALINE.
220600
220700 65-PRNT-LOOP.
220800     PERFORM 650-READWORK.
220900     IF END-PRT-SW = "Y"
      *----------- IF AUSTRALIAN PLANT, PRINT BUYER NAME AND DATE AT
      *----------- END OF THE PAGE.  THIS IS THE LAST PAGE OF THE PO.
               IF PRINT-PO-FOOTER-SW = "Y"
                   PERFORM 65-PRINT-FOOTER
               END-IF
221000         GO TO 65-MAIN-X.
221100     IF LINE-CTR > 51
      *----------- IF AUSTRALIAN PLANT, PRINT BUYER NAME AND DATE AT
      *----------- END OF THE PAGE.
               IF PRINT-PO-FOOTER-SW = "Y"
                   PERFORM 65-PRINT-FOOTER
               END-IF
221200         PERFORM 654-CONT-HDR THRU 654-C-H-X
221300     ELSE
221400       IF LINE-CTR > 26
221500         NEXT SENTENCE
221600     ELSE
221700       IF LINE-CTR < 7
221800         MOVE PRNT-WORK-LINE         TO  PRNT-LINE1-SAVE
221900     ELSE
222000       IF LINE-CTR < 18
222100         MOVE PRNT-WORK-LINE         TO  VEND-NAME-SAVE
222200     ELSE
222300       IF LINE-CTR < 27
222400         MOVE PRNT-WORK-LINE         TO  BUYER-TYP-SAVE.
222500     MOVE CTL                        TO  LINE-ADV.
222600     MOVE PRNT-WORK-LINE             TO  PRINT-LINE.
222700     PERFORM 651-PRINTALINE.
222800     GO TO 65-PRNT-LOOP.
222900
223000 65-MAIN-X.
223100     EXIT.
223200
      *----- THIS PARAGRAPH PRINTS THE BUYER NAME AND DATE AT THE END
      *----- OF THE PURCHASE ORDER.
       65-PRINT-FOOTER.
           PERFORM UNTIL LINE-CTR = 60
               MOVE 1                      TO  LINE-ADV
               MOVE SPACES                 TO  PRINT-LINE
               PERFORM 651-PRINTALINE
           END-PERFORM.
           MOVE PO-BUYER             TO  P-BUYER-NAME.
           MOVE 2 TO LINE-ADV.
           MOVE PO-BUYER-LINE        TO  PRINT-LINE.
           PERFORM 651-PRINTALINE.
           MOVE 1 TO LINE-ADV.
           MOVE PO-DATE-LINE         TO  PRINT-LINE.
           PERFORM 651-PRINTALINE.

223300 650-READWORK.
223400     READ PRNT-WORK-FILE
223500         AT END MOVE "Y"             TO  END-PRT-SW.
      *    DISPLAY "PRNT-WORK FILE = " PRNT-WORK-RCD.
223600
223700 651-PRINTALINE.
223800     WRITE PRINT-RCD BEFORE ADVANCING LINE-ADV.
223900     ADD LINE-ADV                    TO  LINE-CTR.
224000
224100 652-HEADER.
224200
224300* * * * * * * * * * * * * * * * * * * * * * * * * * * *
224400* CHECK IF JCW INDICATES OKI (1) OR HP (0) PRINTERS.  *
224500* IF OKI, DON'T START A NEW PAGE.  OKI PRINTERS       *
224600* ARE SPOOLED THRU THE SYSTEM SPOOLER SO A PAGE IS    *
224700* AUTOMATICALLY ADVANCED BETWEEN PO PRINTOUTS.        *
224800* * * * * * * * * * * * * * * * * * * * * * * * * * * *
224900     MOVE SPACES                     TO  PRINT-LINE.
225000     IF PAGE-CTR = ZEROS
225100*A       MOVE "NONHPPRT"             TO JCW-NAME
225200*A       MOVE ZEROS                  TO JCW-VALUE
225300*A       CALL INTRINSIC "FINDJCW" USING JCW-NAME, JCW-VALUE,
225400*A           JCW-STATUS
225500*A       IF  JCW-VALUE = 0
225600*A           IF PO-PRT-MPE-SPOOLED
225700*A               NEXT SENTENCE
225800*A           ELSE
225900*A               WRITE PRINT-RCD BEFORE ADVANCING NEWPAGE
226000*A       ELSE
226100*A           NEXT SENTENCE
      *A       IF JCW-NONHPPRT-265 NOT = "1"
      *A           IF PO-PRT-MPE-SPOOLED
      *A               NEXT SENTENCE
      *A           ELSE
      *A               WRITE PRINT-RCD BEFORE ADVANCING NEWPAGE
      *A       ELSE
               NEXT SENTENCE
226200     ELSE
226300         WRITE PRINT-RCD BEFORE ADVANCING NEWPAGE.
226600
226700     ADD 1                           TO  PAGE-CTR.
226800     MOVE PAGE-CTR                   TO  PG-FROM.
226900     MOVE PRINT-HDR1                 TO  PRINT-LINE.
227000     MOVE 0                          TO  LINE-CTR.
227100     MOVE 1                          TO  LINE-ADV.
227200     PERFORM 651-PRINTALINE.
           IF SAVE-FAX-FIRST-CHAR = "+"
               IF COMPANY-SAVE = "130"
                   MOVE PRT-FAX-FORM-SS    TO  PRINT-LINE
               ELSE
                   MOVE PRT-FAX-FORM       TO  PRINT-LINE
               END-IF
               MOVE 0                      TO LINE-ADV
               PERFORM 651-PRINTALINE.
227300     MOVE PRINT-HDR2                 TO  PRINT-LINE.
227400     MOVE 1                          TO  LINE-ADV.
227500     PERFORM 651-PRINTALINE.
           IF SAVE-FAX-FIRST-CHAR = "+"
             IF PAGE-CTR = 1
               MOVE PO-RLSE-NO       TO PRT-PO-REF
               MOVE REF-LINE         TO  PRINT-LINE
               MOVE 0                TO  LINE-ADV
               PERFORM 651-PRINTALINE.
227600     MOVE PRINT-HDR3                 TO  PRINT-LINE.
227700     MOVE 1                          TO  LINE-ADV.
227800     PERFORM 651-PRINTALINE.
227900     MOVE PRINT-HDR4                 TO  PRINT-LINE.
228000     MOVE 1                          TO  LINE-ADV.
228100     PERFORM 651-PRINTALINE.
228200     MOVE PRINT-HDR5                 TO  PRINT-LINE.
228300     MOVE 1                          TO  LINE-ADV.
228400     PERFORM 651-PRINTALINE.
228500
228600 654-CONT-HDR.
228700     PERFORM 652-HEADER.
228800     MOVE SPACES                     TO  PRINT-LINE.
228900     MOVE 1                          TO  LINE-ADV.
229000     PERFORM 651-PRINTALINE.
229100     MOVE 1                          TO  LINE-ADV.
229200     MOVE PRNT-LINE1-SAVE            TO  PRINT-LINE.
229300     PERFORM 651-PRINTALINE.
           PERFORM 6540-PRINT-ONE-LINE 10 TIMES.
      *----------- TOOK OUT CALLS TO CLPAUSE2 TO ELIMINATE THE
      *----------- DELAY IN PRINTING PURCHASE ORDERS.
      ***  CALL "CLPAUSE2".
229100*    MOVE 11                         TO  LINE-ADV.
229200*    MOVE PRNT-LINE1-SAVE            TO  PRINT-LINE.
229300*    PERFORM 651-PRINTALINE.
229400     MOVE 1                          TO  LINE-ADV.
229500     MOVE VEND-NAME-SAVE             TO  PRINT-LINE.
229600     PERFORM 651-PRINTALINE.
           PERFORM 6540-PRINT-ONE-LINE  8 TIMES.
      ***  CALL "CLPAUSE2".
229400*    MOVE 9                          TO  LINE-ADV.
229500*    MOVE VEND-NAME-SAVE             TO  PRINT-LINE.
229600*    PERFORM 651-PRINTALINE.
229700     MOVE BUYER-TYP-SAVE             TO  PRINT-LINE.
229800     MOVE 1                          TO  LINE-ADV.
229900     PERFORM 651-PRINTALINE.
230000
230100 654-C-H-X.
230200     EXIT.
230300
       6540-PRINT-ONE-LINE.
228800     MOVE SPACES                     TO  PRINT-LINE.
228900     MOVE 1                          TO  LINE-ADV.
229000     PERFORM 651-PRINTALINE.

230400*******************************************************
230500*  FORMAT PRICE FIELD FOR FOREIGN DECIMAL FORMAT
230600*  AND $ SIGN WITH REGARD TO THE PLANT AND CURRENCY
230700*  CODE USED
230800*******************************************************
230900
231000 66-FORMAT-PRICE.
231100***************************************************
231200*  SURPRESS 3RD & 4TH ZERO TO THE RIGHT OF
231300*  OF THE DECIMAL
231400*  OF UNIT PRICE.
231500***************************************************
231600
231700     IF FOURTH-DEC-PRICE-POS = "0"
231800         MOVE " " TO FOURTH-DEC-PRICE-POS
231900         IF THIRD-DEC-PRICE-POS = "0"
232000             MOVE " " TO THIRD-DEC-PRICE-POS.
232100     IF FOREIGN-DECIMAL-SW = "Y"
232200         INSPECT PRTWK-PRICE-SPACE
232300             REPLACING ALL "$" BY " ", "." BY ",".
232400
232500     IF COMPANY-SAVE-1-DIGIT = "6"
232600         IF COMPANY-SAVE = "629" OR "630"
232700             IF PO-CURRENCY-CODE = "  " OR "01" OR "08"
232800                 NEXT SENTENCE
232900             ELSE
233000                 INSPECT PRTWK-PRICE-SPACE
233100                     REPLACING ALL "$" BY " "
233200         ELSE
233300             IF PO-CURRENCY-CODE = "01" OR "08"
233400                 NEXT SENTENCE
233500             ELSE
233600                 INSPECT PRTWK-PRICE-SPACE
233700                     REPLACING ALL "$" BY " "
233800     ELSE
      *********************************************************
      *    ADDED THE FOLLOWING LOGIC FOR THE PHILIPPINES
      *    12-18-96 AS THEY DID NOT WANT THE $ TO APPEAR
      *    FOR PRICES WHERE NO CURRENCY CODE WAS ASSIGNED
      *    BY THE BUYER OR PURCHASING CLERK.
      *********************************************************
           IF COMPANY-SAVE = "363" OR "364"
               IF PO-CURRENCY-CODE = "01" OR "08"
                   NEXT SENTENCE
               ELSE
               INSPECT PRTWK-PRICE-SPACE
                   REPLACING ALL "$" BY " "
           ELSE
233900         IF PO-CURRENCY-CODE = "  " OR "01" OR "08"
234000             NEXT SENTENCE
234100         ELSE
234200             INSPECT PRTWK-PRICE-SPACE
234300                 REPLACING ALL "$" BY " ".
234400
234500     IF PRICE-ALLOWED
234600         NEXT SENTENCE
234700     ELSE
234800         MOVE SPACES            TO  PRTWK-PRICE-SPACE.
234900
235000 66-FP-X.
235100     EXIT.
235200
235300
235400*******************************************************
235500*  FORMAT ESTIMATED UNIT PRICE $ WITH REGARD TO
235600*  PLANT AND CURRENCY CODE USED
235700*******************************************************
235800
235900 66-FORMAT-UNIT-VALUE.
236000     IF COMPANY-SAVE-1-DIGIT = "6"
236100         IF COMPANY-SAVE = "629" OR "630"
236200             IF PO-CURRENCY-CODE = "  " OR "01" OR "08"
236300                 NEXT SENTENCE
236400             ELSE
236500                 INSPECT PRTWK-ITEM-VALUE-SPACE
236600                     REPLACING ALL "$" BY " "
236700         ELSE
236800             IF PO-CURRENCY-CODE = "01" OR "08"
236900                 NEXT SENTENCE
237000             ELSE
237100                 INSPECT PRTWK-ITEM-VALUE-SPACE
237200                     REPLACING ALL "$" BY " "
237300     ELSE
237400         IF PO-CURRENCY-CODE = "  " OR "01" OR "08"
237500             NEXT SENTENCE
237600         ELSE
237700             INSPECT PRTWK-ITEM-VALUE-SPACE
237800                 REPLACING ALL "$" BY " ".
237900
238000 66-FUV-X.
238100     EXIT.
238200
238300
238400 66-CHECK-ITEM-TAX-CODES.
238500     MOVE SPACES                TO  SAVE-ITEM-TAX-CODE,
238600                                    PRINT-TAX-CODES-ITEM-SW.
238700     MOVE 1                     TO  SUB1.
238800     PERFORM 661-CHECK-TAX-ITEMS  THRU  661-CTI-X.
238900
239000 66-CITC-X.
239100     EXIT.
239200
239300 661-CHECK-TAX-ITEMS.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE 0 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 0 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
239400*A   CALL "DBFIND" USING BASE, DSET-DPOITEM, MODE1, STATUS-AREA,
239500*A       PO-SEARCH, PO-ARG.
239600     IF COND-WORD NOT = ZERO
239700         MOVE "FIND DPOITEM * 661-CTI"  TO  BU-DISPLAY-MSG
239800         GO TO 2-BLOWUP.
239900
240000 661-GET-DPOITEM.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
240100*A   CALL "DBGET" USING BASE, DSET-DPOITEM, MODE5, STATUS-AREA,
240200*A       ALL-ITEMS, BUF-DPOITEM, PO-ARG.
240300     IF COND-WORD NOT = ZERO
240400         IF COND-WORD = 15
240500             GO TO 661-CTI-X
240600         ELSE
240700             MOVE "GET DPOITEM * 661-GD" TO BU-DISPLAY-MSG
240800             GO TO 2-BLOWUP.
240900
241000 661-CHECK-FOR-ITEMS.
241100     IF PRINT-SPECIFIC-ITEMS-SW = "Y"
             IF  SUB1 > 15
               GO TO 661-CTI-X
             ELSE
241200         IF PO-ITEM (SUB1) = ITM-NUMBER
241300             ADD 1                TO  SUB1
241400         ELSE
241500         IF PO-ITEM (SUB1) > ITM-NUMBER
241600             GO TO 661-GET-DPOITEM
241700         ELSE
241800             ADD 1                TO  SUB1
241900             IF SUB1 > 15
242000                 GO TO 661-CTI-X
242100             ELSE
242200                 GO TO 661-CHECK-FOR-ITEMS.
242300
242400     IF SAVE-ITEM-TAX-CODE = SPACES
242500         MOVE ITM-TAX-CODE      TO  SAVE-ITEM-TAX-CODE
242600         GO TO 661-GET-DPOITEM.
242700     IF SAVE-ITEM-TAX-CODE = ITM-TAX-CODE
242800         GO TO 661-GET-DPOITEM
242900     ELSE
243000         MOVE "Y"               TO  PRINT-TAX-CODES-ITEM-SW.
243100
243200 661-CTI-X.
243300     EXIT.
243400
      *
      * PARAGRAPH TO FIND THE POSITION TO PRINT THE NEXT ITEM IN
      *
       920-FIND-POSITION.
           MOVE TOTAL-LENGTH TO PRINT-POSITION.
           PERFORM UNTIL PRINT-POSITION < 1 OR
                         CHAR-POS(PRINT-POSITION) NOT EQUAL SPACE
             SUBTRACT 1 FROM PRINT-POSITION
           END-PERFORM.
           IF PRINT-POSITION < 1
             MOVE 1 TO PRINT-POSITION
           ELSE
             ADD 2 TO PRINT-POSITION
           END-IF.

       COPY OVRPFCALL IN COPYLIB.
243500
243600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

245200 999-CATREAD-EXIT.
245300     EXIT.
