000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     TPOPRTSL.
000500 AUTHOR.
000600     KURT MOVSESIAN.
000800
000900**************************************************************
001000*                                                            *
001100*   T P O P R T S L                                          *
001200*    THIS SUBROUTINE IS THE PO REPRINT SELECTION SCREEN      *
001300*                                                            *
001400**************************************************************
001500*   N O T E    T H I S   S U B R O U T I N E   I S           *
001600*         C A L L E D    B Y :                               *
001700*      1. TPURORD                                            *
001800*      2. SPOMOD                                             *
001900*      3. TUDCDOCK
002000**************************************************************
002100*                                                            *
002200*   SUBROUTINES CALLED:                                      *
002300*                           1) TPOPRNT.SOURCE                *
002400*                           2) TSTRMJOB.SOURCE               *
002500*                                                            *
002600**************************************************************
      *C  06/13/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C  06/17/96  JEFF BUNGO
      *C   ALLOW USER TO SELECT IF NO ESCAPE SEQUENCES ARE PRINTED
      *C   FOR THE PO REPRINT.
      *C
      *C  03/12/97  CA YODER
      *C   SET DEFAULT FOR SCREEN-NO-ESCAPE-PRINT TO "X" IF SWITCH
      *C   IS SET IN MPLTINFO TO PRINT A PO WITH NO ESCAPE SEQUENCES.
      *C
      *C  01/25/00  JE COFFMAN
      *C   REVERSED THE LOGIC ON THE NO ESCAPE PRINT SWITCH:
      *C   THE LOGIC SHOULD CALL TPOPRNT IS THE USER SWITCH IS 'Y'
      *C   AND TPOPRNT2 IS THE USER SWITCH IS 'N'.
      *C
002700
020200
020300 ENVIRONMENT DIVISION.
020400 CONFIGURATION SECTION.
020500 SOURCE-COMPUTER.  HP-3000.
020600 OBJECT-COMPUTER.  HP-3000.
020700
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                     ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
020800
020900 DATA DIVISION.
       FILE SECTION.
       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

021000
021100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

021200 01  CANCELLED-ORDER-SW      PIC X      VALUE SPACES.
021300     88  CANCELLED-ORDER                VALUE "Y".
021400
021500 01  BATCH-OPTION-SW         PIC X      VALUE SPACES.
021600     88  BATCH-OPTION                   VALUE "Y".
021700
021800
021900 01  MESSAGE-BUFFER.
022000     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
022100     05  MSG-FLD               PIC X(8)     VALUE SPACE.
022200     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
022300
022400 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76   COMP-4.
022500
022600 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO COMP-4.
022700
022800 01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.
022900
       01  SAVE-NOASCII-REPORTS      PIC X.
       01  PLT-ARG                   PIC X(4).
023000
023100*************************************************************
023200**    PARAMETER AREA FOR 'TSHWRDFM'                        **
023300*************************************************************
023400 COPY TSHWRDFM   IN COPYLIB.

       01  SCREEN-BUFFER   PIC X(2000).
023500
023600
023700**************************************************************
023800**************************************************************
023900**                                                          **
024000**             TERMINAL I/O DATA AREA                       **
024100**                                                          **
024200**************************************************************
024300**************************************************************
024400
024500 01  SCREEN-1.
024600     05  SCREEN-PO.
024700         10  PETTY-PO-CHECK        PIC X.
024800         10  PO-NUM-2-7            PIC X(6).
024900     05  SCREEN-RLSE               PIC 9(3).
025000     05  SCREEN-MODIFIED-ORDER     PIC X.
025100     05  SCREEN-CANCELLED-ORDER    PIC X.
025200     05  SCREEN-BATCH-OPTION       PIC X.
           05  SCREEN-NO-ESCAPE-PRINT    PIC X.
025300     05  SCREEN-ITEMS.
025400         10  SCREEN-ITMS OCCURS 15 TIMES.
025500             15  SCREEN-ITEM           PIC 9(4).
           05  SCREEN-COMMAND-LINE       PIC X(79).
           05  SCREEN-MESSAGE-LINE       PIC X(79).
 25600
025700
       COPY CATREAD IN COPYLIB.
039000
025800**************************************************************
025900**
026000**        DATABASE I/O WORK AREA
026100**
026200**************************************************************
026300
026400 COPY DPORECD IN COPYLIB.
026500
026600 COPY DBSTAT IN COPYLIB.
026700
       COPY MPLT0     IN COPYLIB.

       COPY MPLTPOPT  IN COPYLIB.
026900
027000*********************
027100*                   *
027200*   DATA SET NAMES  *
027300*                   *
027400*********************
027500
027600 01  DSET-NAMES.
027700     05  DSET-NAME              PIC X(16)  VALUE SPACES.
027800     05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
027900
028000 01 ITEMS-LISTING.
028100     05  ALL-ITEMS              PIC XX    VALUE "@;".
028200     05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".
028300
028400 01 ARG-VALUES.
028500     05  PO-ARG                 PIC X(14) VALUE SPACES.
028600
028700 01  PO-PRINT-PARMS.
028800     05  PO-NUMBER.
028900         10  FILLER            PIC X.
029000         10  PETTY-PO-CHECK    PIC X.
029100         10  FILLER            PIC X(12).
029200     05  PO-REPRINT            PIC X.
029300     05  PO-PRINT-TYPE         PIC X.
029400     05  PO-MODIFIED-ORDER     PIC X.
029500     05  PO-CANCELLED-ORDER    PIC X.
029600     05  PO-PRINT-NUM          PIC S9(2)  COMP-4.
029700     05  PO-ITEMS.
029800         10  PO-ITMS OCCURS 15 INDEXED BY P-INDEX.
029900             15 PO-ITEM               PIC X(4).
030000
030100
030200 01  STRMRPT-COMAREA.
030300     05  STRM-RET-CODE            PIC X(2)  VALUE "00".
030400     05  STRM-MODE                PIC S9(4) VALUE ZEROS COMP-4.
030500     05  STRM-CO-CODE.
030600         10  CO-CODE-PREFIX       PIC X(2)  VALUE SPACES.
030700         10  CO-CODE-LAST-DIGIT   PIC X     VALUE SPACES.
030800     05  STRM-PRE-RUN-CARDS.
030900         10  STRM-PRE-RUN-CARD1   PIC X(80) VALUE SPACES.
031000         10  STRM-PRE-RUN-CARD2   PIC X(80) VALUE SPACES.
031100         10  STRM-PRE-RUN-CARD3   PIC X(80) VALUE SPACES.
031200         10  STRM-PRE-RUN-CARD4   PIC X(80) VALUE SPACES.
031300     05  STRM-RUN-CARD            PIC X(80) VALUE SPACES.
031400     05  STRM-JOB-NAME            PIC X(8)  VALUE "POREPRT ".
031500     05  STRM-ROUTE-CARD.
031600         10  FILLER               PIC X(19) VALUE SPACES.
031700         10  ROUTE-LP             PIC X(3)  VALUE SPACES.
031800         10  FILLER               PIC X(58) VALUE SPACES.
031900     05  STRM-OPTION-CARD.
032000         10  STRM-PO-NUM          PIC X(14) VALUE SPACES.
032100         10  STRM-PO-REPRINT      PIC X     VALUE SPACES.
032200         10  STRM-PO-TYPE         PIC X     VALUE SPACES.
032300         10  STRM-MOD-ORDER       PIC X     VALUE SPACES.
032400         10  STRM-CANC-ORDER      PIC X     VALUE SPACES.
032500         10  STRM-PO-PRINT-NUM    PIC 9(2) COMP-4 VALUE ZEROS.
032600         10  STRM-PO-ITEMS        PIC X(60) VALUE SPACES.
               10  STRM-NO-ESCAPE-PRINT PIC X     VALUE SPACES.
032700     05  STRM-OPTION-CARD2        PIC X(640) VALUE SPACES.
032800     05  STRM-OPTION-CARD2-CTR    PIC X(1)  VALUE SPACES.
032900     05  STRM-OPTION-CARD3        PIC X(80) VALUE SPACES.
033000     05  STRM-PRTRPT-CARD.
033100         10  STRM-PRTRPT-FLAG     PIC X(1).
033200         10  STRM-PRTRPT-FILE     PIC X(17).
033300         10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
033400         10  STRM-PRTRPT-PRINTER   PIC X(3).
033500
033600 01  FILE-PRNTWORK.
033700     05  FILLER  PIC X(15) VALUE ":FILE PRNTWORK;".
033800     05  FILLER  PIC X(19) VALUE "REC=-133,5,F,ASCII;".
033900     05  FILLER  PIC X(20) VALUE "DISC=20000,20,1;TEMP".
034000
034100 01  JCW-PRICE-COMMAND.
034200     05  FILLER  PIC X(15) VALUE ":SETJCW PRICE=1".
034300
034400 01  RUN-COMMAND.
034500     05  FILLER  PIC X(27) VALUE ":RUN XPOPRTBT.OBJECT;LIB=P".
034600
034700
034800 COPY TBLOWUP IN COPYLIB.
034900
035000
035100 LINKAGE SECTION.
035200
035300 01  BASE             PIC X(10).
035400
035500
035600 01  BUILD-PO-SEARCH.
035700     05  PO-PREFIX           PIC X.
035800     05  PO-NO               PIC X(7).
035900     05  PO-REL              PIC X(3).
036000     05  PO-RCV              PIC X(3).
036100
036200 COPY VCOMLINK IN COPYLIB.
036300
036400
036500 01  SWITCH-PARAMETERS.
036600     05  FATAL-ERR-SW            PIC X.
036700     05  COMPANY-SAVE            PIC X(3).
036800
036900
037000**************************************
037100*                                    *
037200*  PRINTCNTL IS SET TO 1 THIS CAUSES *
037300*  THE FIELD ON A SCREEN PRINTOUT    *
037400*  TO BE UNDERLINED                  *
037500*                                    *
037600*  PAGECNTL IS SET TO 49 (OCTAL 61)  *
037700*  THIS CAUSE THE LP TO EJECT AFTER  *
037800*  THE SCREEN IS PRINTED             *
037900*                                    *
038000**************************************
038100
038200 01  SCREEN-PRINT-PARMS.
038300     05  PRINTCNTL             PIC S9(4)    COMP-4.
038400     05  PAGECNTL              PIC S9(4)    COMP-4.
038500     05  SPOOLFIL-OPEN-SW      PIC X.
038600
038700 01  PASSED-SPOOL-PRT          PIC S9(2)    COMP-4.
038800
038900 01  PASSED-PO-PRINT-NUM       PIC S9(2)    COMP-4.

039100 COPY LANGSUB IN COPYLIB.
039200
039300 COPY ESCNAME IN COPYLIB.
039400
039500 COPY ITPARMS IN COPYLIB.
039600
039700 PROCEDURE DIVISION USING  BASE,
039800                           BUILD-PO-SEARCH,
039900                           VIEW-COMAREA,
040000                           SWITCH-PARAMETERS,
040100                           SCREEN-PRINT-PARMS,
040200                           PASSED-SPOOL-PRT,
040300                           PASSED-PO-PRINT-NUM,
040400                           LANGUAGE-PARMS,
040500                           ESC-NAME,
040600                           INTERNAL-ORDER-PARMS.
040700
040800
040900 PO-PRINT-SELECTION  SECTION 15.
       BEGIN-HERE.
           OPEN INPUT DPORECD-I  MPLTINFO-I.

           PERFORM 1-HSK   THRU  1-H-X.

041000     PERFORM 6-MAIN  THRU  6-M-X.

           CLOSE      DPORECD-I  MPLTINFO-I.
041100     GOBACK.
041200
       1-HSK.
           MOVE "POPT"    TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "N"                       TO  SAVE-NOASCII-REPORTS
           ELSE
               MOVE MPLTINFO-ASCII-PO-PRNTS   TO  SAVE-NOASCII-REPORTS.

       1-H-X.
           EXIT.

041300******************************************************
041400**                                                  **
041500**   BLOWUP ROUTINE                                 **
041600**                                                  **
041700******************************************************
041800
041900 2-BLOWUP.
042000     MOVE "TPOPRTSL"  TO  BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
042100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
042200         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
042300             BU-DISPLAY-FLDS.
042400
042500
045200
045300 4-PGM-ERROR.
           MOVE B"1"  TO IND(FIELD-NUMBER), IND(99).
046100
046200 4-PGM-ERROR-X.
046300     EXIT.
046400
048400
048500
048600 6-MAIN.
048700     IF INTERNAL-ORDER-PRT-NO-1 = "  " OR "00"
048800         MOVE PASSED-PO-PRINT-NUM  TO  INTERNAL-ORDER-PRT-NO-1.
048900
049000     MOVE COMPANY-SAVE    TO STRM-CO-CODE.
049100     MOVE "POREPRT1"      TO VIEW-NFNAME.
049600
049700     MOVE SPACES          TO SCREEN-1.
049800     MOVE PO-NO           TO SCREEN-PO.
           IF PO-REL = SPACES
               MOVE ZEROS       TO SCREEN-RLSE
           ELSE
049900         MOVE PO-REL      TO SCREEN-RLSE.
           MOVE ALL ZEROS       TO SCREEN-ITEMS.
           IF SAVE-NOASCII-REPORTS = "N"
               MOVE "X"         TO SCREEN-NO-ESCAPE-PRINT.
051300
051400 6-SHOWFORM-SCREEN-1.
051500     MOVE 3                       TO  SRF-MODE.
           MOVE SCREEN-1                TO  SCREEN-BUFFER.
051600     CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
051700           VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
051800               LANGUAGE-PARMS, SCREEN-BUFFER.
051900     IF BU-DISPLAY-MSG NOT = SPACES
052000         GO TO 2-BLOWUP.
           MOVE SCREEN-BUFFER           TO  SCREEN-1.
052100
052200
052300     IF VIEW-LASTKEY = 3
 52400         GO TO 6-M-X
052500     ELSE
053900     IF VIEW-LASTKEY = 1 OR
054000        VIEW-LASTKEY = 2 OR
054100        VIEW-LASTKEY = 4 OR
054200        VIEW-LASTKEY = 5 OR
054300        VIEW-LASTKEY = 6 OR
054400        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
054600*        *** INVALID FUNCTION KEY ENTERED ***
054700         MOVE   9 TO LANG-SETNUM
054800         MOVE  10 TO LANG-MSGNUM
054900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO SCREEN-MESSAGE-LINE
055000         MOVE 1  TO  FIELD-NUMBER
055100         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
055200         GO TO 6-SHOWFORM-SCREEN-1.
055300
055400 6-FIELD-EDITS.
           IF SCREEN-PO = SPACES
      *------ YOU MUST ENTER PURCHASE ORDER NUMBER
               MOVE 44037 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SCREEN-MESSAGE-LINE
               MOVE B"1" TO IND(1) IND(99)
               GO TO 6-SHOWFORM-SCREEN-1.

           IF SCREEN-MODIFIED-ORDER = "X" AND
              SCREEN-CANCELLED-ORDER = "X"
      *------ CHOOSE ONE OPTION - MODIFIED OR CANCELLED
               MOVE 66056 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SCREEN-MESSAGE-LINE
               MOVE B"1" TO IND(6) IND(99)
               GO TO 6-SHOWFORM-SCREEN-1.
057200
057300 6-EDIT-PO-NUMBER.
057400     MOVE SCREEN-PO               TO  PO-NO.
057500     MOVE SCREEN-RLSE             TO  PO-REL.
057600     MOVE ZEROS                   TO  PO-RCV.
057700     MOVE BUILD-PO-SEARCH         TO  PO-ARG,
057800                                      BU-DISPLAY-FLD (1).
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-I.
           START DPORECD-I KEY = PORCVNO OF DPORECD-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
057900*    CALL "DBFIND" USING BASE, DSET-DPORECD, MODE1, STATUS-AREA,
058000*        PO-SEARCH, PO-ARG.
058100     IF COND-WORD NOT = ZERO
058200         IF COND-WORD = 17
058300*            *** P.O. DOES NOT EXIST ***
058400             MOVE  16 TO LANG-SETNUM
058500             MOVE  45 TO LANG-MSGNUM
058600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-MESSAGE-LINE
058700             MOVE 1    TO  FIELD-NUMBER
058800             PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
058900             GO TO 6-SHOWFORM-SCREEN-1
059000         ELSE
059100             MOVE "FIND DPORECD * 6-EHO"  TO  BU-DISPLAY-MSG
059200             GO TO 2-BLOWUP.
059300
           MOVE 0 TO COND-WORD.
           READ DPORECD-I NEXT INTO BUF-DPORECD
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
059400*    CALL "DBGET" USING BASE, DSET-DPORECD, MODE5, STATUS-AREA,
059500*        ALL-ITEMS, BUF-DPORECD, PO-ARG.
059600     IF COND-WORD NOT = ZERO
059700         IF COND-WORD = 15
059800*            *** P.O. DOES NOT EXIST ***
059900             MOVE  16 TO LANG-SETNUM
060000             MOVE  45 TO LANG-MSGNUM
060100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-MESSAGE-LINE
060200             MOVE 1    TO  FIELD-NUMBER
060300             PERFORM 4-PGM-ERROR THRU 4-PGM-ERROR-X
060400             GO TO 6-SHOWFORM-SCREEN-1
060500         ELSE
060600             MOVE "GET DPORECD * 6-EHO"  TO  BU-DISPLAY-MSG
060700             GO TO 2-BLOWUP.
060800
060900***************************************************
061000**   IF THE USER CAN ONLY CREATE INTERNAL ORDERS
061100**   CHECK TO MAKE SURE THE ORDER THEY WISH TO REPRINT
061200**   IS AN INTERNAL ORDER (DPORECD IT-INDIC)
061300***************************************************
061400
061500 6-CHECK-FOR-INTERNAL-ORDER.
061600     IF INTERNAL-ORDER-ONLY
061700         IF PO-INTERNAL-ORDER-INDIC = "X"
061800             NEXT SENTENCE
061900         ELSE
062000***          CAN ONLY CREATE/ACCESS INTERNAL ORDERS
062100             MOVE 3   TO LANG-SETNUM
062200             MOVE 113 TO LANG-MSGNUM
062300             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-MESSAGE-LINE
062400             MOVE 1   TO FIELD-NUMBER
062500             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
062600             GO TO 6-SHOWFORM-SCREEN-1.
062700
062800
062900
063000     MOVE SPACES                  TO  PO-PRINT-PARMS.
063100     IF PO-INTERNAL-ORDER-INDIC = "X"
063200         MOVE INTERNAL-ORDER-PRT-NO-1  TO  PO-PRINT-NUM
063300     ELSE
063400         MOVE PASSED-PO-PRINT-NUM      TO  PO-PRINT-NUM.
063500     MOVE BUILD-PO-SEARCH         TO  PO-NUMBER.
063600     MOVE "R"                     TO  PO-REPRINT.
063700     MOVE SCREEN-ITEMS            TO  PO-ITEMS.
063800     IF SCREEN-RLSE > "000" AND
063900        SCREEN-RLSE < "999"
064000         MOVE "S"                 TO  PO-PRINT-TYPE.
064100     MOVE SCREEN-MODIFIED-ORDER   TO  PO-MODIFIED-ORDER.
064200     MOVE SCREEN-CANCELLED-ORDER  TO  PO-CANCELLED-ORDER.
064300     IF SCREEN-CANCELLED-ORDER = "X"
064400         MOVE "Y"                 TO  CANCELLED-ORDER-SW
064500     ELSE
064600         MOVE SPACES              TO  CANCELLED-ORDER-SW.
064700     IF SCREEN-BATCH-OPTION = "X"
064800         MOVE "Y"                 TO  BATCH-OPTION-SW
064900     ELSE
065000         MOVE SPACES              TO  BATCH-OPTION-SW.
065100
065200
065300*    ***  PROCESSING PURCHASE ORDER REPRINT  ***
065400     MOVE  16 TO LANG-SETNUM.
065500     MOVE  63 TO LANG-MSGNUM.
065600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER  TO SCREEN-COMMAND-LINE.
           MOVE B"1" TO IND(98).
065900
051500     MOVE 4                       TO  SRF-MODE.
           MOVE SCREEN-1                TO  SCREEN-BUFFER.
051600     CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
051700           VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
051800               LANGUAGE-PARMS, SCREEN-BUFFER.
051900     IF BU-DISPLAY-MSG NOT = SPACES
052000         GO TO 2-BLOWUP.
067100
067200
067300     IF BATCH-OPTION
067400         PERFORM 61-LAUNCH-BATCH-PRINT  THRU  61-LBP-X
067500     ELSE
               IF SCREEN-NO-ESCAPE-PRINT = "X"
                   CALL "TPOPRNT2" USING BASE,
                                         PO-PRINT-PARMS,
                                         ESC-NAME,
                                         LANGUAGE-PARMS
               ELSE
067600             CALL "TPOPRNT" USING BASE,
067700                                  PO-PRINT-PARMS,
067800                                  ESC-NAME,
067900                                  LANGUAGE-PARMS.
068000
068100******************************************************
068200**   IF THIS IS AN INTERNAL ORDER CHECK TO SEE IF
068300**   THERE IS A SECOND PRINT LOCATION IF SO PRINT
068400**   A SECOND COPY OF THE INTERNAL ORDER
068500******************************************************
068600
068700     IF PO-INTERNAL-ORDER-INDIC = "X"
068800         IF INTERNAL-ORDER-PRT-NO-2 = "  " OR "00"
068900             NEXT SENTENCE
069000         ELSE
069100             MOVE INTERNAL-ORDER-PRT-NO-2 TO PO-PRINT-NUM
069200             IF BATCH-OPTION
069300                 PERFORM 61-LAUNCH-BATCH-PRINT  THRU 61-LBP-X
069400             ELSE
                     IF SCREEN-NO-ESCAPE-PRINT = "X"
069500                 CALL "TPOPRNT2" USING BASE,
069600                                      PO-PRINT-PARMS,
069700                                      ESC-NAME,
069800                                      LANGUAGE-PARMS
                     ELSE
069500                 CALL "TPOPRNT" USING BASE,
069600                                      PO-PRINT-PARMS,
069700                                      ESC-NAME,
069800                                      LANGUAGE-PARMS.
069900
070700     MOVE SPACES  TO  SCREEN-1.
           MOVE ZEROS   TO  SCREEN-RLSE.
           MOVE ALL ZEROS TO SCREEN-ITEMS.
070000*    *** ENTER ANOTHER P.O. FOR REPRINT OR 'f3' TO END ***
070100     MOVE   5 TO LANG-SETNUM.
070200     MOVE  22 TO LANG-MSGNUM.
070300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-COMMAND-LINE.
           MOVE B"1" TO IND(98).
           IF SAVE-NOASCII-REPORTS = "N"
               MOVE "X"         TO SCREEN-NO-ESCAPE-PRINT.
071500     GO TO 6-SHOWFORM-SCREEN-1.
071600
071700 6-M-X.
071800     EXIT.
071900
072000 61-LAUNCH-BATCH-PRINT.
072100     MOVE SPACES                TO  STRM-OPTION-CARD.
072200     MOVE PO-ITEMS              TO  STRM-PO-ITEMS.
072300     MOVE PO-NUMBER             TO  STRM-PO-NUM.
072400     MOVE PO-REPRINT            TO  STRM-PO-REPRINT.
072500     MOVE PO-PRINT-TYPE         TO  STRM-PO-TYPE.
072600     MOVE PO-MODIFIED-ORDER     TO  STRM-MOD-ORDER.
072700     MOVE PO-CANCELLED-ORDER    TO  STRM-CANC-ORDER.
072800     MOVE PO-PRINT-NUM          TO  STRM-PO-PRINT-NUM.
           MOVE SCREEN-NO-ESCAPE-PRINT TO STRM-NO-ESCAPE-PRINT.
072900
073000     MOVE FILE-PRNTWORK         TO  STRM-PRE-RUN-CARD1.
073100     MOVE JCW-PRICE-COMMAND     TO  STRM-PRE-RUN-CARD2.
073200     MOVE COMPANY-SAVE          TO  STRM-CO-CODE.
073300     MOVE "TPOPRTBT"            TO  STRM-RUN-CARD.
073400     CALL "TSTRMJOB" USING STRMRPT-COMAREA.
073500     IF STRM-RET-CODE NOT = "00"
073600         MOVE STRM-RET-CODE     TO  BU-DISPLAY-FLD9 (1)
073700         MOVE "STRM COMMAND FAIL * TSTRMJOB" TO BU-DISPLAY-MSG
073800         GO TO 2-BLOWUP.
073900
074000 61-LBP-X.
074100     EXIT.
074200
074300
074400
074500 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
076100 999-CATREAD-EXIT.
076200     EXIT.
