       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPPLOAD.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *C
      *C  03/11/1998   CA YODER   REQ #97-1125
      *C    EXPANDED PASSWORD FIELD FROM 6 TO 8 CHARACTERS.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       WORKING-STORAGE SECTION.
       77  HOLD-AREA           PIC X(26) VALUE SPACES.
      *-------- EXPANDED PASSWORD FIELD.
      *77  TRAN-LEN            PIC 9(5)    VALUE 6   COMP-3.
       77  TRAN-LEN            PIC 9(5)    VALUE 8   COMP-3.
      *77  TRAN-BUF            PIC X(06).
       77  TRAN-BUF            PIC X(08).
       77  TRAN-CODE           PIC X.
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  PWORD-BUFFER.
           05  PWORD-BUF.
               10  FIRST-BUF   PIC X.
      ******** 10  NUM-BUF     PIC XXXXX VALUE "00000".
               10  NUM-BUF     PIC XXXXXXX VALUE "0000000".
               10  NUM-BUF-9   REDEFINES NUM-BUF
      ********                 PIC 99999.
                               PIC 9999999.
           05  PWD-X           PIC XX    VALUE "00".
           05  DATE-BUF        REDEFINES PWD-X
                               PIC 9999  BINARY.

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            PER-PERSONNEL.

       MAIN.
           READ PER-PERSONNEL  FIRST INTO PERSONNEL-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.
           GO TO GET-CONT.

       GET-DATA.
           READ PER-PERSONNEL  NEXT INTO PERSONNEL-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO END-OF-JOB
               ELSE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE "READ    " TO DB-FUNC
                   MOVE "PER-PERSONNEL" TO DB-FILE
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

       GET-CONT.
      **** MOVE "MMIS  "       TO TRAN-BUF.
           MOVE "MMIS    "     TO TRAN-BUF.
           MOVE "0"            TO TRAN-CODE.
           CALL "CTRANSLATE"   USING TRAN-LEN
                               TRAN-BUF
                               TRAN-CODE.

           MOVE TRAN-BUF       TO PWORD-BUF.
           MOVE 0              TO DATE-BUF.
           MOVE PWORD-BUFFER   TO PER-PWORD.

           REWRITE PP-REC      FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.

           GO TO GET-DATA.

       END-OF-JOB.
           CLOSE               PER-PERSONNEL.
           GOBACK.

