       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPPMAINT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *C
      *C  03/11/1998   CA YODER   REQ #97-1125
      *C    EXPANDED PASSWORD FIELD FROM 6 TO 8 CHARACTERS.
      *C
      *C  11/21/2002   CA YODER
      *C    ADDED LOGIC TO ALLOW DECATUR TO USE "9999" AS A
      *C    VALID CLOCK CARD NUMBER.  THERE WAS A SPECIAL VERSION
      *C    OF THIS PROGRAM CREATED IN 1999 FOR DECATUR, BUT WITH
      *C    THE L.01 RELEASE, THIS CHANGE WAS ADDED TO THE STANDARD
      *C    PROGRAM.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPERPASS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HELP-KEY            PIC XXXX  VALUE "#$%&".
       77  HOLD-AREA           PIC X(26) VALUE SPACES.
      *------- EXPANDED PASSWORD FIELD.
      *77  TRAN-LEN            PIC 9(5)  VALUE 6       COMP-3.
       77  TRAN-LEN            PIC 9(5)  VALUE 8       COMP-3.
      *77  TRAN-BUF            PIC X(06).
       77  TRAN-BUF            PIC X(08).
       77  TRAN-CODE           PIC X.
       77  TRUE-VAL            PIC 1     VALUE B"1".
       77  PLT-ARG             PIC X(4)  VALUE SPACES.
       77  SAVE-COMPANY        PIC X(3).

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TPPMAINT".
           05  PROGRAM-TYPE    PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE PIC X(12) VALUE " G0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A PIC X(30) VALUE
                  "PASSWORD INITIATE PROGRAM FOR ".
               10  PROG-DESC-A PIC X(30) VALUE
                  "THE MMIS PERSONAL PASSWORD    ".
               10  PROG-DESC-B PIC X(30) VALUE
                  "SYSTEM.  ALLOWS ADDITION OF PA".
               10  PROG-DESC-B PIC X(30) VALUE
                  "SSWORDS TO SPECIFIC PERSONNEL.".
               10  PROG-FUNC   PIC X(30) VALUE
                  "ALSO ALLOWS REGISTRATION OF TH".
               10  PROG-FUNC   PIC X(30) VALUE
                  "E PASSWORD MANAGER.           ".
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  CC-BUFFER       PIC XXXX.
           05  CC-9            REDEFINES CC-BUFFER  PIC XXXX.
           05  CC-NAME         PIC X(16).
           05  CC-CRAFT        PIC XX.
           05  CC-ZONE         PIC XXXX.
           05  CC-DEPT         PIC XXXX.
           05  CC-SHIFT-CREW.
               10  CC-SHIFT    PIC X.
               10  CC-CREW     PIC X.
           05  DISP-NAME       PIC X(16).
      *---------- EXPANDED PASSWORD FIELD.
      **** 05  NEW-PWORD       PIC X(06).
           05  NEW-PWORD       PIC X(08).
           05  SCR-MSG-DATA.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  SCREEN-TWO.
           05  MAN-DATA.
               10  1-BUF       PIC X(16).
               10  2-BUF       PIC XX.
               10  3-BUF       PIC XXXX.
               10  4-BUF       PIC XXXX.
           05  SCR-MSG-DATA2.
               10  CMDMSG2     PIC X(79).
               10  ERRMSG2     PIC X(79).

       01  NAME-LIST           PIC X(9).
       01  NAME-TABLE          REDEFINES NAME-LIST.
           05  N-TAB           OCCURS 9 TIMES PIC X.

       01  PWORD-BUFFER.
           05  PWORD-BUF.
               10  FIRST-BUF   PIC X.
      *******  10  NUM-BUF     PIC XXXXX VALUE "00000".
               10  NUM-BUF     PIC XXXXXXX VALUE "0000000".
               10  NUM-BUF-9   REDEFINES NUM-BUF
                               PIC 9999999.
           05  PWD-X           PIC XX    VALUE "00".
           05  DATE-BUF        REDEFINES PWD-X PIC 9(4) BINARY.

       01  TIME-BUFF.
           05  TIME-HRS        PIC 99 VALUE ZEROS.
           05  TIME-MINS       PIC 99 VALUE ZEROS.
           05  TIME-SECS.
               10  SEC-1       PIC 9 VALUE ZEROS.
               10  SEC-2       PIC 9 VALUE ZEROS.
               10  FILLER      PIC 99.

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       COPY MPLT0              IN COPYLIB.
       COPY MPLTP01            IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            PER-PERSONNEL.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          MPLTINFO-I.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               MOVE MPLTINFO-COMPANY     TO  SAVE-COMPANY.

       MAIN.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE "PERPASSM"     TO SCREEN-NAME.

       SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 5
               GO TO LOAD-MANAGER.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM.

       GET-DATA.
           IF  CC-BUFFER = "NEWS" OR "9999"
      *------------- "9999" IS A VALID CC# IN DECATUR.
             IF SAVE-COMPANY = "174" AND CC-BUFFER = "9999"
                 NEXT SENTENCE
             ELSE
      **********************************************************************
      **    MESSAGE 035/089:
      **  INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO SHOWFORM.

           MOVE CC-BUFFER      TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT-1 = "2"
      **********************************************************************
      **    MESSAGE 035/089:
      **  INVALID IDENTIFICATION CODE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  89        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO SHOWFORM
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           MOVE HIGH-VALUES    TO PERCCNUM OF PER-PERSONNEL.
           START PER-PERSONNEL KEY = PERCCNUM OF PER-PERSONNEL
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.

           MOVE PER-EMP-NAME   TO CC-NAME.
           MOVE PER-CRAFT      TO CC-CRAFT.
           MOVE PER-MAINT-ZONE TO CC-ZONE.
           MOVE PER-DEPT       TO CC-DEPT.
           MOVE PER-SHIFT-CREW TO CC-SHIFT-CREW.

       SHOWFORM-2.
           MOVE TRUE-VAL       TO IND(2) IND(3).
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO MAIN.

           PERFORM NEW-PASSWORD THRU NP-EXIT.

      **********************************************************************
      **    MESSAGE 042/069:
      ** PRESS 'ENTER' TO CONTINUE OR PRESS APPROPRIATE FUNCTION KEY
      **********************************************************************
           MOVE  42            TO CATREAD-MSG-SET.
           MOVE  69            TO CATREAD-MSG-NUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO CMDMSG.

       SHOWFORM-3.
           MOVE TRUE-VAL       TO IND(2).
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           GO TO MAIN.

       NEW-PASSWORD.
           MOVE PER-EMP-NAME   TO DISP-NAME NAME-LIST.
           MOVE SPACES         TO PWORD-BUF.

       LOOP-SET.
           ACCEPT TIME-BUFF    FROM TIME.
           IF SEC-2 = 0        MOVE 1 TO SEC-2.
           MOVE N-TAB(SEC-2)   TO FIRST-BUF.
           IF FIRST-BUF = "A" OR "B" OR "C" OR "D" OR "E" OR "F" OR
                          "G" OR "H" OR "J" OR "K" OR "L" OR "M" OR
                          "N" OR "P" OR "Q" OR "R" OR "S" OR "T" OR
                          "U" OR "V" OR "W" OR "X" OR "Y" OR "Z"
               NEXT SENTENCE
           ELSE
               GO TO LOOP-SET.

           MOVE TIME-BUFF      TO NUM-BUF-9.
           MOVE PWORD-BUF      TO NEW-PWORD.
           MOVE "0"            TO TRAN-CODE.
           MOVE NEW-PWORD      TO TRAN-BUF.
           CALL "CTRANSLATE"   USING TRAN-LEN
                               TRAN-BUF
                               TRAN-CODE.

           MOVE TRAN-BUF       TO PWORD-BUF.
           MOVE 0              TO DATE-BUF.
           MOVE CC-BUFFER      TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           MOVE PWORD-BUFFER   TO PER-PWORD.

           REWRITE PP-REC      FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

       NP-EXIT.    EXIT.

       LOAD-MANAGER.
           MOVE "REGISTER"     TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-TWO MESSAGE-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       DBGET-SETUP.
           MOVE SPACES         TO PERSONNEL-DATA.
           MOVE HELP-KEY       TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SHOWFORM-R.

           IF PER-CC-NUM NOT = HELP-KEY
               GO TO SHOWFORM-R.

           MOVE PER-EMP-NAME   TO  1-BUF.
           MOVE PER-CRAFT      TO  2-BUF.
           MOVE PER-MAINT-ZONE TO  3-BUF.
           MOVE PER-TEMP-ZONE  TO  4-BUF.
           MOVE MAN-DATA       TO  HOLD-AREA.

       SHOWFORM-R.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-TWO     TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ DISPLAY-FILE   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-TWO.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 1
               GO TO MAIN.

           IF KEY-HIT NOT = 0
               GO TO SHOWFORM-R.

           IF MAN-DATA = HOLD-AREA GO TO MAIN.

           IF PERSONNEL-DATA = SPACES
               GO TO ADD-RECORD
           ELSE
               GO TO CHANGE-RECORD.

       ADD-RECORD.
           MOVE HELP-KEY       TO PER-CC-NUM.
           MOVE 1-BUF          TO PER-EMP-NAME.
           MOVE 2-BUF          TO PER-CRAFT.
           MOVE 3-BUF          TO PER-MAINT-ZONE.
           MOVE 4-BUF          TO PER-TEMP-ZONE.

           WRITE PP-REC        FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "WRITE   " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FUNC
               MOVE DB-ERROR   TO ERRMSG2
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM-R.

           GO TO DBGET-SETUP.

       CHANGE-RECORD.
           MOVE HELP-KEY       TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG2
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM-R.

           MOVE 1-BUF          TO PER-EMP-NAME.
           MOVE 2-BUF          TO PER-CRAFT.
           MOVE 3-BUF          TO PER-MAINT-ZONE.
           MOVE 4-BUF          TO PER-TEMP-ZONE.

           REWRITE PP-REC      FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO ERRMSG2
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM-R.

           MOVE HIGH-VALUES    TO PERCCNUM OF PER-PERSONNEL.
           START PER-PERSONNEL KEY = PERCCNUM OF PER-PERSONNEL
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           GO TO DBGET-SETUP.

       END-OF-JOB.
           CLOSE               PER-PERSONNEL.
           CLOSE               DISPLAY-FILE.
           CLOSE               MPLTINFO-I.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

