       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPPLOAD.
       AUTHOR.                 CA YODER.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *C
      *C  03/11/1998   CA YODER   REQ #97-1125
      *C    THIS PROGRAM EXPANDS THE MMIS PASSWORD FIELD FROM
      *C    6 TO 8 CHARACTERS.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
                  ASSIGN       TO DATABASE-MCFLMM0301
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS       ARE STANDARD.
       01  PP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       WORKING-STORAGE SECTION.
       77  HOLD-AREA           PIC X(26) VALUE SPACES.
       77  OLD-TRAN-LEN        PIC 9(5)    VALUE 6   COMP-3.
       77  TRAN-LEN            PIC 9(5)    VALUE 8   COMP-3.
       77  OLD-TRAN-BUF        PIC X(06).
       77  TRAN-BUF            PIC X(08).
       77  TRAN-CODE           PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  OLD-PWORD-BUF.
           05  OLD-PWORD       PIC X(6).
           05  OLD-PWD-X       PIC X(2).

       01  NEW-PWORD-BUF.
           05  NEW-PWORD       PIC X(6).
           05  FILLER          PIC X(2)  VALUE SPACES.

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  PERSONNEL-DATA.
           COPY MPERSONL       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            PER-PERSONNEL.

       MAIN.
           READ PER-PERSONNEL  FIRST INTO PERSONNEL-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "READ    " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.
           GO TO GET-CONT.

       GET-DATA.
           READ PER-PERSONNEL  NEXT INTO PERSONNEL-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO END-OF-JOB
               ELSE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE "READ    " TO DB-FUNC
                   MOVE "PER-PERSONNEL" TO DB-FILE
                   DISPLAY DB-ERROR
                   GO TO END-OF-JOB.

       GET-CONT.
      *---------- GET VALUE OF PASSWORD X(6).
           MOVE PWORD-BUFF     TO OLD-PWORD-BUF.
           MOVE OLD-PWORD      TO OLD-TRAN-BUF.
           MOVE "1"            TO TRAN-CODE.
           CALL "CTRANS6"      USING OLD-TRAN-LEN
                               OLD-TRAN-BUF
                               TRAN-CODE.

      *---------- CONVERT TO X(8).
           MOVE OLD-TRAN-BUF   TO NEW-PWORD.
           MOVE NEW-PWORD-BUF  TO TRAN-BUF.
           MOVE "0"            TO TRAN-CODE.
           CALL "CTRANSLATE"   USING TRAN-LEN
                               TRAN-BUF
                               TRAN-CODE.

      *---------- MOVE TO NEW FORMAT.
           MOVE TRAN-BUF       TO PWORD-BUFF.
           MOVE OLD-PWD-X      TO PWD-X.
           MOVE SPACES         TO PER-PAD.

           REWRITE PP-REC      FROM PERSONNEL-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               DISPLAY DB-ERROR
               GO TO END-OF-JOB.

           GO TO GET-DATA.

       END-OF-JOB.
           CLOSE               PER-PERSONNEL.
           GOBACK.

