000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TPRATE.
000400*REMARKS.
000500*        ########################################################
000600*        #  Mass changes the personnel labor rate ............  #
000700*        ########################################################.
000800 ENVIRONMENT DIVISION.
000900 CONFIGURATION SECTION.
001000 SOURCE-COMPUTER. AS400.
001100 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.      I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                           LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPERSON-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001200 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                 PIC X(2000).
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
001300 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
       01  DSPLY-STATUS              PIC XX.
003000 01  ERROR-BUFFER              PIC X(80).
       COPY IOFEEDBACK OF COPYLIB.
003100 01  LABOR-RATE-WA.
           05  LRR                   PIC 9(6)V9(4).
003200     05  LABOR-RATE-READ REDEFINES LRR.
003300         10  LABOR-DOLS        PIC 999999.
003400         10  LABOR-DOLS-X REDEFINES LABOR-DOLS.
003500             15  LD-X-1        PIC X.
003600             15  LD-X-2        PIC X.
003700             15  LD-X-3        PIC X.
003800             15  LD-X-4        PIC X.
003900             15  LD-X-5        PIC X.
004000             15  LD-X-6        PIC X.
004100         10  LABOR-CENTS       PIC 9(4).
004200         10  LABOR-CENTS-X REDEFINES LABOR-CENTS.
004300             15  LC-X-1        PIC X.
004400             15  LC-X-2        PIC X.
004500             15  LC-X-3        PIC X.
004600             15  LC-X-4        PIC X.
004700     05  CRAFT-WA.
004800         10  CRAFT-1           PIC XX.
004900         10  CRAFT-2           PIC XX.
005000         10  CRAFT-3           PIC XX.
005100         10  CRAFT-4           PIC XX.
005200         10  CRAFT-5           PIC XX.
001400 01  PASSWORD-INFORMATION.
001500     05  NAME-OF-PROGRAM       PIC X(08) VALUE "TPRATE  ".
001600     05  PROGRAM-TYPE          PIC X(02) VALUE "MA".
001700     05  PROGRAM-RELEASE       PIC X(12) VALUE " E0100010001".
001800     05  PROGRAM-DESCRIPTION.
001900         10  PROG-DESC-A       PIC X(60) VALUE
002000             "CHANGES THE LABOR RATE IN THE PERSONNEL FILE "     .
002100         10  PROG-DESC-B       PIC X(60) VALUE SPACES.
002300         10  PROG-FUNCTION     PIC X(60) VALUE SPACES.
002500     05  PASSWORD-FLAG         PIC X.
005300 01  PER-PERSONNEL.           COPY MPERSONL OF COPYLIB.
       01  PF-STATUS                 PIC XX.
005400 COPY DBSTAT    OF COPYLIB.
002700 01  SUB1                      PIC S9(4) COMP-4.
002800 01  SUB2                      PIC S9(4) COMP-4.
       COPY WSCONTROL OF COPYLIB.
005600 LINKAGE SECTION.
005700 01  DBPARAMETERS.            COPY DBPARMS  OF COPYLIB.
005800 COPY VCOMLINK  OF COPYLIB.
005900 01  PLT-IDT                  PIC X(4).
006100 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
006200                      PLT-IDT.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PERSONNEL-FILE.
           GOBACK.
006300 1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   PERSONNEL-FILE.
006400     CALL "TPWORD" USING PASSWORD-INFORMATION.
006800     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
       6-MAIN.
008300     MOVE "FPERRAT" TO VIEW-CFNAME.
008700     MOVE SPACES TO LABOR-RATE-WA.
           MOVE ZEROES TO LRR.
           MOVE LABOR-RATE-WA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
011500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE DSPLY-REC TO LABOR-RATE-WA.
       6-MAIN-CONT.
           MOVE 0 TO COND-WORD.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL
               AT END    MOVE 11 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
015400     IF COND-WORD = 11 GO TO 6-MAIN-EXIT.
015800     IF CRAFT-WA = SPACES
015900         NEXT SENTENCE
016000     ELSE
016100     IF PER-CRAFT = CRAFT-1 OR CRAFT-2 OR CRAFT-3 OR CRAFT-4
016200                 OR CRAFT-5
016300         NEXT SENTENCE
016400     ELSE
016500     GO TO 6-MAIN-CONT.
016600     MOVE LABOR-RATE-READ TO PER-LABOR-RATE.
016700     MOVE 0 TO COND-WORD.
016800     REWRITE PFREC FROM PER-PERSONNEL
016900         INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
017000     IF COND-WORD = 17 GO TO 2-EOJ.
017200     GO TO 6-MAIN-CONT.
017300 6-MAIN-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

051100 999-CATREAD.
024000     MOVE SPACES TO ERROR-BUFFER.
024100     CALL "CCATREAD" USING CATREAD-PARMS.
024200     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
052100 999-CATREAD-EXIT.
052200     EXIT.
