       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPRINTWO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          C01 IS NEW-PAGE
                               LOCAL-DATA IS LOCAL-DATA-AREA
                               I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
      *C****************************************************************
      *C 09/29/94  WILL MCINTYRE  REQUEST #94-040
      *C    REVISED TPRINTWO TO PRINT RESPONSE CRAFTSMAN ENTERED
      *C    WHEN ASKED WHETHER PROPER ASBESTOS HANDLING PROCEDURES
      *C    WERE FOLLOWED DURING WORK ON EQUIPMENT.
      *C****************************************************************
      *C****************************************************************
      *C 03/06/97     WDR.
      *C    REMOVED PAGE ADVANCE TO AVOID BLANK PAGE
      *C    BEFORE PRINTOUT ON LASER PRINTERS
      *C****************************************************************
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ZONE-PRINTER
                  ASSIGN       TO DATABASE-MCFLZP0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT CH-PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.
       FD  ZONE-PRINTER
           LABEL RECORDS       ARE STANDARD.
       01  ZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLZP0101.

       FD  CH-PRINT-FILE
           LABEL RECORD        IS OMITTED
           RECORD CONTAINS     132 CHARACTERS
           DATA RECORD         IS PRINT-REC.
       01  PRINT-REC           PIC X(132).

       WORKING-STORAGE SECTION.
       77  LINE-CTR            PIC 99 VALUE 0.
       77  NUM-COPIES          PIC S99 COMP-4 VALUE 1.
       77  ZONE-KEY            PIC X(04).
       77  ASTERISK-LINE       PIC X(80) VALUE ALL "*".
       77  PROP-PROC           PIC X(01) VALUE SPACES.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM PIC X(08) VALUE "TPRINTWO".
           05  PROGRAM-TYPE    PIC X(02) VALUE "RE".
           05  PROGRAM-RELEASE PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESCA1 PIC X(30)   VALUE
                   "PRINTS WORKORDERS AND COMMENTS".
               10  PROG-DESCA2 PIC X(30)   VALUE
                   " ON DESIGNATED PRINTER.       ".
               10  PROG-DESC-B PIC X(60)   VALUE SPACES.
               10  PROG-FUNC   PIC X(60)   VALUE SPACES.
           05  PASSWORD-FLAG   PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  DATE-BUFF.
           05  DB-YY           PIC XX.
           05  DB-MM           PIC XX.
           05  DB-DD           PIC XX.

       01  TIME-BUFFER.
           05  CUR-TIME.
               10  CUR-HRS     PIC XX.
               10  CUR-MIN     PIC XX.
           05  CUR-SECS        PIC XXXX.

       01  TIME-BUFHMS.
           05  TB-HRS          PIC XX.
           05  FILLER          PIC X       VALUE ":".
           05  TB-MIN          PIC XX.
           05  FILLER          PIC X       VALUE ":".
           05  TB-SECS         PIC XX.

       01  ZONE-PRT-BUFFER.
           05  ZONE-BUF          PIC X(04) VALUE SPACES.
           05  PRINTER-BUFFERS.
               10  PRINTER-BUF-V.
                   15  P-BUF-V-1 PIC X     VALUE SPACES.
                   15  P-BUF-V-2 PIC X     VALUE SPACES.
               10  PRINT-BUF-V-9 REDEFINES PRINTER-BUF-V PIC 99.
               10  PRINTER-BUF-P.
                   15  P-BUF-P-1 PIC X     VALUE SPACES.
                   15  P-BUF-P-2 PIC X     VALUE SPACES.
               10  PRINT-BUF-P-9 REDEFINES PRINTER-BUF-P PIC 99.
               10  PRINTER-BUF-E.
                   15  P-BUF-E-1 PIC X     VALUE SPACES.
                   15  P-BUF-E-2 PIC X     VALUE SPACES.
               10  PRINT-BUF-E-9 REDEFINES PRINTER-BUF-E PIC 99.
               10  PRINTER-BUF-M.
                   15  P-BUF-M-1 PIC X     VALUE SPACES.
                   15  P-BUF-M-2 PIC X     VALUE SPACES.
               10  PRINT-BUF-M-9 REDEFINES PRINTER-BUF-M PIC 99.
               10  PRINTER-BUF-X.
                   15  P-BUF-X-1 PIC X     VALUE SPACES.
                   15  P-BUF-X-2 PIC X     VALUE SPACES.
               10  PRINT-BUF-X-9 REDEFINES PRINTER-BUF-X PIC 99.

       01  WO-LINE-0.
           05  WO-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(30) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "DATE:  ".
           05  CUR-DATE.
               10  C-DATE-MD   VALUE SPACES   PIC X(02).
               10  C-DATE-S1   VALUE "/"      PIC X.
               10  C-DATE-DM   VALUE SPACES   PIC X(02).
               10  C-DATE-S2   VALUE "/"      PIC X.
               10  C-DATE-YY   VALUE SPACES   PIC X(02).
           05  FILLER          PIC X(11) VALUE "    TIME:  ".
           05  CUR-TIME.
               10  CR-HRS      PIC X(02) VALUE SPACES.
               10  FILLER      PIC X(01) VALUE ":".
               10  CR-MIN      PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-1.
           05  FILLER          PIC X(09) VALUE "W/O NUM: ".
           05  WO-NUMB         PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE "W/O STATUS: ".
           05  WO-ST           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(06) VALUE "TYPE: ".
           05  WO-TY.
               10  WO-TY1      PIC X(01) VALUE SPACES.
               10  WO-TY2      PIC X(01) VALUE SPACES.
           05  FILLER          PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "DATE RECD: ".
           05  RC-MM           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  RC-DD           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  RC-YY           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  RC-HH           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE ":".
           05  RC-MI           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-2.
           05  FILLER          PIC X(10) VALUE "APPROVAL: ".
           05  APP-CD          PIC X(01) VALUE SPACE.
           05  FILLER          PIC X(15) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "REQUESTER: ".
           05  WO-REQ          PIC X(16) VALUE SPACES.
           05  FILLER          PIC X(09) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "EQUIP NUM: ".
           05  WO-EQP          PIC X(06) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-3.
           05  FILLER          PIC X(16) VALUE "EQUIPMENT NAME: ".
           05  WO-ENAM         PIC X(50) VALUE SPACES.
           05  FILLER          PIC X(04) VALUE "   (".
           05  TYP-NUM         PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE ") ".

       01  WO-LINE-4.
           05  FILLER          PIC X(06) VALUE "DEPT: ".
           05  WO-DEPT         PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE "MAINT ZONE: ".
           05  WO-ZONE         PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(09) VALUE SPACES.
           05  FILLER          PIC X(10) VALUE "LOCATION: ".
           05  WO-LOC          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE SPACES.
           05  FILLER          PIC X(10) VALUE "PRIORITY: ".
           05  WO-PRTY         PIC X(01) VALUE SPACE.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-5.
           05  FILLER          PIC X(12) VALUE "EQUIP DOWN: ".
           05  WO-EDWN         PIC X(01) VALUE SPACE.
           05  FILLER          PIC X(11) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE "CRAFT REQD: ".
           05  WO-C1           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACE.
           05  WO-C2           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACE.
           05  WO-C3           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(16) VALUE SPACE.
           05  FILLER          PIC X(11) VALUE "EXP CLASS: ".
           05  WO-EXP          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-6.
           05  FILLER          PIC X(13) VALUE "DESCRIPTION: ".
           05  WO-DES1         PIC X(30) VALUE SPACES.
           05  FILLER          PIC X(37) VALUE SPACES.

       01  WO-LINE-7.
           05  FILLER          PIC X(13) VALUE SPACES.
           05  WO-DES2         PIC X(66) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-8.
           05  FILLER          PIC X(13) VALUE SPACES.
           05  WO-DES3         PIC X(66) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-9.
           05  FILLER          PIC X(11) VALUE "CRAFTSMEN: ".
           05  CFT-1           PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  CFT-2           PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  CFT-3           PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(26) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "TIME STRT: ".
           05  TS-MM           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  TS-DD           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  TS-YY           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  TS-HH           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE ":".
           05  TS-MI           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  WO-LINE-10.
           05  FILLER          PIC X(14) VALUE "FAILURE CODE: ".
           05  FAIL-12         PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "-".
           05  FAIL-36         PIC X(04) VALUE SPACES.
           05  FILLER          PIC X(32) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "TIME COMP: ".
           05  TC-MM           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  TC-DD           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE "/".
           05  TC-YY           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  TC-HH           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE ":".
           05  TC-MI           PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(01) VALUE SPACES.

       01  COMMENT-HEADER.
           05  FILLER          PIC X(05) VALUE SPACES.
           05  FILLER          PIC X(09) VALUE "COMMENTS:".
           05  FILLER          PIC X(66) VALUE SPACES.

       01  COMMENTS-LINE.
           05  FILLER          PIC X(05) VALUE SPACES.
           05  COMENT          PIC X(70) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE SPACES.

       01  ASBESTOS-LINE.
           05  FILLER          PIC X(20) VALUE "***              WOR".
           05  FILLER          PIC X(20) VALUE "KORDER FLAGGED FOR P".
           05  FILLER          PIC X(20) VALUE "OSSIBLE ASBESTOS HAZ".
           05  FILLER          PIC X(20) VALUE "ARD              ***".

       01  ASB-BLANK-LINE.
           05  FILLER          PIC X(20) VALUE "***                 ".
           05  FILLER          PIC X(20) VALUE "                    ".
           05  FILLER          PIC X(20) VALUE "                    ".
           05  FILLER          PIC X(20) VALUE "                 ***".

       01  ASB-GOOD-LINE.
           05  FILLER          PIC X(20) VALUE "***           PROPER".
           05  FILLER          PIC X(20) VALUE " PROCEDURES WERE FOL".
           05  FILLER          PIC X(09) VALUE "LOWED  - ".
           05  ASB-GOOD-DTE    PIC X(08).
           05  FILLER          PIC X(01) VALUE " ".
           05  ASB-GOOD-TIM    PIC X(08).
           05  FILLER          PIC X(14) VALUE "           ***".

       01  ASB-BAD-LINE.
           05  FILLER          PIC X(20) VALUE "###  Proper Procedur".
           05  FILLER          PIC X(20) VALUE "es Were NOT Followed".
           05  FILLER          PIC X(20) VALUE ".  May Need To Inves".
           05  FILLER          PIC X(20) VALUE "tigate Further.  ###".

           COPY OVRPFDATA      IN COPYLIB.

           COPY CCHKOBJ        IN COPYLIB.

       LINKAGE SECTION.
       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  COMMENTS-BUFFER.
           05  CMTS-1          PIC X(70).
           05  CMTS-2          PIC X(70).
           05  CMTS-3          PIC X(70).
           05  CMTS-4          PIC X(70).
           05  CMTS-5          PIC X(70).

       PROCEDURE DIVISION      USING
                               WO-BASIC-DATA
                               DBPARAMETERS
                               COMMENTS-BUFFER.
       START-PGM.
           ACCEPT DATE-BUFF    FROM DATE.
           MOVE DB-MM          TO C-DATE-MD.
           MOVE DB-DD          TO C-DATE-DM.
           MOVE DB-YY          TO C-DATE-YY.
           IF DATE-FLAG = 3
               MOVE DB-DD      TO C-DATE-MD
               MOVE DB-MM      TO C-DATE-DM.

           ACCEPT TIME-BUFFER  FROM TIME.
           MOVE CUR-HRS        TO CR-HRS TB-HRS.
           MOVE CUR-MIN        TO CR-MIN TB-MIN.
           MOVE CUR-SECS       TO TB-SECS.

           IF RETURN-BYTE = "5"
               OPEN INPUT      ZONE-PRINTER
      *        MOVE 0          TO OVRPRTF-TOFILE-NUM
               MOVE "P "       TO OVRPRTF-TOFILE-NUM-X
               MOVE "CWPR"     TO ZONEKEY OF ZONE-PRINTER
               READ ZONE-PRINTER INTO ZONE-PRT-BUFFER
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-READ
               IF FILE-STAT NOT = "00"
                   CLOSE       ZONE-PRINTER
               ELSE
                   MOVE PRINT-BUF-V-9 TO OVRPRTF-TOFILE-NUM
                   GO TO PRINTER-FILE-SETUP.

           IF RETURN-BYTE = "Y" OR "N"
              MOVE RETURN-BYTE TO PROP-PROC.
           IF RETURN-BYTE = "5"
               MOVE "4"        TO RETURN-BYTE.
           IF RETURN-BYTE = "2" OR "3" OR "4"
               NEXT SENTENCE
           ELSE
               MOVE "1"        TO RETURN-BYTE.

           OPEN INPUT          ZONE-PRINTER.
      *    MOVE 0              TO OVRPRTF-TOFILE-NUM.
           MOVE "P "           TO OVRPRTF-TOFILE-NUM-X.

           MOVE ZONE           TO ZONEKEY OF ZONE-PRINTER.
           READ ZONE-PRINTER   INTO ZONE-PRT-BUFFER
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO PRINTER-FILE-SETUP.

           MOVE PRINT-BUF-V-9     TO OVRPRTF-TOFILE-NUM.
           IF RETURN-BYTE = "2"
               MOVE PRINT-BUF-P-9 TO OVRPRTF-TOFILE-NUM.
           IF RETURN-BYTE = "3"
               MOVE PRINT-BUF-E-9 TO OVRPRTF-TOFILE-NUM.
           IF RETURN-BYTE = "4"
               MOVE PRINT-BUF-M-9 TO OVRPRTF-TOFILE-NUM.

       PRINTER-FILE-SETUP.
           CLOSE               ZONE-PRINTER.
           IF OVRPRTF-TOFILE-NUM-X = "P "
               GO TO PRINT-DATA
           ELSE
           IF OVRPRTF-TOFILE-NUM = 0
               GO TO PRINT-DATA.

           COPY OVRPFCALL      IN COPYLIB.

       PRINT-DATA.
           OPEN OUTPUT         CH-PRINT-FILE.
           MOVE WO-NUM         TO WO-NUMB.
           MOVE WO-STATUS      TO WO-ST.
           MOVE WO-STRT-STATUS TO WO-TY.
           MOVE DATE-RECD-MM   TO RC-MM.
           MOVE DATE-RECD-DD   TO RC-DD.
           MOVE DATE-RECD-YY   TO RC-YY.
           IF DATE-FLAG = 3
               MOVE DATE-RECD-DD TO RC-MM
               MOVE DATE-RECD-MM TO RC-DD.

           MOVE TIME-RECD-HH   TO RC-HH.
           MOVE TIME-RECD-MM   TO RC-MI.
           MOVE APPROVAL-CODE  TO APP-CD.
           MOVE REQUESTER-B    TO WO-REQ.
           MOVE EQUIP-NUM      TO WO-EQP.
           MOVE EQUIP-NAME     TO WO-ENAM.
           MOVE TYPE-NUM       TO TYP-NUM.
           MOVE DEPT           TO WO-DEPT.
           MOVE ZONE           TO WO-ZONE.
           MOVE LOCATION       TO WO-LOC.
           MOVE PRIORITY       TO WO-PRTY.
           MOVE EQUIP-DOWN     TO WO-EDWN.
           MOVE CRAFTS-REQD-1  TO WO-C1.
           MOVE CRAFTS-REQD-2  TO WO-C2.
           MOVE CRAFTS-REQD-3  TO WO-C3.
           MOVE EXP-CLASS      TO WO-EXP.
           MOVE DESCRIPTION-1  TO WO-DES1.
           MOVE DESCRIPTION-2-1 TO WO-DES2.
           MOVE DESCRIPTION-2-2 TO WO-DES3.
           MOVE CRAFTSMEN-1    TO CFT-1.
           MOVE CRAFTSMEN-2    TO CFT-2.
           MOVE CRAFTSMEN-3    TO CFT-3.
           MOVE DATE-STRT-MM   TO TS-MM.
           MOVE DATE-STRT-DD   TO TS-DD.
           MOVE DATE-STRT-YY   TO TS-YY.
           IF DATE-FLAG = 3
               MOVE DATE-STRT-DD TO TS-MM
               MOVE DATE-STRT-MM TO TS-DD.

           MOVE TIME-STRT-HH   TO TS-HH.
           MOVE TIME-STRT-MM   TO TS-MI.
           MOVE FAIL-CODE-REASON TO FAIL-12.
           MOVE FAIL-CODE-SUBSYS TO FAIL-36.
           MOVE DATE-COMP-MM   TO TC-MM.
           MOVE DATE-COMP-DD   TO TC-DD.
           MOVE DATE-COMP-YY   TO TC-YY.
           IF DATE-FLAG = 3
               MOVE DATE-COMP-DD TO TC-MM
               MOVE DATE-COMP-MM TO TC-DD.

           MOVE TIME-COMP-HH   TO TC-HH.
           MOVE TIME-COMP-MM   TO TC-MI.

           IF WO-TY2 = "V"
               MOVE "VERBAL WORK ORDER " TO WO-FILE
           ELSE
               MOVE "PLANNED WORK ORDER" TO WO-FILE.

           MOVE SPACES         TO PRINT-REC.
      ******************************************************************
      ***>> REMOVED PAGE ADVANCE TO AVOID BLANK PAGE
      ***>> BEFORE PRINTOUT ON LASER PRINTERS
      ***>> 3/6/97     WDR.
      ***>>WRITE PRINT-REC     AFTER ADVANCING PAGE.
      ******************************************************************
           WRITE PRINT-REC     AFTER ADVANCING 0 LINE.
           MOVE WO-LINE-0      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-1      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2 LINES.
           MOVE WO-LINE-2      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2 LINES.
           MOVE WO-LINE-3      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-4      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-5      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-6      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-7      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-8      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-9      TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE WO-LINE-10     TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE COMMENT-HEADER TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2 LINE.
           MOVE CMTS-1         TO COMENT.
           MOVE COMMENTS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE CMTS-2         TO COMENT.
           MOVE COMMENTS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE CMTS-3         TO COMENT.
           MOVE COMMENTS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE CMTS-4         TO COMENT.
           MOVE COMMENTS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.
           MOVE CMTS-5         TO COMENT.
           MOVE COMMENTS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.

           IF ZONE NOT = "ABST"
               GO TO 2-EOJ.

           MOVE ASTERISK-LINE  TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2 LINES.
           MOVE ASBESTOS-LINE  TO PRINT-REC.
           WRITE PRINT-REC.
           IF PROP-PROC = "Y"
              MOVE CUR-DATE    TO ASB-GOOD-DTE
              MOVE TIME-BUFHMS TO ASB-GOOD-TIM
              MOVE ASB-GOOD-LINE TO PRINT-REC
              WRITE PRINT-REC
           ELSE
           IF PROP-PROC = "N"
              MOVE ASB-BAD-LINE  TO PRINT-REC
              WRITE PRINT-REC
              PERFORM 5 TIMES
                WRITE PRINT-REC
              END-PERFORM
              MOVE ASB-BLANK-LINE  TO PRINT-REC
              WRITE PRINT-REC.
           MOVE ASTERISK-LINE  TO PRINT-REC.
           WRITE PRINT-REC.

       2-EOJ.
           CLOSE CH-PRINT-FILE.
      *    IF OVRPRTF-TOFILE-NUM > 0
      *        MOVE "DLTOVR FILE(MCPRT)" TO OVRPRTF-PARM1
      *        CALL "QCMDEXC"  USING
      *                        OVRPRTF-PARM1
      *                        OVRPRTF-PARM2.
           IF OVRPRTF-TOFILE-NUM-X = "P "
               NEXT SENTENCE
           ELSE
           IF OVRPRTF-TOFILE-NUM = 0
               NEXT SENTENCE
           ELSE
           MOVE "DLTOVR FILE(MCPRT)" TO OVRPRTF-PARM1
           CALL "QCMDEXC"  USING
                           OVRPRTF-PARM1
                           OVRPRTF-PARM2.
           GOBACK.

