000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TPROCAVG.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         MAY 30, 1985.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
      *
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      MATERIAL ACCUM MASTER DATA SET
001000*                      AND CALCULATE A NEW AVERAGE COST FOR ALL
001100*                      PROCESS ITEMS (100 AND 400 CLASSES).
001200*                      IT WILL ALSO VALUE ALL ISSUES FOR THE
001300*                      MONTH AT THE NEW AVERAGE.
001400*                      THIS PROGRAM WILL PRINT A
001500*                      REPORT OF ALL NEW AVERAGE COSTS AND
001600*                      WILL FLAG THOSE AVERAGE COSTS WHICH
001700*                      HAVE CHANGED MORE THAN 15%.
001800*                      THIS PROGRAM WILL BE RUN ONLY AT THE END
001900*                      OF EACH MONTH FOLLOWING THE LAST MANIFEST
002000*                      RELEASE TO STORES.
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   16SEP1996    DAVE PLUM
      *C     RECOMPILED FOR CENTURY DATABASE CHANGES.
      *C
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.      HP-3000.
002500 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002700
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MMATL-ACCUM-MC-O
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-O
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-O
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DDAILYTC-DT-O
               ASSIGN TO DATABASE-MCFLCS1601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-O
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.
003200
003300 DATA DIVISION.
003400
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FILE SECTION.
       FD  MMATL-ACCUM-MC-O
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-O.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MSTORERM-CD-O
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-O.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DTRANS-MC-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-O.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  DDAILYTC-DT-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-DT-REC-O.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  MACCOUNT-INFO-IK-O
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-O.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
003600
003700 FD  ONLINE-PRT
003800     DATA RECORD IS PRT-REC
003900     RECORD CONTAINS 133 CHARACTERS
004000     LABEL RECORDS ARE OMITTED.
004100
004200 01  PRT-REC                       PIC X(133).
004300
004400 SD  SORT-FILE
004500     DATA RECORD IS SORT-REC
004600     RECORD CONTAINS 60 CHARACTERS.
004700
004800 01  SORT-REC.
004900     05  SORT-CLASS               PIC X(4).
005000     05  SORT-STORES-CODE         PIC X(8).
005100     05  SORT-PREV-AVG            PIC S9(11)V9(4).
005200     05  SORT-NEW-AVG             PIC S9(11)V9(4).
005300     05  SORT-STD-COST            PIC S9(11)V9(4).
005400     05  SORT-15-FLAG             PIC X.
005500     05  SORT-UNIT-MEASURE        PIC XX.
005600
005700 WORKING-STORAGE SECTION.
005800 77  NO-MORE-SORT                 PIC XXX         VALUE SPACES.
005900 77  LINE-CNT                     PIC 99          VALUE 0.
006000 77  PAGE-CNT                     PIC 9(4)        VALUE 0.
006100 77  OLD-AVG-COST                 PIC S9(11)V9(4) VALUE 0.
006200 77  NEW-AVG-COST                 PIC S9(11)V9(4) VALUE 0.
006300 77  INV-UNIT-COST                PIC S9(12)V9(4) VALUE 0.
006400 77  TOTAL-OPEN-RCVR-DLRS         PIC S9(12)V99   VALUE 0.
006500 77  TOTAL-UNITS                  PIC S9(10)      VALUE 0.
006600 77  TOTAL-DOLLARS                PIC S9(12)V99   VALUE 0.
006700 77  MONTH-END-SW                 PIC X           VALUE SPACES.
       77  MCXCBLERR-SCOPE              PIC X(1)        VALUE "C".
006800
006900 COPY SOPNRAV IN COPYLIB.
007000
007100 COPY TDATECHK IN COPYLIB.
007200
007300************************************************************
007400**     REPORT PRINT LINES                                 **
007500************************************************************
007600
007700 01  HEADER1.
007800     05  FILLER                     PIC X      VALUE SPACES.
007900     05  FILLER                     PIC X(19)
008000         VALUE "TPROCAVG".
008100     05  FILLER                     PIC X(42)
008200         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
008300     05  FILLER                     PIC X(5)   VALUE "DATE ".
008400     05  DATE-H1                    PIC X(8)   VALUE SPACES.
008500     05  FILLER                     PIC X(6)   VALUE SPACES.
008600
008700 01  HEADER2.
008800     05  FILLER                     PIC X      VALUE SPACES.
008900     05  FILLER                     PIC X(6)   VALUE "PAGE".
009000     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
009100     05  FILLER                     PIC X(13)  VALUE SPACES.
009200     05  FILLER                     PIC X(38)
009300         VALUE "AVERAGE COST CHANGE REPORT".
009400     05  FILLER                     PIC X(5)   VALUE "TIME ".
009500     05  TIME-H2                    PIC X(8)   VALUE SPACES.
009600
009700 01  HEADER3.
009800     05  FILLER                     PIC X(27) VALUE SPACES.
009900     05  FILLER                     PIC X(8)  VALUE "PREVIOUS".
010000     05  FILLER                     PIC X(11) VALUE SPACES.
010100     05  FILLER                     PIC X(39) VALUE "NEW".
010200
010300 01  HEADER4.
010400     05  FILLER                     PIC X(34)
010500         VALUE "MATERIAL CODE  UM     AVERAGE COST".
010600     05  FILLER                     PIC X(5)  VALUE SPACES.
010700     05  FILLER                     PIC X(23)
010800         VALUE "AVERAGE COST   OVER 15%".
010900     05  FILLER                     PIC X(20)
011000         VALUE "    STANDARD COST   ".
011100     05  FILLER                     PIC X(11)
011200         VALUE "DESCRIPTION".
011300
011400 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.
011500
011600 01  DETAIL-LINE.
011700     05  PRT-CLASS                  PIC X(3)   VALUE SPACES.
011800     05  PRT-HYPHEN                 PIC X      VALUE SPACES.
011900     05  PRT-MATLCODE               PIC X(7)   VALUE SPACES.
012000     05  FILLER                     PIC X(4)   VALUE SPACES.
012100     05  PRT-UM                     PIC XX     VALUE SPACES.
012200     05  FILLER                     PIC X(1)   VALUE SPACES.
012300     05  PRT-PREV-COST              PIC Z(11).Z(4).
012400     05  FILLER                     PIC X(1)   VALUE SPACES.
012500     05  PRT-NEW-COST               PIC Z(11).Z(4).
012600     05  FILLER                     PIC X(3)   VALUE SPACES.
012700     05  PRT-15-FLAG                PIC X(8)   VALUE SPACES.
012800     05  FILLER                     PIC X(1)   VALUE SPACES.
012900     05  PRT-STD-COST               PIC Z(11).Z(4).
013000     05  FILLER                     PIC X(3)   VALUE SPACES.
013100     05  PRT-DESC                   PIC X(50)  VALUE SPACES.
013200
013300*01  DETAIL-LINE2.
013400*    05  FILLER                     PIC X(14) VALUE SPACES.
013500*    05  PRT-DESC                   PIC X(80) VALUE SPACES.
013600
013700************************************************************
013800**                                                        **
013900**           D A T A B A S E   B U F F E R S              **
014000**                                                        **
014100************************************************************
014200
014300*********************
014400**  MACCOUNT-INFO  **
014500*********************
014600
014700 COPY MACTINFO IN COPYLIB.
014800
014900*********************
015000**  MMATL-ACCUM    **
015100*********************
015200
015300 COPY MATLACUM IN COPYLIB.
015400
015500******************
015600**    DTRANS    **
015700******************
015800 COPY DTRANS IN COPYLIB.
015900
016000*****************
016100*   MSTORERM    *
016200*****************
016300
016400 COPY MSTORERM IN COPYLIB.
016500
016600*************************
016700**   DDAILYTC          **
016800*************************
016900
017000 COPY DDAILYTC IN COPYLIB.
017100
017200 COPY TC311 IN COPYLIB.
017300
017500***********************
017600*  MCHT-ACCTS         *
017700***********************
017800
017900 COPY MCHTACCT IN COPYLIB.
018000
018100**********************************************************
018200*              D A T A    B A S E                        *
018300**********************************************************
018400
       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

018500 COPY DBCSACCT IN COPYLIB.
018600
018700 01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
018900
019000 COPY DBMODES IN COPYLIB.
019100
019200 COPY DBSTAT IN COPYLIB.
019300
020900 01  IMAGE-ARGS.
021000     05  MACCT-KEY        PIC X(4)   VALUE SPACES.
021100     05  MMATL-CODE-ARG   PIC X(8)   VALUE SPACES.
021200     05  DEPT-ARG         PIC X(6)   VALUE SPACES.
021300
021400******************************************************
021500**   PARAMETERS FOR CALLING 'CDESC'
021600******************************************************
021700
021800 COPY CDESC IN COPYLIB.
021900
022000 01  RET-CODE                     PIC X(2)   VALUE SPACES.
022100
022200*******************************************************
022300*   PARAMETERS USED IN 'TBLOWUP' ROUTINE (PRINTS      *
022400*   ERRORS AND ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO  *
022500*   READ ERRORS).                                     *
022600*******************************************************
022700
022800 COPY TBLOWUP IN COPYLIB.
022900
023000******************************************
023100**   PARAMETERS FOR CALLING 'CBLOWSRT'
023200******************************************
023300
023400 COPY CBLOWSRT IN COPYLIB.
023500
023700 PROCEDURE DIVISION.
023800
023900 001-BEGIN SECTION.
024000
024100 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

024200*******************************************************
024300**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
024400**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
024500**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
024600**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
024700**   OCCURS
024800*******************************************************
024900
025000     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
025100                           ACCTG-BASE,
025200                           BU-PGM-NAME,
025300                           STATUS-AREA,
025400                           DUMMY-VIEW-AREA,
025500                           FILE-STATUS,
025600                           BU-DISPLAY-MSG,
025700                           BU-DISPLAY-FLDS.
025800
025900     DISPLAY "IS THIS A MONTH END FINAL RUN 'Y' OR 'N'".
026000     ACCEPT MONTH-END-SW.
026100     DISPLAY "MONTH END RUN =", MONTH-END-SW.
026200     IF MONTH-END-SW = "Y" OR "N"
026300         NEXT SENTENCE
026400     ELSE
026500         MOVE "MONTH END PARM INVALID *010-M" TO BU-DISPLAY-MSG
026600         MOVE MONTH-END-SW        TO BU-DISPLAY-FLD (2)
026700         MOVE ZEROS               TO COND-WORD
026800         PERFORM 990-BLOWUP.
026900
027000     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
027100                                     SORT-STORES-CODE
027200     INPUT PROCEDURE IS 050-PROCESS-TRANS
027300     OUTPUT PROCEDURE IS 700-CREATE-REPORT.
027400     PERFORM 1000-CLOSE-FILES.
027500     GOBACK.
027600
027800 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
027900     PERFORM 100-BEGIN.
028000     PERFORM 200-PROCESS-MASTER
028100         UNTIL END-OF-FILE.
028200
028300**********************************************************
028400*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
028500*  FOR SORTING OF RECORDS.                               *
028600**********************************************************
028700
028800     GO TO 699-PROCESS-EXIT.
028900
029000 100-BEGIN.
           PERFORM 9999-OPEN-STUFF.
030900
031000     MOVE SPACES                  TO BUF-DDAILYTC.
           PERFORM 9999-INIT-MMATL-ACCUM-MC-O.
031100     PERFORM 400-GET-MMATL-ACCUM.
031200
031300
031400 200-PROCESS-MASTER.
031500     IF  (MATL-CLASS > 099 AND MATL-CLASS < 200)
031600      OR (MATL-CLASS > 399 AND MATL-CLASS < 500)
031700         PERFORM 500-GET-MSTORERM
031800         IF NO-ENTRY
031900             NEXT SENTENCE
032000         ELSE
032100             PERFORM 510-CALCULATE-AVG-COST.
032200
032300     PERFORM 400-GET-MMATL-ACCUM.
032400
032600 400-GET-MMATL-ACCUM.
           PERFORM 9999-DBGET2-MMATL-ACCUM-MC-O.
033400     IF GOOD-CALL
033500         NEXT SENTENCE
033600     ELSE
033700         IF END-OF-FILE
033800             NEXT SENTENCE
033900         ELSE
034000             MOVE "GET MMATL-ACCUM * 400-GMA" TO BU-DISPLAY-MSG
034100             PERFORM 990-BLOWUP.
034200
034300     MOVE MATL-STORES-CODE        TO MMATL-CODE-ARG.
034400
034600 500-GET-MSTORERM.
           PERFORM 9999-DBGET7-MSTORERM-CD-O.
035400     IF GOOD-CALL
035500         MOVE STR-AVG-COST        TO OLD-AVG-COST
035600     ELSE
035700        IF NO-ENTRY
035800            NEXT SENTENCE
035900        ELSE
036000             MOVE "GET MSTORERM * 500-GM" TO BU-DISPLAY-MSG
036100             PERFORM 990-BLOWUP.
036200
036400 510-CALCULATE-AVG-COST.
036500     PERFORM 600-CALCULATE-NEW-COST.
036600     IF MONTH-END-SW = "Y"
036700         IF NEW-AVG-COST = OLD-AVG-COST
036800             NEXT SENTENCE
036900         ELSE
037000             PERFORM 650-UPDATE-AVG-COST
037100             PERFORM 660-ADD-DDAILYTC.
037200     IF MONTH-END-SW = "Y"
037300         PERFORM 670-UPDATE-MMATL-ACCUM.
037400
037600 600-CALCULATE-NEW-COST.
037700********************************************************
037800**   CALL 'SOPNRAV' TO GET STOREROOM OPEN RECEIVER
037900**   UNITS
038000********************************************************
038100     MOVE MMATL-CODE-ARG          TO SOPNRAV-MATL-CODE.
038200     CALL "SOPNRAV" USING ACCTG-BASE,
038300                          SOPNRAV-PARMS,
038400                          STATUS-AREA,
038500                          BU-DISPLAY-MSG,
038600                          BU-DISPLAY-FLDS.
038700     IF BU-DISPLAY-MSG NOT = SPACES
038800         PERFORM 990-BLOWUP.
038900
039000**********************************************************
039100**   IF OPEN RECEIVER UNITS (S-STR-OPEN-RCVR-UNITS)
039200**   EXIST THAN CALCULATE A UNIT PRICE TO BRING THOSE
039300**   UNITS IN AT WHEN CALCULATING A NEW AVERAGE COST.
039400**     CASE 1: USE THIS MONTHS INVOICE UNIT COST
039500**              (MATL-INV-DOLLARS / MATL-RCPT-UNITS)
039600**     CASE 2: IF THIS MONTHS INVOICE UNIT COST IS ZERO
039700**             USE LAST MONTHS AVERAGE COST
039800**     CASE 3: IF LAST MONTHS AVERAGE COST IS ZERO USE
039900**             STANDARD COST
040000**   ONCE A UNIT COST IS DERIVED EXTEND OUT OPEN RECEIVER
040100**   UNITS (S-STR-OPEN-RCVR-UNITS) GIVING A TOTAL
040200**   OPEN RECEIVER VALUE (TOTAL-OPEN-RCVR-DLRS)
040300**********************************************************
040400     MOVE ZEROS                   TO INV-UNIT-COST,
040500                                     TOTAL-OPEN-RCVR-DLRS.
040600     IF S-STR-OPEN-RCVR-UNITS > 0
040700         IF MATL-INV-DOLLARS > 0 AND MATL-RCPT-UNITS > 0
040800             COMPUTE INV-UNIT-COST ROUNDED = MATL-INV-DOLLARS /
040900                                              MATL-RCPT-UNITS
041000             COMPUTE TOTAL-OPEN-RCVR-DLRS ROUNDED =
041100                     INV-UNIT-COST * S-STR-OPEN-RCVR-UNITS
041200         ELSE
041300             MOVE OLD-AVG-COST    TO INV-UNIT-COST
041400             IF INV-UNIT-COST = ZEROS
041500                 MOVE STR-STD-COST  TO  INV-UNIT-COST
041600                 COMPUTE TOTAL-OPEN-RCVR-DLRS ROUNDED =
041700                         INV-UNIT-COST * S-STR-OPEN-RCVR-UNITS
041800             ELSE
041900                 COMPUTE TOTAL-OPEN-RCVR-DLRS ROUNDED =
042000                         INV-UNIT-COST * S-STR-OPEN-RCVR-UNITS.
042100
042200**************************************************************
042300**   THE AVERAGE COST FORMULA IS :
042400**     TOTAL-DOLLARS = BEG. DLRS + INVOICE DLRS + ACCOUNTING
042500**                     DLRS CORRECTION + OPEN RECEIVER DLRS
042600**     -----------------------------------------------------
042700**     TOTAL-UNITS   = BEG. UNITS + INVOICE UNITS + ACCOUNTING
042800**                     UNIT CORRECTION + OPEN RECEIVER UNITS
042900**
043000**   IF TOTAL-DOLLARS OR TOTAL UNITS ARE ZEROS THEN IF
043100**   INVOICE UNITS EXIST USE INVOICE UNIT COST AS THE NEW
043200**   AVERAGE COST.
043300**
043400**   IF TOTAL-UNITS OR TOTAL-DOLLARS ARE LESS THAN ZERO THEN
043500**   USE LAST MONTHS AVERAGE COST AS THE NEW AVERAGE COST
043600**
043700**   IF TOTAL-UNITS AND TOTAL-DOLLARS ARE GREATER THAN ZERO
043800**   THEN   NEW AVERAGE COST IS EQUAL TOTAL-DOLLARS /
043900**                                    TOTAL-UNITS
044000**
044100**   IF NEW AVERAGE COST TURNS OUT TO BE ZERO THEN USE
044200**   STANDARD COST AS A LAST RESORT FOR THE NEW AVERAGE COST.
044300**
044400*************************************************************
044500
044600     COMPUTE TOTAL-DOLLARS = MATL-BEG-BAL-DOLLARS +
044700         MATL-INV-DOLLARS + MATL-ACCTG-DOLLAR-CORR +
044800         TOTAL-OPEN-RCVR-DLRS.
044900
045000     COMPUTE TOTAL-UNITS = MATL-BEG-BAL-UNITS +
045100         MATL-RCPT-UNITS + MATL-ACCTG-UNIT-CORR +
045200         S-STR-OPEN-RCVR-UNITS.
045300
045400     IF TOTAL-UNITS = 0  OR  TOTAL-DOLLARS = 0
045500         IF MATL-RCPT-UNITS > 0
045600             COMPUTE NEW-AVG-COST ROUNDED = MATL-INV-DOLLARS /
045700                                            MATL-RCPT-UNITS
045800         ELSE
045900             MOVE OLD-AVG-COST    TO NEW-AVG-COST
046000     ELSE
046100     IF TOTAL-UNITS < 0
046200         MOVE OLD-AVG-COST        TO NEW-AVG-COST
046300     ELSE
046400     IF TOTAL-DOLLARS < 0
046500         MOVE OLD-AVG-COST        TO NEW-AVG-COST
046600     ELSE
046700         COMPUTE NEW-AVG-COST ROUNDED = TOTAL-DOLLARS /
046800                                        TOTAL-UNITS.
046900
047000***********************************************************
047100**   IF THERES BEEN NO ACTIVITY FOR THE MONTH THEN
047200**   NO NEW AVERAGE COST IS CALCULATED
047300***********************************************************
047400
047500     IF MATL-AVG-COST-UPD = SPACES
047600         MOVE OLD-AVG-COST        TO NEW-AVG-COST.
047700
047800     IF NEW-AVG-COST = ZEROS
047900         MOVE STR-STD-COST        TO NEW-AVG-COST.
048000
048100**************************************************************
048200**   CALCULATE TOTAL ISSUE, RETURN, AND STOREROOM ADJUSTMENT
048300**   DOLLARS USING THE NEW AVERAGE COST
048400**************************************************************
048500
048600     COMPUTE MATL-TOT-ISS-DOLLARS ROUNDED = MATL-ISSUE-UNITS *
048700                                            NEW-AVG-COST.
048800     COMPUTE MATL-RTN-DOLLARS ROUNDED = MATL-RTN-UNITS *
048900                                        NEW-AVG-COST.
049000     COMPUTE MATL-TOT-ADJ-DOLLARS ROUNDED = MATL-ADJ-UNITS *
049100                                            NEW-AVG-COST.
049200     MOVE MATL-STORES-CODE        TO SORT-STORES-CODE.
049300     MOVE MATL-CLASS              TO SORT-CLASS.
049400     MOVE MATL-UNIT-MEASURE       TO SORT-UNIT-MEASURE.
049500     MOVE OLD-AVG-COST            TO SORT-PREV-AVG.
049600     MOVE NEW-AVG-COST            TO SORT-NEW-AVG.
049700     MOVE STR-STD-COST            TO SORT-STD-COST.
049800     IF (NEW-AVG-COST / OLD-AVG-COST) > 1.15 OR
049900        (OLD-AVG-COST / NEW-AVG-COST) > 1.15
050000          MOVE 1                  TO SORT-15-FLAG
050100     ELSE
050200          MOVE SPACES             TO SORT-15-FLAG.
050300
050400     IF MONTH-END-SW = "Y"
050500         PERFORM 610-FIND-DTRANS.
050600
050700     RELEASE SORT-REC.
050800     MOVE SPACES                  TO SORT-REC.
050900     MOVE 0                       TO SORT-PREV-AVG
051000                                     SORT-NEW-AVG.
051100
051300 610-FIND-DTRANS.
051400     MOVE MATL-STORES-CODE        TO MMATL-CODE-ARG.
           PERFORM 9999-DBFIND-DTRANS-MC-O.
052100     IF GOOD-CALL
052200         PERFORM 620-GET-DTRANS
052300             UNTIL END-OF-CHAIN
052400     ELSE
052500         IF NO-ENTRY
052600             NEXT SENTENCE
052700         ELSE
052800             MOVE "DBFIND DTRANS * 610-FD" TO BU-DISPLAY-MSG
052900             PERFORM 990-BLOWUP.
053000
053100 620-GET-DTRANS.
           PERFORM 9999-DBGET5-DTRANS-MC-O.
053900     IF GOOD-CALL
054000         IF TRANS-CODE = "ISS" OR "RET" OR "SADJ"
054100             PERFORM 630-COMPUTE-NEW-VALUE
054200         ELSE
054300             NEXT SENTENCE
054400     ELSE
054500         IF END-OF-CHAIN
054600             NEXT SENTENCE
054700         ELSE
054800             MOVE "DBGET DTRANS * 620-GD" TO BU-DISPLAY-MSG
054900             PERFORM 990-BLOWUP.
055000
055100 630-COMPUTE-NEW-VALUE.
055200     MOVE TRANS-DEPT              TO DEPT-ARG.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
056000     IF GOOD-CALL
056100         IF MCHT-DEPT-TYPE = "PR"
056200             COMPUTE TRANS-VALUE ROUNDED = TRANS-QTY *
056300                                           STR-STD-COST
056400             PERFORM 640-UPDATE-DTRANS
056500         ELSE
056600             COMPUTE TRANS-VALUE ROUNDED = TRANS-QTY *
056700                                           NEW-AVG-COST
056800             PERFORM 640-UPDATE-DTRANS
056900     ELSE
057000         MOVE "DBGET MCHT-ACCTS * 630-CNV" TO BU-DISPLAY-MSG
057100         MOVE DEPT-ARG            TO BU-DISPLAY-FLD (2)
057200         PERFORM 990-BLOWUP.
057300
057400 640-UPDATE-DTRANS.
           PERFORM 9999-DBUPDATE-DTRANS-MC-O.
059400     IF GOOD-CALL
059500         NEXT SENTENCE
059600     ELSE
059700         MOVE "DBUPDATE DTRANS * 640-UD" TO BU-DISPLAY-MSG
059800         PERFORM 990-BLOWUP.

060900 650-UPDATE-AVG-COST.
062300     MOVE NEW-AVG-COST            TO STR-AVG-COST.
           PERFORM 9999-DBUPDATE-MSTORERM-CD-O.
063000     IF GOOD-CALL
063100         NEXT SENTENCE
063200     ELSE
063300         MOVE "DBUPDATE MSTORERM * 650-UAC" TO BU-DISPLAY-MSG
063400         PERFORM 990-BLOWUP.

064500 660-ADD-DDAILYTC.
      *------ DDAILYTC WILL CONTINUE TO USE A 6 CHARACTER DATE FIELD
064600     MOVE 1                       TO DATE-MODE.
064700     CALL "TDATECHK" USING DATE-CHECK-AREA.
064800     MOVE DATE-YMD-OUT            TO DDAILYTC-DATE.
064900     MOVE DATE-UNFORMATTED-TIME-OUT  TO DDAILYTC-TIME.
065000     MOVE "311"                   TO DDAILYTC-TC.
065100     MOVE MATL-STORES-CODE        TO TC311-CORP-CODE.
065200     MOVE "5"                     TO TC311-ID-5.
065300     MOVE NEW-AVG-COST            TO TC311-AVG-COST.
065400     MOVE STR-STD-COST            TO TC311-STD-COST.
065500     MOVE STR-MKT-COST            TO TC311-MKT-COST.
065600     MOVE MATL-CLASS              TO TC311-CLASS-ID5.
065700
           PERFORM 9999-DBPUT-DDAILYTC-DT-O.
067800     IF GOOD-CALL
067900         NEXT SENTENCE
068000     ELSE
068100         MOVE "DBPUT DDAILYTC * 660-AD" TO BU-DISPLAY-MSG
068200         PERFORM 990-BLOWUP.
068300
069500 670-UPDATE-MMATL-ACCUM.
069600     MOVE SPACES                  TO MATL-AVG-COST-UPD.

           PERFORM 9999-DBUPDATE-MMATL-ACCUM-MC-O.
071600     IF GOOD-CALL
071700         NEXT SENTENCE
071800     ELSE
071900         MOVE "DBUPDATE MMATL-ACCUM * 670-UMA" TO BU-DISPLAY-MSG
072000         PERFORM 990-BLOWUP.

073100*********************************************************
073200**                                                     **
073300**   THIS PROCEDURE UPDATES AN INDICATOR THAT STATES   **
073400**   THIS PROGRAM WAS EXECUTED SUCCESSFULLY.  THIS IS  **
073500**   PART OF THE MONTH-END PROCEDURE.  THE INDICATOR   **
073600**   IS LOCATED IN THE DATA SET 'MACCOUNT-INFO' UNDER  **
073700**   THE KEY 'MTED'                                    **
073800**                                                     **
073900*********************************************************
074000
074100 680-UPDATE-AVG-COST-SW.
075200     MOVE "MTED" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-O.
076000     IF GOOD-CALL
076100         NEXT SENTENCE
076200     ELSE
076300         MOVE "DBGET MACCT 'MTED'* 680-UACS" TO BU-DISPLAY-MSG
076400         MOVE MACCT-KEY           TO  BU-DISPLAY-FLD (2)
076500         PERFORM 990-BLOWUP.
076600
076700     MOVE "X"                     TO  MACCT-AVG-COST-CALC-SW.
           PERFORM 9999-DBUPDATE-MACCOUNT-INFO-O.
077400     IF GOOD-CALL
077500         NEXT SENTENCE
077600     ELSE
077700         MOVE "DBUPDATE MACCT * 680-UACS" TO BU-DISPLAY-MSG
077800         MOVE MACCT-KEY           TO BU-DISPLAY-FLD (2)
077900         PERFORM 990-BLOWUP.
079100
079200 699-PROCESS-EXIT.
079300     EXIT.
079400
079500 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
079600     DISPLAY "BEGIN REPORT".
079700     PERFORM 710-BEGIN-REPORT.
079800     PERFORM 720-MOVE-DATA
079900        UNTIL NO-MORE-SORT = "YES".
080000
080100**************************************************
080200**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
080300**  TO COMPLETE PROCESSING OF REPORT            **
080400**************************************************
080500
080600     GO TO 799-CREATE-EXIT.
080700
080800 710-BEGIN-REPORT.
080900     OPEN OUTPUT ONLINE-PRT.
081000     PERFORM 750-PRINT-HEADINGS.
081100     RETURN SORT-FILE
081200        AT END
081300            MOVE "YES" TO NO-MORE-SORT.
081400
081500 720-MOVE-DATA.
081600     PERFORM 730-PROCESS-CODE
081700        UNTIL NO-MORE-SORT = "YES".
081800     IF NO-MORE-SORT = "YES"
081900         NEXT SENTENCE
082000     ELSE
082100         PERFORM 750-PRINT-HEADINGS.
082200
082300 730-PROCESS-CODE.
082400     MOVE SORT-CLASS              TO PRT-CLASS.
082500     MOVE "-"                     TO PRT-HYPHEN.
082600     MOVE SORT-STORES-CODE        TO PRT-MATLCODE.
082700     MOVE SORT-UNIT-MEASURE       TO PRT-UM.
082800     MOVE SORT-PREV-AVG           TO PRT-PREV-COST.
082900     MOVE SORT-NEW-AVG            TO PRT-NEW-COST.
083000     MOVE SORT-STD-COST           TO PRT-STD-COST.
083100     IF SORT-15-FLAG = 1
083200         MOVE "<*******"          TO PRT-15-FLAG
083300     ELSE
083400         MOVE SPACES              TO PRT-15-FLAG.
083500
083600     MOVE 1                       TO CDESC-LINES-TO-GET.
083700     MOVE "N"                     TO CDESC-LOCAL-DESC-OPTION.
083800     CALL "CDESC" USING RET-CODE, STORES-BASE, STATUS-AREA,
083900         BU-DISPLAY-MSG, SORT-STORES-CODE, CDESC-DATA.
084000     MOVE CDESC (1)               TO PRT-DESC.
084100     WRITE PRT-REC FROM DETAIL-LINE AFTER 1.
084200     ADD 1                        TO LINE-CNT.
084300
084400*    IF CDESC (2) NOT = SPACES
084500*        MOVE CDESC (2)           TO PRT-DESC
084600*        WRITE PRT-REC FROM DETAIL-LINE2 AFTER 1
084700*        ADD 1                    TO LINE-CNT.
084800
084900     IF LINE-CNT > 55
085000         PERFORM 750-PRINT-HEADINGS.
085100     MOVE SPACES                  TO PRT-REC
085200                                     DETAIL-LINE.
085300     RETURN SORT-FILE
085400        AT END
085500            MOVE "YES"            TO NO-MORE-SORT.
085600
085800 750-PRINT-HEADINGS.
085900     MOVE 1                       TO DATE-MODE.
086000     CALL "TDATECHK" USING DATE-CHECK-AREA.
086100     MOVE DATE-SLASH-OUT          TO DATE-H1.
086200     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
086300     ADD 1                        TO PAGE-CNT.
086400     MOVE PAGE-CNT                TO PAGE-H2.
086500     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
086600     WRITE PRT-REC FROM HEADER2 AFTER 1.
086700     WRITE PRT-REC FROM HEADER3 AFTER 2.
086800     WRITE PRT-REC FROM HEADER4 AFTER 1.
086900     WRITE PRT-REC FROM BLANK-LINE AFTER 1.
087000     MOVE 6                       TO LINE-CNT.
087100
087300 799-CREATE-EXIT.
087400     EXIT.
087500
087600 900-ERROR SECTION.
087700
087800 990-BLOWUP.
087900
088000***************************************************************
088100**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
088200**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
088300**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
088400**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
088500**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
088600**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
088700**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
088800**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
088900**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
089000**   PROBLEM IS AVOIDED.                                     **
089100***************************************************************
089200
089300     MOVE "TPROCAVG"              TO  BU-PGM-NAME.
089400     MOVE MMATL-CODE-ARG          TO  BU-DISPLAY-FLD (1).
089500     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
089600                           ACCTG-BASE,
089700                           BU-PGM-NAME,
089800                           STATUS-AREA,
089900                           DUMMY-VIEW-AREA,
090000                           FILE-STATUS,
090100                           BU-DISPLAY-MSG,
090200                           BU-DISPLAY-FLDS.
090300
090600 1000-CLOSE-FILES.
090700     IF MONTH-END-SW = "Y"
090800         PERFORM 680-UPDATE-AVG-COST-SW.
090900     CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

       9999-ROUTINES SECTION.

       9999-DBGET2-MMATL-ACCUM-MC-O.
           MOVE 0 TO COND-WORD.
           READ MMATL-ACCUM-MC-O NEXT INTO BUF-MATLACUM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MMATL-ACCUM-MC-O.
           MOVE SPACES TO MATLCODE OF MMATL-ACCUM-MC-REC-O.
           START MMATL-ACCUM-MC-O KEY >= MATLCODE OF
             MMATL-ACCUM-MC-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-O.
           READ MSTORERM-CD-O INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-RESET-MSTORERM-CD-O.
           MOVE HIGH-VALUES TO CORPCDE OF MSTORERM-CD-REC-O.
           START MSTORERM-CD-O KEY > CORPCDE OF MSTORERM-CD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBFIND-DTRANS-MC-O.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF DTRANS-MC-REC-O.
           START DTRANS-MC-O KEY = MATLCODE OF DTRANS-MC-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD.

       9999-DBGET5-DTRANS-MC-O.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-O NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DTRANS-MC-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
           ELSE
           IF MATLCODE OF DTRANS-MC-REC-O NOT = MMATL-CODE-ARG
               PERFORM 9999-RESET-DTRANS-MC-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DTRANS-MC-O.
           MOVE HIGH-VALUES TO MATLCODE OF DTRANS-MC-REC-O.
           START DTRANS-MC-O KEY > MATLCODE OF DTRANS-MC-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBUPDATE-DTRANS-MC-O.
           MOVE 0 TO COND-WORD.
           REWRITE DTRANS-MC-REC-O FROM BUF-DTRANS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBUPDATE-MSTORERM-CD-O.
           MOVE 0 TO COND-WORD.
           REWRITE MSTORERM-CD-REC-O FROM BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBPUT-DDAILYTC-DT-O.
           MOVE 0 TO COND-WORD.
           WRITE DDAILYTC-DT-REC-O FROM BUF-DDAILYTC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBUPDATE-MMATL-ACCUM-MC-O.
           MOVE 0 TO COND-WORD.
           REWRITE MMATL-ACCUM-MC-REC-O FROM BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-O.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           READ MACCOUNT-INFO-IK-O INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-RESET-MACCOUNT-INFO-IK-O.
           MOVE HIGH-VALUES TO INFOKEY OF MACCOUNT-INFO-IK-REC-O.
           START MACCOUNT-INFO-IK-O KEY > INFOKEY OF
             MACCOUNT-INFO-IK-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-DBUPDATE-MACCOUNT-INFO-O.
           MOVE 0 TO COND-WORD.
           REWRITE MACCOUNT-INFO-IK-REC-O FROM BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN I-O   MMATL-ACCUM-MC-O     .
           OPEN I-O   MSTORERM-CD-O        .
           OPEN I-O   DTRANS-MC-O          .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN I-O   DDAILYTC-DT-O        .
           OPEN I-O   MACCOUNT-INFO-IK-O   .

       9999-CLOSE-STUFF.
           CLOSE      MMATL-ACCUM-MC-O     .
           CLOSE      MSTORERM-CD-O        .
           CLOSE      DTRANS-MC-O          .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      DDAILYTC-DT-O        .
           CLOSE      MACCOUNT-INFO-IK-O   .
