000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPRTSUBS.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.     AS400.
000700 OBJECT-COMPUTER.     AS400.
       COPY SPECIALN IN COPYLIB.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFPMM0200
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS EF-STATUS.
           SELECT OUT-FILE
               ASSIGN TO DATABASE-MCFPOUTF
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS OF-STATUS.
001200     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE ASSIGN TO DISK-SORT.
           SELECT WO-EQUIP-HIER
               ASSIGN TO DATABASE-MCFLMM1701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WEH-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0200.
       FD  OUT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS OUTF.
       01  OUTF                       PIC X(12).
001700 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
001800     LABEL RECORD IS OMITTED
001900     DATA RECORD IS PRINTF.
002000 01  PRINTF.
           05  PRINT-CTL              PIC X(8).
           05  PRINT-LINE             PIC X(124).
       SD  SORT-FILE
           RECORD CONTAINS 34 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SUBNUM-SORT.
               10  SUBNUM-1-S         PIC X.
               10  SUBNUM-2-S         PIC X.
               10  SUBNUM-3-S         PIC X.
               10  SUBNUM-4-S         PIC X.
           05  SUBNAME-SORT           PIC X(30).
       FD  WO-EQUIP-HIER
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WEHREC.
       01  WEHREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1701.
003300 WORKING-STORAGE SECTION.
       77  SORT-RECS-READ             PIC 9(5).
       77  SORT-RECS-REL              PIC 9(5).
       77  SUB1                       PIC 9(4).
       77  SUB2                       PIC 9(4).
       77  TAB1-SAVE                  PIC X(34).
003500 01  ALL-RECORDS-WRITTEN-SW     PIC X.
003700 01  ALL-RECORDS-RETURNED-SW    PIC X.
003900 01  ARG-DEFN.
004000     05  ARG-TYPE               PIC X(8).
004100     05  ARG-KEY.
004200         10  ARG-KEY4           PIC X(4).
004300         10  FILLER             PIC XX.
       01  BLOWUP-BASE                PIC X(16).
004400 01  COMPRESS-PRINT             PIC X(8).
       01  CUR-DATE-WA.
           05  CUR-DATE-YY            PIC XX.
           05  CUR-DATE-MM            PIC XX.
           05  CUR-DATE-DD            PIC XX.
018800 01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
       01  DELETE-FILE                PIC X(10) VALUE "MCFPOUTF".
004700 01  DETAIL-REC.
004800     05  LIT1-REC   PIC X(35) VALUE SPACES.
004900     05  VER-AST1   PIC X(5)  VALUE "  ** ".
005000     05  LIT2-REC   PIC X(35) VALUE SPACES.
005100     05  VER-AST2   PIC X(5)  VALUE "  ** ".
005200     05  LIT3-REC   PIC X(35) VALUE SPACES.
005300     05  FILLER     PIC X(17) VALUE SPACES.
005400 01  EQP-EQUIPMENT.          COPY MEQPFILE OF COPYLIB.
005500 01  EQUIP-HIER-BUFFER.
005600     05  HIER-KEY.
005700         10  EQP-TYPE-BUF       PIC X(8).
005800         10  FATHER-SUB-BUF.
005900             15  FATH-4-BUF     PIC X(4).
006000             15  FILLER         PIC XX.
006100     05  HIER-DISP-CODE.
006200         10  SON-4-BUF.
006300             15  SUB1-BUF       PIC 9.
006400             15  SUB2-BUF       PIC 9.
006500             15  SUB3-BUF       PIC 9.
006600             15  SUB4-BUF       PIC 9.
006700         10  FILLER             PIC XX.
006800     05  SUB-ASSY-NAME.
006900         10  SUB-NAME30         PIC X(30).
007000         10  FILLER             PIC X(20).
019000 01  EQUIP-TYPE.
019100     05 ETYPE                   PIC X(8).
019200     05 ESUBS.
019300        10 ESUB1                PIC X.
019400        10 ESUB2                PIC X.
019500        10 ESUB3                PIC X.
019600        10 ESUB4                PIC X.
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  EF-STATUS              PIC XX.
           05  OF-STATUS              PIC XX.
           05  WEH-STATUS             PIC XX.
007900 01  HEADING-0-H.
008000     05  FILLER    PIC X(25) VALUE "SUB-SYSTEM BREAKDOWN FOR ".
008100     05  FILLER    PIC X(15) VALUE "EQUIPMENT TYPE ".
008200     05  H-O-TYPE  PIC X(8) VALUE SPACES.
008300     05  FILLER    PIC XX VALUE " (".
008400     05  H-O-NAME  PIC X(50) VALUE SPACES.
008500     05  FILLER    PIC X VALUE ")".
008600     05  FILLER    PIC X(14) VALUE "         DATE ".
008700     05  H-O-DATE.
               10  H-O-M PIC XX   VALUE SPACES.
               10  H-S1  PIC X    VALUE "/".
               10  H-O-D PIC XX   VALUE SPACES.
               10  H-S2  PIC X    VALUE "/".
               10  H-O-Y PIC XX   VALUE SPACES.
008800     05  FILLER    PIC X(9) VALUE SPACES.
008900 01  HEADING-1-H.
009000     05  FILLER      PIC X(5) VALUE SPACES.
009100     05  FILLER      PIC X(8) VALUE "  1000  ".
009200     05  NAME1-1-H   PIC X(30) VALUE SPACES.
009300     05  FILLER      PIC X(8) VALUE "  4000  ".
009400     05  NAME2-1-H   PIC X(30) VALUE SPACES.
009500     05  FILLER      PIC X(8) VALUE "  7000  ".
009600     05  NAME3-1-H   PIC X(30) VALUE SPACES.
009700     05  FILLER      PIC X(13) VALUE SPACES.
009800 01  HEADING-2-H.
009900     05  FILLER      PIC X(5) VALUE SPACES.
010000     05  FILLER      PIC X(8) VALUE "  2000  ".
010100     05  NAME1-2-H   PIC X(30) VALUE SPACES.
010200     05  FILLER      PIC X(8) VALUE "  5000  ".
010300     05  NAME2-2-H   PIC X(30) VALUE SPACES.
010400     05  FILLER      PIC X(8) VALUE "  8000  ".
010500     05  NAME3-2-H   PIC X(30) VALUE SPACES.
010600     05  FILLER      PIC X(13) VALUE SPACES.
010700 01  HEADING-3-H.
010800     05  FILLER      PIC X(5) VALUE SPACES.
010900     05  FILLER      PIC X(8) VALUE "  3000  ".
011000     05  NAME1-3-H   PIC X(30) VALUE SPACES.
011100     05  FILLER      PIC X(8) VALUE "  6000  ".
011200     05  NAME2-3-H   PIC X(30) VALUE SPACES.
011300     05  FILLER      PIC X(8) VALUE "  9000  ".
011400     05  NAME3-3-H   PIC X(30) VALUE SPACES.
011500     05  FILLER      PIC X(13) VALUE SPACES.
011600 01  HEADING-4-H.
011700     05  FILLER      PIC X(20) VALUE "********************".
011800     05  FILLER      PIC X(20) VALUE "********************".
011900     05  FILLER      PIC X(20) VALUE "********************".
012000     05  FILLER      PIC X(20) VALUE "********************".
012100     05  FILLER      PIC X(20) VALUE "********************".
012200     05  FILLER      PIC X(23) VALUE "***********************".
012300     05  FILLER      PIC X(9)  VALUE SPACES.
012400 01  HEADING-5-H.
012500     05  FILLER      PIC X(20) VALUE "SUB-SYSTEM BREAKDOWN".
012600     05  FILLER      PIC X(21) VALUE " FOR EQUIPMENT TYPE  ".
012700     05  TYPE-5-H    PIC X(8)  VALUE SPACES.
012800     05  FILLER      PIC X(22) VALUE "  (CONTINUED)   DATE  ".
012900     05  DATE-5-H.
               10  D-5-M   PIC XX    VALUE SPACES.
               10  FILLER  PIC X     VALUE "/".
               10  D-5-D   PIC XX    VALUE SPACES.
               10  FILLER  PIC X     VALUE "/".
               10  D-5-Y   PIC XX    VALUE SPACES.
013000     05  FILLER      PIC X(53) VALUE SPACES.
       COPY JCWAREA IN COPYLIB.
013600 01  LEV1-LIT.
013700     05  SUB-LEV1    PIC X(4)  VALUE SPACES.
013800     05  FILLER      PIC X     VALUE SPACE.
013900     05  NAME-LEV1   PIC X(30) VALUE SPACES.
014000     05  FILLER      PIC X(10) VALUE SPACES.
014100 01  LEV2-LIT.
014200     05  FILLER      PIC XX    VALUE SPACES.
014300     05  SUB-LEV2    PIC X(4)  VALUE SPACES.
014400     05  FILLER      PIC X     VALUE SPACE.
014500     05  NAME-LEV2   PIC X(30) VALUE SPACES.
014600     05  FILLER      PIC X(5)  VALUE SPACES.
014700 01  LEV3-LIT.
014800     05  FILLER      PIC X(4)  VALUE SPACES.
014900     05  SUB-LEV3    PIC X(4)  VALUE SPACES.
015000     05  FILLER      PIC X     VALUE SPACE.
015100     05  NAME-LEV3   PIC X(30) VALUE SPACES.
015200 01  LEVEL1-TABLE.
015300     05  LEV1-TAB OCCURS 9 TIMES.
015400         10  LEV1-TAB-SUB       PIC X(4).
015500         10  LEV1-TAB-NAME      PIC X(30).
015600 01  LINE-K                     PIC S9(4) VALUE 0.
       01  NO-HIER-MSG.
           05  FILLER                 PIC X(24)
                VALUE "NO HIERARCHY EXISTS FOR ".
           05  NO-HTYP                PIC X(8)   VALUE SPACES.
           05  FILLER                 PIC X(100) VALUE SPACES.
016000 01  NORMAL-PRINT               PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
       COPY DBSTAT OF COPYLIB.
016900 01  TAB1-SUB                   PIC 9(4).
017000 01  TAB2-SUB                   PIC 9(4).
017100 01  TAB3-SUB                   PIC 9(4).
017200 01  TABLE1.
017300     05  TAB1 OCCURS 4000 TIMES.
017400         10  TAB1-SUBNUM.
017500             15  SUB-POS1       PIC X.
017600             15  SUB-POS2       PIC X.
017700             15  SUB-POS3       PIC X.
017800             15  SUB-POS4       PIC X.
017900         10  TAB1-SUBNAME       PIC X(30).
018000 01  TERM-BUFFER-1.
018100     05  TYPE-BUF-1             PIC X(8) VALUE SPACES.
018200     05  FILLER                 PIC XX VALUE SPACES.
018600 COPY TBLOWUP  IN COPYLIB.
       COPY THDPRT   IN COPYLIB.
       COPY VCOMLINK OF COPYLIB.
021200 PROCEDURE DIVISION.
022000 BEGIN-PROC.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT.
024300 2-EOJ.
           MOVE SPACES TO PRINTF.
024700     WRITE PRINTF FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE EQUIPMENT-FILE.
025000     CLOSE PRINT-FILE.
           CLOSE OUT-FILE.
           CALL "MCDLT" USING DELETE-FILE.
           CLOSE WO-EQUIP-HIER.
025200     GOBACK.
177600 2-BLOWUP.
177700     MOVE "TPRTSUB2" TO BU-PGM-NAME.
177800     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
177900                      VIEW-COMAREA DUMMY-KSAM-STAT
178000                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       1-HSK.
           OPEN INPUT OUT-FILE.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT WO-EQUIP-HIER.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISR11.PUB"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
097800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
097900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
098000         PERFORM 2-BLOWUP.
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
022700     IF PAPER-IS-132-COLS
022800         MOVE NORMAL-PRINT TO PRINT-CTL
022900     ELSE
023000     MOVE COMPRESS-PRINT TO PRINT-CTL.
           ACCEPT CUR-DATE-WA FROM DATE.
           MOVE CUR-DATE-YY TO H-O-Y D-5-Y.
           MOVE CUR-DATE-MM TO H-O-M D-5-M.
           MOVE CUR-DATE-DD TO H-O-D D-5-D.

       COPY OVRPFCALL IN COPYLIB.
024100
025500 6-MAIN.
025600     MOVE SPACES TO LEVEL1-TABLE TABLE1.
           MOVE 0 TO SORT-RECS-READ SORT-RECS-REL.
025700     MOVE "N" TO ALL-RECORDS-WRITTEN-SW ALL-RECORDS-RETURNED-SW.
           READ OUT-FILE AT END GO TO 6-MAIN-EXIT.
           IF OF-STATUS NOT = "00" GO TO 6-MAIN-EXIT.
           MOVE OUTF TO EQUIP-TYPE.
           MOVE SPACES TO ARG-DEFN.
025900     MOVE EQUIP-TYPE TO ARG-TYPE TYPE-BUF-1.
026100     IF ESUBS = SPACES MOVE "0000" TO ESUBS.
           MOVE 0 TO TAB1-SUB TAB2-SUB TAB3-SUB.
026500     IF ESUB4 NOT = "0" MOVE "0" TO ESUB4
026600     ELSE
026700     IF ESUB3 NOT = "0" MOVE "0" TO ESUB3
026800     ELSE
026900     IF ESUB2 NOT = "0" MOVE "0" TO ESUB2
027000     ELSE
027100     IF ESUB1 NOT = "0" MOVE "0" TO ESUB1.
027300     MOVE ESUBS TO ARG-KEY4.
           MOVE 0 TO COND-WORD.
           MOVE ARG-DEFN TO HIERKEY OF WEHREC.
           START WO-EQUIP-HIER KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WEH-STATUS NOT = "00" MOVE 17 TO COND-WORD.
028600     IF COND-WORD = 17
               MOVE SPACES TO PRINTF
               MOVE EQUIP-TYPE TO NO-HTYP
               MOVE NO-HIER-MSG TO PRINTF
               WRITE PRINTF AFTER ADVANCING NEW-PAGE
               MOVE SPACES TO PRINTF
               GO TO 6-MAIN.
           SORT SORT-FILE ASCENDING KEY SUBNUM-SORT
               INPUT PROCEDURE  7-INPUT-RECORDS
               OUTPUT PROCEDURE 8-OUTPUT-RECORDS.
           CLOSE WO-EQUIP-HIER.
           OPEN INPUT WO-EQUIP-HIER.
030600     GO TO 6-MAIN.
       6-MAIN-EXIT.    EXIT.

       7-INPUT-RECORDS.
           PERFORM 7-RELEASE-RECORDS THRU 7-RR-EXIT.
       7-RELEASE-RECORDS.
           MOVE 0 TO COND-WORD.
           READ WO-EQUIP-HIER NEXT INTO EQUIP-HIER-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-TYPE-BUF NOT = ARG-TYPE MOVE 15 TO COND-WORD.
           IF WEH-STATUS NOT = "00" MOVE 15 TO COND-WORD.
031100     IF COND-WORD = 15
               DISPLAY "SORT RECORDS RELEASED = " SORT-RECS-REL
               GO TO 7-RR-EXIT.
           IF SUB2-BUF = 0
               IF SUB3-BUF = 0
                   IF SUB4-BUF = 0
                       MOVE SUB1-BUF TO TAB1-SUB
                       MOVE SON-4-BUF  TO LEV1-TAB-SUB (TAB1-SUB)
                       MOVE SUB-NAME30 TO LEV1-TAB-NAME (TAB1-SUB)
                       GO TO 7-RELEASE-RECORDS.
033800     MOVE SON-4-BUF  TO SUBNUM-SORT.
033900     MOVE SUB-NAME30 TO SUBNAME-SORT.
           ADD 1 TO SORT-RECS-REL.
           RELEASE SORT-REC.
           GO TO 7-RELEASE-RECORDS.
034600 7-RR-EXIT.    EXIT.
034800
035300 8-OUTPUT-RECORDS.
           PERFORM 80-READ-SORT THRU 80-RS-EXIT.
       80-READ-SORT.
           RETURN SORT-FILE AT END
               PERFORM 81-RETRIEVE-DESC THRU 81-RD-EXIT
               PERFORM 82-WRITE-RECORDS THRU 82-WR-EXIT
               GO TO 80-RS-EXIT.
           ADD 1 TO SORT-RECS-READ.
           IF SORT-RECS-READ > SORT-RECS-REL
               DISPLAY "SORT RECORDS READ = " SORT-RECS-READ
               GO TO 80-READ-SORT.
           ADD 1 TO TAB2-SUB.
           MOVE SUBNUM-SORT  TO TAB1-SUBNUM (TAB2-SUB)
           MOVE SUBNAME-SORT TO TAB1-SUBNAME (TAB2-SUB).
           GO TO 80-READ-SORT.
       80-RS-EXIT.    EXIT.

037700 81-RETRIEVE-DESC.
           MOVE 0 TO COND-WORD.
           READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
               AT END    MOVE 11 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
038000     IF COND-WORD = 11
               MOVE "TYPE NOT IN EQUIPMENT FILE" TO H-O-NAME
               MOVE ARG-TYPE TO H-O-TYPE
               GO TO 81-RD-EXIT.
038400     IF EQP-TYPE NOT = TYPE-BUF-1 GO TO 81-RETRIEVE-DESC.
038600     MOVE EQP-CORP-DESC TO H-O-NAME.
038700     MOVE EQP-TYPE      TO H-O-TYPE.
           CLOSE EQUIPMENT-FILE.
           OPEN INPUT EQUIPMENT-FILE.
       81-RD-EXIT.    EXIT.

       82-WRITE-RECORDS.
036700     MOVE TYPE-BUF-1 TO TYPE-5-H.
036800     MOVE 0 TO TAB1-SUB.
036900     MOVE 3 TO TAB2-SUB.
037000     MOVE 6 TO TAB3-SUB.
048900     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
049100     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-1-H.
049200     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-1-H.
049300     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-1-H.
049400     MOVE SPACES TO PRINT-LINE.
049500     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
           MOVE HEADING-0-H TO PRINT-LINE.
049600     WRITE PRINTF AFTER ADVANCING 3 LINES.
           MOVE HEADING-4-H TO PRINT-LINE.
049700     WRITE PRINTF AFTER ADVANCING 1 LINES.
           MOVE HEADING-1-H TO PRINT-LINE.
049800     WRITE PRINTF AFTER ADVANCING 1 LINES.
049900     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
050000     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-2-H.
050100     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-2-H.
050200     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-2-H.
           MOVE HEADING-2-H TO PRINT-LINE.
050300     WRITE PRINTF AFTER ADVANCING 1 LINES.
050400     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
050500     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-3-H.
050600     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-3-H.
050700     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-3-H.
           MOVE HEADING-3-H TO PRINT-LINE.
050800     WRITE PRINTF AFTER ADVANCING 1 LINES.
           MOVE HEADING-4-H TO PRINT-LINE.
050900     WRITE PRINTF AFTER ADVANCING 1 LINES.
037200     MOVE   0 TO TAB1-SUB.
           MOVE  52 TO TAB2-SUB LINE-K.
           MOVE 104 TO TAB3-SUB.
       82-WR-LOOP.
042000     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
042200     IF TAB1-SUBNUM (TAB1-SUB) = "    " GO TO 82-WR-EXIT.
           IF TAB3-SUB > 3500 GO TO 82-WR-EXIT.
042500     IF TAB1-SUB > LINE-K
043000         MOVE SPACES TO PRINT-LINE
043100         WRITE PRINTF AFTER ADVANCING NEW-PAGE
               MOVE HEADING-5-H TO PRINT-LINE
043200         WRITE PRINTF AFTER ADVANCING 3 LINES
               MOVE HEADING-4-H TO PRINT-LINE
043400         WRITE PRINTF AFTER ADVANCING 1 LINES
               MOVE TAB3-SUB TO TAB1-SUB
               ADD 51 TO TAB1-SUB GIVING LINE-K
               ADD 52 TO TAB1-SUB GIVING TAB2-SUB
               ADD 52 TO TAB2-SUB GIVING TAB3-SUB.
043700     IF SUB-POS3 (TAB1-SUB) = 0
043800         MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV1
043900         MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV1
044000         MOVE LEV1-LIT TO LIT1-REC
044100     ELSE
044200     IF SUB-POS4 (TAB1-SUB) = 0
044300         MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV2
044400         MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV2
044500         MOVE LEV2-LIT TO LIT1-REC
044600     ELSE
044700     MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV3
044800     MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV3
044900     MOVE LEV3-LIT TO LIT1-REC.
045000     IF TAB1-SUBNUM (TAB2-SUB) NOT = SPACES
045100         IF SUB-POS3 (TAB2-SUB) = 0
045200             MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV1
045300             MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV1
045400             MOVE LEV1-LIT TO LIT2-REC
045500         ELSE
045600         IF SUB-POS4 (TAB2-SUB) = 0
045700             MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV2
045800             MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV2
045900             MOVE LEV2-LIT TO LIT2-REC
046000         ELSE
046100         MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV3
046200         MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV3
046300         MOVE LEV3-LIT TO LIT2-REC
046400     ELSE
046500     MOVE SPACES TO LIT2-REC.
046600     IF TAB1-SUBNUM (TAB3-SUB) NOT = SPACES
046700         IF SUB-POS3 (TAB3-SUB) = 0
046800             MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV1
046900             MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV1
047000             MOVE LEV1-LIT TO LIT3-REC
047100         ELSE
047200         IF SUB-POS4 (TAB3-SUB) = 0
047300             MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV2
047400             MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV2
047500             MOVE LEV2-LIT TO LIT3-REC
047600         ELSE
047700         MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV3
047800         MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV3
047900         MOVE LEV3-LIT TO LIT3-REC
048000     ELSE
048100     MOVE SPACES TO LIT3-REC.
           MOVE DETAIL-REC TO PRINT-LINE.
048300     WRITE PRINTF AFTER ADVANCING 1 LINES.
           GO TO 82-WR-LOOP.
037500
       82-WR-EXIT.    EXIT.
