000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TPRTEXES.
000400*REMARKS.    THIS PROGRAM IS THE EXECUTIVE CONTROLLING PROGRAM
000500*            FOR WORK ORDER PRINTS.
000600 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.       AS400.
       OBJECT-COMPUTER.       AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZPLANNER-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
000700 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
000800 WORKING-STORAGE SECTION.
000900 01  BLOWUP-BASE                  PIC X(16).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
       01  DSPLY-STATUS                 PIC XX.
       01  EDIT-ERROR                   PIC X(80).
001000 01  ERROR-BUFFER                 PIC X(80).
       COPY IOFEEDBACK IN COPYLIB.
001200 01  PASSWORD-INFORMATION.
001300     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPRTEXES".
001400     05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
001500     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
001600     05  PROGRAM-DESCRIPTION.
001700         10  PROG-DESC-A.
                   15  FILLER      PIC X(16) VALUE " PLANNER MODULE ".
                   15  FILLER      PIC X(15) VALUE "EXECUTIVE WORK ".
                   15  FILLER      PIC X(12) VALUE "ORDER PRINT ".
                   15  FILLER      PIC X(17) VALUE "PROGRAM - F1 FOR ".
001900         10  PROG-DESC-B.
                   15  FILLER      PIC X(17) VALUE "PRINTING A SINGLE".
                   15  FILLER      PIC X(15) VALUE " W/O CRAFTSMAN ".
                   15  FILLER      PIC X(17) VALUE "WORKSHEET AND F2 ".
                   15  FILLER      PIC X(11) VALUE "FOR PRINTI".
002100         10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "NG MULTIPLE WORK ".
                   15  FILLER      PIC X(43) VALUE "ORDERS     ".
002300     05  PASSWORD-FLAG       PIC X.
       01  SCREEN-CMD-ERR.
           05  SCREEN-CMD-LINE          PIC X(79).
           05  SCREEN-ERR-LINE          PIC X(79).
       COPY DBSTAT OF COPYLIB.
002500 COPY TBLOWUP IN COPYLIB.
       01  TRUE-VAL                     PIC 1 VALUE B"1".
002600 01  WO-PLANNED-DATA.     COPY DWOPLAN OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
002700 LINKAGE SECTION.
003400 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
003700 01  ERROR-SWITCH                 PIC S9(4) COMP-4.
003800 PROCEDURE DIVISION USING DBPARAMETERS ERROR-SWITCH.
004000 BEGIN-PROCESSING.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
010400 2-EOJ.
           CLOSE DISPLAY-FILE.
010500     GOBACK.
       1-HSK.
           OPEN I-O  DISPLAY-FILE.
004100     CALL "TPWORD" USING PASSWORD-INFORMATION.
004500     IF PASSWORD-FLAG = "N"
004600         MOVE "  PWORD" TO BLOWUP-BASE
004700         MOVE "FAILED PASSWORD CHECK - TPRTEXES"
004800             TO BU-DISPLAY-MSG
004900         PERFORM 998-BLOWUP.
           MOVE 0 TO VIEW-LASTKEY.
       6-MAIN.
           IF VIEW-LASTKEY = 0
               MOVE 0 TO ERROR-SWITCH
               MOVE SPACES TO SCREEN-CMD-ERR
005000         MOVE "FPRTEXES" TO VIEW-CFNAME
               MOVE 66108 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-CMD-ERR TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE SPACES TO ERROR-BUFFER EDIT-ERROR
               MOVE DSPLY-REC TO SCREEN-CMD-ERR.
006800     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
007100     IF VIEW-LASTKEY = 1
007200         MOVE SPACES TO WO-PLANNED-DATA
007300         CALL "TPRINTWS" USING DBPARAMETERS WO-PLANNED-DATA
007400                           ERROR-SWITCH VIEW-COMAREA
007600         IF VIEW-LASTKEY = 1
007700             GO TO 2-EOJ
007800         ELSE
007900         MOVE 0 TO VIEW-LASTKEY
008000         GO TO BEGIN-PROCESSING.
008200     IF VIEW-LASTKEY = 2
008300         CALL "TMULTPRT" USING DBPARAMETERS VIEW-COMAREA
008500         IF VIEW-LASTKEY = 1
008600             GO TO 2-EOJ
008700         ELSE
008800         MOVE 0 TO VIEW-LASTKEY
008900         GO TO BEGIN-PROCESSING.
009700
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

009800 998-BLOWUP.
009900     MOVE "TPRTEXES" TO BU-PGM-NAME.
010000     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
010100                      VIEW-COMAREA DUMMY-KSAM-STAT
010200                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
010300
       999-CATREAD.
            MOVE SPACES TO ERROR-BUFFER.
            CALL "CCATREAD" USING CATREAD-PARMS.
            MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.

