000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TPRTSUB2.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.     AS400.
000700 OBJECT-COMPUTER.     AS400.
       COPY SPECIALN IN COPYLIB.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFPMM0200
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS EF-STATUS.
001200     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
001300     SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT WO-EQUIP-HIER
               ASSIGN TO DATABASE-MCFLMM1701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WEH-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0200.
001700 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
001800     LABEL RECORD IS OMITTED
001900     DATA RECORD IS PRINTF.
002000 01  PRINTF                     PIC X(132).
002200 SD  SORT-FILE RECORD CONTAINS 34 CHARACTERS
002300     DATA RECORD IS SORT-REC.
002400 01  SORT-REC.
002500     05  SUBNUM-SORT.
002600         10  SUBNUM-1-S         PIC X.
002700         10  SUBNUM-2-S         PIC X.
002800         10  SUBNUM-3-S         PIC X.
002900         10  SUBNUM-4-S         PIC X.
003000     05  SUBNAME-SORT           PIC X(30).
       FD  WO-EQUIP-HIER
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WEHREC.
       01  WEHREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1701.
003300 WORKING-STORAGE SECTION.
003500 01  ALL-RECORDS-WRITTEN-SW     PIC X.
003700 01  ALL-RECORDS-RETURNED-SW    PIC X.
003900 01  ARG-DEFN.
004000     05  HIER-TYPE-DEFN         PIC X(8).
004100     05  KEY-DEFN.
004200         10  KEY4-DEFN          PIC X(4).
004300         10  FILLER             PIC XX.
       01  BLOWUP-BASE                PIC X(16).
004400 01  COMPRESS-PRINT             PIC X(8).
004700 01  DETAIL-REC.
004800     05  LIT1-REC   PIC X(35) VALUE SPACES.
004900     05  VER-AST1   PIC X(5)  VALUE "  ** ".
005000     05  LIT2-REC   PIC X(35) VALUE SPACES.
005100     05  VER-AST2   PIC X(5)  VALUE "  ** ".
005200     05  LIT3-REC   PIC X(35) VALUE SPACES.
005300     05  FILLER     PIC X(17) VALUE SPACES.
005400 01  EQP-EQUIPMENT.          COPY MEQPFILE OF COPYLIB.
005500 01  EQUIP-HIER-BUFFER.
005600     05  HIER-KEY.
005700         10  EQP-TYPE-BUF       PIC X(8).
005800         10  FATHER-SUB-BUF.
005900             15  FATH-4-BUF     PIC X(4).
006000             15  FILLER         PIC XX.
006100     05  HIER-DISP-CODE.
006200         10  SON-4-BUF.
006300             15  SUB1-BUF       PIC 9.
006400             15  SUB2-BUF       PIC 9.
006500             15  SUB3-BUF       PIC 9.
006600             15  SUB4-BUF       PIC 9.
006700         10  FILLER             PIC XX.
006800     05  SUB-ASSY-NAME.
006900         10  SUB-NAME30         PIC X(30).
007000         10  FILLER             PIC X(20).
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  EF-STATUS              PIC XX.
           05  WEH-STATUS             PIC XX.
007900 01  HEADING-0-H.
008000     05  FILLER    PIC X(25) VALUE "SUB-SYSTEM BREAKDOWN FOR ".
008100     05  FILLER    PIC X(15) VALUE "EQUIPMENT TYPE ".
008200     05  H-O-TYPE  PIC X(8) VALUE SPACES.
008300     05  FILLER    PIC XX VALUE " (".
008400     05  H-O-NAME  PIC X(50) VALUE SPACES.
008500     05  FILLER    PIC X VALUE ")".
008600     05  FILLER    PIC X(14) VALUE "         DATE ".
008700     05  H-O-DATE  PIC X(8) VALUE SPACES.
008800     05  FILLER    PIC X(9) VALUE SPACES.
008900 01  HEADING-1-H.
009000     05  FILLER      PIC X(5) VALUE SPACES.
009100     05  FILLER      PIC X(8) VALUE "  1000  ".
009200     05  NAME1-1-H   PIC X(30) VALUE SPACES.
009300     05  FILLER      PIC X(8) VALUE "  4000  ".
009400     05  NAME2-1-H   PIC X(30) VALUE SPACES.
009500     05  FILLER      PIC X(8) VALUE "  7000  ".
009600     05  NAME3-1-H   PIC X(30) VALUE SPACES.
009700     05  FILLER      PIC X(13) VALUE SPACES.
009800 01  HEADING-2-H.
009900     05  FILLER      PIC X(5) VALUE SPACES.
010000     05  FILLER      PIC X(8) VALUE "  2000  ".
010100     05  NAME1-2-H   PIC X(30) VALUE SPACES.
010200     05  FILLER      PIC X(8) VALUE "  5000  ".
010300     05  NAME2-2-H   PIC X(30) VALUE SPACES.
010400     05  FILLER      PIC X(8) VALUE "  8000  ".
010500     05  NAME3-2-H   PIC X(30) VALUE SPACES.
010600     05  FILLER      PIC X(13) VALUE SPACES.
010700 01  HEADING-3-H.
010800     05  FILLER      PIC X(5) VALUE SPACES.
010900     05  FILLER      PIC X(8) VALUE "  3000  ".
011000     05  NAME1-3-H   PIC X(30) VALUE SPACES.
011100     05  FILLER      PIC X(8) VALUE "  6000  ".
011200     05  NAME2-3-H   PIC X(30) VALUE SPACES.
011300     05  FILLER      PIC X(8) VALUE "  9000  ".
011400     05  NAME3-3-H   PIC X(30) VALUE SPACES.
011500     05  FILLER      PIC X(13) VALUE SPACES.
011600 01  HEADING-4-H.
011700     05  FILLER      PIC X(20) VALUE "********************".
011800     05  FILLER      PIC X(20) VALUE "********************".
011900     05  FILLER      PIC X(20) VALUE "********************".
012000     05  FILLER      PIC X(20) VALUE "********************".
012100     05  FILLER      PIC X(20) VALUE "********************".
012200     05  FILLER      PIC X(23) VALUE "***********************".
012300     05  FILLER      PIC X(9)  VALUE SPACES.
012400 01  HEADING-5-H.
012500     05  FILLER      PIC X(20) VALUE "SUB-SYSTEM BREAKDOWN".
012600     05  FILLER      PIC X(21) VALUE " FOR EQUIPMENT TYPE  ".
012700     05  TYPE-5-H    PIC X(8)  VALUE SPACES.
012800     05  FILLER      PIC X(22) VALUE "  (CONTINUED)   DATE  ".
012900     05  DATE-5-H    PIC X(8)  VALUE SPACES.
013000     05  FILLER      PIC X(53) VALUE SPACES.
       COPY JCWAREA IN COPYLIB.
013300 01  KEY-TABLE.
013400     05  KEY-TAB OCCURS 1700 TIMES PIC X(4).
013500 01  LAST-WO-BUFF.        COPY MLASTWO OF COPYLIB.
013600 01  LEV1-LIT.
013700     05  SUB-LEV1    PIC X(4)  VALUE SPACES.
013800     05  FILLER      PIC X     VALUE SPACE.
013900     05  NAME-LEV1   PIC X(30) VALUE SPACES.
014000     05  FILLER      PIC X(10) VALUE SPACES.
014100 01  LEV2-LIT.
014200     05  FILLER      PIC XX    VALUE SPACES.
014300     05  SUB-LEV2    PIC X(4)  VALUE SPACES.
014400     05  FILLER      PIC X     VALUE SPACE.
014500     05  NAME-LEV2   PIC X(30) VALUE SPACES.
014600     05  FILLER      PIC X(5)  VALUE SPACES.
014700 01  LEV3-LIT.
014800     05  FILLER      PIC X(4)  VALUE SPACES.
014900     05  SUB-LEV3    PIC X(4)  VALUE SPACES.
015000     05  FILLER      PIC X     VALUE SPACE.
015100     05  NAME-LEV3   PIC X(30) VALUE SPACES.
015200 01  LEVEL1-TABLE.
015300     05  LEV1-TAB OCCURS 9 TIMES.
015400         10  LEV1-TAB-SUB       PIC X(4).
015500         10  LEV1-TAB-NAME      PIC X(30).
015600 01  LINE-K                     PIC S9(4) VALUE 0.
       COPY LANGSUB OF COPYLIB.
016000 01  NORMAL-PRINT               PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
016500 01  SAVE-ESUBS                 PIC X(4).
       COPY DBSTAT OF COPYLIB.
016900 01  TAB1-SUB                   PIC 9(4).
017000 01  TAB2-SUB                   PIC 9(4).
017100 01  TAB3-SUB                   PIC 9(4).
017200 01  TABLE1.
017300     05  TAB1 OCCURS 240 TIMES.
017400         10  TAB1-SUBNUM.
017500             15  SUB-POS1       PIC X.
017600             15  SUB-POS2       PIC X.
017700             15  SUB-POS3       PIC X.
017800             15  SUB-POS4       PIC X.
017900         10  TAB1-SUBNAME       PIC X(30).
018000 01  TERM-BUFFER-1.
018100     05  TYPE-BUF-1             PIC X(8) VALUE SPACES.
018200     05  FILLER                 PIC XX VALUE SPACES.
018600 COPY TBLOWUP  IN COPYLIB.
       COPY THDPRT   IN COPYLIB.
       COPY VCOMLINK OF COPYLIB.
018700 LINKAGE SECTION.
018800 01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
019000 01  EQUIP-TYPE.
019100     05 ETYPE                   PIC X(8).
019200     05 ESUBS.
019300        10 ESUB1                PIC X.
019400        10 ESUB2                PIC X.
019500        10 ESUB3                PIC X.
019600        10 ESUB4                PIC X.
       COPY TDATESUB OF COPYLIB.
021200 PROCEDURE DIVISION USING DBPARAMETERS
021400                          EQUIP-TYPE
021600                          DATE-CHECK-AREA.
022000 BEGIN-PROC.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT WO-EQUIP-HIER.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISR11.PUB"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
097800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
097900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
098000         PERFORM 998-BLOWUP.
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
022700     IF PAPER-IS-132-COLS
022800         NEXT SENTENCE
022900     ELSE
023000     WRITE PRINTF FROM COMPRESS-PRINT AFTER ADVANCING 0.
023300     MOVE DATE-SLASH-OUT TO H-O-DATE DATE-5-H.
023800     SORT SORT-FILE ASCENDING KEY SUBNUM-SORT
023900         INPUT  PROCEDURE 8-INPUT-RECORDS
024000         OUTPUT PROCEDURE 9-WRITE-RECORDS.
024100
024300 2-EOJ.
024400     IF PAPER-IS-132-COLS
024500         NEXT SENTENCE
024600     ELSE
024700     WRITE PRINTF FROM NORMAL-PRINT AFTER ADVANCING NEW-PAGE.
           CLOSE EQUIPMENT-FILE.
025000     CLOSE PRINT-FILE.
           CLOSE WO-EQUIP-HIER.
025200     GOBACK.
073100
       COPY OVRPFCALL IN COPYLIB.

177600 998-BLOWUP.
177700     MOVE "TPRTSUB2" TO BU-PGM-NAME.
177800     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
177900                      VIEW-COMAREA DUMMY-KSAM-STAT
178000                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

025500 8-INPUT-RECORDS.
025600     MOVE SPACES TO LEVEL1-TABLE KEY-TABLE TABLE1.
025700     MOVE "N" TO ALL-RECORDS-WRITTEN-SW ALL-RECORDS-RETURNED-SW.
           MOVE SPACES TO ARG-DEFN.
025900     MOVE EQUIP-TYPE TO HIER-TYPE-DEFN TYPE-BUF-1.
026100     IF ESUBS = SPACES MOVE "0000" TO ESUBS.
           MOVE 0 TO TAB1-SUB TAB2-SUB TAB3-SUB.
026300     MOVE ESUBS TO SAVE-ESUBS.
026500     IF ESUB4 NOT = "0" MOVE "0" TO ESUB4
026600     ELSE
026700     IF ESUB3 NOT = "0" MOVE "0" TO ESUB3
026800     ELSE
026900     IF ESUB2 NOT = "0" MOVE "0" TO ESUB2
027000     ELSE
027100     IF ESUB1 NOT = "0" MOVE "0" TO ESUB1.
027300     MOVE ESUBS TO KEY4-DEFN.
028400     PERFORM 89-START-WO-HIER-MSTR.
028600     IF COND-WORD = 17
028700         DISPLAY "NO HIERARCHY EXISTS FOR " EQUIP-TYPE
029300     ELSE
029400     PERFORM 80-GET-ENTRIES THRU 80-GE-EXIT UNTIL
029500         COND-WORD = 15.
030600
030800 80-GET-ENTRIES.
           PERFORM 89-READ-WO-HIER-MSTR.
031100     IF COND-WORD = 15 GO TO 80-GE-EXIT.
031700     IF SAVE-ESUBS NOT = "0000"
031900         IF SON-4-BUF NOT = SAVE-ESUBS
032000             GO TO 80-GE-EXIT.
032200     IF SUB4-BUF > 0
032300         NEXT SENTENCE
032400     ELSE
032500     ADD 1 TO TAB3-SUB
032600     IF TAB3-SUB > 1700
032700         DISPLAY "KEY TABLE OVERFLOW PGM TPRTSUB2 " EQUIP-TYPE
032800         GO TO 2-EOJ
032900     ELSE
033000     MOVE SON-4-BUF TO KEY-TAB (TAB3-SUB)
033100     IF SUB3-BUF > 0
033200         NEXT SENTENCE
033300     ELSE
033400     IF SUB2-BUF > 0
033500         NEXT SENTENCE
033600     ELSE
033700     MOVE SUB1-BUF   TO TAB1-SUB
033800     MOVE SON-4-BUF  TO LEV1-TAB-SUB  (TAB1-SUB)
033900     MOVE SUB-NAME30 TO LEV1-TAB-NAME (TAB1-SUB)
034000     GO TO 80-GE-EXIT.
034100
034200     MOVE SON-4-BUF  TO SUBNUM-SORT.
034300     MOVE SUB-NAME30 TO SUBNAME-SORT.
034500     RELEASE SORT-REC.
034600 80-GE-EXIT.    EXIT.
034800
       89-START-WO-HIER-MSTR.
           MOVE 0 TO COND-WORD.
           MOVE ARG-DEFN TO HIERKEY OF WEHREC.
           START WO-EQUIP-HIER KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WEH-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       89-READ-WO-HIER-MSTR.
           MOVE 0 TO COND-WORD.
           READ WO-EQUIP-HIER NEXT INTO EQUIP-HIER-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF EQP-TYPE-BUF NOT = ETYPE
               MOVE 15 TO COND-WORD.
           IF WEH-STATUS NOT = "00" MOVE 15 TO COND-WORD.

035300 9-WRITE-RECORDS.
035400     PERFORM 91-HOUSEKEEPING THRU 91-H-EXIT.
035600     PERFORM 92-RETURN-REC THRU 92-RR-EXIT UNTIL
035700             ALL-RECORDS-RETURNED-SW = "Y".
036000
036200 91-HOUSEKEEPING.
036500     PERFORM 911-RETRIEVE-DESC THRU 911-RD-EXIT.
036700     MOVE TYPE-BUF-1 TO TYPE-5-H.
036800     MOVE 0 TO TAB1-SUB.
036900     MOVE 3 TO TAB2-SUB.
037000     MOVE 6 TO TAB3-SUB.
037100     PERFORM 97-HEADINGS THRU 97-H-EXIT.
037200     MOVE 0 TO TAB1-SUB TAB2-SUB TAB3-SUB.
037300 91-H-EXIT.    EXIT.
037500
037700 911-RETRIEVE-DESC.
           MOVE 0 TO COND-WORD.
           READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
               AT END    MOVE 11 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
038000     IF COND-WORD = 11 GO TO 911-RD-EXIT.
038400     IF EQP-TYPE NOT = TYPE-BUF-1 GO TO 911-RETRIEVE-DESC.
038600     MOVE EQP-CORP-DESC TO H-O-NAME.
038700     MOVE EQP-TYPE      TO H-O-TYPE.
038800 911-RD-EXIT.    EXIT.
039000
039200 92-RETURN-REC.
039300     RETURN SORT-FILE AT END
039400         MOVE 0   TO TAB1-SUB
039500         MOVE 52  TO TAB2-SUB LINE-K
039600         MOVE 104 TO TAB3-SUB
039700         MOVE "Y" TO ALL-RECORDS-RETURNED-SW
039800         PERFORM 96-MAIN THRU 96-M-EXIT UNTIL
039900                 ALL-RECORDS-WRITTEN-SW = "Y"
040000         GO TO 92-RR-EXIT.
040200     ADD 1 TO TAB1-SUB.
040300     MOVE SUBNUM-SORT  TO TAB1-SUBNUM  (TAB1-SUB).
040400     MOVE SUBNAME-SORT TO TAB1-SUBNAME (TAB1-SUB).
040600     IF TAB1-SUB = 156
040700       MOVE 0   TO TAB1-SUB
040800       MOVE 52  TO TAB2-SUB LINE-K
040900       MOVE 104 TO TAB3-SUB
041000       PERFORM 96-MAIN THRU 96-M-EXIT UNTIL
041100               ALL-RECORDS-WRITTEN-SW = "Y"
041200       MOVE "N" TO ALL-RECORDS-WRITTEN-SW
041300       MOVE SPACES TO TABLE1
041400       MOVE 0 TO TAB1-SUB.
041500 92-RR-EXIT.   EXIT.
041700
041900 96-MAIN.
042000     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
042200     IF TAB1-SUBNUM (TAB1-SUB) = SPACES
042300         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
042400         GO TO 96-M-EXIT.
042500     IF TAB1-SUB > LINE-K
042600         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
042700         IF ALL-RECORDS-RETURNED-SW = "Y"
042800             GO TO 96-M-EXIT
042900         ELSE
043000         MOVE SPACES TO PRINTF
043100         WRITE PRINTF AFTER ADVANCING NEW-PAGE
043200         WRITE PRINTF FROM HEADING-5-H AFTER
043300               ADVANCING 3 LINES
043400         WRITE PRINTF FROM HEADING-4-H AFTER
043500               ADVANCING 1 LINES
043600         GO TO 96-M-EXIT.
043700     IF SUB-POS3 (TAB1-SUB) = 0
043800         MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV1
043900         MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV1
044000         MOVE LEV1-LIT TO LIT1-REC
044100     ELSE
044200     IF SUB-POS4 (TAB1-SUB) = 0
044300         MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV2
044400         MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV2
044500         MOVE LEV2-LIT TO LIT1-REC
044600     ELSE
044700     MOVE TAB1-SUBNUM (TAB1-SUB) TO SUB-LEV3
044800     MOVE TAB1-SUBNAME (TAB1-SUB) TO NAME-LEV3
044900     MOVE LEV3-LIT TO LIT1-REC.
045000     IF TAB1-SUBNUM (TAB2-SUB) NOT = SPACES
045100         IF SUB-POS3 (TAB2-SUB) = 0
045200             MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV1
045300             MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV1
045400             MOVE LEV1-LIT TO LIT2-REC
045500         ELSE
045600         IF SUB-POS4 (TAB2-SUB) = 0
045700             MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV2
045800             MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV2
045900             MOVE LEV2-LIT TO LIT2-REC
046000         ELSE
046100         MOVE TAB1-SUBNUM (TAB2-SUB) TO SUB-LEV3
046200         MOVE TAB1-SUBNAME (TAB2-SUB) TO NAME-LEV3
046300         MOVE LEV3-LIT TO LIT2-REC
046400     ELSE
046500     MOVE SPACES TO LIT2-REC.
046600     IF TAB1-SUBNUM (TAB3-SUB) NOT = SPACES
046700         IF SUB-POS3 (TAB3-SUB) = 0
046800             MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV1
046900             MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV1
047000             MOVE LEV1-LIT TO LIT3-REC
047100         ELSE
047200         IF SUB-POS4 (TAB3-SUB) = 0
047300             MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV2
047400             MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV2
047500             MOVE LEV2-LIT TO LIT3-REC
047600         ELSE
047700         MOVE TAB1-SUBNUM (TAB3-SUB) TO SUB-LEV3
047800         MOVE TAB1-SUBNAME (TAB3-SUB) TO NAME-LEV3
047900         MOVE LEV3-LIT TO LIT3-REC
048000     ELSE
048100     MOVE SPACES TO LIT3-REC.
048300     WRITE PRINTF FROM DETAIL-REC AFTER ADVANCING 1 LINES.
048400 96-M-EXIT.    EXIT.
048600
048800 97-HEADINGS.
048900     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
049100     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-1-H.
049200     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-1-H.
049300     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-1-H.
049400     MOVE SPACES TO PRINTF.
049500     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
049600     WRITE PRINTF FROM HEADING-0-H AFTER ADVANCING 3 LINES.
049700     WRITE PRINTF FROM HEADING-4-H AFTER ADVANCING 1 LINES.
049800     WRITE PRINTF FROM HEADING-1-H AFTER ADVANCING 1 LINES.
049900     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
050000     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-2-H.
050100     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-2-H.
050200     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-2-H.
050300     WRITE PRINTF FROM HEADING-2-H AFTER ADVANCING 1 LINES.
050400     ADD 1 TO TAB1-SUB TAB2-SUB TAB3-SUB.
050500     MOVE LEV1-TAB-NAME (TAB1-SUB) TO NAME1-3-H.
050600     MOVE LEV1-TAB-NAME (TAB2-SUB) TO NAME2-3-H.
050700     MOVE LEV1-TAB-NAME (TAB3-SUB) TO NAME3-3-H.
050800     WRITE PRINTF FROM HEADING-3-H AFTER ADVANCING 1 LINES.
050900     WRITE PRINTF FROM HEADING-4-H AFTER ADVANCING 1 LINES.
051000 97-H-EXIT.    EXIT.
