001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TPRTBINS.
001300 AUTHOR.         N-W-REGIMBAL.
001400*INSTALLATION.   GOODYEAR TIRE & RUBBER CO.
001500*DATE-WRITTEN.   JULY 31, 1980.
001600*REMARKS.        THIS PROGRAM PRINTS A REPORT LISTING OF
001700*                ALL STOREROOM BIN LOCATIONS BY CORP-CODE.
001800*
001900*                ADDED INTERNATIONAL DATE ROUTINE "TDATECHK"
002000*                ON MAY 20, 1985.   V.W.D.
002100*
002200*                THE FOLLOWING HAS BEEN ADDED:
002300*                 -TRSCREEN FOR FRONT END REPORT OPTIONS
002400*                 -ADDED HEADER PAGE TO THE REPORT USING
002500*                  SUBPROGRAM THDPRT2
002600*                 -PRINT COMPRESSION FEATURE
002700*                 -NON-HP-LOGIC
002800*                 -CHANGED TO USE COPYLIB FOR ALL DATA SET
002900*                  BUFFER DESC.
003000*                 -CHANGED COPY STATEMENTS TO "IN COPYCSIS"
003100*                  JAN 8,1987.  CJR.
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  06/13/96        JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
003200
003300 ENVIRONMENT DIVISION.
003400 CONFIGURATION SECTION.
003500 SOURCE-COMPUTER.    HP-3000.
003600 OBJECT-COMPUTER.    HP-3000.
003700 SPECIAL-NAMES. C01 IS NEW-PAGE.
003900
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
004000     SELECT SORT-FILE      ASSIGN TO DISK-SORT.
004100     SELECT PRINT-FILE     ASSIGN TO PRINTER-MCPRT.
             SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
004400 DATA DIVISION.
004500 FILE SECTION.
004600 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
004700     LABEL RECORDS ARE OMITTED
004800     DATA RECORD IS PRT-REC.
004900 01  PRT-REC                 PIC X(132).
005000
005100 SD  SORT-FILE RECORD CONTAINS 80 CHARACTERS
005200     DATA RECORD IS SORT-REC.
005300 01  SORT-REC.
005400      05  SRT-CORP-CODE   PIC X(8).
005500      05  SRT-LOC1        PIC X(12).
005600      05  SRT-LOC2        PIC X(12).
005700      05  SRT-LOC3        PIC X(12).
005800      05  SRT-LOC4        PIC X(12).
005900      05  SRT-LOC5        PIC X(12).
006000      05  SRT-LOC6        PIC X(12).
006100
       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

006200 WORKING-STORAGE SECTION.
006300
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X.
           05  FILE-STATUS-2            PIC X.
006400
006500 77  NO-ARG           PIC X     VALUE SPACES.
006600 77  LINE-K           PIC 99    VALUE 60 COMP-4.
006700 77  PAGE-K           PIC 9(4)  VALUE 0  COMP-4.
9406CK 01  SCOPE   PIC X.
006800
006900 COPY TDATECHK IN COPYLIB.
007000
007100 COPY DATAB IN COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       COPY CCRTFILE OF COPYLIB.
       COPY CCHKOBJ  OF COPYLIB.
007500
007600******* ESCAPE SEQUENCES ********
007700 COPY ESCNAM2 IN COPYLIB.
007800
007900 01  COMPRESS-PRINT          PIC X(8).
008000
008100 01  NORMAL-PRINT            PIC X(8).
008200
008300 01  ESC-TEXT-61             PIC X(8).
008400
008500 COPY TBLOWUP IN COPYLIB.
008600
008700 01  VIEW-COMAREA.
008800     05  FILLER              PIC X(118) VALUE ALL  "0".
008900     05  FILLER              PIC S9(4)  COMP-4 VALUE 9999.
009000 01  KSAM-STATUS             PIC X(2)   VALUE SPACES.
009100
       COPY THDPRTA OF COPYLIB.
011000 COPY MSTORERM OF COPYLIB.
011300
011400 01  MESSAGE-AREA.
011500     05  NO-INPUT-RECORDS    PIC X(17) VALUE " NO INPUT RECORDS".
011600     05  NO-SORTED-RECORDS   PIC X(28)
011700                             VALUE " NO RECORDS RELEASED TO SORT".
011800     05  SORT-FAILED-MESSAGE PIC X(20)
011900                             VALUE " SORT PROGRAM FAILED".
012000
012100 01  SWITCH-AREA.
012200     05  END-OF-INPUT-FILE               PIC X VALUE "N".
012300         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
012400     05  END-OF-SORT-FILE                PIC X VALUE "N".
012500         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
012600
012700 01  CODE-LOCATION.
012800     05  CORP-CODEX   PIC X(10) VALUE "CORP-CODE,".
012900     05  STR-LOC1     PIC X(9)  VALUE "STR-LOC1,".
013000     05  STR-LOC2     PIC X(9)  VALUE "STR-LOC2,".
013100     05  STR-LOC3     PIC X(9)  VALUE "STR-LOC3,".
013200     05  STR-LOC4     PIC X(9)  VALUE "STR-LOC4,".
013300     05  STR-LOC5     PIC X(9)  VALUE "STR-LOC5,".
013400     05  STR-LOC6     PIC X(9)  VALUE "STR-LOC6;".
013500
014500 01  REPORT1-H.
014600     05  FILLER       PIC X(6)  VALUE " PAGE".
014700     05  RPT-PAGE-NO  PIC ZZ9   VALUE ZEROES.
014800     05  FILLER       PIC X(25) VALUE SPACES.
014900     05  FILLER       PIC X(32)
015000         VALUE "STOREROOM BIN LOCATIONS ANALYSIS".
015100     05  FILLER       PIC X(22) VALUE SPACES.
015200     05  FILLER       PIC X(6)  VALUE "DATE  ".
015300     05  FILLER       PIC X(15) VALUE SPACES.
015400     05  RPT-DATE     PIC X(8)  VALUE SPACES.
015500     05  FILLER       PIC X(3)  VALUE SPACES.
015600     05  RPT-TIME     PIC X(8)  VALUE SPACES.
015700     05  FILLER       PIC X(4)  VALUE SPACES.
015800
015900 01  REPORT2-H.
016000     05  FILLER       PIC X(15) VALUE " CORP-CODE     ".
016100     05  FILLER       PIC X(14) VALUE "STR-LOC1      ".
016200     05  FILLER       PIC X(14) VALUE "STR-LOC2      ".
016300     05  FILLER       PIC X(14) VALUE "STR-LOC3      ".
016400     05  FILLER       PIC X(14) VALUE "STR-LOC4      ".
016500     05  FILLER       PIC X(14) VALUE "STR-LOC5      ".
016600     05  FILLER       PIC X(14) VALUE "STR-LOC6      ".
016700     05  FILLER       PIC X(36) VALUE SPACES.
016800
016900 01  DOT-LINE.
017000     05  FILLER       PIC X(132) VALUE ALL "-".
017100
017200
017300 01  DETAIL-PRINT.
017400     05  FILLER       PIC X(2)  VALUE SPACES.
017500     05  DET-PRT-CODE PIC X(8)  VALUE SPACES.
017600     05  FILLER       PIC X(5)  VALUE SPACES.
017700     05  DET-PRT-LOC1 PIC X(12) VALUE SPACES.
017800     05  FILLER       PIC X(2)  VALUE SPACES.
017900     05  DET-PRT-LOC2 PIC X(12) VALUE SPACES.
018000     05  FILLER       PIC X(2)  VALUE SPACES.
018100     05  DET-PRT-LOC3 PIC X(12) VALUE SPACES.
018200     05  FILLER       PIC X(2)  VALUE SPACES.
018300     05  DET-PRT-LOC4 PIC X(12) VALUE SPACES.
018400     05  FILLER       PIC X(2)  VALUE SPACES.
018500     05  DET-PRT-LOC5 PIC X(12) VALUE SPACES.
018600     05  FILLER       PIC X(2)  VALUE SPACES.
018700     05  DET-PRT-LOC6 PIC X(12) VALUE SPACES.
018800     05  FILLER       PIC X(47) VALUE SPACES.
018900
019000*01  DBPARAMETERS            COPY DATAB.
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
017300 01  DATA-LINE                  PIC X(80).
019100
019200 PROCEDURE DIVISION USING HD-ROUTE-DATA DATA-LINE.
019300 START-UP SECTION.
019400 HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

019500     MOVE "TPRTBINS" TO BU-PGM-NAME.
019700     MOVE 1 TO DATE-MODE.
019800     CALL "TDATECHK" USING DATE-CHECK-AREA.
019900     MOVE DATE-SLASH-OUT  TO RPT-DATE.
020000     MOVE DATE-FORMATTED-TIME-OUT TO RPT-TIME.
020100     OPEN INPUT MSTORERM.
020600 1-GET-SELECTION.
020900     MOVE "DHDR79.PUB" TO HD-FILE-NAME.
065000*---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
065100*---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
065300     OPEN OUTPUT PRINT-FILE.
021000     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
021100          HD-ROUTE-DATA, ESC-NAME.
021200     IF HD-RET-CODE NOT = 0
021300          MOVE "THDPRT2 ERROR IN 1-GET-SELECTION" TO
021400               BU-DISPLAY-MSG
021500          MOVE "HD-RET-CODE = "  TO BU-DISPLAY-FLD (1)
021600          MOVE HD-RET-CODE       TO BU-DISPLAY-FLD9 (1)
021700          GO TO 2-BLOWUP.
021800     CALL "TESCSEQ" USING ESC-NAME.
021900     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
022000     MOVE CHAR-10PI       TO NORMAL-PRINT.
022100     MOVE TEXT-LENGTH-61  TO ESC-TEXT-61.
022200
022300     SORT SORT-FILE
022400          ON ASCENDING KEY SRT-CORP-CODE
022500          INPUT  PROCEDURE IS 8-INPUT-RECORDS THRU 899-EXIT
022600          OUTPUT PROCEDURE IS 9-WRITE-RECORDS THRU 999-EXIT.
022700
022800 2-SHUTDOWN.
022900     CLOSE MSTORERM.
023300     WRITE PRT-REC FROM ESC-TEXT-61   AFTER ADVANCING 0.
023400     WRITE PRT-REC FROM NORMAL-PRINT  AFTER ADVANCING 0.
023500     CLOSE PRINT-FILE.
023600     GOBACK.
023700
023800 2-BLOWUP.
023900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
024000         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
024100         BU-DISPLAY-AREA.
024200
024300 2-BLOWUP-X.
024400      EXIT.
024500
024600
024700 8-INPUT-RECORDS.
           MOVE 0 TO COND-WORD.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC.
           START MSTORERM KEY >= CORPCDE OF MSTORERM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
024800     PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
024900             ALL-INPUT-RECORDS-PROCESSED.
025000     GO TO 8-IR-EXIT.
025100 81-PROCESS-INPUT-RECORDS.
           MOVE 0 TO COND-WORD.
           READ MSTORERM NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.
025400     IF COND-WORD NOT = ZERO
025500         MOVE "Y" TO END-OF-INPUT-FILE
025600         GO TO 81-PIR-EXIT
026200     ELSE
026300         MOVE CORP-CODE TO SRT-CORP-CODE
026400         MOVE STR-LOC (1) TO SRT-LOC1
026500         MOVE STR-LOC (2) TO SRT-LOC2
026600         MOVE STR-LOC (3) TO SRT-LOC3
026700         MOVE STR-LOC (4) TO SRT-LOC4
026800         MOVE STR-LOC (5) TO SRT-LOC5
026900         MOVE STR-LOC (6) TO SRT-LOC6
027000         RELEASE SORT-REC.
027100 81-PIR-EXIT.
027200     EXIT.
027300
027400 8-IR-EXIT.
027500     EXIT.
       899-EXIT.
           EXIT.
027700 9-WRITE-RECORDS.
027800     IF PAPER-IS-132-COLS
027900         NEXT SENTENCE
028000     ELSE
028100         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
028200         WRITE PRT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
028300     MOVE SPACES TO PRT-REC.
028400     RETURN SORT-FILE AT END
028500         MOVE "Y"               TO END-OF-SORT-FILE
028600         MOVE NO-SORTED-RECORDS TO PRT-REC
028700         WRITE PRT-REC AFTER ADVANCING 1 LINES
028800         GO TO 2-SHUTDOWN.
028900     PERFORM 92-PROCESS-SORTED-RECORDS THRU 92-PSR-EXIT
029000             UNTIL ALL-SORTED-RECORDS-PROCESSED.
029100     GO TO 9-WR-EXIT.
029200
029300 92-PROCESS-SORTED-RECORDS.
029400     IF LINE-K > 55
029500         ADD    1    TO PAGE-K
029600         MOVE   1    TO LINE-K
029700         MOVE PAGE-K TO RPT-PAGE-NO
029800         ADD    3    TO LINE-K
029900         WRITE PRT-REC FROM REPORT1-H AFTER ADVANCING NEW-PAGE
030000         WRITE PRT-REC FROM REPORT2-H AFTER ADVANCING 2 LINES
030100         WRITE PRT-REC FROM DOT-LINE AFTER ADVANCING 1 LINES.
030200     MOVE SRT-CORP-CODE TO DET-PRT-CODE.
030300     MOVE SRT-LOC1      TO DET-PRT-LOC1.
030400     MOVE SRT-LOC2      TO DET-PRT-LOC2.
030500     MOVE SRT-LOC3      TO DET-PRT-LOC3.
030600     MOVE SRT-LOC4      TO DET-PRT-LOC4.
030700     MOVE SRT-LOC5      TO DET-PRT-LOC5.
030800     MOVE SRT-LOC6      TO DET-PRT-LOC6.
030900     ADD     1     TO LINE-K.
031000     WRITE PRT-REC FROM DETAIL-PRINT AFTER ADVANCING 1 LINES.
031100     RETURN SORT-FILE AT END
031200         MOVE          "Y"    TO END-OF-SORT-FILE.
031300 92-PSR-EXIT.
031400     EXIT.
031500
031600 9-WR-EXIT.
031700     EXIT.
       999-EXIT.
           EXIT.
047000 COPY OVRPFCALL OF COPYLIB.
