       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TPS2DELT.
       AUTHOR.        CA YODER.

      **************************************************************
      *                                                            *
      *   T P S 2 D E L T      THIS PROGRAM ALLOWS THE USER TO     *
      *     REMOVE AN ENTRY FROM THE PS2 BATCH FILE (MCFPCS2900).  *
      *                                                            *
      **************************************************************
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPS2DELT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPORECD-I
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DSHIPREL-IO
                  ASSIGN TO DATABASE-MCFPCS2900
                  ORGANIZATION IS RELATIVE
                    ACCESS MODE IS SEQUENTIAL
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC             PIC X(2000).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DPORECD-I
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

       FD  DSHIPREL-IO
           LABEL RECORDS ARE STANDARD.
       01  DSHIPREL-REC-IO.
           COPY DDS-ALL-FORMATS  OF MCFLCS2901.

       WORKING-STORAGE SECTION.
       77  COMP-SCREEN-INDIC       PIC X(3)    VALUE SPACES.
       77  ACT-KEY                 PIC 9(9)  VALUE ZEROS.
       77  SAVE-PCPO-SW            PIC X.
       77  SUB                     PIC S9(4)  VALUE ZEROS COMP-4.
       77  DSHIPREL-EOF-SW         PIC X     VALUE "N".
       77  REL-FOUND-SW            PIC X     VALUE "N".
       77  REL-DELETED-SW          PIC X     VALUE "N".
       77  HOLD-NUMBER             PIC X(8)  VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  DELETE-MSG.
           05  FILLER                   PIC X(7)   VALUE "ENTRY  ".
           05  MSG-REL-NUM              PIC X(7).
           05  FILLER                   PIC X(8)   VALUE "  ITEM  ".
           05  MSG-ITM-NUM              PIC X(4).
           05  FILLER                   PIC X(2)   VALUE SPACES.
           05  MSG-LITERAL              PIC X(15).
           05  FILLER                   PIC X(37)  VALUE SPACES.

      **********************
      *                    *
      *  S W I T C H E S   *
      *                    *
      **********************

       01  SWITCH-AREA.
           05  FATAL-ERR-SW            PIC X       VALUE "N".
           05  F6-VALID-SW             PIC X       VALUE "N".
               88  F6-VALID                        VALUE "Y".
           05  F7-VALID-SW             PIC X       VALUE "N".
               88  F7-VALID                        VALUE "Y".
           05  EOF-SW                  PIC X       VALUE "N".
           05  ERR-SW                  PIC X       VALUE "N".


       01  BUILD-PO-NUM.
           05  FILLER                  PIC X    VALUE "P".
           05  PO-NUM                  PIC X(7) VALUE SPACES.
           05  PO-RLSE                 PIC X(3) VALUE "999".
           05  PO-RCV                  PIC X(3) VALUE "000".

       COPY VCOMAREA IN COPYLIB.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(64)    VALUE SPACE.
           05  MSG-FLD               PIC X(12)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1       COMP-4.

       01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS   COMP-4.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL             PIC S9(4)    VALUE ZERO    COMP-4.
           05  PAGECNTL              PIC S9(4)    VALUE 49      COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".

       COPY CATREAD IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

      **************************************************************
      **************************************************************
      **                                                          **
      **             TERMINAL I/O DATA AREA                       **
      **                                                          **
      **************************************************************
      **************************************************************

       01  SCREEN-1.
           05  DE-PO-NUM               PIC X(7)  VALUE SPACES.
           05  DE-ITM-NUM              PIC 9(4).
           05  DE-CHG-DEPT             PIC X(4)  VALUE SPACES.
           05  DE1-MESSAGE-LINE        PIC X(79) VALUE SPACES.

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************


       COPY DSHIPREL IN COPYLIB.

       COPY MPLTINFO IN COPYLIB.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME              PIC X(16)  VALUE SPACES.
           05  DSET-DSHIPREL          PIC X(16)  VALUE "DSHIPREL;".
           05  DSET-DPORECD           PIC X(16)  VALUE "DPORECD;".
           05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".

       COPY DATAB IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS              PIC XX    VALUE "@;".
           05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".
           05  PO-SEARCH              PIC X(10) VALUE "PO-RCV-NO;".

       01 ARG-VALUES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  CODE-ARG               PIC X(8)  VALUE SPACES.
           05  PO-ARG                 PIC X(14) VALUE SPACES.

       COPY CCHKOBJ IN COPYLIB.

       COPY CCHKOBJM IN COPYLIB.

       01  DATES-AND-TIMES.
           05  HP-CUR-DATE.
               10  MM               PIC XX.
               10  FILLER           PIC X.
               10  DD               PIC XX.
               10  FILLER           PIC X.
               10  YY               PIC XX.
       01  CUR-DATE-CN.
           05  CUR-CC               PIC XX.
           05  CUR-DATE.
               10  CUR-YY           PIC XX.
               10  CUR-MM           PIC XX.
               10  CUR-DD           PIC XX.

       COPY TDATECHK IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
           MOVE  27 TO LANG-SETNUM.
           MOVE  60 TO LANG-MSGNUM.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO MSG-LITERAL.

           OPEN I-O DISPLAY-FILE, DSHIPREL-IO.
           OPEN INPUT MPLTINFO-I, DPORECD-I.

           MOVE "N"     TO  SAVE-PCPO-SW.
           MOVE "PCPO"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FAILED IN TREQRETN" TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           IF MPLTINFO-PCPO-SW = " "
               MOVE "N"                     TO  SAVE-PCPO-SW
           ELSE
           MOVE MPLTINFO-PCPO-SW            TO  SAVE-PCPO-SW.

      **************************************************
      *                                                *
      *   GET CO. AND PRIME FROM MPLTINFO              *
      *   USING 'P 01' AS THE ARGUMENT                 *
      *                                                *
      **************************************************

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY            TO  COMP-SCREEN-INDIC.
           ACCEPT CUR-DATE FROM DATE.
           IF CUR-YY > "70"
               MOVE "19"                    TO  CUR-CC
           ELSE
               MOVE "20"                    TO  CUR-CC.

       1-H-X.
           EXIT.

       2-EOJ.
           CLOSE DISPLAY-FILE, MPLTINFO-I, DPORECD-I, DSHIPREL-IO.


       2-EOJ-X.
            EXIT.

      ******************************************************
      **                                                  **
      **   BLOWUP ROUTINE                                 **
      **                                                  **
      ******************************************************

       2-BLOWUP.
           MOVE "TPS2DELT"              TO  BU-PGM-NAME.
           MOVE DE-PO-NUM               TO  BU-DISPLAY-FLD (1)
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.


       4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
           MOVE MESSAGE-BUFFER  TO DE1-MESSAGE-LINE.

       4-PGM-ERROR-X.
           EXIT.


      **************************************************
      *                                                *
      *     6 - M A I N                                *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "DELTSCRN"         TO  VIEW-NFNAME.
           MOVE SPACES             TO  SCREEN-1.
           MOVE 0                  TO  DE-ITM-NUM.
           IF REL-DELETED-SW = "Y"
               MOVE B"1" TO IND(99)
               MOVE MESSAGE-BUFFER   TO  DE1-MESSAGE-LINE
               MOVE "N"              TO  REL-DELETED-SW.

       6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1           TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC        TO SCREEN-1.

           IF VIEW-LASTKEY = 3
               GO TO 6-M-X
           ELSE
           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        "* INVALID FUNCTION KEY ENTERED *"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 3  TO  FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

      *------ FIELD EDITS
           IF DE-PO-NUM = SPACES
      *    YOU MUST ENTER PO NUMBER
               MOVE 44037 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 20 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           IF DE-ITM-NUM = 0
      *    YOU MUST ENTER ITEM NUMBER
               MOVE 66103 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 21 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           IF DE-CHG-DEPT = SPACES
      *    YOU MUST ENTER CHARGE DEPT
               MOVE 03110 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 22 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           MOVE "RLACTIVE" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
      *        "RELEASES ARE BEING PROCESSED NOW; CANNOT PROCESS"
               MOVE 18059 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 20 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           PERFORM 70-START-DRELFILE.
           IF REL-FOUND-SW = "N"
      *    PO DOES NOT EXIST
               MOVE 16045 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 20 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           IF REL-FOUND-SW = "Y" AND DREL-REQ-NO > SPACES
      *    USE PU9 TO RETURN REQUISITION
      *        MOVE 16045 TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE
               "PO LINKED TO REQUISITION; USE PU9 TO RETURN TO MATERIALS
      -            " CONTROL"    TO MESSAGE-BUFFER
               MOVE 20 TO FIELD-NUMBER
               PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
               GO TO 6-SHOWFORM-SCREEN-1.

           PERFORM 73-DELETE-DSHIPREL.
           MOVE "Y"             TO  REL-DELETED-SW.
           MOVE DE-PO-NUM       TO  MSG-REL-NUM.
           MOVE DE-ITM-NUM      TO  MSG-ITM-NUM.
           MOVE DELETE-MSG      TO  MESSAGE-BUFFER.
           PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X.
           GO TO 6-MAIN.

       6-M-X.
           EXIT.

      *-------- SEARCH FOR RELEASE IN BATCH FILE.
       70-START-DRELFILE.
           CLOSE DSHIPREL-IO.
           OPEN I-O DSHIPREL-IO.
           MOVE "N"             TO  DSHIPREL-EOF-SW
                                    REL-FOUND-SW.
           READ DSHIPREL-IO INTO BUF-DSHIPREL
               AT END MOVE "Y"    TO  DSHIPREL-EOF-SW.

           IF DSHIPREL-EOF-SW = "N"
               PERFORM 70-READ-DRELFILE UNTIL DSHIPREL-EOF-SW = "Y" OR
                                              REL-FOUND-SW = "Y".

       70-READ-DRELFILE.
           IF DE-PO-NUM = DREL-NUMBER AND DREL-SEQ-NO = 0
                                       AND DREL-ITEM-NO = DE-ITM-NUM
                                       AND DREL-SUBD = DE-CHG-DEPT
               MOVE "Y"               TO  REL-FOUND-SW
               MOVE DREL-NUMBER       TO  HOLD-NUMBER
           ELSE
               READ DSHIPREL-IO INTO BUF-DSHIPREL
                   AT END MOVE "Y"    TO  DSHIPREL-EOF-SW.

       73-DELETE-DSHIPREL.
           DELETE DSHIPREL-IO.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE DSHIPREL 73-DS" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
           READ DSHIPREL-IO INTO BUF-DSHIPREL
               AT END MOVE "Y"        TO  DSHIPREL-EOF-SW.
           PERFORM UNTIL  DREL-SEQ-NO = 0 OR DSHIPREL-EOF-SW = "Y"
               DELETE DSHIPREL-IO
               READ DSHIPREL-IO INTO BUF-DSHIPREL
                   AT END MOVE "Y"    TO  DSHIPREL-EOF-SW
               END-READ
           END-PERFORM.

       CAT-READ SECTION.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       COPY DISPCALL IN COPYLIB.

