000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TPURPRNT.
      *
      *C  03/13/1997   CA YODER
      *C   ADDED LOGIC TO ALLOW THE USER TO SELECT A PO PRINT WITHOUT
      *C   USING SPECIAL ASCII CHARACTERS.  IF "N" IS SELECTED ON THE
      *C   SCREEN, "TPOPRNT2" WILL BE CALLED INSTEAD OF "TPOPRNT".
      *
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                       LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPURPRNT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

000800 DATA DIVISION.
000900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0101.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

001000 WORKING-STORAGE SECTION.
001200 77  SUB                          PIC S9(4) COMP-4.
       77  SAVE-NOASCII-REPORTS         PIC X.
001400 01  BLOWUP-BASE                  PIC X(10).
       01  COMPANY-SAVE                 PIC XXX.
001500 01  CUR-DATE-BUFF.
001600     05  FILLER                   PIC X.
001700     05  C-D-YDIG                 PIC 9.
           05  FILLER                   PIC X(4).
       COPY CATREAD   IN COPYLIB.
       COPY CPYIND    IN COPYLIB.
001800 COPY DATAB     IN COPYLIB.
       01  DSPLY-STATUS                 PIC XX.
002100 01  ERROR-BUFFER                 PIC X(80).
002200 COPY ESCNAME    IN COPYLIB.
       01  FILE-STATUS                  PIC XX.
       01  INPUT-BUFFER.
           05  INPUT-PO.
               10  INPUT-PO-7           PIC X(7).
               10  INPUT-PO-REL         PIC XXX.
           05  INPUT-SPOOL-NUMBER       PIC XX.
           05  I-S-N-9 REDEFINES INPUT-SPOOL-NUMBER
                                        PIC 99.
           05  INPUT-SPEC-CHAR          PIC X.
           05  INPUT-CMD-LINE           PIC X(79).
           05  INPUT-ERR-LINE           PIC X(79).
       COPY IOFEEDBACK IN COPYLIB.
003000 COPY LANGUAGE   IN COPYLIB.
003100 COPY MPLTINFO   IN COPYLIB.
003200 COPY MPORCV     IN COPYLIB.
003300 01  PLT-ARG                      PIC X(4).
003400 01  PO-IN.
003500     05  PO-LET                   PIC X    VALUE "P".
003600     05  PO-IN-7                  PIC X(7).
003700     05  PO-IN-REL                PIC X(3).
003800     05  PO-IN-RCVR               PIC X(3) VALUE "000".
004200 01  PO-PRINT-PARMS.
004300     05  PO-NUMBER.
004400         10  FILLER               PIC X.
004500         10  PO-RLSE-NO.
004600             15  PETTY-PO-CHECK   PIC X.
004700             15  FILLER           PIC X(12).
004800     05  PO-REPRINT               PIC X.
004900     05  PO-PRINT-TYPE            PIC X.
005000     05  PO-MODIFIED-ORDER        PIC X.
005100     05  PO-CANCELLED-ORDER       PIC X.
005200     05  SPOOL-PRINT-NUM          PIC S9(2)  COMP-4.
005300     05  PO-ITEMS OCCURS 15 TIMES INDEXED BY P-INDEX.
005400         10  PO-ITEM              PIC X(4).
005500 COPY TBLOWUP    IN COPYLIB.
005600 COPY VCOMAREA   IN COPYLIB.
       COPY WSCONTROL  IN COPYLIB.
005700 PROCEDURE DIVISION.
005800 START-PGM.
005900     PERFORM 1-HSK.
006000     PERFORM 6-MAIN THRU 6-MAIN-EXIT.

006100 2-EOJ.
006200     CLOSE MPORCV-I, MPLTINFO-I.
           CLOSE DISPLAY-FILE.
006500     GOBACK.

006600 2100-BLOWUP.
006700     MOVE "TPURPRNT"           TO BU-PGM-NAME.
006800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
006900         VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
007000             BU-DISPLAY-FLDS.
007100
007200 1-HSK.
           OPEN INPUT  MPORCV-I, MPLTINFO-I.
           OPEN I-O    DISPLAY-FILE.
           ACCEPT CUR-DATE-BUFF FROM DATE.
009000     CALL "TESCSEQ" USING ESC-NAME.

011600     MOVE "FPURPRNT"           TO VIEW-CFNAME.
012100     MOVE SPACES               TO PO-PRINT-PARMS,
                                        INPUT-BUFFER.

012200     MOVE "POPT"               TO PLT-ARG.
012300     MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
012400     READ MPLTINFO-I INTO BUF-MPLTINFO
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
012500     IF FILE-STATUS NOT = "00"
012600         MOVE "GET MPLTINFO 'POPT'*1HSK" TO BU-DISPLAY-MSG
012700         MOVE PLT-ARG  TO  BU-DISPLAY-FLD (1)
012800         GO TO 2100-BLOWUP
012900     ELSE
013000     MOVE MPLTINFO-PO-PRT-NO  TO INPUT-SPOOL-NUMBER
           MOVE MPLTINFO-NOASCII-REPORTS   TO  SAVE-NOASCII-REPORTS.

088800     MOVE "P 01"         TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE MPLTINFO-COMPANY TO COMPANY-SAVE
           ELSE
089200     MOVE "GET MPLTINFO 1-HSK" TO BU-DISPLAY-MSG
089300     MOVE PLT-ARG              TO BU-DISPLAY-FLD (1)
089400     GO TO 2100-BLOWUP.

           IF COMPANY-SAVE = "631"
               MOVE "75"             TO INPUT-SPOOL-NUMBER.
           IF SAVE-NOASCII-REPORTS = "Y"
               MOVE "N"              TO INPUT-SPEC-CHAR
           ELSE
               MOVE "Y"              TO INPUT-SPEC-CHAR.
           IF COMPANY-SAVE = "631"
               MOVE "N"              TO INPUT-SPEC-CHAR.

013100 6-MAIN.
           MOVE INPUT-BUFFER         TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC            TO INPUT-BUFFER.
015100     IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
      *    IF COMPANY-SAVE = "631"
      *        IF INPUT-PO-7 > "0069000" AND INPUT-PO-7 < "0075000"
      *            NEXT SENTENCE
      *        ELSE
      *        MOVE 16170               TO CATREAD-MSG-NUMBER
      *        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      *        MOVE ERROR-BUFFER        TO INPUT-ERR-LINE
      *        MOVE B"1"                TO INDS (99)
      *        GO TO 6-MAIN.
016700     MOVE INPUT-PO-7          TO PO-IN-7.
016800     IF INPUT-PO-REL = "   "
016900         MOVE "000"           TO PO-IN-REL
017000     ELSE
017100     MOVE INPUT-PO-REL        TO PO-IN-REL.
           MOVE PO-IN TO PORCVNO OF MPORCV-REC-I.
           READ MPORCV-I INTO BUF-MPORCV
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
017400     IF FILE-STATUS NOT = "00"
017500         MOVE 16045           TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER    TO INPUT-ERR-LINE
               MOVE B"1"            TO INDS (99)
018000         GO TO 6-MAIN.
           MOVE SPACES              TO PO-PRINT-PARMS.
018100     MOVE PO-IN               TO PO-NUMBER.
018200     IF PO-IN-REL > "000" AND < "999"
018300         MOVE "S"             TO PO-PRINT-TYPE.
018400     MOVE "Z"                 TO PO-REPRINT.
           MOVE I-S-N-9             TO SPOOL-PRINT-NUM.
           IF INPUT-SPEC-CHAR = "Y"
               CALL "TPOPRNT" USING BASE,
                                    PO-PRINT-PARMS,
                                    ESC-NAME
                                    LANGUAGE-PARMS
           ELSE
               CALL "TPOPRNT2" USING BASE,
                                     PO-PRINT-PARMS,
                                     ESC-NAME
                                     LANGUAGE-PARMS.
           MOVE SPACES              TO INPUT-PO,
                                       INPUT-ERR-LINE.
           IF SAVE-NOASCII-REPORTS = "Y"
               MOVE "N"              TO INPUT-SPEC-CHAR
           ELSE
               MOVE "Y"              TO INPUT-SPEC-CHAR.
018900     GO TO 6-MAIN.
019000 6-MAIN-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
