       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPWDISP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PROGRAM-TABLE
                  ASSIGN       TO DATABASE-MCFLPW0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PASSWORD-TABLE
                  ASSIGN       TO DATABASE-MCFLPW0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPWSEC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PROGRAM-TABLE
           LABEL RECORDS       ARE STANDARD.
       01  PR-REC.
           COPY DDS-ALL-FORMATS OF MCFLPW0101.

       FD  PASSWORD-TABLE
           LABEL RECORDS       ARE STANDARD.
       01  PA-REC.
           COPY DDS-ALL-FORMATS OF MCFLPW0201.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HELP-SW             PIC 9(04) VALUE 0.
       77  RECNO               PIC 9(08) VALUE 0.
       77  ARG-KEY             PIC X(08).
       77  TYPE-KEY            PIC XX.
       77  ANSWER-FIELD        PIC X.
       77  END-SW              PIC 9     VALUE 0.
       77  FIND-SW             PIC 9     VALUE 0.
       77  SCRN-SW             PIC 9     VALUE 0.
       77  TRUE-VAL            PIC 1     VALUE B"1".
       77  NEG-VAL             PIC 1     VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPWDISP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(30) VALUE
                   "DISPLAY PROGRAM NAMES AND DESC".
               10  PROG-DESC-A     PIC X(30) VALUE
                   "RIPTIONS TO IDENTIFY PROGRAMS ".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "TO WHICH YOU WISH TO APPLY IND".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "IVIDUAL PASSWORDS.            ".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "RUNS FROM THE F1 KEY OF THE MA".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "INTENANCE PROGRAM MENU.       ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  PROG-CATAGORY                   PIC X(28).
           05  PROGRAM-1.
               10  PROG-ID-1                   PIC X(08).
               10  PROG-DESC-BUF-1.
                   15  DESC-1-1                PIC X(60).
                   15  DESC-1-2                PIC X(60).
                   15  DESC-1-3                PIC X(60).
               10  PROG-REL-1                  PIC X(13).
               10  LU-DATE-1                   PIC X(08).
               10  LU-TIME-1                   PIC X(05).
           05  PROGRAM-2.
               10  PROG-ID-2                   PIC X(08).
               10  PROG-DESC-BUF-2.
                   15  DESC-2-1                PIC X(60).
                   15  DESC-2-2                PIC X(60).
                   15  DESC-2-3                PIC X(60).
               10  PROG-REL-2                  PIC X(13).
               10  LU-DATE-2                   PIC X(08).
               10  LU-TIME-2                   PIC X(05).
           05  PROGRAM-3.
               10  PROG-ID-3                   PIC X(08).
               10  PROG-DESC-BUF-3.
                   15  DESC-3-1                PIC X(60).
                   15  DESC-3-2                PIC X(60).
                   15  DESC-3-3                PIC X(60).
               10  PROG-REL-3                  PIC X(13).
               10  LU-DATE-3                   PIC X(08).
               10  LU-TIME-3                   PIC X(05).
           05  PROGRAM-4.
               10  PROG-ID-4                   PIC X(08).
               10  PROG-DESC-BUF-4.
                   15  DESC-4-1                PIC X(60).
                   15  DESC-4-2                PIC X(60).
                   15  DESC-4-3                PIC X(60).
               10  PROG-REL-4                  PIC X(13).
               10  LU-DATE-4                   PIC X(08).
               10  LU-TIME-4                   PIC X(05).
           05  CMDMSG                          PIC X(79).
           05  ERRMSG                          PIC X(79).

       01  PROGRAM-DATA.
           05  PROG-NAME-M                     PIC X(08).
           05  PROG-TYPE                       PIC X(02).
           05  DB-VERS                         PIC X(02).
           05  DB-RLSE                         PIC 9(02) VALUE ZEROS.
           05  PROG-RLSE                       PIC 9(04) VALUE ZEROS.
           05  PROG-COMP                       PIC 9(04) VALUE ZEROS.
           05  PROG-DESC.
               10  PROG-DESC-1                 PIC X(60).
               10  PROG-DESC-2                 PIC X(60).
               10  PROG-DESC-3                 PIC X(60).
           05  DATE-PROG-INIT.
               10  DINIT-CC                    PIC XX.
               10  DINIT-YY                    PIC XX.
               10  DINIT-MM                    PIC XX.
               10  DINIT-DD                    PIC XX.
           05  TIME-PROG-INIT                  PIC X(04).
           05  DATE-PROG-LAST-USED.
               10  DLAST-CC                    PIC XX.
               10  DLAST-YY                    PIC XX.
               10  DLAST-MM                    PIC XX.
               10  DLAST-DD                    PIC XX.
           05  TIME-PROG-LAST-USED.
               10  TLAST-HR                    PIC XX.
               10  TLAST-MN                    PIC XX.

       01  PASSWORD-DATA.
           05  PROG-NAME-D     PIC X(08).
           05  USER-NAME       PIC X(08).
           05  USER-TERM       PIC X(04).
           05  PASS-WORD       PIC X(08).

       01  DATE-DISPLAY.
           05  DATE-MM         PIC XX.
           05  FILLER          PIC X    VALUE "/".
           05  DATE-DD         PIC XX.
           05  FILLER          PIC X    VALUE "/".
           05  DATE-YY         PIC XX.

       01  TIME-DISPLAY.
           05  TIME-HR         PIC XX.
           05  FILLER          PIC X    VALUE ":".
           05  TIME-MN         PIC XX.

       01  PROG-RELEASE-BUFF.
           05  DB-VERS-BUF     PIC XX.
           05  PER-1           PIC X.
           05  DB-RLSE-BUF     PIC 99 VALUE ZEROS.
           05  PER-2           PIC X.
           05  PG-RLSE-BUF     PIC 999 VALUE ZEROS.
           05  PER-3           PIC X.
           05  PG-COMP-BUF     PIC 999 VALUE ZEROS.

       01  PWORD-LINE.
           05  PWORD-UN        PIC X(08).
           05  PWORD-UT        PIC ZZZ9.
           05  PWORD-TU        REDEFINES PWORD-UT PIC XXXX.
           05  PWORD           PIC X(08).

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  MESSAGE-BUF-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO BEGIN.
           GOBACK.

       BEGIN.
           OPEN INPUT          PROGRAM-TABLE.
           OPEN INPUT          PASSWORD-TABLE.
           OPEN I-O            DISPLAY-FILE.
           MOVE "VPWDISPA"     TO SCREEN-NAME.
           MOVE 0              TO RECNO END-SW FIND-SW SCRN-SW.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.

       SELECT-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 2
               MOVE "UP"       TO TYPE-KEY
               MOVE "      UPDATE PROGRAMS       " TO PROG-CATAGORY
           ELSE
           IF KEY-HIT = 4
               MOVE "RE"       TO TYPE-KEY
               MOVE "      REPORT PROGRAMS       " TO PROG-CATAGORY
           ELSE
           IF KEY-HIT = 5
               MOVE "MA"       TO TYPE-KEY
               MOVE "    MAINTENANCE PROGRAMS    " TO PROG-CATAGORY
           ELSE
           IF KEY-HIT = 6
               MOVE "IF"       TO TYPE-KEY
               MOVE "MMIS/CSIS INTERFACE PROGRAMS" TO PROG-CATAGORY
           ELSE
           IF KEY-HIT = 7
               MOVE 10         TO HELP-SW
               CALL "TPWHELP" USING HELP-SW
                   GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 8
               MOVE "IN"       TO TYPE-KEY
               MOVE "      INQUIRY PROGRAMS      " TO PROG-CATAGORY
           ELSE
               GO TO SELECT-SHOWFORM.

           MOVE 0              TO SCRN-SW.
           MOVE SPACES         TO PROGRAM-1 PROGRAM-2.
           MOVE SPACES         TO PROGRAM-3 PROGRAM-4.

       START-DBGET.
           MOVE 0              TO END-SW.
           READ PROGRAM-TABLE  FIRST INTO PROGRAM-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SELECT-SHOWFORM.

           GO TO SELECT-CONT.

       SELECT-DBGET.
           IF END-SW = 1
               GO TO START-DBGET.

           READ PROGRAM-TABLE  NEXT INTO PROGRAM-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10"
               MOVE 1          TO END-SW
               MOVE "23"       TO FILE-STAT.

           IF FILE-STAT-1 = "2" AND FIND-SW = 0
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SELECT-SHOWFORM
           ELSE
           IF FILE-STAT-1 = "2" AND FIND-SW = 1
               IF SCRN-SW = 0
                   MOVE 0      TO FIND-SW
                   GO TO SELECT-CONT
               ELSE
                   IF SCREEN-NAME = "VPWDISPA"
                       MOVE "VPWDISPB" TO SCREEN-NAME
                       GO TO SHOWFORM
                   ELSE
                       GO TO SHOWFORM
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ    " TO DB-FUNC
               MOVE "PROGRAM-TABLE" TO DB-FILE
               MOVE FILE-STAT  TO CON-WORD
               MOVE DB-ERROR   TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SELECT-SHOWFORM.

       SELECT-CONT.
           IF PROG-TYPE NOT = TYPE-KEY
               GO TO SELECT-DBGET.

           ADD 1               TO SCRN-SW.
           MOVE 1              TO FIND-SW.
           MOVE DLAST-MM       TO DATE-MM.
           MOVE DLAST-DD       TO DATE-DD.
           MOVE DLAST-YY       TO DATE-YY.
           MOVE TLAST-HR       TO TIME-HR.
           MOVE TLAST-MN       TO TIME-MN.

           IF SCRN-SW = 1
               MOVE PROG-NAME-M  TO PROG-ID-1
               MOVE PROG-DESC    TO PROG-DESC-BUF-1
               PERFORM GET-RELEASE
               MOVE PROG-RELEASE-BUFF TO PROG-REL-1
               MOVE DATE-DISPLAY TO LU-DATE-1
               MOVE TIME-DISPLAY TO LU-TIME-1
               GO TO SELECT-DBGET.

           IF SCRN-SW = 2
               MOVE PROG-NAME-M  TO PROG-ID-2
               MOVE PROG-DESC    TO PROG-DESC-BUF-2
               PERFORM GET-RELEASE
               MOVE PROG-RELEASE-BUFF TO PROG-REL-2
               MOVE DATE-DISPLAY TO LU-DATE-2
               MOVE TIME-DISPLAY TO LU-TIME-2
               GO TO SELECT-DBGET.

           IF SCRN-SW = 3
               MOVE PROG-NAME-M  TO PROG-ID-3
               MOVE PROG-DESC    TO PROG-DESC-BUF-3
               PERFORM GET-RELEASE
               MOVE PROG-RELEASE-BUFF TO PROG-REL-3
               MOVE DATE-DISPLAY TO LU-DATE-3
               MOVE TIME-DISPLAY TO LU-TIME-3
               GO TO SELECT-DBGET.

           IF SCRN-SW = 4
               MOVE PROG-NAME-M  TO PROG-ID-4
               MOVE PROG-DESC    TO PROG-DESC-BUF-4
               PERFORM GET-RELEASE
               MOVE PROG-RELEASE-BUFF TO PROG-REL-4
               MOVE DATE-DISPLAY TO LU-DATE-4
               MOVE TIME-DISPLAY TO LU-TIME-4.

           IF SCREEN-NAME = "VPWDISPA"
               MOVE "VPWDISPB" TO SCREEN-NAME.

       SHOWFORM.
           MOVE 0              TO SCRN-SW.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 2
               MOVE PROG-ID-1  TO ARG-KEY
               PERFORM SUBF-CLEAR
               PERFORM GET-PWORD THRU GPW-EXIT
               GO TO SHOWFORM.

           IF KEY-HIT = 4
               IF PROG-ID-2 NOT = SPACES
                   MOVE PROG-ID-2 TO ARG-KEY
                   PERFORM SUBF-CLEAR
                   PERFORM GET-PWORD THRU GPW-EXIT
                   GO TO SHOWFORM
               ELSE
                   GO TO SHOWFORM.

           IF KEY-HIT = 5
               IF PROG-ID-3 NOT = SPACES
                   MOVE PROG-ID-3 TO ARG-KEY
                   PERFORM SUBF-CLEAR
                   PERFORM GET-PWORD THRU GPW-EXIT
                   GO TO SHOWFORM
               ELSE
                   GO TO SHOWFORM.

           IF KEY-HIT = 8
               IF PROG-ID-4 NOT = SPACES
                   MOVE PROG-ID-4 TO ARG-KEY
                   PERFORM SUBF-CLEAR
                   PERFORM GET-PWORD THRU GPW-EXIT
                   GO TO SHOWFORM
               ELSE
                   GO TO SHOWFORM.

           IF KEY-HIT = 6
               GO TO BEGIN.

           IF KEY-HIT = 7
               MOVE 10         TO HELP-SW
               CALL "TPWHELP" USING HELP-SW
               GO TO SHOWFORM.

           MOVE SPACES         TO PROGRAM-1 PROGRAM-2.
           MOVE SPACES         TO PROGRAM-3 PROGRAM-4.
           GO TO SELECT-DBGET.

       GET-PWORD.
           MOVE ARG-KEY        TO PWPROGID OF PASSWORD-TABLE.
           START PASSWORD-TABLE KEY = PWPROGID OF PASSWORD-TABLE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
               MOVE  40        TO CATREAD-MSG-SET
               MOVE  15        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO GPW-EXIT.

       DBGET-PWORD.
           READ PASSWORD-TABLE NEXT INTO PASSWORD-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO GPW-CONT
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "PASSWORD-TABLE" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO ERRMSG
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO GPW-EXIT.

           IF PROG-NAME-D NOT = ARG-KEY
               GO TO GPW-CONT.

           MOVE USER-NAME      TO PWORD-UN.
           IF USER-TERM = SPACES
               MOVE USER-TERM  TO PWORD-TU
           ELSE
               MOVE USER-TERM  TO PWORD-UT.

           MOVE PASS-WORD      TO PWORD.
           MOVE PWORD-LINE     TO DISPLAY-REC.
           ADD  1              TO RECNO.
           WRITE SUBFILE       DISPLAY-REC FORMAT "RDSF"
                               INDIC ARE SCREEN-INDICATORS.
           GO TO DBGET-PWORD.

       GPW-CONT.
           WRITE DISPLAY-REC   FORMAT "RDSB"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE B"1"           TO IND(76).
           IF RECNO > 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).
           MOVE ARG-KEY        TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.

       GPW-EXIT.               EXIT.

       GET-RELEASE.
           MOVE SPACES         TO PROG-RELEASE-BUFF.
           MOVE "."            TO PER-1 PER-2 PER-3.
           MOVE DB-VERS        TO DB-VERS-BUF.
           MOVE DB-RLSE        TO DB-RLSE-BUF.
           MOVE PROG-RLSE      TO PG-RLSE-BUF.
           MOVE PROG-COMP      TO PG-COMP-BUF.

       SUBF-CLEAR.
           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75) IND(76).
           MOVE TRUE-VAL       TO IND(77).
           MOVE SPACES         TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT "RDSC"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE NEG-VAL        TO IND(77).

       END-OF-JOB.
           CLOSE               PROGRAM-TABLE.
           CLOSE               PASSWORD-TABLE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

