       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPWEXEC.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
      *REMARKS.                PASSWORD SYSTEM MAINTENANCE
      *                        EXECUTIVE PROGRAM
      *                        ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPWSEC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HELP-SW             PIC 9(04).

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X  VALUE "0".
           05  FILE-STAT-2     PIC X  VALUE "0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPWEXEC ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(30) VALUE
                   "EXECUTIVE PROGRAM FOR THE PLAN".
               10  PROG-DESC-A     PIC X(30) VALUE
                   "T MAINTAINED PASSWORD SYSTEM. ".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "ALLOWS DISPLAY, ADDITION, MODI".
               10  PROG-DESC-B     PIC X(30) VALUE
                   "FICATION, AND DELETION OF     ".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "PASSWORDS ON INDIVIDUAL PROGRA".
               10  PROG-FUNCTION   PIC X(30) VALUE
                   "MS AND SUBROUTINES.           ".
           05  PASSWORD-FLAG       PIC X.

           COPY SCREENIO       IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  MESSAGE-BUFFER.
           COPY ERRORLIN       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN.
           OPEN I-O            DISPLAY-FILE.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GO TO END-OF-JOB.

       MAIN.
           MOVE "VPWMENU"      TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SPACES         TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 1
               CALL "TPWDISP" USING DBPARAMETERS
               IF FUNC-KEY-NUM = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 2
               CALL "TPWINIT" USING DBPARAMETERS
               IF FUNC-KEY-NUM = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 8
               CALL "TPWUPDT" USING DBPARAMETERS
               IF FUNC-KEY-NUM = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 4
               CALL "TPWDEL" USING DBPARAMETERS
               IF FUNC-KEY-NUM = 3
                   GO TO END-OF-JOB
               ELSE
                   GO TO MAIN
           ELSE
           IF KEY-HIT = 7
               MOVE 0          TO HELP-SW
               CALL "TPWHELP" USING HELP-SW
               GO TO MAIN
           ELSE
               GO TO MAIN.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           GOBACK.

