       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPWORD.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.

      ********************************************************************
      **                                                                **
      **          ****  MMIS PASSWORD SYSTEM  ****                      **
      **          SUBROUTINE TO CHECK FOR VALID PASSWORD                **
      **                                                                **
      **   PROGRAMMERS...                                               **
      **       NOTE THAT ALL CHECKS AGAINST THE DATABASE VERSION HAVE   **
      **       BEEN REMOVED FROM THIS PROGRAM.  THE SINGLE ENTRY POINT  **
      **       REMAINING IS TO CHECK FOR A VALID SUBROUTINE PASSWORD    **
      **       IF REQUIRED.  THEREFORE, ALL THE VERSION CODE MAY BE     **
      **       REMOVED FROM THE CALLING PROGRAMS.  CALLS TO PROGRAM     **
      **       NAME 'TPWORD-V' ARE OBSOLETE; CALLS TO 'TPWORD-VP' OR    **
      **       'TPWORD-P' SHOULD BE CHANGED TO 'TPWORD' ALONE.          **
      **                                                                **
      ********************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PROGRAM-TABLE
                  ASSIGN       TO DATABASE-MCFLPW0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PASSWORD-TABLE
                  ASSIGN       TO DATABASE-MCFLPW0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZPWSEC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PROGRAM-TABLE
           LABEL RECORDS       ARE STANDARD.
       01  PR-REC.
           COPY DDS-ALL-FORMATS OF MCFLPW0101.

       FD  PASSWORD-TABLE
           LABEL RECORDS       ARE STANDARD.
       01  PA-REC.
           COPY DDS-ALL-FORMATS OF MCFLPW0201.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  PWORD-REC.
           COPY DDS-ALL-FORMATS OF ZPWSEC.

       WORKING-STORAGE SECTION.
       77  COND-WORD           PIC 9999  VALUE 0.
       77  ARG-KEY             PIC X(08).
       77  FIND-SW             PIC 9     VALUE 0.
       77  HOLD-PASSDATA       PIC X(28).
       77  SHOW-SW             PIC 9     VALUE 0.
       77  FAIL-SW             PIC 9     VALUE 0.
       77  FILE-STAT           PIC XX.
       77  SUB                 PIC S9(4) COMP-3.
       77  SUB1                PIC S9(4) COMP-3.
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  CUR-DATE-XX.
           05  C-DATE-CC       PIC 99.
           05  CUR-DATE.
               10  C-DATE-YY   PIC 99.
               10  C-DATE-MM   PIC 99.
               10  C-DATE-DD   PIC 99.

       01  TIME-BUFF.
           02  TIME-HM.
               03  TIME-HRS    PIC 99.
               03  TIME-MINS   PIC 99.
           02  FILLER          PIC XXXX.

       01  SCREEN-DATA.
           05  PROG-ID-BUF     PIC X(08).
           05  USER-NAME-BUF   PIC X(08).
           05  USER-TERM-BUF   PIC ZZZ9.
           05  PASSWORD-FIELDS.
               10  INV-PWORD   PIC X(16).
               10  ENT-PWORD   PIC X(17).
               10  P-WORD      PIC X(08).
               10  NO-AUTH     PIC X(40).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  PROGRAM-DATA.
           05  PROG-NAME-M     PIC X(08).
           05  PROG-TYPE       PIC X(02).
           05  P-RELEASE.
               10  DB-VERS     PIC X(02).
               10  DB-RLSE     PIC X(02).
               10  PROG-RLSE   PIC X(04).
               10  PROG-COMP   PIC X(04).
           05  PROG-DESC.
               10  PROG-DESC-1 PIC X(60).
               10  PROG-DESC-2 PIC X(60).
               10  PROG-DESC-3 PIC X(60).
           05  DATE-PROG-INIT.
               10  DINIT-CC    PIC XX.
               10  DINIT-YY    PIC XX.
               10  DINIT-MM    PIC XX.
               10  DINIT-DD    PIC XX.
           05  TIME-PROG-INIT  PIC X(04).
           05  DATE-PROG-LAST-USED.
               10  DLAST-CC    PIC XX.
               10  DLAST-YY    PIC XX.
               10  DLAST-MM    PIC XX.
               10  DLAST-DD    PIC XX.
           05  TIME-PROG-LAST-USED
                               PIC X(04).

       01  PASSWORD-DATA.
           05  PROG-NAME-D     PIC X(08).
           05  USER-NAME       PIC X(08).
           05  USER-TERM       PIC X(04).
           05  USER-TERM-9     REDEFINES USER-TERM PIC 9(04).
           05  PASS-WORD       PIC X(08).

       01  PASSWORDS-TABLE.
           05  PASS-TAB OCCURS 50 TIMES.
               10  KEY-P.
                   15  PROG-NAME-P  PIC X(8).
                   15  USER-NAME-P  PIC X(08).
               10  USER-TERM-P PIC X(4).
               10  PASS-WORD-P PIC X(8).

           COPY SCREENIO       IN COPYLIB.

       01  WHO-VARIABLES.
           COPY WHOPARMS       IN COPYLIB.

       LINKAGE SECTION.
       01  PROGRAM-INFORMATION.
           05  PROGRAM-NAME    PIC X(08).
           05  P-TYPE          PIC X(02).
           05  P-RLSE.
               10  P-VERS      PIC X(02).
               10  P-REL       PIC X(02).
               10  FILLER      PIC X(08).
           05  PROG-INFO       PIC X(180).
           05  PASSWORD-FLAG   PIC X.

       PROCEDURE DIVISION      USING PROGRAM-INFORMATION.
       CHECK-PASSWORD.
           MOVE "N"            TO PASSWORD-FLAG.
           MOVE 0              TO FIND-SW SHOW-SW FAIL-SW.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE "PASSWORD"     TO SCREEN-NAME.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            PROGRAM-TABLE.
           OPEN INPUT          PASSWORD-TABLE.

           MOVE SPACES         TO SCREEN-DATA.
           MOVE PROGRAM-NAME   TO PROG-ID-BUF ARG-KEY
                                  PWPROGID OF PROGRAM-TABLE.
           MOVE PROG-INFO      TO PROG-DESC.
           CALL "WHO"          USING MOD CAP LATTR
                               USERNAME GRPNAME ACCTNAME
                               HOMEGRP TERMNUM.
           MOVE USERNAME       TO USER-NAME-BUF.
           MOVE TERMNUM        TO TNUM.
           MOVE TNUM           TO USER-TERM-BUF.

       GET-PROGRAM-DATA.
           READ  PROGRAM-TABLE INTO PROGRAM-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               PERFORM WRITE-PROGRAM-DATA
           ELSE
               PERFORM UPDATE-PROGRAM-DATA.
           MOVE SPACES         TO PASSWORDS-TABLE.

       FIND-PASSWORD.
           MOVE 0              TO FIND-SW.
           MOVE ARG-KEY        TO PWPROGID OF PASSWORD-TABLE.
           START PASSWORD-TABLE KEY = PWPROGID OF PASSWORD-TABLE
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               IF FILE-STAT = "23"
                   IF FIND-SW = 0
                       MOVE "Y" TO PASSWORD-FLAG
                       GO TO END-CHECK
                   ELSE
                       GO TO END-CHECK
               ELSE
                   DISPLAY "START PASSWORD-TABLE ERROR:  " FILE-STAT
                   MOVE "Y"        TO PASSWORD-FLAG
                   GO TO END-CHECK.

       GET-PASSWORD.
           READ  PASSWORD-TABLE NEXT INTO PASSWORD-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               IF FILE-STAT = "10" OR "14" OR "46"
                   GO TO SORT-TABLE
               ELSE
               IF FIND-SW = 0
                   MOVE "Y"    TO PASSWORD-FLAG
                   GO TO END-CHECK
               ELSE
               IF FIND-SW = 1
                   GO TO END-CHECK.

           IF PROGRAM-NAME NOT = PROG-NAME-D
               GO TO SORT-TABLE
           ELSE
           PERFORM LOAD-TABLE
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 50
           GO TO GET-PASSWORD.

       LOAD-TABLE.
           IF PASS-TAB (SUB) = SPACES
               MOVE PASSWORD-DATA TO PASS-TAB (SUB)
               MOVE 50            TO SUB.

       SORT-TABLE.
           MOVE 0                 TO SUB.
           MOVE 1                 TO SUB1.
       ST-LOOP.
           ADD 1                  TO SUB.
           ADD 1                  TO SUB1.
           IF KEY-P (SUB1) = SPACES
               MOVE 0             TO SUB
               GO TO CHECK-USER.
           IF SUB1 > 50
               MOVE 0             TO SUB
               GO TO CHECK-USER.
           IF KEY-P (SUB1) < KEY-P (SUB) GO TO ST-LOOP.
           MOVE PASS-TAB (SUB1)   TO HOLD-PASSDATA.
           MOVE PASS-TAB (SUB)    TO PASS-TAB (SUB1).
           MOVE HOLD-PASSDATA     TO PASS-TAB (SUB).
           MOVE 0                 TO SUB.
           MOVE 1                 TO SUB1.
           GO TO ST-LOOP.

       CHECK-USER.
           ADD 1                  TO SUB.
           IF (SUB > 50) OR (PASS-TAB (SUB) = SPACES)
               IF FIND-SW = 0
                   MOVE "Y"       TO PASSWORD-FLAG
                   GO TO END-CHECK
               ELSE
               IF FIND-SW = 1
                   GO TO END-CHECK.
           IF USERNAME = USER-NAME-P (SUB)
               MOVE PASS-TAB (SUB) TO PASSWORD-DATA
               IF USER-TERM = SPACES
                   NEXT SENTENCE
               ELSE
               IF USER-TERM-9 = TNUM
                   NEXT SENTENCE
               ELSE
               GO TO CHECK-USER
           ELSE
           IF USER-NAME-P (SUB) = SPACES
               MOVE PASS-TAB (SUB) TO PASSWORD-DATA
               IF USER-TERM = SPACES
                   NEXT SENTENCE
               ELSE
               IF USER-TERM-9 = TNUM
                   NEXT SENTENCE
               ELSE
               GO TO CHECK-USER
           ELSE
           GO TO CHECK-USER.

           MOVE 1              TO FIND-SW.
           MOVE 0              TO SHOW-SW.
           MOVE "N"            TO PASSWORD-FLAG.

           MOVE "  ENTER PASSWORD:" TO ENT-PWORD.
           MOVE SPACES         TO INV-PWORD P-WORD NO-AUTH.

       SHOWFORM.
           ADD 1               TO SHOW-SW.
           MOVE SCREEN-DATA    TO PWORD-REC.
           WRITE PWORD-REC     FORMAT IS "PASSWORD"
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ/WRITE FAILURE: TPWORD,"
                       " ERROR:  " SCREEN-STATUS
               MOVE "Y"        TO PASSWORD-FLAG
               GO TO END-CHECK.

           READ  DISPLAY-FILE  FORMAT IS "PASSWORD"
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ/WRITE FAILURE: TPWORD,"
                       " ERROR:  " SCREEN-STATUS
               MOVE "Y"        TO PASSWORD-FLAG
               GO TO END-CHECK.

           MOVE PWORD-REC      TO SCREEN-DATA.

           IF KEY-HIT = 3
               GO TO END-CHECK.

           IF FAIL-SW = 1
               GO TO END-CHECK.

           IF KEY-HIT > 0 AND < 12
               GO TO SHOWFORM.

           IF P-WORD = "EMASES  "
               MOVE "Y"        TO PASSWORD-FLAG
               GO TO END-CHECK.

           IF PASS-WORD = P-WORD
               MOVE "Y"        TO PASSWORD-FLAG
               GO TO END-CHECK.

           IF SHOW-SW = 1
               MOVE "INVALID PASSWORD" TO INV-PWORD
               MOVE "REENTER PASSWORD:" TO ENT-PWORD
               MOVE SPACES     TO P-WORD
               GO TO SHOWFORM.

           IF SHOW-SW = 2
               MOVE SPACES     TO P-WORD
               GO TO SHOWFORM.

           IF SHOW-SW = 3
               MOVE SPACES     TO ERRMSG
               MOVE TRUE-VAL   TO IND(90)
               MOVE 1          TO FAIL-SW
               MOVE "N"        TO PASSWORD-FLAG
               MOVE SPACES     TO P-WORD
               GO TO SHOWFORM.

       WRITE-PROGRAM-DATA.
           ACCEPT CUR-DATE     FROM DATE.
           IF C-DATE-YY > 70
               MOVE 19         TO C-DATE-CC
           ELSE
               MOVE 20         TO C-DATE-CC.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE PROGRAM-NAME   TO PROG-NAME-M.
           MOVE P-TYPE         TO PROG-TYPE.
           MOVE P-RLSE         TO P-RELEASE.
           MOVE PROG-INFO      TO PROG-DESC.
           MOVE CUR-DATE-XX    TO DATE-PROG-INIT DATE-PROG-LAST-USED.
           MOVE TIME-HM        TO TIME-PROG-INIT TIME-PROG-LAST-USED.

           WRITE PR-REC        FROM PROGRAM-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE "Y"        TO PASSWORD-FLAG
               GO TO END-CHECK.

       UPDATE-PROGRAM-DATA.
           ACCEPT CUR-DATE     FROM DATE.
           IF C-DATE-YY > 70
               MOVE 19         TO C-DATE-CC
           ELSE
               MOVE 20         TO C-DATE-CC.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE CUR-DATE-XX    TO DATE-PROG-LAST-USED.
           MOVE TIME-HM        TO TIME-PROG-LAST-USED.
           IF P-RLSE NOT = P-RELEASE
               MOVE P-RLSE     TO P-RELEASE
               MOVE CUR-DATE-XX TO DATE-PROG-INIT
               MOVE TIME-HM    TO TIME-PROG-INIT.

           REWRITE PR-REC      FROM PROGRAM-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.

       END-CHECK.
           CLOSE               PROGRAM-TABLE.
           CLOSE               PASSWORD-TABLE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

