       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TPWUPDT.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE & RUBBER CO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PASSWORD-TABLE
                  ASSIGN TO DATABASE-MCFLPW0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZPWSEC-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PASSWORD-TABLE
           LABEL RECORDS ARE STANDARD.
       01  PA-REC.
           COPY DDS-ALL-FORMATS OF MCFLPW0201.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  HELP-SW               PIC 9(04) VALUE 0.
       77  FIND-SW               PIC 9     VALUE 0.
       77  RECNO                 PIC 9(08) VALUE 0.
       77  TRUE-VAL              PIC 1     VALUE B"1".
       77  NEG-VAL               PIC 1     VALUE B"0".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TPWUPDT ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "MA".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "PASSWORD MODIFY PROGRAM FOR THE MMIS PASSWORD SYSTEM.       ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "ALLOWS MODIFICATION OF PASSWORDS ON SPECIFIC PROGRAMS.      ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM THE f3 KEY OF THE MAINTENANCE PROGRAM MENU.       ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  SELECT-DATA.
           05  ARG-KEY         PIC X(08).
           05  SCREEN-MSGS.
               10  CMDMSGS     PIC X(79).
               10  ERRMSGS     PIC X(79).

       01  SCREEN-DATA.
           05  PROG-ID-BUF     PIC X(08).
           05  PASS-WORD-BUF   PIC X(08).
           05  USER-NAME-BUF   PIC X(08).
           05  USER-TERM-BUF   PIC X(04).
           05  SCREEN-MSG.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  PROGRAM-DATA.
           05  PROG-NAME-M                     PIC X(08).
           05  PROG-TYPE                       PIC X(02).
           05  DB-VERS                         PIC X(02).
           05  DB-RLSE                         PIC X(02).
           05  PROG-RLSE                       PIC X(04).
           05  PROG-COMP                       PIC X(04).
           05  PROG-DESC.
               10  PROG-DESC-1                 PIC X(60).
               10  PROG-DESC-2                 PIC X(60).
               10  PROG-DESC-3                 PIC X(60).
           05  DATE-PROG-INIT.
               10  DINIT-CC                    PIC XX.
               10  DINIT-YY                    PIC XX.
               10  DINIT-MM                    PIC XX.
               10  DINIT-DD                    PIC XX.
           05  TIME-PROG-INIT                  PIC X(04).
           05  DATE-PROG-LAST-USED.
               10  DLAST-CC                    PIC XX.
               10  DLAST-YY                    PIC XX.
               10  DLAST-MM                    PIC XX.
               10  DLAST-DD                    PIC XX.
           05  TIME-PROG-LAST-USED             PIC X(04).

       01  PASSWORD-DATA.
           05  PROG-NAME-D                     PIC X(08).
           05  USER-NAME                       PIC X(08).
           05  USER-TERM                       PIC X(04).
           05  PASS-WORD                       PIC X(08).

       01  USER-HOLD.
           05  UHOLD-1                         PIC X.
           05  UHOLD-2                         PIC X.
           05  UHOLD-3                         PIC X.
           05  UHOLD-4                         PIC X.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  MESSAGE-BUF-DATA.   COPY ERRORLIN IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO OPEN-FILES.
           GOBACK.

       OPEN-FILES.
           OPEN I-O            PASSWORD-TABLE.
           OPEN I-O            DISPLAY-FILE.

       BEGIN.
           MOVE "VPWCHNG1"     TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA
                                  MESSAGE-BUFFER
                                  SELECT-DATA.

       MASTER-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SELECT-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SELECT-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB
           ELSE
           IF KEY-HIT = 7
               MOVE 30         TO HELP-SW
               CALL "TPWHELP" USING HELP-SW
               GO TO MASTER-SHOWFORM
           ELSE
           IF KEY-HIT NOT = 0
               GO TO MASTER-SHOWFORM.

       MASTER-DBFIND.
           MOVE 0              TO FIND-SW.
           MOVE ARG-KEY        TO PWPROGID OF PASSWORD-TABLE.
           START PASSWORD-TABLE KEY = PWPROGID OF PASSWORD-TABLE.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT-1 = "2"
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
                   MOVE  40    TO CATREAD-MSG-SET
                   MOVE  15    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGS
                   MOVE TRUE-VAL TO IND(99)
                   GO TO MASTER-SHOWFORM
               ELSE
                   MOVE "START   " TO DB-FUNC
                   MOVE "PASSWORD-TABLE" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO ERRMSGS
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO MASTER-SHOWFORM.

       MASTER-DBGET.
           READ PASSWORD-TABLE NEXT INTO PASSWORD-DATA.
           IF FILE-STAT NOT = "00"
               IF FILE-STAT = "10" OR "14" OR "46"
                   IF FIND-SW = 0
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
                       MOVE  40        TO CATREAD-MSG-SET
                       MOVE  15        TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO ERRMSGS
                       MOVE TRUE-VAL   TO IND(99)
                       GO TO MASTER-SHOWFORM
                   ELSE
                       GO TO MASTER-DBFIND
               ELSE
                   MOVE "READ    " TO DB-FUNC
                   MOVE "PASSWORD-TABLE" TO DB-FILE
                   MOVE FILE-STAT  TO CON-WORD
                   MOVE DB-ERROR   TO ERRMSGS
                   MOVE TRUE-VAL   TO IND(99)
                   GO TO MASTER-SHOWFORM.

           IF PROG-NAME-D NOT = ARG-KEY
               IF FIND-SW = 0
      **********************************************************************
      **    MESSAGE 040/015:
      **  NO RECORDS FOUND
      **********************************************************************
                   MOVE  40    TO CATREAD-MSG-SET
                   MOVE  15    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSGS
                   MOVE TRUE-VAL TO IND(99)
                   GO TO MASTER-SHOWFORM
               ELSE
                   GO TO MASTER-DBFIND.

           MOVE 1              TO FIND-SW.
           MOVE "VPWCHNG2"     TO SCREEN-NAME.

       DISPLAY-RECORD.
           MOVE SPACES         TO SCREEN-DATA.
           MOVE ARG-KEY        TO PROG-ID-BUF.
           MOVE USER-NAME      TO USER-NAME-BUF.
           MOVE USER-TERM      TO USER-TERM-BUF.
           MOVE PASS-WORD      TO PASS-WORD-BUF.

       CHANGE-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE KEY-HIT        TO FUNC-KEY-NUM.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 2
               GO TO BEGIN.

           IF KEY-HIT = 5
               GO TO CHANGE-RECORD.

           IF KEY-HIT = 7
               MOVE 30         TO HELP-SW
               CALL "TPWHELP" USING HELP-SW
               GO TO CHANGE-SHOWFORM.

           IF KEY-HIT NOT = 0
               GO TO CHANGE-SHOWFORM.

           GO TO MASTER-DBGET.

       CHANGE-RECORD.
           IF PASS-WORD-BUF = SPACES
      **********************************************************************
      **    MESSAGE 035/105:
      **  INVALID ENTRY
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE 105        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2          TO FIELD-NUMBER
               PERFORM ERROR-ROUTINE
               GO TO CHANGE-SHOWFORM.

           IF USER-TERM-BUF NOT = SPACES
                MOVE USER-TERM-BUF TO USER-HOLD
                PERFORM USER-ADJUST
                MOVE USER-HOLD TO USER-TERM-BUF
                IF USER-TERM-BUF NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/105:
      **  INVALID ENTRY
      **********************************************************************
                    MOVE  35   TO CATREAD-MSG-SET
                    MOVE 105   TO CATREAD-MSG-NUM
                    PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                    MOVE 4     TO FIELD-NUMBER
                    PERFORM ERROR-ROUTINE
                    GO TO CHANGE-SHOWFORM.

       UPDATE-RECORD.
           MOVE ARG-KEY        TO PROG-NAME-D.
           MOVE PASS-WORD-BUF  TO PASS-WORD.
           MOVE USER-NAME-BUF  TO USER-NAME.
           MOVE USER-TERM-BUF  TO USER-TERM.

           REWRITE PA-REC      FROM PASSWORD-DATA.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PASSWORD-TABLE" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               PERFORM ERROR-ROUTINE
               GO TO CHANGE-SHOWFORM.

           GO TO MASTER-DBGET.

       USER-ADJUST.
           IF UHOLD-4 = SPACE
               PERFORM ZERO-FILL UNTIL UHOLD-4 NOT = SPACE.

           IF UHOLD-1 = SPACE MOVE "0" TO UHOLD-1.
           IF UHOLD-2 = SPACE MOVE "0" TO UHOLD-2.
           IF UHOLD-3 = SPACE MOVE "0" TO UHOLD-3.

       ZERO-FILL.
           MOVE UHOLD-3        TO UHOLD-4.
           MOVE UHOLD-2        TO UHOLD-3.
           MOVE UHOLD-1        TO UHOLD-2.
           MOVE "0"            TO UHOLD-1.

       ERROR-ROUTINE.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       END-OF-JOB.
           CLOSE               PASSWORD-TABLE.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

