000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TQ12INQ.
000400*REMARKS.    THIS IS THE EXECUTIVE PROGRAM FOR THE Q12 INQUIRY.
000500 ENVIRONMENT DIVISION.
000600 DATA DIVISION.
000700 WORKING-STORAGE SECTION.
       COPY CATREAD  OF COPYLIB.
001500 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
002600 01  PASSWORD-INFORMATION.
002700     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ12INQ ".
002800     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
002900     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003000     05  PROGRAM-DESCRIPTION.
003100         10  PROG-DESC-A.
                  15  FILLER       PIC X(11) VALUE " EXECUTIVE ".
                  15  FILLER       PIC X(16) VALUE "PROGRAM FOR Q12 ".
                  15  FILLER       PIC X(33) VALUE "INQUIRY ".
003300         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003500         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003700     05  PASSWORD-FLAG       PIC X.
       COPY VCOMLINK OF COPYLIB.
004400 PROCEDURE DIVISION.
004500 BEGIN-PROCESSING.
004600     PERFORM 1-HSK.
004700     PERFORM 6-MAIN.
004800 2-EOJ.
005500     GOBACK.
005600 1-HSK.
011600     CALL "TPWORD" USING PASSWORD-INFORMATION.
012000     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE LOW-VALUES TO VIEW-COMAREA.
012100 6-MAIN.
012200     CALL "CLQ12INQ" USING DBPARAMETERS VIEW-COMAREA
012300                       CATREAD-PARMS.
