       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TQ1INQ.
      ********************************************************************
      ***  NOTE:  EXECUTIVE VERSION OF W/O BACKLOG INQUIRY          ******
      ********************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CATREAD  OF COPYLIB.
       01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ1INQ  ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(14) VALUE " Q1 INQUIRY - ".
                   15  FILLER      PIC X(14) VALUE "DISPLAYS WORK ".
                   15  FILLER      PIC X(14) VALUE "ORDER BACKLOG ".
                   15  FILLER      PIC X(15) VALUE "INFORMATION BY ".
                   15  FILLER      PIC X(3)  VALUE "STA".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(16) VALUE "TUS FOR VERBAL, ".
                   15  FILLER      PIC X(12) VALUE "PLANNED, OR ".
                   15  FILLER      PIC X(17) VALUE "ENGINEERING W/O'S".
                   15  FILLER      PIC X(15) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.
       COPY VCOMLINK OF COPYLIB.
       PROCEDURE DIVISION.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           GOBACK.
       1-HSK.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE LOW-VALUES TO VIEW-COMAREA.
       6-MAIN.

           CALL "CLQ1INQ" USING DBPARAMETERS
                                VIEW-COMAREA
                                CATREAD-PARMS.
