       IDENTIFICATION DIVISION.
       PROGRAM-ID. NQ1SUB.
      *C---------------------------------------------------------------
      *C 02/25/93  JSB REQ #6306
      *C      ADDED "PR" AS A NEW WO STATUS FOR PRE-RELEASE.
      *C---------------------------------------------------------------
      *C SEPTEMBER 1996  JE COFFMAN  REQ# 6619
      *C      EXPANDED DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C---------------------------------------------------------------
      *C SEPTEMBER 1998  JE COFFMAN
      *C      INSTALLED LOGIC TO HANDLE A SHIFT "ROLLOVER"
      *C      (WHEN A SHIFT ROLLS OVER FROM ONE DAY TO THE
      *C      NEXT) FOR THE SHIFT SUMMARY ('SR') REQUESTS.
      *C         - BILL BUCKLER IN LAWTON MADE THE REQUEST
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT LABOR-CURR-STAT-FILE
               ASSIGN TO DATABASE-MCFLMM1602
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS LCSF-STATUS.
           SELECT OUT-FILE
               ASSIGN TO DATABASE-OUTFILQ1
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
           SELECT PRINT-FILE
               ASSIGN TO PRINTER-MCPRT.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
           SELECT WO-ZONE-PRTY-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
       FD  LABOR-CURR-STAT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS LCSFREC.
       01  LCSFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.
       FD  OUT-FILE
           RECORD CONTAINS 120 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS OUT-REC.
       01  OUT-REC.
           05  OUT-DATA.
               10  DEPT-OUT           PIC X(4).
               10  ZONE-OUT.
                   15  Z-OUT          PIC X(4).
                   15  P-OUT          PIC X.
                   15  FILLER         PIC X.
               10  SHIFT-OUT          PIC X.
               10  WOSTAT-OUT.
                   15  WOSTAT-O-1     PIC X.
                   15  WOSTAT-O-2     PIC X.
                   15  WOSTAT-O-34    PIC XX.
               10  WONUM-OUT.
                   15  WONO-OUT       PIC X(7).
                   15  WOSU-OUT       PIC X(3).
               10  WODESC-OUT         PIC X(30).
               10  EQNUM-OUT          PIC X(6).
               10  EQDOWN-OUT         PIC XX.
               10  DATE-RCVD.
                   15  DATE-RCVD-MM   PIC XX.
                   15  DATE-RCVD-DD   PIC XX.
                   15  DATE-RCVD-YY   PIC XX.
               10  TIME-RCVD          PIC XXXX.
               10  TIME-COMP-OUT      PIC XXXX.
               10  CRAFTSREQ-OUT.
                   15  C1-OUT         PIC XX.
                   15  C2-OUT         PIC XX.
                   15  C3-OUT         PIC XX.
               10  CMAN-1-OUT         PIC XXXX.
               10  CMAN-2-OUT         PIC XXXX.
               10  CMAN-3-OUT         PIC XXXX.
               10  TSTRT-OUT          PIC XXXX.
               10  TSTRT-OUT-9 REDEFINES TSTRT-OUT    PIC 9999.
               10  RETM-OUT           PIC XXXX.
               10  DTIM-OUT           PIC XXXX.
               10  SCHED-DATE-OUT.
                   15  SC-DATE-YY     PIC XX.
                   15  SC-DATE-MM     PIC XX.
                   15  SC-DATE-DD     PIC XX.
               10  SCHED-SHIFT-OUT    PIC X.
           05  FILLER                 PIC X(6).

       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                  PIC X(80).
       SD  SORT-FILE RECORD CONTAINS 114 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-DEPT              PIC X(4).
           05  SORT-ZONE.
               10  SORT-Z             PIC X(4).
               10  SORT-P             PIC X.
               10  FILLER             PIC X.
           05  SORT-SHIFT             PIC X.
           05  SORT-WOSTAT            PIC X(4).
           05  SORT-WONUM.
               10  SORT-WONO          PIC X(7).
               10  SORT-WOSU          PIC X(3).
           05  SORT-WODESC            PIC X(30).
           05  SORT-EQNUM.
               10  SORT-EQ1           PIC X.
               10  SORT-EQ2           PIC X.
               10  SORT-EQ3           PIC X.
               10  SORT-EQ4           PIC X.
               10  SORT-EQ5           PIC X.
               10  SORT-EQ6           PIC X.
           05  SORT-EQDOWN            PIC XX.
           05  SORT-DATE-RCVD.
               10  SORT-DATE-RCVD-MM  PIC XX.
               10  SORT-DATE-RCVD-DD  PIC XX.
               10  SORT-DATE-RCVD-YY  PIC XX.
           05  SORT-TIME-RCVD         PIC XXXX.
           05  TIME-COMP-SORT         PIC XXXX.
           05  SORT-CRAFTSREQ.
               10  SORT-C1            PIC XX.
               10  SORT-C2            PIC XX.
               10  SORT-C3            PIC XX.
           05  CMAN-1-SORT            PIC XXXX.
           05  CMAN-2-SORT            PIC XXXX.
           05  CMAN-3-SORT            PIC XXXX.
           05  TSTRT-SORT             PIC XXXX.
           05  RETM-SORT              PIC XXXX.
           05  DTIM-SORT              PIC XXXX.
           05  SCHED-DATE-SORT        PIC XXXXXX.
           05  SCHED-SHIFT-SORT       PIC X.

       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.

       FD  WO-ZONE-PRTY-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPFREC.
       01  WZPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
       WORKING-STORAGE SECTION.
       77  ADV-CTR                     PIC 9     VALUE 1.
       77  ALL-STAT-SW                 PIC 9     VALUE 0.
           88  ALL-STAT-SW-NOT-ON                VALUE 0.
           88  ALL-STAT-SW-ON                    VALUE 1.
       77  CD-STAT-SW                  PIC 9     VALUE 0.
           88  CD-STAT-SW-ON                     VALUE 1.
       77  CRAFT-HOLD                  PIC XX.
       77  EOF-SW                      PIC 9     VALUE 0.
       77  FIELD-CTR                   PIC 99    VALUE 0.
       77  H-STAT-SW                   PIC 9     VALUE 0.
           88  H-STAT-SW-ON                      VALUE 1.
       77  HSUB                        PIC 99    VALUE 0.
       77  MAX                         PIC 99    VALUE 0.
       77  NEW-STAT-SW                 PIC 9     VALUE 0.
       77  OIEND                       PIC 99    VALUE 0.
       77  OISUB                       PIC 99    VALUE 0.
       77  OI-STAT-SW                  PIC 9     VALUE 0.
           88  OI-STAT-SW-ON                     VALUE 1.
       77  P-SAVE                      PIC X     VALUE SPACE.
       77  PART-STAT-SW                PIC 9     VALUE 0.
           88  PART-STAT-SW-ON                   VALUE 1.
       77  PRIORITY-TAG                PIC X.
       77  PRTY-CTR                    PIC 99999 VALUE 0.
       77  RELEASE-FLAG                PIC 9     VALUE 0.
           88  RELEASE-FLAG-UP                   VALUE 1.
       77  SCREEN-FLAG                 PIC 9     VALUE 0.
       77  SD-DATE-HOLD                PIC X(06) VALUE SPACES.
       77  SLCT                        PIC 9     VALUE 0.
       77  SUB                         PIC 99    VALUE 0.
       77  SUBT                        PIC 99    VALUE 0.
       77  SUBTT                       PIC 99    VALUE 0.
       77  SUMM-SW                     PIC 9     VALUE 0.
           88  SUMM-SW-ON                        VALUE 1.
       77  STAT-SAVE     VALUE SPACES  PIC X(4).
       77  ZONE-HOLD     VALUE SPACES  PIC X(04).

       01  ACT-KEY                     PIC 9(9).
       01  ALL-RECORDS-WRITTEN-SW      PIC X    VALUE SPACE.
       01  ARG-NO                      PIC 9(9).

       01  CATREAD-BUFFER.
           05  CAT-TEXT-1              PIC X(08).
           05  STAT-CD                 PIC X(02).
           05  CAT-TEXT-2              PIC X(58).
       01  COUNTERS.
           05  PRTY1-K                 PIC 9(4).
           05  PRTY2-K                 PIC 9(4).
           05  PRTY3-K                 PIC 9(4).
           05  PRTY4-K                 PIC 9(4).
           05  PRTY5-K                 PIC 9(4).
           05  PRTY6-K                 PIC 9(4).
           05  LINE-K                  PIC S99.
       01  COUNTERS-SAVE.
           05  PCW.
               10  P1CW                PIC 9(4).
               10  P2CW                PIC 9(4).
               10  P3CW                PIC 9(4).
               10  P4CW                PIC 9(4).
               10  P5CW                PIC 9(4).
               10  P6CW                PIC 9(4).
               10  FILLER              PIC S99.
           05  PDW.
               10  P1DW                PIC 9(4).
               10  P2DW                PIC 9(4).
               10  P3DW                PIC 9(4).
               10  P4DW                PIC 9(4).
               10  P5DW                PIC 9(4).
               10  P6DW                PIC 9(4).
               10  FILLER              PIC S99.
           05  PHA.
               10  P1HA                PIC 9(4).
               10  P2HA                PIC 9(4).
               10  P3HA                PIC 9(4).
               10  P4HA                PIC 9(4).
               10  P5HA                PIC 9(4).
               10  P6HA                PIC 9(4).
               10  FILLER              PIC S99.
           05  PHM.
               10  P1HM                PIC 9(4).
               10  P2HM                PIC 9(4).
               10  P3HM                PIC 9(4).
               10  P4HM                PIC 9(4).
               10  P5HM                PIC 9(4).
               10  P6HM                PIC 9(4).
               10  FILLER              PIC S99.
           05  PHS.
               10  P1HS                PIC 9(4).
               10  P2HS                PIC 9(4).
               10  P3HS                PIC 9(4).
               10  P4HS                PIC 9(4).
               10  P5HS                PIC 9(4).
               10  P6HS                PIC 9(4).
               10  FILLER              PIC S99.
           05  PIP.
               10  P1IP                PIC 9(4).
               10  P2IP                PIC 9(4).
               10  P3IP                PIC 9(4).
               10  P4IP                PIC 9(4).
               10  P5IP                PIC 9(4).
               10  P6IP                PIC 9(4).
               10  FILLER              PIC S99.
           05  POO.
               10  P1OO                PIC 9(4).
               10  P2OO                PIC 9(4).
               10  P3OO                PIC 9(4).
               10  P4OO                PIC 9(4).
               10  P5OO                PIC 9(4).
               10  P6OO                PIC 9(4).
               10  FILLER              PIC S99.
           05  PSD.
               10  P1SD                PIC 9(4).
               10  P2SD                PIC 9(4).
               10  P3SD                PIC 9(4).
               10  P4SD                PIC 9(4).
               10  P5SD                PIC 9(4).
               10  P6SD                PIC 9(4).
               10  FILLER              PIC S99.
           05  PSW.
               10  P1SW                PIC 9(4).
               10  P2SW                PIC 9(4).
               10  P3SW                PIC 9(4).
               10  P4SW                PIC 9(4).
               10  P5SW                PIC 9(4).
               10  P6SW                PIC 9(4).
               10  FILLER              PIC S99.
           05  PPR.
               10  P1PR                PIC 9(4).
               10  P2PR                PIC 9(4).
               10  P3PR                PIC 9(4).
               10  P4PR                PIC 9(4).
               10  P5PR                PIC 9(4).
               10  P6PR                PIC 9(4).
               10  FILLER              PIC S99.
       01  COUNTER-ARRAY REDEFINES COUNTERS-SAVE.
           05  COUNTER-TABLE OCCURS 11 TIMES  PIC X(26).

       COPY CPYIND  IN COPYLIB.

       01  CURDATE-BUFFER.
           05  YY-BUFFER               PIC XX.
           05  MM-BUFFER               PIC XX.
           05  DD-BUFFER               PIC XX.

       COPY TDATESUB OF COPYLIB.

       01  DATE-TEMP.
           05  DT-YY                   PIC XX.
           05  DT-MM                   PIC XX.
           05  DT-DD                   PIC XX.

       01  DATE-TIME-HOLD.
           05  DATE-HOLD.
               10  DHOLD-MM            PIC 99.
               10  DHOLD-DD            PIC 99.
               10  DHOLD-YY            PIC 99.
           05  TIME-HOLD               PIC X(4).

       01  DATE-WA.
           05  DATE-WA-YY              PIC XX.
           05  DATE-WA-YY-9 REDEFINES DATE-WA-YY  PIC 99.
           05  DATE-WA-MM              PIC XX.
           05  DATE-WA-MM-9 REDEFINES DATE-WA-MM  PIC 99.
           05  DATE-WA-DD              PIC XX.
           05  DATE-WA-DD-9 REDEFINES DATE-WA-DD  PIC 99.

       01  DATE-WA-2.
           05  DATE-WA-YY-2            PIC 99.
           05  DATE-WA-MM-2            PIC 99.
           05  DATE-WA-DD-2            PIC 99.

       01  DATE-TIME-WA-SAV1.
           05  DATE-WA-SAV1            PIC 999999.
           05  TIME-WA-SAV1            PIC X(4).

       01  DATE-TIME-WA-SAV2.
           05  DATE-WA-SAV2            PIC 999999.
           05  TIME-WA-SAV2            PIC X(4).

       01  DATE-TIME-WA-SAV3.
           05  DATE-WA-SAV3            PIC 999999.
           05  TIME-WA-SAV3            PIC X(4).

       01  DATE-TIME-WA-SAV4.
           05  DATE-WA-SAV4            PIC 999999.
           05  TIME-WA-SAV4            PIC X(4).

      *01  DATE-WA-SAV1                PIC 999999.
      *01  DATE-WA-SAV2                PIC 999999.

       01  DAY-DIGIT                   PIC X.

       01  DETAIL-REC.
           05  DETAIL-PREFIX.
               10  WONUM-7             PIC X(7).
               10  FILLER              PIC X  VALUE "-".
               10  WONUM-3             PIC X(3).
               10  FILLER              PIC XX VALUE SPACES.
               10  EQNUM               PIC X(6).
               10  DN-DT-1.
                   15  FILLER          PIC XX VALUE SPACES.
                   15  EQDOWN          PIC XX.
                   15  FILLER          PIC XX VALUE SPACE.
               10  DN-DT-2 REDEFINES DN-DT-1.
                   15  FILLER          PIC X.
                   15  EQDTIM          PIC XXXX.
                   15  FILLER          PIC X.
               10  WODESC              PIC X(25).
           05  DREC-OO.
               10  FILLER              PIC XXX.
               10  DRCV-OO             PIC X(6).
               10  FILLER              PIC XXX.
               10  TRCV-OO             PIC Z(4).
               10  FILLER              PIC XXX.
               10  CRAFTSREQ-1-OO      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-2-OO      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-3-OO      PIC XX.
               10  FILLER              PIC XXX.
           05  DREC-IP REDEFINES DREC-OO.
               10  FILLER              PIC XXX.
               10  CCNUM-IP            PIC XXXX.
               10  FILLER              PIC XXX.
               10  TSTR-IP             PIC Z(4).
               10  FILLER              PIC XXX.
               10  CRAFTSREQ-1-IP      PIC XX.
               10  FILLER              PIC X(11).
           05  DREC-CD REDEFINES DREC-OO.
               10  FILLER              PIC XX.
               10  WOTM-CD-D           PIC X(4).
               10  WOTM-CD REDEFINES WOTM-CD-D
                                       PIC ZZZZ.
               10  FILLER              PIC XX.
               10  RETM-CD             PIC XXXX.
               10  FILLER              PIC XX.
               10  CNTM-CD             PIC Z(4).
               10  FILLER              PIC XX.
               10  CCNUM-CD            PIC XXXX.
               10  FILLER              PIC XX.
               10  CRAFTSREQ-1-CD      PIC XX.
               10  FILLER              PIC XX.
           05  DREC-H REDEFINES DREC-OO.
               10  FILLER              PIC XXX.
               10  CCNUM-H             PIC XXXX.
               10  FILLER              PIC XXX.
               10  STTM-H              PIC Z(4).
      *        10  STTM-H              PIC Z(4).
               10  FILLER              PIC XXX.
               10  STDT-H              PIC Z(4).
               10  FILLER              PIC XXX.
               10  RETM-H              PIC Z(4).
               10  FILLER              PIC XX.
           05  DREC-SD REDEFINES DREC-OO.
               10  FILLER              PIC XXXX.
               10  SCHED-DATE-SD.
                   15  SD-SCHED-MM     PIC XX.
                   15  SD-SCHED-DD     PIC XX.
                   15  SD-SCHED-YY     PIC XX.
               10  SD-SLASH            PIC X.
               10  SCHED-SHIFT-SD      PIC X.
               10  FILLER              PIC X(07).
               10  CRAFTSREQ-1-SD      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-2-SD      PIC XX.
               10  FILLER              PIC X.
               10  CRAFTSREQ-3-SD      PIC XX.
               10  FILLER              PIC X(03).

       01  ERROR-BUFFER                PIC X(80).

       01  FIELD-HOLD                  PIC X(79).

       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  LCSF-STATUS             PIC XX.
           05  OF-STATUS               PIC XX.
           05  PF-STATUS               PIC XX.
           05  WBF-STATUS              PIC XX.
           05  WCRF-STATUS             PIC XX.
           05  WLF-STATUS              PIC XX.
           05  WLNU-STATUS             PIC XX.
           05  WPF-STATUS              PIC XX.
           05  WZPF-STATUS             PIC XX.

       01  FILL-SCREEN.
           05  FIELD-1                 PIC X(78).
           05  FIELD-2                 PIC X(79).
           05  FIELD-3                 PIC X(79).
           05  FIELD-4                 PIC X(79).
           05  FIELD-5                 PIC X(79).
           05  FIELD-6                 PIC X(79).
           05  FIELD-7                 PIC X(79).
           05  FIELD-8                 PIC X(79).
           05  FIELD-9                 PIC X(79).
           05  FIELD-10                PIC X(79).
           05  FIELD-11                PIC X(79).
           05  FIELD-12                PIC X(79).
           05  FIELD-13                PIC X(79).
           05  FIELD-14                PIC X(79).
           05  FIELD-15                PIC X(79).
           05  FIELD-16                PIC X(79).
           05  FIELD-17                PIC X(79).
           05  FIELD-18                PIC X(79).
           05  FIELD-19                PIC X(79).
           05  FIELD-20                PIC X(79).
           05  FIELD-21                PIC X(79).
           05  FIELD-22                PIC X(79).
           05  FIELD-23                PIC X(79).
           05  FILL-CMD-LINE           PIC X(79).
           05  FILL-MSG-LINE           PIC X(79).

       01  FST-TIME-SW                 PIC 9.

       01  GREG-DATE.
           05  GREG-CC                 PIC XX.
           05  GREG-YMD.
               10  GREG-YY             PIC XX.
               10  GREG-MM             PIC XX.
               10  GREG-DD             PIC XX.

       01  HEADING-DT-TM.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "PRINT DATE:  ".
           05  P-DATE  PIC X(08).
           05  FILLER  PIC X(15) VALUE "        TIME:  ".
           05  P-TIME  PIC X(04).
           05  FILLER  PIC X(20) VALUE SPACES.

       01  HEADING-1-H.
           05  FILLER      PIC X(12) VALUE " W/O STATUS-".
           05  WOSTAT-1-H  PIC X(04).
           05  FILLER      PIC X(13) VALUE "  MAINT ZONE-".
           05  MZ-1-H      PIC X(04).
           05  FILLER      PIC X(07) VALUE "  DEPT-".
           05  DEPT-1-H    PIC X(04).
           05  FILLER      PIC X(08) VALUE "  SHIFT-".
           05  SHIFT-1-H   PIC X(01).
           05  FILLER      PIC X(07) VALUE "  DATE-".
           05  DATE-1-H    PIC X(08).
           05  FILLER      PIC X(01) VALUE SPACE.
           05  HWO-TYPE    PIC X(10) VALUE "          ".

       01  HEADING-2-COMP.
           05  HEADING-2             PIC X(79).

       01  HEADING-2-OO.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(16) VALUE "   DRCV     TRCV".
           05  FILLER            PIC X(13) VALUE "   CRFT REQ  ".

       01  HEADING-2-IP.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(17) VALUE "   CC #   TSTR   ".
           05  FILLER            PIC X(12) VALUE "CRFT IP     ".

       01  HEADING-2-CWDW.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(18) VALUE "  WOTM  RETM  CWTM".
           05  FILLER            PIC X(11) VALUE " CC #  CRFT".

       01  HEADING-2-HSTAT.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DN  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(10) VALUE SPACES.
           05  FILLER            PIC X(14) VALUE "   CC #   STTM".
           05  FILLER            PIC X(15) VALUE "   STDT        ".

       01  HEADING-2-SD.
           05  FILLER            PIC X(13) VALUE "W/O NUM      ".
           05  FILLER            PIC X(12) VALUE "EQ NUM  DT  ".
           05  FILLER            PIC X(15) VALUE "W/O DESCRIPTION".
           05  FILLER            PIC X(12) VALUE SPACES.
           05  FILLER            PIC X(12) VALUE "DT-SFT SCHED".
           05  FILLER            PIC X(15) VALUE "   CRAFTS REQD.".

       01  HEADING-DOTS.
           05 FILLER  PIC X(79) VALUE ALL "-".

       01  HOLD-BUFFER                 PIC X(90).

       COPY IOFEEDBACK IN COPYLIB.

       COPY JCWAREA    IN COPYLIB.

       01  JULIAN-DATE                      PIC X(7).
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).
       01  JUL-DAY-COMP                     PIC 9(7).
       01  JUL-DAYS-LYR                     PIC 9(7).
       01  JUL-DAY-RECD                     PIC 9(7).
       01  JUL-DAY-SAVE                     PIC 9(7).
       01  JUL-DAY-STRT                     PIC 9(7).

       01  LABOR-BUFFER.
           05  L-CC-BUF                PIC XXXX.
           05  L-CRFT-BUF              PIC XX.
           05  L-TSTRT-BUF             PIC 9999.
           05  L-TCOMP-BUF             PIC 9999.
           05  L-RETM-BUF.
                10  L-RETM-12.
                    15  L-RETM-1       PIC X.
                    15  L-RETM-2       PIC X.
                10  L-RETM-DEC         PIC X.
                10  L-RETM-4           PIC X.

       01  LABOR-CURR-STAT-BUFF. COPY DCURRLBR OF COPYLIB.

       01  LABOR-TAB.
           05  LABOR-TABLE OCCURS 10 TIMES PIC X(18).

       01  LAST-WO-USED-DATA.    COPY MLASTWO OF COPYLIB.

       01  LEAP-YEAR-FLAG        PIC X.

       01  LITERAL-1-L.
           05  FILLER            PIC X(09) VALUE "PRIORITY:".
           05  PRTY-1-L          PIC X(01).
           05  FILLER            PIC X(15) VALUE " ***TOTAL WORK ".
           05  FILLER            PIC X(09) VALUE "ORDERS = ".
           05  NUM-1-L           PIC ZZZ9.
           05  FILLER            PIC X(41) VALUE SPACES.

       COPY OVRPFDATA IN COPYLIB.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "NQ1SUB  ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(14) VALUE " Q1 INQUIRY - ".
                   15  FILLER      PIC X(14) VALUE "DISPLAYS WORK ".
                   15  FILLER      PIC X(14) VALUE "ORDER BACKLOG ".
                   15  FILLER      PIC X(15) VALUE "INFORMATION BY ".
                   15  FILLER      PIC X(3)  VALUE "STA".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(16) VALUE "TUS FOR VERBAL, ".
                   15  FILLER      PIC X(12) VALUE "PLANNED, OR ".
                   15  FILLER      PIC X(17) VALUE "ENGINEERING W/O'S".
                   15  FILLER      PIC X(15) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  PE-SUMMARY-COL-HD.
           05  FILLER  PIC X(19) VALUE "PRIORITY CW      HA".
           05  FILLER  PIC X(20) VALUE "      HM      HS    ".
           05  FILLER  PIC X(20) VALUE "  IP     OO     SD  ".
           05  FILLER  PIC X(20) VALUE "   SW     PR   TOTAL".

       01  PER-PERSONNEL-DATA.   COPY MPERSONL OF COPYLIB.

       01  RECORDS-PROCESSED-SW        PIC X    VALUE SPACE.

       01  RECS-WRITTEN-CTR            PIC 9(5).

       01  RETURN-CODE-2.
           05  RET-CODE-2              PIC XX VALUE SPACES.

       01  SCREEN2-BUFFER.
           05  WOSTAT-BUF              PIC XX.
           05  WO-TYPE                 PIC X(10).
           05  ZONE-BUF.
               10  Z-BUF-1             PIC X.
               10  Z-BUF-2             PIC X.
               10  FILLER              PIC XX.
           05  CRAFT-BUF               PIC XX.
           05  DATE-BUF.
               10  DATE-BUF-MM         PIC XX.
               10  DATE-BUF-DD         PIC XX.
               10  DATE-BUF-YY         PIC XX.
           05  SHIFT-BUF               PIC X.
           05  DATE-DISPLAY            PIC X(06).
           05  EQNUM-BUF.
               10  EQ1                 PIC X.
               10  EQ2                 PIC X.
               10  EQ3                 PIC X.
               10  EQ4                 PIC X.
               10  EQ5                 PIC X.
               10  EQ6                 PIC X.
           05  PRIORITY-BUF            PIC X.
           05  DEPT-BUF                PIC X(4).
           05  EQDN-BUF                PIC X.
           05  PRINT-BUF               PIC X.
           05  SCREEN2-CMD-LINE        PIC X(79).
           05  SCREEN2-MSG-LINE        PIC X(79).

       01  SELECT-BUFFER.
           05  V-BUF                   PIC X.
           05  P-BUF                   PIC X.
           05  E-BUF                   PIC X.
           05  SELECT-CMD-LINE         PIC X(79).
           05  SELECT-MSG-LINE         PIC X(79).

       01  SELECT-BUFFER-HOLD.
           05  VPE-BUF                 PIC X.

       01  SHIFT-DATA.
           05  LINK-ZONE               PIC X(04).
           05  TIME-IN                 PIC X(4).
           05  CODE-BUF                PIC X.
           05  SHIFTS.
               10  S-1                 PIC 9999.
               10  E-1                 PIC 9999.
               10  S-2                 PIC 9999.
               10  E-2                 PIC 9999.
               10  S-3                 PIC 9999.
               10  E-3                 PIC 9999.
               10  S-4                 PIC 9999.
               10  E-4                 PIC 9999.
           05  CURR-SHIFT              PIC 9.

       COPY DBSTAT OF COPYLIB.

       01  STATUS-TABLE.
           02  VERB-STAB.
               03  FILLER              PIC XX VALUE "CW".
               03  FILLER              PIC XX VALUE "DW".
               03  FILLER              PIC XX VALUE "HL".
               03  FILLER              PIC XX VALUE "HM".
               03  FILLER              PIC XX VALUE "IP".
               03  FILLER              PIC XX VALUE "OO".
               03  FILLER              PIC XX VALUE "  ".
               03  FILLER              PIC XX VALUE "  ".
               03  FILLER              PIC XX VALUE "  ".
               03  FILLER              PIC XX VALUE "  ".
               03  FILLER              PIC XX VALUE "  ".
           02  PE-STAB.
               03  FILLER              PIC XX VALUE "CW".
               03  FILLER              PIC XX VALUE "DW".
               03  FILLER              PIC XX VALUE "HA".
               03  FILLER              PIC XX VALUE "HM".
               03  FILLER              PIC XX VALUE "HS".
               03  FILLER              PIC XX VALUE "IP".
               03  FILLER              PIC XX VALUE "OO".
               03  FILLER              PIC XX VALUE "PR".
               03  FILLER              PIC XX VALUE "SD".
               03  FILLER              PIC XX VALUE "SW".
               03  FILLER              PIC XX VALUE "  ".

       01  STAT-TABLE.
           05  TABLE-STAT OCCURS 11 TIMES  PIC XX.

       01  SUMMARY-COL-HD              PIC X(79).

       01  SUMMARY-DETAIL              PIC X(79).

       01  SUMM-DET.
           05  SUMM-DET-PE.
               10  DET-BRK.
                   15  FILLER  PIC X(02) VALUE SPACES.
                   15  PRT-DET PIC X(01) VALUE SPACE.
                   15  FILLER  PIC X(02) VALUE SPACES.
               10  DET-HDR REDEFINES DET-BRK PIC X(05).
               10  FILLER  PIC X(02) VALUE SPACES.
               10  CW-DET  PIC ZZZ9.
               10  FILLER  PIC X(04) VALUE "    ".
               10  HA-DET  PIC ZZZ9.
               10  FILLER  PIC X(04) VALUE "    ".
               10  HM-DET  PIC ZZZ9.
               10  FILLER  PIC X(04) VALUE "    ".
               10  HS-DET  PIC ZZZ9.
               10  FILLER  PIC X(04) VALUE "    ".
               10  IP-DET  PIC ZZZ9.
               10  FILLER  PIC X(03) VALUE "   ".
               10  OO-DET  PIC ZZZ9.
               10  FILLER  PIC X(03) VALUE "   ".
               10  SD-DET  PIC ZZZ9.
               10  FILLER  PIC X(03) VALUE "   ".
               10  SW-DET  PIC ZZZ9.
               10  FILLER  PIC X(03) VALUE "   ".
               10  PR-DET  PIC ZZZ9.
               10  FILLER  PIC X(02) VALUE "  ".
               10  TOT-DET PIC ZZZZZ9.
           05  SUMM-DET-V REDEFINES SUMM-DET-PE.
               10  FILLER  PIC X(07).
               10  CW-DEV  PIC ZZZ9.
               10  FILLER  PIC X(04).
               10  HA-DEV  PIC ZZZ9.
               10  FILLER  PIC X(04).
               10  HM-DEV  PIC ZZZ9.
               10  FILLER  PIC X(04).
               10  HS-DEV  PIC X(04).
               10  FILLER  PIC X(04).
               10  IP-DEV  PIC ZZZ9.
               10  FILLER  PIC X(03).
               10  OO-DEV  PIC ZZZ9.
               10  FILLER  PIC X(03).
               10  SD-DEV  PIC X(04).
               10  FILLER  PIC X(03).
               10  SW-DEV  PIC X(04).
               10  FILLER  PIC X(03).
               10  PR-DEV  PIC X(04).
               10  FILLER  PIC X(02).
               10  TOT-DEV PIC ZZZZZ9.

       01  SUMMARY-DT-TM.
           05  FILLER  PIC X(13) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "DATE:  ".
           05  SM-DATE PIC X(08) VALUE SPACES.
           05  FILLER  PIC X(06) VALUE SPACES.
           05  PS-TYPE PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(07) VALUE "TIME:  ".
           05  SM-TIME PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE SPACES.

       01  SUMMARY-SEL1.
           05  FILLER      PIC X(17) VALUE "      COUNTS ARE ".
           05  FILLER      PIC X(04) VALUE "FOR:".
           05  FILLER      PIC X(10) VALUE "    PRTY: ".
           05  PRTY-SUMM   PIC X(01).
           05  FILLER      PIC X(10) VALUE "    ZONE: ".
           05  ZONE-SUMM   PIC X(04).
           05  FILLER      PIC X(10) VALUE "    DEPT: ".
           05  DEPT-SUMM   PIC X(04).
           05  FILLER      PIC X(11) VALUE "    CRAFT: ".
           05  CRAFT-SUMM  PIC X(02).
           05  FILLER      PIC X(06) VALUE SPACES.

       01  SUMMARY-SEL2.
           05  FILLER      PIC X(19) VALUE "        EQUIP-NUM: ".
           05  EQNUM-SUMM  PIC X(06).
           05  FILLER      PIC X(16) VALUE "    EQUIP-DOWN: ".
           05  EQDN-SUMM   PIC X(01).
           05  FILLER      PIC X(10) VALUE "    DATE: ".
           05  DATE-SUMM   PIC X(06).
           05  FILLER      PIC X(11) VALUE "    SHIFT: ".
           05  SHIFT-SUMM  PIC X(01).
           05  FILLER      PIC X(09) VALUE SPACES.

       01  SUMMARY-TITLE.
           05  FILLER  PIC X(18) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE "T O T A L   W O R K ".
           05  FILLER  PIC X(21) VALUE "O R D E R   C O U N T".
           05  FILLER  PIC X(20) VALUE SPACES.

       01  TCOMP-MIN                   PIC S9(4) VALUE 0.
       01  TIME-BUFFER.
           05  CUR-TIME                PIC X(4).
           05  FILLER                  PIC XX.
       01  TOTAL-PRTYS.
           05  FIRST-TOT    PIC 9999.
           05  SECND-TOT    PIC 9999.
           05  THIRD-TOT    PIC 9999.
           05  FORTH-TOT    PIC 9999.
           05  FIFTH-TOT    PIC 9999.
           05  SIXTH-TOT    PIC 9999.
           05  SEVTH-TOT    PIC 9999.
           05  EIGTH-TOT    PIC 9999.
           05  NINTH-TOT    PIC 9999.
           05  TOTAL-TOT    PIC 999999.
           05  TOT-DET-9    PIC 999999.
       01  TRECD-MIN                   PIC S9(4) VALUE 0.
       01  TRUE-VAL                    PIC 1 VALUE B"1".
       01  TSAVE-MIN                   PIC S9(4) VALUE 0.
       01  TSTRT-MIN                   PIC S9(4) VALUE 0.

       01  V-SUMMARY-COL-HD.
           05  FILLER  PIC X(19) VALUE "PRIORITY CW      HL".
           05  FILLER  PIC X(20) VALUE "      HM            ".
           05  FILLER  PIC X(20) VALUE "  IP     OO         ".
           05  FILLER  PIC X(20) VALUE "               TOTAL".

       01  VPE-MESSAGE.
           05  FILLER  PIC X(40) VALUE SPACES.
           05  SM-TYPE PIC X(10) VALUE "          ".
           05  FILLER  PIC X(29) VALUE SPACES.

       01  WO-TIME                     PIC 9999  VALUE 0.
       01  WO-TIM-TOT.
           05  WOTIME                  PIC 999V9 VALUE 0.
           05  WOTIM REDEFINES WOTIME.
               10  WOT-TRUNC           PIC 9.
               10  WOT-HR              PIC 99.
               10  WOT-HR-X REDEFINES WOT-HR  PIC XX.
               10  WOT-MIN             PIC 9.
       01  WO-TOT.
           05  WO-HR.
               10  WO-HR-1             PIC X.
               10  WO-HR-2             PIC X.
           05  WO-DEC                  PIC X VALUE ".".
           05  WO-MIN                  PIC X.

       01  WONUM-SAVE                  PIC X(10) VALUE SPACES.

       01  WORK-ARGUMENTS.
           05  ARGUMENT-DEFN.
               10  ARG12               PIC XX.
               10  ARG34.
                   15  ARG3            PIC X.
                   15  ARG4            PIC X.
           05  ARG-DEFN                PIC X(10).
           05  ARG-DEFN-3              PIC X(04).
           05  FILLER                  PIC X.

       01  WO-BASIC-DATA.        COPY DWOBASIC OF COPYLIB.
       01  WO-PLANNED-DATA.      COPY DWOPLAN OF COPYLIB.
       01  WO-LABOR-DATA.        COPY DWOLABOR OF COPYLIB.

       COPY WSCONTROL IN COPYLIB.

       01  ZONE-ARGUMENT.
           05  Z-ARG-4                 PIC X(4).
           05  FILLER                  PIC XX VALUE "1 ".

       01  ZONE-BUFFERS.
           05  ZONE-BUF1               PIC XXXX.
           05  ZONE-BUF2               PIC XXXX.
           05  ZONE-BUF3               PIC XXXX.
           05  ZONE-BUF4               PIC XXXX.

       LINKAGE SECTION.
       01  DBPARAMETERS.         COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
       PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
                            CATREAD-PARMS.
       BEGIN-PROCESSING.
           PERFORM 1-HSK.
       BP-MAIN.
           PERFORM 6-MAIN.
       2-EOJ.
           IF PRINT-BUF = "P"
               MOVE " " TO PRINT-BUF
               CLOSE PRINT-FILE.
           IF VIEW-LASTKEY = 1 MOVE 2 TO VIEW-LASTKEY.
           IF VIEW-LASTKEY = 2
               CLOSE OUT-FILE
               GO TO BP-MAIN.
           CLOSE OUT-FILE.
           CLOSE DISPLAY-FILE.
           CLOSE LABOR-CURR-STAT-FILE.
           CLOSE PERSONNEL-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-CRAFTS-REQD-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           CLOSE WO-ZONE-PRTY-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT LABOR-CURR-STAT-FILE.
           OPEN INPUT PERSONNEL-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
           OPEN INPUT WO-LABOR-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PLANNED-FILE.
           OPEN INPUT WO-ZONE-PRTY-FILE.
           MOVE 0 TO DATE-MODE VIEW-LASTKEY.
           MOVE 0 TO COND-WORD.
           MOVE 0 TO FST-TIME-SW.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           ACCEPT CURDATE-BUFFER FROM DATE.
           MOVE CURDATE-BUFFER TO DATE-TEMP.
           MOVE DT-MM TO DHOLD-MM.
           MOVE DT-DD TO DHOLD-DD.
           MOVE DT-YY TO DHOLD-YY.
           MOVE DATE-HOLD TO DATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT TO DATE-HOLD.
           MOVE DHOLD-MM TO DT-MM.
           MOVE DHOLD-DD TO DT-DD.
           MOVE DHOLD-YY TO DT-YY.
           MOVE DATE-TEMP TO SM-DATE P-DATE.
       6-MAIN.
           MOVE SPACES TO SCREEN2-BUFFER.
           MOVE 0 TO RECS-WRITTEN-CTR.
           ADD 1 TO FST-TIME-SW.
           IF VIEW-LASTKEY = 2
               NEXT SENTENCE
           ELSE
           PERFORM 60-MAKE-SELECTION THRU 60-MS-EXIT.
           PERFORM 61-WRITE-SCREEN THRU 61-WS-EXIT.
           PERFORM 62-SORT-INPUT THRU 62-SI-EXIT.
           PERFORM 63-DISPLAY-OUTPUT.

       60-MAKE-SELECTION.
           MOVE SPACES TO SELECT-BUFFER.
           MOVE "FQ1SEL1" TO VIEW-CFNAME.
           MOVE SELECT-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO SELECT-BUFFER.
           MOVE 0 TO SLCT EOF-SW.

           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           IF SELECT-BUFFER = SPACES
               MOVE 41025 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 60-MAKE-SELECTION.
           IF V-BUF NOT = SPACE ADD 1 TO SLCT.
           IF P-BUF NOT = SPACE ADD 1 TO SLCT.
           IF E-BUF NOT = SPACE ADD 1 TO SLCT.
           IF SLCT > 1
               MOVE 0 TO SLCT
               MOVE 41026 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 60-MAKE-SELECTION.
           IF V-BUF NOT = SPACE MOVE "V" TO VPE-BUF.
           IF P-BUF NOT = SPACE MOVE "P" TO VPE-BUF.
           IF E-BUF NOT = SPACE MOVE "E" TO VPE-BUF.
           IF VPE-BUF = "V"
               MOVE VERB-STAB TO STAT-TABLE
               MOVE 4 TO OISUB
               MOVE 7 TO OIEND
               MOVE 5 TO HSUB
               MOVE 6 TO MAX
               MOVE "VERBAL    " TO WO-TYPE HWO-TYPE SM-TYPE
           ELSE
           MOVE PE-STAB TO STAT-TABLE
           MOVE 5 TO OISUB
           MOVE 8 TO OIEND
           MOVE 6 TO HSUB
           MOVE 10 TO MAX
           MOVE "PLANNED   " TO WO-TYPE HWO-TYPE SM-TYPE.
           IF VPE-BUF = "E"
               MOVE "ENGINEERED" TO WO-TYPE HWO-TYPE SM-TYPE.

       60-MS-EXIT.    EXIT.

       61-WRITE-SCREEN.
           MOVE 0 TO ACT-KEY.
           MOVE 0 TO ALL-STAT-SW PART-STAT-SW CD-STAT-SW.
           MOVE 0 TO OI-STAT-SW H-STAT-SW SUMM-SW.
           MOVE 0 TO SUBT PRTY-CTR.
           MOVE SPACES TO ZONE-HOLD.
           MOVE "MMDDYY" TO DATE-DISPLAY.
           IF DATE-FLAG = 3 MOVE "DDMMYY" TO DATE-DISPLAY.
           MOVE HWO-TYPE TO WO-TYPE.
           MOVE 1 TO ADV-CTR.
           MOVE ZEROS TO COUNTERS-SAVE TOTAL-PRTYS.
           ACCEPT TIME-BUFFER FROM TIME.
           MOVE CUR-TIME TO SM-TIME P-TIME.
           MOVE SPACES TO WORK-ARGUMENTS.
           MOVE SPACES TO WONUM-SAVE.
           MOVE SPACES TO SUMM-DET.
           MOVE 0 TO CW-DET HA-DET HM-DET IP-DET OO-DET TOT-DET.
           IF VPE-BUF NOT = "V"
              MOVE 0 TO HS-DET SD-DET SW-DET PR-DET.
           MOVE "N" TO RECORDS-PROCESSED-SW ALL-RECORDS-WRITTEN-SW.
           MOVE ZEROS TO COUNTERS.
           MOVE SPACES TO SHIFT-DATA.
       61-WS-CONT.
           MOVE "FQ1SEL2" TO VIEW-CFNAME.
           MOVE ERROR-BUFFER TO SCREEN2-MSG-LINE.
           MOVE SCREEN2-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO SCREEN2-BUFFER.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           IF VIEW-LASTKEY NOT = 0 GO TO 61-WS-CONT.
           IF PRINT-BUF = " "
               NEXT SENTENCE
           ELSE
           MOVE "P" TO PRINT-BUF
      *    MOVE 0 TO OVRPRTF-TOFILE-NUM
           MOVE "P " TO OVRPRTF-TOFILE-NUM-X
           PERFORM 996-OVERRIDE-PRINT-FILE
           OPEN OUTPUT PRINT-FILE.

           IF WOSTAT-BUF = "CW" OR "SR" OR "RS"
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO DATE-BUF SHIFT-BUF.
           IF WOSTAT-BUF = "00"
               MOVE "OO" TO WOSTAT-BUF.
           IF WOSTAT-BUF = "SR" OR "RS"
               MOVE 1 TO SUMM-SW
               MOVE "AL" TO WOSTAT-BUF.
           IF WOSTAT-BUF = "AL"
               MOVE 1 TO ALL-STAT-SW.
           IF WOSTAT-BUF = "**"
               MOVE 2 TO SUBT
               MOVE 1 TO ALL-STAT-SW
               MOVE 1 TO PART-STAT-SW.
           IF WOSTAT-BUF = "OI" OR "IO"
               MOVE OISUB TO SUBT
               MOVE 1 TO OI-STAT-SW
               MOVE 1 TO ALL-STAT-SW
               MOVE 1 TO PART-STAT-SW.
           IF WOSTAT-BUF = "CD" OR "DC"
               MOVE 1 TO CD-STAT-SW
               MOVE 1 TO ALL-STAT-SW.
           IF WOSTAT-BUF = "H " OR " H" OR "HH"
               MOVE 2 TO SUBT
               MOVE 1 TO H-STAT-SW
               MOVE 1 TO ALL-STAT-SW
               MOVE 1 TO PART-STAT-SW.
           IF WOSTAT-BUF = SPACES
               MOVE 49009 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 61-WS-CONT.
           IF WOSTAT-BUF = "FF"
               MOVE 32004 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 61-WS-CONT.
      *    EDIT THE ZONE THAT WAS INPUT BY THE USER
           IF PLANT-IDENT = "126 "
               IF ZONE-BUF = "    "
                   NEXT SENTENCE
               ELSE
               PERFORM 69-START-WO-ZONE-PRTY-FILE
               IF COND-WORD = 17
                   MOVE 35044 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (2) INDS (99)
                   GO TO 61-WS-CONT
               ELSE
               NEXT SENTENCE
           ELSE
           IF ZONE-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF Z-BUF-1 = "A" AND Z-BUF-2 = " " OR "A"
               NEXT SENTENCE
           ELSE
           IF Z-BUF-1 = "B" AND Z-BUF-2 = " " OR "B" OR "C" OR "D"
               NEXT SENTENCE
           ELSE
           IF Z-BUF-1 = "C" AND Z-BUF-2 = " "
               NEXT SENTENCE
           ELSE
           IF Z-BUF-1 = "F" AND Z-BUF-2 = " "
               NEXT SENTENCE
           ELSE
           PERFORM 69-START-WO-ZONE-PRTY-FILE
           IF COND-WORD = 17
               MOVE 35044 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (2) INDS (99)
               GO TO 61-WS-CONT.
      *    EDIT THE CRAFT THAT USER INPUT
           IF VPE-BUF = "P" OR "E"
               MOVE SPACES TO CRAFT-BUF.
           IF CRAFT-BUF = SPACES
               NEXT SENTENCE
           ELSE
           PERFORM 69-START-WO-CRAFTS-REQD-FILE
           IF COND-WORD = 17
               MOVE 35037 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (3) INDS (99)
               GO TO 61-WS-CONT.
      *    EDIT THE DATE AND SHIFT COMBINATION ENTERED BY USER
           IF SUMM-SW-ON OR DATE-BUF-MM = "X " OR " X" OR "XX"
               PERFORM 610-CUR-DATE.
           IF DATE-BUF NOT = SPACES
               IF ZONE-BUF = SPACES
                   MOVE 52002 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (2) INDS (99)
                   GO TO 61-WS-CONT.
           IF DATE-BUF = SPACES
               IF SHIFT-BUF NOT = SPACE
                   MOVE 29006 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (4) INDS (99)
                   GO TO 61-WS-CONT.
           IF SHIFT-BUF NOT NUMERIC
               MOVE SPACE TO SHIFT-BUF.
           IF SHIFT-BUF < 1 OR > 3
               MOVE SPACE TO SHIFT-BUF.
           IF DATE-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF DATE-FLAG = 1
               IF DATE-BUF-MM > "00" AND < "13"
                   IF DATE-BUF-DD > "00" AND < "32"
                       IF DATE-BUF-YY IS NUMERIC
                           NEXT SENTENCE
                       ELSE
                       MOVE 35032 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE TRUE-VAL TO INDS (6) INDS (99)
                       GO TO 61-WS-CONT
                   ELSE
                   MOVE 35030 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (5) INDS (99)
                   GO TO 61-WS-CONT
               ELSE
               MOVE 35031 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (4) INDS (99)
               GO TO 61-WS-CONT
           ELSE
           IF DATE-BUF-MM > "00" AND < "32"
               IF DATE-BUF-DD > "00" AND < "13"
                   IF DATE-BUF-YY IS NUMERIC
                       NEXT SENTENCE
                   ELSE
                   MOVE 35032 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (6) INDS (99)
                   GO TO 61-WS-CONT
               ELSE
               MOVE 35031 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (5) INDS (99)
               GO TO 61-WS-CONT
           ELSE
           MOVE 35030 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (4) INDS (99)
           GO TO 61-WS-CONT.
      *    EDIT THE PRIORITY INPUT BY THE USER
           IF PRIORITY-BUF = SPACE
               MOVE "A" TO PRIORITY-BUF.
           IF PRIORITY-BUF = "1" OR "2" OR "3" OR "4" OR
                                    "5" OR "6" OR "A"
               NEXT SENTENCE
           ELSE
           MOVE 35080 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (9) INDS (99)
           GO TO 61-WS-CONT.
      *    EDIT CHECK EQUIPMENT DOWN FLAG FOR VALIDITY
           IF EQDN-BUF = SPACE OR "Y" OR "N"
               NEXT SENTENCE
           ELSE
           MOVE 31033 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (11) INDS (99)
           GO TO 61-WS-CONT.

       61-WS-EXIT.    EXIT.

       610-CUR-DATE.
           MOVE MM-BUFFER TO DATE-BUF-MM.
           MOVE DD-BUFFER TO DATE-BUF-DD.
           MOVE YY-BUFFER TO DATE-BUF-YY.
           MOVE DATE-FLAG TO DATE-CODE.
           MOVE DATE-BUF TO DATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT TO DATE-BUF.
           IF SUMM-SW-ON
               IF SHIFT-BUF NOT = "A"
                   MOVE SPACE TO SHIFT-BUF.
           IF SHIFT-BUF = SPACE
               MOVE CUR-TIME TO TIME-IN
               MOVE ZONE-BUF TO LINK-ZONE
               CALL "TGETSHFT" USING SHIFT-DATA DBPARAMETERS
               MOVE CURR-SHIFT TO SHIFT-BUF.

       COPY OVRPFCALL OF COPYLIB.

       62-SORT-INPUT.
           MOVE WOSTAT-BUF TO ARG12.
           MOVE SPACE TO ARG3 ARG4.
           IF WOSTAT-BUF = "SD" OR "PR"
               IF ZONE-BUF = SPACES
                   SORT SORT-FILE ASCENDING KEY SORT-Z SORT-P
                          SCHED-DATE-SORT SCHED-SHIFT-SORT
                          SORT-EQNUM
                          SORT-WONUM CMAN-1-SORT
                   INPUT PROCEDURE  7-SORT-INPUT-RECORDS
                   OUTPUT PROCEDURE 8-SORT-WRITE-FILE
               ELSE
               SORT SORT-FILE ASCENDING KEY SORT-P SCHED-DATE-SORT
                   SCHED-SHIFT-SORT SORT-EQNUM
                   SORT-WONUM CMAN-1-SORT
               INPUT PROCEDURE  7-SORT-INPUT-RECORDS
               OUTPUT PROCEDURE 8-SORT-WRITE-FILE
           ELSE
           IF ZONE-BUF = SPACES
               IF EQNUM-BUF = SPACES
                   SORT SORT-FILE ASCENDING KEY SORT-WOSTAT SORT-Z
                                    SORT-EQNUM SORT-P
                                    SORT-WONUM CMAN-1-SORT
                   INPUT PROCEDURE  7-SORT-INPUT-RECORDS
                   OUTPUT PROCEDURE 8-SORT-WRITE-FILE
               ELSE
               SORT SORT-FILE ASCENDING KEY SORT-WOSTAT SORT-Z
                                SORT-P SORT-EQNUM SORT-WONUM CMAN-1-SORT
               INPUT PROCEDURE  7-SORT-INPUT-RECORDS
               OUTPUT PROCEDURE 8-SORT-WRITE-FILE
           ELSE
           IF EQNUM-BUF = SPACES
               SORT SORT-FILE ASCENDING KEY SORT-WOSTAT SORT-P
                                 SORT-EQNUM
                                 SORT-WONUM CMAN-1-SORT
               INPUT PROCEDURE  7-SORT-INPUT-RECORDS
               OUTPUT PROCEDURE 8-SORT-WRITE-FILE
           ELSE
           SORT SORT-FILE ASCENDING KEY SORT-WOSTAT SORT-P
                            SORT-EQNUM SORT-WONUM CMAN-1-SORT
           INPUT PROCEDURE  7-SORT-INPUT-RECORDS
           OUTPUT PROCEDURE 8-SORT-WRITE-FILE.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.

       62-SI-EXIT.    EXIT.

       63-DISPLAY-OUTPUT.
           IF ALL-STAT-SW-ON
               PERFORM 631-ALL-STAT-PROC
           ELSE
           PERFORM 6311-SETUP THRU 6311-SETUP-EXIT
           PERFORM 6321-MAIN THRU 6321-MAIN-EXIT
                       UNTIL ALL-RECORDS-WRITTEN-SW = "Y".

       631-ALL-STAT-PROC.
           MOVE 0 TO SUBT.
           IF SUMM-SW-ON
               PERFORM 6310-SUMMARY-REPORT THRU 6310-SUMMARY-EXIT
               MOVE PIP    TO PHS
               MOVE POO    TO PIP
               MOVE ZEROS  TO POO.
           IF PART-STAT-SW-ON
               MOVE 2 TO SUBT.
           IF OI-STAT-SW-ON
               MOVE OISUB TO SUBT.
           ADD 1 TO SUBT GIVING SUBTT.
           MOVE COUNTER-TABLE (SUBTT) TO COUNTERS.
           PERFORM 6311-SETUP THRU 6311-SETUP-EXIT.
           PERFORM 6312-ALL-STAT-OUT
               THRU 6312-ASO-EXIT UNTIL SUBT > MAX.

       6310-SUMMARY-REPORT.
           MOVE SPACES TO FILL-SCREEN.
           MOVE PRIORITY-BUF     TO PRTY-SUMM.
           MOVE ZONE-BUF         TO ZONE-SUMM.
           MOVE DEPT-BUF         TO DEPT-SUMM.
           MOVE CRAFT-BUF        TO CRAFT-SUMM.
           MOVE EQNUM-BUF        TO EQNUM-SUMM.
           MOVE EQDN-BUF         TO EQDN-SUMM.
           MOVE DATE-BUF         TO DATE-SUMM.
           MOVE SHIFT-BUF        TO SHIFT-SUMM.
           IF SHIFT-SUMM = "0"
               MOVE "A" TO SHIFT-SUMM.
           IF VPE-BUF = "V"
               MOVE PIP    TO POO
               MOVE PHS    TO PIP
               MOVE ZEROS  TO PHS
               MOVE V-SUMMARY-COL-HD TO SUMMARY-COL-HD
           ELSE
           MOVE PE-SUMMARY-COL-HD TO SUMMARY-COL-HD.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DT-TM TO FIELD-1
               MOVE VPE-MESSAGE TO FIELD-3
               MOVE SUMMARY-SEL1 TO FIELD-5
               MOVE SUMMARY-SEL2 TO FIELD-7
               MOVE SUMMARY-COL-HD TO FIELD-9
           ELSE
           MOVE SM-TYPE TO PS-TYPE
           MOVE 2 TO ADV-CTR
           MOVE SPACES TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           MOVE SUMMARY-DT-TM TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SUMMARY-TITLE TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SUMMARY-SEL1 TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SUMMARY-SEL2 TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SUMMARY-COL-HD TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE "1" TO PRT-DET.
           MOVE P1CW  TO CW-DET.
           ADD  P1CW  TO FIRST-TOT.
           ADD  P1CW  TO TOT-DET-9.
           MOVE P1HA  TO HA-DET.
           ADD  P1HA  TO SECND-TOT.
           ADD  P1HA  TO TOT-DET-9.
           MOVE P1HM  TO HM-DET.
           ADD  P1HM  TO THIRD-TOT.
           ADD  P1HM  TO TOT-DET-9.
           MOVE P1HS  TO HS-DET.
           ADD  P1HS  TO FORTH-TOT.
           ADD  P1HS  TO TOT-DET-9.
           MOVE P1IP  TO IP-DET.
           ADD  P1IP  TO FIFTH-TOT.
           ADD  P1IP  TO TOT-DET-9.
           MOVE P1OO  TO OO-DET.
           ADD  P1OO  TO SIXTH-TOT.
           ADD  P1OO  TO TOT-DET-9.
           MOVE P1SD  TO SD-DET.
           ADD  P1SD  TO SEVTH-TOT.
           ADD  P1SD  TO TOT-DET-9.
           MOVE P1SW  TO SW-DET.
           ADD  P1SW  TO EIGTH-TOT.
           ADD  P1SW  TO TOT-DET-9.
           MOVE P1PR  TO PR-DET.
           ADD  P1PR  TO NINTH-TOT.
           ADD  P1PR  TO TOT-DET-9.
           MOVE TOT-DET-9 TO TOT-DET.
           IF VPE-BUF = "V"
               SUBTRACT P1HS FROM FORTH-TOT
               SUBTRACT P1HS FROM TOT-DET-9
               SUBTRACT P1SD FROM SEVTH-TOT
               SUBTRACT P1SD FROM TOT-DET-9
               SUBTRACT P1SW FROM EIGTH-TOT
               SUBTRACT P1SW FROM TOT-DET-9
               SUBTRACT P1PR FROM NINTH-TOT
               SUBTRACT P1PR FROM TOT-DET-9
               MOVE TOT-DET-9 TO TOT-DET
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-11
           ELSE
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE ZEROS TO TOT-DET-9.
           MOVE "2" TO PRT-DET.
           MOVE P2CW  TO CW-DET.
           ADD  P2CW  TO FIRST-TOT.
           ADD  P2CW  TO TOT-DET-9.
           MOVE P2HA  TO HA-DET.
           ADD  P2HA  TO SECND-TOT.
           ADD  P2HA  TO TOT-DET-9.
           MOVE P2HM  TO HM-DET.
           ADD  P2HM  TO THIRD-TOT.
           ADD  P2HM  TO TOT-DET-9.
           MOVE P2HS  TO HS-DET.
           ADD  P2HS  TO FORTH-TOT.
           ADD  P2HS  TO TOT-DET-9.
           MOVE P2IP  TO IP-DET.
           ADD  P2IP  TO FIFTH-TOT.
           ADD  P2IP  TO TOT-DET-9.
           MOVE P2OO  TO OO-DET.
           ADD  P2OO  TO SIXTH-TOT.
           ADD  P2OO  TO TOT-DET-9.
           MOVE P2SD  TO SD-DET.
           ADD  P2SD  TO SEVTH-TOT.
           ADD  P2SD  TO TOT-DET-9.
           MOVE P2SW  TO SW-DET.
           ADD  P2SW  TO EIGTH-TOT.
           ADD  P2SW  TO TOT-DET-9.
           MOVE P2PR  TO PR-DET.
           ADD  P2PR  TO NINTH-TOT.
           ADD  P2PR  TO TOT-DET-9.
           MOVE TOT-DET-9 TO TOT-DET.
           IF VPE-BUF = "V"
               SUBTRACT P2HS FROM FORTH-TOT
               SUBTRACT P2HS FROM TOT-DET-9
               SUBTRACT P2SD FROM SEVTH-TOT
               SUBTRACT P2SD FROM TOT-DET-9
               SUBTRACT P2SW FROM EIGTH-TOT
               SUBTRACT P2SW FROM TOT-DET-9
               SUBTRACT P2PR FROM NINTH-TOT
               SUBTRACT P2PR FROM TOT-DET-9
               MOVE TOT-DET-9 TO TOT-DET
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-13
           ELSE
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE ZEROS TO TOT-DET-9.
           MOVE "3" TO PRT-DET.
           MOVE P3CW  TO CW-DET.
           ADD  P3CW  TO FIRST-TOT.
           ADD  P3CW  TO TOT-DET-9.
           MOVE P3HA  TO HA-DET.
           ADD  P3HA  TO SECND-TOT.
           ADD  P3HA  TO TOT-DET-9.
           MOVE P3HM  TO HM-DET.
           ADD  P3HM  TO THIRD-TOT.
           ADD  P3HM  TO TOT-DET-9.
           MOVE P3HS  TO HS-DET.
           ADD  P3HS  TO FORTH-TOT.
           ADD  P3HS  TO TOT-DET-9.
           MOVE P3IP  TO IP-DET.
           ADD  P3IP  TO FIFTH-TOT.
           ADD  P3IP  TO TOT-DET-9.
           MOVE P3OO  TO OO-DET.
           ADD  P3OO  TO SIXTH-TOT.
           ADD  P3OO  TO TOT-DET-9.
           MOVE P3SD  TO SD-DET.
           ADD  P3SD  TO SEVTH-TOT.
           ADD  P3SD  TO TOT-DET-9.
           MOVE P3SW  TO SW-DET.
           ADD  P3SW  TO EIGTH-TOT.
           ADD  P3SW  TO TOT-DET-9.
           MOVE P3PR  TO PR-DET.
           ADD  P3PR  TO NINTH-TOT.
           ADD  P3PR  TO TOT-DET-9.
           MOVE TOT-DET-9 TO TOT-DET.
           IF VPE-BUF = "V"
               SUBTRACT P3HS FROM FORTH-TOT
               SUBTRACT P3HS FROM TOT-DET-9
               SUBTRACT P3SD FROM SEVTH-TOT
               SUBTRACT P3SD FROM TOT-DET-9
               SUBTRACT P3SW FROM EIGTH-TOT
               SUBTRACT P3SW FROM TOT-DET-9
               SUBTRACT P3PR FROM NINTH-TOT
               SUBTRACT P3PR FROM TOT-DET-9
               MOVE TOT-DET-9 TO TOT-DET
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-15
           ELSE
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE ZEROS TO TOT-DET-9.
           MOVE "4" TO PRT-DET.
           MOVE P4CW  TO CW-DET.
           ADD  P4CW  TO FIRST-TOT.
           ADD  P4CW  TO TOT-DET-9.
           MOVE P4HA  TO HA-DET.
           ADD  P4HA  TO SECND-TOT.
           ADD  P4HA  TO TOT-DET-9.
           MOVE P4HM  TO HM-DET.
           ADD  P4HM  TO THIRD-TOT.
           ADD  P4HM  TO TOT-DET-9.
           MOVE P4HS  TO HS-DET.
           ADD  P4HS  TO FORTH-TOT.
           ADD  P4HS  TO TOT-DET-9.
           MOVE P4IP  TO IP-DET.
           ADD  P4IP  TO FIFTH-TOT.
           ADD  P4IP  TO TOT-DET-9.
           MOVE P4OO  TO OO-DET.
           ADD  P4OO  TO SIXTH-TOT.
           ADD  P4OO  TO TOT-DET-9.
           MOVE P4SD  TO SD-DET.
           ADD  P4SD  TO SEVTH-TOT.
           ADD  P4SD  TO TOT-DET-9.
           MOVE P4SW  TO SW-DET.
           ADD  P4SW  TO EIGTH-TOT.
           ADD  P4SW  TO TOT-DET-9.
           MOVE P4PR  TO PR-DET.
           ADD  P4PR  TO NINTH-TOT.
           ADD  P4PR  TO TOT-DET-9.
           MOVE TOT-DET-9 TO TOT-DET.
           IF VPE-BUF = "V"
               SUBTRACT P4HS FROM FORTH-TOT
               SUBTRACT P4HS FROM TOT-DET-9
               SUBTRACT P4SD FROM SEVTH-TOT
               SUBTRACT P4SD FROM TOT-DET-9
               SUBTRACT P4SW FROM EIGTH-TOT
               SUBTRACT P4SW FROM TOT-DET-9
               SUBTRACT P4PR FROM NINTH-TOT
               SUBTRACT P4PR FROM TOT-DET-9
               MOVE TOT-DET-9 TO TOT-DET
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-17
           ELSE
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE ZEROS TO TOT-DET-9.
           MOVE "5" TO PRT-DET.
           MOVE P5CW  TO CW-DET.
           ADD  P5CW  TO FIRST-TOT.
           ADD  P5CW  TO TOT-DET-9.
           MOVE P5HA  TO HA-DET.
           ADD  P5HA  TO SECND-TOT.
           ADD  P5HA  TO TOT-DET-9.
           MOVE P5HM  TO HM-DET.
           ADD  P5HM  TO THIRD-TOT.
           ADD  P5HM  TO TOT-DET-9.
           MOVE P5HS  TO HS-DET.
           ADD  P5HS  TO FORTH-TOT.
           ADD  P5HS  TO TOT-DET-9.
           MOVE P5IP  TO IP-DET.
           ADD  P5IP  TO FIFTH-TOT.
           ADD  P5IP  TO TOT-DET-9.
           MOVE P5OO  TO OO-DET.
           ADD  P5OO  TO SIXTH-TOT.
           ADD  P5OO  TO TOT-DET-9.
           MOVE P5SD  TO SD-DET.
           ADD  P5SD  TO SEVTH-TOT.
           ADD  P5SD  TO TOT-DET-9.
           MOVE P5SW  TO SW-DET.
           ADD  P5SW  TO EIGTH-TOT.
           ADD  P5SW  TO TOT-DET-9.
           MOVE P5PR  TO PR-DET.
           ADD  P5PR  TO NINTH-TOT.
           ADD  P5PR  TO TOT-DET-9.
           MOVE TOT-DET-9 TO TOT-DET.
           IF VPE-BUF = "V"
               SUBTRACT P5HS FROM FORTH-TOT
               SUBTRACT P5HS FROM TOT-DET-9
               SUBTRACT P5SD FROM SEVTH-TOT
               SUBTRACT P5SD FROM TOT-DET-9
               SUBTRACT P5SW FROM EIGTH-TOT
               SUBTRACT P5SW FROM TOT-DET-9
               SUBTRACT P5PR FROM NINTH-TOT
               SUBTRACT P5PR FROM TOT-DET-9
               MOVE TOT-DET-9 TO TOT-DET
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-19
           ELSE
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE ZEROS TO TOT-DET-9.
           MOVE "TOTAL" TO DET-HDR.
           MOVE FIRST-TOT  TO CW-DET.
           ADD  FIRST-TOT  TO TOTAL-TOT.
           MOVE SECND-TOT  TO HA-DET.
           ADD  SECND-TOT  TO TOTAL-TOT.
           MOVE THIRD-TOT  TO HM-DET.
           ADD  THIRD-TOT  TO TOTAL-TOT.
           MOVE FORTH-TOT  TO HS-DET.
           ADD  FORTH-TOT  TO TOTAL-TOT.
           MOVE FIFTH-TOT  TO IP-DET.
           ADD  FIFTH-TOT  TO TOTAL-TOT.
           MOVE SIXTH-TOT  TO OO-DET.
           ADD  SIXTH-TOT  TO TOTAL-TOT.
           MOVE SEVTH-TOT  TO SD-DET.
           ADD  SEVTH-TOT  TO TOTAL-TOT.
           MOVE EIGTH-TOT  TO SW-DET.
           ADD  EIGTH-TOT  TO TOTAL-TOT.
           MOVE NINTH-TOT  TO SW-DET.
           ADD  NINTH-TOT  TO TOTAL-TOT.
           MOVE TOTAL-TOT TO TOT-DET.
           IF VPE-BUF = "V"
               MOVE SPACE TO HS-DEV SD-DEV SW-DEV PR-DEV
               MOVE SUMM-DET-V TO SUMMARY-DETAIL
           ELSE
           MOVE SUMM-DET-PE TO SUMMARY-DETAIL.
           IF PRINT-BUF NOT = "P"
               MOVE SUMMARY-DETAIL TO FIELD-21
           ELSE
           MOVE HEADING-DOTS TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SUMMARY-DETAIL TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.
           MOVE 1 TO ADV-CTR.

           IF PRINT-BUF = "P" GO TO 6310-SUMMARY-EXIT.
           MOVE "FQ1SCRN" TO VIEW-CFNAME.
           MOVE 42061 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO FILL-CMD-LINE.
           MOVE FILL-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER FILL-SCREEN.
           IF VIEW-LASTKEY = 2 OR 3
               GO TO 2-EOJ.

       6310-SUMMARY-EXIT.    EXIT.

       6311-SETUP.
           MOVE ZONE-BUF TO MZ-1-H.
           MOVE DEPT-BUF TO DEPT-1-H.
           MOVE DATE-BUF TO DATE-1-H.
           MOVE SHIFT-BUF TO SHIFT-1-H.
           IF SHIFT-BUF = 0
               MOVE "A" TO SHIFT-1-H.
           MOVE 0 TO EOF-SW.
           MOVE 1 TO ACT-KEY.
           IF ACT-KEY > RECS-WRITTEN-CTR
               MOVE 40067 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE 2 TO VIEW-LASTKEY
               GO TO 2-EOJ.
           READ OUT-FILE    INVALID KEY
               MOVE 40067 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE 2 TO VIEW-LASTKEY
               GO TO 2-EOJ.
           IF ZONE-BUF = SPACES
               MOVE Z-OUT TO ZONE-HOLD MZ-1-H.
           MOVE WOSTAT-OUT TO WOSTAT-1-H.
           MOVE WOSTAT-OUT TO STAT-SAVE.
           IF ALL-STAT-SW-ON
               NEXT SENTENCE
           ELSE
           PERFORM 63110-HEADINGS
           MOVE P-OUT TO PRIORITY-TAG P-SAVE
           IF ZONE-BUF NOT = SPACES
               PERFORM 63111-PRTY-LITERAL.

       6311-SETUP-EXIT.    EXIT.

       6312-ALL-STAT-OUT.
           ADD 1 TO SUBT.
           IF H-STAT-SW-ON
               IF SUBT = HSUB
                   MOVE 11 TO SUBT.
           IF CD-STAT-SW-ON
               IF SUBT = 3
                   MOVE 11 TO SUBT.
           IF SUBT > MAX GO TO 6312-ASO-EXIT.
           IF WOSTAT-OUT NOT = TABLE-STAT (SUBT)
               GO TO 6312-ALL-STAT-OUT.
           IF SUBT > 1
               MOVE COUNTER-TABLE (SUBT) TO COUNTERS.
           MOVE TABLE-STAT (SUBT) TO WOSTAT-1-H.
           IF ZONE-BUF = SPACES
               MOVE Z-OUT TO ZONE-HOLD MZ-1-H.
           MOVE DEPT-BUF TO DEPT-1-H.
           MOVE DATE-BUF TO DATE-1-H.
           MOVE SHIFT-BUF TO SHIFT-1-H.
           IF SHIFT-BUF = 0
               MOVE "A" TO SHIFT-1-H.
           PERFORM 63110-HEADINGS.
           MOVE P-OUT TO PRIORITY-TAG P-SAVE.
           IF ZONE-BUF NOT = SPACES
               PERFORM 63111-PRTY-LITERAL.
           MOVE " " TO ALL-RECORDS-WRITTEN-SW.
           PERFORM 6321-MAIN THRU 6321-MAIN-EXIT
                   UNTIL ALL-RECORDS-WRITTEN-SW = "Y".
           IF VIEW-LASTKEY = 2 MOVE 11 TO SUBT.

       6312-ASO-EXIT.    EXIT.

       6321-MAIN.
           IF ZONE-BUF = SPACES
               IF Z-OUT NOT = ZONE-HOLD
                   MOVE P-SAVE TO PRTY-1-L
                   PERFORM 63111-PRTY-LITERAL
                   IF PRINT-BUF NOT = "P"
                       MOVE 18 TO LINE-K
                   ELSE
                   MOVE Z-OUT TO ZONE-HOLD MZ-1-H
                   MOVE 55 TO LINE-K.

           IF PRINT-BUF NOT = "P"
               IF FIELD-CTR > 22 OR LINE-K > 16
                   PERFORM 6321-MAINSHOW.

           IF PRINT-BUF = "P"
               IF LINE-K > 54
                   MOVE 0 TO LINE-K
                   PERFORM 63110-HEADINGS.

           MOVE SPACES TO DETAIL-REC.
           MOVE WONO-OUT         TO WONUM-7.
           MOVE WOSU-OUT         TO WONUM-3.
           MOVE EQNUM-OUT        TO EQNUM.
           MOVE EQDOWN-OUT       TO EQDOWN.
           MOVE WODESC-OUT       TO WODESC.

           IF WOSTAT-OUT = "OO"
               PERFORM 63210-OO-DETAIL-RECORD
           ELSE
           IF WOSTAT-OUT = "IP"
               PERFORM 63210-IP-DETAIL-RECORD
           ELSE
           IF WOSTAT-OUT = "CW" OR "DW"
               PERFORM 63210-CW-DW-DETAIL-RECORD
           ELSE
           IF WOSTAT-OUT = "SD" OR "PR"
               PERFORM 63210-SD-DETAIL-RECORD
               IF WOSTAT-BUF = "SD" OR "PR"
                   IF SCHED-DATE-SD NOT = SD-DATE-HOLD
                       MOVE SCHED-DATE-SD TO SD-DATE-HOLD
                       IF PRINT-BUF NOT = "P"
                           ADD 1 TO LINE-K
                           ADD 1 TO FIELD-CTR
                       ELSE
                       MOVE SPACES TO HOLD-BUFFER
                       PERFORM 63100-BE-PRINT-FUNCTION
                       ADD 1 TO LINE-K
                   ELSE
                   NEXT SENTENCE
               ELSE
               NEXT SENTENCE
           ELSE
           PERFORM 63210-HSTAT-DETAIL-RECORD.

           IF WONUM-OUT = WONUM-SAVE
               MOVE SPACES TO DETAIL-PREFIX
               IF WOSTAT-OUT = "CW" OR "DW"
                   MOVE ZEROS TO WOTM-CD
               ELSE
               MOVE WONUM-OUT TO WONUM-SAVE
           ELSE
           MOVE WONUM-OUT TO WONUM-SAVE.

           IF ZONE-BUF NOT = SPACES
               IF P-OUT NOT = PRIORITY-TAG
                   MOVE P-OUT TO PRIORITY-TAG
                   PERFORM 63111-PRTY-LITERAL.

           IF ZONE-BUF = SPACES
             IF Z-OUT = ZONE-HOLD
               IF P-OUT NOT = PRIORITY-TAG
                   MOVE P-SAVE TO PRTY-1-L
                   PERFORM 63111-PRTY-LITERAL.

           IF ZONE-BUF = SPACES
             IF Z-OUT NOT = ZONE-HOLD
               MOVE 0 TO PRTY-CTR
               MOVE Z-OUT TO ZONE-HOLD MZ-1-H
               IF PRINT-BUF NOT = "P"
                   PERFORM 63110-HEADINGS.

           IF PRINT-BUF NOT = "P"
               MOVE DETAIL-REC TO FIELD-HOLD
               PERFORM 63202-BE-WRITE-FIELDS
               IF FIELD-CTR > 22
                   MOVE 1 TO SCREEN-FLAG.

           IF PRINT-BUF = "P"
               MOVE DETAIL-REC TO HOLD-BUFFER
               PERFORM 63100-BE-PRINT-FUNCTION.

           ADD 1 TO LINE-K.
           IF DETAIL-PREFIX NOT = SPACES
               ADD 1 TO PRTY-CTR.
           ADD 1 TO ACT-KEY.
           IF ACT-KEY > RECS-WRITTEN-CTR
               PERFORM 63219-INVALID-KEY-FUNCTION
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
               GO TO 6321-MAINSHOW.
           READ OUT-FILE INVALID KEY
               PERFORM 63219-INVALID-KEY-FUNCTION
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
               GO TO 6321-MAINSHOW.

           IF ALL-STAT-SW-ON
               IF PRINT-BUF NOT = "P"
                   IF WOSTAT-OUT = STAT-SAVE
                       NEXT SENTENCE
                   ELSE
                   IF ZONE-BUF = SPACES
                       MOVE P-SAVE TO PRTY-1-L
                       PERFORM 63111-PRTY-LITERAL.

           IF ALL-STAT-SW-ON
               IF PRINT-BUF NOT = "P"
                   IF WOSTAT-OUT = STAT-SAVE
                       NEXT SENTENCE
                   ELSE
                   MOVE WOSTAT-OUT TO STAT-SAVE
                   MOVE COUNTER-TABLE (SUBT) TO COUNTERS
                   MOVE TABLE-STAT (SUBT) TO STAT-CD
                   MOVE 31096 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO CAT-TEXT-1
                   MOVE 31097 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO CAT-TEXT-2
                   MOVE CATREAD-BUFFER TO ERROR-BUFFER
                   MOVE 1 TO SCREEN-FLAG NEW-STAT-SW.

           IF ALL-STAT-SW-ON
             IF PRINT-BUF = "P"
               IF WOSTAT-OUT = STAT-SAVE
                   NEXT SENTENCE
               ELSE
               MOVE WOSTAT-OUT TO STAT-SAVE
               MOVE COUNTER-TABLE (SUBT) TO COUNTERS
               MOVE TABLE-STAT (SUBT) TO STAT-CD
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
               MOVE 0 TO LINE-K
               IF ZONE-BUF = SPACES
                   MOVE P-SAVE TO PRTY-1-L
                   PERFORM 63111-PRTY-LITERAL.
           IF PRINT-BUF = "P" GO TO 6321-MAIN-EXIT.
           IF SCREEN-FLAG = 0 GO TO 6321-MAIN-EXIT.
           MOVE 0 TO SCREEN-FLAG.

       6321-MAINSHOW.
           IF PRINT-BUF = "P" GO TO 6321-MAIN-EXIT.
           MOVE 0 TO LINE-K FIELD-CTR.
           MOVE "FQ1SCRN" TO VIEW-CFNAME.
           MOVE 42061 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO FILL-CMD-LINE.
           MOVE FILL-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER FILL-SCREEN.
           IF VIEW-LASTKEY = 1 OR 0
               IF EOF-SW = 0
                   IF NEW-STAT-SW = 0
                       PERFORM 63110-HEADINGS
                   ELSE
                   MOVE 0 TO NEW-STAT-SW
                   MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
               ELSE
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
               MOVE 2 TO VIEW-LASTKEY
           ELSE
           IF VIEW-LASTKEY = 2
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
           ELSE
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ
           ELSE
           MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
           MOVE 2 TO VIEW-LASTKEY.

       6321-MAIN-EXIT.    EXIT.

       63210-OO-DETAIL-RECORD.
           MOVE DATE-FLAG TO DATE-CODE.
           MOVE DATE-RCVD TO DATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT         TO DRCV-OO.
           MOVE TIME-RCVD        TO TRCV-OO.
           MOVE C1-OUT           TO CRAFTSREQ-1-OO.
           MOVE C2-OUT           TO CRAFTSREQ-2-OO.
           MOVE C3-OUT           TO CRAFTSREQ-3-OO.

       63210-IP-DETAIL-RECORD.
           MOVE CMAN-1-OUT       TO CCNUM-IP.
           IF TSTRT-OUT = "    " MOVE 0 TO TSTRT-OUT-9.
           MOVE TSTRT-OUT        TO TSTR-IP.
           MOVE C1-OUT           TO CRAFTSREQ-1-IP.

       63210-CW-DW-DETAIL-RECORD.
           IF TIME-RCVD = "    "
               MOVE ZEROES TO WO-TIME
           ELSE
           MOVE TIME-RCVD        TO WO-TIME.
           DIVIDE WO-TIME BY 60 GIVING WOTIME ROUNDED.
           IF WOT-HR-X = "  "
               MOVE ZEROES TO WOTM-CD
           ELSE
           MOVE WOT-HR  TO WO-HR
           MOVE WOT-MIN TO WO-MIN
           IF WO-HR-1 = "0"
               MOVE " " TO WO-HR-1
               MOVE WO-TOT TO WOTM-CD-D
           ELSE
           MOVE WO-TOT  TO WOTM-CD-D.
           MOVE RETM-OUT         TO RETM-CD.
           IF TIME-COMP-OUT = "    "
               MOVE ZEROES       TO CNTM-CD
           ELSE
           MOVE TIME-COMP-OUT    TO CNTM-CD.
           MOVE CMAN-1-OUT       TO CCNUM-CD.
           MOVE C1-OUT           TO CRAFTSREQ-1-CD.

       63210-SD-DETAIL-RECORD.
           MOVE DTIM-OUT         TO EQDTIM.
           MOVE SC-DATE-MM       TO SD-SCHED-MM.
           MOVE SC-DATE-DD       TO SD-SCHED-DD.
           MOVE SC-DATE-YY       TO SD-SCHED-YY.
           MOVE DATE-FLAG TO DATE-CODE.
           MOVE SCHED-DATE-SD TO DATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT TO SCHED-DATE-SD.
           MOVE "-"              TO SD-SLASH.
           MOVE SCHED-SHIFT-OUT  TO SCHED-SHIFT-SD.
           MOVE C1-OUT           TO CRAFTSREQ-1-SD.
           MOVE C2-OUT           TO CRAFTSREQ-2-SD.
           MOVE C3-OUT           TO CRAFTSREQ-3-SD.

       63210-HSTAT-DETAIL-RECORD.
           MOVE CMAN-1-OUT       TO CCNUM-H.
           MOVE ZERO             TO STTM-H.
           MOVE ZERO             TO STDT-H.

       63110-HEADINGS.
           MOVE SPACES TO FILL-SCREEN.
           IF PRINT-BUF NOT = "P"
               MOVE HEADING-1-H TO FIELD-1
           ELSE
           MOVE HEADING-DT-TM TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           MOVE HEADING-1-H TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE SPACES TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.

           IF WOSTAT-O-2 = "W"
               MOVE HEADING-2-CWDW TO HEADING-2
           ELSE
           IF WOSTAT-O-1 = "H"
               MOVE HEADING-2-HSTAT TO HEADING-2
           ELSE
           IF WOSTAT-OUT = "OO"
               MOVE HEADING-2-OO TO HEADING-2
           ELSE
           IF WOSTAT-OUT = "SD" OR "PR"
               MOVE HEADING-2-SD TO HEADING-2
           ELSE
           MOVE HEADING-2-IP TO HEADING-2.

           IF PRINT-BUF NOT = "P"
               MOVE HEADING-2-COMP TO FIELD-3
               MOVE HEADING-DOTS TO FIELD-4
               MOVE 4 TO FIELD-CTR
           ELSE
           MOVE HEADING-2 TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           MOVE HEADING-DOTS TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION.

       63111-PRTY-LITERAL.
           MOVE P-OUT TO PRIORITY-TAG P-SAVE.
           IF ZONE-BUF NOT = SPACES
               MOVE P-OUT TO PRTY-1-L.
           IF ZONE-BUF = SPACES
               MOVE PRTY-CTR TO NUM-1-L
               MOVE 0 TO PRTY-CTR
           ELSE
           IF PRTY-1-L = 1
               MOVE PRTY1-K TO NUM-1-L
           ELSE
           IF PRTY-1-L = 2
               MOVE PRTY2-K TO NUM-1-L
           ELSE
           IF PRTY-1-L = 3
               MOVE PRTY3-K TO NUM-1-L
           ELSE
           IF PRTY-1-L = 4
               MOVE PRTY4-K TO NUM-1-L
           ELSE
           IF PRTY-1-L = 5
               MOVE PRTY5-K TO NUM-1-L
           IF PRTY-1-L = 6
               MOVE PRTY6-K TO NUM-1-L.
           IF PRINT-BUF NOT = "P"
               MOVE LITERAL-1-L TO FIELD-HOLD
               PERFORM 63202-BE-WRITE-FIELDS
               IF ZONE-BUF = SPACES
                   MOVE HEADING-DOTS TO FIELD-HOLD
                   PERFORM 63202-BE-WRITE-FIELDS
                   ADD 1 TO LINE-K
               ELSE
               NEXT SENTENCE
           ELSE
           MOVE LITERAL-1-L TO HOLD-BUFFER
           PERFORM 63100-BE-PRINT-FUNCTION
           IF ZONE-BUF = SPACES
               MOVE HEADING-DOTS TO HOLD-BUFFER
               PERFORM 63100-BE-PRINT-FUNCTION
               ADD 1 TO LINE-K.
           ADD 1 TO LINE-K.

       63219-INVALID-KEY-FUNCTION.
           IF PRINT-BUF NOT = "P"
               IF ZONE-BUF = SPACES
                   MOVE P-SAVE TO PRTY-1-L
                   PERFORM 63111-PRTY-LITERAL
                   MOVE 31098 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 1 TO EOF-SW
               ELSE
               MOVE 31098 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1 TO EOF-SW
           ELSE
           IF ZONE-BUF = SPACES
               MOVE P-SAVE TO PRTY-1-L
               PERFORM 63111-PRTY-LITERAL
               MOVE SPACES TO PRINT-REC
      *        WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
               MOVE 2 TO VIEW-LASTKEY
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
           ELSE
           MOVE SPACES TO PRINT-REC
      *    WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           MOVE 2 TO VIEW-LASTKEY
           MOVE "Y" TO ALL-RECORDS-WRITTEN-SW.

       63100-BE-PRINT-FUNCTION.
           MOVE HOLD-BUFFER TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING ADV-CTR.

       63202-BE-WRITE-FIELDS.
           ADD 1 TO FIELD-CTR.
           IF FIELD-CTR = 5
               MOVE FIELD-HOLD TO FIELD-5
           ELSE
           IF FIELD-CTR = 6
               MOVE FIELD-HOLD TO FIELD-6
           ELSE
           IF FIELD-CTR = 7
               MOVE FIELD-HOLD TO FIELD-7
           ELSE
           IF FIELD-CTR = 8
               MOVE FIELD-HOLD TO FIELD-8
           ELSE
           IF FIELD-CTR = 9
               MOVE FIELD-HOLD TO FIELD-9
           ELSE
           IF FIELD-CTR = 10
               MOVE FIELD-HOLD TO FIELD-10
           ELSE
           IF FIELD-CTR = 11
               MOVE FIELD-HOLD TO FIELD-11
           ELSE
           IF FIELD-CTR = 12
               MOVE FIELD-HOLD TO FIELD-12
           ELSE
           IF FIELD-CTR = 13
               MOVE FIELD-HOLD TO FIELD-13
           ELSE
           IF FIELD-CTR = 14
               MOVE FIELD-HOLD TO FIELD-14
           ELSE
           IF FIELD-CTR = 15
               MOVE FIELD-HOLD TO FIELD-15
           ELSE
           IF FIELD-CTR = 16
               MOVE FIELD-HOLD TO FIELD-16
           ELSE
           IF FIELD-CTR = 17
               MOVE FIELD-HOLD TO FIELD-17
           ELSE
           IF FIELD-CTR = 18
               MOVE FIELD-HOLD TO FIELD-18
           ELSE
           IF FIELD-CTR = 19
               MOVE FIELD-HOLD TO FIELD-19
           ELSE
           IF FIELD-CTR = 20
               MOVE FIELD-HOLD TO FIELD-20
           ELSE
           IF FIELD-CTR = 21
               MOVE FIELD-HOLD TO FIELD-21
           ELSE
           IF FIELD-CTR = 22
               MOVE FIELD-HOLD TO FIELD-22
           ELSE
           IF FIELD-CTR = 23
               MOVE FIELD-HOLD TO FIELD-23.

       69-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF ARG12 NOT = WO-STATUS MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ARG12 TO WOSTATUS OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-WO-CRAFTS-REQD-FILE.
           MOVE 0 TO COND-WORD.
           MOVE CRAFT-BUF TO CRAFTREQD OF WCRFREC.
           START WO-CRAFTS-REQD-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WCRF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF ARG12 NOT = WO-STATUS-P MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ARG12 TO WOSTATUS OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-WO-ZONE-PRTY-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ZONE-BUF TO Z-ARG-4.
           MOVE ZONE-ARGUMENT TO ZONEPRTY OF WZPFREC.
           START WO-ZONE-PRTY-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WZPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       7-SORT-INPUT-RECORDS.
           PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT UNTIL
                       RECORDS-PROCESSED-SW = "Y".

       70-SORT-MAIN.
           IF SUMM-SW-ON AND SUBT = 1
               MOVE COUNTERS TO COUNTER-TABLE (SUBT)
               ADD 1 TO SUBT.
           IF ALL-STAT-SW-ON
               IF SUBT NOT = 0
                   MOVE COUNTERS TO COUNTER-TABLE (SUBT)
                   MOVE SPACES TO ARG34
                   MOVE ZEROS TO COUNTERS
                   ADD 1 TO SUBT
                   MOVE TABLE-STAT (SUBT) TO ARG12
               ELSE
               MOVE SPACES TO ARG34
               MOVE ZEROS TO COUNTERS
               ADD 1 TO SUBT
               MOVE TABLE-STAT (SUBT) TO ARG12.
           IF H-STAT-SW-ON
               IF SUBT = HSUB
                   MOVE 11 TO SUBT.
           IF OI-STAT-SW-ON
               IF SUBT = OIEND
                   MOVE 11 TO SUBT.
           IF CD-STAT-SW-ON
               IF SUBT = 3
                   MOVE 11 TO SUBT.
           IF SUBT > MAX
               MOVE "Y" TO RECORDS-PROCESSED-SW
               GO TO 70-SORT-M-EXIT.

           IF VPE-BUF = "V"
               PERFORM 69-START-WO-BASIC-FILE
           ELSE
           PERFORM 69-START-WO-PLANNED-FILE.
           IF COND-WORD = 17
               IF ALL-STAT-SW-ON
                   GO TO 70-SORT-M-EXIT
               ELSE
               MOVE "Y" TO RECORDS-PROCESSED-SW
               GO TO 70-SORT-M-EXIT.
           MOVE 0 TO COND-WORD.
           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT
               UNTIL COND-WORD = 15.
           IF ALL-STAT-SW-NOT-ON
               MOVE "Y" TO RECORDS-PROCESSED-SW.

       70-SORT-M-EXIT.    EXIT.

       70-SORT-DBGET.
           MOVE SPACES TO SORT-REC.
           IF VPE-BUF = "V"
               PERFORM 69-READ-WO-BASIC-FILE
           ELSE
           PERFORM 69-READ-WO-PLANNED-FILE.
           IF COND-WORD = 15 GO TO 70-SORT-DBGET-EXIT.
           IF WO-CURRENT-TYPE = "A" OR "M" OR "D"
               MOVE "P" TO WO-CURRENT-TYPE.

           IF VPE-BUF NOT = "V"
               IF VPE-BUF = WO-CURRENT-TYPE
                   MOVE SPACES           TO WO-BASIC-DATA
                   MOVE WO-NUM-PLANNED   TO WO-NUM
                   MOVE WO-STATUS-P      TO WO-STATUS
                   MOVE DATE-RECD-P-CN   TO DATE-RECD-CN
                   MOVE TIME-RECD-P      TO TIME-RECD
                   MOVE APPROVAL-CODE-P  TO APPROVAL-CODE
                   MOVE REQUESTER-P      TO REQUESTER-B
                   MOVE EQUIP-NUM-P      TO EQUIP-NUM
                   MOVE EQUIP-NAME-P     TO EQUIP-NAME
                   MOVE TYPE-NUM-P       TO TYPE-NUM
                   MOVE DEPT-P           TO DEPT OF WO-BASIC-DATA
                   MOVE ZONE-PRIORITY-P  TO ZONE-PRIORITY
                   MOVE LOCATION-P       TO LOCATION
                   MOVE EQUIP-DOWN-P     TO EQUIP-DOWN
                   MOVE EXP-CLASS-P      TO EXP-CLASS
                   MOVE DESCRIPTION-1-P  TO DESCRIPTION-1
                   MOVE DATE-STRT-P-CN   TO DATE-STRT-CN
                   MOVE TIME-STRT-P      TO TIME-STRT
                   MOVE DATE-COMP-P-CN   TO DATE-COMP-CN
                   MOVE TIME-COMP-P      TO TIME-COMP
                   MOVE DATE-SCHD        TO SCHED-DATE-SORT
                   PERFORM 70-GET-SD-SHIFT
               ELSE
               GO TO 70-SORT-DBGET.
           IF EQDN-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF EQDN-BUF = EQUIP-DOWN
               NEXT SENTENCE
           ELSE
           GO TO 70-SORT-DBGET.
           IF SUMM-SW-ON
               IF ZONE OF WO-BASIC-DATA NOT = ZONE-BUF
                   GO TO 70-SORT-DBGET.
           IF WO-STATUS = "CW"
               IF DATE-BUF = SPACES
                   NEXT SENTENCE
               ELSE
               IF ZONE OF WO-BASIC-DATA = ZONE-BUF
                   NEXT SENTENCE
               ELSE
               GO TO 70-SORT-DBGET.
           IF TIME-RECD = "    "
               MOVE ZEROS TO TIME-RECD.
           IF TIME-RECD-HH > 23
               MOVE 00 TO TIME-RECD-HH.
           IF TIME-STRT = "    "
               NEXT SENTENCE
           ELSE
           IF TIME-STRT-HH > 23
               MOVE 00 TO TIME-STRT-HH.
           IF TIME-COMP = "    "
               NEXT SENTENCE
           ELSE
           IF TIME-COMP-HH > 23
               MOVE 00 TO TIME-COMP-HH.
           IF WO-STATUS = "OO"
               MOVE DATE-RECD TO DATE-HOLD
               MOVE TIME-RECD TO TIME-HOLD
           ELSE
           IF WO-STATUS = "IP"
               MOVE DATE-STRT TO DATE-HOLD
               MOVE TIME-STRT TO TIME-HOLD
           ELSE
           IF WO-STATUS = "CW" OR "DW"
               MOVE DATE-COMP TO DATE-HOLD
               MOVE TIME-COMP TO TIME-HOLD
           ELSE
           MOVE "000000" TO DATE-HOLD
           MOVE "0000" TO TIME-HOLD.
           MOVE DATE-FLAG TO DATE-CODE.
           MOVE DATE-BUF TO DATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-OUT-MD TO DATE-WA-MM.
           MOVE DATE-OUT-DM TO DATE-WA-DD.
           MOVE DATE-OUT-YY TO DATE-WA-YY.
           IF DATE-WA NOT NUMERIC AND SHIFT-BUF NOT NUMERIC
               GO TO 70-SORT-DBGET-CONT.
      *********************************************************
      **   ADDED CHECK ON 4/23/98 AT NAPANEE'S REQUEST TO    **
      **   NOT RESTRICT 'OO' AND 'IP' STATUSES TO CURRENT    **
      **   DATE AND SHIFT IF AN 'SR' WAS REQUESTED.          **
      *********************************************************
           IF SUMM-SW-ON
               IF WO-STATUS = "OO" OR "IP"
                   GO TO 70-SORT-DBGET-CONT.
           IF SHIFT-BUF NOT NUMERIC
               MOVE 0 TO SHIFT-BUF.
           MOVE ZONE OF WO-BASIC-DATA TO LINK-ZONE.
           MOVE TIME-HOLD TO TIME-IN.
           CALL "TGETSHFT" USING SHIFT-DATA DBPARAMETERS.
           IF SHIFT-BUF = 1 OR 0
               IF S-1 < E-1
                   IF TIME-HOLD NOT < S-1 AND < E-1
                       IF DATE-HOLD = DATE-WA
                           GO TO 70-SORT-DBGET-CONT
                       ELSE
                       GO TO 70-SORT-DBGET
                   ELSE
                   IF SHIFT-BUF = 0
                       GO TO 70-SECOND-SHIFT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               MOVE S-1    TO TIME-WA-SAV1
               MOVE "2400" TO TIME-WA-SAV2
               MOVE "0000" TO TIME-WA-SAV3
               MOVE E-1    TO TIME-WA-SAV4
               PERFORM 70-SORT-GET-NEXT-GDATE THRU 70-SORT-GNG-EXIT
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV2
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD > DATE-TIME-WA-SAV3
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD = DATE-TIME-WA-SAV3
                   GO TO 70-SORT-DBGET-CONT
               ELSE
               IF SHIFT-BUF = 0
                   GO TO 70-SECOND-SHIFT
               ELSE
               GO TO 70-SORT-DBGET.

       70-SECOND-SHIFT.
           IF SHIFT-BUF = 2 OR 0
               IF S-2 < E-2
                   IF TIME-HOLD NOT < S-2 AND < E-2
                       IF DATE-HOLD = DATE-WA
                           GO TO 70-SORT-DBGET-CONT
                       ELSE
                       GO TO 70-SORT-DBGET
                   ELSE
                   IF SHIFT-BUF = 0
                       GO TO 70-THIRD-SHIFT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               MOVE S-2    TO TIME-WA-SAV1
               MOVE "2400" TO TIME-WA-SAV2
               MOVE "0000" TO TIME-WA-SAV3
               MOVE E-2    TO TIME-WA-SAV4
               PERFORM 70-SORT-GET-NEXT-GDATE THRU 70-SORT-GNG-EXIT
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV2
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD > DATE-TIME-WA-SAV3
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD = DATE-TIME-WA-SAV3
                   GO TO 70-SORT-DBGET-CONT
               ELSE
               IF SHIFT-BUF = 0
                   GO TO 70-THIRD-SHIFT
               ELSE
               GO TO 70-SORT-DBGET.

       70-THIRD-SHIFT.
           IF SHIFT-BUF = 3 OR 0
               IF S-3 < E-3
                   IF TIME-HOLD > S-3 AND < E-3
                       IF DATE-HOLD = DATE-WA
                           GO TO 70-SORT-DBGET-CONT
                       ELSE
                       GO TO 70-SORT-DBGET
                   ELSE
                   IF SHIFT-BUF = 0
                       GO TO 70-FOURTH-SHIFT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               MOVE S-3    TO TIME-WA-SAV1
               MOVE "2400" TO TIME-WA-SAV2
               MOVE "0000" TO TIME-WA-SAV3
               MOVE E-3    TO TIME-WA-SAV4
               PERFORM 70-SORT-GET-NEXT-GDATE THRU 70-SORT-GNG-EXIT
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV2
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD > DATE-TIME-WA-SAV3
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD = DATE-TIME-WA-SAV3
                   GO TO 70-SORT-DBGET-CONT
               ELSE
               IF SHIFT-BUF = 0
                   GO TO 70-FOURTH-SHIFT
               ELSE
               GO TO 70-SORT-DBGET.

       70-FOURTH-SHIFT.
           IF SHIFT-BUF = 4 OR 0
               IF S-4 < E-4
                   IF TIME-HOLD > S-4 AND < E-4
                       IF DATE-HOLD = DATE-WA
                           GO TO 70-SORT-DBGET-CONT
                       ELSE
                       GO TO 70-SORT-DBGET
                   ELSE
                   IF SHIFT-BUF = 0
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               MOVE S-4    TO TIME-WA-SAV1
               MOVE "2400" TO TIME-WA-SAV2
               MOVE "0000" TO TIME-WA-SAV3
               MOVE E-4    TO TIME-WA-SAV4
               PERFORM 70-SORT-GET-NEXT-GDATE THRU 70-SORT-GNG-EXIT
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD NOT < DATE-TIME-WA-SAV1
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV2
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD > DATE-TIME-WA-SAV3
                   IF DATE-TIME-HOLD < DATE-TIME-WA-SAV4
                       GO TO 70-SORT-DBGET-CONT
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               IF DATE-TIME-HOLD = DATE-TIME-WA-SAV3
                   GO TO 70-SORT-DBGET-CONT
               ELSE
               GO TO 70-SORT-DBGET.

       70-SORT-DBGET-CONT.
           MOVE DEPT OF WO-BASIC-DATA TO SORT-DEPT.
           MOVE ZONE-PRIORITY TO SORT-ZONE.
      *    IF PLANT-IDENT = "126 "
      *        MOVE ZONE-BUF TO ZONE-BUF1
      *    ELSE
           IF Z-BUF-1 = "A" AND Z-BUF-2 = " "
               MOVE "A1  " TO ZONE-BUF1
               MOVE "A2  " TO ZONE-BUF2
               MOVE "A3  " TO ZONE-BUF3
           ELSE
           IF Z-BUF-1 = "A" AND Z-BUF-2 = "A"
               MOVE "A1  " TO ZONE-BUF1
               MOVE "A2  " TO ZONE-BUF2
           ELSE
           IF Z-BUF-1 = "B" AND Z-BUF-2 = " "
               MOVE "B1  " TO ZONE-BUF1
               MOVE "B2  " TO ZONE-BUF2
               MOVE "B3  " TO ZONE-BUF3
           ELSE
           IF Z-BUF-1 = "B" AND Z-BUF-2 = "B"
               MOVE "B1  " TO ZONE-BUF1
               MOVE "B2  " TO ZONE-BUF2
           ELSE
           IF Z-BUF-1 = "B" AND Z-BUF-2 = "D"
               MOVE "B2  " TO ZONE-BUF1
               MOVE "B3  " TO ZONE-BUF2
           ELSE
           IF Z-BUF-1 = "B" AND Z-BUF-2 = "C"
               MOVE "B3  " TO ZONE-BUF1
               MOVE "C1  " TO ZONE-BUF2
               MOVE "C2  " TO ZONE-BUF3
           ELSE
           IF Z-BUF-1 = "C" AND Z-BUF-2 = " "
               MOVE "C1  " TO ZONE-BUF1
               MOVE "C2  " TO ZONE-BUF2
           ELSE
           IF Z-BUF-1 = "F" AND Z-BUF-2 = " "
               MOVE "F1  " TO ZONE-BUF1
               MOVE "F2  " TO ZONE-BUF2
               MOVE "F3  " TO ZONE-BUF3
               MOVE "F4  " TO ZONE-BUF4
           ELSE
           IF ZONE-BUF = "Z1  "
               MOVE "Z1  " TO ZONE-BUF1
               MOVE "Z1A " TO ZONE-BUF2
           ELSE
           MOVE ZONE-BUF TO ZONE-BUF1.
           IF ZONE-BUF1 = SPACES MOVE SORT-Z TO ZONE-BUF1.
           MOVE SHIFT-BUF TO SORT-SHIFT.
           MOVE WO-STATUS TO SORT-WOSTAT.
           MOVE WO-NUM TO SORT-WONUM.
           MOVE DESCRIPTION-1 TO SORT-WODESC.
           MOVE EQUIP-NUM TO SORT-EQNUM.
           MOVE EQUIP-DOWN TO SORT-EQDOWN.
           MOVE CRAFTS-REQD-1 TO SORT-C1.
           MOVE CRAFTS-REQD-2 TO SORT-C2.
           MOVE CRAFTS-REQD-3 TO SORT-C3.
           MOVE CRAFTSMEN-1 TO CMAN-1-SORT.
           MOVE CRAFTSMEN-2 TO CMAN-2-SORT.
           MOVE CRAFTSMEN-3 TO CMAN-3-SORT.
           IF ARG12 = "CW" OR "DW"
               MOVE TIME-COMP TO TIME-COMP-SORT
               PERFORM 70-SORT-CALC-COMP-TIMES THRU 70-SORT-CCT-EXIT
               MOVE DATE-COMP-YY TO SORT-DATE-RCVD-YY
               MOVE DATE-COMP-MM TO SORT-DATE-RCVD-MM
               MOVE DATE-COMP-DD TO SORT-DATE-RCVD-DD
           ELSE
           IF ARG12 = "OO"
               MOVE DATE-RECD-YY TO SORT-DATE-RCVD-YY
               MOVE DATE-RECD-MM TO SORT-DATE-RCVD-MM
               MOVE DATE-RECD-DD TO SORT-DATE-RCVD-DD
               MOVE TIME-RECD TO SORT-TIME-RCVD
           ELSE
           MOVE TIME-STRT TO TSTRT-SORT
           MOVE SPACES TO SORT-DATE-RCVD
           MOVE TIME-STRT TO SORT-TIME-RCVD
           IF CRAFTSMEN-2 = SPACES
               MOVE CRAFTSMEN-1 TO CMAN-1-SORT
           ELSE
           IF CRAFTSMEN-3 = SPACES
               MOVE CRAFTSMEN-2 TO CMAN-1-SORT
           ELSE
           MOVE CRAFTSMEN-3 TO CMAN-1-SORT.

           IF EQ1 = SORT-EQ1 OR SPACES
               IF EQ2 = SORT-EQ2 OR SPACES
                   IF EQ3 = SORT-EQ3 OR SPACES
                       IF EQ4 = SORT-EQ4 OR SPACES
                           IF EQ5 = SORT-EQ5 OR SPACES
                               IF EQ6 = SORT-EQ6 OR SPACES
                                   NEXT SENTENCE
                               ELSE
                               GO TO 70-SORT-DBGET
                           ELSE
                           GO TO 70-SORT-DBGET
                       ELSE
                       GO TO 70-SORT-DBGET
                   ELSE
                   GO TO 70-SORT-DBGET
               ELSE
               GO TO 70-SORT-DBGET
           ELSE
           GO TO 70-SORT-DBGET.

           IF CRAFT-BUF = SORT-C1 OR SORT-C2 OR SORT-C3 OR SPACES
             IF PRIORITY-BUF = "A" OR SORT-P
               IF DEPT-BUF = SORT-DEPT OR SPACES
                 IF SORT-Z = ZONE-BUF OR ZONE-BUF1 OR ZONE-BUF2 OR
                             ZONE-BUF3 OR ZONE-BUF4 OR SPACES
                   IF SHIFT-BUF = SORT-SHIFT OR SPACES
                     PERFORM 70-SORT-RELEASE-REC THRU 70-SORT-RR-EXIT
                     IF SORT-P = 1
                         ADD 1 TO PRTY1-K
                     ELSE
                     IF SORT-P = 2
                         ADD 1 TO PRTY2-K
                     ELSE
                     IF SORT-P = 3
                         ADD 1 TO PRTY3-K
                     ELSE
                     IF SORT-P = 4
                         ADD 1 TO PRTY4-K
                     ELSE
                     IF SORT-P = 5
                         ADD 1 TO PRTY5-K
                     ELSE
                     IF SORT-P = 6
                         ADD 1 TO PRTY6-K.

       70-SORT-DBGET-EXIT.    EXIT.

       70-GET-SD-SHIFT.
           IF TIME-SCHD = "    "
               NEXT SENTENCE
           ELSE
           MOVE TIME-SCHD TO TIME-IN
           MOVE ZONE OF WO-BASIC-DATA TO LINK-ZONE
           CALL "TGETSHFT" USING SHIFT-DATA DBPARAMETERS
           MOVE CURR-SHIFT TO SCHED-SHIFT-SORT.
           IF SCHED-DATE-SORT = SPACES
               MOVE SPACE TO SCHED-SHIFT-SORT.

       70-SORT-GET-NEXT-GDATE.
           MOVE 0 TO JUL-DAY-SAVE.
           MOVE DATE-WA TO GREG-YMD.
           MOVE SPACES  TO JULIAN-DATE.
           IF GREG-YY > "70"
               MOVE "19" TO GREG-CC
           ELSE
           MOVE "20"     TO GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE SPACES TO GREG-DATE.
           IF SUMM-SW-ON
             IF (S-1 > E-1) OR (S-2 > E-2) OR (S-3 > E-3)
               OR (S-4 > E-4)
                   IF CUR-TIME > TIME-WA-SAV1 AND < TIME-WA-SAV2
                       MOVE DATE-WA   TO DATE-WA-SAV1
                                         DATE-WA-SAV2
                       ADD 1          TO JULIAN-DATE-9
                       MOVE SPACES    TO GREG-DATE
                       CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                       DAY-DIGIT, LEAP-YEAR-FLAG
                       MOVE GREG-YY   TO DATE-WA-YY-2
                       MOVE GREG-MM   TO DATE-WA-MM-2
                       MOVE GREG-DD   TO DATE-WA-DD-2
                       MOVE DATE-WA-2 TO DATE-WA-SAV3
                                         DATE-WA-SAV4
                       GO TO 70-SORT-GNG-EXIT.
           SUBTRACT 1 FROM JULIAN-DATE-9.
           MOVE SPACES TO GREG-DATE.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE GREG-YY TO DATE-WA-YY-2.
           MOVE GREG-MM TO DATE-WA-MM-2.
           MOVE GREG-DD TO DATE-WA-DD-2.
           MOVE DATE-WA-2  TO DATE-WA-SAV1
                              DATE-WA-SAV2.
           MOVE DATE-WA    TO DATE-WA-SAV3
                              DATE-WA-SAV4.

       70-SORT-GNG-EXIT.    EXIT.

       70-SORT-CALC-COMP-TIMES.
           IF DATE-COMP = "      " OR TIME-COMP = "    "
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-CCT-EXIT.
           MOVE 0 TO JUL-DAY-SAVE.
           MOVE SPACES TO JULIAN-DATE.
           MOVE DATE-COMP TO GREG-YMD.
           IF GREG-YY > "70"
               MOVE "19"  TO GREG-CC
           ELSE
           MOVE "20"      TO GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG,
           MOVE JULIAN-DATE-9 TO JUL-DAY-COMP.
           IF DATE-STRT = "    " OR TIME-STRT = "    "
               NEXT SENTENCE
           ELSE
           IF ZEROS = DATE-STRT
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO JULIAN-DATE
           MOVE DATE-STRT TO GREG-YMD
           IF GREG-YY > "70"
               MOVE "19"  TO GREG-CC
               CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                                DAY-DIGIT, LEAP-YEAR-FLAG
               MOVE JULIAN-DATE-9 TO JUL-DAY-STRT
           ELSE
           MOVE "20"      TO GREG-CC
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG
           MOVE JULIAN-DATE-9 TO JUL-DAY-STRT.
           MOVE SPACES TO JULIAN-DATE.
           MOVE DATE-RECD TO GREG-YMD.
           IF GREG-YY > "70"
               MOVE "19" TO GREG-CC
           ELSE
           MOVE "20"     TO GREG-CC.
           CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE JULIAN-DATE-9 TO JUL-DAY-RECD.
           IF EQUIP-DOWN = "Y "
               PERFORM 70-SORT-RECD-COMP-CALC THRU 70-SORT-RCC-EXIT
           ELSE
           PERFORM 70-SORT-STRT-COMP-CALC THRU 70-SORT-SCC-EXIT.

       70-SORT-CCT-EXIT.    EXIT.

       70-SORT-RECD-COMP-CALC.
           MOVE 0 TO JUL-DAY-SAVE.
           IF DATE-RECD = "      " OR TIME-RECD = "    "
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-RCC-EXIT.
           IF ZEROS = DATE-RECD
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-RCC-EXIT.
           IF JUL-DAY-RECD > JUL-DAY-COMP
               ADD JUL-DAYS-LYR TO JUL-DAY-SAVE.
           IF JUL-DAY-RECD NOT = JUL-DAY-COMP
               ADD JUL-DAY-COMP TO JUL-DAY-SAVE
               SUBTRACT JUL-DAY-RECD FROM JUL-DAY-SAVE
               MULTIPLY 1440 BY JUL-DAY-SAVE.
           MULTIPLY 60 BY TIME-RECD-HH GIVING TRECD-MIN.
           ADD TIME-RECD-MM TO TRECD-MIN.
           MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
           ADD TIME-COMP-MM TO TCOMP-MIN.
           SUBTRACT TRECD-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
           ADD JUL-DAY-SAVE TO TSAVE-MIN.
           MOVE TSAVE-MIN TO SORT-TIME-RCVD.

       70-SORT-RCC-EXIT.    EXIT.

       70-SORT-STRT-COMP-CALC.
           MOVE 0 TO JUL-DAY-SAVE.
           IF DATE-STRT = "      " OR TIME-STRT = "    "
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-SCC-EXIT.
           IF ZEROS = DATE-STRT
               MOVE SPACES TO SORT-TIME-RCVD
               GO TO 70-SORT-SCC-EXIT.
           IF JUL-DAY-STRT > JUL-DAY-COMP
               ADD JUL-DAYS-LYR TO JUL-DAY-SAVE.
           IF JUL-DAY-STRT NOT = JUL-DAY-COMP
               ADD JUL-DAY-COMP TO JUL-DAY-SAVE
               SUBTRACT JUL-DAY-STRT FROM JUL-DAY-SAVE
               MULTIPLY 1440 BY JUL-DAY-SAVE.
           MULTIPLY 60 BY TIME-STRT-HH GIVING TSTRT-MIN.
           IF TIME-STRT-MM = SPACES MOVE ZEROES TO TIME-STRT-MM.
           ADD TIME-STRT-MM TO TSTRT-MIN.
           MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
           IF TIME-COMP-MM = SPACES MOVE ZEROES TO TIME-COMP-MM.
           ADD TIME-COMP-MM TO TCOMP-MIN.
           SUBTRACT TSTRT-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
           ADD JUL-DAY-SAVE TO TSAVE-MIN.
           MOVE TSAVE-MIN TO SORT-TIME-RCVD.

       70-SORT-SCC-EXIT.    EXIT.

       70-SORT-RELEASE-REC.
           IF ARG12 = "IP"
               PERFORM 70-IP-CHECK-LABOR
               MOVE 0 TO COND-WORD
               GO TO 70-SORT-RR-EXIT.
           IF ARG12 = "CW" OR "DW"
               NEXT SENTENCE
           ELSE
           RELEASE SORT-REC
           GO TO 70-SORT-RR-EXIT.
           MOVE 0 TO COND-WORD.
           MOVE 0 TO SUB.
           MOVE 1 TO RELEASE-FLAG.
           MOVE WO-NUM  TO WONUM OF WLFREC.
           START WO-LABOR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               IF SUB < 1
                   RELEASE SORT-REC
                   GO TO 70-SORT-RR-EXIT
               ELSE
               GO TO 70-SORT-RR-EXIT.
           MOVE SPACES TO LABOR-TAB.
           PERFORM 70-SORT-GET-REC THRU 70-SORT-GR-EXIT
                            UNTIL SUB > 9.
           MOVE 0 TO SUB.
           PERFORM 70-SORT-READ-TABLE THRU 70-SORT-RT-EXIT
                            UNTIL SUB > 9.

       70-SORT-RR-EXIT.    EXIT.

       70-IP-CHECK-LABOR.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM TO WONUM OF LCSFREC.
           MOVE SPACES TO CMAN-1-SORT.
           START LABOR-CURR-STAT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF LCSF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE SPACES TO CMAN-1-SORT
               MOVE SPACES TO TSTRT-SORT SORT-C1
               RELEASE SORT-REC
           ELSE
           PERFORM 70-IP-DBGET THRU 70-IP-DBG-EXIT
               UNTIL COND-WORD = 15.

       70-IP-DBGET.
           MOVE 0 TO COND-WORD.
           READ LABOR-CURR-STAT-FILE NEXT INTO LABOR-CURR-STAT
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = WONUM OF LCSFREC MOVE 15 TO COND-WORD.
           IF LCSF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               IF CMAN-1-SORT = SPACES
                   MOVE SPACES TO TSTRT-SORT SORT-C1
                   RELEASE SORT-REC
                   GO TO 70-IP-DBG-EXIT
               ELSE
               GO TO 70-IP-DBG-EXIT.
           MOVE LCS-EMPL-NUM TO CMAN-1-SORT.
           MOVE LCS-START-TIME TO TSTRT-SORT.
           PERFORM 70-IP-GET-CRAFT.
           RELEASE SORT-REC.

       70-IP-DBG-EXIT.    EXIT.

       70-IP-GET-CRAFT.
           MOVE 0 TO COND-WORD.
           MOVE LCS-EMPL-NUM TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 35049 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2 TO VIEW-LASTKEY
               GO TO 2-EOJ.
           READ PERSONNEL-FILE NEXT INTO PER-PERSONNEL-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           MOVE PER-CRAFT TO SORT-C1.

       70-SORT-GET-REC.
           ADD 1 TO SUB.
           MOVE 0 TO COND-WORD.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = LBR-WO-NUM MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               IF RELEASE-FLAG-UP
                   RELEASE SORT-REC
                   MOVE 10 TO SUB
                   MOVE 0 TO COND-WORD
                   GO TO 70-SORT-GR-EXIT
               ELSE
               MOVE 10 TO SUB
               MOVE 0 TO COND-WORD
               GO TO 70-SORT-GR-EXIT.
           IF DATE-WA = SPACES
               NEXT SENTENCE
           ELSE
           IF LBR-COMPL-DATE = DATE-WA-SAV1 OR DATE-WA-SAV2
                               OR DATE-WA
               NEXT SENTENCE
           ELSE
           SUBTRACT 1 FROM SUB
           GO TO 70-SORT-GR-EXIT.

           MOVE 0 TO RELEASE-FLAG.
           MOVE LBR-EMPL-NUM     TO  L-CC-BUF.
           MOVE LBR-CRAFT        TO  L-CRFT-BUF.
           MOVE LBR-START-TIME   TO  L-TSTRT-BUF.
           MOVE LBR-COMPL-TIME   TO  L-TCOMP-BUF.

           IF SHIFT-BUF = LBR-SHIFT-1
               MOVE LBR-HRS1 TO L-RETM-12
               MOVE "." TO L-RETM-DEC
               MOVE LBR-HRS2 TO L-RETM-4
           ELSE
           MOVE SPACES TO  L-RETM-BUF.
           IF L-RETM-1 = "0" MOVE SPACE TO L-RETM-1.

           MOVE LABOR-BUFFER     TO  LABOR-TABLE (SUB).

       70-SORT-GR-EXIT.    EXIT.

       70-SORT-READ-TABLE.
           ADD 1 TO SUB.
           MOVE LABOR-TABLE (SUB) TO LABOR-BUFFER.
           IF L-CC-BUF = SPACES
               MOVE 10 TO SUB
               GO TO 70-SORT-RT-EXIT.
           MOVE L-CC-BUF TO CMAN-1-SORT.
           MOVE L-CRFT-BUF TO SORT-C1.
           MOVE L-TSTRT-BUF TO TSTRT-SORT.
           MOVE L-TCOMP-BUF TO TIME-COMP-SORT.
           MOVE L-RETM-BUF TO RETM-SORT.

           RELEASE SORT-REC.

       70-SORT-RT-EXIT.    EXIT.

       8-SORT-WRITE-FILE.
           MOVE 0 TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           PERFORM 8-SWF-LOOP THRU 8-SWF-EXIT.

       8-SWF-LOOP.
           RETURN SORT-FILE AT END
               MOVE ACT-KEY TO RECS-WRITTEN-CTR
               GO TO 8-SWF-EXIT.
           MOVE SPACES TO OUT-REC.
           ADD 1 TO ACT-KEY.
           MOVE SORT-REC TO OUT-DATA.
           IF SORT-WOSTAT = "OO  "
               MOVE SORT-DATE-RCVD-YY TO DATE-RCVD-YY
               MOVE SORT-DATE-RCVD-MM TO DATE-RCVD-MM
               MOVE SORT-DATE-RCVD-DD TO DATE-RCVD-DD.
           WRITE OUT-REC INVALID KEY    GO TO 8-SWF-EXIT.
           GO TO 8-SWF-LOOP.

       8-SWF-EXIT.      EXIT.

