000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ3SUB.
000400*REMARKS.  ***  THIS IS THE EXECUTIVE PROGRAM FOR
000500*               THE EQUIPMENT REFERENCE FILE INQUIRY
000600*          ***  SUBROUTINES CALLED:
000700*                   TERINDEX
000800*                   TEQRFIDX
000900*                   TEQRFREF
001000*                   TEQRFREM
001100*                   TEQRFOPS
001200*                   TEQRFSPR
001300*                   TEQRFDRW
001400*                   ****.
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.   AS400.
001800 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001900 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
002000 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
002100 WORKING-STORAGE SECTION.
002200 77  ARG-NO                    PIC 9(9).
002300
       COPY CATREAD  OF COPYLIB.
       COPY CPYIND  IN COPYLIB.

002400 01  D-BASE.
002500     05  BASE1                 PIC X(24).
002600     05  BASE2                 PIC X(24).
002700     05  BASE3                 PIC X(24).
002800     05  BASE4                 PIC X(24).
002900
       01  DSPLY-STATUS              PIC XX.

003000 01  EQP-EQUIPMENT.         COPY MEQPFILE OF COPYLIB.
003100
003200 01  EQP-SUB-BUFFER.
003300     05  EQP-NUM-BUF           PIC X(06).
003400     05  SUB-SYS-BUF           PIC X(04).
003500     05  EQP-SUB-DESC          PIC X(40).
003600     05  EQP-TYPE-BUF          PIC X(08).
003700     05  EXEC-SW               PIC X(01).
           05  EQP-CMD-LINE          PIC X(79).
           05  EQP-ERR-LINE          PIC X(79).
003800
       01  ERROR-BUFFER              PIC X(80).

003900 01  EXECUTIVE-DATA.
004000     05  X-WO-NUM              PIC X(10).
004100     05  X-CC-NUM              PIC X(04).
004200     05  X-EQUIP-NUM           PIC X(06).
004300     05  X-PARTS.
004400         10  PART-1            PIC X(07).
004500         10  PART-2            PIC X(07).
004600         10  PART-3            PIC X(07).
004700         10  PART-4            PIC X(07).
004800         10  PART-5            PIC X(07).
004900         10  PART-6            PIC X(07).
005000         10  PART-7            PIC X(07).
005100         10  PART-8            PIC X(07).
005200
005300 01  FIELD-NUMBER              PIC S9(4) VALUE +1 COMP-4.

       01  FILE-STATUS.
           05  EF-STATUS             PIC XX.
005900
       COPY IOFEEDBACK IN COPYLIB.

006000 01  LAST-WO-BUFF.          COPY MLASTWO OF COPYLIB.
006100
007300 01  NEXT-FUNCTION  PIC S9(4) COMP-4 VALUE ZERO.
007400
007500 01  PASSWORD-INFORMATION.
007600     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ3SUB  ".
007700     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
007800     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
007900     05  PROGRAM-DESCRIPTION.
008000         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " PLANNER/ENGINEER".
                   15  FILLER      PIC X(17) VALUE " MODULE EQUIPMENT".
                   15  FILLER      PIC X(16) VALUE " REFERENCE FILE ".
                   15  FILLER      PIC X(10) VALUE "INQUIRY EX".
008200         10  PROG-DESC-B.
                   15  FILLER      PIC X(15) VALUE "ECUTIVE PROGRAM".
                   15  FILLER      PIC X(45) VALUE SPACES.
008400         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
008600     05  PASSWORD-FLAG       PIC X.
008700
       COPY DBSTAT OF COPYLIB.
008900
009000 01  TEMP-BUFFER.
009100     05  DESC-BUFFER           PIC X(40).
009200     05  FILLER                PIC X(10).
009300
       COPY WSCONTROL IN COPYLIB.
009400 LINKAGE SECTION.
010100 01  DBPARAMETERS.          COPY DBPARMS OF COPYLIB.
010400 01  ERROR-SWITCH              PIC S9(4) COMP-4.
       COPY VCOMLINK OF COPYLIB.
010600 PROCEDURE DIVISION USING DBPARAMETERS
011000                          ERROR-SWITCH
                                VIEW-COMAREA.
011200 BEGIN.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT EQUIPMENT-FILE.
011400     MOVE SPACES TO EXECUTIVE-DATA.
011500     CALL "TPWORD" USING PASSWORD-INFORMATION.
011900     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
017100     MOVE SPACES TO EQP-SUB-BUFFER.
016800 6-MAIN.
016900     MOVE "FEQPREFQ" TO VIEW-CFNAME.
017200     IF X-EQUIP-NUM NOT = SPACES
017300         MOVE X-EQUIP-NUM TO EQP-NUM-BUF.
           MOVE EQP-SUB-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO EQP-SUB-BUFFER.
017400     MOVE "Y" TO EXEC-SW.
           MOVE SPACES TO ERROR-BUFFER.
020300     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
019200     IF VIEW-LASTKEY = 1
019300         CALL "TERINDEX" USING DBPARAMETERS
019500                               D-BASE
019700                               EQP-SUB-BUFFER
019900         IF VIEW-LASTKEY = 3
020000             GO TO 2-EOJ
020100         ELSE
020200         GO TO 6-MAIN.
020500     MOVE VIEW-LASTKEY TO NEXT-FUNCTION.
020600     IF VIEW-LASTKEY = 0
020700         MOVE 42017 TO CATREAD-MSG-NUMBER
020900**MESSAGE******************************************************
021000** PRESS APPROPRIATE FUNCTION KEY TO CONTINUE                **
021100***************************************************************
021200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO EQP-SUB-DESC
021500         GO TO 6-MAIN.
023000
023100 61-GET-DESCRIPTION.
           MOVE 0 TO COND-WORD.
023200     MOVE EQP-NUM-BUF TO EQPNUM OF EFREC.
           START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 0
               READ EQUIPMENT-FILE NEXT INTO EQP-EQUIPMENT
                   AT END    MOVE 15 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
023500     IF COND-WORD = 0
023600         MOVE EQP-TYPE TO EQP-TYPE-BUF
023700         MOVE EQP-EQUIP-NAME TO TEMP-BUFFER
023800         MOVE DESC-BUFFER    TO EQP-SUB-DESC
023900     ELSE
024000     MOVE ZEROS TO EQP-TYPE-BUF
024100     MOVE 30052 TO CATREAD-MSG-NUMBER
024300**MESSAGE******************************************************
024400** DEVICE NOT IN EQUIPMENT FILE                              **
024500***************************************************************
024600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024700     MOVE ERROR-BUFFER TO EQP-SUB-DESC
           GO TO 6-MAIN.
024800     IF SUB-SYS-BUF = SPACES
024900         MOVE 2 TO NEXT-FUNCTION.
025000
025100 61-FUNCTION-KEY-SELECTION.
025200     IF NEXT-FUNCTION = 1 GO TO 6-MAIN.
025400     IF NEXT-FUNCTION = 2
025500         CALL "TEQRFIDX" USING DBPARAMETERS
025700                               D-BASE
025900                               EQP-SUB-BUFFER
026100         IF VIEW-LASTKEY = 3
026200             GO TO 2-EOJ
026300         ELSE
026400         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
026500         GO TO 61-FUNCTION-KEY-SELECTION.
026600     IF NEXT-FUNCTION = 3
026700         CALL "TEQRFREF" USING DBPARAMETERS
026900                               D-BASE
027100                               EQP-SUB-BUFFER
027300         IF VIEW-LASTKEY = 3
027400             GO TO 2-EOJ
027500         ELSE
027600         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
027700         GO TO 61-FUNCTION-KEY-SELECTION.
027800     IF NEXT-FUNCTION = 4
027900         CALL "TEQRFREM" USING DBPARAMETERS
028100                               D-BASE
028300                               EQP-SUB-BUFFER
028500         IF VIEW-LASTKEY = 3
028600             GO TO 2-EOJ
028700         ELSE
028800         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
028900         GO TO 61-FUNCTION-KEY-SELECTION.
029000     IF NEXT-FUNCTION = 5
029100         CALL "TEQRFSPR" USING DBPARAMETERS
029400                               D-BASE
029600                               EQP-SUB-BUFFER
029700                               EXECUTIVE-DATA
029900         IF VIEW-LASTKEY = 3
030000             GO TO 2-EOJ
030100         ELSE
030200         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
030300         GO TO 61-FUNCTION-KEY-SELECTION.
030400     IF NEXT-FUNCTION = 6
030500         CALL "TEQRFOPS" USING DBPARAMETERS
030700                               D-BASE
030900                               EQP-SUB-BUFFER
031100         IF VIEW-LASTKEY = 3
031200             GO TO 2-EOJ
031300         ELSE
031400         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
031500         GO TO 61-FUNCTION-KEY-SELECTION.
031600     IF NEXT-FUNCTION = 7
031700         CALL "TEQRFDRW" USING DBPARAMETERS
031900                               D-BASE
032100                               EQP-SUB-BUFFER
032300         IF VIEW-LASTKEY = 3
032400             GO TO 2-EOJ
032500         ELSE
032600         MOVE VIEW-LASTKEY TO NEXT-FUNCTION
032700         GO TO 61-FUNCTION-KEY-SELECTION.
032800     GO TO 6-MAIN.
032900
033000 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE EQUIPMENT-FILE.
033100     GOBACK.
033200
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

033300 999-CATREAD.
033400     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
034400 999-CATREAD-EXIT.    EXIT.
