000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ5SUB.
000700*REMARKS.   THIS PROGRAM DISPLAYS THE DATA OF THE LOCAL EQUIPMENT
000800*           NUMBER IN THE EQUIPMENT FILE.
      *C
      *C 06/03/92  BK DISMUKES  REQUEST 6193
      *C    1. ADDED LOGIC TO DISPLAY SAFETY EQUIPMENT FLAG  AND
      *C       EQUIPMENT DOWN COST IN 6512-DISP-DATA-ON-SCREEN.
      *C
000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SOURCE-COMPUTER.    AS400.
001200 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001300 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
001400 DATA DIVISION.
001500 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
001600 WORKING-STORAGE SECTION.
001700 77  FST-SW                       PIC 9 VALUE 0.
002000 01  ARG-NO                       PIC 9(9).
002100 01  BU-DISPLAY-AREA.
002200     05  FILLER                   PIC XX.
002300     05  BU-DISPLAY-MSG           PIC X(27).
002400     05  FILLER                   PIC XX.
002500     05  BU-DISPLAY-STAT          PIC S9(4).
002600     05  FILLER                   PIC XX.
002700     05  BU-DISPLAY-FLD           PIC X(14).
002800     05  FILLER                   PIC XX.
002900 01  BUFFER.
003000     05  INPUT-EQUIP-NUM          PIC X(6).
           05  INPUT-CMD-LINE           PIC X(79).
           05  INPUT-ERR-LINE           PIC X(79).
       COPY CPYIND  IN COPYLIB.
004000 01  COUNTERS.
004100     05  REC-CNT                  PIC S9(4) COMP-4.
       COPY TDATESUB OF COPYLIB.
       01  ED-BUFFER.
           05  ED-DATE                  PIC X(8).
           05  ED-TIME.
               10  ED-HRS               PIC XX.
               10  ED-COLON             PIC X.
               10  ED-MINS              PIC XX.
           05  ED-DATA                  PIC X(147).
           05  ED-CMD-LINE              PIC X(79).
           05  ED-ERR-LINE              PIC X(79).
004300 01  EQUIPMENT-DATA.     COPY MEQPFILE OF COPYLIB.
004400 01  ERROR-BUFFER.
004500     05  ERR-BUF.
004600         10  FILLER               PIC X(61).
004700         10  ERR-BUFF2            PIC ----9.
004800         10  FILLER               PIC X(54).
004900 01  ERROR-LITERAL.
005000     05  FILLER                   PIC X(32)
005100       VALUE "UNABLE TO FIND EQUIPMENT NUMBER ".
005200     05  EQUIP-1-10               PIC X(6) VALUE SPACES.
005300     05  FILLER                   PIC X(42) VALUE SPACES.
       01  FILE-STATUSES.
           05  DSPLY-STATUS             PIC XX.
           05  EF-STATUS                PIC XX.
           05  WLNU-STATUS              PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
005500 01  LAST-WO-BUFF.       COPY MLASTWO OF COPYLIB.
005600 01  OUTPUT-AREA.
005700     05  ERRCODE-60-W             PIC -9999.
005800 01  PASSED-SPOOL-PRT             PIC S9(2) VALUE ZERO  COMP.
005900 01  PASSWORD-INFORMATION.
006000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ5SUB  ".
006100     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
006200     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
006300     05  PROGRAM-DESCRIPTION.
006400         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " PLANNER/ENGINEER".
                   15  FILLER      PIC X(16) VALUE " MODULE INQUIRY ".
                   15  FILLER      PIC X(17) VALUE "PROGRAM FOR LOCAL".
                   15  FILLER      PIC X(10) VALUE " EQUIPMENT".
006600         10  PROG-DESC-B.
                   15  FILLER      PIC X(17) VALUE " NUMBER INFORMATI".
                   15  FILLER      PIC X(43) VALUE "ON      ".
006800         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
007000     05  PASSWORD-FLAG       PIC X.
007100 01  RETURN-CODE.
007200     05  RET-CODE                 PIC X.
007300     05  FILLER                   PIC X.
007400 01  RETURN-CODE-2.
007500     05  RET-CODE-2               PIC XX.
007600 01  SCREEN-PRINT-PARMS.
007700     05  PRINTCNTL                PIC S9(4) VALUE ZERO  COMP.
007800     05  PAGECNTL                 PIC S9(4) VALUE 49    COMP.
007900     05  SPOOLFIL-OPEN-SW         PIC X   VALUE "N".
       COPY DBSTAT OF COPYLIB.
008100 01  SWITCHES.
008200     05  RETURN-SW                PIC X.
008300     05  RETURN-SW-2              PIC X.
008400 01  TMP-DATE-AREA.
008500     05  TMP-DATE-AREA-1          PIC X(8).
008600 01  TMP-TIME-AREA.
           05  TMP-TIME.
008700         10  TMP-HRS              PIC XX.
008800         10  TMP-MINS             PIC XX.
008900     05  TTA-SEC                  PIC XX.
       01  TRUE-VAL                     PIC 1 VALUE B"1".
       COPY WSCONTROL IN COPYLIB.
009000 LINKAGE SECTION.
009700 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
010000 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
010100                      CATREAD-PARMS.
010200 BEGIN.
010300     PERFORM 1-HSK.
010400     PERFORM 6-MAIN UNTIL RETURN-SW = "2".
010500 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE EQUIPMENT-FILE.
           CLOSE WO-LAST-NUM-USED.
010600     GOBACK.
010700****************************************************************
010800*    HOUSEKEEPING                                              *
010900****************************************************************
011000 1-HSK.
011100     MOVE "0" TO RETURN-SW.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           MOVE 0 TO COND-WORD.
011300     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
011600     MOVE DATE-FLAG-SW TO DATE-FLAG.
011700     CALL "TPWORD" USING PASSWORD-INFORMATION.
012100     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
012200 6-MAIN.
012300     MOVE "0" TO RETURN-SW.
013200     PERFORM 60-GET-EQUIP-NUM THRU 60-GET-EQUIP-NUM-X
013300         UNTIL RETURN-SW = "1".
013400     MOVE "0" TO RETURN-SW.
013500     PERFORM 61-DISPLAY-CONTROL
013600         UNTIL RETURN-SW = "1" OR "2".
013700****************************************************************
013800*    GET THE EQUIPMENT NUMBER AND CHECK IT                     *
013900****************************************************************
014000 60-GET-EQUIP-NUM.
015100     MOVE SPACES TO BUFFER.
           MOVE BUFFER TO DSPLY-REC.
           MOVE "FLISTEQ1" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO BUFFER.
016600     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
017200     IF INPUT-EQUIP-NUM = "END   " OR "E     " GO TO 2-EOJ.
017300*
017400*    CHECK IF EQUIPMENT NUMBER IN DATABASE-MMISA
017500*
           MOVE 0 TO COND-WORD.
018500     MOVE INPUT-EQUIP-NUM TO EQPNUM OF EFREC.
018600     START EQUIPMENT-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
018700         INVALID KEY    MOVE 17 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
018800     IF COND-WORD = 17
019000         MOVE INPUT-EQUIP-NUM TO EQUIP-1-10
019100         MOVE ERROR-LITERAL TO ERROR-BUFFER
019200         MOVE TRUE-VAL TO INDS (1) INDS (99)
019400         MOVE "0" TO RETURN-SW
019500         MOVE "1" TO RETURN-CODE
               GO TO 60-GET-EQUIP-NUM.
           READ EQUIPMENT-FILE NEXT INTO EQUIPMENT-DATA
               AT END    MOVE 17 TO COND-WORD.
020500     MOVE 1 TO REC-CNT.
020600     MOVE "0" TO RETURN-CODE.
020800     MOVE "1" TO RETURN-SW.
       60-GET-EQUIP-NUM-X.    EXIT.
020900*****************************************************************
021000*    LOGIC CONTROL OF DISPLAY                                   *
021100*****************************************************************
021200 61-DISPLAY-CONTROL.
023500     MOVE SPACES TO DSPLY-REC.
023700     MOVE "FLISTEQ2" TO VIEW-CFNAME.
024600     ACCEPT TMP-TIME-AREA FROM TIME.
           MOVE TMP-HRS TO ED-HRS.
           MOVE ":" TO ED-COLON.
           MOVE TMP-MINS TO ED-MINS.
024700     MOVE 1 TO DATE-MODE.
024800     MOVE DATE-FLAG TO DATE-CODE.
024900     CALL "TDATECHK" USING DATE-CHECK-AREA.
025000     MOVE DATE-SLASH-OUT TO ED-DATE.
           MOVE EQUIPMENT-DATA TO ED-DATA.
           MOVE SPACES TO ED-CMD-LINE.
           MOVE 66119 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO ED-ERR-LINE.
           MOVE ED-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
026100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
027600     MOVE "1" TO RETURN-SW.
027700     MOVE "1" TO RETURN-SW-2.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
