000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TQ6SUB.
000600*REMARKS.        THIS PROGRAM SORTS AND PRODUCES A REPORT BY MAIN-
000700*                TENANCE-ZONE OF ALL 'OO' STATUS WORK-ORDERS  INI-
000800*                TIATED BUT NOT STARTED  WITHIN 24 HRS, ALL  'IP'
000900*                STATUS WORK-ORDERS STARTED BUT NOT COMPLETED  WI-
001000*                THIN 24 HRS AND ALL 'H ' STATUS WORK-ORDERS  (HA,
001100*                HL,HM,HS) NOT RELEASED WITHIN 24 HRS; THEIR PRIO-
001200*                RITY NUMBER, WORK-ORDER NUMBER, DESCRIPTION, STA-
001300*                TUS DATE AND TIME.
      *C
      *C  SEPTEMBER 1996  JE COFFMAN  REQ# 6619
      *C               EXPANDED THE DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.    AS400.
002400 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
002600 INPUT-OUTPUT SECTION.
002700 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
002900     SELECT IL-FILE
               ASSIGN TO DATABASE-ILFILE
               ORGANIZATION IS RELATIVE
003000         ACCESS MODE IS RANDOM
003100         RELATIVE KEY IS IL-KEY
               FILE STATUS IS IL-STATUS.
003500     SELECT OUT-FILE
               ASSIGN TO DATABASE-OUTFILQ6
               ORGANIZATION IS RELATIVE
003600         ACCESS MODE IS RANDOM
003700         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
003200     SELECT SM-FILE
               ASSIGN TO DATABASE-SMFILE
               ORGANIZATION IS RELATIVE
003300         ACCESS MODE IS RANDOM
003400         RELATIVE KEY IS SM-KEY
               FILE STATUS IS SM-STATUS.
002800     SELECT SORT-FILE
               ASSIGN TO DISK-SORT.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
003900 DATA DIVISION.
004000 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
004100 FD  IL-FILE
004200     RECORD CONTAINS 66 CHARACTERS
004300     DATA RECORD IS ILF.
004400 01  ILF.
           02  IL-DATA.
004500         03  IL-IDENT            PIC X.
004600         03  FILLER              PIC X.
004700         03  IL-ZONE             PIC X(4).
004800         03  IL-WO-STATUS        PIC XX.
004900         03  IL-PRIORITY         PIC XX.
005000         03  IL-EQP-NUM          PIC X(6).
005100         03  IL-WO-NUM           PIC X(10).
005200         03  IL-DESC1            PIC X(30).
005300         03  IL-YY               PIC XX.
005400         03  IL-MD               PIC XX.
005500         03  IL-DM               PIC XX.
005600         03  IL-HR               PIC XX.
005700         03  IL-MI               PIC XX.
005800
010000 FD  OUT-FILE
010100     RECORD CONTAINS 66 CHARACTERS
010200     LABEL RECORDS ARE OMITTED
010300     DATA RECORD IS OUT-REC.
010400 01  OUT-REC.
           02  OUT-DATA.
010500         03  OUT-ID.
010600             05  OUT-CRAFT-IL    PIC X.
010700             05  FILLER          PIC X.
010800         03  OUT-ZONE            PIC X(4).
010900         03  OUT-WO-STATUS       PIC XX.
011000         03  OUT-PRIORITY        PIC XX.
011100         03  OUT-EQP-NUM         PIC X(6).
011200         03  OUT-WO-NUM          PIC X(10).
011300         03  OUT-DESC1           PIC X(30).
011400         03  OUT-YY              PIC XX.
011500         03  OUT-MD              PIC XX.
011600         03  OUT-DM              PIC XX.
011700         03  OUT-HR              PIC XX.
011800         03  OUT-MI              PIC XX.
011900
005900 FD  SM-FILE
006000     RECORD CONTAINS 66 CHARACTERS
006100     DATA RECORD IS SMF.
006200 01  SMF.
           02  SM-DATA.
006300         03  SM-IDENT            PIC X.
006400         03  FILLER              PIC X.
006500         03  SM-ZONE             PIC X(4).
006600         03  SM-WO-STATUS        PIC XX.
006700         03  SM-PRIORITY         PIC XX.
006800         03  SM-EQP-NUM          PIC X(6).
006900         03  SM-WO-NUM           PIC X(10).
007000         03  SM-DESC1            PIC X(30).
007100         03  SM-YY               PIC XX.
007200         03  SM-MD               PIC XX.
007300         03  SM-DM               PIC XX.
007400         03  SM-HR               PIC XX.
007500         03  SM-MI               PIC XX.
007600
007700 SD  SORT-FILE   RECORD CONTAINS 66 CHARACTERS
007800                 DATA RECORD IS SRT-REC.
007900 01  SRT-REC.
008000     03  SRT-PRT0.
008100         05  SRT-CRAFT-IL        PIC X.
008200         05  FILLER              PIC X.
008300     03  SRT-PRT1.
008400         05  SRT-ZONE            PIC X(4).
008500     03  SRT-PRT2.
008600         05  SRT-WO-STATUS       PIC X(2).
008700     03  SRT-PRT3.
008800         05  SRT-PRIORITY        PIC X(2).
008900         05  SRT-EQP-NUM         PIC X(6).
009000         05  SRT-WO-NUM          PIC X(10).
009100     03  SRT-PRT4.
009200         05  SRT-DESC1           PIC X(30).
009300     03  SRT-PRT5.
009400         05  SRT-YY              PIC XX.
009500         05  SRT-MD              PIC XX.
009600         05  SRT-DM              PIC XX.
009700         05  SRT-HR              PIC XX.
009800         05  SRT-MI              PIC XX.
009900
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

012000 WORKING-STORAGE SECTION.
012200 77  ACT-KEY                     PIC 9(9).
       77  ACT-KEY-2                   PIC 9(9).
012500 77  FST-SW                      PIC 9 VALUE 0.
       77  IL-KEY                      PIC 9(9).
012600 77  IL-KEY-WA                   PIC 9(9).
012700 77  IL-SW                       PIC 9       VALUE 0.
012800 77  JUL-DAY-LYR                 PIC 9(4)    VALUE ZEROES.
013000 77  PREV-MAINT-ZONE             PIC X(4)    VALUE LOW-VALUES.
013100 77  PREV-WO-STATUS              PIC X(2)    VALUE LOW-VALUES.
013200 77  PRT-COMP                    PIC 99.
013300 77  RECD-NO                     PIC 9(9).
013400 77  RT-VAR                      PIC X(4) VALUE SPACES.
013500 77  SAVE-ZONE                   PIC X(4)    VALUE SPACES.
       77  SM-KEY                      PIC 9(9).
013600 77  SM-KEY-WA                   PIC 9(9).
013700 77  SM-SW                       PIC 9       VALUE 0.
013800 77  SUB                         PIC 99.
013900
       01  ARG-BUFF                    PIC XX.

014000 01  ARG-NO                      PIC 9(9).
014100
014200 01  BUFFER.
014300     03  BUFF-DATA               PIC X(80)   VALUE SPACES.
014400
019600 01  BU-DISPLAY-AREA.
019700     05  FILLER                  PIC XX.
019800     05  BU-DISPLAY-MSG          PIC X(27).
019900     05  FILLER                  PIC XX.
020000     05  BU-DISPLAY-STAT         PIC S9(4).
020100     05  FILLER                  PIC XX.
020200     05  BU-DISPLAY-FLD          PIC X(14).
020300     05  FILLER                  PIC XX.
020400
       COPY CPYIND  IN COPYLIB.

020500 01  CURDATE-BUFF.
021000     03  CUR-YY-BUFF             PIC 99      VALUE ZEROES.
020600     03  CUR-MD-BUFF             PIC 99      VALUE ZEROES.
020800     03  CUR-DM-BUFF             PIC 99      VALUE ZEROES.
021100
021200 01  CURRENT-TIME-BUFF.
021300     03  CUR-TIME.
021400         05  CUR-HR              PIC 99      VALUE ZEROES.
021500         05  CUR-MI              PIC 99      VALUE ZEROES.
021600     03  FIL                     PIC XX      VALUE SPACES.
021700
       COPY TDATESUB OF COPYLIB.
021900
022000 01  DATE-TIME-BUFFER-CN.
           05  CC-BUFF                 PIC X(2)    VALUE SPACES.
           05  DATE-TIME-BUFFER.
022100         10  YY-BUFF             PIC X(2)    VALUE SPACES.
022200         10  MM-BUFF             PIC X(2)    VALUE SPACES.
022300         10  DD-BUFF             PIC X(2)    VALUE SPACES.
022400         10  HR-BUFF             PIC X(2)    VALUE SPACES.
022500         10  MI-BUFF             PIC X(2)    VALUE SPACES.
022600
       01  DAY-DIGIT                   PIC X.

023200 01  DISPLAY-AREA.
023300     03  FIL                     PIC XX      VALUE "**".
023400     03  DISPLAY-MSG             PIC X(27)   VALUE SPACES.
023500     03  FIL                     PIC XX      VALUE "**".
023600     03  DISPLAY-STAT            PIC S9(4)   VALUE ZEROES.
023700     03  FIL                     PIC XX      VALUE "**".
023800
024100 01  DTL-LINES.
024200     05  DTL-ZONE                PIC X(4).
024300     05  DTLS OCCURS 16 TIMES.
024400         10  DTL-STATUS          PIC XX.
024500         10  DTL-PRIORITY        PIC X.
024600         10  DTL-EQPNO           PIC X(6).
024700         10  DTL-WO              PIC X(10).
024800         10  DTL-DESC            PIC X(30).
024900         10  DTL-DATE.
025000             15  DTL-MD          PIC XX.
025100             15  DTL-DM          PIC XX.
025200             15  DTL-YY          PIC XX.
025300         10  DTL-TIME.
025400             15  DTL-HR          PIC XX.
025500             15  DTL-MI          PIC XX.
025600     05  DTL-MESSAGE             PIC X(79).
           05  DTL-CMD-LINE            PIC X(79).
           05  DTL-MSG-LINE            PIC X(79).
025700
       01  ERROR-BUFFER                PIC X(80).

       01  FILE-STATUSES.
           05  DSPLY-STATUS            PIC XX.
           05  IL-STATUS               PIC XX.
           05  SM-STATUS               PIC XX.
           05  OF-STATUS               PIC XX.
           05  WBF-STATUS              PIC XX.
           05  WLNU-STATUS             PIC XX.

       01  GREG-DATE.
           05  GREG-CC                 PIC XX.
           05  GREG-YMD.
               10  GREG-YY             PIC XX.
               10  GREG-MM             PIC XX.
               10  GREG-DD             PIC XX.

       COPY IOFEEDBACK IN COPYLIB.

       COPY JCWAREA OF COPYLIB.

       01  JULIAN-DATE                 PIC X(7).
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).

029600 01  LAST-WO-BUFF.        COPY MLASTWO OF COPYLIB.
029700
       01  LEAP-YEAR-FLAG              PIC X.

029800 01  L24HR-DATE-TIME-CHECK-CN.
           05  CC-L24HR.
               10  CC-L24HR-9          PIC 99      VALUE ZEROES.
           05  L24HR-DATE-TIME-CHECK.
029900         10  YY-L24HR.
030000             15  YY-L24HR-9      PIC 99      VALUE ZEROES.
030100         10  MM-L24HR.
030200             15  MM-L24HR-9      PIC 99      VALUE ZEROES.
030300         10  DD-L24HR.
030400             15  DD-L24HR-9      PIC 99      VALUE ZEROES.
030500         10  TIME-L24HR.
030600             15  TIME-L24HR-9    PIC 9(4)    VALUE ZEROES.
030700
030800 01  PASSED-SPOOL-PRT            PIC S9(2) VALUE ZERO  COMP.
030900 01  PASSWORD-INFORMATION.
031000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ6SUB  ".
031100     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
031200     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
031300     05  PROGRAM-DESCRIPTION.
031400         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " PLANNER/ENGINEER".
                   15  FILLER      PIC X(16) VALUE " MODULE INQUIRY ".
                   15  FILLER      PIC X(16) VALUE "TO LOCATE W/O'S ".
                   15  FILLER      PIC X(11) VALUE "THAT HAVE N".
031600         10  PROG-DESC-B.
                   15  FILLER      PIC X(17) VALUE "OT CHANGED STATUS".
                   15  FILLER      PIC X(16) VALUE " IN THE LAST 24 ".
                   15  FILLER      PIC X(27) VALUE "HOURS    ".
031800         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
032000     05  PASSWORD-FLAG       PIC X.
032100
032600**************************************************************
032700*                                                            *
032800*    MESSAGES AND SWITCHES AREA.                             *
032900*                                                            *
033000**************************************************************
033100
033600 01  PROGRAM-SWITCHES.
033700     03  END-OF-INPUT-FILE       PIC X       VALUE "N".
033800         88  ALL-INPUT-REC-ARE-PROCESSED     VALUE "Y".
033900     03  END-OF-OUTPUT-FILE      PIC X       VALUE "N".
034000         88  ALL-OUTPUT-REC-ARE-PROCESSED    VALUE "Y".
034100     03  BLOWUP-SWITCH           PIC X       VALUE "N".
034200
034300 01  RETURN-CODE.
034400     02  RET-CODE                PIC XX.
034500
034600 01  SCREEN-BUFF.
034700     05  ZONE-BUFF-S             PIC XXXX.
034800     05  CRAFT-BUFF-S            PIC XX.
034900     05  STATUS-BUFF-S           PIC XX.
035000     05  PRTY-BUFF-S             PIC X.
035100     05  PRINT-BUF               PIC X.
           05  SCREEN-CMD-LINE         PIC X(79).
           05  SCREEN-ERR-LINE         PIC X(79).
035200
035300 01  SCREEN-PRINT-PARMS.
035400     05  PRINTCNTL               PIC S9(4) VALUE ZERO  COMP.
035500     05  PAGECNTL                PIC S9(4) VALUE 49    COMP.
035600     05  SPOOLFIL-OPEN-SW        PIC X   VALUE "N".
035700
035800**************************************************************
035900*                                                            *
036000*    STATUS, CALL, AND DISPLAY AREA.                         *
036100*                                                            *
036200**************************************************************
       COPY DBSTAT OF COPYLIB.
036400
       01  WHO-PARMS.
           05  USERNAME.
               10  USERNAME-1-3        PIC XXX.
               10  FILLER              PIC X(7).
           05  TERMNUM                 PIC X(10).
           05  CURRLIB                 PIC X(10).

       01  WO-BASIC-DATA.        COPY DWOBASIC OF COPYLIB.

       COPY WSCONTROL IN COPYLIB.

038400 01  ZONE-KEY.
038500     03  ZONE-KEY-1              PIC X.
038600     03  ZONE-KEY-2-4            PIC XXX.
038900
039000 01  ZONPRT-BUFF.
039100     05  ZONPRT-ZONE             PIC X(4).
039200     05  ZONPRT-PRTR             PIC 99.
039300
039400 LINKAGE SECTION.
040100 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
040400
040500 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
040600                      CATREAD-PARMS.
       START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
061800 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
063200     GOBACK.
       1-HSK.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT WO-BASIC-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
040900     CALL "TPWORD" USING PASSWORD-INFORMATION.
041300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
041400     ACCEPT CURDATE-BUFF FROM DATE.
041500     ACCEPT CURRENT-TIME-BUFF FROM TIME.
041600     MOVE SPACES TO SCREEN-BUFF.
           MOVE 0 TO COND-WORD.
041800     MOVE 1 TO ARG-NO.
041900     READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
042000         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
042100     MOVE DATE-FLAG-SW TO DATE-FLAG.
042200     MOVE 1 TO DATE-MODE.
042300     MOVE DATE-FLAG TO DATE-CODE.
042400     CALL "TDATECHK" USING DATE-CHECK-AREA.
042500     MOVE DATE-DB TO CURDATE-BUFF.
042700**************************************************************
042800*                                                            *
042900*    TEST TO FIND THE LAST JULIAN DAY OF THE PRECEEDING      *
043000*    YEAR. THE RESULT OF JUL-DAY-LYR WILL NOT NESCESSARY     *
043100*    BE 365.                                                 *
043200*                                                            *
043300**************************************************************
043400     MOVE 12             TO GREG-MM.
043500     MOVE 31             TO GREG-DD.
043600     MOVE CUR-YY-BUFF    TO GREG-YY.
           MOVE SPACES         TO JULIAN-DATE.
           IF GREG-YY > "70"
               MOVE "19"       TO GREG-CC
           ELSE
           MOVE "20"           TO GREG-CC.
043900     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
044000     MOVE JULIAN-DATE-9  TO JUL-DAY-LYR.
044100**************************************************************
044200*                                                            *
044300*    THE FOLLOWING 18 LINES IS A TEST TO DETERMINE LAST      *
044400*    24 HR. CHECK EITHER DURING THE YEAR OR AT 1ST OF        *
044500*    JANUARY.                                                *
044600*                                                            *
044700**************************************************************
044800*    IF DATE-FLAG = 3
044900*        MOVE CUR-MD-BUFF TO GREG-DD
045000*        MOVE CUR-DM-BUFF TO GREG-MM
045100*        MOVE CUR-YY-BUFF TO GREG-YY
045200*    ELSE
045300     MOVE CUR-MD-BUFF     TO GREG-MM.
045400     MOVE CUR-DM-BUFF     TO GREG-DD.
045500     MOVE CUR-YY-BUFF     TO GREG-YY.
           MOVE SPACES          TO JULIAN-DATE.
           IF GREG-YY > "70"
               MOVE "19"        TO GREG-CC
           ELSE
           MOVE "20"            TO GREG-CC.
045700     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
045800     IF JULIAN-DATE-9 > 1
045900          SUBTRACT 1   FROM JULIAN-DATE-9
046000     ELSE
046200     MOVE JUL-DAY-LYR TO JULIAN-DATE-9.
046300**************************************************************
046400*                                                            *
046500*    THE FOLLOWING 2 LINES WILL CAUSE ALL WORK-ORDERS        *
046600*    INITIATED OR STARTED DURING THE WEEKEND AND THOSE       *
046700*    FROM FRIDAY'S ( DEPENDING ON THE 24 HR. CHECK )         *
046800*    TO BE OMITTED FROM MONDAY'S REPORT THUS GIVING THEM     *
046900*    ENOUGH TIME TO BE PROCESSED.                            *
047000*                                                            *
047100**************************************************************
           MOVE SPACES          TO GREG-DATE.
047400     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE GREG-CC         TO CC-L24HR-9.
047600     MOVE GREG-YY         TO YY-L24HR-9.
047700     MOVE GREG-MM         TO MM-L24HR-9.
047800     MOVE GREG-DD         TO DD-L24HR-9.
047900     MOVE CUR-TIME        TO TIME-L24HR-9.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           MOVE "ALL " TO ZONE-KEY.
050800*    PERFORM 10-MATCH-PRTR-TO-ZONE THRU 10-MPTZ-EXIT.
051700
051800 10-MATCH-PRTR-TO-ZONE.
           MOVE 0 TO COND-WORD.
      *    READ OF ZONPRT FILE GOES HERE
052100     IF COND-WORD = 17
052200         PERFORM 100-SELECT-INFO THRU 100-SI-EXIT
052300         GO TO 10-MPTZ-EXIT.
052400     IF PRT-COMP = ZONPRT-PRTR
052500         IF USERNAME-1-3 = "MAN" OR "MGR" OR "PLA" OR "ENG"
052600             PERFORM 100-SELECT-INFO THRU 100-SI-EXIT
052700             GO TO 10-MPTZ-EXIT
052800         ELSE
052900         MOVE ZONPRT-ZONE TO ZONE-KEY
053000         GO TO 10-MPTZ-EXIT.
053100     GO TO 10-MATCH-PRTR-TO-ZONE.
053200 10-MPTZ-EXIT.    EXIT.
053300
053400 100-SELECT-INFO.
           MOVE SPACES TO SCREEN-BUFF.
053500     MOVE "FQ6INQ" TO VIEW-CFNAME.
           MOVE SCREEN-BUFF TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO SCREEN-BUFF.
056500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
057200     IF ZONE-BUFF-S NOT = SPACES
057300         MOVE ZONE-BUFF-S TO ZONE-KEY
057400     ELSE
057500     MOVE "ALL " TO ZONE-KEY.
057600 100-SI-EXIT.    EXIT.
057700
057800 6-MAIN.
057900     SORT SORT-FILE ASCENDING  KEY SRT-ZONE
058000                    DESCENDING KEY SRT-WO-STATUS
058100                    ASCENDING  KEY SRT-PRIORITY
058200             INPUT  PROCEDURE  7-INPUT-RECORDS
058300             OUTPUT PROCEDURE  8-WRITE-SORT-RECORDS.
           MOVE 0 TO COND-WORD.
           MOVE 0 TO ACT-KEY ACT-KEY-2 IL-KEY SM-KEY.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.
           OPEN OUTPUT IL-FILE.
           OPEN OUTPUT SM-FILE.
061000     MOVE 1 TO SUB.
061100     PERFORM 3-PROCESS-OUTPUT-RECORDS THRU 3-POR-X
061200             UNTIL ALL-OUTPUT-REC-ARE-PROCESSED.
061300     PERFORM 4-PROCESS-IL-RECORDS THRU 4-PIL-EXIT.
061400     PERFORM 5-PROCESS-SM-RECORDS THRU 5-PSM-EXIT.
           CLOSE IL-FILE SM-FILE OUT-FILE.
061700
063400 3-PROCESS-OUTPUT-RECORDS.
063500     IF OUT-CRAFT-IL NOT = "Y" GO TO 3-POR-NOT-IL.
063900     MOVE SPACES TO ILF.
064000     ADD 1 TO IL-KEY.
063600     MOVE OUT-DATA TO IL-DATA.
063700     WRITE ILF    INVALID KEY GO TO 3-POR-CONT.
064100     GO TO 3-POR-CONT.
064200 3-POR-NOT-IL.
064300     IF OUT-CRAFT-IL NOT = "Z" GO TO 3-POR-NOT-SM.
064700     MOVE SPACES TO SMF.
064800     ADD 1 TO SM-KEY.
064400     MOVE OUT-DATA TO SM-DATA.
064500     WRITE SMF    INVALID KEY  GO TO 3-POR-CONT.
064900     GO TO 3-POR-CONT.
065000 3-POR-NOT-SM.
065100     IF PLANT-IDENT = "126" OR "153" OR "211" OR "111"
065200         IF ZONE-BUFF-S = SPACES
065300             NEXT SENTENCE
065400         ELSE
065500         MOVE ZONE-BUFF-S TO PREV-MAINT-ZONE
065600     ELSE
065700     IF ZONPRT-ZONE = "IL" GO TO 3-POR-CONT.
065800**** THE ABOVE CHECK IS INCORPORATED TO ALLOW ONLY 'IL" ****
065900**** CRAFT DATA TO BE PROCESSED FOR THE INSTRUMENT LAB AREA*
066000**** IN UNION CITY                                   *******
066100     IF       OUT-ZONE     NOT = PREV-MAINT-ZONE
066200         IF PREV-MAINT-ZONE = LOW-VALUES
066300             MOVE OUT-ZONE        TO PREV-MAINT-ZONE DTL-ZONE
066400             MOVE OUT-WO-STATUS   TO PREV-WO-STATUS
066500         ELSE
066600         IF ZONE-KEY = "ALL "
066700             MOVE 1 TO SUB
066800             MOVE 66125 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO DTL-MESSAGE
                   MOVE PREV-MAINT-ZONE TO DTL-ZONE
067300             MOVE OUT-ZONE TO PREV-MAINT-ZONE
067400             MOVE OUT-WO-STATUS TO PREV-WO-STATUS
                   MOVE "FQ6INQ2" TO VIEW-CFNAME
                   MOVE DTL-LINES TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98-SCREEN-READ
                   MOVE SPACES TO DTL-LINES
069000             IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
071000     MOVE OUT-WO-STATUS TO DTL-STATUS (SUB).
071100     MOVE OUT-PRIORITY  TO DTL-PRIORITY (SUB).
071200     MOVE OUT-EQP-NUM   TO DTL-EQPNO (SUB).
071300     MOVE OUT-WO-NUM    TO DTL-WO (SUB).
071400     MOVE OUT-DESC1     TO DTL-DESC (SUB).
071500     IF DATE-FLAG = 3
071600         MOVE OUT-MD TO DTL-DM (SUB)
071700         MOVE OUT-DM TO DTL-MD (SUB)
071800         MOVE OUT-YY TO DTL-YY (SUB)
071900     ELSE
072000     MOVE OUT-YY        TO DTL-YY (SUB)
072100     MOVE OUT-MD        TO DTL-MD (SUB)
072200     MOVE OUT-DM        TO DTL-DM (SUB).
072300     MOVE OUT-HR        TO DTL-HR (SUB).
072400     MOVE OUT-MI        TO DTL-MI (SUB).
072500     ADD 1 TO SUB.
072600     IF SUB > 16
072700         MOVE 1 TO SUB
066800         MOVE 66125 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO DTL-MESSAGE
               MOVE PREV-MAINT-ZONE TO DTL-ZONE
067300         MOVE OUT-ZONE TO PREV-MAINT-ZONE
067400         MOVE OUT-WO-STATUS TO PREV-WO-STATUS
               MOVE "FQ6INQ2" TO VIEW-CFNAME
               MOVE DTL-LINES TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE SPACES TO DTL-LINES
074800         IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
076800 3-POR-CONT.
076900     ADD 1 TO ACT-KEY.
077000     READ OUT-FILE     INVALID KEY
077100         PERFORM 30-CK-ROW-TO-PRINT THRU 30-CRTP-EXIT
077200         MOVE "Y" TO END-OF-OUTPUT-FILE.
077300
077400 3-POR-X.   EXIT.
078400
078500 30-CK-ROW-TO-PRINT.
079400     MOVE 1 TO SUB.
           MOVE "FQ6INQ2" TO VIEW-CFNAME.
           MOVE 66122 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO DTL-MESSAGE.
           MOVE PREV-MAINT-ZONE TO DTL-ZONE.
067300     MOVE OUT-ZONE TO PREV-MAINT-ZONE.
067400     MOVE OUT-WO-STATUS TO PREV-WO-STATUS.
           MOVE DTL-LINES TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO DTL-LINES.
074800     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
081900
082000 30-CRTP-EXIT.    EXIT.
082100
082200
082300 4-PROCESS-IL-RECORDS.
082400     MOVE 0 TO IL-KEY.
           CLOSE IL-FILE.
           OPEN INPUT IL-FILE.
082500 4-READ-IL.
082900     ADD 1 TO IL-KEY.
082600     READ IL-FILE    INVALID KEY
082700         PERFORM 40-CK-ROW-TO-PRINT THRU 40-CRTP-EXIT
082800         GO TO 4-PIL-EXIT.
083000     IF IL-IDENT NOT = "Y" GO TO 4-READ-IL.
083100     MOVE 1 TO IL-SW.
083200     IF IL-ZONE NOT = SAVE-ZONE
083300         MOVE IL-ZONE TO SAVE-ZONE
083400         MOVE IL-WO-STATUS TO PREV-WO-STATUS.
083500     MOVE IL-WO-STATUS TO DTL-STATUS (SUB).
083600     MOVE IL-PRIORITY  TO DTL-PRIORITY (SUB).
083700     MOVE IL-EQP-NUM   TO DTL-EQPNO (SUB).
083800     MOVE IL-WO-NUM    TO DTL-WO (SUB)
083900     MOVE IL-DESC1     TO DTL-DESC (SUB).
084000     IF DATE-FLAG = 3
084100         MOVE IL-YY TO DTL-YY (SUB)
084200         MOVE IL-MD TO DTL-DM (SUB)
084300         MOVE IL-DM TO DTL-MD (SUB)
084400     ELSE
084500     MOVE IL-YY        TO DTL-YY (SUB)
084600     MOVE IL-MD        TO DTL-MD (SUB)
084700     MOVE IL-DM        TO DTL-DM (SUB).
084800     MOVE IL-HR        TO DTL-HR (SUB).
084900     MOVE IL-MI        TO DTL-MI (SUB).
085000     ADD 1 TO SUB.
085100     IF SUB > 16
085200         MOVE 1 TO SUB
               MOVE "FQ6INQ2" TO VIEW-CFNAME
               MOVE 66125 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO DTL-MESSAGE
               MOVE IL-ZONE TO DTL-ZONE
               MOVE DTL-LINES TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               MOVE SPACES TO DTL-LINES
074800         IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
089300     GO TO 4-READ-IL.
089400 4-PIL-EXIT.    EXIT.
089500
089600 40-CK-ROW-TO-PRINT.
090500     MOVE 1 TO SUB.
           MOVE "FQ6INQ2" TO VIEW-CFNAME.
           MOVE 66122 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO DTL-MESSAGE.
           MOVE SAVE-ZONE TO DTL-ZONE.
           MOVE DTL-LINES TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO DTL-LINES
074800     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
093000
093100 40-CRTP-EXIT.    EXIT.
093200
093300 5-PROCESS-SM-RECORDS.
093400     MOVE 0 TO SM-KEY.
           CLOSE SM-FILE.
           OPEN INPUT SM-FILE.
093500     MOVE SPACES TO SAVE-ZONE.
093600     MOVE 0 TO IL-SW.
093700 5-READ-SM.
094100     ADD 1 TO SM-KEY.
093800     READ SM-FILE    INVALID KEY
093900         PERFORM 50-CK-ROW-TO-PRINT THRU 50-CRTP-EXIT
094000         GO TO 5-PSM-EXIT.
094200     IF SM-IDENT NOT = "Z" GO TO 5-READ-SM.
094300     MOVE 1 TO SM-SW.
094400     IF SM-ZONE NOT = SAVE-ZONE
094500         MOVE SM-ZONE TO SAVE-ZONE
094600         MOVE SM-WO-STATUS TO PREV-WO-STATUS.
094700     MOVE SM-WO-STATUS TO DTL-STATUS (SUB).
094800     MOVE SM-PRIORITY  TO DTL-PRIORITY (SUB).
094900     MOVE SM-EQP-NUM   TO DTL-EQPNO (SUB).
095000     MOVE SM-WO-NUM    TO DTL-WO (SUB).
095100     MOVE SM-DESC1     TO DTL-DESC (SUB).
095200     IF DATE-FLAG = 3
095300         MOVE SM-MD TO DTL-DM (SUB)
095400         MOVE SM-DM TO DTL-MD (SUB)
095500         MOVE SM-YY TO DTL-YY (SUB)
095600     ELSE
095700     MOVE SM-YY        TO DTL-YY (SUB)
095800     MOVE SM-MD        TO DTL-MD (SUB)
095900     MOVE SM-DM        TO DTL-DM (SUB).
096000     MOVE SM-HR        TO DTL-HR (SUB).
096100     MOVE SM-MI        TO DTL-MI (SUB).
096200     ADD 1 TO SUB.
096300     IF SUB > 16
096400         MOVE 1 TO SUB
               MOVE "FQ6INQ2" TO VIEW-CFNAME
               MOVE 66125 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO DTL-MESSAGE
               MOVE SM-ZONE TO DTL-ZONE
               MOVE DTL-LINES TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ.
074800         IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
100500     GO TO 5-READ-SM.
100600
100700 5-PSM-EXIT.    EXIT.
100800
100900 50-CK-ROW-TO-PRINT.
           MOVE 1 TO SUB.
           MOVE "FQ6INQ2" TO VIEW-CFNAME.
           MOVE 66122 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO DTL-MESSAGE.
           MOVE SAVE-ZONE TO DTL-ZONE.
           MOVE DTL-LINES TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
074800     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
103500
103600 50-CRTP-EXIT.    EXIT.
103700
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.

103800 7-INPUT-RECORDS.
           MOVE "N" TO END-OF-INPUT-FILE.
103900     PERFORM 72-FIND-CHAIN THRU 72-FC-X
104000             UNTIL END-OF-INPUT-FILE = "Y".
104200
104300 72-FIND-CHAIN.
104400     IF STATUS-BUFF-S NOT = SPACES
104500         MOVE STATUS-BUFF-S TO ARG-BUFF
104600         MOVE "Y" TO END-OF-INPUT-FILE
           ELSE
104800     IF  ARG-BUFF    =  "HL"
104900         MOVE "HA"   TO ARG-BUFF
105000         MOVE "Y"    TO END-OF-INPUT-FILE
           ELSE
105100     IF  ARG-BUFF    =  "HM"
105200         MOVE "HL"   TO ARG-BUFF
           ELSE
105300     IF  ARG-BUFF    =  "HS"
105400         MOVE "HM"   TO ARG-BUFF
           ELSE
105500     IF  ARG-BUFF    =  "IP"
105600         MOVE "HS"   TO ARG-BUFF
           ELSE
105700     IF  ARG-BUFF    =  "OO"
105800         MOVE "IP"   TO ARG-BUFF
           ELSE
105900     IF  ARG-BUFF    =  SPACES
106000         MOVE "OO"   TO ARG-BUFF.
           MOVE 0 TO COND-WORD.
           MOVE ARG-BUFF TO WOSTATUS OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
106400     IF  COND-WORD   =  0
106500         PERFORM 721-GET-RECORDS THRU 721-GR-X
106600             UNTIL COND-WORD = 17.
107700
       72-FC-X.    EXIT.

107800 721-GET-RECORDS.
107900     MOVE SPACES     TO DATE-TIME-BUFFER-CN.
108100     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF WO-STATUS NOT = ARG-BUFF MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
108300     IF  COND-WORD = 17 GO TO 721-GR-X.
109200     IF  WO-STATUS   = "OO"
109300         MOVE DATE-TIME-RECD TO DATE-TIME-BUFFER-CN
109400     ELSE
109500*    IF  WO-STATUS   = "HA" OR "HL" OR "HM" OR "HS"
109600*        IF  STATUS-HIST-3 NOT = SPACES
109700*            MOVE DATE-TIME-HIST-3 TO DATE-TIME-BUFFER
109800*        ELSE
109900*        IF  STATUS-HIST-2 NOT = SPACES
110000*            MOVE DATE-TIME-HIST-2 TO DATE-TIME-BUFFER
110100*        ELSE
110200*        IF STATUS-HIST-3 NOT = SPACES
110300*            MOVE DATE-TIME-HIST-1 TO DATE-TIME-BUFFER
110400*        ELSE
110500*        IF DATE-TIME-STRT NOT = SPACES
110600*            MOVE DATE-TIME-STRT TO DATE-TIME-BUFFER
110700*        ELSE
110800*        MOVE DATE-TIME-RECD TO DATE-TIME-BUFFER
110900*    ELSE
111000*    IF  STATUS-HIST-3 = "IP"
111100*        MOVE DATE-TIME-HIST-3 TO DATE-TIME-BUFFER
111200*    ELSE
111300*    IF  STATUS-HIST-2 = "IP"
111400*        MOVE DATE-TIME-HIST-2 TO DATE-TIME-BUFFER
111500*    ELSE
111600*    IF  STATUS-HIST-1 = "IP"
111700*        MOVE DATE-TIME-HIST-1 TO DATE-TIME-BUFFER
111800*    ELSE
111900     MOVE DATE-TIME-STRT   TO DATE-TIME-BUFFER-CN.
112000     IF CRAFTS-REQD-1 = "IL" OR CRAFTS-REQD-2 = "IL" OR
112100         CRAFTS-REQD-3 = "IL"
112200             MOVE "Y" TO SRT-CRAFT-IL
112300     ELSE
112400     IF CRAFTS-REQD-1 = "SM" OR CRAFTS-REQD-2 = "SM" OR
112500         CRAFTS-REQD-3 = "SM"
112600             MOVE "Z" TO SRT-CRAFT-IL
112700     ELSE
112800     MOVE " " TO SRT-CRAFT-IL.
112900     IF CRAFT-BUFF-S = CRAFTS-REQD-1 OR CRAFTS-REQD-2
113000         OR CRAFTS-REQD-3 OR SPACES
113100             NEXT SENTENCE
113200     ELSE
113300     GO TO 721-GET-RECORDS.
113400     IF PRTY-BUFF-S = SPACE OR PRIORITY OF WO-BASIC-DATA
113500         NEXT SENTENCE
113600     ELSE
113700     GO TO 721-GET-RECORDS.
113900     IF  DATE-TIME-BUFFER-CN < L24HR-DATE-TIME-CHECK-CN
114000         IF ZONE-1 OF WO-BASIC-DATA = ZONE-KEY-1
114100             AND ZONE-KEY-1 = "C"
114200             MOVE ZONE OF WO-BASIC-DATA          TO SRT-ZONE
114300             MOVE PRIORITY OF WO-BASIC-DATA      TO SRT-PRIORITY
114400             MOVE EQUIP-NUM OF WO-BASIC-DATA     TO SRT-EQP-NUM
114500             MOVE WO-STATUS OF WO-BASIC-DATA     TO SRT-WO-STATUS
114600             MOVE WO-NUM OF WO-BASIC-DATA        TO SRT-WO-NUM
114700             MOVE DESCRIPTION-1 OF WO-BASIC-DATA TO SRT-DESC1
114800             MOVE DATE-TIME-BUFFER               TO SRT-PRT5
114900             RELEASE SRT-REC
115000         ELSE
115100         IF ZONE OF WO-BASIC-DATA = ZONE-KEY
114200             MOVE ZONE OF WO-BASIC-DATA          TO SRT-ZONE
114300             MOVE PRIORITY OF WO-BASIC-DATA      TO SRT-PRIORITY
114400             MOVE EQUIP-NUM OF WO-BASIC-DATA     TO SRT-EQP-NUM
114500             MOVE WO-STATUS OF WO-BASIC-DATA     TO SRT-WO-STATUS
114600             MOVE WO-NUM OF WO-BASIC-DATA        TO SRT-WO-NUM
114700             MOVE DESCRIPTION-1 OF WO-BASIC-DATA TO SRT-DESC1
114800             MOVE DATE-TIME-BUFFER               TO SRT-PRT5
115900             RELEASE SRT-REC
116000         ELSE
116100         IF ZONE-KEY = "ALL "
114200             MOVE ZONE OF WO-BASIC-DATA          TO SRT-ZONE
114300             MOVE PRIORITY OF WO-BASIC-DATA      TO SRT-PRIORITY
114400             MOVE EQUIP-NUM OF WO-BASIC-DATA     TO SRT-EQP-NUM
114500             MOVE WO-STATUS OF WO-BASIC-DATA     TO SRT-WO-STATUS
114600             MOVE WO-NUM OF WO-BASIC-DATA        TO SRT-WO-NUM
114700             MOVE DESCRIPTION-1 OF WO-BASIC-DATA TO SRT-DESC1
114800             MOVE DATE-TIME-BUFFER               TO SRT-PRT5
116900             RELEASE SRT-REC
117000         ELSE
117100         GO TO 721-GET-RECORDS.
117200
117300 721-GR-X.
117400     EXIT.
117800
       8-WRITE-SORT-RECORDS.
           MOVE 0 TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           PERFORM 8-WSR-CONT THRU 8-WSR-EXIT.
       8-WSR-CONT.
118300     RETURN SORT-FILE AT END GO TO 8-WSR-EXIT.
118900     ADD 1 TO ACT-KEY.
118500     MOVE SRT-REC TO OUT-DATA.
118600     WRITE OUT-REC     INVALID KEY GO TO 8-WSR-EXIT.
119000     GO TO 8-WSR-CONT.
119100 8-WSR-EXIT.    EXIT.
