000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ7SUB.
000400*REMARKS.   **** WO SCHEDULE INQUIRY SUBPROGRAM
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.    AS400.
000900 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001100 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
001200 WORKING-STORAGE SECTION.
001300 77  ARG-NO                    PIC 9(9).
       COPY CPYIND  IN COPYLIB.
       01  DSPLY-STATUS              PIC XX.
001600 01  ERROR-BUFFER              PIC X(80).
       COPY IOFEEDBACK IN COPYLIB.
001500 01  LAST-WO-BUFF.         COPY MLASTWO OF COPYLIB.
002300 01  PASSWORD-INFORMATION.
002400     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ7SUB  ".
002500     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
002600     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002700     05  PROGRAM-DESCRIPTION.
002800         10  PROG-DESC-A.
                   15  FILLER      PIC X(11) VALUE " EXECUTIVE ".
                   15  FILLER      PIC X(16) VALUE "INQUIRY PROGRAM ".
                   15  FILLER      PIC X(16) VALUE "FOR PLANNED W/O ".
                   15  FILLER      PIC X(17) VALUE "SCHEDULES ".
003000         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
003200         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003400     05  PASSWORD-FLAG       PIC X.
       COPY DBSTAT OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
003700 LINKAGE SECTION.
004400 01  DBPARAMETERS.          COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
004800 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
004900                      CATREAD-PARMS.
005000 START-PGM.
005100     PERFORM 1-HSK.
005200     PERFORM 6-MAIN.
005400 2-EOJ.
           CLOSE DISPLAY-FILE.
005500     GOBACK.
005700 1-HSK.
           OPEN I-O   DISPLAY-FILE.
005800     CALL "TPWORD" USING PASSWORD-INFORMATION.
006200     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE LOW-VALUES TO VIEW-COMAREA.
007000 6-MAIN.
           MOVE SPACES TO DSPLY-REC.
007100     MOVE "FQ7SCHEX" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
008400     IF VIEW-LASTKEY = 3
008500         GO TO 2-EOJ
008600     ELSE
008700     IF VIEW-LASTKEY = 1
008800         CALL "CLQ7AINQ" USING  DBPARAMETERS
008900                                VIEW-COMAREA
009000                                CATREAD-PARMS
009200         IF VIEW-LASTKEY = 3
009300             GO TO 2-EOJ
009400         ELSE
009500         GO TO 6-MAIN
009600     ELSE
009700     IF VIEW-LASTKEY = 2
009800         CALL "CLQ7BINQ" USING DBPARAMETERS
009900                               VIEW-COMAREA
010000                               CATREAD-PARMS
010200         IF VIEW-LASTKEY = 3
010300             GO TO 2-EOJ
010400         ELSE
010500         GO TO 6-MAIN
010600     ELSE
010700     IF VIEW-LASTKEY = 4
010800         CALL "CLQ7CINQ" USING DBPARAMETERS
010900                               VIEW-COMAREA
011000                               CATREAD-PARMS
011200         IF VIEW-LASTKEY = 3
011300             GO TO 2-EOJ
011400         ELSE
011500         GO TO 6-MAIN
011600     ELSE
011700     IF VIEW-LASTKEY = 5
011800         CALL "CLQ7DINQ" USING DBPARAMETERS
011900                               VIEW-COMAREA
012000                               CATREAD-PARMS
012200         IF VIEW-LASTKEY = 3
012300             GO TO 2-EOJ
012400         ELSE
012500         GO TO 6-MAIN
012600     ELSE
012700     GO TO 6-MAIN.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.
