000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ7SUBC.
      *C
      *C  09/13/1996    CA YODER
      *C    MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.    AS400.
000900 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001000     SELECT OUT-FILE
               ASSIGN TO DATABASE-OUTFIQ7C
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
001300     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
           SELECT WO-CRAFTS-MSTR-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCMF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
           SELECT WO-SCHEDULE-FILE
               ASSIGN TO DATABASE-MCFLMM2303
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WSF-STATUS.
001600 DATA DIVISION.
001700 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
001600 FD  OUT-FILE RECORD CONTAINS 70 CHARACTERS
001700     LABEL RECORDS ARE OMITTED
001800     DATA RECORD IS OUT-REC.
001900 01  OUT-REC.
           05  OUT-DATA.
002000         10  OUT-ZP.
002100             15  OUT-Z                 PIC X(4).
002200             15  OUT-P                 PIC X(2).
002300         10  OUT-WO                    PIC X(10).
002400         10  OUT-EQ-NUM                PIC X(6).
               10  OUT-DATE-CN.
                   15  OUT-CC                PIC X(02).
002500             15  OUT-DATE.
002600                 20  OUT-YY            PIC X(02).
002700                 20  OUT-MM            PIC X(02).
002800                 20  OUT-DD            PIC X(02).
002900         10  OUT-SHFT.
003000             15  OUT-SHIFT             PIC X.
003100             15  OUT-SORT-SHIFT        PIC X.
003200         10  OUT-QTY                   PIC X(02).
003300         10  OUT-CRAFT                 PIC X(02).
003400         10  OUT-HOURS.
003500             15  OUT-HRS               PIC X(03).
003600             15  OUT-TENTHS            PIC X.
003700         10  OUT-REM                   PIC X(30).
003800
003900 SD  SORT-FILE RECORD CONTAINS 70 CHARACTERS
004000     DATA RECORD IS SORT-REC.
004100 01  SORT-REC.
004200     05  SORT-ZP.
004300         10  SORT-Z                     PIC X(4).
004400         10  SORT-P                     PIC X(2).
004500     05  SORT-WO                        PIC X(10).
004600     05  SORT-EQ-NUM.
004900         10  SORT-EQ1                   PIC X.
005000         10  SORT-EQ2                   PIC X.
005100         10  SORT-EQ3                   PIC X.
005200         10  SORT-EQ4                   PIC X.
005300         10  SORT-EQ5                   PIC X.
005400         10  SORT-EQ6                   PIC X.
           05  SORT-DATE-CN.
               10  SORT-CC                    PIC X(02).
004700         10  SORT-DATE.
004800             15  SORT-YY                PIC X(02).
004900             15  SORT-MM                PIC X(02).
005000             15  SORT-DD                PIC X(02).
005100     05  SORT-SHFT.
005200         10  SORT-SHIFT                 PIC X.
005300         10  SORT-SORT-SHIFT            PIC X.
005400     05  SORT-QTY                       PIC X(02).
005500     05  SORT-CRAFT                     PIC X(02).
005600     05  SORT-HOURS.
005700         10  SORT-HRS                   PIC X(03).
005800         10  SORT-TENTHS                PIC X.
005900     05  SORT-REM                       PIC X(30).
006000
       FD  WO-CRAFTS-MSTR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCMFREC.
       01  WCMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-SCHEDULE-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WSFREC.
       01  WSFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2303.

006900 WORKING-STORAGE SECTION.
007000 77  ACT-KEY                   PIC 9(9).
007300 77  CRAFT-KEY                 PIC XX.
007800 77  DATE-HOLD-CN              PIC X(08) VALUE SPACES.
007200 77  EOF-SW                    PIC 9  VALUE 0.
007500 77  FIELD-CTR                 PIC 99 VALUE 0.
007900 77  FIELD-HOLD                PIC X(79).
007100 77  MAX-KEY                   PIC 9(9).
008000 77  PAGE-HD                   PIC 999 VALUE 0.
007700 77  SHIFT-HOLD                PIC X(01) VALUE SPACE.
007400 77  SKILL-DATA                PIC XX.
007600 77  WO-NUM-HOLD               PIC X(10) VALUE SPACES.
008100
027500 01  BU-DISPLAY-AREA.
027600     05  FILLER                 PIC XX.
027700     05  BU-DISPLAY-MSG         PIC X(27).
027800     05  FILLER                 PIC XX.
027900     05  BU-DISPLAY-STAT        PIC S9(4).
028000     05  FILLER                 PIC XX.
028100     05  BU-DISPLAY-FLD         PIC X(14).
028200     05  FILLER                 PIC XX.

       COPY CPYIND  IN COPYLIB.

       01  CURR-DATE.
           05  CURR-DATE-YY           PIC XX.
           05  CURR-DATE-MM           PIC XX.
           05  CURR-DATE-DD           PIC XX.

021100 01  DATA-LINE-1.
021200     05  FILLER     PIC X(02) VALUE SPACES.
021300     05  DATE-SCH.
021400         10  SCH-MM PIC XX.
021500         10  SLASH1 PIC X.
021600         10  SCH-DD PIC XX.
021700         10  SLASH2 PIC X.
021800         10  SCH-YY PIC XX.
021900     05  FILLER     PIC X(03) VALUE SPACES.
022000     05  WO-NUM-SCH.
022100         10  WO-6   PIC X(06).
022200         10  WO-Y   PIC X.
022300         10  WO-S   PIC X(03).
022400     05  FILLER     PIC X(04) VALUE SPACES.
022500     05  EQP-SCH    PIC X(06).
022600     05  FILLER     PIC X(07) VALUE SPACES.
022700     05  DESC-SCH   PIC X(30).
022800     05  FILLER     PIC X(09) VALUE SPACE.
022900
023000 01  DATA-LINE-2.
023100     05  FILLER     PIC X(04) VALUE SPACES.
023200     05  SHIFT-HD   PIC X(07) VALUE SPACES.
023300     05  SHIFT-SCH  PIC X.
023400     05  FILLER     PIC X(02) VALUE SPACES.
023500     05  QTY-SCH    PIC Z9.
023600     05  FILLER     PIC X(02) VALUE SPACES.
023700     05  CRAFT-SCH  PIC XX.
023800     05  FILLER     PIC X(05) VALUE " FOR ".
023900     05  HOURS-SCH.
024000         10  HR-3   PIC ZZ9.
024100         10  HR-DOT PIC X.
024200         10  HR-T   PIC 9.
024300     05  FILLER     PIC X(08) VALUE " HOURS. ".
024400     05  REMS-HD    PIC X(08).
024500     05  FILLER     PIC X(02) VALUE SPACES.
024600     05  REMS-SCH   PIC X(30).
024700     05  FILLER     PIC X     VALUE SPACE.
024800
       COPY TDATESUB OF COPYLIB.
016800
      *-------- ACCOUNT FOR CENTURY.
       01  E-DATE-CN.
           05  E-DATE-CC                          PIC 99.
013600     05  E-DATE.
013700         10  E-DATE-YY                      PIC 99.
013800         10  E-DATE-MM                      PIC 99.
013900         10  E-DATE-DD                      PIC 99.

       01  ERROR-BUFFER                           PIC X(80).

       01  FILE-STATUSES.
           05  DSPLY-STATUS                       PIC XX.
           05  OF-STATUS                          PIC XX.
           05  WCMF-STATUS                        PIC XX.
           05  WLNU-STATUS                        PIC XX.
           05  WPF-STATUS                         PIC XX.
           05  WSF-STATUS                         PIC XX.
014000
017700 01  HEAD-1.
017800     05  FILLER    PIC X(17) VALUE "          DATE:  ".
017900     05  DATE-HD.
018000         10  D-MM  PIC X(02) VALUE SPACES.
018100         10  D-SL1 PIC X(01) VALUE "/".
018200         10  D-DD  PIC X(02) VALUE SPACES.
018300         10  D-SH2 PIC X(01) VALUE "/".
018400         10  D-YY  PIC X(02) VALUE SPACES.
018500     05  FILLER    PIC X(18) VALUE "           TIME:  ".
018600     05  TIME-HD.
018700         10  T-HR  PIC X(02) VALUE SPACES.
018800         10  T-COL PIC X(01) VALUE ":".
018900         10  T-MN  PIC X(02) VALUE SPACES.
019000     05  FILLER    PIC X(18) VALUE "           PAGE:  ".
019100     05  PAGE-HD-Z PIC ZZ9.
019200     05  FILLER    PIC X(10) VALUE SPACES.
019300
019400 01  HEAD-2.
019500     05  FILLER    PIC X(13) VALUE SPACES.
019600     05  FILLER    PIC X(16) VALUE "P L A N N E D   ".
019700     05  FILLER    PIC X(22) VALUE "W O R K   O R D E R   ".
019800     05  FILLER    PIC X(15) VALUE "S C H E D U L E".
019900     05  FILLER    PIC X(13) VALUE SPACES.
020000
020100 01  HEAD-3.
020200     05  FILLER    PIC X(13) VALUE "    DATE     ".
020300     05  FILLER    PIC X(13) VALUE "W/O NUMBER   ".
020400     05  FILLER    PIC X(14) VALUE "EQUIPMENT     ".
020500     05  FILLER    PIC X(12) VALUE "DESCRIPTION:".
020600     05  FILLER    PIC X(27) VALUE SPACES.
020700
020800 01  HEAD-4.
020900     05  FILLER    PIC X(79) VALUE ALL "=".
021000
       COPY IOFEEDBACK IN COPYLIB.

       01  LAST-WO-BUFF.         COPY MLASTWO OF COPYLIB.

025900 01  PASSED-SPOOL-PRT           PIC S9(2)  COMP.
026000 01  PASSWORD-INFORMATION.
026100     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ7SUBC ".
026200     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
026300     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
026400     05  PROGRAM-DESCRIPTION.
026500         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " PLANNER/ENGINEER".
                   15  FILLER      PIC X(12) VALUE " MODULE FOR ".
                   15  FILLER      PIC X(11) VALUE "RETRIEVING ".
                   15  FILLER      PIC X(12) VALUE "PLANNED W/O ".
                   15  FILLER      PIC X(8)  VALUE "SCHEDULE".
027200         10  PROG-DESC-B.
                   15  FILLER      PIC X(15) VALUE "S BY EQUIPMENT ".
                   15  FILLER      PIC X(45) VALUE "NUMBER    ".
027400         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
027100     05  PASSWORD-FLAG       PIC X.
027200
014100 01  SCREEN-BUFF.
014200     05  FIELD-1        PIC X(79).
014300     05  FIELD-2        PIC X(79).
014400     05  FIELD-3        PIC X(79).
014500     05  FIELD-4        PIC X(79).
014600     05  FIELD-5        PIC X(79).
014700     05  FIELD-6        PIC X(79).
014800     05  FIELD-7        PIC X(79).
014900     05  FIELD-8        PIC X(79).
015000     05  FIELD-9        PIC X(79).
015100     05  FIELD-10       PIC X(79).
015200     05  FIELD-11       PIC X(79).
015300     05  FIELD-12       PIC X(79).
015400     05  FIELD-13       PIC X(79).
015500     05  FIELD-14       PIC X(79).
015600     05  FIELD-15       PIC X(79).
015700     05  FIELD-16       PIC X(79).
015800     05  FIELD-17       PIC X(79).
015900     05  FIELD-18       PIC X(79).
016000     05  FIELD-19       PIC X(79).
016100     05  FIELD-20       PIC X(79).
016200     05  FIELD-21       PIC X(79).
016400     05  SCRN-MSG-LINE  PIC X(79).
           05  SCRN-CMD-LINE  PIC X(79).
           05  SCRN-ERR-LINE  PIC X(79).
016500
010500 01  SELECT-BUFFER.
010600     05  EQUIP-BUF.
010700         10  EQ1           PIC X.
010800         10  EQ2           PIC X.
010900         10  EQ3           PIC X.
011000         10  EQ4           PIC X.
011100         10  EQ5           PIC X.
011200         10  EQ6           PIC X.
011300     05  DAT1-BUF.
011400         10  DAT1-MM                        PIC XX.
011500         10  DAT1-MM-9 REDEFINES DAT1-MM    PIC 99.
011600         10  DAT1-DD                        PIC XX.
011700         10  DAT1-DD-9 REDEFINES DAT1-DD    PIC 99.
011800         10  DAT1-YY                        PIC XX.
011900         10  DAT1-YY-9 REDEFINES DAT1-YY    PIC 99.
012000     05  DAT2-BUF.
012100         10  DAT2-MM                        PIC XX.
012200         10  DAT2-MM-9 REDEFINES DAT2-MM    PIC 99.
012300         10  DAT2-DD                        PIC XX.
012400         10  DAT2-DD-9 REDEFINES DAT2-DD    PIC 99.
012500         10  DAT2-YY                        PIC XX.
012600         10  DAT2-YY-9 REDEFINES DAT2-YY    PIC 99.
012700     05  SHIFT-BUF              PIC X.
012800     05  CRAFT-BUF              PIC XX.
           05  SELECT-CMD-LINE        PIC X(79).
           05  SELECT-MSG-LINE        PIC X(79).
013000
025400 01  SCREEN-PRINT-PARMS.
025500     05  PRINTCNTL           PIC S9(4)    VALUE ZERO    COMP.
025600     05  PAGECNTL            PIC S9(4)    VALUE 49      COMP.
025700     05  SPOOLFIL-OPEN-SW    PIC X        VALUE "N".
025800
008800 01  SHIFT-DATA.
008900     05  ZONE-BUF       PIC X(04).
009000     05  TIME-IN.
009100         10  HRS-IN     PIC 99.
009200         10  MIN-IN     PIC 99.
009300     05  CODE-BUF       PIC X.
009400     05  SHIFTS.
009500         10  S-1        PIC 9999.
009600         10  E-1        PIC 9999.
009700         10  S-2        PIC 9999.
009800         10  E-2        PIC 9999.
009900         10  S-3        PIC 9999.
010000         10  E-3        PIC 9999.
010100         10  S-4        PIC 9999.
010200         10  E-4        PIC 9999.
010300     05  CURR-SHIFT     PIC 9.
010400
      *------- ACCOUNT FOR CENTURY.
       01  S-DATE-CN.
           05  S-DATE-CC                          PIC 99.
013100     05  S-DATE.
013200         10  S-DATE-YY                      PIC 99.
013300         10  S-DATE-MM                      PIC 99.
013400         10  S-DATE-DD                      PIC 99.
013500
       COPY DBSTAT OF COPYLIB.
028400
008200 01  TIME-BUFFER.
008300     05  CUR-TIME.
008400         10  CUR-HRS       PIC XX.
008500         10  CUR-MINS      PIC XX.
008600     05  CUR-SECS          PIC XX.
008700
       01  TRUE-VAL              PIC 1 VALUE B"1".

       01  WO-PLANNED-DATA.    COPY  DWOPLAN OF COPYLIB.

016600 01  WO-SCHED-DATA.      COPY DWOSCHED OF COPYLIB.
017600
       COPY WSCONTROL IN COPYLIB.
028500 LINKAGE SECTION.
029200 01  DBPARAMETERS.       COPY  DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
029600 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
029700                      CATREAD-PARMS.
030000 BEGIN-PGM.
           PERFORM 1-HSK THRU 1-HSK-CONT.
           PERFORM 6-MAIN THRU 6-MAIN-LOOP UNTIL VIEW-LASTKEY = 3.
031100 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-CRAFTS-MSTR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           CLOSE WO-SCHEDULE-FILE.
031600     GOBACK.
031700
031800 1-HSK.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT WO-CRAFTS-MSTR-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PLANNED-FILE.
           OPEN INPUT WO-SCHEDULE-FILE.
       1-HSK-CONT.
030200     MOVE 0 TO DATE-MODE.
030600     MOVE SPACES TO SELECT-BUFFER ERROR-BUFFER.
031900     CALL "TPWORD" USING PASSWORD-INFORMATION.
032300     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
032400     ACCEPT CURR-DATE FROM DATE.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ACT-KEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
032500     MOVE DATE-FLAG TO DATE-CODE.
032600     MOVE CURR-DATE-MM TO DATE-IN-MD.
032700     MOVE CURR-DATE-DD TO DATE-IN-DM.
032800     MOVE CURR-DATE-YY TO DATE-IN-YY.
032900     CALL "TDATECHK" USING DATE-CHECK-AREA.
033000     MOVE DATE-OUT-MD TO D-MM.
033100     MOVE DATE-OUT-DM TO D-DD.
033200     MOVE DATE-OUT-YY TO D-YY.
       6-MAIN.
033300     MOVE "FQ7CINQ" TO VIEW-CFNAME.
           MOVE ERROR-BUFFER TO SELECT-MSG-LINE.
           MOVE SELECT-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO SELECT-BUFFER.
035200     IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
035400     IF VIEW-LASTKEY NOT = 0 GO TO 6-MAIN.
035900     IF EQUIP-BUF = SPACES
036000         MOVE 31016 TO CATREAD-MSG-NUMBER
036200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036300         MOVE TRUE-VAL TO INDS (1) INDS (99)
036500         GO TO 6-MAIN.
036600
036700     IF DAT1-BUF NOT = SPACES
036800         IF DAT1-BUF NOT NUMERIC
036900             MOVE 35014 TO CATREAD-MSG-NUMBER
037100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
037200             MOVE TRUE-VAL TO INDS (2) INDS (99)
037400             GO TO 6-MAIN
037500         ELSE
037600         NEXT SENTENCE
037700     ELSE
037800     MOVE 30028 TO CATREAD-MSG-NUMBER
038000     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
038100     MOVE TRUE-VAL TO INDS (2) INDS (99)
038300     GO TO 6-MAIN.
038400
038500     IF DAT1-YY-9 IS NUMERIC
038600         IF DATE-FLAG = 1
038700             IF DAT1-MM-9 > 0 AND DAT1-MM-9 < 13
038800                 IF DAT1-DD-9 > 0 AND DAT1-DD-9 < 32
038900                     NEXT SENTENCE
039000                 ELSE
039100                 MOVE 35030 TO CATREAD-MSG-NUMBER
039300                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039400                 MOVE TRUE-VAL TO INDS (2) INDS (99)
039600                 GO TO 6-MAIN
039700             ELSE
039800             MOVE 35031 TO CATREAD-MSG-NUMBER
040000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040100             MOVE TRUE-VAL TO INDS (2) INDS (99)
040300             GO TO 6-MAIN
040400         ELSE
040500         IF DAT1-MM-9 > 0 AND DAT1-MM-9 < 32
040600             IF DAT1-DD-9 > 0 AND DAT1-DD-9 < 13
040700                 NEXT SENTENCE
040800             ELSE
040900             MOVE 35031 TO CATREAD-MSG-NUMBER
041100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041200             MOVE TRUE-VAL TO INDS (2) INDS (99)
041400             GO TO 6-MAIN
041500         ELSE
041600         MOVE 35030 TO CATREAD-MSG-NUMBER
041800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
041900         MOVE TRUE-VAL TO INDS (2) INDS (99)
042100         GO TO 6-MAIN
042200     ELSE
042300     MOVE 35032 TO CATREAD-MSG-NUMBER
042500     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
042600     MOVE TRUE-VAL TO INDS (2) INDS (99)
042800     GO TO 6-MAIN.
042900
043000     IF DAT2-BUF = SPACES
043100         NEXT SENTENCE
043200     ELSE
043300     IF DAT2-BUF NOT NUMERIC
043400         MOVE 35012 TO CATREAD-MSG-NUMBER
043600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043700         MOVE TRUE-VAL TO INDS (3) INDS (99)
043900         GO TO 6-MAIN
044000     ELSE
044100     IF DAT2-YY-9 IS NUMERIC
044200         IF DATE-FLAG = 1
044300             IF DAT2-MM-9 > 0 AND DAT2-MM-9 < 13
044400                 IF DAT2-DD-9 > 0 AND DAT2-DD-9 < 32
044500                     NEXT SENTENCE
044600                 ELSE
044700                 MOVE 35030 TO CATREAD-MSG-NUMBER
044900                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
045000                 MOVE TRUE-VAL TO INDS (3) INDS (99)
045200                 GO TO 6-MAIN
045300             ELSE
045400             MOVE 35031 TO CATREAD-MSG-NUMBER
045600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
045700             MOVE TRUE-VAL TO INDS (3) INDS (99)
045900             GO TO 6-MAIN
046000         ELSE
046100         IF DAT2-MM-9 > 0 AND DAT2-MM-9 < 32
046200             IF DAT2-DD-9 > 0 AND DAT2-DD-9 < 13
046300                 NEXT SENTENCE
046400             ELSE
046500             MOVE 35031 TO CATREAD-MSG-NUMBER
046700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
046800             MOVE TRUE-VAL TO INDS (3) INDS (99)
047000             GO TO 6-MAIN
047100         ELSE
047200         MOVE 35030 TO CATREAD-MSG-NUMBER
047400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
047500         MOVE TRUE-VAL TO INDS (3) INDS (99)
047700         GO TO 6-MAIN
047800     ELSE
047900     MOVE 35032 TO CATREAD-MSG-NUMBER
048100     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
048200     MOVE TRUE-VAL TO INDS (3) INDS (99)
048400     GO TO 6-MAIN.
048500
048600     MOVE DAT1-MM TO DATE-IN-MD.
048700     MOVE DAT1-DD TO DATE-IN-DM.
048800     MOVE DAT1-YY TO DATE-IN-YY.
048900     CALL "TDATECHK" USING DATE-CHECK-AREA.
049000     MOVE DATE-OUT-MD TO S-DATE-MM.
049100     MOVE DATE-OUT-DM TO S-DATE-DD.
049200     MOVE DATE-OUT-YY TO S-DATE-YY.
      *--------- ACCOUNT FOR CENTURY.
           IF S-DATE-YY > 70
               MOVE 19      TO S-DATE-CC
           ELSE
               MOVE 20      TO S-DATE-CC.
049300
049400     IF DAT2-BUF = SPACES
049500         MOVE "00000000" TO E-DATE-CN
049600     ELSE
049700     MOVE DAT2-MM TO DATE-IN-MD
049800     MOVE DAT2-DD TO DATE-IN-DM
049900     MOVE DAT2-YY TO DATE-IN-YY
050000     CALL "TDATECHK" USING DATE-CHECK-AREA
050100     MOVE DATE-OUT-MD TO E-DATE-MM
050200     MOVE DATE-OUT-DM TO E-DATE-DD
050300     MOVE DATE-OUT-YY TO E-DATE-YY
      *-------- ACCOUNT FOR CENTURY.
           IF E-DATE-YY > 70
               MOVE 19      TO E-DATE-CC
           ELSE
               MOVE 20      TO E-DATE-CC.
050400     SUBTRACT 1 FROM S-DATE-DD
050500     ADD 1 TO E-DATE-DD.
050600
050700     IF SHIFT-BUF = "1" OR "2" OR "3" OR "4" OR " "
050800         NEXT SENTENCE
050900     ELSE
051000     MOVE 35034 TO CATREAD-MSG-NUMBER
051200     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
051300     MOVE TRUE-VAL TO INDS (4) INDS (99)
051500     GO TO 6-MAIN.
051600
051700     IF CRAFT-BUF = SPACES
051800         MOVE 0 TO COND-WORD
051900     ELSE
           MOVE 0 TO COND-WORD
           MOVE CRAFT-BUF TO CRAFTREQD OF WCMFREC
           START WO-CRAFTS-MSTR-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
052500     IF COND-WORD = 17
052600         MOVE 35035 TO CATREAD-MSG-NUMBER
052800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
052900         MOVE TRUE-VAL TO INDS (5) INDS (99)
053100         GO TO 6-MAIN.
053900     MOVE 0 TO ACT-KEY.
054100     SORT SORT-FILE ASCENDING KEY SORT-DATE-CN SORT-WO
054200                            SORT-SORT-SHIFT
054300         INPUT PROCEDURE  7-SORT-IRECS
054400         OUTPUT PROCEDURE 8-WRITE-DATA.
054500     IF ACT-KEY = 0
054600         MOVE 40011 TO CATREAD-MSG-NUMBER
054800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SELECT-CMD-LINE
               MOVE SELECT-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
054900         GO TO 6-MAIN.
055000     MOVE 0 TO ACT-KEY.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.
055500     MOVE SPACES TO SCREEN-BUFF.
       6-MAIN-LOOP.
055100     MOVE "FQ7AFULL" TO VIEW-CFNAME.
055600     MOVE 42069 TO CATREAD-MSG-NUMBER.
055800     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCRN-MSG-LINE.
           MOVE 66132 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCRN-CMD-LINE.
055900     PERFORM 62-FILL-SCREEN THRU 62-FS-EXIT.
059400     IF EOF-SW = 1
               MOVE 31062 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCRN-MSG-LINE
               MOVE SPACES TO ERROR-BUFFER
059500         MOVE 0 TO EOF-SW
059600         MOVE 0 TO PAGE-HD
059700         MOVE 0 TO ACT-KEY.
056400     MOVE SCREEN-BUFF TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
057700     IF VIEW-LASTKEY = 1 OR 3 GO TO 2-EOJ.
058600     IF VIEW-LASTKEY = 2 GO TO 1-HSK-CONT.
059800     GO TO 6-MAIN-LOOP.
059900
060000 62-FILL-SCREEN.
060100     ADD 1 TO PAGE-HD.
060200     MOVE PAGE-HD TO PAGE-HD-Z.
060300     MOVE SPACES TO DATE-HOLD-CN WO-NUM-HOLD SHIFT-HOLD.
060400     ACCEPT TIME-BUFFER FROM TIME.
060500     MOVE CUR-HRS TO T-HR.
060600     MOVE CUR-MINS TO T-MN.
060700     MOVE HEAD-1 TO FIELD-1.
060800     MOVE HEAD-2 TO FIELD-2.
060900     MOVE HEAD-3 TO FIELD-3.
061000     MOVE HEAD-4 TO FIELD-4.
061100     MOVE 4 TO FIELD-CTR.
061200     PERFORM 62-READ-FILE THRU 62-RF-EXIT
061300                   UNTIL FIELD-CTR > 21.
061400
061500 62-FS-EXIT.    EXIT.
061600
061700 62-READ-FILE.
061800     ADD 1 TO ACT-KEY.
062400     IF ACT-KEY > MAX-KEY
062500         MOVE 1 TO EOF-SW
062600         MOVE 30 TO FIELD-CTR
               CLOSE OUT-FILE
062700         GO TO 62-RF-EXIT.
062000     READ OUT-FILE    INVALID KEY
062100         MOVE 1 TO EOF-SW
062200         MOVE 30 TO FIELD-CTR
               CLOSE OUT-FILE
062300         GO TO 62-RF-EXIT.
062800     PERFORM 62-WRITE-LINE.
062900
063000 62-RF-EXIT.    EXIT.
063100
063200 62-WRITE-LINE.
063300     IF OUT-DATE-CN NOT = DATE-HOLD-CN
063400         MOVE OUT-DATE-CN TO DATE-HOLD-CN
063500         MOVE SPACES TO WO-NUM-HOLD SHIFT-HOLD.
063600     IF OUT-WO = WO-NUM-HOLD
063700         NEXT SENTENCE
063800     ELSE
063900     MOVE OUT-MM TO DATE-IN-MD
064000     MOVE OUT-DD TO DATE-IN-DM
064100     MOVE OUT-YY TO DATE-IN-YY
064200     CALL "TDATECHK" USING DATE-CHECK-AREA
064300     MOVE DATE-OUT-MD TO SCH-MM
064400     MOVE DATE-OUT-DM TO SCH-DD
064500     MOVE DATE-OUT-YY TO SCH-YY
064600     MOVE "/"          TO SLASH1 SLASH2
064700     MOVE OUT-WO       TO WO-NUM-SCH WO-NUM-HOLD
064800     MOVE OUT-EQ-NUM   TO EQP-SCH
064900     MOVE SPACES       TO SHIFT-HOLD
065000     MOVE SPACES       TO DESC-SCH
065100     PERFORM 62-GET-DESC THRU 62-GD-EXIT
065200     MOVE DATA-LINE-1  TO FIELD-HOLD
065300     PERFORM 62-WRITE-FIELDS.
065400     IF OUT-SHIFT NOT = SHIFT-HOLD
065500         MOVE OUT-SHIFT TO SHIFT-SCH SHIFT-HOLD
065600         MOVE "SHIFT: " TO SHIFT-HD
065700     ELSE
065800     MOVE SPACES TO SHIFT-HD SHIFT-SCH.
065900     MOVE OUT-QTY      TO QTY-SCH.
066000     MOVE OUT-CRAFT    TO CRAFT-SCH.
066100     MOVE OUT-HRS      TO HR-3.
066200     MOVE "."          TO HR-DOT.
066300     MOVE OUT-TENTHS   TO HR-T.
066400     IF OUT-REM NOT = SPACES
066500         MOVE "REMARKS:"  TO REMS-HD
066600         MOVE OUT-REM     TO REMS-SCH
066700     ELSE
066800     MOVE SPACES TO REMS-HD REMS-SCH.
066900     MOVE DATA-LINE-2  TO FIELD-HOLD.
067000     PERFORM 62-WRITE-FIELDS.
067100
067200 62-WRITE-FIELDS.
067300     ADD 1 TO FIELD-CTR.
067400     IF FIELD-CTR = 5
067500         MOVE FIELD-HOLD TO FIELD-5
067600     ELSE
067700     IF FIELD-CTR = 6
067800         MOVE FIELD-HOLD TO FIELD-6
067900     ELSE
068000     IF FIELD-CTR = 7
068100         MOVE FIELD-HOLD TO FIELD-7
068200     ELSE
068300     IF FIELD-CTR = 8
068400         MOVE FIELD-HOLD TO FIELD-8
068500     ELSE
068600     IF FIELD-CTR = 9
068700         MOVE FIELD-HOLD TO FIELD-9
068800     ELSE
068900     IF FIELD-CTR = 10
069000         MOVE FIELD-HOLD TO FIELD-10
069100     ELSE
069200     IF FIELD-CTR = 11
069300         MOVE FIELD-HOLD TO FIELD-11
069400     ELSE
069500     IF FIELD-CTR = 12
069600         MOVE FIELD-HOLD TO FIELD-12
069700     ELSE
069800     IF FIELD-CTR = 13
069900         MOVE FIELD-HOLD TO FIELD-13
070000     ELSE
070100     IF FIELD-CTR = 14
070200         MOVE FIELD-HOLD TO FIELD-14
070300     ELSE
070400     IF FIELD-CTR = 15
070500         MOVE FIELD-HOLD TO FIELD-15
070600     ELSE
070700     IF FIELD-CTR = 16
070800         MOVE FIELD-HOLD TO FIELD-16
070900     ELSE
071000     IF FIELD-CTR = 17
071100         MOVE FIELD-HOLD TO FIELD-17
071200     ELSE
071300     IF FIELD-CTR = 18
071400         MOVE FIELD-HOLD TO FIELD-18
071500     ELSE
071600     IF FIELD-CTR = 19
071700         MOVE FIELD-HOLD TO FIELD-19
071800     ELSE
071900     IF FIELD-CTR = 20
072000         MOVE FIELD-HOLD TO FIELD-20
072100     ELSE
072200     IF FIELD-CTR = 21
072300         MOVE FIELD-HOLD TO FIELD-21.
073000
073100 62-GET-DESC.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM-HOLD TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
073600     IF COND-WORD = 17
073700         MOVE "****  DESCRIPTION NOT FOUND" TO DESC-SCH
073800         GO TO 62-GD-EXIT.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
074800     IF COND-WORD = 15
074900         MOVE "****  DESCRIPTION NOT FOUND" TO DESC-SCH
           ELSE
           MOVE DESCRIPTION-1-P TO DESC-SCH.
075700
075800 62-GD-EXIT.    EXIT.
075900
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

076400 999-CATREAD.
076500     MOVE SPACES TO ERROR-BUFFER.
076600     CALL "CCATREAD" USING CATREAD-PARMS.
076700     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
077400 999-CATREAD-EXIT.    EXIT.
077500
077600 7-SORT-IRECS.
           PERFORM 7-SORT-MAIN THRU 7-SORT-M-EXIT.

       7-SORT-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE EQUIP-BUF TO EQPNUM OF WSFREC.
           START WO-SCHEDULE-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WSF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
080200         MOVE 0 TO ACT-KEY
               GO TO 7-SORT-M-EXIT.
           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT
078600         UNTIL COND-WORD = 17.

       7-SORT-M-EXIT.    EXIT.

078700 70-SORT-DBGET.
           MOVE 0 TO COND-WORD.
           READ WO-SCHEDULE-FILE NEXT INTO WO-SCHED-DATA
               AT END    MOVE 17 TO COND-WORD.
           IF EQPNUM OF WSFREC NOT = EQUIP-BUF MOVE 17 TO COND-WORD.
           IF WSF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 70-SORT-DBGET-EXIT.
080300     MOVE SCHED-EQ-NUM  TO SORT-EQ-NUM.
080400     IF EQ1 = SORT-EQ1 OR SPACES
080500       IF EQ2 = SORT-EQ2 OR SPACES
080600         IF EQ3 = SORT-EQ3 OR SPACES
080700           IF EQ4 = SORT-EQ4 OR SPACES
080800             IF EQ5 = SORT-EQ5 OR SPACES
080900               IF EQ6 = SORT-EQ6 OR SPACES
081000                   NEXT SENTENCE
081100               ELSE
081200               GO TO 70-SORT-DBGET
081300             ELSE
081400             GO TO 70-SORT-DBGET
081500           ELSE
081600           GO TO 70-SORT-DBGET
081700         ELSE
081800         GO TO 70-SORT-DBGET
081900       ELSE
082000       GO TO 70-SORT-DBGET
082100     ELSE
082200     GO TO 70-SORT-DBGET.
082300
082400     IF DAT2-BUF NOT = SPACES
082500         IF SCHED-DATE-CN > S-DATE-CN AND
082600            SCHED-DATE-CN < E-DATE-CN
082700                NEXT SENTENCE
082800         ELSE
082900         GO TO 70-SORT-DBGET
083000     ELSE
083100     IF SCHED-DATE-CN = S-DATE-CN
083200         NEXT SENTENCE
083300     ELSE
083400     GO TO 70-SORT-DBGET.
083500
083600     MOVE SCHED-Z TO ZONE-BUF.
083700     MOVE ZEROS TO TIME-IN.
083800     CALL "TGETSHFT" USING SHIFT-DATA DBPARAMETERS.
084200     IF SHIFT-BUF = SCHED-SHFT OR SPACES
084300       IF CRAFT-BUF = SCHED-CRAFT OR SPACES
084400         MOVE SCHED-ZP      TO SORT-ZP
084500         MOVE SCHED-WO      TO SORT-WO
084600         MOVE SCHED-EQ-NUM  TO SORT-EQ-NUM
084700         MOVE SCHED-DATE-CN TO SORT-DATE-CN
084800         MOVE SCHED-SHFT    TO SORT-SHIFT
084900         MOVE SCHED-QTY     TO SORT-QTY
085000         MOVE SCHED-CRAFT   TO SORT-CRAFT
085100         MOVE SCHED-HOURS   TO SORT-HOURS
085200         MOVE SCHED-REM     TO SORT-REM
085300         IF SCHED-SHFT = "1"
085400             MOVE "B" TO SORT-SORT-SHIFT
085500             RELEASE SORT-REC
085600         ELSE
085700         IF SCHED-SHFT = "2"
085800             MOVE "C" TO SORT-SORT-SHIFT
085900             RELEASE SORT-REC
086000         ELSE
086100         IF SCHED-SHFT = "3"
086200             IF CODE-BUF = "3"
086300                 MOVE "A" TO SORT-SORT-SHIFT
086400                 RELEASE SORT-REC
086500             ELSE
086600             MOVE "D" TO SORT-SORT-SHIFT
086700             RELEASE SORT-REC
086800         ELSE
086900         MOVE "A" TO SORT-SORT-SHIFT
087000         RELEASE SORT-REC.
087100
087200 70-SORT-DBGET-EXIT.    EXIT.
087300
087600 8-WRITE-DATA.
           MOVE 0 TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           PERFORM 8-WD-CONT THRU 8-WD-EXIT.
       8-WD-CONT.
087700     RETURN SORT-FILE AT END
087800         MOVE ACT-KEY TO MAX-KEY
087900         GO TO 8-WD-EXIT.
088000     ADD 1 TO ACT-KEY.
088100     MOVE SORT-REC TO OUT-DATA.
088200     WRITE OUT-REC    INVALID KEY GO TO 8-WD-EXIT.
088500     GO TO 8-WD-CONT.
088600
088700 8-WD-EXIT.    EXIT.
