000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ8INQ.
000700********************************************************************
000800***  NOTE:  EXECUTIVE VERSION OF PLNR/ENGR/SCHD BACKLOG INQUIRY ****
000900********************************************************************
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER.     AS400.
001300 OBJECT-COMPUTER.     AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
001400 DATA DIVISION.
       FILE SECTION.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
001500 WORKING-STORAGE SECTION.
001600 77  ARG-NO                      PIC 9(9).
       COPY CATREAD OF COPYLIB.
006100 01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
       01  ERROR-BUFFER                PIC X(80).
       01  LAST-WO-BUFF.            COPY MLASTWO OF COPYLIB.
002400 01  PASSWORD-INFORMATION.
002500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ8BLOG ".
002600     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
002700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002800     05  PROGRAM-DESCRIPTION.
002900         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " DISPLAYS PLANNED".
                   15  FILLER      PIC X(12) VALUE " WORK ORDER ".
                   15  FILLER      PIC X(11) VALUE "BACKLOG BY ".
                   15  FILLER      PIC X(17) VALUE "PLANNER, ENGINEER".
                   15  FILLER      PIC XXX   VALUE ",  ".
003100         10  PROG-DESC-B.
                   15  FILLER      PIC X(12) VALUE "OR SCHEDULER".
                   15  FILLER      PIC X(48) VALUE SPACES.
003300         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003500     05  PASSWORD-FLAG       PIC X.
       COPY DBSTAT OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       01  WLNU-STATUS             PIC XX.
006700 PROCEDURE DIVISION.
006800 START-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN.
014200 2-EOJ.
           CLOSE WO-LAST-NUM-USED.
014700     GOBACK.
       1-HSK.
           OPEN INPUT WO-LAST-NUM-USED.
006900     MOVE LOW-VALUES TO STATUS-AREA VIEW-COMAREA.
011500     MOVE 0 TO COND-WORD.
011600     MOVE SPACES TO LAST-WO-BUFF.
011700     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
012700     MOVE DATE-FLAG-SW TO DATE-FLAG.
013000     CALL "TPWORD" USING PASSWORD-INFORMATION.
013400     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
013600 6-MAIN.
013700     CALL "CLQ8INQ" USING DBPARAMETERS
013800                          VIEW-COMAREA
013900                          CATREAD-PARMS.
