000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQ8SUB.
      *C
      *C  09/11/1996      CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.     AS400.
000700 OBJECT-COMPUTER.     AS400.
       COPY SPECIALN IN COPYLIB.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001200     SELECT OUT-FILE
               ASSIGN TO DATABASE-OUTFILQ8
               ORGANIZATION IS RELATIVE
001300         ACCESS MODE IS RANDOM
001400         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
001600     SELECT PRINT-FILE
001700         ASSIGN TO PRINTER-MCPRT.
001500     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ACT-KEY
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1102
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
001800 DATA DIVISION.
001900 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                    PIC X(2000).
002400 FD  OUT-FILE RECORD CONTAINS 100 CHARACTERS
002500     LABEL RECORDS ARE OMITTED
002600     DATA RECORD IS OUT-REC.
002700 01  OUT-REC.
           05  OUT-DATA.
002800         10  OUT-EPS               PIC XXXX.
002900         10  OUT-STAT-NUM          PIC X.
003000         10  OUT-WOSTAT            PIC XX.
003100         10  OUT-DZ                PIC XXXX.
003200         10  OUT-VPE               PIC X.
003300         10  OUT-WONUM             PIC X(10).
003400         10  OUT-WODESC            PIC X(30).
003500         10  OUT-EQNUM             PIC X(06).
003600         10  OUT-EXPCL             PIC X(08).
003700         10  OUT-BUDG              PIC X(13).
003800         10  OUT-REQNO             PIC X(12).
               10  FILLER                PIC X(9).
003900
002000 FD  PRINT-FILE RECORD CONTAINS 80 CHARACTERS
002100     LABEL RECORDS ARE OMITTED
002200     DATA RECORD IS PRINT-REC.
002300 01  PRINT-REC                     PIC X(80).

004000 SD  SORT-FILE RECORD CONTAINS 91 CHARACTERS
004100     DATA RECORD IS SORT-REC.
004200 01  SORT-REC.
004300     05  SORT-EPS.
004400         10  EPS-S1                PIC X.
004500         10  EPS-S2                PIC X.
004600         10  EPS-S3                PIC X.
004700         10  EPS-S4                PIC X.
004800     05  SORT-STAT-NUM             PIC X.
004900     05  SORT-WOSTAT               PIC XX.
005000     05  SORT-DZ                   PIC XXXX.
005100     05  SORT-VPE                  PIC X.
005200     05  SORT-WONUM                PIC X(10).
005300     05  SORT-WODESC               PIC X(30).
005400     05  SORT-EQNUM.
005500         10  SORT-EQ1              PIC X.
005600         10  SORT-EQ2              PIC X.
005700         10  SORT-EQ3              PIC X.
005800         10  SORT-EQ4              PIC X.
005900         10  SORT-EQ5              PIC X.
006000         10  SORT-EQ6              PIC X.
006100     05  SORT-EXPCL                PIC X(08).
006200     05  SORT-EXPCL-NUM REDEFINES SORT-EXPCL.
006300         10  S-EXP-NUM-8.
006400             15  S-EXP-NUM-6       PIC 9(06).
006500             15  S-EXP-NUM-78      PIC 9(02).
006600     05  SORT-BUDG.
006700         10  SORT-BUD-1            PIC X(01).
006800         10  SORT-BUD-2            PIC X(01).
006900         10  SORT-BUD-3            PIC X(01).
007000         10  SORT-BUD-4            PIC X(01).
007100         10  SORT-BUD-5            PIC X(01).
007200         10  SORT-BUD-6            PIC X(01).
007300         10  SORT-BUD-7            PIC X(01).
007400         10  SORT-BUD-8            PIC X(01).
007500         10  SORT-BUD-9            PIC X(01).
007600         10  SORT-BUD-10           PIC X(01).
007700         10  SORT-BUD-11           PIC X(01).
007800         10  SORT-BUD-12           PIC X(01).
007900         10  SORT-BUD-13           PIC X(01).
008000     05  SORT-REQNO.
008100         10  SORT-REQ-1            PIC X(01).
008200         10  SORT-REQ-2            PIC X(01).
008300         10  SORT-REQ-3            PIC X(01).
008400         10  SORT-REQ-4            PIC X(01).
008500         10  SORT-REQ-5            PIC X(01).
008600         10  SORT-REQ-6            PIC X(01).
008700         10  SORT-REQ-7            PIC X(01).
008800         10  SORT-REQ-8            PIC X(01).
008900         10  SORT-REQ-9            PIC X(01).
009000         10  SORT-REQ-10           PIC X(01).
009100         10  SORT-REQ-11           PIC X(01).
009200         10  SORT-REQ-12           PIC X(01).
009300
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.

009400 WORKING-STORAGE SECTION.
009500 77  ACT-KEY                       PIC 9(9).
009600 77  ADV-CTR       VALUE 1         PIC 9.
009700 77  ALL-RECORDS-WRITTEN-SW        PIC X    VALUE SPACE.
009900 77  DZ-COMP       VALUE SPACES    PIC X(04).
010000 77  EOF-SW        VALUE 0         PIC 9.
010100 77  EPS-CTR       VALUE 0         PIC 9.
010200 77  EXP-SW                        PIC X.
010300     88  EXP-SW-ON VALUE "R".
       77  FIELD-CTR                     PIC 99.
010500 77  LINE-LIMIT    VALUE 16        PIC S99.
010600 77  LINE-K        VALUE 0         PIC S99.
010700 77  NO-REC-SW     VALUE 0         PIC 9.
011100 77  RECS-RELEASED                 PIC 9(5).
011200 77  RECORDS-READ                  PIC 9(5).
011300 77  REQ-SW                        PIC X.
011600 77  SKIP-LINE     VALUE 0         PIC 9.
011700 77  STAT-EDIT                     PIC XX.
011800 77  STAT-SORT     VALUE "0"       PIC X.
011900 77  BU-DISPLAY-AREA               PIC X(53).
012000 77  CURDATE-BUFFER                PIC X(6).
012200 77  FIELD-HOLD                    PIC X(79).
012300 77  HEADING-DOTS  VALUE ALL "-"   PIC X(79).
012400 77  HOLD-BUFFER                   PIC X(90).
012600 77  RETURN-CODE-2                 PIC XX VALUE SPACES.
012700
014100 01  BR-SW.
014200     05  B-SW                      PIC X.
014300     05  R-SW                      PIC X.
014400
       COPY CPYIND  IN COPYLIB.

       COPY TDATESUB OF COPYLIB.

014500 01  DATE-HOLD.
014600     05  DH-MM                     PIC XX.
014700     05  DH-DD                     PIC XX.
014800     05  DH-YY                     PIC XX.
014900
015000 01  DETAIL-REC.
015100     05  EPS-CODE                  PIC XXXX.
015200     05  FILLER    VALUE SPACES    PIC XX.
015300     05  STATUS-CODE               PIC XX.
015400     05  FILLER    VALUE SPACES    PIC XX.
015500     05  DEPT-ZONE                 PIC XXXX.
015600     05  FILLER    VALUE SPACES    PIC XX.
015700     05  EQP-NUM                   PIC X(06).
015800     05  FILLER    VALUE SPACE     PIC X.
015900     05  VPE-CODE                  PIC X.
016000     05  WO-NUM                    PIC X(10).
016100     05  FILLER    VALUE SPACES    PIC X.
016200     05  DESC                      PIC X(30).
016300     05  FILLER    VALUE SPACES    PIC X.
016400     05  EBR-NUM.
016500         10  EX-NUM.
016600             15  E-NUM             PIC X(08).
016700             15  FILLER            PIC X(05).
016800         10  BUD-NUM REDEFINES EX-NUM.
016900             15  B-NUM             PIC X(13).
017000         10  REQ-NUM REDEFINES EX-NUM.
017100             15  R-NUM             PIC X(12).
017200             15  FILLER            PIC X.
017300
017400 01  EPS-COMP.
017500     05  EPS-C1                    PIC X  VALUE SPACE.
017600     05  EPS-C2                    PIC X  VALUE SPACE.
017700     05  EPS-C3                    PIC X  VALUE SPACE.
017800     05  EPS-C4                    PIC X  VALUE SPACE.
017900
       01  ERROR-BUFFER                  PIC X(80).

018000 01  EXP-ADJ.
018100     05  EXP-1                     PIC X.
018200     05  EXP-2                     PIC X.
018300     05  EXP-3                     PIC X.
018400     05  EXP-4                     PIC X.
018500     05  EXP-5                     PIC X.
018600     05  EXP-6                     PIC X.
018700     05  EXP-7                     PIC X.
018800     05  EXP-8                     PIC X.
018900
019000 01  EXP-BUFFER.
019100     05  EXP-R1                    PIC X(08).
019200     05  EXP-R1-8 REDEFINES EXP-R1 PIC 9(08).
019300     05  EXP-R2                    PIC X(08).
019400     05  EXP-R2-8 REDEFINES EXP-R2 PIC 9(08).
           05  EXP-CMD-LINE              PIC X(79).
           05  EXP-ERR-LINE              PIC X(79).
019500
       01  FILE-STATUSES.
           05  DSPLY-STATUS              PIC XX.
           05  OF-STATUS                 PIC XX.
           05  WLNU-STATUS               PIC XX.
           05  WPF-STATUS                PIC XX.

019600 01  FILL-SCREEN.
019700     05  FIELD-1                   PIC X(79).
019800     05  FIELD-2                   PIC X(79).
019900     05  FIELD-3                   PIC X(79).
020000     05  FIELD-4                   PIC X(79).
020100     05  FIELD-5                   PIC X(79).
020200     05  FIELD-6                   PIC X(79).
020300     05  FIELD-7                   PIC X(79).
020400     05  FIELD-8                   PIC X(79).
020500     05  FIELD-9                   PIC X(79).
020600     05  FIELD-10                  PIC X(79).
020700     05  FIELD-11                  PIC X(79).
020800     05  FIELD-12                  PIC X(79).
020900     05  FIELD-13                  PIC X(79).
021000     05  FIELD-14                  PIC X(79).
021100     05  FIELD-15                  PIC X(79).
021200     05  FIELD-16                  PIC X(79).
021300     05  FIELD-17                  PIC X(79).
021400     05  FIELD-18                  PIC X(79).
021500     05  FIELD-19                  PIC X(79).
021600     05  FIELD-20                  PIC X(79).
021700     05  FIELD-21                  PIC X(79).
021800     05  FIELD-22                  PIC X(79).
021900     05  FIELD-MESSAGE             PIC X(79).
           05  FIELD-CMD-LINE            PIC X(79).
           05  FIELD-MSG-LINE            PIC X(79).
022000
029500 01  HEADING-DT-TM.
029600     05  FILLER  PIC X(19) VALUE SPACES.
029700     05  FILLER  PIC X(13) VALUE "PRINT DATE:  ".
029800     05  P-DATE.
029900         10  MM-PD   PIC XX.
030000         10  FILLER  PIC X.
030100         10  DD-PD   PIC XX.
030200         10  FILLER  PIC X.
030300         10  YY-PD   PIC XX.
030400     05  FILLER  PIC X(15) VALUE "        TIME:  ".
030500     05  P-TIME  PIC X(04).
030600     05  FILLER  PIC X(20) VALUE SPACES.
030700
030800 01  HEADING-1.
030900     05  FILLER  PIC X(20) VALUE "       P L A N N E D".
031000     05  FILLER  PIC X(20) VALUE "   W O R K O R D E R".
031100     05  FILLER  PIC X(19) VALUE "   B A C K L O G   ".
031200     05  FILLER  PIC X(20) VALUE "S C R E E N         ".
031300
031400 01  HEADING-2.
031500     05  EPS-HEAD    PIC X(06).
031600     05  FILLER      PIC X(04)   VALUE "ST  ".
031700     05  DZ-HEAD     PIC X(06).
031800     05  FILLER      PIC X(08)   VALUE "EQP NO  ".
031900     05  FILLER      PIC X(11)   VALUE "WO NUMBER  ".
032000     05  FILLER      PIC X(11)   VALUE "DESCRIPTION".
032100     05  FILLER      PIC X(20)   VALUE SPACES.
032200     05  EBR-HEAD.
032300         10  EBR-1   PIC X.
032400         10  EBR-12  PIC X(12).
032500
032600 01  HEADING-3.
032700     05  FILLER          PIC X(22) VALUE SPACES.
032800     05  FILLER          PIC X(04) VALUE "*** ".
032900     05  EBR-NAM         PIC X(13) VALUE SPACES.
033000     05  FILLER          PIC X(03) VALUE "-  ".
033100     05  EBR-VAL.
033200         10  E-VALUE.
033300             15  E-VAL   PIC X(08).
033400             15  FILLER  PIC X(05).
033500         10  B-VALUE REDEFINES E-VALUE.
033600             15  B-VAL   PIC X(13).
033700         10  R-VALUE REDEFINES E-VALUE.
033800             15  R-VAL   PIC X(12).
033900             15  FILLER  PIC X(01).
034000     05  FILLER          PIC X(04) VALUE " ***".
034100     05  FILLER          PIC X(20) VALUE SPACES.
034200
034300 01  HOLD-VALUES.
034400     05  EPS-HOLD    VALUE SPACES  PIC X(04).
034500     05  STAT-HOLD   VALUE SPACES  PIC X(02).
034600     05  DZ-HOLD     VALUE SPACES  PIC X(04).
034700
       COPY IOFEEDBACK IN COPYLIB.

       COPY JCWAREA    IN COPYLIB.

039500 01  LAST-WO-BUFF.                COPY MLASTWO OF COPYLIB.

       COPY OVRPFDATA IN COPYLIB.

036400 01  PASSED-SPOOL-PRT              PIC S9(2)  COMP.

012800 01  PASSWORD-INFORMATION.
012900     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TQ8SUB  ".
013000     05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
013100     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
013200     05  PROGRAM-DESCRIPTION.
013300         10  PROG-DESC-A.
                   15  FILLER      PIC X(17) VALUE " DISPLAYS PLANNED".
                   15  FILLER      PIC X(12) VALUE " WORK ORDER ".
                   15  FILLER      PIC X(12) VALUE "BACKLOGS BY ".
                   15  FILLER      PIC X(11) VALUE "STATUS FOR ".
                   15  FILLER      PIC X(8)  VALUE "PLANNERS".
013500         10  PROG-DESC-B.
                   15  FILLER      PIC X(13) VALUE ", ENGINEERS, ".
                   15  FILLER      PIC X(15) VALUE " AND SCHEDULERS".
                   15  FILLER      PIC X(32) VALUE SPACES.
013700         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
013900     05  PASSWORD-FLAG       PIC X.
014000
022100 01  SCREENO-BUFFER.
022200     05  EPS-BUFFER.
022300         10  ENG-BUF.
022400             15  E-BUF-1           PIC X.
022500             15  E-BUF-234         PIC XXX.
022600         10  PLN-BUF.
022700             15  P-BUF-1           PIC X.
022800             15  P-BUF-234         PIC XXX.
022900         10  SCD-BUF.
023000             15  S-BUF-1           PIC X.
023100             15  S-BUF-234         PIC XXX.
023200     05  WOSTAT-BUF.
023300         10  STAT-BUF-1            PIC XX.
023400         10  STAT-BUF-2            PIC XX.
023500         10  STAT-BUF-3            PIC XX.
023600     05  DZ-BUF.
023700         10  DEPT-BUF              PIC XXXX.
023800         10  ZONE-BUF.
023900             15  Z-BUF-1           PIC X.
024000             15  Z-BUF-2           PIC X.
024100             15  FILLER            PIC XX.
024200     05  EQNUM-BUF.
024300         10  EQ1                   PIC X.
024400         10  EQ2                   PIC X.
024500         10  EQ3                   PIC X.
024600         10  EQ4                   PIC X.
024700         10  EQ5                   PIC X.
024800         10  EQ6                   PIC X.
024900     05  EBR-BUF.
025000         10  EXPENSE-BUF.
025100             15  EXP-BUF-1         PIC X.
025200             15  EXP-BUF-8         PIC X(07).
025300         10  BUDGET-BUF.
025400             15  BUD-BUF-1         PIC X.
025500             15  BUD-BUF-12.
025600                 20  BUD-2-3       PIC X(02).
025700                 20  BUD-S1        PIC X(01).
025800                 20  BUD-5-6       PIC X(02).
025900                 20  BUD-S2        PIC X(01).
026000                 20  BUD-8-9       PIC X(02).
026100                 20  BUD-S3        PIC X(01).
026200                 20  BUD-11-13     PIC X(03).
026300         10  BUD-BUF-REDEF REDEFINES BUDGET-BUF.
026400             15  BG-1              PIC X.
026500             15  BG-2              PIC X.
026600             15  BG-3              PIC X.
026700             15  BG-4              PIC X.
026800             15  BG-5              PIC X.
026900             15  BG-6              PIC X.
027000             15  BG-7              PIC X.
027100             15  BG-8              PIC X.
027200             15  BG-9              PIC X.
027300             15  BG-10             PIC X.
027400             15  BG-11             PIC X.
027500             15  BG-12             PIC X.
027600             15  BG-13             PIC X.
027700         10  REQ-BUF.
027800             15  REQ-BUF-1         PIC X.
027900             15  REQ-BUF-11        PIC X(11).
028000         10  REQ-BUF-REDEF REDEFINES REQ-BUF.
028100             15  RQ-1              PIC X.
028200             15  RQ-2              PIC X.
028300             15  RQ-3              PIC X.
028400             15  RQ-4              PIC X.
028500             15  RQ-5              PIC X.
028600             15  RQ-6              PIC X.
028700             15  RQ-7              PIC X.
028800             15  RQ-8              PIC X.
028900             15  RQ-9              PIC X.
029000             15  RQ-10             PIC X.
029100             15  RQ-11             PIC X.
029200             15  RQ-12             PIC X.
029300     05  PRINT-BUF                 PIC X.
           05  SCREEN-CMD-LINE           PIC X(79).
           05  SCREEN-ERR-LINE           PIC X(79).
029400
036000 01  SCREEN-PRINT-PARMS.
036100     05  PRINTCNTL                 PIC S9(4) VALUE ZERO COMP.
036200     05  PAGECNTL                  PIC S9(4) VALUE 49   COMP.
036300     05  SPOOLFIL-OPEN-SW          PIC X     VALUE "N".
036500
036600 01  SEARCH-STATUSES.
036700     05  SCREEN-STATUSES.
               10  ST-0                  PIC XX.
036800         10  ST-1                  PIC XX.
036900         10  ST-2                  PIC XX.
037000         10  ST-3                  PIC XX.

037100     05  SILENT-STATUSES.
037200         10  ST-4                  PIC XX.
037300         10  ST-5                  PIC XX.
037400         10  ST-6                  PIC XX.
037500         10  ST-7                  PIC XX.
037600         10  ST-8                  PIC XX.
037700         10  ST-9                  PIC XX.
037800
       COPY DBSTAT OF COPYLIB.

037900 01  TIME-BUFFER.
038000     05  CUR-TIME                  PIC X(4).
038100     05  FILLER                    PIC XX.
038200
       01  TRUE-VAL                      PIC 1 VALUE B"1".

039300 01  WO-PLANNED-DATA.             COPY DWOPLAN OF COPYLIB.

038300 01  WORK-ARGUMENTS.
038400     05  ARGUMENT                  PIC XX.
038500     05  ANS                       PIC X.
038600
       COPY WSCONTROL IN COPYLIB.

038700 01  ZONE-BUFFERS.
038800     05  ZONE-BUF1                 PIC XXXX.
038900     05  ZONE-BUF2                 PIC XXXX.
039000     05  ZONE-BUF3                 PIC XXXX.
039100
039800 LINKAGE SECTION.
040500 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY CATREAD  OF COPYLIB.
040900 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA
041000                      CATREAD-PARMS.
041200 BEGIN-PROCESSING.
           PERFORM 1-HSK.
       BP-MAIN.
           PERFORM 6-MAIN.
       2-EOJ.
           IF PRINT-BUF = "P" CLOSE PRINT-FILE.
045300     IF VIEW-LASTKEY = 1 MOVE 2 TO VIEW-LASTKEY.
045400     IF VIEW-LASTKEY = 2
               CLOSE OUT-FILE
               GO TO BP-MAIN.
           CLOSE OUT-FILE.
           CLOSE DISPLAY-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PLANNED-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PLANNED-FILE.
041300     MOVE 0 TO DATE-MODE.
041700     MOVE SPACES TO LAST-WO-BUFF.
041800     MOVE 1 TO ACT-KEY.
           MOVE 0 TO COND-WORD.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
042100     MOVE DATE-FLAG-SW TO DATE-FLAG.
042200     MOVE DATE-FLAG TO DATE-CODE.
042400     CALL "TPWORD" USING PASSWORD-INFORMATION.
042800     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
043100     ACCEPT CURDATE-BUFFER FROM DATE.
           MOVE CURDATE-BUFFER TO P-DATE.
043200     MOVE MM-PD TO DH-MM.
043300     MOVE DD-PD TO DH-DD.
043400     MOVE YY-PD TO DH-YY.
043500     MOVE DATE-HOLD TO DATE-IN.
043600     CALL "TDATECHK" USING DATE-CHECK-AREA.
043700     MOVE DATE-OUT-MD TO MM-PD.
043800     MOVE DATE-OUT-DM TO DD-PD.
043900     MOVE DATE-OUT-YY TO YY-PD.

045900 6-MAIN.
046000     PERFORM 60-WRITE-SCREEN THRU 60-WS-EXIT.
046100     PERFORM 61-SORT-INPUT.
046200     PERFORM 62-DISPLAY-OUTPUT.

046500 60-WRITE-SCREEN.
046600     MOVE 0 TO ACT-KEY.
046700     MOVE 0 TO LINE-K EOF-SW.
046800     MOVE 16 TO LINE-LIMIT.
046900     MOVE 1 TO ADV-CTR.
047000     ACCEPT TIME-BUFFER FROM TIME.
047100     MOVE CUR-TIME TO P-TIME.
047200     MOVE SPACES TO WORK-ARGUMENTS HOLD-VALUES BR-SW.
041400     MOVE SPACES TO EBR-VAL REQ-SW EXP-SW.
041500     MOVE SPACES TO ERROR-BUFFER FILL-SCREEN.
047500     MOVE "N" TO ALL-RECORDS-WRITTEN-SW.
051700     MOVE 0 TO NO-REC-SW.
052200
052300 60-SHOWFORM.
           MOVE SPACES TO SCREENO-BUFFER.
047600     MOVE "FQ8SELEC" TO VIEW-CFNAME.
           IF TRUE-VAL = INDS (99)
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE.
           MOVE SCREENO-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
047700     PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO SCREENO-BUFFER.
053900     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
055600     IF PRINT-BUF = " "
055700         NEXT SENTENCE
055800     ELSE
055900     MOVE "P" TO PRINT-BUF
           PERFORM 996-OVERRIDE-PRINT-FILE
           OPEN OUTPUT PRINT-FILE.
056500     IF EPS-BUFFER = SPACES
056600**********************************************************************
056700**    MESSAGE 041/016:
056800** ONE ENTRY REQUIRED:
056900**********************************************************************
057000         MOVE 41016 TO CATREAD-MSG-NUMBER
057200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
057300         MOVE TRUE-VAL TO INDS (1) INDS (99)
057500         GO TO 60-SHOWFORM.
057600     MOVE 0 TO EPS-CTR.
057700     IF ENG-BUF NOT = SPACES ADD 1 TO EPS-CTR.
057800     IF PLN-BUF NOT = SPACES ADD 1 TO EPS-CTR.
057900     IF SCD-BUF NOT = SPACES ADD 1 TO EPS-CTR.
058000     IF EPS-CTR > 1
058100**********************************************************************
058200**    MESSAGE 041/017:
058300** ONLY ONE ENTRY PERMITTED:
058400**********************************************************************
058500         MOVE 41017 TO CATREAD-MSG-NUMBER
058700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
058800         MOVE TRUE-VAL TO INDS (1) INDS (99)
059000         GO TO 60-SHOWFORM.
059100
059200     IF ENG-BUF NOT = SPACES
059300         MOVE "ENGR  " TO EPS-HEAD
059400         IF E-BUF-1 = "A" AND E-BUF-234 = SPACES
059500             MOVE SPACES TO EPS-COMP
059600         ELSE
059700         MOVE ENG-BUF  TO EPS-COMP
059800     ELSE
059900     IF PLN-BUF NOT = SPACES
060000         MOVE "PLNR  " TO EPS-HEAD
060100         IF P-BUF-1 = "A" AND P-BUF-234 = SPACES
060200             MOVE SPACES TO EPS-COMP
060300         ELSE
060400         MOVE PLN-BUF  TO EPS-COMP
060500     ELSE
060600     IF SCD-BUF NOT = SPACES
060700         MOVE "SCHD  " TO EPS-HEAD
060800         IF S-BUF-1 = "A" AND S-BUF-234 = SPACES
060900             MOVE SPACES TO EPS-COMP
061000         ELSE
061100         MOVE SCD-BUF  TO EPS-COMP.
061200
061300     IF WOSTAT-BUF = SPACES
061400**********************************************************************
061500**    MESSAGE 041/018:
061600** ONE STATUS REQUIRED:
061700**********************************************************************
061800         MOVE 41018 TO CATREAD-MSG-NUMBER
062000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
062100         MOVE TRUE-VAL TO INDS (4) INDS (99)
062300         GO TO 60-SHOWFORM.
062400
062500     MOVE STAT-BUF-1 TO STAT-EDIT.
062600     PERFORM 601-EDIT-STAT.
062700     MOVE STAT-EDIT TO STAT-BUF-1.
062800     MOVE STAT-BUF-2 TO STAT-EDIT.
062900     PERFORM 601-EDIT-STAT.
063000     MOVE STAT-EDIT TO STAT-BUF-2.
063100     MOVE STAT-BUF-3 TO STAT-EDIT.
063200     PERFORM 601-EDIT-STAT.
063300     MOVE STAT-EDIT TO STAT-BUF-3.
063400
063500     IF STAT-BUF-1 = STAT-BUF-2 MOVE SPACES TO STAT-BUF-2.
063700     IF STAT-BUF-1 = STAT-BUF-3 MOVE SPACES TO STAT-BUF-3.
063900     IF STAT-BUF-2 = STAT-BUF-3 MOVE SPACES TO STAT-BUF-3.
064100
064200     IF STAT-BUF-1 = SPACES
064300         MOVE STAT-BUF-2 TO STAT-BUF-1
064400         MOVE SPACES     TO STAT-BUF-2.
064500     IF STAT-BUF-1 = SPACES
064600         MOVE STAT-BUF-3 TO STAT-BUF-1
064700         MOVE SPACES     TO STAT-BUF-3.
064800     IF STAT-BUF-2 = SPACES
064900         MOVE STAT-BUF-3 TO STAT-BUF-2
065000         MOVE SPACES     TO STAT-BUF-3.
065100
065200     MOVE SPACES TO SEARCH-STATUSES.
065300     MOVE WOSTAT-BUF TO SCREEN-STATUSES.
065400     IF STAT-BUF-1 = "AL"
065500         MOVE "OOPRIPSDHSHAHMCWDWSW" TO SEARCH-STATUSES.
065600     IF STAT-BUF-1 = "**"
065700         MOVE "OOPRIPSDHSHAHM    " TO SEARCH-STATUSES.
065800     IF STAT-BUF-1 = "HH"
065900         MOVE "HSHAHM" TO SCREEN-STATUSES.
066000
066100     IF DEPT-BUF NOT = SPACES
066200       IF ZONE-BUF NOT = SPACES
066300**********************************************************************
066400**    MESSAGE 031/080:
066500** EITHER DEPT OR ZONE - BUT NOT BOTH
066600**********************************************************************
066700         MOVE 31080 TO CATREAD-MSG-NUMBER
066900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
067000         MOVE TRUE-VAL TO INDS (7) INDS (99)
067200         GO TO 60-SHOWFORM.
067300     MOVE "DEPT  " TO DZ-HEAD.
067400     MOVE DEPT-BUF TO DZ-COMP.
067500     IF ZONE-BUF NOT = SPACES
067600         MOVE "ZONE  " TO DZ-HEAD
067700         MOVE ZONE-BUF TO DZ-COMP.
067800     IF ZONE-BUF = "X   "
067900         MOVE SPACES TO DZ-COMP.
068000
068100     IF BUDGET-BUF = "   -  -  -   "
068200         MOVE SPACES TO BUDGET-BUF.
068300
068400     MOVE "EXPENSE CLASS" TO EBR-HEAD.
068500
068600     IF EXPENSE-BUF = "R       "
068700         MOVE EXP-BUF-1 TO EXP-SW
068800         MOVE "A       " TO EXPENSE-BUF
068900         PERFORM 602-EXP-RANGE THRU 602-ER-EXIT.
069000
069100     IF EXPENSE-BUF = SPACES
069200         MOVE "BUDGET NUMBER" TO EBR-HEAD
069300         IF BUDGET-BUF = SPACES
069400             MOVE "REQUEST NUM. " TO EBR-HEAD
069500             IF REQ-BUF = SPACES
069600                 MOVE "EXPENSE CLASS" TO EBR-HEAD.
069700
069800     IF EXPENSE-BUF = "A       "
069900         MOVE SPACES TO EXPENSE-BUF.
070000
070100     IF BUDGET-BUF NOT = SPACES AND REQ-BUF NOT = SPACES
070200         IF BUDGET-BUF = "A  -  -  -   " AND
070300               REQ-BUF = "A           "
070400             NEXT SENTENCE
070500         ELSE
070600             IF BUDGET-BUF = "A  -  -  -   "
070700                 MOVE "1" TO B-SW
070800                 MOVE "2" TO R-SW
070900             ELSE
071000             IF REQ-BUF = "A           "
071100                 MOVE "1" TO R-SW
071200                 MOVE "2" TO B-SW
071300             ELSE
071400                 MOVE "1" TO B-SW
071500                 MOVE "2" TO R-SW.
071600
071700     IF EXPENSE-BUF NOT = SPACES
071800         MOVE EXPENSE-BUF TO EXP-ADJ
071900         PERFORM 611-EDIT-EXPENSE UNTIL EXP-8 NOT = SPACE
072000         MOVE EXP-ADJ TO EXPENSE-BUF.
072100
072200     IF BUDGET-BUF = "A  -  -  -   "
072300         MOVE "BUDGET NUMBER" TO EBR-HEAD
072400         MOVE SPACES TO BUDGET-BUF.
072500
072600     IF REQ-BUF NOT = SPACES
072700       IF REQ-BUF-11 = SPACES AND REQ-BUF-1 NOT = "A"
072800         MOVE REQ-BUF-1 TO REQ-SW
072900         MOVE "A" TO REQ-BUF-1.
073000
073100     IF REQ-BUF = "A           "
073200         MOVE "REQUEST NUM. " TO EBR-HEAD
073300         MOVE SPACES TO REQ-BUF.
073400
073500     IF EBR-1 = "E" AND BUDGET-BUF NOT = SPACES
073600         MOVE "BUDGET NUMBER" TO EBR-NAM
073700         MOVE BUDGET-BUF TO B-VAL.
073800
073900     IF EBR-1 = "E" AND REQ-BUF NOT = SPACES
074000         MOVE "REQUEST NUM. " TO EBR-NAM
074100         MOVE REQ-BUF TO R-VAL.
074200
074300     IF B-SW = "2" AND R-SW = "1"
074400         MOVE "BUDGET NUMBER" TO EBR-NAM
074500         MOVE BUDGET-BUF TO B-VAL.
074600
074700     IF B-SW = "1" AND R-SW = "2"
074800         MOVE "REQUEST NUM. " TO EBR-NAM
074900         MOVE REQ-BUF TO R-VAL.
075000
075100     IF EBR-1 NOT = "E" AND EXPENSE-BUF NOT = SPACES
075200         MOVE "EXPENSE CLASS" TO EBR-NAM
075300         MOVE EXPENSE-BUF TO E-VAL.
075400
075500     IF EBR-VAL NOT = SPACES
075600         MOVE 15 TO LINE-LIMIT.
075700
075800 60-WS-EXIT.    EXIT.
075900
076000 601-EDIT-STAT.
076100     IF STAT-EDIT = "PI" MOVE "IP" TO STAT-EDIT.
076200     IF STAT-EDIT = "00" MOVE "OO" TO STAT-EDIT.
076300     IF STAT-EDIT = "WC" MOVE "CW" TO STAT-EDIT.
076400     IF STAT-EDIT = "WD" MOVE "DW" TO STAT-EDIT.
076500     IF STAT-EDIT = "DS" MOVE "SD" TO STAT-EDIT.
076600     IF STAT-EDIT = "WS" MOVE "SW" TO STAT-EDIT.
076700     IF STAT-EDIT = "AH" MOVE "HA" TO STAT-EDIT.
076800     IF STAT-EDIT = "MH" MOVE "HM" TO STAT-EDIT.
076900     IF STAT-EDIT = "SH" MOVE "HS" TO STAT-EDIT.
077000     IF STAT-EDIT = "LA" MOVE "AL" TO STAT-EDIT.
077100     IF STAT-EDIT = " H" MOVE "HH" TO STAT-EDIT.
077200     IF STAT-EDIT = "H " MOVE "HH" TO STAT-EDIT.
           IF STAT-EDIT = "RP" MOVE "PR" TO STAT-EDIT.
077300
077400 602-EXP-RANGE.
081500     MOVE SPACES TO EXP-BUFFER.
081600
081700 602-SHOWFORM.
           MOVE SPACES TO EXP-BUFFER.
077500     MOVE "FQ8RANGE" TO VIEW-CFNAME.
           IF TRUE-VAL = INDS (99)
               MOVE ERROR-BUFFER TO EXP-ERR-LINE.
           MOVE EXP-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER.
           MOVE DSPLY-REC TO EXP-BUFFER.
083500     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
083800     IF VIEW-LASTKEY NOT = 0 GO TO 602-SHOWFORM.
084300     IF EXP-R1 = SPACES OR EXP-R2 = SPACES
084400**********************************************************************
084500**    MESSAGE 046/027:
084600** TWO ENTRIES REQUIRED
084700**********************************************************************
084800         MOVE 46027 TO CATREAD-MSG-NUMBER
085000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
085100         MOVE TRUE-VAL TO INDS (1) INDS (99)
085300         GO TO 602-SHOWFORM.
085400
085500     MOVE EXP-R1 TO EXP-ADJ.
085600     PERFORM 611-EDIT-EXPENSE UNTIL EXP-8 NOT = SPACE.
085700     MOVE EXP-ADJ TO EXP-R1.
085800
085900     MOVE EXP-R2 TO EXP-ADJ.
086000     PERFORM 611-EDIT-EXPENSE UNTIL EXP-8 NOT = SPACE.
086100     MOVE EXP-ADJ TO EXP-R2.
086200
086300     IF EXP-R1-8 > EXP-R2-8
086400**********************************************************************
086500**    MESSAGE 035/105:
086600** INVALID ENTRY
086700**********************************************************************
086800         MOVE 35105 TO CATREAD-MSG-NUMBER
087000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
087100         MOVE TRUE-VAL TO INDS (2) INDS (99)
087300         GO TO 602-SHOWFORM.
087400
087500     SUBTRACT 1 FROM EXP-R1-8.
087600     ADD      1 TO   EXP-R2-8.
087700
087800 602-ER-EXIT.    EXIT.
087900
088000 611-EDIT-EXPENSE.
088100     MOVE EXP-7 TO EXP-8.
088200     MOVE EXP-6 TO EXP-7.
088300     MOVE EXP-5 TO EXP-6.
088400     MOVE EXP-4 TO EXP-5.
088500     MOVE EXP-3 TO EXP-4.
088600     MOVE EXP-2 TO EXP-3.
088700     MOVE EXP-1 TO EXP-2.
088800     MOVE "0"   TO EXP-1.
088900
       COPY OVRPFCALL IN COPYLIB.

089000 61-SORT-INPUT.
092900     MOVE 0 TO RECS-RELEASED RECORDS-READ.
093000     SORT SORT-FILE ASCENDING KEY SORT-EPS SORT-STAT-NUM
093100                      SORT-DZ SORT-EQNUM SORT-WONUM
093200         INPUT PROCEDURE  7-SORT-INPUT-RECORDS
093300         OUTPUT PROCEDURE 8-SORT-WRITE-FILE.
           CLOSE OUT-FILE.
           IF ACT-KEY = 0
120000**********************************************************************
120100**    MESSAGE 040/068:
120200** NO W/O'S MEET THE REQUIREMENTS-ENTER NEW TRANSACTION OR 'F3' TO END
120300**********************************************************************
120400         MOVE 40068 TO CATREAD-MSG-NUMBER
120600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREENO-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
120700         MOVE 1 TO NO-REC-SW
120800         MOVE 2 TO VIEW-LASTKEY
120900         GO TO 2-EOJ.
           OPEN INPUT OUT-FILE.
093400
093500 62-DISPLAY-OUTPUT.
119800     MOVE 1 TO ACT-KEY.
119900     READ OUT-FILE     INVALID KEY
120000**********************************************************************
120100**    MESSAGE 040/068:
120200** NO W/O'S MEET THE REQUIREMENTS-ENTER NEW TRANSACTION OR 'F3' TO END
120300**********************************************************************
120400         MOVE 40068 TO CATREAD-MSG-NUMBER
120600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREENO-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
120700         MOVE 1 TO NO-REC-SW
120800         MOVE 2 TO VIEW-LASTKEY
120900         GO TO 2-EOJ.
121000     ADD 1 TO RECORDS-READ.
121100     IF RECORDS-READ > RECS-RELEASED
121200**********************************************************************
121300**    MESSAGE 040/068:
121400** NO W/O'S MEET THE REQUIREMENTS-ENTER NEW TRANSACTION OR 'F8' TO END
121500**********************************************************************
121600         MOVE 40068 TO CATREAD-MSG-NUMBER
121800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREENO-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
121900         MOVE 1 TO NO-REC-SW
122000         MOVE 2 TO VIEW-LASTKEY
122100         GO TO 2-EOJ.
122200
122300     PERFORM 6211-HEADINGS.
097200     PERFORM 621-MAIN THRU 621-EXIT UNTIL
097300                ALL-RECORDS-WRITTEN-SW = "Y".
097400
097500 621-MAIN.
097600     IF PRINT-BUF NOT = "P"
097700         IF LINE-K > LINE-LIMIT OR FIELD-CTR > LINE-LIMIT
097800             MOVE 0 TO LINE-K FIELD-CTR
098600             PERFORM 621-SHOWFORM THRU 621-S-EXIT
098700             PERFORM 6211-HEADINGS
098800             GO TO 621-EXIT.
098900
099000     IF PRINT-BUF = "P"
099100         IF LINE-K > LINE-LIMIT + 37
099200             MOVE 0 TO LINE-K
099300             PERFORM 6211-HEADINGS.
099400
099500     MOVE SPACES      TO DETAIL-REC.
099600     MOVE OUT-EPS     TO EPS-CODE.
099700     MOVE OUT-WOSTAT  TO STATUS-CODE.
099800     MOVE OUT-DZ      TO DEPT-ZONE.
099900     MOVE OUT-VPE     TO VPE-CODE.
100000     MOVE OUT-EQNUM   TO EQP-NUM.
100100     MOVE OUT-WONUM   TO WO-NUM.
100200     MOVE OUT-WODESC  TO DESC.
100300     IF EBR-1 = "E"
100400         MOVE OUT-EXPCL TO EXP-ADJ
100500         PERFORM 6211-EXP-ZERO-SUPPRESS THRU 6211-EZS-EXIT
100600         MOVE EXP-ADJ TO E-NUM.
100700     IF EBR-1 = "B" MOVE OUT-BUDG  TO B-NUM.
100800     IF EBR-1 = "R" MOVE OUT-REQNO TO R-NUM.
100900
101000     MOVE 0 TO SKIP-LINE.
101100     IF DEPT-ZONE NOT = DZ-HOLD
101200         MOVE 1 TO SKIP-LINE
101300         MOVE DEPT-ZONE TO DZ-HOLD
101400     ELSE
101500     IF LINE-K NOT = 0
101600         MOVE SPACES TO DEPT-ZONE.
101700
101800     IF STATUS-CODE NOT = STAT-HOLD
101900         MOVE 1 TO SKIP-LINE
102000         MOVE STATUS-CODE TO STAT-HOLD
102100     ELSE
102200     IF LINE-K NOT = 0
102300         MOVE SPACES TO STATUS-CODE.
102400
102500     IF EPS-CODE NOT = EPS-HOLD
102600         MOVE 1 TO SKIP-LINE
102700         MOVE EPS-CODE TO EPS-HOLD
102800     ELSE
102900     IF LINE-K NOT = 0
103000         MOVE SPACES TO EPS-CODE.
103100
103200     IF DEPT-ZONE = SPACES AND
103300         STATUS-CODE NOT = SPACES
103400              MOVE OUT-DZ TO DEPT-ZONE.
103500
103600     IF STATUS-CODE = SPACES AND
103700         EPS-CODE NOT = SPACES
103800             MOVE OUT-WOSTAT TO STATUS-CODE.
103900
104000     IF LINE-K NOT = 0
104100       IF SKIP-LINE = 1
104200         IF PRINT-BUF NOT = "P"
104300             ADD 1 TO LINE-K FIELD-CTR
104400         ELSE
104500         MOVE SPACES TO HOLD-BUFFER
104600         PERFORM 6212-PRINT-FUNCTION
104700         ADD 1 TO LINE-K.
104800
104900     IF EBR-VAL NOT = SPACES
105000       IF LINE-K = 0
105100         IF PRINT-BUF NOT = "P"
105200             MOVE HEADING-3 TO FIELD-HOLD
105300             PERFORM 6212-WRITE-FIELDS
105400         ELSE
105500         MOVE HEADING-3 TO HOLD-BUFFER
105600         PERFORM 6212-PRINT-FUNCTION.
105700
105800     IF PRINT-BUF NOT = "P"
105900         MOVE DETAIL-REC TO FIELD-HOLD
106000         PERFORM 6212-WRITE-FIELDS.
106100
106200     IF PRINT-BUF = "P"
106300         MOVE DETAIL-REC TO HOLD-BUFFER
106400         PERFORM 6212-PRINT-FUNCTION.
106500
106600     ADD 1 TO LINE-K.
106700     ADD 1 TO ACT-KEY.
106800
106900     READ OUT-FILE     INVALID KEY
107000         MOVE 1 TO EOF-SW
107100         PERFORM 6219-INVALID-KEY-FUNCTION
107200         PERFORM 621-SHOWFORM THRU 621-S-EXIT
               GO TO 621-EXIT.
107300     ADD 1 TO RECORDS-READ.
107400     IF RECORDS-READ > RECS-RELEASED
107500         MOVE 1 TO EOF-SW
107600         PERFORM 6219-INVALID-KEY-FUNCTION
107700         PERFORM 621-SHOWFORM THRU 621-S-EXIT.
107800
107900 621-EXIT.    EXIT.
108000
108100 621-SHOWFORM.
108200     IF PRINT-BUF = "P" GO TO 621-S-EXIT.
           MOVE "FQ8FSCRN" TO VIEW-CFNAME.
           IF EOF-SW = 1
               MOVE 31062 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO FIELD-MESSAGE
               MOVE 66124 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO FIELD-CMD-LINE
           ELSE
           MOVE 30077 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO FIELD-MESSAGE
           MOVE 66229 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO FIELD-CMD-LINE.
           MOVE FILL-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE SPACES TO ERROR-BUFFER FILL-SCREEN.
110300     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
110600     IF VIEW-LASTKEY = 1 OR 0
110700         IF EOF-SW = 0
110800             NEXT SENTENCE
110900         ELSE
111000         MOVE 2 TO VIEW-LASTKEY.
           IF VIEW-LASTKEY = 2
               MOVE "Y" TO ALL-RECORDS-WRITTEN-SW.
112500
112600 621-S-EXIT.    EXIT.
112700
112800 6211-EXP-ZERO-SUPPRESS.
112900     IF EXP-1 = 0
113000         MOVE SPACE TO EXP-1
113100     ELSE
113200     GO TO 6211-EZS-EXIT.
113300     IF EXP-2 = 0
113400         MOVE SPACE TO EXP-2
113500     ELSE
113600     GO TO 6211-EZS-EXIT.
113700     IF EXP-3 = 0
113800         MOVE SPACE TO EXP-3
113900     ELSE
114000     GO TO 6211-EZS-EXIT.
114100     IF EXP-4 = 0
114200         MOVE SPACE TO EXP-4
114300     ELSE
114400     GO TO 6211-EZS-EXIT.
114500     IF EXP-5 = 0
114600         MOVE SPACE TO EXP-5
114700     ELSE
114800     GO TO 6211-EZS-EXIT.
114900     IF EXP-6 = 0
115000         MOVE SPACE TO EXP-6
115100     ELSE
115200     GO TO 6211-EZS-EXIT.
115300     IF EXP-7 = 0
115400         MOVE SPACE TO EXP-7.
115700
115800 6211-EZS-EXIT.    EXIT.
115900
116000 6211-HEADINGS.
116100     IF PRINT-BUF NOT = "P"
116200     MOVE HEADING-1 TO FIELD-1
116300     ELSE
116400     MOVE HEADING-DT-TM TO PRINT-REC
116500     WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
116600     MOVE HEADING-1 TO HOLD-BUFFER
116700     PERFORM 6212-PRINT-FUNCTION
116800     MOVE SPACES TO HOLD-BUFFER
116900     PERFORM 6212-PRINT-FUNCTION.
117000
117100
117200     IF PRINT-BUF NOT = "P"
117300     MOVE 4 TO FIELD-CTR
117400     MOVE HEADING-2 TO FIELD-3
117500     MOVE HEADING-DOTS TO FIELD-4
117600     ELSE
117700     MOVE HEADING-2 TO HOLD-BUFFER
117800     PERFORM 6212-PRINT-FUNCTION
117900     MOVE HEADING-DOTS TO HOLD-BUFFER
118000     PERFORM 6212-PRINT-FUNCTION.
118100
118200 6219-INVALID-KEY-FUNCTION.
118300     IF PRINT-BUF NOT = "P"
118800         NEXT SENTENCE
119100     ELSE
119200     MOVE SPACES TO PRINT-REC
119300*    WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
119400     MOVE 2 TO VIEW-LASTKEY
119500     MOVE "Y" TO ALL-RECORDS-WRITTEN-SW.
119600
122600
122700 6212-PRINT-FUNCTION.
122800     MOVE HOLD-BUFFER TO PRINT-REC.
122900     WRITE PRINT-REC AFTER ADVANCING ADV-CTR.
123000
123100 6212-WRITE-FIELDS.
123200     ADD 1 TO FIELD-CTR.
123300     IF FIELD-CTR = 5
123400         MOVE FIELD-HOLD TO FIELD-5
123500     ELSE
123600     IF FIELD-CTR = 6
123700         MOVE FIELD-HOLD TO FIELD-6
123800     ELSE
123900     IF FIELD-CTR = 7
124000         MOVE FIELD-HOLD TO FIELD-7
124100     ELSE
124200     IF FIELD-CTR = 8
124300         MOVE FIELD-HOLD TO FIELD-8
124400     ELSE
124500     IF FIELD-CTR = 9
124600         MOVE FIELD-HOLD TO FIELD-9
124700     ELSE
124800     IF FIELD-CTR = 10
124900         MOVE FIELD-HOLD TO FIELD-10
125000     ELSE
125100     IF FIELD-CTR = 11
125200         MOVE FIELD-HOLD TO FIELD-11
125300     ELSE
125400     IF FIELD-CTR = 12
125500         MOVE FIELD-HOLD TO FIELD-12
125600     ELSE
125700     IF FIELD-CTR = 13
125800         MOVE FIELD-HOLD TO FIELD-13
125900     ELSE
126000     IF FIELD-CTR = 14
126100         MOVE FIELD-HOLD TO FIELD-14
126200     ELSE
126300     IF FIELD-CTR = 15
126400         MOVE FIELD-HOLD TO FIELD-15
126500     ELSE
126600     IF FIELD-CTR = 16
126700         MOVE FIELD-HOLD TO FIELD-16
126800     ELSE
126900     IF FIELD-CTR = 17
127000         MOVE FIELD-HOLD TO FIELD-17
127100     ELSE
127200     IF FIELD-CTR = 18
127300         MOVE FIELD-HOLD TO FIELD-18
127400     ELSE
127500     IF FIELD-CTR = 19
127600         MOVE FIELD-HOLD TO FIELD-19
127700     ELSE
127800     IF FIELD-CTR = 20
127900         MOVE FIELD-HOLD TO FIELD-20
128000     ELSE
128100     IF FIELD-CTR = 21
128200         MOVE FIELD-HOLD TO FIELD-21
128300     ELSE
128400     IF FIELD-CTR = 22
128500         MOVE FIELD-HOLD TO FIELD-22.
128900
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

129400 999-CATREAD.
129500     MOVE SPACES TO ERROR-BUFFER.
129600     CALL "CCATREAD" USING CATREAD-PARMS.
129700     MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
130500 999-CATREAD-EXIT.    EXIT.
130600
130700 7-SORT-INPUT-RECORDS.
130800     MOVE "0" TO STAT-SORT.
130900     MOVE ST-0 TO ARGUMENT.
131000     PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
131100     IF ST-1 NOT = SPACES
131200         MOVE "1" TO STAT-SORT
131300         MOVE ST-1 TO ARGUMENT
131400         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
131500     IF ST-2 NOT = SPACES
131600         MOVE "2" TO STAT-SORT
131700         MOVE ST-2 TO ARGUMENT
131800         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
131900     IF ST-3 NOT = SPACES
132000         MOVE "3" TO STAT-SORT
132100         MOVE ST-3 TO ARGUMENT
132200         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
132300     IF ST-4 NOT = SPACES
132400         MOVE "4" TO STAT-SORT
132500         MOVE ST-4 TO ARGUMENT
132600         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
132700     IF ST-5 NOT = SPACES
132800         MOVE "5" TO STAT-SORT
132900         MOVE ST-5 TO ARGUMENT
133000         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
133100     IF ST-6 NOT = SPACES
133200         MOVE "6" TO STAT-SORT
133300         MOVE ST-6 TO ARGUMENT
133400         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
133500     IF ST-7 NOT = SPACES
133600         MOVE "7" TO STAT-SORT
133700         MOVE ST-7 TO ARGUMENT
133800         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
133900     IF ST-8 NOT = SPACES
134000         MOVE "08" TO STAT-SORT
134100         MOVE ST-8 TO ARGUMENT
134200         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
133900     IF ST-9 NOT = SPACES
134000         MOVE "9" TO STAT-SORT
134100         MOVE ST-9 TO ARGUMENT
134200         PERFORM 70-SORT-MAIN THRU 70-SORT-M-EXIT.
134300
134600 70-SORT-MAIN.
           MOVE 0 TO COND-WORD.
           MOVE ARGUMENT TO WOSTATUS OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
134900     IF COND-WORD = 17 GO TO 70-SORT-M-EXIT.
           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT
               UNTIL COND-WORD = 15.
135600
135700 70-SORT-M-EXIT.    EXIT.
135800
135900 70-SORT-DBGET.
136000     MOVE SPACES TO SORT-REC.
136100     MOVE STAT-SORT TO SORT-STAT-NUM.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF WO-STATUS-P NOT = ARGUMENT MOVE 15 TO COND-WORD.
136400     IF COND-WORD = 15 GO TO 70-SORT-DBGET-EXIT.
137100     IF EPS-HEAD = "ENGR  "
137200         MOVE ENGINEER TO SORT-EPS
137300     ELSE
137400     IF EPS-HEAD = "PLNR  "
137500         MOVE PLANNER TO SORT-EPS
137600     ELSE
137700     MOVE SCHEDULER TO SORT-EPS.
137800
137900     IF SORT-EPS = SPACES GO TO 70-SORT-DBGET.
138100
138200     IF DZ-HEAD = "DEPT  "
138300         MOVE DEPT-P TO SORT-DZ
138400     ELSE
138500     MOVE ZONE-P TO SORT-DZ.
138600
138700     MOVE SPACES TO ZONE-BUFFERS.
           IF PLANT-IDENT = "126 "
               NEXT SENTENCE
           ELSE
138800     IF Z-BUF-1 = "A" AND Z-BUF-2 = " "
138900         MOVE "A1  " TO ZONE-BUF1
139000         MOVE "A2  " TO ZONE-BUF2
139100         MOVE "A3  " TO ZONE-BUF3
139200     ELSE
139300     IF Z-BUF-1 = "A" AND Z-BUF-2 = "A"
139400         MOVE "A1  " TO ZONE-BUF1
139500         MOVE "A2  " TO ZONE-BUF2
139600     ELSE
139700     IF Z-BUF-1 = "B" AND Z-BUF-2 = " "
139800         MOVE "B1  " TO ZONE-BUF1
139900         MOVE "B2  " TO ZONE-BUF2
140000         MOVE "B3  " TO ZONE-BUF3
140100     ELSE
140200     IF Z-BUF-1 = "B" AND Z-BUF-2 = "B"
140300         MOVE "B1  " TO ZONE-BUF1
140400         MOVE "B2  " TO ZONE-BUF2
140500     ELSE
140600     IF Z-BUF-1 = "B" AND Z-BUF-2 = "D"
140700         MOVE "B2  " TO ZONE-BUF1
140800         MOVE "B3  " TO ZONE-BUF2
140900     ELSE
141000     IF Z-BUF-1 = "B" AND Z-BUF-2 = "C"
141100         MOVE "B3  " TO ZONE-BUF1
141200         MOVE "C1  " TO ZONE-BUF2
141300         MOVE "C2  " TO ZONE-BUF3
141400     ELSE
141500     IF Z-BUF-1 = "C" AND Z-BUF-2 = " "
141600         MOVE "C1  " TO ZONE-BUF1
141700         MOVE "C2  " TO ZONE-BUF2
141800     ELSE
141900     IF ZONE-BUF = "Z1  "
142000         MOVE "Z1  " TO ZONE-BUF1
142100         MOVE "Z1A " TO ZONE-BUF2.
142200
142300     IF DZ-COMP = SPACES MOVE SORT-DZ TO ZONE-BUF1.
142400
142500     MOVE WO-STATUS-P      TO SORT-WOSTAT.
142600     MOVE WO-NUM-PLANNED   TO SORT-WONUM.
142700     MOVE WO-CURRENT-TYPE  TO SORT-VPE.
142800     MOVE DESCRIPTION-1-P  TO SORT-WODESC.
142900     MOVE EQUIP-NUM-P      TO SORT-EQNUM.
143000     MOVE EXP-CLASS-P      TO SORT-EXPCL.
143100     MOVE BUDGET-NO        TO SORT-BUDG.
143200     MOVE REQUEST-NO       TO SORT-REQNO.
143300
143400     IF SORT-BUDG = "   -  -  -   "
143500         MOVE SPACES TO SORT-BUDG.
143600
143700     IF EBR-1 = "B" AND SORT-BUDG = SPACES
143800         GO TO 70-SORT-DBGET.
143900
144000     IF EBR-1 = "R" AND SORT-REQNO = SPACES
144100         GO TO 70-SORT-DBGET.
144200
144300     IF REQ-SW NOT = SPACE
144400         IF SORT-REQ-1 NOT = REQ-SW
144500             GO TO 70-SORT-DBGET.
144600
144700     IF EXP-SW-ON
144800         IF S-EXP-NUM-8 > EXP-R1-8 AND < EXP-R2-8
144900             NEXT SENTENCE
145000         ELSE
145100         GO TO 70-SORT-DBGET.
145200
145300     IF EQ1 = SORT-EQ1 OR SPACE
145400       IF EQ2 = SORT-EQ2 OR SPACE
145500         IF EQ3 = SORT-EQ3 OR SPACE
145600           IF EQ4 = SORT-EQ4 OR SPACE
145700             IF EQ5 = SORT-EQ5 OR SPACE
145800               IF EQ6 = SORT-EQ6 OR SPACE
145900                   NEXT SENTENCE
146000               ELSE
146100               GO TO 70-SORT-DBGET
146200             ELSE
146300             GO TO 70-SORT-DBGET
146400           ELSE
146500           GO TO 70-SORT-DBGET
146600         ELSE
146700         GO TO 70-SORT-DBGET
146800       ELSE
146900       GO TO 70-SORT-DBGET
147000     ELSE
147100     GO TO 70-SORT-DBGET.
147200
147300     IF RQ-1  = SORT-REQ-1  OR SPACE
147400      IF RQ-2  = SORT-REQ-2  OR SPACE
147500       IF RQ-3  = SORT-REQ-3  OR SPACE
147600        IF RQ-4  = SORT-REQ-4  OR SPACE
147700         IF RQ-5  = SORT-REQ-5  OR SPACE
147800          IF RQ-6  = SORT-REQ-6  OR SPACE
147900           IF RQ-7  = SORT-REQ-7  OR SPACE
148000            IF RQ-8  = SORT-REQ-8  OR SPACE
148100             IF RQ-9  = SORT-REQ-9  OR SPACE
148200              IF RQ-10 = SORT-REQ-10 OR SPACE
148300               IF RQ-11 = SORT-REQ-11 OR SPACE
148400                IF RQ-12 = SORT-REQ-12 OR SPACE
148500                     NEXT SENTENCE
148600                ELSE
148700                GO TO 70-SORT-DBGET
148800               ELSE
148900               GO TO 70-SORT-DBGET
149000              ELSE
149100              GO TO 70-SORT-DBGET
149200             ELSE
149300             GO TO 70-SORT-DBGET
149400            ELSE
149500            GO TO 70-SORT-DBGET
149600           ELSE
149700           GO TO 70-SORT-DBGET
149800          ELSE
149900          GO TO 70-SORT-DBGET
150000         ELSE
150100         GO TO 70-SORT-DBGET
150200        ELSE
150300        GO TO 70-SORT-DBGET
150400       ELSE
150500       GO TO 70-SORT-DBGET
150600      ELSE
150700      GO TO 70-SORT-DBGET
150800     ELSE
150900     GO TO 70-SORT-DBGET.
151000
151100     IF BG-1  = SORT-BUD-1  OR SPACE
151200      IF BG-2  = SORT-BUD-2  OR SPACE
151300       IF BG-3  = SORT-BUD-3  OR SPACE
151400        IF BG-4  = SORT-BUD-4  OR SPACE OR "-"
151500         IF BG-5  = SORT-BUD-5  OR SPACE
151600          IF BG-6  = SORT-BUD-6  OR SPACE
151700           IF BG-7  = SORT-BUD-7  OR SPACE OR "-"
151800            IF BG-8  = SORT-BUD-8  OR SPACE
151900             IF BG-9  = SORT-BUD-9  OR SPACE
152000              IF BG-10 = SORT-BUD-10 OR SPACE OR "-"
152100               IF BG-11 = SORT-BUD-11 OR SPACE
152200                IF BG-12 = SORT-BUD-12 OR SPACE
152300                 IF BG-13 = SORT-BUD-13 OR SPACE
152400                     NEXT SENTENCE
152500                 ELSE
152600                 GO TO 70-SORT-DBGET
152700                ELSE
152800                GO TO 70-SORT-DBGET
152900               ELSE
153000               GO TO 70-SORT-DBGET
153100              ELSE
153200              GO TO 70-SORT-DBGET
153300             ELSE
153400             GO TO 70-SORT-DBGET
153500            ELSE
153600            GO TO 70-SORT-DBGET
153700           ELSE
153800           GO TO 70-SORT-DBGET
153900          ELSE
154000          GO TO 70-SORT-DBGET
154100         ELSE
154200         GO TO 70-SORT-DBGET
154300        ELSE
154400        GO TO 70-SORT-DBGET
154500       ELSE
154600       GO TO 70-SORT-DBGET
154700      ELSE
154800      GO TO 70-SORT-DBGET
154900     ELSE
155000     GO TO 70-SORT-DBGET.
155100
155200     IF EPS-C1 = EPS-S1 OR SPACE
155300       IF EPS-C2 = EPS-S2 OR SPACE
155400         IF EPS-C3 = EPS-S3 OR SPACE
155500           IF EPS-C4 = EPS-S4 OR SPACE
155600               NEXT SENTENCE
155700           ELSE
155800           GO TO 70-SORT-DBGET
155900         ELSE
156000         GO TO 70-SORT-DBGET
156100       ELSE
156200       GO TO 70-SORT-DBGET
156300     ELSE
156400     GO TO 70-SORT-DBGET.
156500
156600     IF SORT-DZ = DZ-COMP OR ZONE-BUF1 OR ZONE-BUF2 OR
156700                           ZONE-BUF3 OR SPACES
156800       IF EXPENSE-BUF = SORT-EXPCL OR SPACES
156900             ADD 1 TO RECS-RELEASED
157000             RELEASE SORT-REC.
157100
157200 70-SORT-DBGET-EXIT.    EXIT.
157300
157600 8-SORT-WRITE-FILE.
           MOVE 0 TO ACT-KEY.
           OPEN OUTPUT OUT-FILE.
           PERFORM 8-SWF-CONT THRU 8-SWF-EXIT.
       8-SWF-CONT.
157700     RETURN SORT-FILE AT END GO TO 8-SWF-EXIT.
157900     ADD 1 TO ACT-KEY.
158000     MOVE SORT-REC TO OUT-DATA.
158100     WRITE OUT-REC     INVALID KEY GO TO 8-SWF-EXIT.
158400     GO TO 8-SWF-CONT.
158500
158600 8-SWF-EXIT.    EXIT.
