000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TQTBTPRT.
000400 AUTHOR.        BARBARA WINTER.
000500 DATE-WRITTEN.  JULY  l987.
000600*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.
000900*D BATCH PROGRAM THAT PRINTS A QUOTE SHEET
001000*****************************************************************
001100*                      T Q T B T P R T                          *
001200* THIS PROGRAM ACCEPTS A QUOTE NUMBER FROM THE REPRINT FUNCTION *
001300* AND PRINTS A QUOTE.  THIS FREES UP THE TERMINAL FOR THE USER. *
001400* ANY QUOTE OVER 50 ITEMS WILL BE REPRINTED THROUGHT THIS.      *
001500*****************************************************************
001600 ENVIRONMENT DIVISION.
001700 CONFIGURATION SECTION.
001800 SOURCE-COMPUTER.    HP-3000.
001900 OBJECT-COMPUTER.    HP-3000.
002300 DATA DIVISION.
002500
002600 WORKING-STORAGE SECTION.
002610 01  FORM-GNAME.
002620     05  FORM-GNAME1            PIC X(5)  VALUE "FLANG".
002630     05  FORM-GNAME2            PIC X(3)  VALUE SPACES.
002640
002700
002710 COPY LANGUAGE OF COPYCSIS.
002729 01  VIEW-COMAREA.
002730     05  FILLER                 PIC X(118) VALUE ALL "0".
002731     05  FILLER                 PIC S9(4)  COMP VALUE 9999.
002732 01  KSAM-STATUS                PIC X(2) VALUE SPACES.
003300
003500 COPY DATAB OF COPYCSIS.
       LINKAGE SECTION.
002800 01  STREAM-REC-WS.
003000     05  ST-PRT               PIC 9(2) COMP-4.
003110     05  ST-QUOTE             PIC X(10).
003120     05  ST-PLT-CODE          PIC X(3).
003200     05  FILLER               PIC X(65).
       01  AREA2                    PIC X(161).
004500
012400****************************************************************
012500*                  PROCEDURE DIVISION
012600****************************************************************
012700 PROCEDURE DIVISION USING STREAM-REC-WS, AREA2.
012701
012702 00-MAIN.
012966
013000*---------  ACCEPT DATA FROM SCREEN PROGRAM
021400     CALL "CQTPRT" USING ST-QUOTE, ST-PRT,
021500              LANGUAGE-PARMS, BASE, ST-PLT-CODE.
022100     GOBACK.
