       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TQTDL2JB.
       AUTHOR.        PAUL RAGLOW.
      ***------------------------------------------------------------***
      ***  >>>>>>>>>>  P O R T A B L E    P R O G R A M  <<<<<<<<<<  ***
      ***------------------------------------------------------------***
      *DATE-WRITTEN.  MAY 1990. (BW)
      *INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
      *
      *REMARKS.
      ****************************************************
      *    ---  JOBSTREAM TO DELETE NON-RETURNED QUOTES  *
      *                                                  *
      *   ANY QUOTE THAT WAS NOT RETURNED BY A VENDOR    *
      *   THAT IS OLDER THAN THE ENTERED DATE WILL BE    *
      *   DELETED.                                       *
      *                                                  *
      *   5-22-91   COMPLETELY REWORKED PROGRAM TO PUT   *
      *          INTO PORTABILITY MODE.  THIS WAS DONE   *
      *          BECAUSE THE PROGRAM LOGIC WAS COMPLETELY*
      *          INCORRECT BEFORE.                       *
      *                        PD RAGLOW                 *
      ****************************************************
      *C   4/11/94.   MARVIN MITCHELL  REQUEST #6490
      *C     COMMENTED EACH OF THE 'COPY' CODE STATEMENTS AT
      *C     THE END OF THIS PROGRAM, AND COPIED THE ACTUAL
      *C     COPYLIB MEMBERS' SOURCE CODE.
      *C     REMOVED TWO MORE STATEMENTS ON 05/03/94.
      *C
      *C   9/06/96    WILL   MCINTYRE  REQUEST #6623
      *C     MAKE REVISIONS FOR YEAR 2000 COMPATABILITY
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    HP-3000.
       OBJECT-COMPUTER.    HP-3000.

       COPY SPECIALN IN COPYLIB.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DVENDITM-QT-O
               ASSIGN TO DATABASE-MCFLCS0803
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DQUOTEXT-QT-O
               ASSIGN TO DATABASE-MCFLCS3801
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT SORT-FILE   ASSIGN TO DISK-SORT.

           SELECT FLAT-FILE   ASSIGN TO DISK-DQTDL2JB.

       DATA DIVISION.
       FILE SECTION.
      *------ FOR IBM ONLY ------*
       FD  DVENDITM-QT-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-QT-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DQUOTEXT-QT-O
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-QT-REC-O.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.
      *------ FOR IBM ONLY ------*

       SD  SORT-FILE
           RECORD CONTAINS 10 CHARACTERS.
       01  SORT-RCD.
           05  SORT-KEY             PIC X(10).

       FD  FLAT-FILE
           DATA RECORD IS FLAT-REC.
       01  FLAT-REC         PIC X(10).

       WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG                PIC X      VALUE "Y".
       77  EOF-FLAG                          PIC X      VALUE "N".
       77  RECORDS-SKIPPED                   PIC X      VALUE "N".
       77  DELETE-COUNT                      PIC 999999 VALUE 0.
       77  QUOTE-COUNT                       PIC 999999 VALUE 0.

       COPY FILESTAT IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

      *
      * DATABASE AREA
      *

       COPY DATAB  IN COPYLIB.

       01  ALL-ITEMS                         PIC XX   VALUE "@;".

       01  ARGUMENTS  VALUE SPACES.
           05  QUOTE-ARG.
               10  QUOTE-ARG-NUM        PIC X(6).
               10  FILLER               PIC X(4).

       01  SEARCH-FIELDS.
           05  QUOTE-SEARCH       PIC X(16)  VALUE "QUOTE-NUM;".

       01  DATASET-NAMES.
           05  DSET-DVENDITM      PIC X(16)  VALUE "DVENDITM;".
           05  DSET-DQUOTEXT      PIC X(16)  VALUE "DQUOTEXT;".
           05  DSET-NAME          PIC X(16)  VALUE SPACES.

       COPY CCRTFILE IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

       COPY COMMAND  IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY HMSGBUF  IN COPYLIB.

       01  BUF-FLAT.
           05  BF-QUOTE    PIC X(10).

       COPY DVENDITM   IN COPYLIB.
       COPY DQUOTEXT   IN COPYLIB.

       01  CY-COMPARE-PRICE-DATE.
           05  COMPARE-PRICE-CENT       PIC X(2) VALUE SPACES.
           05  COMPARE-PRICE-DATE.
               10  COMPARE-PRICE-YEAR   PIC X(2) VALUE SPACES.
               10  FILLER               PIC X(4) VALUE SPACES.
       01  CY-COMPARE-RETURN-DATE.
           05  COMPARE-RETURN-CENT      PIC X(2) VALUE SPACES.
           05  COMPARE-RETURN-DATE.
               10  COMPARE-RETURN-YEAR  PIC X(2) VALUE SPACES.
               10  FILLER               PIC X(4) VALUE SPACES.
       01  COMPARE-QUOTE            PIC X(10) VALUE SPACES.

       COPY LANGUAGE OF COPYLIB.
       01  ACCEPT-PARM.
           05  ACCEPT1              PIC X(6).
           05  ACCEPT2              PIC X(6).
      *******************************************************************
      *                     PROCEDURE DIVISION
      *******************************************************************
       PROCEDURE DIVISION.

       00-MAIN.
           MOVE "QTEMP"    TO CCRTFILE-LIBRARY.
           MOVE "DQTDL2JB" TO CCRTFILE-FILE.
           MOVE  10        TO CCRTFILE-RECORD-LENGTH.
           MOVE 10000      TO CCRTFILE-NO-RECORDS.
           MOVE 2000       TO CCRTFILE-INCREMENT-AMT.
           MOVE 30         TO CCRTFILE-NO-INCREMENTS.
           MOVE 0          TO CCRTFILE-STATUS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY
                                 CCRTFILE-FILE
                                 CCRTFILE-RECORD-LENGTH
                                 CCRTFILE-NO-RECORDS
                                 CCRTFILE-INCREMENT-AMT
                                 CCRTFILE-NO-INCREMENTS
                                 CCRTFILE-STATUS.

           PERFORM 9999-OPENS.
           ACCEPT ACCEPT1.
           ACCEPT ACCEPT2.
           MOVE 3 TO DATE-MODE.
           MOVE ACCEPT1 TO DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT TO COMPARE-RETURN-DATE.
           MOVE ACCEPT2 TO DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT TO COMPARE-PRICE-DATE.

      *-----  FORMAT BOTH DATE FOR YEAR 2000 COMPATABILITY

           IF COMPARE-RETURN-DATE NUMERIC
              IF COMPARE-RETURN-YEAR > "70"
                 MOVE "19" TO COMPARE-RETURN-CENT
              ELSE
                 MOVE "20" TO COMPARE-RETURN-CENT
              END-IF
           END-IF.
           IF COMPARE-PRICE-DATE  NUMERIC
              IF COMPARE-PRICE-YEAR > "70"
                 MOVE "19" TO COMPARE-PRICE-CENT
              ELSE
                 MOVE "20" TO COMPARE-PRICE-CENT
              END-IF
           END-IF.
           PERFORM 100-FIND-DATED-QUOTES.
           PERFORM 200-DELETE-DATED-QUOTES.
           PERFORM 9999-CLOSES.
           DISPLAY DELETE-COUNT " RECORDS DELETED FROM " QUOTE-COUNT
                   " QUOTES.".
           GOBACK.

       100-FIND-DATED-QUOTES.
           PERFORM 9999-BEGFIL-DVENDITM-QT-O.
           PERFORM 9999-GETSER-DVENDITM-QT-O.
           OPEN OUTPUT FLAT-FILE.
           PERFORM UNTIL END-OF-FILE
             IF VEN-QUOTE-FLAG = "Q"
               IF  VEN-ACTUAL-DATE-RETURNED = SPACES
                 IF  VEN-RETURN-DATE-CN NOT > CY-COMPARE-RETURN-DATE
                   WRITE FLAT-REC FROM VEN-QUOTE-NUM
                 ELSE
                   NEXT SENTENCE
               ELSE
                 IF  VEN-ITM-PRICE-DATE-CN NOT > CY-COMPARE-PRICE-DATE
                   WRITE FLAT-REC FROM VEN-QUOTE-NUM
                 END-IF
               END-IF
             END-IF
             PERFORM 9999-GETSER-DVENDITM-QT-O
           END-PERFORM.
           CLOSE FLAT-FILE.
           SORT SORT-FILE ON ASCENDING KEY SORT-KEY
                    USING FLAT-FILE
                    GIVING FLAT-FILE.
           OPEN INPUT FLAT-FILE.
       200-DELETE-DATED-QUOTES.
           MOVE ZERO TO DELETE-COUNT QUOTE-COUNT.
           READ FLAT-FILE AT END MOVE "Y" TO EOF-FLAG.
           MOVE FLAT-REC TO COMPARE-QUOTE QUOTE-ARG.
           PERFORM UNTIL EOF-FLAG = "Y"
             MOVE "N" TO RECORDS-SKIPPED
             ADD 1 TO QUOTE-COUNT
             PERFORM 9999-CHAINHD-DVENDITM-QT-O
             PERFORM 9999-GETNEXT-DVENDITM-QT-O
             PERFORM UNTIL END-OF-CHAIN
               IF VEN-QUOTE-FLAG = "Q"
                 IF  VEN-ACTUAL-DATE-RETURNED = SPACES
                   IF  VEN-RETURN-DATE-CN NOT > CY-COMPARE-RETURN-DATE
                     PERFORM 9999-DSET-LOCK
                     PERFORM 9999-DELETE-DVENDITM-QT-O
                     PERFORM 9999-UNLOCK
                     ADD 1 TO DELETE-COUNT
                   ELSE
                     MOVE "Y" TO RECORDS-SKIPPED
                 ELSE
                   IF VEN-ITM-PRICE-DATE-CN NOT > CY-COMPARE-PRICE-DATE
                     MOVE DSET-DVENDITM TO DSET-NAME
                     PERFORM 9999-DSET-LOCK
                     PERFORM 9999-DELETE-DVENDITM-QT-O
                     PERFORM 9999-UNLOCK
                     ADD 1 TO DELETE-COUNT
                   ELSE
                     MOVE "Y" TO RECORDS-SKIPPED
                   END-IF
                 END-IF
               END-IF
               PERFORM 9999-GETNEXT-DVENDITM-QT-O
             END-PERFORM
             IF RECORDS-SKIPPED = "N"
               PERFORM 210-DELETE-TEXT-FOR-QUOTE
             END-IF
             READ FLAT-FILE NEXT RECORD
                      AT END MOVE "Y" TO EOF-FLAG
             END-READ
             PERFORM UNTIL FLAT-REC NOT = COMPARE-QUOTE
               READ FLAT-FILE NEXT RECORD
                        AT END MOVE "Y" TO EOF-FLAG
               END-READ
             END-PERFORM
             MOVE FLAT-REC TO COMPARE-QUOTE QUOTE-ARG
           END-PERFORM.

       210-DELETE-TEXT-FOR-QUOTE.
           PERFORM 9999-CHAINHD-DQUOTEXT-QT-O
           PERFORM 9999-GETNEXT-DQUOTEXT-QT-O
           PERFORM UNTIL END-OF-CHAIN
             MOVE DSET-DVENDITM TO DSET-NAME
             PERFORM 9999-DSET-LOCK
             PERFORM 9999-DELETE-DQUOTEXT-QT-O
             PERFORM 9999-UNLOCK
             PERFORM 9999-GETNEXT-DQUOTEXT-QT-O
           END-PERFORM.

       2100-BLOWUP.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG     ,
                         BU-DISPLAY-FLDS.

       9999-UNLOCK.
      * DUMMY COPYLIB MEMBER ON AS/400


       9999-DSET-LOCK.
      * DUMMY COPYLIB MEMBER ON AS/400

       9999-CHAINHD-DVENDITM-QT-O.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DVENDITM-QT-REC-O.
           START DVENDITM-QT-O KEY = QUOTENUM OF DVENDITM-QT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DVENDITM-QT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-CHAINHD-DQUOTEXT-QT-O.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-QT-REC-O.
           START DQUOTEXT-QT-O KEY = QUOTENUM OF DQUOTEXT-QT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DQUOTEXT-QT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-GETNEXT-DVENDITM-QT-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-QT-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DVENDITM-QT-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DVENDITM-QT-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF QUOTENUM OF DVENDITM-QT-REC-O NOT = QUOTE-ARG
               PERFORM 9999-RESET-DVENDITM-QT-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DVENDITM-QT-O.
           MOVE HIGH-VALUES TO QUOTENUM OF DVENDITM-QT-REC-O.
           START DVENDITM-QT-O KEY > QUOTENUM OF DVENDITM-QT-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-GETNEXT-DQUOTEXT-QT-O.
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT-QT-O NEXT INTO BUF-DQUOTEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DQUOTEXT-QT-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DQUOTEXT-QT-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF QUOTENUM OF DQUOTEXT-QT-REC-O NOT = QUOTE-ARG
               PERFORM 9999-RESET-DQUOTEXT-QT-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DQUOTEXT-QT-O.
           MOVE HIGH-VALUES TO QUOTENUM OF DQUOTEXT-QT-REC-O.
           START DQUOTEXT-QT-O KEY > QUOTENUM OF DQUOTEXT-QT-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.


       9999-GETSER-DVENDITM-QT-O.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-QT-O NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-DVENDITM-QT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-BEGFIL-DVENDITM-QT-O.
           MOVE SPACES TO QUOTENUM OF DVENDITM-QT-REC-O.
           START DVENDITM-QT-O KEY >= QUOTENUM OF DVENDITM-QT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.


       9999-DELETE-DVENDITM-QT-O.
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM-QT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DVENDITM-QT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DQUOTEXT-QT-O.
           MOVE 0 TO COND-WORD.
           DELETE DQUOTEXT-QT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DQUOTEXT-QT-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.


       9999-OPENS.
           OPEN I-O DVENDITM-QT-O.
           OPEN I-O DQUOTEXT-QT-O.

       9999-CLOSES.
           CLOSE DVENDITM-QT-O.
           CLOSE DQUOTEXT-QT-O.
