001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TQTGENPO.
001300 AUTHOR.         BARBARA WINTER.
001400*INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500*DATE-WRITTEN.   SEPTEMBER 1987.
001600*DATE-COMPILED.
001700*SECURITY.
001800*REMARKS.
001900************************************************************
002000*                 T Q T G E N P O                          *
002100*   PRODUCES SYSTEM-GENERATED PURCHASE ORDER FROM A QUOTE  *
002200*                                                          *
002600************************************************************
      *C    17JUL1997  DAVE PLUM
      *C    REVISED TO PROVIDE FOR THE POSSIBILITY THAT
      *C    FIELD VEN-DISCOUNT-PERCENT (VEN-DSCT, VEN-DSCT1,
      *C    VEN-DSCT2) MAY CONTAIN NON-NUMERIC DATA.
      *C
002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.    HP-3000.
003000 OBJECT-COMPUTER.    HP-3000.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300      SELECT INPUT-PO-FILE  ASSIGN TO DISK-DQTPO.
003400
            SELECT DVENDOR-I
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM-I
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DREQDESC-I
              ASSIGN TO DATABASE-MCFLCS2301
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MBUYER-I
              ASSIGN TO DATABASE-MCFLCS0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MSTORERM-I
              ASSIGN TO DATABASE-MCFLCS0201
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-I
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DQUOTEXT-I
              ASSIGN TO DATABASE-MCFLCS3801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
005400 DATA DIVISION.
005500 FILE SECTION.
001000*****************************************************
001100*  INPUT FILE FOR TLOADPO.SOURCE (ABSTFILE LAYOUT)  *
001110* PO-REC IS MOVED TO ANOTHER AREA BASED ON PO-TRANS *
001120* IF PO-DEL-FLAG = 'D' AND                          *
001130*    PO-TRANS=1  -  DELETE PO HEADER                *
001140*    PO-TRANS=3  -  DELETE CODED ITEM               *
001150*    PO-TRANS=4  -  DELETE NONCODED ITEM            *
001160*    PO-TRANS=5  -  DELETE DESCRIPTION              *
001170*                                                   *
001180* IF PO-DEL-FLANG = ' ' AND                         *
001190*    PO-TRANS=1  -  ADD PO HEADER                   *
001191*    PO-TRANS=2  -  ADD VENDOR RECORD               *
001192*    PO-TRANS=3  -  ADD CODED ITEM                  *
001193*    PO-TRANS=4  -  ADD NONCODED ITEM               *
001194*    PO-TRANS=5  -  ADD DESCRIPTION                 *
001195*    PO-TRANS=6,7,8 ARE IGNORED                     *
001196*    ALL OTHERS ARE INVALID                         *
001200*****************************************************
001300 FD  INPUT-PO-FILE
001400     LABEL RECORDS ARE OMITTED
001500     RECORD CONTAINS 133 CHARACTERS
001600     DATA RECORD IS INPUT-PO-REC.
001700 01  INPUT-PO-REC.
001800     05  FILLER                         PIC X.
001900     05  PO-TRANS                       PIC X.
002000     05  PO-DEL-FLAG                    PIC X.
002100     05  PO-INPUT-NUM.
002200         10  PO-NUM-1-7                 PIC X(7).
002300         10  PO-RLSE-8-10               PIC X(3).
002400     05  PO-REC                         PIC X(120).

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
       FD  DVENDITM-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DREQDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC-I.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  DQUOTEXT-I
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-I.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.

007800**************************************************************
007900*           W O R K I N G         S T O R A G E              *
008000**************************************************************
008100 WORKING-STORAGE SECTION.
       77  QT-ENTRIES                PIC 9(6).
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X.
           05  FILE-STATUS-2       PIC X.
005100
005300 01  ITEM-COUNT                PIC 9(4) VALUE ZEROES.
005400 01  LINE-NUM                  PIC 9(2) VALUE ZEROES.
005500 01  FOUND-PRICE               PIC S9(11)V9(4) COMP-4.
005600 01  DISCOUNT-PERCENT          PIC 9V9(6) COMP-4.
005800
007500
007600 01  GET-DATE.
007700     05  GMM                      PIC X(2)  VALUE SPACES.
007800     05  FILLER                   PIC X     VALUE SPACE.
007900     05  GDD                      PIC X(2)  VALUE SPACES.
008000     05  FILLER                   PIC X     VALUE SPACE.
008100     05  GYY                      PIC X(2)  VALUE SPACES.
008200
008300 01  COMPRESSED-TODAY-DATE.
008400     05  CMM                      PIC X(2)  VALUE SPACES.
008500     05  CDD                      PIC X(2)  VALUE SPACES.
008600     05  CYY                      PIC X(2)  VALUE SPACES.
008700
008800 01  MOVE-DATE1.
008810     05  MYY                      PIC X(2)  VALUE SPACES.
008900     05  MMM                      PIC X(2)  VALUE SPACES.
009000     05  MDD                      PIC X(2)  VALUE SPACES.
009200
009210 01  JCW-PARMS.
009220     05  JCW-NAME            PIC X(12)  VALUE SPACES.
009230     05  JCW-VALUE           PIC S9(4)  COMP-4.
009240     05  JCW-STATUS          PIC S9(4)  COMP-4.
009241
       COPY JCWAREA IN COPYLIB.
000001
001000*****************************************************************
001100**                                                             **
001200**     I N P U T   R E C O R D   F I L E   -   T L O A D P O   **
001300**                                                             **
001400*****************************************************************
002600 01  FILE-HEADER-LABEL.
002700     05  FILLER                         PIC X(3).
002800     05  HEADER-LABEL                   PIC X(15).
002900     05  SEND-SEQ                       PIC X(4).
003000*----------  "Y" IF USED FOR LOADING DATABASE ONLY.  NO
003100*            TRANSACTIONS ARE CREATED.
003200     05  LOAD-SW                        PIC X.
003210     05  IN-TYPE                        PIC X.
003220     05  IN-DOCUMENT                    PIC X(12).
003230     05  IN-QUOTE-DOC REDEFINES IN-DOCUMENT.
003240         07  IN-QUOTE                   PIC X(6).
003250         07  FILLER                     PIC X(6).
003300     05  FILLER                         PIC X(97).
003400
003500 01  FILE-TRAILER-LABEL REDEFINES FILE-HEADER-LABEL.
003600     05  FILLER                         PIC X(3).
003700     05  TRAILER-LABEL                  PIC X(13).
003800     05  FILLER                         PIC X(7).
           05  TRAILER-LABEL-CTR-X            PIC X(5).
003900     05  TRAILER-LABEL-CTR REDEFINES TRAILER-LABEL-CTR-X
                                              PIC 9(5).
004000     05  FILLER                         PIC X(105).

001500 01  PO-HEADER-BUFFER.
001600     05  IN-PO-REQ-NUM             PIC X(12).
001700     05  IN-PO-RCV-DEPT.
001800         10  IN-RCV-DEPT-1-2       PIC X(2).
001900         10  FILLER                PIC X(4).
002000     05  IN-PO-RCV-DEPT-R  REDEFINES  IN-PO-RCV-DEPT.
002100         10  IN-RCV-DEPT-1-3       PIC X(3).
002200         10  IN-RCV-DEPT-4         PIC X.
002300         10  FILLER                PIC XX.
002400     05  IN-PO-FOR-DEPT            PIC X(6).
002500     05  IN-PO-DATE.
002600         10 IN-PO-DATE-MM          PIC XX.
002700         10 IN-PO-DATE-DD          PIC XX.
002800         10 IN-PO-DATE-YY          PIC XX.
002900     05  IN-PO-PLT                 PIC X(3).
003000     05  IN-PO-BLDG                PIC X(4).
003100     05  IN-PO-ACCTG-INFO.
003200         10  IN-PO-COMPANY         PIC X(3).
003300         10  IN-PO-PRIME           PIC X(3).
003400         10  IN-PO-SUB             PIC X(3).
003500         10  IN-PO-SUB-DETL        PIC X(4).
003600         10  IN-PO-ADDL-DATA       PIC X(6).
003700     05  IN-PO-TERMS.
003800         10  IN-PO-PCT             PIC X.
003900         10  IN-PO-DUE-DTE         PIC X.
004000     05  IN-PO-BUYER               PIC X(16).
004100     05  IN-PO-ADDTL-INFO          PIC X(16).
004200     05  IN-PO-VIA                 PIC X(20).
004300     05  IN-PO-FOB                 PIC X(2).
004400     05  IN-CONST-INDICATOR        PIC X.
004500     05  IN-BUYER-CODE             PIC X(4).
004600     05  FILLER                    PIC X(3).
004700
004800 01  PO-VENDOR-BUFFER.
004900     05  IN-VENDOR-CODE.
005000         10  IN-VENDOR-CODE1-7     PIC X(7).
005100         10  IN-VENDOR-CODE8-10    PIC X(3).
005200     05  IN-VENDOR-NAME            PIC X(44).
005300     05  IN-PO-BUDGET-NUMBER       PIC X(12).
005400     05  IN-PO-BUDGET-AMT-9        PIC S9(8).
005500     05  IN-PO-BUDGET-AMT-X REDEFINES IN-PO-BUDGET-AMT-9
005600                                   PIC X(8).
005700     05  IN-PO-SHIP-DATE.
005800         10 IN-PO-SHIP-MM          PIC XX.
005900         10 IN-PO-SHIP-DD          PIC XX.
006000         10 IN-PO-SHIP-YY          PIC XX.
006100     05  IN-EXP-DATE.
006200         10  IN-EXP-DATE-MM        PIC XX.
006300         10  IN-EXP-DATE-DD        PIC XX.
006400         10  IN-EXP-DATE-YY        PIC XX.
006500     05  IN-CURRENCY-CODE          PIC X(2).
006600     05  IN-LAST-RELEASE           PIC 9(3).
006700     05  IN-LAST-RELEASE-X  REDEFINES  IN-LAST-RELEASE
006800                                   PIC X(3).
           05  IN-LAST-CHANGE-NOTICE     PIC X(3).
           05  IN-INVOICELESS-IND        PIC X(1).
006900     05  FILLER                    PIC X(25).
007000
007100 01  STR-ITEM-BUFFER.
007200     05  IN-CORP-CODE              PIC X(8).
007300     05  IN-ITM-NUM                PIC X(4).
007400     05  IN-ITM-NUM-9 REDEFINES IN-ITM-NUM
007500                                   PIC 9(4).
007600     05  IN-ITM-QTY-ORD-9          PIC S9(8)V9(4).
007700     05  IN-ITM-QTY-ORD-X REDEFINES IN-ITM-QTY-ORD-9
007800                                   PIC X(12).
007900     05  IN-ITM-QTY-UM             PIC XX.
008000     05  IN-ITM-PRICE-UM           PIC X(2).
008100     05  IN-ITM-UNIT-PRICE-9  PIC S9(8)V9(4).
008200     05  IN-ITM-UNIT-PRICE-X REDEFINES IN-ITM-UNIT-PRICE-9
008300                                   PIC X(12).
008400     05  IN-ITM-SUB-DETAIL         PIC X(4).
008500     05  IN-ITM-ADDL-DATA          PIC X(6).
008600     05  IN-ITM-REQ-NO             PIC X(10).
008700     05  IN-ITM-CONTAINER-INDIC    PIC X.
           05  IN-ITM-TAX-CODE           PIC XX.
008800     05  FILLER                    PIC X(57).
008900
009000 01  NS-ITEM-BUFFER.
009100     05  IN-NSTR-ITM-NUM           PIC X(4).
009200     05  IN-NSTR-QTY-UM            PIC X(2).
009300     05  IN-NSTR-QTY-ORD-9 PIC S9(8)V9(4).
009400     05  IN-NSTR-QTY-ORD-X REDEFINES IN-NSTR-QTY-ORD-9
009500                                   PIC X(12).
009600     05  IN-NSTR-PRICE-UM          PIC X(2).
009700     05  IN-NSTR-UNIT-PRICE-9  PIC S9(8)V9(4).
009800     05  IN-NSTR-UNIT-PRICE-X REDEFINES IN-NSTR-UNIT-PRICE-9
009900                                   PIC X(12).
010000     05  IN-NSTR-ITM-SUB           PIC X(3).
010100     05  IN-NSTR-SUB-DETL          PIC X(4).
010200     05  IN-NSTR-ADDL-DATA         PIC X(8).
010300     05  IN-NSTR-CORP-CODE         PIC X(8).
010400     05  IN-NSTR-REQ-NO            PIC X(10).
010500     05  IN-NSTR-CONTAINER-INDIC   PIC X.
           05  IN-NSTR-TAX-CODE          PIC XX.
010600     05  FILLER                    PIC X(52).
010700
010800 01  DATA-ITEM-BUFFER.
010900     05  IN-DATA-ITM-NUMBER        PIC X(4).
011000     05  IN-DATA-ITM-NUMBER-9 REDEFINES IN-DATA-ITM-NUMBER
011100                                   PIC 9(4).
011200     05  IN-DATA-LINE-NUMBER       PIC X(2).
011300     05  IN-DATA-LINE-NUMBER-9 REDEFINES IN-DATA-LINE-NUMBER
011400                                   PIC 9(2).
011500     05  IN-ABSTFILE-DESC.
011600         07  IN-PO-DATA-LINE           PIC X(62).
011700         07  IN-DATA-CONTAINER-INDIC   PIC X.
011800         07  IN-PROD-KEY               PIC X(20).
011900     05  IN-QUOTE-PO-DESC REDEFINES IN-ABSTFILE-DESC.
012000         07  IN-NC-ITEM-DESC       PIC X(80).
012100         07  FILLER                PIC X(3).
012200     05  FILLER                    PIC X(31).

       COPY CCRTFILE OF COPYLIB.
009400*************************************************************
009500*                D A T A B A S E   V A R I A B L E S        *
009600*************************************************************
009700 COPY DATAB OF COPYLIB.
010530
010600 01  VENDOR-ARG               PIC X(10)  VALUE SPACES.
010700 01  MPLTINFO-ARG             PIC X(4)   VALUE SPACES.
010800 01  CODE-ARG                 PIC X(8)   VALUE SPACES.
010900 01  BUYER-ARG                PIC X(4)   VALUE SPACES.
011000 01  REQ-ARG                  PIC X(12)  VALUE SPACES.
011100 01  QT-STD-ARG               PIC X(10)  VALUE "STAND     ".
011200 01  KEYMANUF-ARG             PIC X(50)  VALUE SPACES.
011300 01  PO-ARG.
011400     05  FILLER               PIC X      VALUE "P".
011500     05  PO-ARG-NUM           PIC X(10)  VALUE SPACES.
011600     05  FILLER               PIC X(3)   VALUE "000".
011700 01  QUOTE-ARG.
011800     05  QUOTE-ARG-NUM        PIC X(6)   VALUE SPACES.
011900     05  FILLER               PIC X(4)   VALUE SPACES.
012600 01  PASS-QUOTE-PRT               PIC 9(2)  COMP-4.
012700
013000 COPY MPLTINFO OF COPYLIB.
013010 COPY MBUYER   OF COPYLIB.
013020 COPY DVENDOR  OF COPYLIB.
013100 COPY DVENDITM OF COPYLIB.
013200 COPY DQUOTEXT OF COPYLIB.
013300 COPY MSTORERM OF COPYLIB.
013310 COPY DREQDESC OF COPYLIB.
013400 COPY VCOMAREA OF COPYLIB.
013500
013510 01  FORMFILE.
013520     05  FORM-FNAME               PIC X(7)  VALUE "FQUOTES".
013530     05  FILLER                   PIC X     VALUE ".".
013540     05  FORM-GNAME.
013550         10  FORM-GNAME1          PIC X(5)  VALUE "FLANG".
013560         10  FORM-GNAME2          PIC X(3)  VALUE SPACES.
013570     05  FILLER                   PIC X(19) VALUE SPACES.
013600 COPY TBLOWUP  OF COPYLIB.
       COPY TDATECHK OF COPYLIB.
013700 COPY LANGUAGE OF COPYLIB.
       COPY THDPRTA OF COPYLIB.
013800
025500 COPY THDPRTB OF COPYLIB.
       01  ACCEPT-DATA1.
001900     05  SQTPOS-PARMS.
002000         10  SQTPOS-PO.
002100             15  SQT-P            PIC X      VALUE "P".
002200             15  SQT-PO           PIC X(7)   VALUE SPACES.
002300             15  SQT-RLSE         PIC X(3)   VALUE "000".
002400             15  FILLER           PIC X(3)   VALUE "000".
002500         10  SQTPOS-QUOTE         PIC X(10)  VALUE SPACES.
002510         10  SQT-SHIPDATE         PIC X(6)     VALUE SPACES.
002520         10  SQT-EXPECT-DATE      PIC X(6)     VALUE SPACES.
002530         10  SQT-FOR-DPT          PIC X(6)     VALUE SPACES.
002540         10  SQT-ADDL             PIC X(16)    VALUE SPACES.
               10  SQT-TAX-CODE         PIC XX       VALUE SPACES.
               10  FILLER               PIC X(20)    VALUE SPACES.
       01  ACCEPT-DATA2.
           05  SQTPOS-PARM2.
002550         10  SQT-RCV-DPT          PIC X(6)     VALUE SPACES.
002560         10  SQT-BUDGET           PIC X(12)    VALUE SPACES.
002570         10  SQT-TM               PIC X(2)     VALUE SPACES.
002580         10  SQT-PRINT            PIC X        VALUE SPACE.
002581         10  SQT-LINK-REQ         PIC X        VALUE SPACE.
               10  FILLER               PIC X(58)    VALUE SPACES.
013900**************************************************************
014000*        P R O C E D U R E        D I V I S I O N            *
014100**************************************************************
014200 PROCEDURE DIVISION.
014300 00-MAIN.
014400     PERFORM 010-OPEN-ALL THRU 019-EXIT.
           ACCEPT ACCEPT-DATA1.
014700     DISPLAY ACCEPT-DATA1.
           ACCEPT ACCEPT-DATA2.
           DISPLAY ACCEPT-DATA2.
           MOVE 0 TO QT-ENTRIES.
014800     PERFORM 200-CREATE-PO-FROM-QUOTE THRU 299-EXIT.
014900
015000     PERFORM 020-CLOSE-ALL THRU 029-EXIT.
015100
015200     GOBACK.
015300****************************************************************
015400*           OPEN ALL FILES AND PREPARE FOR PROCESSING          *
015500****************************************************************
015600 010-OPEN-ALL.
017500
017600*----------  OPEN DATABASE
           OPEN INPUT DVENDOR-I DVENDITM-I DREQDESC-I MBUYER-I
                      MSTORERM-I MPLTINFO-I DQUOTEXT-I.
018200
018300*----------  FIND THE PLANT NUMBER AND PASS IT TO SUBROUTINES
018400     MOVE "P 01" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
018700     IF COND-WORD NOT = 0
018800           MOVE "DBGET MPLTINFO - TQTGENPO" TO BU-DISPLAY-MSG
018900           PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE "P" TO PO-ARG.
           MOVE "STAND     " TO QT-STD-ARG.
020500 019-EXIT.  EXIT.
020600
020700****************************************************************
020800*                    CLOSE ALL FILES                           *
020900****************************************************************
021000 020-CLOSE-ALL.
           CLOSE      DVENDOR-I DVENDITM-I DREQDESC-I MBUYER-I
                      MSTORERM-I MPLTINFO-I DQUOTEXT-I.
021300 029-EXIT.  EXIT.
021400 200-CREATE-PO-FROM-QUOTE.
021410     PERFORM 840-SET-JCW THRU 849-EXIT.
021500     MOVE SQTPOS-QUOTE TO QUOTE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DVENDITM-REC-I.
           START DVENDITM-I KEY = QUOTENUM OF DVENDITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
021800     IF NO-ENTRY
021900          GO TO 299-EXIT.
022000     IF NOT GOOD-CALL
022100        MOVE "DBFIND DVENDITM 200 TQTGENPO" TO BU-DISPLAY-MSG
022200        PERFORM 990-BLOWUP THRU 999-EXIT.
022300
022400 210-READ-ALL-ITEMS.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-I NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
022700     IF END-OF-CHAIN
022900        GO TO 299-EXIT.
023000     IF NOT GOOD-CALL
023100        MOVE "DBGET DVENDITM 210 TQTGENPO" TO BU-DISPLAY-MSG
023200        PERFORM 990-BLOWUP THRU 999-EXIT.
023300
023301     MOVE VEN-ITM-VENCODE TO VENDOR-ARG.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'XXXXXXXXXX'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "DQTPO   "    TO CCRTFILE-FILE.
           MOVE "0133"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "05000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DQTPO' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
023310     OPEN OUTPUT INPUT-PO-FILE.
023320*******************************************************
023330*    CREATE HEADER LABEL RECORD                       *
023340*******************************************************
023350     MOVE SPACES                TO INPUT-PO-REC.
023360     MOVE "PURCHASE ORDERS"     TO HEADER-LABEL.
023370     MOVE "N"                   TO LOAD-SW.
023380     MOVE QUOTE-ARG-NUM         TO IN-QUOTE.
           MOVE FILE-HEADER-LABEL     TO INPUT-PO-REC.
           DISPLAY INPUT-PO-REC.
023390     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
023391     MOVE SPACES                TO INPUT-PO-REC.
023392     MOVE SQTPOS-PO             TO PO-ARG.
023393     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
023400*******************************************************
023500*    CREATE PO HEADER RECORD                          *
023600*******************************************************
023700     MOVE SPACES TO PO-HEADER-BUFFER.
023800     MOVE "1" TO PO-TRANS.
023900     MOVE SQT-RCV-DPT           TO IN-PO-RCV-DEPT.
024000     MOVE SQT-FOR-DPT           TO IN-PO-FOR-DEPT.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO GET-DATE.
024200     MOVE GMM                   TO CMM.
024300     MOVE GDD                   TO CDD.
024400     MOVE GYY                   TO CYY.
024500     MOVE COMPRESSED-TODAY-DATE TO IN-PO-DATE.
024600     MOVE MPLTINFO-COMPANY      TO IN-PO-PLT, IN-PO-COMPANY.
024700     MOVE MPLTINFO-TERR         TO IN-PO-BLDG.
024800     MOVE MPLTINFO-PRIME        TO IN-PO-PRIME.
024900     MOVE SQT-TM                TO IN-PO-TERMS.
026100     MOVE VEN-FOB               TO IN-PO-FOB.
026200     MOVE VEN-BUYER-CODE        TO IN-BUYER-CODE.
025000
025100*----------  GET BUYER NAME
025200     MOVE VEN-BUYER-CODE TO BUYER-ARG.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
025500     IF NO-ENTRY
025600        MOVE SPACES TO IN-PO-BUYER
025700     ELSE
025800        MOVE BUYER-NAME TO IN-PO-BUYER
              MOVE BUYER-CODE TO IN-BUYER-CODE.
025900
9310BD*//////// THIS WAS ADDED ON 10-27-93 TO TAKE THE FOB AND TERMS
9310BD*         DATA FROM THE VENDOR FILE.
9310BD*         PART OF REQUEST 93-021 FROM GRADY CARRIGAN IN
9310BD*         DANVILLE.   B DISMUKES
9310BD*----------  GET VENDOR FOB AND TERMS IF THEY EXIST
9310BD     MOVE 0 TO COND-WORD.
9310BD     MOVE VENDOR-ARG TO VENCDE OF DVENDOR-REC-I.
9310BD     START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
9310BD         INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
9310BD     IF FILE-STATUS NOT = "00"
9310BD         IF FILE-STATUS-1 = "2"
9310BD             MOVE 17 TO COND-WORD
9310BD         ELSE
9310BD             MOVE 99 TO COND-WORD.
9310BD     IF NO-ENTRY
9310BD        GO TO 230-CONTINUE.
9310BD     IF NOT GOOD-CALL
9310BD        MOVE "DBFIND DVENDOR 160 SQUOTUPD" TO BU-DISPLAY-MSG
9310BD        PERFORM 990-BLOWUP THRU 999-EXIT.
9310BD
9310BD 220-DVENDOR-LOOP.
9310BD     MOVE 0 TO COND-WORD.
9310BD     READ DVENDOR-I NEXT INTO BUF-DVENDOR
9310BD         AT END MOVE FILE-STATUS TO FILE-STATUS.
9310BD     IF FILE-STATUS NOT = "00"
9310BD         IF FILE-STATUS = "10" OR "14" OR "46"
9310BD             MOVE 15 TO COND-WORD
9310BD         ELSE
9310BD             MOVE 99 TO COND-WORD.
9310BD     IF VENCDE OF DVENDOR-REC-I NOT = VEN-ITM-VENCODE
9310BD         MOVE 15 TO COND-WORD.
9310BD     IF END-OF-CHAIN
9310BD        GO TO 220-CONTINUE.
9310BD     IF NOT GOOD-CALL
9310BD        MOVE "DBGET DVENDOR 220 TQTGENPO" TO BU-DISPLAY-MSG
9310BD        PERFORM 990-BLOWUP THRU 999-EXIT.
9310BD
9310BD     IF VEN-ITM-NO = "16"
9310BD        MOVE VEN-PO-FOB             TO  IN-PO-FOB
9310BD        IF SQT-TM = SPACES
9310BD            MOVE VEN-PO-TERMS       TO  IN-PO-TERMS.
9310BD
9310BD     GO TO 220-DVENDOR-LOOP.

9310BD 220-CONTINUE.
026000     MOVE SQT-ADDL              TO IN-PO-ADDTL-INFO.
026300     MOVE PO-HEADER-BUFFER      TO PO-REC.
023393     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
           DISPLAY INPUT-PO-REC.
026400     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
026600*************************************************************
026700*            CREATE VENDOR RECORD                           *
026800*************************************************************
026900     MOVE SPACES TO PO-VENDOR-BUFFER.
027000     MOVE "2"                   TO PO-TRANS.
027100     MOVE VEN-ITM-VENCODE       TO IN-VENDOR-CODE.
027200
027300*----------  GET VENDOR NAME AND CURRENCY CODE
           MOVE 0 TO COND-WORD.
           MOVE VENDOR-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
027900     IF NO-ENTRY
028100        GO TO 230-CONTINUE.
028200     IF NOT GOOD-CALL
028300        MOVE "DBFIND DVENDOR 160 SQUOTUPD" TO BU-DISPLAY-MSG
028400        PERFORM 990-BLOWUP THRU 999-EXIT.
028600
028800 225-DVENDOR-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ITM-VENCODE
               MOVE 15 TO COND-WORD.
029100     IF END-OF-CHAIN
029200        GO TO 230-CONTINUE.
029300     IF NOT GOOD-CALL
029400        MOVE "DBGET DVENDOR 225 TQTGENPO" TO BU-DISPLAY-MSG
029500        PERFORM 990-BLOWUP THRU 999-EXIT.
029600
029700     IF VEN-ITM-NO = "00"
029800        MOVE VEN-ITM-DATA          TO IN-VENDOR-NAME
029900     ELSE
030000       IF VEN-ITM-NO = "10"
030100          MOVE VEN-CC TO IN-CURRENCY-CODE
9310BD*///////   ADDED 93-10-27 AS A PART OF REQUEST 93-021 TO
9310BD*          IDENTIFY A P.O. AS INVOICELESS FROM A QUOTE.
9310BD          MOVE VEN-INVLESS-IND TO IN-INVOICELESS-IND
             END-IF
           END-IF.

030200     GO TO 225-DVENDOR-LOOP.
030300
030310 230-CONTINUE.
           IF SQT-BUDGET = SPACES
              MOVE "000000000000"     TO IN-PO-BUDGET-NUMBER
           ELSE
030400        MOVE SQT-BUDGET         TO IN-PO-BUDGET-NUMBER.
030500     MOVE SQT-SHIPDATE          TO MOVE-DATE1.
030600     MOVE MYY                   TO IN-PO-SHIP-YY.
030700     MOVE MMM                   TO IN-PO-SHIP-MM.
030800     MOVE MDD                   TO IN-PO-SHIP-DD.
030900     MOVE SQT-EXPECT-DATE       TO MOVE-DATE1.
031000     MOVE MYY                   TO IN-EXP-DATE-YY.
031100     MOVE MMM                   TO IN-EXP-DATE-MM.
031200     MOVE MDD                   TO IN-EXP-DATE-DD.
031300     MOVE PO-VENDOR-BUFFER      TO PO-REC.
023393     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
           DISPLAY INPUT-PO-REC.
031400     WRITE INPUT-PO-REC.
           ADD 1 TO QT-ENTRIES.
031600*************************************************************
031700*     NOW CREATE CODED AND NONCODED ITEM RECORDS            *
031800*************************************************************
031900     MOVE 0 TO ITEM-COUNT.
032000
032100 250-LOOP-FOR-ITEMS.
032200     ADD 1 TO ITEM-COUNT.
032300     IF VEN-ITM-CORPCODE = "NON-STR"
032301        PERFORM 800-NC-ITEM-DATA THRU 809-EXIT
032310        IF VEN-REQ = SPACES
032400           PERFORM 810-WRITE-NC-ITEM THRU 819-EXIT
032410        ELSE
032420           PERFORM 890-PRINT-NONCODED-REQ THRU 899-EXIT
032500     ELSE
032600        PERFORM 820-WRITE-CODED-ITEM THRU 829-EXIT.
032700
           MOVE 0 TO COND-WORD.
           READ DVENDITM-I NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DVENDITM-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
033000     IF END-OF-CHAIN
023350        MOVE SPACES                TO INPUT-PO-REC
                                            FILE-TRAILER-LABEL
              ADD 1                      TO QT-ENTRIES
              MOVE QT-ENTRIES            TO TRAILER-LABEL-CTR
023360        MOVE "END PURCHASE "       TO TRAILER-LABEL
              MOVE FILE-TRAILER-LABEL    TO INPUT-PO-REC
              DISPLAY INPUT-PO-REC
023390        WRITE INPUT-PO-REC
033010        CLOSE INPUT-PO-FILE
033020        PERFORM 850-SET-JCW THRU 859-EXIT
033100        GO TO 299-EXIT.
033200     IF NOT GOOD-CALL
033300        MOVE "DBGET DVENDITM 250 TQTGENPO" TO BU-DISPLAY-MSG
033400        PERFORM 990-BLOWUP THRU 999-EXIT.
033500
033600     GO TO 250-LOOP-FOR-ITEMS.
033700 299-EXIT.  EXIT.
033800
036900*************************************************************
037000*           WRITE NONCODED ITEM RECORDS                     *
037100*************************************************************
037200 800-NC-ITEM-DATA.
037300     MOVE SPACES                TO NS-ITEM-BUFFER.
037400     MOVE "4"                   TO PO-TRANS.
037500     MOVE ITEM-COUNT            TO IN-NSTR-ITM-NUM.
037600     MOVE VEN-NONCODED-UM       TO IN-NSTR-QTY-UM.
037610     IF SQT-RLSE = "999"
037620        MOVE 0                  TO IN-NSTR-QTY-ORD-9
037630     ELSE
037700        MOVE VEN-BID-QTY        TO IN-NSTR-QTY-ORD-9.
037800     PERFORM 830-FIND-PRICE THRU 839-EXIT.
037900     MOVE FOUND-PRICE           TO IN-NSTR-UNIT-PRICE-9.
038000     MOVE VEN-ITM-PRICE-UM      TO IN-NSTR-PRICE-UM.
038100     MOVE "NON-STR"             TO IN-NSTR-CORP-CODE.
038110     IF SQT-LINK-REQ = "N"
038111        MOVE SPACES             TO IN-NSTR-REQ-NO
038120     ELSE
038130        MOVE VEN-REQ            TO IN-NSTR-REQ-NO.
           MOVE SQT-TAX-CODE          TO IN-ITM-TAX-CODE,
                                         IN-NSTR-TAX-CODE.
038300     MOVE NS-ITEM-BUFFER        TO PO-REC.
023393     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
           DISPLAY INPUT-PO-REC.
038400     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
038410 809-EXIT.  EXIT.
038500
038510 810-WRITE-NC-ITEM.
038600     MOVE "5"                   TO PO-TRANS.
038700     MOVE 0                     TO LINE-NUM.
038800
           MOVE 0 TO COND-WORD.
           MOVE QUOTE-ARG TO QUOTENUM OF DQUOTEXT-REC-I.
           START DQUOTEXT-I KEY = QUOTENUM OF DQUOTEXT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
039100     IF NOT GOOD-CALL
039200        MOVE "DBFIND 810 TQTGENPO" TO BU-DISPLAY-MSG
039300        PERFORM 990-BLOWUP THRU 999-EXIT.
039400
039500 815-WRITE-NC-DESC.
           MOVE 0 TO COND-WORD.
           READ DQUOTEXT-I NEXT INTO BUF-DQUOTEXT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF QUOTENUM OF DQUOTEXT-REC-I NOT = QUOTE-ARG
               MOVE 15 TO COND-WORD.
039800     IF END-OF-CHAIN
039900        GO TO 819-EXIT.
040000     IF NOT GOOD-CALL
040100        MOVE "DBGET DQUOTEXT 815 TQTGENPO" TO BU-DISPLAY-MSG
040200        PERFORM 990-BLOWUP THRU 999-EXIT.
040300
040400     IF DQUOTEXT-ITM-NO NOT = VEN-NONCODED-ITEM
040500        GO TO 815-WRITE-NC-DESC.
040600     MOVE DQUOTEXT-DATA TO IN-QUOTE-PO-DESC.
040700
040800     MOVE LINE-NUM              TO IN-DATA-LINE-NUMBER.
040900     MOVE ITEM-COUNT            TO IN-DATA-ITM-NUMBER-9.
041000     MOVE DATA-ITEM-BUFFER      TO PO-REC.
023393     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
           DISPLAY INPUT-PO-REC.
041100     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
041200     ADD 1 TO LINE-NUM.
041300     GO TO 815-WRITE-NC-DESC.
041400
041500 819-EXIT.  EXIT.
041600
041700*************************************************************
041800*              WRITE CODED ITEM RECORD                      *
041900*************************************************************
042000 820-WRITE-CODED-ITEM.
042100     MOVE SPACES                TO STR-ITEM-BUFFER.
042200     MOVE "3"                   TO PO-TRANS.
042300     MOVE VEN-ITM-CORPCODE      TO IN-CORP-CODE.
042400     MOVE ITEM-COUNT            TO IN-ITM-NUM-9.
042410     IF SQT-RLSE = "999"
042420        MOVE 0                  TO IN-ITM-QTY-ORD-9
042430     ELSE
042500        MOVE VEN-BID-QTY        TO IN-ITM-QTY-ORD-9.
042600     MOVE VEN-ITM-CORPCODE TO CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
042900     IF COND-WORD NOT = 0
043000         MOVE "GET MSTORERM 820 TQTGENPO" TO BU-DISPLAY-MSG
043100         PERFORM 990-BLOWUP THRU 999-EXIT.
043200
043300     MOVE STR-UM                TO IN-ITM-QTY-UM.
           IF VEN-ITM-PRICE-UM = "  "
               MOVE STR-UM            TO IN-ITM-PRICE-UM
           ELSE
043400     MOVE VEN-ITM-PRICE-UM      TO IN-ITM-PRICE-UM.
043500     PERFORM 830-FIND-PRICE THRU 839-EXIT.
043600     MOVE FOUND-PRICE           TO IN-ITM-UNIT-PRICE-9.
043710     IF SQT-LINK-REQ = "N"
043720        MOVE SPACES             TO IN-ITM-REQ-NO
043730     ELSE
043800        MOVE VEN-REQ            TO IN-ITM-REQ-NO.
           MOVE SQT-TAX-CODE          TO IN-ITM-TAX-CODE,
                                         IN-NSTR-TAX-CODE.
043900     MOVE STR-ITEM-BUFFER       TO PO-REC.
041100     MOVE PO-ARG-NUM            TO PO-INPUT-NUM.
           DISPLAY INPUT-PO-REC.
044000     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
044100 829-EXIT.  EXIT.
044200************************************************************
044300*   COMPUTE WHAT PRICE SHOULD BE FOR THE ORDERED QTY       *
044400************************************************************
044500 830-FIND-PRICE.
044600     MOVE VEN-ITM-PRICE         TO FOUND-PRICE.
           IF VEN-DSCT IS NOT NUMERIC
              MOVE ZEROES TO VEN-DISCOUNT-PERCENT.
044700     IF VEN-DISCOUNT-PERCENT = ZEROES
044800        NEXT SENTENCE
044900     ELSE
045000         COMPUTE FOUND-PRICE ROUNDED =
045100             VEN-DISCOUNT-PERCENT / 100
045200         COMPUTE FOUND-PRICE ROUNDED = VEN-ITM-PRICE -
045300             (VEN-ITM-PRICE * FOUND-PRICE).
045400
045500     IF VEN-LOW-QTY (1) = ZERO
045600        GO TO 835-LAST-CHANCE.
045700     IF VEN-BID-QTY NOT < VEN-LOW-QTY (1)
045800        IF VEN-BID-QTY NOT > VEN-HIGH-QTY (1)
046000           MOVE VEN-WORK-PRICE (1) TO FOUND-PRICE.
046100     IF VEN-BID-QTY NOT < VEN-LOW-QTY (2)
046200        IF VEN-BID-QTY NOT > VEN-HIGH-QTY (2)
046400           MOVE VEN-WORK-PRICE (2) TO FOUND-PRICE.
046500     IF VEN-BID-QTY NOT < VEN-LOW-QTY (3)
046600        IF VEN-BID-QTY NOT > VEN-HIGH-QTY (3)
046800           MOVE VEN-WORK-PRICE (3) TO FOUND-PRICE.
046900
047000  835-LAST-CHANCE.
047111     IF FOUND-PRICE = ZERO
047112        MOVE VEN-ITM-PRICE    TO FOUND-PRICE.
047113
047114 839-EXIT.  EXIT.
047115 840-SET-JCW.
047120*----------  SETJCW 'JCWQT' TO 0 TO TELL XLOADPO.OBJECT THAT THIS
047130*            ABSTFILE WAS CREATED FROM A QUOTE PROGRAM.  IF THIS
047140*            PROGRAM ENDS WITHOUT ABORTING, 'JCWQT' WILL BE CHANGED
047150*            TO A 1.
047160*    MOVE "SETJCW JCWQT = 0" TO COMMAND.
100800     MOVE "0"      TO SETJCW-VALUE.
           MOVE 290      TO SETJCW-STARTING-POS.
           MOVE 1        TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               MOVE SETJCW-STATUS TO BU-DISPLAY-FLD (1)
047230         PERFORM 990-BLOWUP THRU 999-EXIT.
047240
047250*----------  SET JCW IF PO IS TO BE PRINTED AFTER BEING CREATED
047260     IF SQT-PRINT = "Y"
047280*       MOVE "SETJCW PRTPO = 1" TO COMMAND
100800        MOVE "1"      TO SETJCW-VALUE
              MOVE 258      TO SETJCW-STARTING-POS
              MOVE 1        TO SETJCW-LENGTH
              CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS
              IF SETJCW-STATUS NOT = "00"
                  MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
                  MOVE SETJCW-STATUS TO BU-DISPLAY-FLD (1)
047230            PERFORM 990-BLOWUP THRU 999-EXIT.
047350 849-EXIT.  EXIT.
047360 850-SET-JCW.
047370*----------  IF HERE, PROGRAM IS ENDING GOOD, SO CHANGE JCW VALUE
047380*    MOVE "SETJCW JCWQT = 1" TO COMMAND.
100700
100800     MOVE "1"      TO SETJCW-VALUE.
           MOVE 290      TO SETJCW-STARTING-POS.
           MOVE 1        TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               MOVE SETJCW-STATUS TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.
047450
047502 859-EXIT.  EXIT.
048000 890-PRINT-NONCODED-REQ.
048230     MOVE "5"                   TO PO-TRANS.
048240     MOVE 0                     TO LINE-NUM.
048250
049400     MOVE VEN-REQ TO REQ-ARG.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-I.
           START DREQDESC-I KEY = REQNO OF DREQDESC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
049700     IF NOT GOOD-CALL
049800        MOVE "DBFIND DREQDESC 890 CQTPRT" TO BU-DISPLAY-MSG
049900        PERFORM 990-BLOWUP THRU 999-EXIT.
050000
050100 895-NC-DESC.
           MOVE 0 TO COND-WORD.
           READ DREQDESC-I NEXT INTO BUF-DREQDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF REQNO OF DREQDESC-REC-I NOT = REQ-ARG
               MOVE 15 TO COND-WORD.
050400     IF END-OF-CHAIN
050700        GO TO 899-EXIT.
050800     IF NOT GOOD-CALL
050900        MOVE "DBGET DREQDESC 895 CQTPRT" TO BU-DISPLAY-MSG
051000        PERFORM 990-BLOWUP THRU 999-EXIT.
051100
051200     IF REQDESC-LINE-NO = "95" OR "96"
051300        GO TO 895-NC-DESC.
051400
052100     MOVE REQDESC-DATA TO IN-QUOTE-PO-DESC.
052110
052120     MOVE LINE-NUM              TO IN-DATA-LINE-NUMBER.
052130     MOVE ITEM-COUNT            TO IN-DATA-ITM-NUMBER-9.
052140     MOVE DATA-ITEM-BUFFER      TO PO-REC.
           DISPLAY INPUT-PO-REC.
052150     WRITE INPUT-PO-REC.
           ADD 1                      TO QT-ENTRIES.
052160     ADD 1 TO LINE-NUM.
053000     GO TO 895-NC-DESC.
053100 899-EXIT.  EXIT.
055000************************************************************
055100*                    B L O W U P                           *
055200*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
055300*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
055400*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
055500*                                                          *
055600*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
055700*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
055800*                                                          *
055900*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
056000************************************************************
056100 990-BLOWUP.
056200*----------  PURGE THE FILE
056300     MOVE SQTPOS-PO       TO BU-DISPLAY-FLD (1).
056400     MOVE SQTPOS-QUOTE    TO BU-DISPLAY-FLD (2).
056500     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
056600           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
056700           BU-DISPLAY-FLDS.
056800 999-EXIT.  EXIT.
