001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TQTPOEND.
001300 AUTHOR.         BARBARA WINTER.
001400*INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500 DATE-WRITTEN.   SEPTEMBER 1987.
001600 DATE-COMPILED.
001700*SECURITY.
001800*REMARKS.
001900************************************************************
002000*                 T Q T P O E N D                          *
002100*   CLEANS UP ANY LEFTOVER PROCESSING FROM CREATING A PO   *
002200*   FROM A QUOTE.  THIS PROGRAM CALCULATES BUDGET AMOUNT,  *
002300*   DETERMINES IF THE PO SHOULD BE PRINTED, ETC.           *
002400*                                                          *
002500************************************************************
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER.    HP-3000.
002900 OBJECT-COMPUTER.    HP-3000.
003000 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003400
            SELECT DPOITEM-I
              ASSIGN TO DATABASE-MCFLCS1002
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DPORECD-O
              ASSIGN TO DATABASE-MCFLCS0901
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MSTORERM-I
              ASSIGN TO DATABASE-MCFLCS0201
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-I
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
003100 DATA DIVISION.
003200 FILE SECTION.
003300
       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPORECD-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
003400
003500 WORKING-STORAGE SECTION.
       77  ISO-9000-PRINT-SW       PIC X      VALUE SPACE.

009210 01  JCW-PARMS.
009220     05  JCW-NAME            PIC X(12)  VALUE SPACES.
009230     05  JCW-VALUE           PIC S9(4)  COMP-4.
009240     05  JCW-STATUS          PIC S9(4)  COMP-4.
009241
       COPY JCWAREA IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X.
           05  FILE-STATUS-2       PIC X.
005100
003600 01  BUDGET-AMOUNT             PIC S9(11)V9(4) COMP-4 VALUE 0.
003700 01  ITM-AMT                   PIC S9(8)V9(4)  COMP-4 VALUE 0.
003800
       01  ACCEPT-DATA1.
001900     05  SQTPOS-PARMS.
002000         10  SQTPOS-PO.
002100             15  SQT-P            PIC X      VALUE "P".
002200             15  SQT-PO           PIC X(7)   VALUE SPACES.
002300             15  SQT-RLSE         PIC X(3)   VALUE "000".
002400             15  FILLER           PIC X(3)   VALUE "000".
002500         10  SQTPOS-QUOTE         PIC X(10)  VALUE SPACES.
002510         10  SQT-SHIPDATE         PIC X(6)     VALUE SPACES.
002520         10  SQT-EXPECT-DATE      PIC X(6)     VALUE SPACES.
002530         10  SQT-FOR-DPT          PIC X(6)     VALUE SPACES.
002540         10  SQT-ADDL             PIC X(16)    VALUE SPACES.
               10  SQT-TAX-CODE         PIC XX       VALUE SPACES.
               10  FILLER               PIC X(20)    VALUE SPACES.
       01  ACCEPT-DATA2.
           05  SQTPOS-PARM2.
002550         10  SQT-RCV-DPT          PIC X(6)     VALUE SPACES.
002560         10  SQT-BUDGET           PIC X(12)    VALUE SPACES.
002570         10  SQT-TM               PIC X(2)     VALUE SPACES.
002580         10  SQT-PRINT            PIC X        VALUE SPACE.
002581         10  SQT-LINK-REQ         PIC X        VALUE SPACE.
               10  FILLER               PIC X(58)    VALUE SPACES.
005500*************************************************************
005600*                D A T A B A S E   V A R I A B L E S        *
005700*************************************************************
005800 COPY DATAB OF COPYLIB.
006700 01  PO-ARG.
006800     05  FILLER               PIC X      VALUE "P".
006900     05  PO-ARG-NUM           PIC X(10)  VALUE SPACES.
007000     05  FILLER               PIC X(3)   VALUE "000".
007100 01  CODE-ARG                 PIC X(8)   VALUE SPACES.
007110 01  PLT-ARG                  PIC X(4)   VALUE SPACES.
007200
007310 COPY MPLTINFO OF COPYLIB.
007400 COPY DPOITEM  OF COPYLIB.
007500 COPY MSTORERM OF COPYLIB.
007600 COPY DPORECD  OF COPYLIB.
007700 COPY TBLOWUP OF COPYLIB.
007800 COPY TUMCF    OF COPYLIB.
007810 01  PO-PRINT-PARMS.
007811     05  PO-NUMBER.
007812         10  FILLER            PIC X.
007813         10  PETTY-PO-CHECK    PIC X.
007814         10  FILLER            PIC X(12).
007815     05  PO-REPRINT            PIC X.
007816     05  PO-PRINT-TYPE         PIC X.
007817     05  PO-MODIFIED-ORDER     PIC X.
007818     05  PO-CANCELLED-ORDER    PIC X.
007819     05  SPOOL-PRINT-NUM        PIC S9(2)  COMP-4.
007820     05  PO-ITEMS OCCURS 15 INDEXED BY P-INDEX.
007821         10  PO-ITEM            PIC X(4).
007822
007823 01  FORMFILE.
007824     05  FORM-FNAME                PIC X(8)  VALUE "FQTPO   ".
007825     05  FILLER                    PIC X     VALUE ".".
007826     05  FORM-GNAME.
007827         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
007828         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
007829     05  FILLER                    PIC X(19) VALUE SPACES.
007830
007831 COPY LANGUAGE OF COPYLIB.
007900
007910 COPY ESCNAM2 OF COPYLIB.
008000**************************************************************
008100*        P R O C E D U R E        D I V I S I O N            *
008200**************************************************************
008300 PROCEDURE DIVISION.
008400 00-MAIN.
008500     PERFORM 010-OPEN-ALL THRU 019-EXIT.
008600
008700     ACCEPT ACCEPT-DATA1.
008800     DISPLAY ACCEPT-DATA1.
008700     ACCEPT ACCEPT-DATA2.
008800     DISPLAY ACCEPT-DATA2.
008900     PERFORM 200-CALCULATE-BUDGET-OF-PO THRU 299-EXIT.
009000     PERFORM 300-PRINT-PO THRU 399-EXIT.
009100     PERFORM 020-CLOSE-ALL THRU 029-EXIT.
009200
009300     GOBACK.
009400****************************************************************
009500*           OPEN ALL FILES AND PREPARE FOR PROCESSING          *
009600****************************************************************
009700 010-OPEN-ALL.
009710     CALL "TESCSEQ" USING ESC-NAME.
009720     MOVE SPACES    TO PO-PRINT-PARMS.
           OPEN INPUT DPOITEM-I
                      MSTORERM-I MPLTINFO-I.
010500     OPEN I-O DPORECD-O.

010510*----------  SET PRICE JCW SO THE PRICES WILL PRINT ON THE PO
100800     MOVE "1"      TO SETJCW-VALUE.
           MOVE 258      TO SETJCW-STARTING-POS.
           MOVE 1        TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               MOVE SETJCW-STATUS TO BU-DISPLAY-FLD (1)
047230         PERFORM 990-BLOWUP THRU 999-EXIT.
010600 019-EXIT.  EXIT.
010700
010800****************************************************************
010900*                    CLOSE ALL FILES                           *
011000****************************************************************
011100 020-CLOSE-ALL.
           CLOSE      DPOITEM-I DPORECD-O
                      MSTORERM-I MPLTINFO-I.
011400 029-EXIT.  EXIT.
011500 200-CALCULATE-BUDGET-OF-PO.
011600     MOVE SQTPOS-PO TO PO-ARG.
011610     IF SQT-RLSE = "999"
011620        GO TO 299-EXIT.
011630
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC-I.
           START DPOITEM-I KEY = PORCVNO OF DPOITEM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
011900     IF NO-ENTRY
012000          GO TO 299-EXIT.
012100     IF NOT GOOD-CALL
012200        MOVE "DBFIND DPOITEM 200 TQTPOEND" TO BU-DISPLAY-MSG
012300        PERFORM 990-BLOWUP THRU 999-EXIT.
012400
012500 210-READ-ALL-ITEMS.
012600     MOVE 0 TO ITM-AMT.
           MOVE 0 TO COND-WORD.
           READ DPOITEM-I NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC-I NOT = PO-ARG
               MOVE 15 TO COND-WORD.
012900     IF END-OF-CHAIN
013000        GO TO 230-UPDATE-DPORECD.
013100     IF NOT GOOD-CALL
013200        MOVE "DBGET DPOITEM 210 TQTPOEND" TO BU-DISPLAY-MSG
013300        PERFORM 990-BLOWUP THRU 999-EXIT.
013400
013500*-----------  CALCULATE BUDGET AMOUNT
013600     IF ITM-PRICE-UM = ITM-UM
013700        MULTIPLY ITM-QTY-ORD BY ITM-UNIT-PRICE
013800                 GIVING ITM-AMT ROUNDED
013900     ELSE
014000        IF ITM-CORP-CODE NOT = "NON-STR"
014100           MOVE ITM-CORP-CODE TO CODE-ARG
              MOVE 0 TO COND-WORD
              MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I
              READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-READ
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
           END-IF
           END-IF
014400           IF NOT GOOD-CALL
014500              MOVE "DBGET MSTORERM 210 TQTPOEND" TO BU-DISPLAY-MSG
014600              MOVE CODE-ARG TO BU-DISPLAY-FLD (3)
014700              PERFORM 990-BLOWUP THRU 999-EXIT
014800           ELSE
014900           MOVE "PR"         TO UMCF-RET-CODE
015000           MOVE ITM-UM       TO UMCF-DEST-UM
015100           MOVE ITM-PRICE-UM TO UMCF-SOURCE-UM
015200           MOVE ITM-UNIT-PRICE TO UMCF-SOURCE-QTY
015300           CALL "TUMCF" USING UMCF-RET-CODE, STR-UM-AREA,
015400                               UMCF-QUANTITY-AREA
015500           IF UMCF-RET-CODE NOT = "00"
015600              MOVE "CONVERSION ERROR 210 TQTPOEND"
015700                   TO BU-DISPLAY-MSG
015800              MOVE UMCF-RET-CODE TO BU-DISPLAY-FLD (5)
015900              PERFORM 990-BLOWUP THRU 999-EXIT
016000           ELSE
016100              MULTIPLY UMCF-QTY-STR-UM-DEC BY ITM-QTY-ORD
016200                   GIVING ITM-AMT ROUNDED.
016300
016400     ADD ITM-AMT TO BUDGET-AMOUNT.
016500     GO TO 210-READ-ALL-ITEMS.
016600
016700 230-UPDATE-DPORECD.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-O.
           START DPORECD-O KEY = PORCVNO OF DPORECD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
017500     IF NOT GOOD-CALL
017600        MOVE "DBFIND DPORECD 230 TQTPOEND" TO BU-DISPLAY-MSG
017700        PERFORM 990-BLOWUP THRU 999-EXIT.
017800
           MOVE 0 TO COND-WORD.
           READ DPORECD-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPORECD-REC-O NOT = PO-ARG
               MOVE 15 TO COND-WORD.
018100     IF NOT GOOD-CALL
018200        MOVE "DBGET DPORECD 230 TQTPOEND" TO BU-DISPLAY-MSG
018300        PERFORM 990-BLOWUP THRU 999-EXIT.
018400
018500     MOVE BUDGET-AMOUNT TO PO-BUDGET-AMT.
           MOVE 0 TO COND-WORD.
           REWRITE DPORECD-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
018800     IF NOT GOOD-CALL
018900        MOVE "DBGET DPORECD 230 TQTPOEND" TO BU-DISPLAY-MSG
019000        PERFORM 990-BLOWUP THRU 999-EXIT.
019100
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PORCVNO OF DPORECD-REC-O.
           START DPORECD-O KEY > PORCVNO OF DPORECD-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
019300     IF NOT GOOD-CALL
019400        MOVE "DBUNLOCK DPORECD 230 TQTPOEND" TO BU-DISPLAY-MSG
019500        PERFORM 990-BLOWUP THRU 999-EXIT.
019600
019700 299-EXIT.  EXIT.
019710
019720 300-PRINT-PO.
019730     IF SQT-PRINT = "N"
019740        GO TO 399-EXIT.

092200**********************************************
092300*  FIND OUT IF THE USER IS USING ISO 9000
092400*  REVIEW OF PURCHASE ORDER PRIOR TO THEIR
      *  BEING PRINTED/FAXED
092500**********************************************
092600
092700     MOVE "ISO "       TO PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
093000     IF COND-WORD NOT = 0
093100         IF COND-WORD = 17
093200             MOVE "N"           TO  ISO-9000-PRINT-SW
093300         ELSE
093400         MOVE "GET MPLTINFO 'IS0 ' *1-HSK" TO BU-DISPLAY-MSG
093500         MOVE PLT-ARG             TO BU-DISPLAY-FLD (1)
019500         PERFORM 990-BLOWUP THRU 999-EXIT
093700     ELSE
093800     MOVE ISO-9000-ON-OFF       TO  ISO-9000-PRINT-SW.
093900
019741********************************************
019742*   GET PO PRINTER NUMBER
019743********************************************
019744     MOVE 9                     TO  SPOOL-PRINT-NUM.
019745     MOVE "POPT"         TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
019748     IF COND-WORD NOT = ZERO
019749         IF COND-WORD = 17
019750             NEXT SENTENCE
019751         ELSE
019752             MOVE "GET MPLTINFO 'POPT' SQTPOS" TO BU-DISPLAY-MSG
019753             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (1)
019754             PERFORM 990-BLOWUP THRU 999-EXIT
019755     ELSE
019756     MOVE MPLTINFO-PO-PRT-NO     TO  SPOOL-PRINT-NUM.
019757
           IF ISO-9000-PRINT-SW = "N"
019760         MOVE PO-ARG TO PO-NUMBER
019770         CALL "TPOPRNT" USING BASE, PO-PRINT-PARMS, ESC-NAME,
019780                          LANGUAGE-PARMS.
019790 399-EXIT.  EXIT.
019800************************************************************
019900*                    B L O W U P                           *
020000*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
020100*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
020200*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
020300*                                                          *
020400*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
020500*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
020600*                                                          *
020700*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
020800************************************************************
020900 990-BLOWUP.
021000*----------  PURGE THE FILE
021100     MOVE SQTPOS-PO       TO BU-DISPLAY-FLD (1).
021200     MOVE SQTPOS-QUOTE    TO BU-DISPLAY-FLD (2).
021300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
021400           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
021500           BU-DISPLAY-FLDS.
021600 999-EXIT.  EXIT.
