001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TQTPO.
001300 AUTHOR.              BARBARA WINTER.
001400 DATE-WRITTEN.        APRIL 1988.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS. THIS IS THE MAIN PROGRAM TO CREATE A PO FROM A QUOTE.
001900*************************************************************
002000*************************************************************
002100**                    T Q T P O                            **
002400**                                                         **
002500**    THIS IS THE MAIN PROGRAM TO CREATE A PO FROM A       **
002600**    CURRENT QUOTE.  THIS PROGRAM ONLY OPENS THE FILES    **
002700**    AND DATABASE AND THEN CALLS THE SCREEN PROGRAM       **
002800**    SQTPOS.SOURCE TO ACCEPT THE QUOTE NUMBER AND PO      **
002900**    NUMBER.  IT THEN READS THE QUOTE FROM DVENDITM       **
003000**    AND WRITES A FILE THAT XLOADPO.OBJECT CAN READ.      **
003100**    THE PO IS ACTUALLY CREATED BY RUNNING XLOADPO.OBJECT.**
003200*************************************************************
003500*************************************************************
007800
007900 ENVIRONMENT DIVISION.
008000 CONFIGURATION SECTION.
008100 SOURCE-COMPUTER.    HP-3000.
008200 OBJECT-COMPUTER.    HP-3000.
008400 DATA DIVISION.
008500 FILE SECTION.
008600 WORKING-STORAGE SECTION.
009400 COPY DATAB OF COPYLIB.
009700
009800 COPY VCOMLINK OF COPYLIB.
009900 01  FORMFILE.
010000     05  FORM-FNAME                PIC X(5)  VALUE "FQTPO".
010100     05  FILLER                    PIC X     VALUE ".".
010200     05  FORM-GNAME.
010300         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
010400         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
010500     05  FILLER                    PIC X(19) VALUE SPACES.
010600
010700 COPY LANGUAGE OF COPYLIB.
010800
010900 PROCEDURE DIVISION.
011000 00-CONTROL.
011100
011400     PERFORM 100-CALL-SQTPOS  THRU 199-EXIT.
011800     GOBACK.
016100
016900 100-CALL-SQTPOS.
           MOVE "ZQTPO" TO VIEW-CFNAME.
017000     CALL "SQTPOS" USING BASE,
017100                         VIEW-COMAREA,
017110                         FORMFILE,
017200                         LANGUAGE-PARMS.
017300 199-EXIT.  EXIT.
