       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TQTRELOAD.
       AUTHOR.         PAUL RAGLOW.
      *INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
      *DATE-WRITTEN.   MAY 17, 1991.
      *REMARKS.        THIS PROGRAM COPIES ALL RECORDS FROM DVENDITM INBY
      *                MCPRD2 FOR QUOTES WHICH DO NOT EXIST IN MCPRD1.
      *                NEEDED IN LAWTON TO RELOAD SOME LOST DATA.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    AS400.
       OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES.  C01 IS NEWPAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DVENDITM-I
              ASSIGN TO DATABASE-DVENDITM
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS DVENDITM-SK.

            SELECT DVENDITM-O
              ASSIGN TO DATABASE-MCFLCS0803
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS MCFLCS08-SK.

       DATA DIVISION.
       FD  DVENDITM-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0803.

       WORKING-STORAGE SECTION.
       01  DVENDITM-SK.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
       01  MCFLCS08-SK.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
       01  SAVE-QUOTE-NUM             PIC X(10).
       01  EOF-FLAG                   PIC X  VALUE "N".
       01  COUNTER1                   PIC 9999  VALUE ZERO.
       COPY DVENDITM  IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-HERE.
           OPEN  INPUT DVENDITM-I
                 I-O   DVENDITM-O.
           MOVE ZERO TO COUNTER1.
           READ DVENDITM-I FIRST RECORD INTO BUF-DVENDITM
                           AT END MOVE "Y" TO EOF-FLAG.
           PERFORM UNTIL EOF-FLAG = "Y"
             IF VEN-QUOTE-FLAG = "Q"
               MOVE VEN-QUOTE-NUM TO QUOTENUM  OF DVENDITM-REC-O
               READ DVENDITM-O KEY IS EXTERNALLY-DESCRIBED-KEY
                      INVALID KEY MOVE MCFLCS08-SK TO MCFLCS08-SK
               END-READ
               IF MCFLCS08-SK = "23"
                 MOVE VEN-QUOTE-NUM TO SAVE-QUOTE-NUM
                 PERFORM UNTIL VEN-QUOTE-NUM NOT = SAVE-QUOTE-NUM
                   ADD 1 TO COUNTER1
                   WRITE DVENDITM-REC-O FROM BUF-DVENDITM
                   READ DVENDITM-I NEXT RECORD INTO BUF-DVENDITM
                              AT END MOVE "Y" TO EOF-FLAG
                                     MOVE HIGH-VALUES TO SAVE-QUOTE-NUM
                   END-READ
                 END-PERFORM
               ELSE
                 READ DVENDITM-I NEXT RECORD INTO BUF-DVENDITM
                            AT END MOVE "Y" TO EOF-FLAG
                 END-READ
               END-IF
             ELSE
               READ DVENDITM-I NEXT RECORD INTO BUF-DVENDITM
                          AT END MOVE "Y" TO EOF-FLAG
               END-READ
             END-IF
           END-PERFORM.

           DISPLAY "RECORDS WRITTEN = " COUNTER1.
           CLOSE DVENDITM-O DVENDITM-I.
           GOBACK.
