001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    TQTSTORE.
001300 AUTHOR.        BARBARA WINTER.
001400 DATE-WRITTEN.  APRIL  l987.
001500*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001600*
001700*REMARKS.
001800*D PART 2 OF QUOTE CREATE PROGRAM THAT STORES DATA INTO DATABASE.
001900*****************************************************************
002000*                      T Q T S T O R E                          *
002100* THIS PROGRAM READS IN A FILE OF CODED ITEMS AND A FILE OF     *
002200* NONCODED ITEMS AND CREATES THE ENTRY IN DVENDITEM.  NONCODED  *
002300* ITEMS ALSO STORE THE DESCRIPTION IN DQUOTEXT IF NOT A REQ.    *
002400*****************************************************************
      *C     9/05/96  WILL MCINTYRE
      *C     MADE REVISIONS FOR END OF CENTURY COMPATABILITY.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C  05/02/02    CA YODER     LAWTON REQUEST
      *C     MOVED LOGIC TO UPDATE MREQ FOR NONCODED QUOTE ITEMS TO
      *C     625-READ-NONCODED FROM 650-NONCODED-DESC.  IT WAS NEVER
      *C     BEING PERFORMED, SO THE REQS WERE NEVER UPDATED WITH
      *C     THE QUOTE NUMBER.
      *C
      *C  10/23/2002  BE GEISER    LAWTON REQUEST
      *C     ADDED LOGIC TO UPDATE DREQD WITH BUYER CODE.
      *C
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.    HP-3000.
002800 OBJECT-COMPUTER.    HP-3000.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
003300       SELECT CODE-FILE          ASSIGN TO DISK-DQTCODES.
003400       SELECT NONCODE-FILE       ASSIGN TO DISK-DQNCODES.
           SELECT STREAM-FILE       ASSIGN TO DISK-DJQUOTES.
003500       SELECT SORT-CODE-FILE     ASSIGN TO DISK-SORTFILE.
            SELECT DVENDITM-O
              ASSIGN TO DATABASE-MCFLCS0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DQUOTEXT-O
              ASSIGN TO DATABASE-MCFLCS3801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
003300
            SELECT MREQ-O
              ASSIGN TO DATABASE-MCFLCS2001
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT DREQD-O
              ASSIGN TO DATABASE-MCFLCS2101
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MPLTINFO-O
              ASSIGN TO DATABASE-MCFLCS0501
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
            SELECT USAGEFIL-I
              ASSIGN TO DATABASE-MCFLCSUSAG
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
003600
003700 DATA DIVISION.
003800 FILE SECTION.
003900 FD  CODE-FILE
004000     RECORD CONTAINS 28 CHARACTERS.
004100 01  CODE-REC.
004200     05  CODE-NUMBER            PIC X(8).
004300     05  CODE-REQ               PIC X(12).
004400     05  CODE-REQ-ORD           PIC 9(8).
004500
004600 FD  NONCODE-FILE
004700     RECORD CONTAINS 80 CHARACTERS.
004800 01  NONCODED-REC               PIC X(80).

       FD  STREAM-FILE
           RECORD CONTAINS 720 CHARACTERS.
       01  STREAM-REC                 PIC X(720).
004900
005000 SD  SORT-CODE-FILE
005100     RECORD CONTAINS 28 CHARACTERS.
005200 01  SORT-RECORD.
           05  SORT-CODE              PIC X(8).
004300     05  SORT-REQ               PIC X(12).
004400     05  SORT-REQ-ORD           PIC 9(8).
       FD  DVENDITM-O
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-O.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.
       FD  DQUOTEXT-O
           LABEL RECORDS ARE STANDARD.
       01  DQUOTEXT-REC-O.
           COPY DDS-MCRPCS3800  OF MCFLCS3801.

       FD  MREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-O.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.
       FD  DREQD-O
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-O.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.
       FD  MPLTINFO-O
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-O.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.
004700 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
005500 01  PARAGRAPH-CREATED          PIC X     VALUE "Y".
005501 01  SAVE-REF                   PIC X(4)  VALUE SPACES.
005510 01  COMPARE-CODE               PIC X(8)  VALUE SPACES.
005600 01  CODED-NAME                 PIC X(9)  VALUE "DQTCODES ".
005700 01  NONCODED-NAME              PIC X(9)  VALUE "DQNCODES ".
005800 01  FILE-NUM                   PIC S9(4) VALUE ZEROES COMP-4.
005900 01  X                          PIC 9(2)  VALUE ZEROES.
006000 01  N                          PIC 9(2)  VALUE ZEROES.
006100 01  SUB                        PIC S9(4) VALUE ZERO COMP-4.
006200 01  LINE-WS                    PIC S9(2) VALUE ZEROES.
006300 01  ITEM-WS                    PIC S9(4) VALUE ZEROES.
006400 01  YTD-TOTAL                  PIC S9(8) VALUE ZEROES.
006500 01  WORK-NONCODED-LINE.
006600     05  WORK-QUOTE             PIC X(10) VALUE SPACES.
006700     05  WORK-QTY               PIC 9(8)  VALUE ZEROES.
006800     05  WORK-UM                PIC X(2)  VALUE SPACES.
006900     05  WORK-REQ               PIC X(12) VALUE SPACES.
007000     05  FILLER                 PIC X(48) VALUE SPACES.

       01  STREAM-BUFFER.
031900     05  AREA2                    PIC X(200).
032000     05  AREA3                    PIC X(80).
032100     05  AREA4                    PIC X(80).
032200     05  AREA5                    PIC X(80).
032300     05  AREA6                    PIC X(80).
032400     05  AREA7                    PIC X(80).
           05  STRM-OVR1                PIC X(38).
           05  STRM-OVR2                PIC X(38).
           05  FILLER                   PIC X(44).
007800
007900 01  QUOTE-PARAGRAPH-INFO.
008000     05  QUOTE-PARA OCCURS 10 TIMES  PIC X(80).
008100
008200 01  INFO-LINE.
008300   03  INFO-LINE-ACCEPT OCCURS 10 TIMES.
008400     05  VENDOR                 PIC X(10).
008500     05  ACCEPT-QUOTE           PIC X(10).
008600     05  QUOTE-BREAKDOWN REDEFINES ACCEPT-QUOTE.
008700         07  QT-NUM             PIC X(6).
008800         07  FILLER             PIC X(4).
008900
009700 01  PURGE-COMMAND-WORK.
009800     05  FILLER                 PIC X(12) VALUE "DLTF FILE(DQ".
009900     05  PURGE-WS               PIC 9(6) VALUE ZEROES.
           05  FILLER                 PIC X    VALUE ")".
010000
010100 01  PURGE-COMMAND-WORK2.
010200     05  FILLER                 PIC X(12) VALUE "DLTF FILE(DN".
010300     05  PURGE-WS2              PIC 9(6)  VALUE ZEROES.
           05  FILLER                 PIC X     VALUE ")".
010000
010100 01  PURGE-COMMAND-WORK3.
010200     05  FILLER                 PIC X(12) VALUE "DLTF FILE(DJ".
010300     05  PURGE-WS3              PIC 9(6)  VALUE ZEROES.
           05  FILLER                 PIC X     VALUE ")".
010400
010500 COPY TDATECHK OF COPYLIB.
010600*---------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
010700*---------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
010800 01  BU-DISPLAY-MSG             PIC X(60) VALUE SPACES.
010900 01  BU-PGM-NAME                PIC X(8)  VALUE "TQTSTORE".
011000 01  BU-DISPLAY-AREA            PIC X(110) VALUE ALL "0".
011100 01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
011200     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
011300         10  BU-DISPLAY-FLD     PIC X(14).
011400         10  BU-DISPLAY-FLD9    PIC S9(8).
011500 01  VIEW-COMAREA.
011600     05  FILLER                 PIC X(118) VALUE ALL "0".
011700     05  FILLER                 PIC S9(4)  COMP VALUE 9999.
011800
       01  CMD-LENGTH               PIC S9(10)V9(5) COMP-3.
       COPY CCHKOBJ IN COPYLIB.
012200**************************************************************
012300**                   K S A M   W O R K                      **
012400**************************************************************
013000 01  USAGE-REC.
013100     05  FILLER                 PIC XX.
013200     05  K-CORP-CODE            PIC X(8).
013300     05  K-MONTHS                              OCCURS 14 TIMES.
013400         10  K-MTH-USAGE        PIC S9(9) COMP-4.
013300     05  K-MONTHS-DD                           OCCURS 14 TIMES.
013400         10  K-MTH-USAGE-DD     PIC S9(9) COMP-4.
013500
014600***************************************************************
014700*                     D A T A B A S E                         *
014800***************************************************************
014900 COPY DATAB OF COPYLIB.
015000
015100 01  CODE-ARG                   PIC X(8)     VALUE SPACES.
015200 01  MPLTINFO-ARG               PIC X(4)     VALUE "P 01".
015300 01  REQ-ARG                    PIC X(12)    VALUE SPACES.
016300
016400 COPY MPLTINFO  OF COPYLIB.
016500 COPY DVENDITM  OF COPYLIB.
016600 COPY MREQ      OF COPYLIB.
016600 COPY DREQD     OF COPYLIB.
016700 COPY DQUOTEXT  OF COPYLIB.
016800 COPY LANGUAGE  OF COPYLIB.
       LINKAGE SECTION.
       01  PARM1.
           05  ACCEPT-BUYER             PIC X(4).
           05  ACCEPT-RETURN-DATE       PIC X(8).
           05  ACCEPT-PRINTER           PIC S9(2) COMP-4.
           05  PARAGRAPH-TYPE           PIC X.
           05  ACCEPT-CODED-FILE        PIC X(8).
           05  ACCEPT-NONCODED-FILE     PIC X(8).
           05  ACCEPT-JOB-FILE          PIC X(8).
           05  FILLER                   PIC X(41).
       01  PARM2.
           05  OVR-JOB-STREAM           PIC X(38).
           05  FILLER                   PIC X(123).
016900****************************************************************
017000*                  PROCEDURE DIVISION
017100****************************************************************
017200 PROCEDURE DIVISION USING PARM1, PARM2.
017300
017400 00-MAIN.
      *---------  READ JOB STREAM RECORD
           MOVE 38 TO CMD-LENGTH.
           CALL "QCMDEXC" USING OVR-JOB-STREAM, CMD-LENGTH.

           OPEN INPUT STREAM-FILE.
           READ STREAM-FILE INTO STREAM-BUFFER
                AT END CLOSE STREAM-FILE.
           CLOSE STREAM-FILE.

017500*---------  USE DATA FROM SCREEN PROGRAM
           MOVE AREA2 TO INFO-LINE.
           MOVE AREA3  TO QUOTE-PARA (1).
           MOVE AREA4  TO QUOTE-PARA (2).
           MOVE AREA5  TO QUOTE-PARA (3).
           MOVE AREA6  TO QUOTE-PARA (4).
           MOVE AREA7  TO QUOTE-PARA (5).
021000
      *----------  OVERRIDE CODED FILE TO CORRECT NAME
           MOVE 38 TO CMD-LENGTH.
           IF STRM-OVR1 NOT = SPACES
              CALL "QCMDEXC" USING STRM-OVR1, CMD-LENGTH.

      *----------  OVERRIDE NONCODED FILE TO CORRECT NAME
           IF STRM-OVR2 NOT = SPACES
              CALL "QCMDEXC" USING STRM-OVR2, CMD-LENGTH.

021100     MOVE QT-NUM (1)   TO PURGE-WS, PURGE-WS2, PURGE-WS3.
           OPEN I-O DVENDITM-O DQUOTEXT-O MREQ-O DREQD-O MPLTINFO-O.
           OPEN INPUT USAGEFIL-I.
021600
023400     MOVE "N" TO PARAGRAPH-CREATED.
023500
023510*----------  STORE A REFERENCE NUMBER FOR A GROUP OF IDENTICAL
023520*            QUOTES IF THERE ARE MULTIPLE VENDORS.
023530     MOVE 1 TO N.
023531     MOVE 0 TO X.
023532 03-COUNT-VENDORS.
023533     IF VENDOR (N) NOT = SPACES
023534        ADD 1 TO X.
023535     ADD 1 TO N.
023536     IF N < 11
023537        GO TO 03-COUNT-VENDORS.
023538     IF X > 1
023539        PERFORM 820-GET-REF-NO THRU 829-EXIT
023540     ELSE
023541        MOVE SPACES TO SAVE-REF.
023542
023600*----------  CHECK IF CODED FILE EXISTS
           IF ACCEPT-CODED-FILE NOT = SPACES
023700      MOVE ACCEPT-CODED-FILE TO CHKOBJ-FILE-NAME
023800      CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME CHKOBJ-RETURN-STATUS
024000      IF CHKOBJ-EXISTS
024200        PERFORM 500-CREATE-CODED-ITEMS THRU 599-EXIT.
024300
024400*----------  CHECK IF NONCODED FILE EXISTS
           IF ACCEPT-NONCODED-FILE NOT = SPACES
023700      MOVE ACCEPT-NONCODED-FILE TO CHKOBJ-FILE-NAME
023800      CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME CHKOBJ-RETURN-STATUS
024000      IF CHKOBJ-EXISTS
025000        PERFORM 600-CREATE-NONCODED-ITEMS THRU 699-EXIT.
025100
025200*---------  CALL PRINT ROUTINE ONLY IF A QUOTE WAS CREATED
025300     MOVE 1 TO N.
025400
025410     MOVE "P 01" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-O.
           READ MPLTINFO-O   INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
025700     IF COND-WORD NOT = 0
025800           MOVE "DBGET MPLTINFO - TQTSTORE " TO BU-DISPLAY-MSG
025900           PERFORM 990-BLOWUP THRU 999-EXIT.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC-O.
           START MPLTINFO-O KEY > PLTINFOKEY OF MPLTINFO-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
026000
026100 05-CALL-PRINT-ROUTINE.
026200     IF ACCEPT-QUOTE (N) = SPACE
026300        GO TO 09-EXIT
026400     ELSE
026500        CALL "CQTPRT" USING ACCEPT-QUOTE (N), ACCEPT-PRINTER,
026600                      LANGUAGE-PARMS, BASE, MPLTINFO-COMPANY.
026700     ADD 1 TO N.
026800     IF N < 11
026900        GO TO 05-CALL-PRINT-ROUTINE.
027000 09-EXIT.
027100     CLOSE DVENDITM-O DQUOTEXT-O MREQ-O
027100           DREQD-O MPLTINFO-O USAGEFIL-I.
           MOVE 19 TO CMD-LENGTH.
           CALL "QCMDEXC" USING PURGE-COMMAND-WORK3, CMD-LENGTH.
027200     GOBACK.
027300
027400*****************************************************************
027500*                    C O D E D   I T E M S                      *
027600*   CREATE A QUOTE FOR EACH QUOTE/VENDOR PAIR THAT WAS INPUT ON *
027700*   THE SCREEN PROGRAM.                                         *
027800*****************************************************************
027900 500-CREATE-CODED-ITEMS.
028000*----------  OPEN USAGE FILE; USE ANNUAL USAGE AS BID QTY
028800*----------  ADD QUOTE PARAGRAPH FOR EACH QUOTE IF THIS
028900*            IS NOT A STANDARD PARAGRAPH.
029000     IF PARAGRAPH-TYPE = "S"
029100        GO TO 525-SORT-CODE-FILE.
029200
029800*----------  X IS PTR TO LINE NUMBER OF PARAGRAPH
029900*            N IS PTR TO QUOTE/VENDOR PAIR
030000     MOVE 1                               TO X, N.
030100     MOVE SPACES                          TO BUF-DQUOTEXT.
030200
030300     IF ACCEPT-QUOTE (N) = SPACES
030400        GO TO 525-SORT-CODE-FILE.
030500
030600 505-ADD-PARAGRAPH.
030700     IF QUOTE-PARA (X) = SPACES
030800        GO TO 510-CHECK-SPACE.
030900     MOVE ACCEPT-QUOTE (N)                TO DQUOTEXT-QUOTE-NO.
031000     MOVE ZEROES                          TO DQUOTEXT-ITM-NO.
031100     MOVE X                               TO DQUOTEXT-LINE-NO.
031200     MOVE QUOTE-PARA (X)                  TO DQUOTEXT-DATA.
031300
           MOVE 0 TO COND-WORD.
           WRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
031600     IF NOT GOOD-CALL
031700        MOVE "DBPUT 505 TQTSTORE"         TO BU-DISPLAY-MSG
031800        PERFORM 990-BLOWUP THRU 999-EXIT.
031900
032000      MOVE "Y"                            TO PARAGRAPH-CREATED.
032100 510-CHECK-SPACE.
032200     ADD 1                                TO X.
032300     IF X < 6
032400        GO TO 505-ADD-PARAGRAPH.
032500
032600     ADD 1                                TO N.
032700     IF N = 11
032800        GO TO 525-SORT-CODE-FILE.
032900     IF ACCEPT-QUOTE (N) NOT = SPACES
033000        MOVE 1                            TO X
033100        GO TO 505-ADD-PARAGRAPH.
033200
033900*----------  SORT THE CODED FILE IN CORPORATED CODE ORDER
034000 525-SORT-CODE-FILE.
034100*----------  SORT CODED ITEMS
034200     SORT SORT-CODE-FILE        ASCENDING KEY SORT-CODE
034300          USING CODE-FILE
034400          GIVING CODE-FILE.
034500
034510     MOVE "????????" TO COMPARE-CODE.
034520
034600     OPEN INPUT CODE-FILE.
034700*----------  READ CODED FILE AND CREATE DVENDITM ENTRY FOR EACH
034800*            QUOTE/VENDOR PAIR
034900 530-READ-CODE.
035000     READ CODE-FILE AT END
035200        CLOSE CODE-FILE
035300          GO TO 580-PURGE-FILE.
035310
035320*----------  SKIP DUPLICATE CODES
035330     IF CODE-NUMBER = COMPARE-CODE
035340        GO TO 530-READ-CODE.
035350
035360     MOVE CODE-NUMBER TO COMPARE-CODE, CODE-ARG.
035400
035500     IF CODE-REQ NOT = SPACES
035600        MOVE CODE-REQ TO REQ-ARG
035700        PERFORM 810-UPDATE-MREQ THRU 819-EXIT
035700        PERFORM 815-UPDATE-DREQD THRU 815-EXIT.
035800
035900     MOVE 1                               TO N.
036000
036100 535-DO-VENDORS.
036200     IF VENDOR (N) = SPACES
036300        GO TO 530-READ-CODE.
036400
036500*----------  CREATE DVENDITM
037000
037100     MOVE SPACES                          TO BUF-DVENDITM.
037200     MOVE VENDOR (N)                      TO VEN-ITM-VENCODE.
037300     MOVE PARAGRAPH-TYPE                  TO VEN-TEXT-FLAG.
037400     MOVE CODE-NUMBER                     TO VEN-ITM-CORPCODE.
037500     MOVE CODE-REQ                        TO VEN-REQ.
037600     MOVE "Q"                             TO VEN-QUOTE-FLAG.
037700     MOVE ACCEPT-RETURN-DATE              TO VEN-RETURN-DATE-CN.
037800     MOVE ACCEPT-BUYER                    TO VEN-BUYER-CODE.
037810     MOVE SAVE-REF                        TO VEN-REF.
037900     MOVE ZEROES                          TO VEN-ITM-PRICE,
038000                                             VEN-EST-LT
                                                   VEN-ITM-YTD-BUS
038100                                             VEN-ITM-LT1
038200                                             VEN-ITM-LT2
038300                                             VEN-ITM-LT3
038400                                             VEN-LOW-QTY (1)
038500                                             VEN-LOW-QTY (2)
038600                                             VEN-LOW-QTY (3)
038700                                             VEN-HIGH-QTY (1)
038800                                             VEN-HIGH-QTY (2)
038900                                             VEN-HIGH-QTY (3)
039000                                             VEN-WORK-PRICE (1)
039100                                             VEN-WORK-PRICE (2)
039200                                             VEN-WORK-PRICE (3)
039300                                             VEN-BID-QTY
039310                                             VEN-SURCHARGE
039320                                             VEN-DISCOUNT-PERCENT
039400                                             VEN-NONCODED-ITEM.
039500     MOVE ACCEPT-QUOTE (N)                TO VEN-QUOTE-NUM.
039600
039700     IF CODE-REQ = SPACES
039800        PERFORM 800-COMPUTE-USAGE THRU 809-EXIT
039900        MOVE YTD-TOTAL                    TO VEN-BID-QTY
040000     ELSE
040100        MOVE CODE-REQ-ORD                 TO VEN-BID-QTY.
040200
           MOVE 0 TO COND-WORD.
           WRITE DVENDITM-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
040500     IF NOT GOOD-CALL
040600        MOVE "DBPUT DVENDITM 510 TQTSTORE" TO BU-DISPLAY-MSG
040700        PERFORM 990-BLOWUP THRU 999-EXIT.
041300
041400     ADD 1                                TO N.
041500     IF N = 11
041600        GO TO 530-READ-CODE
041700     ELSE
041800        GO TO 535-DO-VENDORS.
041900
042000 580-PURGE-FILE.
           MOVE 19 TO CMD-LENGTH.
           CALL "QCMDEXC" USING PURGE-COMMAND-WORK, CMD-LENGTH.
042900 599-EXIT.  EXIT.
043000
043100******************************************************************
043200*                     N O N C O D E D   I T E M S                *
043300*   READ NONCODED FILE AND CREATE AN ENTRY IN DVENDITM FOR EACH  *
043400*   QUOTE/VENDOR PAIR.  ALSO STORE THE DESCRIPTION IN DQUOTEXT.  *
043500******************************************************************
043600 600-CREATE-NONCODED-ITEMS.
043700*----------  N IS THE PTR TO QUOTE/VENDOR PAIR; ITEM-WS IS NONCODED
043800*            ITEM NUMBER; LINE-WS IS LINE NUMBER WITHIN DESCRIPTION
043900     MOVE 1                               TO N.
044000     MOVE 0                               TO ITEM-WS, LINE-WS.
044100     OPEN INPUT NONCODE-FILE.
044200
044300*----------  ADD QUOTE PARAGRAPH FOR EACH QUOTE IF NOT ALREADY THERE
044400*            FROM CODED ITEMS
044500     IF PARAGRAPH-TYPE = "S"
044600        MOVE 1                            TO X
044700        MOVE 0                            TO N
044800        GO TO 625-READ-NONCODED.
044900
045000     IF PARAGRAPH-CREATED = "Y"
045100        MOVE 1                            TO X
045200        MOVE 0                            TO N
045300        GO TO 625-READ-NONCODED.
045400
046000*---------- X IS PTR TO QUOTE PARAGRAPH LINE NUMBER
046100*           N IS PTR TO WHICH VENDOR/QUOTE PAIR WE ARE ON
046200*           (OUT OF 10 POSSIBLE)
046300     MOVE 1 TO X, N.
046400     MOVE SPACES TO BUF-DQUOTEXT.
046500
046600     IF ACCEPT-QUOTE (N) = SPACES
046700        GO TO 620-UNLOCK-DQUOTEXT.
046800
046900 605-ADD-PARAGRAPH.
047000     IF QUOTE-PARA (X) = SPACES
047100        GO TO 615-CHECK-SPACE.
047200     MOVE ACCEPT-QUOTE (N)                TO DQUOTEXT-QUOTE-NO.
047300     MOVE ZEROES                          TO DQUOTEXT-ITM-NO.
047400     MOVE X                               TO DQUOTEXT-LINE-NO.
047500     MOVE QUOTE-PARA (X)                  TO DQUOTEXT-DATA.
047600
           MOVE 0 TO COND-WORD.
           WRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
047900     IF NOT GOOD-CALL
048000        MOVE "DBPUT 605 TQTSTORE" TO BU-DISPLAY-MSG
048100        PERFORM 990-BLOWUP THRU 999-EXIT.
048200
048300 615-CHECK-SPACE.
048400     ADD 1                                TO X.
048500     IF X < 6
048600        GO TO 605-ADD-PARAGRAPH.
048700     ADD 1                                TO N.
048800     IF N = 11
048900        GO TO 620-UNLOCK-DQUOTEXT.
049000     IF ACCEPT-QUOTE (N) NOT = SPACES
049100        MOVE 1                            TO X
049200        GO TO 605-ADD-PARAGRAPH.
049300
049400 620-UNLOCK-DQUOTEXT.
050000     MOVE 1                               TO X.
050100     MOVE 1                               TO N.
050200
050300*---------  READ NONCODED RECORDS;  FIRST RECORD IS QTY AND UM,
050400*           FOLLOWED BY VARIABLE NUMBER OF DESCRIPTION LINES
050500 625-READ-NONCODED.
050600     READ NONCODE-FILE INTO WORK-NONCODED-LINE
050700          AT END
050800             CLOSE NONCODE-FILE
050900          GO TO 680-PURGE-FILE.
051000
      *-------- MOVED THIS LOGIC OUT OF 650-NONCODED-DESC PARAGRAPH;
      *-------- IT WAS NEVER BEING EXECUTED.
           IF WORK-QUOTE = "QUOTE     "
057600       IF WORK-REQ NOT = SPACES
057700         MOVE WORK-REQ TO REQ-ARG
057800         PERFORM 810-UPDATE-MREQ THRU 819-EXIT
057800         PERFORM 815-UPDATE-DREQD THRU 815-EXIT.
058300
051100
051200*----------  IF QTY RECORD, CREATE DVENDITM; ELSE IS DESCRIPTION
051300*            LINE AND CREATE DQUOTEXT ENTRY
051400     IF WORK-QUOTE NOT = "QUOTE     "
051410        MOVE 0 TO N
051420        ADD 1 TO LINE-WS
051500        PERFORM 650-NONCODED-DESC THRU 659-EXIT
051600        GO TO 625-READ-NONCODED.
051700
051710     ADD 1                                TO ITEM-WS.
051800     MOVE 1 TO N.
051900 630-VENDOR-ITEM-LOOP.
052300
052400     IF VENDOR (N) = SPACES
052500        GO TO 625-READ-NONCODED.
052600
052700
052800*----------  CREATE DVENDITM
053500     MOVE 0                               TO LINE-WS.
053600     MOVE SPACES                          TO BUF-DVENDITM.
053700     MOVE VENDOR (N)                      TO VEN-ITM-VENCODE.
053800     MOVE PARAGRAPH-TYPE                  TO VEN-TEXT-FLAG.
053900     MOVE "NON-STR"                       TO VEN-ITM-CORPCODE.
054000     MOVE "Q"                             TO VEN-QUOTE-FLAG.
054100     MOVE ACCEPT-RETURN-DATE              TO VEN-RETURN-DATE-CN.
054200     MOVE ACCEPT-BUYER                    TO VEN-BUYER-CODE.
054210     MOVE SAVE-REF                        TO VEN-REF.
054300     MOVE WORK-REQ                        TO VEN-REQ.
054400     MOVE ZEROES                          TO VEN-ITM-PRICE,
                                                   VEN-ITM-YTD-BUS
054500                                             VEN-EST-LT
054600                                             VEN-ITM-LT1
054700                                             VEN-ITM-LT2
054800                                             VEN-ITM-LT3
054900                                             VEN-LOW-QTY (1)
055000                                             VEN-LOW-QTY (2)
055100                                             VEN-LOW-QTY (3)
055200                                             VEN-HIGH-QTY (1)
055300                                             VEN-HIGH-QTY (2)
055400                                             VEN-HIGH-QTY (3)
055500                                             VEN-WORK-PRICE (1)
055600                                             VEN-WORK-PRICE (2)
055700                                             VEN-WORK-PRICE (3)
055710                                             VEN-SURCHARGE
055720                                             VEN-DISCOUNT-PERCENT
055800                                             VEN-NONCODED-ITEM.
055900     MOVE ACCEPT-QUOTE (N)                TO VEN-QUOTE-NUM.
056000     MOVE ITEM-WS                         TO VEN-NONCODED-ITEM.
056100     MOVE WORK-UM                         TO VEN-NONCODED-UM.
056200     MOVE WORK-QTY                        TO VEN-BID-QTY.
           MOVE 0 TO COND-WORD.
           WRITE DVENDITM-REC-O FROM BUF-DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
056500     IF NOT GOOD-CALL
056600        MOVE "DBPUT DVENDITM 510 TQTSTORE" TO BU-DISPLAY-MSG
056700        PERFORM 990-BLOWUP THRU 999-EXIT.
052000     ADD 1                                TO N.
052100     IF N = 11
052200        GO TO 625-READ-NONCODED
           ELSE
              GO TO 630-VENDOR-ITEM-LOOP.
056800
057500 650-NONCODED-DESC.
057510     ADD 1 TO N.
057520     IF N = 11
057530        GO TO 659-EXIT.
057540     IF ACCEPT-QUOTE (N) = SPACES
057550        GO TO 659-EXIT.
057560
058400     MOVE SPACES TO BUF-DQUOTEXT.
058500     MOVE WORK-NONCODED-LINE              TO DQUOTEXT-DATA.
058600     MOVE ACCEPT-QUOTE (N)                TO DQUOTEXT-QUOTE-NO.
058700     MOVE ITEM-WS                         TO DQUOTEXT-ITM-NO.
058800     MOVE LINE-WS                         TO DQUOTEXT-LINE-NO.
058900
           MOVE 0 TO COND-WORD.
           WRITE DQUOTEXT-REC-O FROM BUF-DQUOTEXT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
059200     IF NOT GOOD-CALL
059300        MOVE "DBPUT DQUOTEXT 650 TQTSTORE" TO BU-DISPLAY-MSG
059400        PERFORM 990-BLOWUP THRU 999-EXIT.
060100
060110     GO TO 650-NONCODED-DESC.
060200 659-EXIT.  EXIT.
060300
060400 680-PURGE-FILE.
           MOVE 19 TO CMD-LENGTH.
           CALL "QCMDEXC" USING PURGE-COMMAND-WORK2, CMD-LENGTH.
061300 699-EXIT.  EXIT.
061400
061500 800-COMPUTE-USAGE.
139200     MOVE 0                               TO YTD-TOTAL.
139300     MOVE 0                               TO SUB.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
           READ USAGEFIL-I INTO USAGE-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
283600     IF COND-WORD NOT =  0
283700        MOVE "USAGEFILE ERR 575 SRCVEXEC" TO BU-DISPLAY-MSG
283800        MOVE CODE-ARG         TO BU-DISPLAY-FLD (5)
283900        PERFORM 990-BLOWUP THRU 999-EXIT.
062500 805-CALCULATE-YTD-USAGE.
062600     ADD 1                                TO SUB.
062700     IF SUB NOT > 12
062800        ADD K-MTH-USAGE (SUB)             TO YTD-TOTAL
062900        GO TO 805-CALCULATE-YTD-USAGE.
063000 809-EXIT. EXIT.
063100*---------  UPDATE MREQ WITH THE QUOTE NUMBER AND STATUS
063200 810-UPDATE-MREQ.
063700
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-O.
           READ MREQ-O INTO BUF-MREQ
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
064000     IF NO-ENTRY
064100        GO TO 819-EXIT.
064200     IF NOT GOOD-CALL
064300        MOVE "DBGET MREQ AT 810 TQTSTORE" TO BU-DISPLAY-MSG
064400        PERFORM 990-BLOWUP THRU 999-EXIT.
064500
064600     MOVE "QU" TO REQ-HOLD-STATUS-CODE.
064700     MOVE ACCEPT-QUOTE (1) TO REQ-HOLD-STATUS.
           MOVE 0 TO COND-WORD.
           REWRITE MREQ-REC-O FROM BUF-MREQ
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
065000     IF NOT GOOD-CALL
065100        MOVE "DBUPDATE MREQ 810 TQTSTORE" TO BU-DISPLAY-MSG
065200        PERFORM 990-BLOWUP THRU 999-EXIT.
065300
065800 819-EXIT.  EXIT.
065810
063100*---------  UPDATE DREQD WITH THE BUYER CODE
063200 815-UPDATE-DREQD.
063700
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC-O.
           READ DREQD-O INTO BUF-DREQD
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
064000     IF NO-ENTRY
064100        GO TO 815-EXIT.
064200     IF NOT GOOD-CALL
064300        MOVE "DBGET DREQD AT 815 TQTSTORE" TO BU-DISPLAY-MSG
064400        PERFORM 990-BLOWUP THRU 999-EXIT.
064500
064600     MOVE ACCEPT-BUYER TO DREQD-BUYER-CODE.
           MOVE 0 TO COND-WORD.
           REWRITE DREQD-REC-O FROM BUF-DREQD
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
065000     IF NOT GOOD-CALL
065100        MOVE "DBUPDATE DREQD 815 TQTSTORE" TO BU-DISPLAY-MSG
065200        PERFORM 990-BLOWUP THRU 999-EXIT.
065300
065800 815-EXIT.  EXIT.
065810
065820*----------  FIND THE NEXT REFERENCE NUMBER
065830 820-GET-REF-NO.
065831     MOVE "PQNO"                          TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY  OF MPLTINFO-REC-O.
           READ MPLTINFO-O INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
065834     IF NOT GOOD-CALL
065835        MOVE "PQNO KEY NOT IN MPLTINFO!!!!! " TO BU-DISPLAY-MSG
065836        PERFORM 990-BLOWUP THRU 999-EXIT.
065839
065844        ADD 1 TO MPLTINFO-QUOTE-REF.
065845        MOVE MPLTINFO-QUOTE-REF TO SAVE-REF.
065846
           MOVE 0 TO COND-WORD.
           REWRITE MPLTINFO-REC-O FROM BUF-MPLTINFO
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
065854     IF NOT GOOD-CALL
065855        MOVE "DBUPDATE MPLTINFO TQTSTORE 050" TO BU-DISPLAY-MSG
065856        PERFORM 990-BLOWUP THRU 999-EXIT.
065862 829-EXIT.  EXIT.
065900
066000*******************************************************************
066100**           P E R F O R M E D     R O U T I N E S               **
066200*******************************************************************
066300 990-BLOWUP.
066400     MOVE CODE-ARG                         TO BU-DISPLAY-FLD (2).
066500     MOVE CODE-NUMBER                      TO BU-DISPLAY-FLD (3).
066600     MOVE REQ-ARG                          TO BU-DISPLAY-FLD (4).
066700     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
066800                   VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
066900                   BU-DISPLAY-FLDS.
067000 999-EXIT.     EXIT.
