000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TQTYEDIT.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        7/1/83.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*C
001100*C   ON OCT 8, 1984, CHANGED THIS SUBPROGRAM AS PART OF THE
001200*C   COMBINATION OF AKRON VERSION AND PLANT VERSION OF STORES
001300*C   PROGRAMS.  SINCE THE AKRON VERSION ALLOWS ENTRY OF
001400*C   IT, J, AND Z BILLS, MATERIAL TRANSFERS, AND SPECIAL
001500*C   STATIONERY ISSUES USING THE WORKORDER FIELD, WE HAVE TO
001600*C   SKIP THE QUANTITY CHECK FOR ITEMS RETURNED AGAINST A WORKORDER
001700*C   IF THESE ARE USED.  SO FOR THESE J, IT, Z, MT, ETC ENTRIES
001800*C   WE DONT DO A WORKORDER QUANTITY CHECK ON RETURNS.
001900*C   NOTE:  AN ACTUAL WORKORDER AT THE PLANTS WILL NEVER APPEAR
002000*C   IN ANY OF THE ABOVE FORMATS. CIH.
002100*C
002200*C   10/10/85  CHANGED PROGRAM TO BE COMPATIBLE WITH THE
002300*C             NATIVE LANGUAGE SUPPORT FACILITY.
002400*C                                         PD RAGLOW.
      *C
      *C   OCT 25, 1994   WL MCINTYRE    REQ: 94-027
      *C   ADDED CODE SO THAT UNIT AND VALUE LIMIT CHECKS WILL BE
      *C   PERFORMED ON STOREROOM RETURNS IF THIS FUNCTIONALITY HAS
      *C   BEEN SPECIFIED BY PLANT USER OPTIONS IN MPLTINFO.
      *C
      *C   FEB 27, 1995   WL MCINTYRE    REQ: 94-027
      *C   ADDED CODE TO ACCOMODATE CHANGE TO MPLTINFO FIELDS THAT
      *C   ALLOWS USER TO SEPARATELY SPECIFY THE USE OF LIMITS FOR
      *C   UNIT AND MONETARY VALUES.
      *C
      *C   MAY 31, 1995   JEFF BUNGO     REQ #94-058
      *C   WHEN A WITHDRAWAL FAILS DUE TO INSUFFICIENT ONHAND,
      *C   WRITE A RECORD TO DSTRWITH (CS5900) WITH THE WITHDRAWAL
      *C   AND CURRENT STOREROOM VALUES TO BE USED ON A REPORT
      *C   TO INDICATE STOREROOM SATISFACTION.
002500*C
      *C   JUNE 13, 1996  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE PROGRAM TO PICK UP NEW FILE FORMATS.
      *C
      *C   MAY 1, 1997    JEFF BUNGO
      *C   ADD EDIT FOR FRANCHISE OWNED CODES TO FORCE WITHDRAWAL
      *C   FROM GOODYEAR OWNED BINS FIRST BEFORE ISSUING FROM
      *C   THE FRANCHISE OWNED BINS.  NEW PARMS PASSED ARE
      *C   THE BIN OWNERS IN THE DISPLAY FIELDS AND CODE OWNER.
      *C
      *C   MAY 12, 1997  JEFF BUNGO
      *C   ADD EDIT TO FORCE RETURNS TO GOODYEAR OWNED BINS ONLY.
002600*C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C  07/15/2003  BRUCE GEISER
      *C     SWITCH LOGIC TO PULL FROM FRANCHISE OWNED BINS FIRST
      *C     THEN GOODYEAR BINS. THIS IS TO ALLOW DANVILLE TO DRAIN
      *C     THE FRANCHISED BINS SO THEY CAN END THE FRANCHISE CONTRACT
      *C     WITH ISC AS PART OF THE ARIBIA PROJECT.
      *C

002700 ENVIRONMENT DIVISION.
002800 CONFIGURATION SECTION.
002900 SOURCE-COMPUTER.  HP-3000.
003000 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DRESERVE-RW-O
                  ASSIGN TO DATABASE-MCFLCS1302
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
           SELECT DSTRWITH-O
                  ASSIGN TO DATABASE-MCFLCS5901
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
                   FILE STATUS IS FILE-STATUS.
           SELECT USAGEFIL-I
                  ASSIGN TO DATABASE-MCFLCSUSAG
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS FILE-STATUS.
003200 DATA DIVISION.
003400 FILE SECTION.
003500 FD  DRESERVE-RW-O
003600     LABEL RECORDS ARE STANDARD.
003700 01  DRESERVE-RW-REC-O.
003800     COPY DDS-MCRPCS1300  OF MCFLCS1302.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-I-REC.
           COPY DDS-MCRPCS0500 OF MCFLCS0501.
       FD  DSTRWITH-O
           LABEL RECORDS ARE STANDARD.
       01  DSTRWITH-O-REC.
           COPY DDS-MCRPCS5900 OF MCFLCS5901.
       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-I-REC.
           COPY DDS-MCRPCSUSAG OF MCFLCSUSAG.
004000
004100 WORKING-STORAGE SECTION.
004200
004300 77  ISS-QTY-SAVE                  PIC S9(8) VALUE 0.
004400 77  RSRVD-THIS-WO                 PIC S9(8) VALUE 0.
004500 77  RSRVD-NOT-THIS-WO             PIC S9(8) VALUE 0.
004600 77  AVAIL-THIS-WO                 PIC S9(8) VALUE 0.
004700 77  AVAIL                         PIC S9(8) VALUE 0.
004800 77  SAVE-FIRST-LOC                PIC 9(1)  VALUE 0.
004900 77  MULT-STR-ONHAND               PIC S9(8) VALUE 0.
005000 77  SAVE-STR-ONHAND               PIC S9(8) VALUE 0.
005100 77  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "N".
       77  WS-CHECK-QTY                  PIC 9(08) VALUE 0.
       77  WS-CHECK-VALUE                PIC 9(18) VALUE 0.
       77  EXIT-PGM-FLAG                 PIC X(01) VALUE "N".
005200
005300 COPY BUMSG IN COPYLIB.
005400 01  PGM-FUNCTION.
005500     05  PGM-FUNCTION-1            PIC X(1).
005600     05  PGM-FUNCTION-2            PIC X(1).
005700
005800 01  MULT-STR-CODE-FLAG            PIC X(1)  VALUE "Y".
005900     88  MULT-STR-CODE                       VALUE "Y".
006000
006100 01  TEST-STR.
006200     05  TEST-STR-1                PIC X(1).
006300     05  TEST-STR-2                PIC X(1).
006400
006500 01  MOVED-RETURN-QTY-FLAG         PIC X(1)  VALUE "N".
006600     88  MOVED-RETURN-QTY          VALUE "Y".
006700
       01  UNIT-WARN.
           05  FILLER                    PIC X(26) VALUE
                "WARNING-UNIT RETURN LIMIT ".
           05  UW-UNIT                   PIC Z,ZZ9.
           05  FILLER                    PIC X(40) VALUE
                " EXCEEDED-ENTER TO ACCEPT, PF3 TO CANCEL".

       01  VALUE-WARN.
           05  FILLER                    PIC X(27) VALUE
                "WARNING-VALUE RETURN LIMIT ".
           05  VW-VALUE                  PIC ZZ,ZZZ,ZZ9.
           05  FILLER                    PIC X(40) VALUE
                " EXCEEDED-ENTER TO ACCEPT, PF3 TO CANCEL".

       01  HOLD-FRAN-ID                PIC X(10).
       01  GDYR-BIN-TOT                PIC 9(9) VALUE 0.
       01  GDYR-ONHAND                 PIC 9(9) VALUE 0.
       01  FRAN-BIN-TOT                PIC 9(9) VALUE 0.
       01  FRAN-ONHAND                 PIC 9(9) VALUE 0.


006800**************************************************************
006900**                                                          **
007000**          C O M M U N I C A T I O N S   A R E A S         **
007100**                                                          **
007200**************************************************************
007300
007400 01  SHIFT-RET-CODE                PIC X(2).
007500 01  SHIFT-FLD                     PIC X(8).
007600
007700**************************************************************
007800**                                                          **
007900**           D A T A B A S E   W O R K                      **
008000**                                                          **
008100**************************************************************
008200 COPY FILESTAT IN COPYLIB.
008300
008400 01  DSET-NAMES.
008500     05  DSET-DRESERVE             PIC X(16)  VALUE "DRESERVE;".
008600     05  DSET-NAME                 PIC X(16).
008700
008800 01  MODE-AREA.
008900     05  MODE1                     PIC S9(4) COMP VALUE 1.
009000     05  MODE3                     PIC S9(4) COMP VALUE 3.
009100     05  MODE5                     PIC S9(4) COMP VALUE 5.
009200
009300 01  ALL-ITEMS                     PIC X(2)  VALUE "@;".
009400
009500 01  SEARCH-ITEMS.
009600     05  RSRV-WO-SEARCH            PIC X(10) VALUE "RSRV-WONO;".
009700
009800 01  DRESERVE-STATUS               PIC X(2).
009900 01  WO-ARG                        PIC X(16).
010000
010100**************************************************************
010200**                                                          **
010300**           D A T A B A S E   B U F F E R S                **
010400**                                                          **
010500**************************************************************
010600
010700 COPY DRESERVE IN COPYLIB.
       COPY DSTRWITH IN COPYLIB.
       COPY USAGEFIL IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.
       COPY MPLTST   IN COPYLIB.
       01  MPLTINFO-ARG                  PIC X(4).
010800 COPY CATREAD IN COPYLIB.
010900
011000**************************************************************
011100**                                                          **
011200**            L I N K A G E   S E C T I O N                 **
011300**                                                          **
011400**************************************************************
011500
011600 LINKAGE SECTION.
011700
011800 01  RET-CODE                      PIC X(2).
011900 01  BASE                          PIC X(10).
012000 COPY DBSTAT IN COPYLIB.
012100
012200 01  DE-CODE                       PIC X(8).
012300 01  DE-WO.
012400     05  MT-CHECK.
012500         10  STATIONERY-CHECK      PIC X(1).
012600         10  FILLER                PIC X(1).
012700     05  FILLER                    PIC X(1).
012800     05  IT-J-Z-CHECK              PIC X(1).
012900     05  FILLER                    PIC X(2).
013000     05  ALPHA-CHECK               PIC X(1).
013100     05  FILLER                    PIC X(3).
013200 01  STR-ONHAND                    PIC S9(8) BINARY.
013300 01  STR-RESERVED                  PIC S9(8) BINARY.
013400 01  STR-LOC-AREA.
013500     05  STR-LOC-LINE OCCURS 6 TIMES.
013600         10  STR-LOC.
013700             15  STR-LOC-1         PIC X(1).
013800             15  STR-LOC-2         PIC X(1).
013900             15  STR-LOC-3         PIC X(1).
014000             15  FILLER            PIC X(9).
014100         10  STR-LOC-ONHAND        PIC S9(8) BINARY.
014200 01  DE-QTY-AREA.
014300     05  DE-QTY-LINE OCCURS 6 TIMES.
               10  DE-FRAN               PIC X(4).
014400         10  DE-BIN                PIC X(12).
               10    FILLER              PIC X(8).
014500         10  DE-QTY-X              PIC X(8).
014600         10  DE-QTY REDEFINES DE-QTY-X PIC 9(8).
014700 01  DE-TOTAL-QTY-X                PIC X(8).
014800 01  DE-TOTAL-QTY REDEFINES DE-TOTAL-QTY-X PIC 9(8).
014900 01  MMIS-QTY                      PIC S9(8).
015000 01  SUB                           PIC 9(1).
015100
       01  MESSAGE-BUFFER.
           05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1).
               10  FILLER                  PIC X(63).
           05  MSG-FLD                     PIC X(14).
           05  MSG-FLD-9 REDEFINES MSG-FLD PIC Z(13)9.

015300 01  AVAIL-MSG REDEFINES MESSAGE-BUFFER.
015400     05  FILLER                    PIC X(26).
015500     05  AM-ONHAND                 PIC Z(7)9.
015600     05  FILLER                    PIC X(8).
015700     05  AM-RSV                    PIC Z(7)9.
015800     05  FILLER                    PIC X(10).
015900     05  AM-AVAIL                  PIC Z(7)9.
016000     05  FILLER                    PIC X(10).
016100
016200 COPY MULTSTR  IN COPYLIB.
016300 COPY LANGSUB  IN COPYLIB.

       01  WARNING-FLAG                  PIC X(01).
       01  WARNING-TYPE                  PIC X(01).
       01  WARNING-VALUE                 PIC 9(08).
       01  STR-AVG-COST                  PIC S9(11)V9(4) COMP-3.
       01  DE-CHARGE-DEPT                PIC X(04).
       01  DE-EXP-CLASS                  PIC X(06).
       01  DE-EMPL                       PIC X(04).
       01  STR-UM                        PIC X(02).
       01  STR-MAX                       PIC S9(8) BINARY.
       01  STR-REORDER                   PIC S9(8) BINARY.
       01  STR-CODE-OWNER                PIC X(1).
      *---5/2/97, JSB HOLDING AREA FOR FRANCHISERS
       01  FRAN-TABLE.
           05  FRAN-ENTRY OCCURS 4 TIMES INDEXED BY FRAN-IDX.
               10  FRAN-ID             PIC X(1).
               10  FRAN-NAME           PIC X(4).
               10  FRAN-VEN0CODE       PIC X(10).
016400
016500
016600 PROCEDURE DIVISION USING RET-CODE, BASE, STATUS-AREA, DE-CODE,
016700                    DE-WO, STR-ONHAND, STR-RESERVED, STR-LOC-AREA,
016800                    DE-QTY-AREA, DE-TOTAL-QTY-X, MMIS-QTY, SUB,
016900                    MESSAGE-BUFFER, MULTIPLE-STR-DATA,
017000                    LANGUAGE-PARMS, WARNING-FLAG, WARNING-TYPE,
017000                    WARNING-VALUE, STR-AVG-COST, DE-CHARGE-DEPT,
                          DE-EXP-CLASS, DE-EMPL, STR-UM, STR-MAX,
                          STR-REORDER STR-CODE-OWNER FRAN-TABLE.
017100
017200 6-MAIN.
017300     PERFORM 9999-OPENS.
017400     MOVE 0                        TO  ISS-QTY-SAVE.
017500     MOVE 0                        TO  RSRVD-THIS-WO.
017600     MOVE 0                        TO  AVAIL-THIS-WO.
017700     MOVE 0                        TO  AVAIL.
017800     MOVE 0                        TO  SAVE-FIRST-LOC.
017900     MOVE 0                        TO  MULT-STR-ONHAND.
018000     MOVE 0                        TO  SAVE-STR-ONHAND.
018100     MOVE "Y"                      TO  MULT-STR-CODE-FLAG.
018200     MOVE "N"                      TO  MOVED-RETURN-QTY-FLAG.
018300     MOVE DE-WO                    TO  WO-ARG.
           MOVE 0                        TO WS-CHECK-QTY WS-CHECK-VALUE.
           MOVE "N"                      TO EXIT-PGM-FLAG.
           MOVE SPACES TO WARNING-TYPE.
           MOVE ZEROES TO WARNING-VALUE.
018400
018500**************************************************************
018600**   VALUES PASSED TO THIS SUB-PGM THRU RET-CODE MEAN THE   **
018700**   FOLLOWING:                                             **
018800**     "I1"  -  ISSUE   -  EACH BIN QTY  -  UPDATE           **
018900**     "I2"  -  ISSUE   -  EACH BIN QTY  -  DON'T UPDATE    **
019000**     "I3"  -  ISSUE   -  SINGLE QTY    -  UPDATE          **
019100**     "I4"  -  ISSUE   -  SINGLE QTY    -  DON'T UPDATE    **
019200**     "R1"  -  RETURN  -  EACH BIN QTY  -  UPDATE          **
019300**     "R2"  -  RETURN  -  EACH BIN QTY  -  DON'T UPDATE    **
019400**     "R3"  -  RETURN  -  SINGLE QTY    -  UPDATE          **
019500**     "R4"  -  RETURN  -  SINGLE QTY    -  DON'T UPDATE    **
019600**************************************************************
019700
019800     MOVE SPACES                   TO  MESSAGE-BUFFER.
019900     MOVE RET-CODE                 TO  PGM-FUNCTION.
020000     MOVE "00"                     TO  RET-CODE.
020100
020200     IF PGM-FUNCTION = "I1" OR "I2" OR "R1" OR "R2"
020300         PERFORM 61-BIN-QTYS THRU 61-BQ-X
020400     ELSE
020500     IF PGM-FUNCTION = "I3" OR "I4" OR "R3" OR "R4"
020600         PERFORM 71-SINGLE-QTY THRU 71-SQ-X
020700     ELSE
020800         MOVE "I2"                 TO  PGM-FUNCTION
020900         PERFORM 61-BIN-QTYS THRU 61-BQ-X.
021000
021100     GO TO 6-MAIN-X.
021200
021300 61-BIN-QTYS.
021400*****************************************************
021500**   NOTE THE 4 POSSIBLE PGM FUNCTIONS FOR THIS    **
021600**   PROCEDURE ARE:                                **
021700**     I1, I2, R1, AND R2                          **
021800*****************************************************
021900
      *-----5/1/97, COMPUTE TOTAL OWNED BY NON FRANCHISE OWNER (GDYR)
      *-----7/10/03, COMPUTE TOTAL OWNED BY FRANCHISE OWNER
           IF PGM-FUNCTION-1 = "I"
            MOVE ZERO TO GDYR-ONHAND
                         FRAN-ONHAND
            PERFORM VARYING SUB FROM 1 BY 1
             UNTIL SUB > 6
               PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
               IF HOLD-FRAN-ID = STR-CODE-OWNER AND
                  STR-CODE-OWNER NOT = SPACES
                   IF DE-QTY-X(SUB) NUMERIC
                     COMPUTE FRAN-BIN-TOT = STR-LOC-ONHAND(SUB) -
                                            DE-QTY(SUB)
                   ELSE
                     MOVE STR-LOC-ONHAND(SUB) TO FRAN-BIN-TOT
                   END-IF
                   IF FRAN-BIN-TOT > 0
                       ADD FRAN-BIN-TOT TO FRAN-ONHAND
                   END-IF
               END-IF
            END-PERFORM
            COMPUTE GDYR-ONHAND = (STR-ONHAND -
                                   STR-RESERVED -
                                   FRAN-ONHAND)
            IF GDYR-ONHAND < 0
                MOVE ZERO    TO GDYR-ONHAND
            END-IF
           END-IF.

022000     MOVE 0                        TO  SUB.
022100     MOVE 0                        TO  ISS-QTY-SAVE.
022200 62-LOC-LOOP.
022300     ADD 1                         TO  SUB.
022400     IF SUB > 6
022500         GO TO 62-CHECK-TOTAL.
022600
022700     MOVE DE-QTY-X (SUB)           TO  SHIFT-FLD.
022800     CALL "TRSHIFT" USING SHIFT-RET-CODE, SHIFT-FLD.
022900     MOVE SHIFT-FLD                TO  DE-QTY-X (SUB).
023000
023100     IF DE-QTY-X (SUB) NOT NUMERIC
023200         MOVE  17001               TO  CATREAD-MSG-NUMBER
023300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
023400         MOVE DE-QTY (SUB)         TO  MSG-FLD
023500         GO TO 61-BQ-X.
023600
023700     IF DE-QTY (SUB) > 0
023800         IF STR-LOC (SUB) = SPACES
023900             MOVE 03111            TO  CATREAD-MSG-NUMBER
024000             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024100             GO TO 61-BQ-X.
024200
024300     IF PGM-FUNCTION-1 = "I"
024400         IF DE-QTY (SUB) > STR-LOC-ONHAND (SUB)
024500             MOVE 02005            TO  CATREAD-MSG-NUMBER
024600             MOVE   5              TO  LANG-MSGNUM
024700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
024800             MOVE STR-LOC-ONHAND (SUB)      TO MSG-FLD-9
                   PERFORM 9100-WITHDRAWAL-FAIL THRU 9100-EXIT
024900             GO TO 61-BQ-X.

      *-----5/1/97, IF WITH FROM FRAN BIN GDYR TOTAL MUST BE 0
      *-----7/10/03, IF WITH FROM GDYR BIN, FRAN TOTAL MUST BE 0
           IF PGM-FUNCTION-1 = "I"
              PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
              IF DE-QTY(SUB) > 0 AND HOLD-FRAN-ID NOT = STR-CODE-OWNER
                  IF FRAN-ONHAND > 0
                   MOVE 13070            TO  CATREAD-MSG-NUMBER
                   MOVE   70             TO  LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE STR-LOC(SUB)     TO MSG-FLD-9
                   GO TO 61-BQ-X.

      *-----5/12/97, RETURN ONLY TO GOODYEAR OWNED BINS
           IF PGM-FUNCTION-1 = "R"
              IF DE-QTY(SUB) > 0 AND DE-FRAN(SUB) NOT = SPACES
                  MOVE 13071            TO  CATREAD-MSG-NUMBER
                  MOVE   71             TO  LANG-MSGNUM
                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                  MOVE STR-LOC(SUB)     TO MSG-FLD-9
                  GO TO 61-BQ-X.

025000
025100     IF DE-QTY (SUB) > 0
025200         IF SAVE-FIRST-LOC = 0
025300             MOVE SUB              TO  SAVE-FIRST-LOC.
025400
025500     ADD DE-QTY (SUB)              TO  ISS-QTY-SAVE.
025600
025700     GO TO 62-LOC-LOOP.
025800
025900 62-CHECK-TOTAL.
026000     MOVE SAVE-FIRST-LOC           TO  SUB.
026100     IF ISS-QTY-SAVE = 0
026200         MOVE 17019                TO  CATREAD-MSG-NUMBER
026300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
026400         MOVE 1                    TO  SUB
026500         GO TO 61-BQ-X.
026600
026700     IF STR-LOC (1) = SPACES
026800         MOVE 03111                TO  CATREAD-MSG-NUMBER
026900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
027000         MOVE 1                    TO  SUB
027100         GO TO 61-BQ-X.
027200
027300     SUBTRACT STR-RESERVED FROM STR-ONHAND GIVING AVAIL.
027400     MOVE 0                        TO  RSRVD-THIS-WO.
027500     IF PGM-FUNCTION-1 = "I"
027600         IF DE-WO NOT = SPACES
027700             PERFORM 81-RSRV-CHECK THRU 83-RC-X.
027800
027900     ADD RSRVD-THIS-WO, AVAIL
028000         GIVING AVAIL-THIS-WO.
028100
028200     IF PGM-FUNCTION-1 = "I"
028300         IF ISS-QTY-SAVE > AVAIL-THIS-WO
028400             PERFORM 9000-RSV-ERROR
028500             GO TO 61-BQ-X.
028600
028700     IF PGM-FUNCTION = "I1"
028800         IF RSRVD-THIS-WO > 0
028900             PERFORM 84-RSRV-UPDATE THRU 84-RU-X.
029000
029100     MOVE ISS-QTY-SAVE             TO  DE-TOTAL-QTY.
029200
029300     IF IT-J-Z-CHECK = "J" OR "I" OR "Z" OR STATIONERY-CHECK =
029400     "R" OR "D" OR "T" OR "S" OR MT-CHECK = "MT"
029500         GO TO 621-SKIP-WO-CHECK.
029600
029700     IF ALPHA-CHECK NOT ALPHABETIC
029800         GO TO 621-SKIP-WO-CHECK.
029900
030000     IF PGM-FUNCTION-1 = "R"
030100         IF DE-WO > SPACES
030200              IF DE-TOTAL-QTY > MMIS-QTY
030300                  MOVE 17005       TO  CATREAD-MSG-NUMBER
030400                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
030500                  MOVE MMIS-QTY    TO  MSG-FLD-9
030600                  GO TO 61-BQ-X.
030700
030800 621-SKIP-WO-CHECK.
           IF PGM-FUNCTION-1 = "R"
              MOVE 0 TO SUB
              PERFORM 86-LIMIT-LOOP THRU 86-LL-X.
           IF EXIT-PGM-FLAG = "Y"
              GO TO 61-BQ-X.

030900     IF PGM-FUNCTION = "I1" OR "R1"
031000         NEXT SENTENCE
031100     ELSE
031200         GO TO 61-BQ-X.
031300
031400 63-UPDATE-MSTORERM.
031500     IF PGM-FUNCTION = "I1"
031600         SUBTRACT ISS-QTY-SAVE FROM STR-ONHAND
031700     ELSE
031800         ADD ISS-QTY-SAVE          TO  STR-ONHAND.
031900
032000     MOVE 0                        TO  SUB.
032100 631-UPDATE-LOOP.
032200     ADD 1                         TO  SUB.
032300     IF SUB > 6
032400         GO TO 61-BQ-X.
032500     IF PGM-FUNCTION = "I1"
032600         SUBTRACT DE-QTY (SUB) FROM STR-LOC-ONHAND (SUB)
032700     ELSE
032800         ADD DE-QTY (SUB)          TO  STR-LOC-ONHAND (SUB).
032900     GO TO 631-UPDATE-LOOP.
033000
033100 61-BQ-X.
033200     EXIT.
033300
033400 71-SINGLE-QTY.
033500*****************************************************
033600**   NOTE THE 4 POSSIBLE PGM FUNCTIONS FOR THIS    **
033700**   PROCEDURE ARE:                                **
033800**     I3, I4, R3, AND R4                          **
033900*****************************************************
034000
034100     MOVE 1                        TO  SUB.
034200     MOVE DE-TOTAL-QTY-X           TO  SHIFT-FLD.
034300     CALL "TRSHIFT" USING SHIFT-RET-CODE, SHIFT-FLD.
034400     MOVE SHIFT-FLD                TO  DE-TOTAL-QTY-X.
034500
034600     IF SHIFT-FLD NOT NUMERIC
034700         MOVE 17001                TO  CATREAD-MSG-NUMBER
034800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
034900         MOVE DE-TOTAL-QTY-X       TO  MSG-FLD
035000         GO TO 71-SQ-X.
035100
035200     IF DE-TOTAL-QTY = 0
035300         MOVE 17019                TO  CATREAD-MSG-NUMBER
035400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
035500         GO TO 71-SQ-X.
035600
035700     IF STR-LOC (1) = SPACES
035800         MOVE 14053                TO  CATREAD-MSG-NUMBER
035900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
036000         GO TO 71-SQ-X.
036100
036200*---------- IF ITS A MULT STOREROOM PLANT, FIND OUT IF ITS A MULT
036300*---------- STR CODE.  IF ANY OF THE LOCATIONS HAS AND ALPHABETIC/DASH
036400*---------- PREFIX (LIKE 'A-', 'B-', ETC), THEN IT IS A MULT STR CODE.
036500*---------- IF NONE OF THE LOCATIONS HAVE THIS PREFIX, WE JUST HAVE TO
036600*---------- ASSUME WE ARE WITHDRAWING FROM THE CORRECT STOREROOM.
036700*---------- THE INSTANCE OF NONE OF THE LOCATIONS FOR A CODE HAVING A
036800*---------- PREFIX FOR A MULTIPLE STOREROOM PLANT COULD OCCUR IF THEY
036900*---------- HAVE CODES THAT ARE ALWAYS IN ONLY ONE STOREROOM (NOT SHARED
037000*---------- BETWEEN 2 STOREROOMS.
037100*---------- AS AN ALTERNATIVE, A DATABASE KEY CAN TELL US THAT FOR THIS
037200*---------- PLANT, ALL CODES ARE CONSIDERED "MULTIPLE STOREROOM", THUS
037300*---------- NOT ALLOWING WITHDRAWALS UNLESS THE BIN PREFIXES ARE PRESENT
037400     IF MULT-STR-PLANT
037500         IF ALWAYS-MULT-STR-CODE
037600             NEXT SENTENCE
037700         ELSE
037800             PERFORM 890-DETERMINE-MULT-STR-CODE THRU 899-DMSC-X.
037900
038000*---------- FOR SINGLE QTY, THE CALLING PGM IS ALWAYS A WORKSHEET -
038100*---------- SO THE TOTAL ONHAND IS NOT UPDATED - THE QUANTITY IS
038200*---------- JUST DISTRIBUTED AMONG THE LOCATIONS.  FOR MULTIPLE
038300*---------- STOREROOM PLANTS, ONLY THOSE LOCATIONS WITH THE CORRECT
038400*---------- STOREROOM PREFIX ARE CONSIDERED AVAILABLE FOR WITHDRAWAL
038500*---------- BY THE WORKSHEET.
038600     IF MULT-STR-PLANT AND MULT-STR-CODE
038700         PERFORM 85-DETERMINE-MULT-STR-ONHAND THRU 859-DMSO-X
038800         MOVE MULT-STR-ONHAND      TO  SAVE-STR-ONHAND
038900     ELSE
039000         MOVE STR-ONHAND           TO  SAVE-STR-ONHAND.
039100
039200     IF PGM-FUNCTION-1 = "I"
039300         IF DE-TOTAL-QTY > SAVE-STR-ONHAND
039400             MOVE 09059            TO  CATREAD-MSG-NUMBER
039500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
039600             MOVE SAVE-STR-ONHAND  TO  MSG-FLD-9
      *-------------- WRITE ENTRY TO DSTRWITH FOR WITHDRAWAL FAILURE
      *--------------  IF NOT A DIRECT DELIVERY STOREROOM ITEM (MAX=0)
                   IF STR-MAX NOT = 0
                       PERFORM 9100-WITHDRAWAL-FAIL THRU 9100-EXIT
                   END-IF
039700             GO TO 71-SQ-X.
039800
039900     IF IT-J-Z-CHECK = "J" OR "I" OR "Z" OR STATIONERY-CHECK =
040000     "R" OR "D" OR "T" OR "S" OR MT-CHECK = "MT"
040100         GO TO 711-SKIP-WO-CHECK.
040200
040300     IF PGM-FUNCTION-1 = "R"
040400         IF DE-WO > SPACES
040500              IF DE-TOTAL-QTY > MMIS-QTY
040600                  MOVE 17005       TO  CATREAD-MSG-NUMBER
040700                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
040800                  MOVE MMIS-QTY    TO  MSG-FLD-9
040900                  GO TO 71-SQ-X.
041000
041100 711-SKIP-WO-CHECK.
041200*---------- NOTE - WHEN MAKING SURE TOTAL QUANTITY DOES NOT
041300*---------- TAKE OUT OF RESERVED, THE TOTAL QUANTITY IN ALL STOREROOMS
041400*---------- (MULT STR PLANT) IS TAKEN INTO ACCOUNT, NOT JUST FOR THE
041500*---------- STOREROOM BEING WITHDRAWN FROM.  THIS IS BECAUSE A RESERVATIO
041600
041700*---------- IS NOT SPECIFIC TO A STOREROOM.
041800     SUBTRACT STR-RESERVED FROM STR-ONHAND GIVING AVAIL.
041900     MOVE 0                        TO  RSRVD-THIS-WO.
042000     IF PGM-FUNCTION-1 = "I"
042100         IF DE-WO NOT = SPACES
042200             PERFORM 81-RSRV-CHECK THRU 83-RC-X.
042300     ADD RSRVD-THIS-WO, AVAIL
042400         GIVING AVAIL-THIS-WO.
042500
042600     IF PGM-FUNCTION-1 = "I"
042700         IF DE-TOTAL-QTY > AVAIL-THIS-WO
042800             PERFORM 9000-RSV-ERROR
042900             GO TO 71-SQ-X.
043000
043100     MOVE DE-TOTAL-QTY             TO  ISS-QTY-SAVE.
043200     IF PGM-FUNCTION = "I3"
043300         IF RSRVD-THIS-WO > 0
043400             PERFORM 84-RSRV-UPDATE THRU 84-RU-X.
043500
043600****************************************************
043700**  IF WE ARE ISSUING, DETERMINE WHICH BINS WE    **
043800**  HAVE TO ISSUE FROM, AND PUT THE ISS QTYS IN   **
043900**  DE-QTY-AREA FOR RETURN TO MAIN PGM. IF RETUR- **
044000**  NING, PUT THE RETURN QTY IN BIN 1 AND 0 IN    **
044100**  ALL THE REST.                                 **
044200****************************************************
044300
044400     MOVE 0                        TO  SUB.
044500     MOVE "N"                      TO  MOVED-RETURN-QTY-FLAG.
044600 72-BLD-BIN.
      *-----5/1/97, FOR ISSUES REMOVE FROM GDYR BINS FIRST
      *----- LOOP THROUGH GDYR BINS FIRST, SECOND LOOP THROUGH FRAN
      *-----7/15/2003, FOR ISSUES REMOVE FROM FRAN BINS FIRST
      *----- LOOP THROUGH FRAN BINS FIRST, SECOND LOOP THROUGH GDYR
       LOOP1.
044700     ADD 1                         TO  SUB.
044800     IF SUB > 6
               MOVE 0 TO SUB
               IF PGM-FUNCTION-1 = "I"
                   GO TO LOOP2
               ELSE
                   GO TO 721-CONT.
045000     IF PGM-FUNCTION-1 = "I"
             PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
             IF STR-CODE-OWNER = HOLD-FRAN-ID
045100         IF MULT-STR-PLANT AND MULT-STR-CODE AND
045200           (MULT-STR-STR-1 NOT = STR-LOC-1 (SUB) )
045300             MOVE 0                TO  DE-QTY (SUB)
045400         ELSE
045500         IF ISS-QTY-SAVE < STR-LOC-ONHAND (SUB)
045600             MOVE ISS-QTY-SAVE     TO  DE-QTY (SUB)
045700             MOVE 0                TO  ISS-QTY-SAVE
045800         ELSE
045900             MOVE STR-LOC-ONHAND (SUB)  TO  DE-QTY (SUB)
046000             SUBTRACT STR-LOC-ONHAND (SUB) FROM ISS-QTY-SAVE
               END-IF
               END-IF
             END-IF
             MOVE STR-LOC(SUB) TO DE-BIN(SUB)
             GO TO LOOP1
046100     END-IF.
       LOOP2.
           IF PGM-FUNCTION-1 = "I"
             ADD 1                         TO  SUB
             IF SUB > 6
               GO TO 721-CONT
             END-IF
             PERFORM 900-GET-FRAN-ID THRU 900-GET-FRAN-ID-X
             IF STR-CODE-OWNER NOT = HOLD-FRAN-ID
               IF MULT-STR-PLANT AND MULT-STR-CODE AND
                 (MULT-STR-STR-1 NOT = STR-LOC-1 (SUB) )
                   MOVE 0                TO  DE-QTY (SUB)
               ELSE
               IF ISS-QTY-SAVE < STR-LOC-ONHAND (SUB)
                   MOVE ISS-QTY-SAVE     TO  DE-QTY (SUB)
                   MOVE 0                TO  ISS-QTY-SAVE
               ELSE
                   MOVE STR-LOC-ONHAND (SUB)  TO  DE-QTY (SUB)
                   SUBTRACT STR-LOC-ONHAND (SUB) FROM ISS-QTY-SAVE
               END-IF
               END-IF
             END-IF
             MOVE STR-LOC(SUB) TO DE-BIN(SUB)
             GO TO LOOP2
           END-IF.
           IF PGM-FUNCTION-1 NOT = "I"
046200*--- IF RETURNING AND IF MULTIPLE STOREROOM, PUT THE WHOLE QUANTITY
046300*--- IN THE FIRST BIN LOCATION FOR THAT STOREROOM.
046400     IF MULT-STR-PLANT AND MULT-STR-CODE
046500         IF MULT-STR-STR-1 = STR-LOC-1 (SUB) AND
046600         (NOT MOVED-RETURN-QTY)
046700             MOVE "Y"              TO  MOVED-RETURN-QTY-FLAG
046800             MOVE ISS-QTY-SAVE     TO  DE-QTY (SUB)
046900         ELSE
047000*---     ON A RETURN FOR MULT STOREROOM, IF NONE OF THE LOCATIONS QUALIFY
047100
047200*---     WILL HAVE TO PUT IT IN FIRST LOCATION.
047300         IF SUB > 5 AND (NOT MOVED-RETURN-QTY)
047400             MOVE ISS-QTY-SAVE     TO  DE-QTY (1)
047500             MOVE 0                TO  DE-QTY (SUB)
047600             MOVE "Y"              TO  MOVED-RETURN-QTY-FLAG
047700         ELSE
047800             MOVE 0                TO  DE-QTY (SUB)
047900     ELSE
      *------5/12/97, RETURN TO FIRST GOODYEAR OWNED BIN ONLY
           IF NOT MOVED-RETURN-QTY
               IF DE-FRAN(SUB) = SPACES
                   MOVE "Y"              TO  MOVED-RETURN-QTY-FLAG
                   MOVE ISS-QTY-SAVE     TO  DE-QTY(SUB)
               ELSE
                   MOVE 0                TO  DE-QTY(SUB)
           ELSE
               MOVE 0                    TO  DE-QTY(SUB).
048000*    IF SUB = 1
048100*        MOVE "Y"                  TO  MOVED-RETURN-QTY-FLAG
048200*        MOVE ISS-QTY-SAVE         TO  DE-QTY (SUB)
048300*    ELSE
048400*        MOVE 0                    TO  DE-QTY (SUB).
048500
048600     MOVE STR-LOC (SUB)            TO  DE-BIN (SUB).
048700
048800     GO TO 72-BLD-BIN.
048900
049000 721-CONT.
           IF PGM-FUNCTION-1 = "R"
              MOVE DE-TOTAL-QTY TO WS-CHECK-QTY
              PERFORM 860-CHECK-LIMITS THRU 860-CL-X.
           IF EXIT-PGM-FLAG = "Y"
              GO TO 71-SQ-X.

049100**************************************************************
049200**   IF PGM TYPE WAS "I3" - ISSUE, SINGLE QTY, UPDATE, OR   **
049300**   "R3" - RETURN, SINGLE QTY, UPDATE, THEN GO THRU THIS   **
049400**   LOOP TO UPDATE STR QTY'S FROM BIN QTY'S OBTAINED ABOVE **
049500**************************************************************
049600
049700     IF PGM-FUNCTION = "I3" OR "R3"
049800         NEXT SENTENCE
049900     ELSE
050000         GO TO 71-SQ-X.
050100
050200     MOVE 0                        TO  SUB.
050300 73-UPDATE-BIN.
050400     ADD 1                         TO  SUB.
050500     IF SUB > 6
050600         IF PGM-FUNCTION-1 = "I"
050700             SUBTRACT DE-TOTAL-QTY FROM STR-ONHAND
050800         ELSE
050900             ADD DE-TOTAL-QTY      TO  STR-ONHAND
051000         END-IF
051100         GO TO 71-SQ-X.
051200     IF PGM-FUNCTION-1 = "I"
051300         SUBTRACT DE-QTY (SUB) FROM STR-LOC-ONHAND (SUB)
051400     ELSE
051500         ADD DE-QTY (SUB)          TO  STR-LOC-ONHAND (SUB).
051600
051700     GO TO 73-UPDATE-BIN.
051800
051900 71-SQ-X.
052000     EXIT.
052100
052200 81-RSRV-CHECK.
052300     PERFORM 9999-CHAINHD-DRESERVE-RW-O.
052400     IF NO-ENTRY
052500         GO TO 83-RC-X
052600     ELSE
052700     IF NOT GOOD-CALL
052800         MOVE "01"                 TO  RET-CODE
052900         GO TO 6-MAIN-X.
053000 82-RSRV-CHECK-GET.
053100     PERFORM 9999-GETNEXT-DRESERVE-RW-O.
053200     IF END-OF-CHAIN
053300         GO TO 83-RC-X
053400     ELSE
053500     IF NOT GOOD-CALL
053600         MOVE "02"                 TO  RET-CODE
053700         GO TO 6-MAIN-X.
053800     IF RSRV-CORP-CODE NOT = DE-CODE
053900         GO TO 82-RSRV-CHECK-GET.
054000     MOVE RSRV-QTY                 TO  RSRVD-THIS-WO.
054100 83-RC-X.
054200     EXIT.
054300
054400 84-RSRV-UPDATE.
054500     IF ISS-QTY-SAVE > RSRVD-THIS-WO
054600         SUBTRACT RSRV-QTY   FROM  STR-RESERVED
054700         MOVE 0                    TO  RSRV-QTY
054800     ELSE
054900         SUBTRACT ISS-QTY-SAVE FROM RSRV-QTY
055000         SUBTRACT ISS-QTY-SAVE FROM STR-RESERVED.
055100
055200     MOVE "DRESERVE;"              TO  DSET-NAME.
055300     PERFORM 9999-DSET-LOCK.
055400     IF RSRV-QTY = 0
055500         PERFORM 9999-DELETE-DRESERVE-RW-O.
055600         IF NOT GOOD-CALL
055700             MOVE "03"             TO  RET-CODE
055800             GO TO 6-MAIN-X.
055900
056000     IF RSRV-QTY > 0
056100         PERFORM 9999-UPDATE-DRESERVE-RW-O.
056200         IF NOT GOOD-CALL
056300             MOVE "04"             TO  RET-CODE
056400             GO TO 6-MAIN-X.
056500     PERFORM 9999-UNLOCK.
056600
056700 84-RU-X.
056800     EXIT.
056900
057000 85-DETERMINE-MULT-STR-ONHAND.
057100     MOVE 0                        TO  SUB.
057200 851-DET-MSO-LOOP.
057300     ADD 1                         TO  SUB.
057400     IF SUB > 6
057500         GO TO 859-DMSO-X.
057600
057700*---------- THE STOREROOM INDICATOR IN LOCATION CAN BE EITHER 1 OR 2 BYTE
057800
057900*---------- LONG, FOLLOWED BY A "-".
058000
058100     IF STR-LOC-2 (SUB) = "-"
058200         MOVE STR-LOC-1 (SUB)      TO  TEST-STR
058300     ELSE
058400     IF STR-LOC-3 (SUB) = "-"
058500         MOVE STR-LOC-1 (SUB)      TO  TEST-STR-1
058600         MOVE STR-LOC-2 (SUB)      TO  TEST-STR-2
058700     ELSE
058800         MOVE STR-LOC-1 (SUB)      TO  TEST-STR.
058900
059000     IF TEST-STR = MULT-STR-STR
059100         ADD STR-LOC-ONHAND (SUB)  TO  MULT-STR-ONHAND.
059200
059300     GO TO 851-DET-MSO-LOOP.
059400
059500 859-DMSO-X.
059600     EXIT.
059700
       86-LIMIT-LOOP.
           ADD 1 TO SUB.
           MOVE DE-QTY (SUB)          TO WS-CHECK-QTY.
           PERFORM 860-CHECK-LIMITS THRU 860-CL-X.
           IF (SUB = 6) OR (EXIT-PGM-FLAG  = "Y")
              NEXT SENTENCE
           ELSE
              GO TO 86-LIMIT-LOOP.

       86-LL-X.
           EXIT.

       860-CHECK-LIMITS.
           IF WARNING-FLAG = "N"
              MOVE "PLIM"       TO MPLTINFO-ARG
              PERFORM 8600-READ-MPLTINFO THRU 8600-RMP-X
              IF MPLTINFO-RETURN-UNIT-YORN = "Y"
                 IF WS-CHECK-QTY > MPLTINFO-RETURN-UNIT-LIMIT
                    MOVE MPLTINFO-RETURN-UNIT-LIMIT TO UW-UNIT
                    MOVE UNIT-WARN TO MESSAGE-BUFFER
                    MOVE "Y" TO WARNING-FLAG
                    MOVE "U" TO WARNING-TYPE
                    MOVE MPLTINFO-RETURN-UNIT-LIMIT TO WARNING-VALUE
                    MOVE "Y" TO EXIT-PGM-FLAG
                    GO TO 860-CL-X
                 END-IF
              END-IF
              IF MPLTINFO-RETURN-VALUE-YORN = "Y"
                 COMPUTE WS-CHECK-VALUE = WS-CHECK-QTY * STR-AVG-COST
                 IF WS-CHECK-VALUE > MPLTINFO-RETURN-VALUE-LIMIT
                    MOVE MPLTINFO-RETURN-VALUE-LIMIT TO VW-VALUE
                    MOVE VALUE-WARN TO MESSAGE-BUFFER
                    MOVE "Y" TO WARNING-FLAG
                    MOVE "V" TO WARNING-TYPE
                    MOVE MPLTINFO-RETURN-VALUE-LIMIT TO WARNING-VALUE
                    MOVE "Y" TO EXIT-PGM-FLAG
                 END-IF
              END-IF
           END-IF.

       860-CL-X.
           EXIT.

       8600-READ-MPLTINFO.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-I-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
           END-READ.
           IF FILE-STATUS NOT = "00"
              MOVE "N"   TO MPLTINFO-RETURN-UNIT-YORN
              MOVE "N"   TO MPLTINFO-RETURN-VALUE-YORN
              MOVE ZEROS TO MPLTINFO-RETURN-UNIT-LIMIT
              MOVE ZEROS TO MPLTINFO-RETURN-VALUE-LIMIT
           END-IF.

       8600-RMP-X.
           EXIT.

059800 6-MAIN-X.
059900     PERFORM 9999-CLOSES.
060000     GOBACK.
060100
060200 890-DETERMINE-MULT-STR-CODE.
060300     MOVE "N"                      TO  MULT-STR-CODE-FLAG.
060400     MOVE 0                        TO  SUB.
060500 892-DET-MULT-STR-LOOP.
060600     ADD 1                         TO  SUB.
060700     IF SUB > 6
060800         GO TO 899-DMSC-X.
060900
061000     IF STR-LOC-2 (SUB) = "-"
061100         IF STR-LOC-1 (SUB) > "@" AND STR-LOC-1 (SUB) < "¢"
061200             MOVE "Y"              TO  MULT-STR-CODE-FLAG
061300             GO TO 899-DMSC-X.
061400
061500     GO TO 892-DET-MULT-STR-LOOP.
061600
061700 899-DMSC-X.
061800     EXIT.

       900-GET-FRAN-ID.
           IF FRAN-TABLE = SPACES
               MOVE SPACES TO HOLD-FRAN-ID
           ELSE
               SET FRAN-IDX TO 1
               SEARCH FRAN-ENTRY
                 AT END  MOVE SPACES TO HOLD-FRAN-ID
                 WHEN FRAN-NAME(FRAN-IDX) = DE-FRAN(SUB)
                  MOVE FRAN-ID(FRAN-IDX) TO HOLD-FRAN-ID.
       900-GET-FRAN-ID-X.
           EXIT.
061900
062000 9000-RSV-ERROR.
062100*    "I58: ISSUE QTY NOT AVAIL"
062200      MOVE 09058                   TO  CATREAD-MSG-NUMBER.
062300      PERFORM 999-CATREAD.
062400      MOVE STR-ONHAND              TO  AM-ONHAND.
062500      MOVE AVAIL-THIS-WO           TO  AM-AVAIL.
062600      SUBTRACT AVAIL-THIS-WO FROM STR-ONHAND
062700        GIVING RSRVD-NOT-THIS-WO.
062800      MOVE RSRVD-NOT-THIS-WO       TO  AM-RSV.
            PERFORM 9100-WITHDRAWAL-FAIL THRU 9100-EXIT.
062900
       9100-WITHDRAWAL-FAIL.
      *--WRITE A WITHDRAWAL FAILURE RECORD TO DSTRWITH
           ACCEPT WITH-DATE-YMD FROM DATE.
           IF WITH-DATE-YY > 90
               MOVE 19       TO WITH-DATE-CC
           ELSE
               MOVE 20       TO WITH-DATE-CC
           END-IF.
           MOVE DE-CODE      TO WITH-CORP-CODE.
           IF PGM-FUNCTION = "I1" OR "I2"
               MOVE DE-QTY(SUB)  TO WITH-QUANTITY
           ELSE
               MOVE DE-TOTAL-QTY TO WITH-QUANTITY.
           MOVE DE-CHARGE-DEPT TO WITH-CHRG-DEPT.
           MOVE DE-EXP-CLASS   TO WITH-EXP-CLASS.
           MOVE DE-EMPL        TO WITH-EMPLOYEE.
           IF PGM-FUNCTION = "I1" OR "I2"
               MOVE STR-LOC-ONHAND(SUB) TO WITH-ONHAND
           ELSE
               MOVE STR-ONHAND          TO WITH-ONHAND.
           MOVE STR-UM       TO WITH-UM.
           MOVE STR-AVG-COST TO WITH-AVG-COST.
           MOVE STR-MAX      TO WITH-MAX.
           MOVE STR-REORDER  TO WITH-REORDER.
      *-----GET MONTH TO DATE USAGE
           MOVE DE-CODE TO CORPCDE OF USAGEFIL-I-REC.
           READ USAGEFIL-I INTO BUF-USAGEFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE ZEROS           TO WITH-MTD-USAGE
           ELSE
               MOVE K-MTH-USAGE(13) TO WITH-MTD-USAGE.
           WRITE DSTRWITH-O-REC FROM BUF-DSTRWITH
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
       9100-EXIT.
           EXIT.

063000 2100-BLOWUP.
063100*------ DUMMY PARA FOR DB CALL PERFORMS.
063200
063300 COPY HCATREAD IN COPYLIB.
       9999-OPENS.
           OPEN I-O   DRESERVE-RW-O.
           OPEN INPUT MPLTINFO-I
                      USAGEFIL-I.
           OPEN I-O   DSTRWITH-O.

       9999-CLOSES.
           CLOSE      DRESERVE-RW-O
                      MPLTINFO-I
                      USAGEFIL-I
                      DSTRWITH-O.
063500 COPY DLOCKCAL IN COPYLIB.
063600 COPY UNLOCK   IN COPYLIB.
       9999-CHAINHD-DRESERVE-RW-O.
           MOVE 0 TO COND-WORD.
           MOVE WO-ARG TO RSVWONO OF DRESERVE-RW-REC-O.
           START DRESERVE-RW-O KEY = RSVWONO OF DRESERVE-RW-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "CHAINHD ERR 9999-CHAINHD-DRESERVE-RW-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-DELETE-DRESERVE-RW-O.
           MOVE 0 TO COND-WORD.
           DELETE DRESERVE-RW-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "DELETE ERR 9999-DELETE-DRESERVE-RW-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-GETNEXT-DRESERVE-RW-O.
           MOVE 0 TO COND-WORD.
           READ DRESERVE-RW-O NEXT INTO BUF-DRESERVE
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   PERFORM 9999-RESET-DRESERVE-RW-O
                   MOVE 15 TO COND-WORD
               ELSE
               IF FILE-STATUS = "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD
                   IF HANDLE-BLOWUP-FLAG = "Y"
                       MOVE "GETNEXT ERR 9999-GETNEXT-DRESERVE-RW-O"
                           TO BU-MSG-AREA
                       PERFORM 2100-BLOWUP
                   END-IF
           ELSE
           IF RSVWONO OF DRESERVE-RW-REC-O NOT = WO-ARG
               PERFORM 9999-RESET-DRESERVE-RW-O
               MOVE 15 TO COND-WORD.

       9999-RESET-DRESERVE-RW-O.
           MOVE HIGH-VALUES TO RSVWONO OF DRESERVE-RW-REC-O.
           START DRESERVE-RW-O KEY > RSVWONO OF DRESERVE-RW-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

       9999-UPDATE-DRESERVE-RW-O.
           MOVE 0 TO COND-WORD.
           REWRITE DRESERVE-RW-REC-O FROM BUF-DRESERVE
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "UPDATE ERR 9999-UPDATE-DRESERVE-RW-O"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

