001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     QUOTEXP.
001300 AUTHOR.         BARBARA WINTER.
001400 INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500 DATE-WRITTEN.   OCTOBER 1984.
001600 DATE-COMPILED.
001700*SECURITY.
001800*REMARKS.
001900*             PRINTS QUOTE EXPIRATION REPORTS.
002000*
002100***************************************************************
002200***************************************************************
002300***                   Q U O T E X P                         ***
002400***                                                         ***
002500***      THIS PROGRAM PRINTS 3 OF THE REPORTS AVAILABLE     ***
002600***      FROM THE QUOTE REPORT MENU.                        ***
002700***      PURCHASING MENU:                                   ***
002800***         1.  EXPIRING QUOTES                (REPORT QR4) ***
002900***         2.  QUOTES WITH NO EXPIRATION DATE (REPORT QR6) ***
003000***         3.  QUOTES WITH NO QUOTE NUMBER    (REPORT QR7) ***
003100***                                                         ***
003200***      THE USER INPUTS 3 OPTIONS BEFORE PRINTING BEGINS:  ***
003300***         1.  REPORT NUMBER                               ***
003400***         2.  NUMBER OF DAYS THE REPORT WILL              ***
003500***             COVER (UP TO 999 DAYS)                      ***
003600***         3.  SORT OPTION                                 ***
003700***              A)  QUOTE NUMBER                           ***
003800***              B)  EXPIRATION DATE                        ***
003900***              C)  VENDOR CODE                            ***
004000***                                                         ***
004100***************************************************************
004200***************************************************************
      *C  09/17/96  WL  MCINTYRE
      *C    MAKE REVISIONS FOR YEAR 2000 COMPATABILITY
      *C
004300 ENVIRONMENT DIVISION.
004400 CONFIGURATION SECTION.
004500 SOURCE-COMPUTER.    HP-3000.
004600 OBJECT-COMPUTER.    HP-3000.
004700 SPECIAL-NAMES.      C01 IS NEWPAGE.
004800 INPUT-OUTPUT SECTION.
004900 FILE-CONTROL.
015100      SELECT PRT-FILE     ASSIGN TO PRINTER-MCPRT.
            SELECT DVENDOR-I
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM-I
              ASSIGN TO DATABASE-MCFLCS0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DDESC-I
              ASSIGN TO DATABASE-MCFLCS1401
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT MBUYER-I
              ASSIGN TO DATABASE-MCFLCS0601
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
              FILE STATUS IS FILE-STATUS.
005200      SELECT SORT-FILE  ASSIGN TO DATABASE-SORT.
005300
005400 DATA DIVISION.
005500 FILE SECTION.
005600
005700 SD  SORT-FILE
005800     RECORD CONTAINS 63 CHARACTERS.
005900 01  SORT-REC.
006000     05  SORT-VENCODE            PIC X(10).
006100     05  SORT-CORPCODE           PIC X(8).
006200     05  SORT-UM                 PIC X(2).
006300     05  SORT-PRICE              PIC S9(11)V9(4).
           05  SORT-EXP-DATE-CN.
               07  SORT-EXP-CENT       PIC XX.
006400         07  SORT-EXP-DATE.
006500             09  SORT-YY         PIC XX.
006600             09  SORT-MM         PIC XX.
006700             09  SORT-DD         PIC XX.
006800     05  SORT-EFFECT-DATE        PIC X(6).
006900     05  SORT-QUOTE              PIC X(10).
007000     05  SORT-BUYER              PIC X(4).
007100
007200 FD  PRT-FILE
007300     RECORD CONTAINS 132 CHARACTERS
007400     LABEL RECORDS ARE OMITTED
007500     DATA RECORD IS PRT-REC.
007700 01  PRT-REC                     PIC X(132).
       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
       FD  DVENDITM-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC-I.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

007800**************************************************************
007900*           W O R K I N G         S T O R A G E              *
008000**************************************************************
008100 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X.
           05  FILE-STATUS-2       PIC X.
008300 01  HEAD1.
008400     05  FILLER              PIC X(42)  VALUE SPACES.
008500     05  HEAD1-TITLE         PIC X(45)  VALUE SPACES.
008600     05  FILLER              PIC X(45)  VALUE SPACES.
008700
008800 01  HEAD2.
008900     05  HEAD2-PROGRAM       PIC X(8)  VALUE SPACES.
009000     05  HEAD2-DATE          PIC X(8)  VALUE SPACES.
009100     05  FILLER              PIC X(104)  VALUE SPACES.
009200     05  HEAD2-PAGE          PIC X(5)  VALUE SPACES.
009300     05  HEAD2-PAGE-NO       PIC Z,ZZZ.
009400     05  FILLER              PIC X(2)  VALUE SPACES.
009500
009600 01  HEAD3.
009700     05  FILLER              PIC X(56)  VALUE SPACES.
009800     05  HEAD3-FOR           PIC X(6)  VALUE SPACES.
009900     05  HEAD3-DAYS-NUM      PIC ZZ9.
010000     05  HEAD3-DAYS          PIC X(7)  VALUE SPACES.
010100     05  FILLER              PIC X(60)  VALUE SPACES.
010200
010300 01  HEAD4.
010400     05  HEAD4-QUOTE         PIC X(13)  VALUE SPACES.
010500     05  HEAD4-EXP           PIC X(12)  VALUE SPACES.
010600     05  HEAD4-VENCODE       PIC X(11)  VALUE SPACES.
010700     05  FILLER              PIC X(20)  VALUE SPACES.
010800     05  HEAD4-BUYER-CODE    PIC X(10)  VALUE SPACES.
010900     05  FILLER              PIC X(7)  VALUE SPACES.
011000     05  HEAD4-CORP          PIC X(14)  VALUE SPACES.
011100     05  FILLER              PIC X(34)  VALUE SPACES.
011200     05  HEAD4-PRICE         PIC X(11)  VALUE SPACES.
011300
011400 01  HEAD5.
011500     05  HEAD5-NUMBER        PIC X(10)  VALUE SPACES.
011600     05  HEAD5-DATE          PIC X(10)  VALUE SPACES.
011700     05  HEAD5-VEN-NAME      PIC X(16)  VALUE SPACES.
011800     05  FILLER              PIC X(20)  VALUE SPACES.
011900     05  HEAD5-BUYER-NAME    PIC X(10)  VALUE SPACES.
012000     05  FILLER              PIC X(7)  VALUE SPACES.
012100     05  HEAD5-DESC          PIC X(11)  VALUE SPACES.
012200     05  FILLER              PIC X(38)  VALUE SPACES.
012300     05  HEAD5-UM            PIC X(10)  VALUE SPACES.
012400
012500 01  HDR-6.
012600     05  FILLER                 PIC X(2)   VALUE SPACES.
012700     05  H6-DASH1               PIC X(10).
012800     05  FILLER                 PIC X(2)   VALUE SPACES.
012900     05  H6-DASH2               PIC X(8).
013000     05  FILLER                 PIC X(3)   VALUE SPACES.
013100     05  H6-DASH3               PIC X(10).
013200     05  FILLER                 PIC X(21)  VALUE SPACES.
013300     05  H6-DASH4               PIC X(16).
013400     05  FILLER                 PIC X(1)   VALUE SPACES.
013500     05  H6-DASH5               PIC X(40).
013600     05  FILLER                 PIC X(8)   VALUE SPACES.
013700     05  H6-DASH6               PIC X(5).
013800
013900 01  LINE1.
014000     05  FILLER              PIC X(2)  VALUE SPACES.
014100     05  LINE1-QUOTE         PIC X(10)  VALUE SPACES.
014200     05  FILLER              PIC X(2)  VALUE SPACES.
014300     05  LINE1-EXP-DATE      PIC X(8)  VALUE SPACES.
014400     05  FILLER              PIC X(3)  VALUE SPACES.
014500     05  LINE1-VEN-CODE      PIC X(10)  VALUE SPACES.
014600     05  FILLER              PIC X(21)  VALUE SPACES.
014700     05  LINE1-BUYER-CODE    PIC X(4)  VALUE SPACES.
014800     05  FILLER              PIC X(13)  VALUE SPACES.
014900     05  LINE1-CORP-CODE     PIC X(10)  VALUE SPACES.
015000     05  FILLER              PIC X(31)  VALUE SPACES.
015100     05  LINE1-PRICE         PIC ZZZZZZZZZZZ.9999.
015200     05  FILLER              PIC X(2)  VALUE SPACES.
015300
015400 01  LINE2.
015500     05  LINE2-ERROR         PIC X.
015600     05  FILLER              PIC X(24)  VALUE SPACES.
015700     05  LINE2-VEN-NAME      PIC X(29)  VALUE SPACES.
015800     05  FILLER              PIC X(2)  VALUE SPACES.
015900     05  LINE2-BUYER-NAME    PIC X(16)  VALUE SPACES.
016000     05  FILLER              PIC X(4).
016100     05  LINE2-DESC          PIC X(40)  VALUE SPACES.
016200     05  FILLER              PIC X(6)   VALUE SPACES.
016300     05  LINE2-UM            PIC X(2)  VALUE SPACES.
016400     05  FILLER              PIC X(8)  VALUE SPACES.
016500
016600 01  LINE1-EFFECT-DATE         PIC X(8) VALUE SPACES.
016700
016800 01  SAVE-QUOTE              PIC X(10) VALUE SPACES.
016900
017300*-----  TODAY'S JULIAN ADDED TO THE DAYS THE REPORT COVERS
013200*----------  CURRENT DATE COMPUTED INTO A JULIAN DATE
013300 01  TODAYS-JULIAN .
           05  TJ-CCYY                 PIC 9(4).
           05  TJ-DDD                  PIC 9(3).
013400
013500*----------  TODAY'S JULIAN ADDED TO THE DAYS THE REPORT COVERS
013600 01  DATE-WANTED-JULIAN.
           05  DW-CCYY                 PIC 9(4).
           05  DW-DDD                  PIC 9(3).
018000 01  PAGE-NUM                    PIC 9(4)   VALUE 1.
018100 01  LINE-CTR                    PIC 9(2)   VALUE 99.
018200
018300*-----  REPORT NUMBER; DETERMINES WHICH REPORT IS BEING PRINTED
018400 01  WHICH-REPORT                 PIC 9     VALUE 0.
018500     88  FINDING-EXPIRED-QUOTES             VALUE 1.
018600     88  FINDING-BLANK-DATES                VALUE 3.
018700     88  FINDING-BLANK-QUOTE-NUM            VALUE 4.
018800
018900 01  CUR-DATE.
019000     05  YY                  PIC XX.
019100     05  MM                  PIC XX.
019200     05  DD                  PIC XX.
019300 01  CUR-DATE-9  REDEFINES  CUR-DATE.
019400     05  YY-9                PIC 99.
019500     05  MM-9                PIC 99.
019600     05  DD-9                PIC 99.
019700
019800*-----  FUTURE DATE TO COMPARE EXPIRATION DATES AGAINST
019900 01  DATE-COMPARE.
           05  CC-COMPARE          PIC XX.
020000     05  YY-COMPARE          PIC XX.
020100     05  MM-COMPARE          PIC XX.
020200     05  DD-COMPARE          PIC XX.
020300
022200 01  MESSAGE-AREA.
022300     05  NO-SORTED-RECORDS      PIC X(33) VALUE
022400                             "ZERO RECORDS QUALIFIED FOR REPORT".
022500
022600 01  SWITCH-AREA.
022700     05  END-OF-INPUT-FILE      PIC X VALUE "N".
022800         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
022900     05  END-OF-SORT-FILE       PIC X VALUE "N".
023000         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
023100
023200**************************************************************
023300*                 C A L L E D  R O U T I N E S               *
023400**************************************************************
      *--------- PARAMETERS FOR "JULGREG" ROUTINE.
       01  JULGREG-PARMS.
           05  GREG-DATE.
               10  GREG-CC          PIC X(2).
               10  GREG-YMD.
                   15  GREG-YY      PIC X(2).
                   15  GREG-MM      PIC X(2).
                   15  GREG-DD      PIC X(2).
           05  JULIAN-DATE.
               10  JUL-CC           PIC X(2).
               10  JUL-YY           PIC X(2).
               10  JUL-DDD          PIC X(3).
           05  JULIAN-DATE-9  REDEFINES  JULIAN-DATE.
               10  JUL-CC-9         PIC 9(2).
               10  JUL-YY-9         PIC 9(2).
               10  JUL-DDD-9        PIC 9(3).
           05  DAY-DIGIT            PIC X.
           05  LEAP-YEAR-FLAG       PIC X.

024300*----------  E S C A P E   S E Q U E N C E S
024400 01  COMPRESS-PRINT             PIC X(8).
024500 01  NORMAL-PRINT               PIC X(8).
024600 01  ESC-TEXT-61                PIC X(8).
024700 01  ESC-TEXT-60                PIC X(8).
024800
024900 COPY TBLOWUP   OF COPYLIB.
025000 COPY ESCNAM2   OF COPYLIB.
025100 COPY TDATECHK  OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       COPY CCHKOBJ   OF COPYLIB.
022300 COPY THDPRTA OF COPYLIB.
       01  SPOOL-PRT.
           05  SPOOL-PRT-9             PIC 9(2).
           05  FILLER                  PIC X.
025300**************************************************************
025400*                    D A T A  B A S E                        *
025500**************************************************************
025600 01  DATA-BASE-VALUES.
025700     03  BASE                    PIC X(10)   VALUE "  STORES;".
025800     03  PASSWORD                PIC X(8)    VALUE "JADE;   ".
025900     03  CODE-ARG                PIC X(8)    VALUE SPACES.
026000     03  VEN-ARG                 PIC X(10)   VALUE SPACES.
026100     03  BUYER-ARG               PIC X(4)    VALUE SPACES.
026200
024900 01  STATUS-AREA.
025000     05  COND-WORD            PIC S9(4)    VALUE ZERO COMP-4.
025100         88  GOOD-CALL                            VALUE 0.
025200         88  END-OF-FILE                          VALUE 11.
025300         88  START-OF-CHAIN                       VALUE 14.
025400         88  END-OF-CHAIN                         VALUE 15.
025500         88  NO-ENTRY                             VALUE 17.
025600     05  DATA-LENGTH          PIC S9(4)              COMP-4.
025700     05  RCD-NO               PIC S9(9)              COMP-4.
025800     05  CHAIN-LENGTH         PIC S9(9)              COMP-4.
025900     05  BKWD-ADDR            PIC S9(9)              COMP-4.
026000     05  FWRD-ADDR            PIC S9(9)              COMP-4.
029600 COPY DVENDOR  OF COPYLIB.
029700 COPY DVENDITM OF COPYLIB.
029800 COPY MBUYER   OF COPYLIB.
029900 COPY DDESC    OF COPYLIB.
       LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.
020400*-----  ACCEPT VALUES FROM JOB STREAM
020500 01  ACCEPT-DATA.
020600     05  OPTION-REPORT               PIC 99.
020700     05  OPTION-DAYS-XX              PIC X(3).
020800     05  OPTION-DAYS REDEFINES OPTION-DAYS-XX    PIC 9(3).
020900     05  OPTION-SORT                 PIC 9.
021000     05  FILLER                      PIC X(72).
030000**************************************************************
030100**************************************************************
030200*        P R O C E D U R E        D I V I S I O N            *
030300*                                                            *
030400*    READ THE USER OPTIONS TO DETERMINE THE RANGE OF QUOTES  *
030500*    TO RETRIEVE FROM THE DATASET DVENDITM.  SORT THE        *
030600*    QUOTES IN THE ORDER THE USER REQUESTED AND PRINT THE    *
030700*    REPORT TO DISC.                                         *
030800*                                                           *
030900*       SORT OPTIONS ARE:                                   *
031000*            1 = SORTED BY QUOTE NUMBER                     *
031100*            2 = SORTED BY EXPIRATION DATE                  *
031200*            3 = SORTED BY VENDOR CODE                      *
031300*                                                  *
031400*    IF THE REPORT IS NO EXPIRATION DATE (3) OR    *
031500*    NO QUOTE NUMBER (4), THEN THE SORT OPTION     *
031600*    IS ALWAYS 3.                                  *
031700**************************************************************
031800**************************************************************
031900 PROCEDURE DIVISION USING HD-ROUTE-DATA ACCEPT-DATA.
032000 000-START SECTION 01.
032100 00-MAIN.
032200     PERFORM 100-READ-OPTIONS THRU 199-EXIT.
032300
032400     IF OPTION-SORT = 1
032500        SORT SORT-FILE  ASCENDING KEY           SORT-QUOTE
032600             INPUT  PROCEDURE IS 200-PROCESS-QUOTES
032700             OUTPUT PROCEDURE IS 300-PRINT-REPORT
032800     ELSE
032900       IF OPTION-SORT = 2
033000          SORT SORT-FILE  ASCENDING KEY         SORT-EXP-DATE-CN
033100               INPUT  PROCEDURE IS 200-PROCESS-QUOTES
033200               OUTPUT PROCEDURE IS 300-PRINT-REPORT
033300     ELSE
033400       IF OPTION-SORT = 3
033500          SORT SORT-FILE  ASCENDING KEY         SORT-VENCODE
033600               INPUT  PROCEDURE IS 200-PROCESS-QUOTES
033700               OUTPUT PROCEDURE IS 300-PRINT-REPORT.
033800
033900*----------  PRINT REPORT, CLOSE FILES, AND QUIT
034000*    IF PAPER-IS-132-COLS
034100*        NEXT SENTENCE
034200*    ELSE
034300*        WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0
034400*        WRITE PRT-REC FROM ESC-TEXT-60 AFTER ADVANCING 0.
035000
035100     CLOSE PRT-FILE.
035200     CLOSE DVENDOR-I DVENDITM-I DDESC-I MBUYER-I.
035300     GOBACK.
035400*************************************************************
035500*************************************************************
035600*    READ THE USER OPTIONS AND DETERMINE WHICH REPORT IS    *
035700*  REQUESTED.  IF REPORT 3 OR 4 IS REQUESTED, THE COMPARE   *
035800*  DATE IS NOT NEEDED, SO THAT PROCESSING IS SKIPPED.       *
035900*                                                           *
036000*    IF REPORT 1 IS REQUESTED, THE COMPARE DATE IS COMPUTED.*
036100*  THE NUMBER OF DAYS MUST BE ADDED TO TODAYS JULIAN DATE   *
036200*  AND THE YEAR, MONTH, AND DAY MUST BE COMPUTED FROM THAT  *
036300*  TO DETERMINE THE COMPARE DATE.  THIS COMPARE DATE IS THE *
036400*  THE FINAL EXPIRATION DATE WANTED.  ANY QUOTES FOUND      *
036500*  THAT HAVE AN EXPIRATION DATE THAT IS BEFORE THIS COMPARE *
036600*  DATE WILL BE PRINTED ON THE REPORT.                      *
036700*************************************************************
036800*************************************************************
036900 100-READ-OPTIONS.
037000     CALL "TESCSEQ" USING ESC-NAME.
037100     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
037200     MOVE CHAR-10PI       TO NORMAL-PRINT.
037300     MOVE TEXT-LENGTH-61 TO ESC-TEXT-61.
037400     MOVE TEXT-LENGTH-60 TO ESC-TEXT-60.
032600
033300*----------  PRINT HEADER PAGE
078400*----------  OPEN OUTPUT FILE
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
037800
037900*----------  GET USER OPTIONS
038400     IF OPTION-REPORT = 77
038500        MOVE 3 TO WHICH-REPORT
              MOVE 3 TO OPTION-SORT
038600     ELSE
038700     IF OPTION-REPORT = 78
038800        MOVE 4 TO WHICH-REPORT
              MOVE 3 TO OPTION-SORT
038900     ELSE
039000     MOVE 1 TO WHICH-REPORT.
039100
039200*----------  PRINT HEADER PAGE
039400     IF FINDING-EXPIRED-QUOTES
039500        MOVE "DHDR75.PUB" TO HD-FILE-NAME
039600     ELSE
039700        IF FINDING-BLANK-DATES
039800           MOVE "DHDR77.PUB" TO HD-FILE-NAME
039900        ELSE
040000           MOVE "DHDR78.PUB" TO HD-FILE-NAME.
037700     OPEN OUTPUT PRT-FILE.
040100     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME,
040200        FNUM, HD-ROUTE-DATA, ESC-NAME.
040300     IF PAPER-IS-132-COLS
040400          NEXT SENTENCE
040500     ELSE
040600         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
040700         WRITE PRT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
040800     IF HD-RET-CODE NOT = 0
040900         DISPLAY "THDRPT ERROR".
041100
           OPEN INPUT DVENDOR-I DVENDITM-I DDESC-I MBUYER-I.

041200*----------  SET UP HEADING LITERALS FOR REPORT
041300     MOVE 1 TO DATE-MODE.
041400     CALL "TDATECHK" USING DATE-CHECK-AREA.
041500     MOVE DATE-SLASH-OUT                 TO HEAD2-DATE.
041600     IF FINDING-EXPIRED-QUOTES
041700        MOVE "Q U O T E   E X P I R A T I O N   R E P O R T"
041800              TO HEAD1-TITLE
041900         MOVE "  QR4 - " TO HEAD2-PROGRAM
042000     ELSE
042100        IF FINDING-BLANK-DATES
042200           MOVE "B L A N K   E X P I R A T I O N   D A T E S  "
042300                 TO HEAD1-TITLE
042400            MOVE "  QR6 - " TO HEAD2-PROGRAM
042500        ELSE
042600           IF FINDING-BLANK-QUOTE-NUM
042700               MOVE "  QR7 - " TO HEAD2-PROGRAM
042800             MOVE "B L A N K   Q U O T E   N U M B E R S        "
042900                   TO HEAD1-TITLE.
043000     MOVE SPACES TO PRT-REC.
043100     MOVE "PAGE " TO HEAD2-PAGE.
043200     MOVE PAGE-NUM    TO HEAD2-PAGE-NO.
043300
043400     IF FINDING-EXPIRED-QUOTES
043500        MOVE "for   " TO HEAD3-FOR
043600        MOVE OPTION-DAYS TO HEAD3-DAYS-NUM
043700        MOVE "   days" TO HEAD3-DAYS.
043800
043900     MOVE "    QUOTE    " TO HEAD4-QUOTE.
044000     MOVE "EXPIRATION  "  TO HEAD4-EXP.
044100     MOVE "VENDOR CODE"   TO HEAD4-VENCODE.
044200     MOVE "BUYER CODE"    TO HEAD4-BUYER-CODE.
044300     MOVE "CORPORATE CODE" TO HEAD4-CORP.
044400     MOVE "PRICE      "    TO HEAD4-PRICE.
044500
044600     MOVE "    NUMBER"     TO HEAD5-NUMBER.
044700     MOVE "      DATE"     TO HEAD5-DATE.
044800     MOVE "     VENDOR NAME"  TO HEAD5-VEN-NAME.
044900     MOVE "BUYER NAME"        TO HEAD5-BUYER-NAME.
045000     MOVE "DESCRIPTION"       TO HEAD5-DESC.
045100     MOVE "UM        "        TO HEAD5-UM.
045200     MOVE ALL "=" TO H6-DASH1, H6-DASH2, H6-DASH3,
045300                     H6-DASH4, H6-DASH5, H6-DASH6.
045400
045500     MOVE SPACES TO DATE-COMPARE.
045600
045700     MOVE DATE-YMD-OUT TO CUR-DATE.
           IF FINDING-EXPIRED-QUOTES
              NEXT SENTENCE
           ELSE
              GO TO 199-EXIT.
045800
037100*----------  COMPUTE TODAYS JULIAN DATE AND ADD THIS TO
037200*            THE NUMBER OF DAYS THE REPORT IS TO COVER.
           MOVE SPACES          TO  JULGREG-PARMS.
           MOVE CUR-DATE        TO  GREG-YMD.
           IF GREG-YY > "70"
              MOVE "19"         TO  GREG-CC
           ELSE
              MOVE "20"         TO  GREG-CC.
           CALL "JULGREG"  USING    GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG.
038200     MOVE JULIAN-DATE     TO  TODAYS-JULIAN, DATE-WANTED-JULIAN.
038300     ADD OPTION-DAYS, TJ-DDD GIVING DW-DDD.

       105-COMPUTE-DATE-WANTED.
038400     IF DW-DDD > 365
              SUBTRACT 365 FROM DW-DDD
              ADD 1 TO DW-CCYY
              GO TO 105-COMPUTE-DATE-WANTED.
           MOVE SPACES TO JULGREG-PARMS.
038500     MOVE DATE-WANTED-JULIAN    TO JULIAN-DATE.
038600
039600*----------  CHANGE THE JULIAN DATE INTO YYMMDD
           CALL "JULGREG"  USING    GREG-DATE, JULIAN-DATE,
                                    DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE GREG-DATE             TO DATE-COMPARE.
049200 199-EXIT.  EXIT.
049300*************************************************************
049400*    FIND ALL QUOTES IN DVENDITM BY SEARCHING FOR A QUOTE   *
049500*    TAG OF "Q".  THEN COMPARE THE QUOTE EXPIRATION DATE    *
049600*    WITH THE COMPARE DATE TO SEE IF THE QUOTE WILL EXPIRE  *
049700*    BEFORE THE COMPARE DATE.                               *
049800*************************************************************
049900 200-PROCESS-QUOTES SECTION.
050000 200-FIND-ALL-QUOTES.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-I FIRST INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
050700     PERFORM 205-READ-DVENDITM-LOOP THRU 290-EXIT
050800         UNTIL ALL-INPUT-RECORDS-PROCESSED.
050900
051000 205-READ-DVENDITM-LOOP.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
051300     IF NOT GOOD-CALL
051400        MOVE "Y" TO END-OF-INPUT-FILE
051500        GO TO 290-EXIT.
051900     IF VEN-QUOTE-FLAG NOT = "Q"
052000        GO TO 210-READ-DVENDITM-LOOP.
052100
052200*-----  TEST IF THIS ENTRY IS WANTED DEPENDING ON WHICH
052300*            REPORT IS BEING PROCESSED.
052400     IF FINDING-EXPIRED-QUOTES
052500        IF VEN-ITM-PRICE-DATE-CN > DATE-COMPARE OR = SPACES
052600           GO TO 210-READ-DVENDITM-LOOP
052700        ELSE
052800           NEXT SENTENCE
052900     ELSE
053000        IF FINDING-BLANK-DATES
053100           IF VEN-ITM-PRICE-DATE = SPACES
053200              NEXT SENTENCE
053300           ELSE
053400              GO TO 210-READ-DVENDITM-LOOP
053500     ELSE
053600        IF FINDING-BLANK-QUOTE-NUM
053700           IF VEN-QUOTE-NUM = SPACES
053800              NEXT SENTENCE
053900           ELSE
054000              GO TO 210-READ-DVENDITM-LOOP.
054100
054200     MOVE VEN-ITM-VENCODE       TO SORT-VENCODE.
054300     MOVE VEN-ITM-CORPCODE      TO SORT-CORPCODE.
054400     MOVE VEN-ITM-PRICE         TO SORT-PRICE.
054500     MOVE VEN-ITM-PRICE-UM      TO SORT-UM.
054600     MOVE VEN-ITM-PRICE-DATE-CN TO SORT-EXP-DATE-CN.
054700     MOVE VEN-QUOTE-NUM         TO SORT-QUOTE.
054800     MOVE VEN-BUYER-CODE        TO SORT-BUYER.
054900     RELEASE SORT-REC.
       210-READ-DVENDITM-LOOP.
           MOVE 0 TO COND-WORD.
           READ DVENDITM-I NEXT INTO BUF-DVENDITM
               AT END MOVE 15 TO COND-WORD.
055000     GO TO 205-READ-DVENDITM-LOOP.
055100 290-EXIT.  EXIT.
055200 299-EXIT.  EXIT.
055300 300-PRINT-REPORT SECTION 02.
055400 300-IS-FILE-EMPTY.
055500     MOVE SPACES TO PRT-REC.
055600     RETURN SORT-FILE
055700            AT END
055800               MOVE "Y" TO END-OF-SORT-FILE
055900               PERFORM 340-PRT-HEADINGS THRU 349-EXIT
056000               MOVE "0 RECORDS FOUND FOR THIS REPORT" TO
056100                               HEAD1-TITLE
056200               WRITE PRT-REC FROM HEAD1-TITLE
056300                    AFTER ADVANCING 1 LINE
056400               GO TO 399-EXIT.
056500
056600     MOVE "??????????" TO SAVE-QUOTE.
056700     PERFORM 302-FIND-REST-OF-DATA THRU 320-EXIT
056800          UNTIL ALL-SORTED-RECORDS-PROCESSED.
056900     GO TO 399-EXIT.
057000 302-FIND-REST-OF-DATA.
057100
057200     IF LINE-CTR > 60
057300        PERFORM 340-PRT-HEADINGS THRU 349-EXIT.
057400
057500*-----  FILL IN FIRST DATA LINE
057600     MOVE SPACES                TO LINE1.
057700     MOVE SORT-CORPCODE         TO LINE1-CORP-CODE.
057800     MOVE SORT-PRICE            TO LINE1-PRICE.
057900     IF FINDING-BLANK-QUOTE-NUM
058000        NEXT SENTENCE
058100     ELSE
058200     IF SORT-QUOTE = SAVE-QUOTE
058300        GO TO 303-UNIQUE-DATA.
058400     MOVE SORT-QUOTE            TO LINE1-QUOTE.
058500     MOVE 4 TO DATE-MODE.
058600     IF SORT-EXP-DATE NOT = SPACES
058700        MOVE SORT-EXP-DATE TO DATE-VALIDATE-IN
058800        CALL "TDATECK2" USING DATE-CHECK-AREA, ESC-NAME
058900        MOVE DATE-SLASH-OUT TO LINE1-EXP-DATE.
059000
059100     IF SORT-EFFECT-DATE NOT = SPACES
059200        MOVE SORT-EFFECT-DATE TO DATE-VALIDATE-IN
059300        CALL "TDATECK2" USING DATE-CHECK-AREA, ESC-NAME
059400        MOVE DATE-SLASH-OUT TO LINE1-EFFECT-DATE.
059500     MOVE SORT-VENCODE          TO LINE1-VEN-CODE.
059600     MOVE SORT-BUYER            TO LINE1-BUYER-CODE.
059700 303-UNIQUE-DATA.
059800     WRITE PRT-REC FROM LINE1 AFTER ADVANCING 1 LINE.
059900     ADD 1 TO LINE-CTR.
060000
060100*----------  FILL IN SECOND DATA LINE
060200     MOVE SPACES TO PRT-REC, LINE2.
060300     IF FINDING-BLANK-QUOTE-NUM
060400        NEXT SENTENCE
060500     ELSE
060600     IF SORT-QUOTE = SAVE-QUOTE
060700        GO TO 309-FIND-DESCRIPTION
060800     ELSE
060900        MOVE SORT-QUOTE TO SAVE-QUOTE.
061000     MOVE SORT-VENCODE TO VEN-ARG.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY = VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
061300     IF NOT GOOD-CALL
061400        MOVE "DBFIND DVENDOR AT 305 IN TQUOTEXP" TO BU-DISPLAY-MSG
061500        PERFORM 990-BLOWUP THRU 999-EXIT.
061600
061700 305-GET-VENDOR-NAME.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC-I NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
062000     IF END-OF-CHAIN
062100        MOVE "WARNING - NO VENDOR NAME!!!!" TO LINE2-VEN-NAME
062200        MOVE "*" TO LINE2-ERROR
062300        GO TO 307-GET-BUYER.
062400     IF NOT GOOD-CALL
062500        MOVE "DBGET FAILED AT 305 IN TQUOTEXP" TO BU-DISPLAY-MSG
062600        PERFORM 990-BLOWUP THRU 999-EXIT.
062700
062800     IF VEN-ITM-NO NOT = 00
062900        GO TO 305-GET-VENDOR-NAME.
063000     MOVE VEN-ITM-DATA                 TO LINE2-VEN-NAME.
063100 307-GET-BUYER.
063200     MOVE SORT-BUYER TO BUYER-ARG.
           MOVE 0 TO COND-WORD.
           MOVE BUYER-ARG TO BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
063500     IF NOT GOOD-CALL
063600        MOVE "WARNING - NO BUYER NAME!!!!" TO LINE2-BUYER-NAME
063700        MOVE "*" TO LINE2-ERROR
063800        GO TO 309-FIND-DESCRIPTION.
063900     MOVE BUYER-NAME TO LINE2-BUYER-NAME.
064000
064100 309-FIND-DESCRIPTION.
064200     IF SORT-CORPCODE = "NON-STR"
064300        GO TO 315-GET-UM.
064400     MOVE SORT-CORPCODE TO CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
           START DDESC-I KEY = CORPCDE OF DDESC-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
064700     IF NOT GOOD-CALL
064800        MOVE "DBFIND DDESC AT 305 IN TQUOTEXP" TO BU-DISPLAY-MSG
064900        PERFORM 990-BLOWUP THRU 999-EXIT.
065000
065100 310-GET-DESCRIPTION.
           MOVE 0 TO COND-WORD.
           READ DDESC-I NEXT INTO BUF-DDESC
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
065400     IF END-OF-CHAIN
065500        MOVE "WARNING - NO DESCRIPTION!!!!" TO LINE2-DESC
065600        MOVE "*" TO LINE2-ERROR
065700        GO TO 315-GET-UM.
065800     IF NOT GOOD-CALL
065900        MOVE "NO DESC AT 310 IN TQUOTEXP" TO BU-DISPLAY-MSG
066000        PERFORM 990-BLOWUP THRU 999-EXIT.
066100
066200     IF DESC-ID-NUM NOT = "00"
066300        GO TO 310-GET-DESCRIPTION.
066400     MOVE DESC-DATA TO LINE2-DESC.
066500
066600 315-GET-UM.
066700     MOVE SORT-UM TO LINE2-UM.
066800     WRITE PRT-REC FROM LINE2 AFTER ADVANCING 1 LINE.
066900     ADD 1 TO LINE-CTR.
067000
067100     RETURN SORT-FILE
067200            AT END   MOVE "Y" TO END-OF-SORT-FILE
067300                     GO TO 320-EXIT.
067400 320-EXIT.  EXIT.
067500*----------  PRINT HEADINGS
067600 340-PRT-HEADINGS.
067700     MOVE SPACES TO PRT-REC.
067800     WRITE PRT-REC AFTER ADVANCING NEWPAGE.
067900     IF FINDING-EXPIRED-QUOTES
068000        MOVE "Q U O T E   E X P I R A T I O N   R E P O R T"
068100              TO HEAD1-TITLE
068200     ELSE
068300        IF FINDING-BLANK-DATES
068400           MOVE "B L A N K   E X P I R A T I O N   D A T E S  "
068500                 TO HEAD1-TITLE
068600        ELSE
068700           IF FINDING-BLANK-QUOTE-NUM
068800             MOVE "B L A N K   Q U O T E   N U M B E R S        "
068900                   TO HEAD1-TITLE.
069000     WRITE PRT-REC FROM HEAD1 AFTER ADVANCING 1 LINE.
069100     MOVE "  QR2 - " TO HEAD2-PROGRAM.
069300     MOVE "PAGE " TO HEAD2-PAGE.
069400     MOVE PAGE-NUM    TO HEAD2-PAGE-NO.
069500     WRITE PRT-REC FROM HEAD2 AFTER ADVANCING 1 LINES.
069600
069700     IF FINDING-EXPIRED-QUOTES
069800        MOVE "for   " TO HEAD3-FOR
069900        MOVE OPTION-DAYS TO HEAD3-DAYS-NUM
070000        MOVE "   days" TO HEAD3-DAYS.
070100     WRITE PRT-REC FROM HEAD3 AFTER ADVANCING 1 LINES.
070200
070300     MOVE "    QUOTE    " TO HEAD4-QUOTE.
070400     MOVE "EXPIRATION  "  TO HEAD4-EXP.
070500     MOVE "VENDOR CODE"   TO HEAD4-VENCODE.
070600     MOVE "BUYER CODE"    TO HEAD4-BUYER-CODE.
070700     MOVE "CORPORATE CODE" TO HEAD4-CORP.
070800     MOVE "PRICE      "    TO HEAD4-PRICE.
070900     WRITE PRT-REC FROM HEAD4 AFTER ADVANCING 2 LINES.
071000
071100     MOVE "    NUMBER"     TO HEAD5-NUMBER.
071200     MOVE "      DATE"     TO HEAD5-DATE.
071300     MOVE "     VENDOR NAME"  TO HEAD5-VEN-NAME.
071400     MOVE "BUYER NAME"        TO HEAD5-BUYER-NAME.
071500     MOVE "DESCRIPTION"       TO HEAD5-DESC.
071600     MOVE "UM        "        TO HEAD5-UM.
071700     WRITE PRT-REC FROM HEAD5 AFTER ADVANCING 1 LINES.
071800     WRITE PRT-REC FROM HDR-6 AFTER ADVANCING 1 LINES.
071900
072000     MOVE SPACES TO PRT-REC.
072100     WRITE PRT-REC AFTER ADVANCING 1 LINES.
072200     ADD 1 TO PAGE-NUM.
072300     MOVE SPACES TO PRT-REC.
072400     MOVE 10 TO LINE-CTR.
072500
072600 349-EXIT.  EXIT.
072700 399-EXIT.  EXIT.
       ERROR-ROUTINES SECTION.
       COPY OVRPFCALL IN COPYLIB.
074000************************************************************
074200 990-BLOWUP.
074300     MOVE "TQUOTEXP" TO BU-PGM-NAME.
           MOVE SORT-QUOTE TO BU-DISPLAY-FLD (1).
           MOVE SORT-CORPCODE TO BU-DISPLAY-FLD (2).
074400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
074500           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
074600           BU-DISPLAY-FLDS.
074700 999-EXIT.  EXIT.
