       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TQUPDAT2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        AS-400.
       OBJECT-COMPUTER.        AS-400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-OPEN-QUEUE
                  ASSIGN       TO DATABASE-MCFLMM1902
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-HOT-CODE
                  ASSIGN       TO DATABASE-MCFLMM2001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-CRAFTS-REQD
                  ASSIGN       TO DATABASE-MCFLMM0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-OPEN-QUEUE
           LABEL RECORDS ARE STANDARD.
       01  WOQ-REC.
           COPY DD-ALL-FORMATS OF MCFLMM1902.

       FD  EQP-HOT-CODE
           LABEL RECORDS ARE STANDARD.
       01  HC-REC.
           COPY DD-ALL-FORMATS OF MCFLMM2001.

       FD  WO-CRAFTS-REQD
           LABEL RECORDS       ARE STANDARD.
       01  WO-CRAFTS-REQD-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       WORKING-STORAGE SECTION.
       77  HOT-CODE-SW   VALUE 0      PIC 9.
       77  TRUE-PRTY                  PIC XX.
       77  Q-BUFFER                   PIC X(90).
       77  STRT-DATE-99               PIC 9(08).
       77  END-DATE-99                PIC 9(08).
       77  STRT-TIME-99               PIC 9(04).
       77  END-TIME-99                PIC 9(04).

       01  FILE-STAT.
           05  FILE-STAT-1           PIC X  VALUE "0".
           05  FILE-STAT-2           PIC X  VALUE "0".

       01  CURR-DATE-CN.
           05  CURR-CT-99            PIC 99.
           05  CURR-DATE-99.
               10  CURR-YR-99        PIC 99.
               10  CURR-MO-99        PIC 99.
               10  CURR-DY-99        PIC 99.

       01  CUR-TIME.
           05  CURR-TIME.
               10  CURR-HR            PIC XX.
               10  CURR-MN            PIC XX.
           05  FILLER                 PIC XXXX.

       01  CRAFT-DATA.
           COPY MWOCRAFT       IN COPYLIB.

       01  HOT-CODE-DATA.
           COPY DHOTCODE       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-QUEUE-DATA.
           COPY DWOOPENQ       IN COPYLIB.

       01  ACD-SW              PIC X.

       01  ERROR-MESSAGE.
           05  ERROR-TEXT      PIC X(70).
           05  ERROR-FILL      PIC X(06).
           05  ERROR-CODE REDEFINES ERROR-FILL PIC 9(06).

       01  LABOR-CURR-DATA.
           COPY DCURRLBR       IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS
                                WO-QUEUE-DATA
                                ACD-SW
                                ERROR-MESSAGE
                                LABOR-CURR-DATA.

       START-PROCESSING.
           ACCEPT CURR-DATE-99 FROM DATE.
           MOVE 20             TO CURR-CT-99.
           IF CURR-YR-99 > 70
               MOVE 19         TO CURR-CT-99.
           ACCEPT CUR-TIME     FROM TIME.
           MOVE Q-PRTY         TO TRUE-PRTY.
           MOVE "1 "           TO Q-PRTY.
           MOVE SPACES         TO ERROR-MESSAGE.

       ADD-FUNCTION.
           OPEN INPUT          WO-CRAFTS-REQD.
           OPEN INPUT          EQP-HOT-CODE.
           OPEN I-O            WO-OPEN-QUEUE.
           IF Q-SKILL-1 = SPACES
               GO TO END-OF-JOB.

           MOVE Q-SKILL-1      TO CRAFTREQD OF WO-CRAFTS-REQD.
           READ WO-CRAFTS-REQD INTO CRAFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               GO TO END-OF-JOB.

           IF CRAFT-FLAG = "4"
               GO TO END-OF-JOB.

           IF Q-SKILL-2 = SPACES
               NEXT SENTENCE
           ELSE
           MOVE Q-SKILL-2      TO CRAFTREQD OF WO-CRAFTS-REQD
           READ WO-CRAFTS-REQD INTO CRAFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
           END-READ
           IF FILE-STAT NOT = ZEROS
               GO TO END-OF-JOB
           ELSE
           IF CRAFT-FLAG = "4"
               GO TO END-OF-JOB.

           IF Q-SKILL-3 = SPACES
               NEXT SENTENCE
           ELSE
           MOVE Q-SKILL-3      TO CRAFTREQD OF WO-CRAFTS-REQD
           READ WO-CRAFTS-REQD INTO CRAFT-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
           END-READ
           IF FILE-STAT NOT = ZEROS
               GO TO END-OF-JOB
           ELSE
           IF CRAFT-FLAG = "4"
               GO TO END-OF-JOB.

           PERFORM CHECK-HOT-CODE-FILE THRU CHCF-EXIT.

           MOVE Q-WO-NUM       TO WONUM-MM OF WO-OPEN-QUEUE.
           START WO-OPEN-QUEUE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               GO TO END-OF-JOB.

           READ WO-OPEN-QUEUE INTO WO-QUEUE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = ZEROS
               GO TO END-OF-JOB.

           IF HOT-CODE-SW = 1
               IF TRUE-PRTY = "1 "
                   MOVE 80     TO QUEUE-FACTOR
               ELSE
               IF TRUE-PRTY = "2 "
                   MOVE 79     TO QUEUE-FACTOR.

           WRITE WOQ-REC FROM WO-QUEUE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               MOVE "WRITE ERROR - RECORD NOT ADDED TO QUEUE"
                               TO ERROR-TEXT.

       END-OF-JOB.
           CLOSE               WO-OPEN-QUEUE.
           CLOSE               WO-CRAFTS-REQD.
           CLOSE               EQP-HOT-CODE.
           GOBACK.

       CHECK-HOT-CODE-FILE.
           MOVE Q-EQUIP-NUM    TO EQPNUM-MM OF EQP-HOT-CODE.

           START EQP-HOT-CODE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               GO TO CHCF-EXIT.

           READ EQP-HOT-CODE INTO HOT-CODE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               GO TO CHCF-EXIT.

           IF Q-EQUIP-NUM NOT = HC-EQUIP-NUM
               GO TO CHCF-EXIT.

           MOVE HC-STRT-DATE-CN TO STRT-DATE-99.
           MOVE HC-END-DATE-CN  TO END-DATE-99.

           IF CURR-DATE-CN > STRT-DATE-99 AND
              CURR-DATE-CN < END-DATE-99
               MOVE 1          TO HOT-CODE-SW
               GO TO CHCF-EXIT.

           MOVE HC-STRT-TIME   TO STRT-TIME-99.
           MOVE HC-END-TIME    TO END-TIME-99.
           IF CURR-DATE-CN = STRT-DATE-99 AND
              CURR-DATE-CN = END-DATE-99
               IF CURR-TIME > STRT-TIME-99 AND
                  CURR-TIME < END-TIME-99
                       MOVE 1  TO HOT-CODE-SW
                       GO TO CHCF-EXIT.

           IF CURR-DATE-CN = STRT-DATE-99
               IF CURR-TIME > STRT-TIME-99
                   MOVE 1      TO HOT-CODE-SW
                   GO TO CHCF-EXIT.

           IF CURR-DATE-CN = END-DATE-99
               IF CURR-TIME < END-TIME-99
                   MOVE 1      TO HOT-CODE-SW
                   GO TO CHCF-EXIT.

       CHCF-EXIT.    EXIT.

