       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TR3OPT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZREPORT-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT R3FILE
               ASSIGN TO DATABASE-MCFPMR3FIL
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS R3-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                 PIC X(2000).
       FD  R3FILE
           RECORD CONTAINS 44 CHARACTERS
           DATA RECORD IS R3REC.
       01  R3REC                     PIC X(44).
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       WORKING-STORAGE SECTION.
       77  ERR-SW                    PIC X.
       01  ARG-NO                    PIC 9(9).
       01  BEG-DATE-REC              PIC X(6).
       01  BEG-TIME-REC              PIC X(4).
       01  BLOWUP-BASE               PIC X(16).
       COPY CATREAD  IN COPYLIB.
       COPY CCHKOBJ  IN COPYLIB.
       COPY CPYIND   IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       01  DBPARAMETERS.             COPY DBPARMS OF COPYLIB.
       COPY TDATESUB  IN COPYLIB.
       01  END-DATE-REC              PIC X(6).
       01  END-TIME-REC              PIC X(4).
       01  ERROR-BUFFER              PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  R3-STATUS             PIC XX.
           05  WLNU-STATUS           PIC XX.
       COPY JCWAREA    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       01  LAST-WO-BUFF.             COPY MLASTWO  OF COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       01  SCREEN-BUFFER.
           05  BEG-END-DTS.
               10  BEG-DATE          PIC X(6).
               10  BEG-TIME          PIC X(4).
               10  END-DATE          PIC X(6).
               10  END-TIME          PIC X(4).
           05 RESTRICTIONS OCCURS 5 TIMES.
              15  ZONE-R  OCCURS 1 TIMES
                                     PIC X(4).
              15  EQPNUMS OCCURS 5 TIMES.
                  20  EQPNUM-R       PIC X(6).
              15  CRAFTS  OCCURS 5 TIMES.
                  20  CRAFT-R        PIC X(2).
           05  SCREEN-CMD-LINE       PIC X(79).
           05  SCREEN-ERR-LINE       PIC X(79).
       COPY DBSTAT    IN COPYLIB.
       01  SUB1                      PIC S9(4) COMP-4.
       01  SUB2                      PIC S9(4) COMP-4.
       COPY TBLOWUP   IN COPYLIB.
       01  TRUE-VAL                  PIC 1 VALUE B"1".
       COPY VCOMLINK  IN COPYLIB.
       COPY WSCONTROL IN COPYLIB.
       PROCEDURE DIVISION.
       START-PAR.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT
               UNTIL VIEW-LASTKEY = 3.

       2-EOJ.
           CLOSE DISPLAY-FILE.
           IF ERR-SW = "N"
               CLOSE R3FILE
               CLOSE WO-LAST-NUM-USED
               MOVE "050"       TO SETJCW-VALUE
               MOVE 278         TO SETJCW-STARTING-POS
               MOVE 3           TO SETJCW-LENGTH
               CALL "SETJCW" USING SETJCW-VALUE
                                   SETJCW-STARTING-POS
                                   SETJCW-LENGTH
                                   SETJCW-STATUS
               IF SETJCW-STATUS NOT = "00"
                   MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               CALL "TRSCREN2".

           GOBACK.

       1-HSK.
           MOVE "N"          TO ERR-SW.
           OPEN I-O   DISPLAY-FILE.
           MOVE "MCFPMR3FIL" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
      *M   "MR3 REPORT BEING CREATED - TRY AGAIN IN A COUPLE MINUTES"
           MOVE "R3M" TO VIEW-CFNAME
           MOVE TRUE-VAL TO INDS (98)
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE "Y"  TO  ERR-SW
           GO TO 2-EOJ.
           MOVE "*CURLIB"     TO CCRTFILE-LIBRARY.
           MOVE "MCFPMR3FIL"  TO CCRTFILE-FILE.
           MOVE "0044"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "00010"       TO CCRTFILE-NO-RECORDS.
           MOVE "00001"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "03"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'MCFPMR3FIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           OPEN OUTPUT R3FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           MOVE 1 TO ARG-NO.
           MOVE 0 TO COND-WORD VIEW-LASTKEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-CODE.
           MOVE SPACES TO SCREEN-BUFFER.

       6-MAIN.
           IF TRUE-VAL = INDS (99)
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE.
           IF VIEW-CFNAME = "R3"
                 MOVE "R3A" TO VIEW-CFNAME
           ELSE
           MOVE "R3"  TO VIEW-CFNAME.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
           MOVE 1 TO SUB1.
           IF BEG-DATE = SPACES
                MOVE "000000" TO BEG-DATE.
           MOVE BEG-DATE TO DATE-VALIDATE-IN.
           MOVE 3 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           IF DATE-RET-CODE = 1
               MOVE DATE-MSG TO ERROR-BUFFER
               MOVE TRUE-VAL TO INDS (56) INDS (99)
               GO TO 6-MAIN.
           MOVE DATE-DB TO BEG-DATE-REC.
           IF BEG-TIME NUMERIC
               MOVE BEG-TIME TO BEG-TIME-REC
           ELSE
           MOVE 35029 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (57) INDS (99)
           GO TO 6-MAIN.
           IF END-DATE = SPACES
               MOVE "000000" TO END-DATE.
           MOVE END-DATE TO DATE-VALIDATE-IN.
           MOVE 3 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           IF DATE-RET-CODE = 1
               MOVE DATE-MSG TO ERROR-BUFFER
               MOVE TRUE-VAL TO INDS (58) INDS (99)
               GO TO 6-MAIN.
           MOVE DATE-DB TO END-DATE-REC.
           IF END-TIME NUMERIC
               MOVE END-TIME TO END-TIME-REC
           ELSE
           MOVE 35029 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (59) INDS (99)
           GO TO 6-MAIN.

       WRITE-DATES.
           STRING BEG-DATE-REC BEG-TIME-REC DELIMITED BY SIZE
              INTO R3REC.
           WRITE R3REC.
           STRING END-DATE-REC END-TIME-REC DELIMITED BY SIZE
              INTO R3REC.
           WRITE R3REC.

       WRITE-OPTIONS.
           IF SUB1 > 5 OR ZONE-R (SUB1, 1) = SPACES
             GO TO 6-MAIN-EXIT.
           MOVE RESTRICTIONS (SUB1) TO R3REC.
           WRITE R3REC.
           ADD 1 TO SUB1.
           GO TO WRITE-OPTIONS.

       6-MAIN-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       998-BLOWUP.
           MOVE "TR3OPT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
