       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TR3PUREQ.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM ALLOWS THE WO-PARTS DATA SET (MCFPMM1200) **
      ** TO BE UPDATED FROM A FILE PROVIDED BY SYNERGY SAP/R3   **
      ** THAT CONTAINS REQUISITION DATA REQUIRED FOR MMIS WORK  **
      ** ORDER PERSONNEL TO TRACK THEIR 'M' ORDERS.             **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT R3REQ-REPORT
               ASSIGN TO DATABASE-R3REQRPF
               FILE STATUS IS FILE-STATUS.

           SELECT SAP-FILE
               ASSIGN TO DATABASE-R3PUREQ
               ACCESS IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PARTS
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MPLTINFO-REC.
       01  MPLTINFO-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  R3REQ-REPORT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS R3REQ-RPT-REC.
       01  R3REQ-RPT-REC.
           05  R3REQ-CTL           PIC X(1).
           05  R3REQ-LINE.
               10  R3REQ-CTL-DATE  PIC X(6).
               10  FILLER          PIC X(126).

       FD  SAP-FILE
           RECORD CONTAINS 172 CHARACTERS
           DATA RECORD IS SAP-REC.
       01  SAP-REC                 PIC X(172).

       FD  WO-PARTS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WO-PARTS-REC.
       01  WO-PARTS-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       WORKING-STORAGE SECTION.
       77  ERROR-SW                PIC X.
       77  EXPECTED-SEQ            PIC 9(5).
       77  LINE-CTR                PIC 99.
       77  RCDSIN-CTR              PIC 9(6).
       77  SAVE-COMPANY            PIC X(3).
       77  SAVE-PLANT              PIC X(4).

       01  CUR-DATE-BUF.
           05  CD-BUF-YY           PIC 99.
           05  CD-BUF-MM           PIC 99.
           05  CD-BUF-DD           PIC 99.

       01  DB-BASE                 PIC X(13).

       01  ERR-RPT-HDG-1.
           05  FILLER              PIC X(3)  VALUE SPACES.
           05  ERR-DATE-H1         PIC X(8)  VALUE SPACES.
           05  FILLER              PIC X(36) VALUE SPACES.
           05  FILLER              PIC X(37)
               VALUE "R/3 REQS ISSUED AGAINST WORK ORDERS  ".
           05  FILLER              PIC X(37) VALUE SPACES.
           05  FILLER              PIC X(8)  VALUE "TR3PUREQ".
           05  FILLER              PIC X(3)  VALUE SPACES.

       01  ERR-RPT-HDG-2.
           05  FILLER              PIC X(3)  VALUE SPACES.
           05  ERR-TIME-H2         PIC X(8)  VALUE SPACES.
           05  FILLER              PIC X(49) VALUE SPACES.
           05  FILLER              PIC X(6)  VALUE "SEQ # ".
           05  ERR-SEQ-H2          PIC X(5)  VALUE SPACES.
           05  FILLER              PIC X(50) VALUE SPACES.
           05  FILLER              PIC X(5)  VALUE "PAGE ".
           05  ERR-PG-H2           PIC Z99.
           05  FILLER              PIC X(3)  VALUE SPACES.

       01  ERR-RPT-LINE.
           05  FILLER              PIC X(3)  VALUE SPACES.
           05  ERR-RPT-CODE        PIC X(7)  VALUE SPACES.
           05  FILLER              PIC X(3)  VALUE SPACES.
           05  ERR-WO-NUM          PIC X(10) VALUE SPACES.
           05  FILLER              PIC X(3)  VALUE SPACES.
           05  ERR-RPT-MSG         PIC X(97) VALUE SPACES.
           05  FILLER              PIC X(10) VALUE SPACES.

       01  PLANT-ENTRIES.
           05  FILLER              PIC X(7) VALUE "111N515".
           05  FILLER              PIC X(7) VALUE "126N501".
           05  FILLER              PIC X(7) VALUE "129N504".
           05  FILLER              PIC X(7) VALUE "131N502".
           05  FILLER              PIC X(7) VALUE "133N503".
           05  FILLER              PIC X(7) VALUE "153N508".
           05  FILLER              PIC X(7) VALUE "211N505".
           05  FILLER              PIC X(7) VALUE "281N506".
           05  FILLER              PIC X(7) VALUE "284N514".
           05  FILLER              PIC X(7) VALUE "285N507".
           05  FILLER              PIC X(7) VALUE "629N511".
           05  FILLER              PIC X(7) VALUE "631N510".
           05  FILLER              PIC X(7) VALUE "637N509".

       01  PLANT-TABLE REDEFINES PLANT-ENTRIES.
           05  PLANT-DATA-LINE  OCCURS 13 TIMES  INDEXED BY I.
               10  CSIS-PLT-NO     PIC X(3).
               10  SAP-PLT-NO      PIC X(4).

       01  SAP-DETAIL-RECORD.
           05  SAP-WONUM           PIC X(10).
           05  SAP-ITEMNO          PIC X(4).
           05  SAP-EST-QTY         PIC 9(8).
           05  SAP-UM              PIC XX.
           05  SAP-UNIT-COST       PIC 9(14)V9(2).
           05  SAP-REQNO           PIC X(12).
           05  SAP-DESC            PIC X(40).
           05  SAP-EST-COST        PIC 9(14)V9(2).
           05  SAP-ACT-QTY         PIC 9(8).
           05  SAP-ACT-COST        PIC 9(14)V9(2).
           05  SAP-PONO            PIC X(10).
           05  SAP-CODE            PIC X(18).
           05  SAP-ORIG            PIC X(12).

       01  SAP-HEADER-RECORD.
           05  SAP-H-ID            PIC X(7).
           05  SAP-H-FILE-ID       PIC X(7).
           05  SAP-H-LOC           PIC X(4).
           05  SAP-H-CREATE-DATE   PIC X(8).
           05  SAP-H-CREATE-TIME   PIC X(6).
           05  SAP-H-FILE-SEQ      PIC 9(5).
           05  SAP-H-PLANT         PIC X(4).
           05  SAP-H-APPAREA       PIC X(20).
           05  FILLER              PIC X(97).

       01  SAP-RECORD.
           05  SAP-RECORD-ID       PIC X(7).
           05  FILLER              PIC X(165).

       01  SAP-TRAILER-RECORD.
           05  SAP-T-ID            PIC X(7).
           05  SAP-T-FILE-ID       PIC X(7).
           05  SAP-T-LOC           PIC X(4).
           05  SAP-T-CREATE-DATE   PIC X(8).
           05  SAP-T-CREATE-TIME   PIC X(6).
           05  SAP-T-FILE-SEQ      PIC 9(5).
           05  SAP-T-PLANT         PIC X(4).
           05  SAP-T-RECORD-CTR    PIC 9(6).
           05  FILLER              PIC X(111).

      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY LANGSUB    IN COPYLIB.
       COPY TDATESUB   IN COPYLIB.
       COPY VCOMAREA   IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                    PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT   IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       01  PARTS-WORKAREA.         COPY DWOPARTS IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.

       PROCEDURE DIVISION.
       START-PGM.
           OPEN I-O   MPLTINFO.
           OPEN INPUT SAP-FILE.
           OPEN I-O   WO-PARTS.
           OPEN EXTEND R3REQ-REPORT.
           MOVE 0 TO LINE-CTR.
           MOVE "N" TO ERROR-SW.
           MOVE 1                TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT   TO  ERR-DATE-H1.
           MOVE DATE-FORMATTED-TIME-OUT  TO  ERR-TIME-H2.
           MOVE SPACES           TO  R3REQ-RPT-REC.
           MOVE "*"              TO  R3REQ-CTL.
           MOVE DATE-YMD-OUT     TO  R3REQ-CTL-DATE.
           WRITE R3REQ-RPT-REC.
           MOVE 0                TO  R3REQ-CTL.
           MOVE ERR-RPT-HDG-1    TO  R3REQ-LINE.
           WRITE R3REQ-RPT-REC.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES       TO  ERR-RPT-LINE
               MOVE "ERROR READING 'P 01' RECORD IN MPLTINFO"
                   TO ERR-RPT-MSG
               MOVE "1"          TO  R3REQ-CTL
               MOVE ERR-RPT-LINE TO  R3REQ-LINE
               WRITE R3REQ-RPT-REC
               GO TO 2-EOJ
           ELSE
           MOVE MPLTINFO-COMPANY TO  SAVE-COMPANY.
           SET I TO 1.
           SEARCH PLANT-DATA-LINE
               AT END
                   MOVE SPACES   TO  SAVE-PLANT
               WHEN CSIS-PLT-NO (I) = SAVE-COMPANY
                   MOVE SAP-PLT-NO (I) TO  SAVE-PLANT.

           PERFORM 6-MAIN THRU 6-MAIN-X.

       2-EOJ.
           CLOSE MPLTINFO.
           CLOSE R3REQ-REPORT.
           CLOSE SAP-FILE.
           CLOSE WO-PARTS.
           GOBACK.

       6-MAIN.
           READ SAP-FILE INTO SAP-RECORD
               AT END    GO TO 6-MAIN-INCR-SEQ.
           ADD 1 TO RCDSIN-CTR.
           IF SAP-RECORD-ID = "HEADER "
               MOVE SAP-RECORD TO SAP-HEADER-RECORD
               IF SAP-H-FILE-SEQ = 00000
                   MOVE 00001 TO SAP-H-FILE-SEQ
               END-IF
               IF SAP-H-PLANT NOT = SAVE-PLANT
                   MOVE "3"            TO R3REQ-CTL
                   MOVE SPACES         TO ERR-RPT-LINE
                   MOVE "*** FILE READ IS NOT THIS PLANT'S"
                                       TO ERR-RPT-MSG
                   MOVE SAP-H-FILE-SEQ TO ERR-SEQ-H2
                   MOVE ERR-RPT-LINE   TO R3REQ-LINE
                   WRITE R3REQ-RPT-REC
                   GO TO 6-MAIN-X
               END-IF
               PERFORM 6-SEQ-CHECK THRU 6-SC-X
               IF ERROR-SW = "Y"
                   MOVE "1"            TO R3REQ-CTL
                   MOVE ERR-RPT-LINE   TO R3REQ-LINE
                   WRITE R3REQ-RPT-REC
                   GO TO 6-MAIN-X
               ELSE
               MOVE "1"                TO R3REQ-CTL
               MOVE SAP-H-FILE-SEQ     TO ERR-SEQ-H2
               MOVE ERR-RPT-HDG-2      TO R3REQ-LINE
               WRITE R3REQ-RPT-REC
               GO TO 6-MAIN
           ELSE
           IF SAP-RECORD-ID = "TRAILER"
               MOVE SAP-RECORD TO SAP-TRAILER-RECORD
               IF RCDSIN-CTR = SAP-T-RECORD-CTR
                   GO TO 6-MAIN-INCR-SEQ
               ELSE
               MOVE "NUMBER OF RECORDS DOES NOT MATCH"
                   TO ERR-RPT-MSG
               MOVE RCDSIN-CTR         TO ERR-RPT-CODE
               MOVE SAP-T-RECORD-CTR   TO ERR-WO-NUM
               MOVE ERR-RPT-LINE       TO R3REQ-LINE
               WRITE R3REQ-RPT-REC
               GO TO 6-MAIN-X
           ELSE
           MOVE SAP-RECORD           TO SAP-DETAIL-RECORD.
           MOVE SPACES               TO PARTS-WORKAREA.
           MOVE SAP-WONUM            TO PRT-WO-NU.
           MOVE SAP-ITEMNO           TO PRT-ITEM-NO.
           MOVE "M "                 TO PRT-STATUS.
           MOVE SAP-EST-QTY          TO PRT-EST-QTY-9.
      *    MOVE SAP-PARTNO           TO PRT-NUM-7.
           MOVE SAP-UM               TO PRT-UNIT-MEAS.
           MOVE SAP-UNIT-COST        TO P-UNIT-COST.
           MOVE SAP-REQNO            TO PRT-REQ-NO.
           MOVE SAP-DESC             TO PRT-DESC.
           MOVE SAP-EST-COST         TO P-EST-COST.
           MOVE SAP-ACT-QTY          TO PRT-ACT-QTY-9.
           MOVE SAP-ACT-COST         TO P-ACT-COST.
           MOVE SAP-PONO             TO PRT-PO-NO.
           MOVE "120"                TO PRT-PRIME.
           WRITE WO-PARTS-REC FROM PARTS-WORKAREA
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE OF PARTS RECORD FAILED"
                   TO ERR-RPT-MSG
               MOVE FILE-STATUS      TO ERR-WO-NUM
               MOVE ERR-RPT-LINE     TO R3REQ-LINE
               WRITE R3REQ-RPT-REC
               GO TO 6-MAIN-X.
           DISPLAY "WROTE PARTS REQ RECORD FOR " PRT-WO-NU " "
               PRT-REQ-NO.
           GO TO 6-MAIN.

       6-MAIN-INCR-SEQ.
           MOVE "R3SQ"        TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "3"          TO R3REQ-CTL
               MOVE SPACES       TO ERR-RPT-LINE
               MOVE "CANNOT UPDATE R3SQ KEY OF MPLTINFO "
                                 TO ERR-RPT-MSG
               MOVE ERR-RPT-LINE TO R3REQ-LINE
               WRITE R3REQ-RPT-REC
               GO TO 6-MAIN-X.
           ADD 1 TO MPLTINFO-MMSPWO-SEQ.
           REWRITE MPLTINFO-REC FROM BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "3"          TO R3REQ-CTL
               MOVE SPACES       TO ERR-RPT-LINE
               MOVE "CANNOT UPDATE MMSPWO SEQUENCE "
                                 TO ERR-RPT-MSG
               MOVE ERR-RPT-LINE TO R3REQ-LINE
               WRITE R3REQ-RPT-REC.

       6-MAIN-X.
           EXIT.

       6-SEQ-CHECK.
           MOVE "R3SQ" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES               TO ERR-RPT-LINE
               MOVE "ERROR READING R3SQ RECORD"
                                         TO ERR-RPT-MSG
               MOVE "Y"                  TO ERROR-SW
               GO TO 6-SC-X.
           ADD 1 TO MPLTINFO-MMSPWO-SEQ GIVING EXPECTED-SEQ.
           IF SAP-H-FILE-SEQ = EXPECTED-SEQ
               PERFORM 6-RELEASE-R3SQ-KEY
           ELSE
           MOVE SPACES                   TO ERR-RPT-LINE
           MOVE "MMSPWO SEQUENCE ERROR " TO ERR-RPT-MSG
           MOVE SAP-H-FILE-SEQ           TO ERR-RPT-CODE
           MOVE EXPECTED-SEQ             TO ERR-WO-NUM
           MOVE "Y"                      TO ERROR-SW.
       6-SC-X.    EXIT.

       6-RELEASE-R3SQ-KEY.
           MOVE HIGH-VALUES TO PLTINFOKEY OF MPLTINFO-REC.
           START MPLTINFO KEY > PLTINFOKEY OF MPLTINFO-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.

       6999-HEADER.
           MOVE "0"           TO R3REQ-CTL.
           MOVE ERR-RPT-HDG-1 TO R3REQ-LINE.
           WRITE R3REQ-RPT-REC.
           MOVE "1"           TO R3REQ-CTL.
           MOVE ERR-RPT-HDG-2 TO R3REQ-LINE.
           WRITE R3REQ-RPT-REC.
           MOVE "2"           TO R3REQ-CTL.
           MOVE ALL "-"       TO R3REQ-LINE.
           WRITE R3REQ-RPT-REC.
           MOVE 4             TO LINE-CTR.

