000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TR3RRCVR.
000500 AUTHOR.        KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000800
000900**************************************************************
001000*                                                            *
001100*   T R 3 R R C V R    THIS PROGRAMS PLACES ALL THE ENTRIES  *
001200*     IN 'R3REQFIL' BACK IN THE DATA SET 'MCORPREQ'. THIS    *
001300*     PROGRAM IS USED FOR RECOVERY PURPOSES IN CASE THE      *
001400*     REQUISITION CREATE PROGRAM FOR SYNERGY ABORTS PRIOR    *
001500*     TO COMPLETING. YOU MUST ISSUE AN OVERRIDE STATEMENT    *
001600*     - 'OVRDBF FILE(R3RRCVR) TOFILE(MCPRD1/R3REQFI2)"-      *
001700*     IS REQUIRED TO POINT TO THE CORRECT FILE.              *
001800**************************************************************
001900
002000
002100
002200 ENVIRONMENT DIVISION.
002300 CONFIGURATION SECTION.
002400 SOURCE-COMPUTER.  HP-3000.
002500 OBJECT-COMPUTER.  HP-3000.
002600
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
002900     SELECT REQ-FILE ASSIGN TO DISK-R3RRCVR.
003000
           SELECT MCORPREQ-O
                  ASSIGN TO DATABASE-MCFLCS5701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
003100
003200 DATA DIVISION.
003300 FILE SECTION.
003400
003500 FD  REQ-FILE
003600     LABEL RECORDS ARE OMITTED
003700     RECORD CONTAINS 20 CHARACTERS.
003800 01  REQ-RCD.
           05  R3FILE-REQNO              PIC X(12).
           05  R3FILE-STATUS             PIC XX.
           05  FILLER                    PIC X(6).

       FD  MCORPREQ-O
           LABEL RECORDS ARE STANDARD.
       01  MCORPREQ-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS5701.

004500 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

006300**************************************************************
006400**************************************************************
006500**                                                          **
006600**                DATABASE I/O BUFFER AREA                  **
006700**                                                          **
006800**************************************************************
006900**************************************************************
007000
007100 COPY MCORPREQ IN COPYLIB.
007400
008600 COPY DATAB    IN COPYLIB.
009100
009200 COPY TBLOWUP  IN COPYLIB.
009400
009500 PROCEDURE DIVISION.
009600
009700 PROC-DIV SECTION 01.
009800
009900
010000 1-BEGIN.
010100     PERFORM 1-HSK THRU 1-H-X.
010200
010300     PERFORM 6-MAIN THRU 6-M-X.
010400
010500     PERFORM 2-EOJ  THRU 2-EOJ-X.
010600
010700     GOBACK.
010800
010900
011000
011100 1-HSK.
           OPEN I-O MCORPREQ-O.
011600
011700 1-H-X.
011800     EXIT.
011900
012000
012100 2-EOJ.
           CLOSE MCORPREQ-O.
012600
012700 2-EOJ-X.
012800     EXIT.
012900
013000*********************************************
013100*                                           *
013200*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
013300*  FATAL ERROR OCCURS                       *
013400*                                           *
013500*********************************************
013600
013700 2-BLOWUP.
013800     MOVE  "TR3RRCVR"     TO  BU-PGM-NAME.
013900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
014000         DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
014100                 BU-DISPLAY-FLDS.
014200
014300 2-BLOWUP-X.
014400     EXIT.
014500
014600
014700**************************************************
014800*                                                *
014900*     6 - M A I N                                *
015000*                                                *
015100**************************************************
015200
015300
015400 6-MAIN.
015500     OPEN INPUT REQ-FILE.
015600     PERFORM 61-READ-MCORPREQ  THRU  61-RM-X.
015700     CLOSE REQ-FILE.
015800
015900 6-M-X.
016000     EXIT.
016100
016200
016300 61-READ-MCORPREQ.
017100     READ REQ-FILE AT END
017200         GO TO 61-RM-X.
017400     MOVE SPACES                  TO  BUF-MCORPREQ.
017500     MOVE R3FILE-REQNO            TO  MCORPREQ-REQ-NUMBER.
017600     MOVE R3FILE-STATUS           TO  MCORPREQ-REQ-STATUS.
017800
017900 61-PUT-MREQFILE.
           WRITE MCORPREQ-REC-O FROM BUF-MCORPREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "CANNOT WRITE ENTRY TO MCORPREQ"
                   TO BU-DISPLAY-MSG
               MOVE R3FILE-REQNO TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           GO TO 61-READ-MCORPREQ.
       61-RM-X.
           EXIT.
