       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRCCHECK.
       AUTHOR.     DAVE PLUM.
      **************************************************************
      *  THIS PROGRAM IS MODELED AFTER PROGRAM TUSCHECK.
      *
      *  THIS PROGRAM TELLS US WHETHER AND HOW THE RECEIPT FILE IS
      *  OUT OF SYNC WITH THE DATABASE - WHAT CORP CODES ARE ON THE
      *  DATABASE BUT NOT IN THE RECEIPT FILE, AND WHAT CORP CODES
      *  ARE IN THE RECEIPT FILE BUT NOT ON THE DATA BASE.
      **************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   HP-3000.
       OBJECT-COMPUTER.   HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT RECEIPT-I
                  ASSIGN TO DATABASE-MCFLCSRCPT
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT RECEIPT-O
                  ASSIGN TO DATABASE-MCFLCSRCPT
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  RECEIPT-I
           LABEL RECORDS ARE STANDARD.
       01  RECEIPT-REC-I.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

       FD  RECEIPT-O
           LABEL RECORDS ARE STANDARD.
       01  RECEIPT-REC-O.
           COPY DDS-MCRPCSRCPT  OF MCFLCSRCPT.

       WORKING-STORAGE SECTION.

       77  MCXCBLERR-SCOPE             PIC X(1)  VALUE "C".
       77  COUNT-RECEIPT-MISSING       PIC S9(7) VALUE +0.
       77  COUNT-RECEIPT-ADDED         PIC S9(7) VALUE +0.
       77  COUNT-RECEIPT-EXTRA         PIC S9(7) VALUE +0.
       77  COUNT-RECEIPT-DELETED       PIC S9(7) VALUE +0.
       77  SUB                         PIC 9(2)  VALUE ZERO.
       77  DISPLAY-COUNT               PIC Z,ZZZ,ZZ9-.

      **************************************************************
      **            D A T A B A S E   W O R K                     **
      **************************************************************
       COPY FILESTAT IN COPYLIB.

       01  CODE-ARG                   PIC X(8)  VALUE SPACES.

      **************************************************************
      **             D A T A B A S E   B U F F E R S              **
      **************************************************************

       01  RECEIPT-REC.
           05  R-CORP-CODE         PIC  X(8).
           05  R-MONTHS            OCCURS 14 TIMES.
               10  R-MTH-RECEIPTS  PIC S9(9)      COMP-4.

       COPY MSTORERM IN COPYLIB.

      **************************************************************
      **             C A L L E D   R O U T I N E S                **
      **************************************************************

       COPY TBLOWUP IN COPYLIB.
       COPY DBSTAT  IN COPYLIB.

       01  DUMMY-BASE                 PIC X(24) VALUE SPACES.

       LINKAGE SECTION.

      *******************************************************************
      * THIS PROGRAM UTILIZES 2 PASSED PARAMETERS:
      *    1) THE FIRST IS USED TO DETERMINE IF THE RECEIPTS FILE
      *       (MCFLCSRCPT) SHOULD BE UPDATED SO THAT IT HAS ONE
      *       RECORD FOR EACH OF THE CORPORATE CODES FOUND IN
      *       MSTORERM (MCFLCS0201).
      *          "Y" - WILL CAUSE THE RECEIPTS FILE TO BE UPDATED
      *          "N" - WILL CAUSE THE PROGRAM TO NOT UPDATE THIS FILE
      *                ("N" WILL BE USED AS THE DEFAULT IF AN IMPROPER
      *                 VALUE IS PASSED TO THIS PROGRAM.)
      *    2) THE SECOND IS USED TO DETERMINE IF DETAILED DISPLAY
      *       MESSAGES SHOULD BE PROVIDED OR NOT.
      *          "Y" - DETAILED DISPLAY MESSAGES WILL BE PROVIDED
      *                WHICH IDENTIFY HOW THE RECEIPTS FILE DIFFERS
      *                FROM THE MSTORERM FILE
      *          "N" - DETAILED DISPLAY MESSAGE WILL NOT BE PROVIDED.
      *                ONLY RECORD COUNTS WILL BE REPORTED.
      *                ("N" WILL BE USED AS THE DEFAULT IF AN IMPROPER
      *                 VALUE IS PASSED TO THIS PROGRAM.)
      ******************************************************************
       01  UPDATE-FILE-FLAG        PIC X(1).
       01  DISPLAY-DETAILS-FLAG    PIC X(1).

       PROCEDURE DIVISION USING UPDATE-FILE-FLAG,
                                DISPLAY-DETAILS-FLAG.

       MAIN-PROGRAM.
           PERFORM 1-HOUSEKEEPING.
           PERFORM 6-MAIN.
           PERFORM 2-END-OF-JOB.

       1-HOUSEKEEPING.
           MOVE +0 TO DISPLAY-COUNT.
           MOVE "TRCCHECK" TO BU-PGM-NAME.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN INPUT MSTORERM-I, RECEIPT-I.
           OPEN I-O   RECEIPT-O.

           IF UPDATE-FILE-FLAG = "Y" OR "N"
               NEXT SENTENCE
           ELSE
               DISPLAY "** INVALID UPDATE-FILE-FLAG PARM SPECIFIED **"
               DISPLAY "** PARM VALUE WILL BE SET TO 'N'           **"
               MOVE "N" TO UPDATE-FILE-FLAG.

           IF UPDATE-FILE-FLAG = "Y"
               DISPLAY "*** UPDATE-FILE-FLAG = 'Y'"
               DISPLAY "*** RECORDS WILL BE ADDED TO, AND DELETED FROM,"
               DISPLAY "*** THE RECEIPTS FILE SO THAT IT MATCHES THE   "
               DISPLAY "*** MSTORERM FILE RECORDS."
           ELSE
               DISPLAY "*** UPDATE-FILE-FLAG = 'N'"
               DISPLAY "*** THE RECEIPTS FILE WILL NOT BE UPDATED"
               DISPLAY "*** DURING THIS RUN.".

           IF DISPLAY-DETAILS-FLAG = "Y" OR "N"
               NEXT SENTENCE
           ELSE
               DISPLAY "** INVALID DISPLAY-DETAILS-FLAG PARM **"
               DISPLAY "** PARM VALUE WILL BE SET TO 'N'     **"
               MOVE "N" TO DISPLAY-DETAILS-FLAG.

           IF DISPLAY-DETAILS-FLAG = "Y"
               DISPLAY "*** DISPLAY-DETAILS-FLAG = 'Y'"
               DISPLAY "*** DETAILS REGARDING DIFFERENCES BETWEEN"
               DISPLAY "*** THE RECEIPTS FILE AND THE MSTORERM FILE"
               DISPLAY "*** WILL BE DISPLAYED."
           ELSE
               DISPLAY "*** DISPLAY-DETAILS-FLAG = 'N'"
               DISPLAY "*** NO DETAILS REGARDING THE DIFFERENCES"
               DISPLAY "*** BETWEEN THE RECEIPTS FILE AND THE MSTORERM"
               DISPLAY "*** FILE WILL BE DISPLAY.  ONLY RECORD COUNTS"
               DISPLAY "*** WILL BE DISPLAYED.".

           IF DISPLAY-DETAILS-FLAG = "Y"
               DISPLAY
                "** RECEIPT FILE SYNCHRONIZATION PROGRAM **"
               DISPLAY
                "STEP 1: CORP CODES IN MSTORERM WITH NO RECEIPT RECORD".

           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERROR - MSTORERM" TO BU-DISPLAY-MSG
               PERFORM 9-BLOWUP.

       2-END-OF-JOB.
           DISPLAY "PROGRAM TRCCHECK - PROCESSING COMPLETED".
           MOVE COUNT-RECEIPT-MISSING         TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF CODES MISSING FROM RECEIPT FILE = ",
              DISPLAY-COUNT
           MOVE COUNT-RECEIPT-EXTRA           TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF EXTRA RECS IN THE RECEIPT FILE  = ",
              DISPLAY-COUNT
           MOVE COUNT-RECEIPT-ADDED           TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF RECS ADDED TO RECEIPT FILE      = ",
              DISPLAY-COUNT
           MOVE COUNT-RECEIPT-DELETED         TO DISPLAY-COUNT.
           DISPLAY "NUMBER OF RECS DELETED FROM RECEIPT FILE  = ",
              DISPLAY-COUNT
           GOBACK.

       6-MAIN.
           PERFORM 61-READ-MSTORERM THRU 61-READ-MSTORERM-X.
           PERFORM 62-READ-RECEIPT THRU 62-READ-RECEIPT-FILE-X.

       61-READ-MSTORERM.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               IF DISPLAY-DETAILS-FLAG = "Y"
                   DISPLAY "STEP 1: COMPLETED"
               END-IF
               GO TO 61-READ-MSTORERM-X
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "READ NEXT ERROR - MSTORERM" TO BU-DISPLAY-MSG
                   PERFORM 9-BLOWUP.

           MOVE CORP-CODE TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF RECEIPT-REC-I.
           READ RECEIPT-I INTO RECEIPT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               ADD 1 TO COUNT-RECEIPT-MISSING
               IF UPDATE-FILE-FLAG = "Y"
                   PERFORM 611-PUT-CODE THRU 611-PC-X
               ELSE
                   IF DISPLAY-DETAILS-FLAG = "Y"
                       DISPLAY "CODE ", CODE-ARG
                   END-IF
               END-IF
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "READ ERROR - RECEIPT FILE" TO BU-DISPLAY-MSG
                   MOVE CORP-CODE TO BU-DISPLAY-FLD (1)
                   PERFORM 9-BLOWUP.

           GO TO 61-READ-MSTORERM.

       61-READ-MSTORERM-X.
           EXIT.

       611-PUT-CODE.
           MOVE CODE-ARG  TO  R-CORP-CODE.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 14
               MOVE +0 TO R-MTH-RECEIPTS (SUB)
           END-PERFORM.

           WRITE RECEIPT-REC-O FROM RECEIPT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "WRITE ERROR - RECEIPT FILE" TO BU-DISPLAY-MSG
               MOVE R-CORP-CODE TO BU-DISPLAY-FLD (1)
               PERFORM 9-BLOWUP
           ELSE
               ADD +1 TO COUNT-RECEIPT-ADDED
               IF DISPLAY-DETAILS-FLAG = "Y"
                   DISPLAY
                     "CODE ", R-CORP-CODE, " ADDED TO THE RECEIPT FILE".

       611-PC-X.
           EXIT.

       62-READ-RECEIPT.
           IF DISPLAY-DETAILS-FLAG = "Y"
               DISPLAY "STEP 2: RECEIPT RECORDS NOT FOUND IN MSTORERM".

           MOVE SPACES TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF RECEIPT-REC-I.
           START RECEIPT-I KEY >= CORPCDE OF RECEIPT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERROR - RECEIPT FILE" TO BU-DISPLAY-MSG
               PERFORM 9-BLOWUP.

       62-READ-RECEIPT-FILE.
           READ RECEIPT-O NEXT INTO RECEIPT-REC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               IF DISPLAY-DETAILS-FLAG = "Y"
                   DISPLAY "STEP 2: COMPLETED"
               END-IF
               GO TO 62-READ-RECEIPT-FILE-X
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "READ NEXT ERROR - RECEIPT FILE"
                     TO BU-DISPLAY-MSG
                   PERFORM 9-BLOWUP.

           MOVE R-CORP-CODE TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               ADD 1 TO COUNT-RECEIPT-EXTRA
               IF UPDATE-FILE-FLAG = "Y"
                   PERFORM 621-DELETE-CODE THRU 621-DC-X
               ELSE
                   IF DISPLAY-DETAILS-FLAG = "Y"
                       DISPLAY "CODE ", CODE-ARG
                   END-IF
               END-IF
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE "READ ERROR - MSTORERM" TO BU-DISPLAY-MSG
                   MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
                   PERFORM 9-BLOWUP.

           GO TO 62-READ-RECEIPT-FILE.

       62-READ-RECEIPT-FILE-X.
           EXIT.

       621-DELETE-CODE.
           MOVE CODE-ARG TO CORPCDE OF RECEIPT-REC-O.
           READ RECEIPT-O INTO RECEIPT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ ERROR - RECEIPT FILE * 621-D-C"
                 TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 9-BLOWUP.

           DELETE RECEIPT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DELETE ERROR - RECEIPT FILE" TO BU-DISPLAY-MSG
               MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
               PERFORM 9-BLOWUP
           ELSE
               ADD +1 TO COUNT-RECEIPT-DELETED
               IF DISPLAY-DETAILS-FLAG = "Y"
                   DISPLAY
                     "CODE ", R-CORP-CODE, "DELETED FROM RECEIPT FILE".

       621-DC-X.
           EXIT.

       9-BLOWUP.
           CALL "TBLOWUP" USING DUMMY-BASE, BU-PGM-NAME, STATUS-AREA,
               DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.
