       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TRCVINST.
       AUTHOR.              JEFF BUNGO.
       INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
       DATE-WRITTEN.        OCTOBER 31, 1996.
       DATE-COMPILED.
      *REMARKS.
      *************************************************************
      *************************************************************
      * COPIED FROM TDECOM, PO STANDARD INSTRUCTIONS FOR USE OF   *
      * HAVING RECEIVING SLIP SPECIAL INSTRUCTIONS.  THESE        *
      * INSTRUCTIONS WOULD BE SPECFIED BY CODE THROUGH MP1 OR ON  *
      * A PO ITEM.  THE STANDARD RECEIVING INSTRUCTIONS WOULD BE  *
      * PRINTED ON THE RECEIVING SLIP ONLY.                       *
      *                                                           *
      *                 T R C V I N S T                           *
      *                                                           *
      *     HANDLES ADD, MODIFY, DELETE, AND INQUIRY OF RECEIVING *
      *     INSTRUCTION COMMENTS.                                 *
      *                                                           *
      *     THIS PROGRAM DISPLAYS A MAIN MENU WITH THE            *
      *     FOLLOWING FUNCTIONS:                                  *
      *       1.  INQUIRY - ENTER COMMENT NUMBER AND SCROLL       *
      *                     THROUGHT COMMENTS.                    *
      *       2.  ADD     - ENTER INSTRUCTION NUMBER AND ADD      *
      *                     UNLIMITED NUMBER OF COMMENT LINES.    *
      *                     PRINT MAY BE EXPANDED, COMPRESSED,    *
      *                     OR REGULAR TYPE.                      *
      *                         DATABASE UPDATE:                  *
      *                           WRITE    - DCOMMENT             *
      *                           WRITE    - MCOMMENT             *
      *       3.  MODIFY  - ENTER INSTRUCTION NUMBER AND MODIFY   *
      *                     ANY OR ALL LINES, INCLUDING DELETION  *
      *                     AND ADDITION OF COMMENT LINES.        *
      *                     INSTRUCTION NUMBER AND PRINT TYPE     *
      *                     MAY NOT BE MODIFIED.                  *
      *                         DATABASE UPDATE:                  *
      *                           WRITE    - DCOMMENT             *
      *                           DELETE   - DCOMMENT             *
      *                           UPDATE   - DCOMMENT             *
      *       4.  DELETE  - ENTER INSTRUCTION NUMBER AND ALL      *
      *                     COMMENT LINES WILL BE DELETED FROM    *
      *                     THE DATABASE.                         *
      *                         DATABASE UPDATE:                  *
      *                           DELETE   - DCOMMENT             *
      *                           DELETE   - MCOMMENT             *
      *************************************************************
      *************************************************************
      *     CALLED PROGRAMS:                                      *
      *        1.  TBLOWUP -  ABORTS PROGRAM CLEANLY              *
      *        2.  TSCRPRT2 - PRINTS SCREEN CONTENTS              *
      *                                                           *
      *************************************************************
      *************************************************************

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS400.

       SPECIAL-NAMES.   I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MCOMMENT-O
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DCOMMENT-I
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DCOMMENT-O
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1801.

       FD  MCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1801.

       FD  DCOMMENT-I
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS1901.

       FD  DCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1901.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X VALUE SPACES.
           05  FILE-STATUS-2            PIC X VALUE SPACES.

       COPY IOFEEDBACK  OF COPYLIB.

       COPY CATREAD OF COPYLIB.

      *************************************************************
      *                    WORKING STORAGE SECTION                *
      *************************************************************
      *----------  USED TO CONVERT INSTRUCTION NUMBER INTO SEARCH ARG
      *----------  USE R AS THE PREFIX FOR RCVG INSTRUCTIONS
       01  BUILD-COMMENT-NO.
           05  BUILD-COM-PREFIX       PIC X       VALUE "R".
           05  BUILD-COM-NO           PIC X(3)    VALUE SPACES.
       01  FORM-NAME.
           05  FILLER                 PIC X(4)    VALUE "HELP".
           05  HELP-FORM-COUNTER      PIC 9(2)    VALUE ZEROES.
       01  DE1-FIELDS.
           05  DE1-MESSAGE-LINE       PIC X(79)   VALUE SPACES.

      *************************************************************
      *              WORK AREAS FOR INQUIRY FUNCTION              *
      *************************************************************

       01  COMMENT-HOLD-AREA.
           05  COMMENT-PAGE OCCURS 7 TIMES.
               10  COMMENT-LINE OCCURS 14 TIMES   PIC X(72).

       01  PAGE-CTR  PIC S9(4) COMP-4 VALUE ZEROS.
       01  CURRENT-PAGE-CTR PIC S9(4) COMP-4 VALUE ZEROS.
       01  LINE-CTR  PIC S9(4) COMP-4 VALUE ZEROS.


      *----------  FLAGS USED TO KEEP TRACK ON WHETHER THERE ARE
      *            MORE AND/OR PREVIOUS RECORDS TO DISPLAY.
       01  DATASET-PLACE                 PIC 9  VALUE 0.
           88  PREVIOUS-ONLY                    VALUE 1.
           88  MORE-ONLY                        VALUE 2.
           88  PREV-AND-MORE                    VALUE 3.
           88  NO-PREV-OR-MORE                  VALUE 4.

       01  COMPRESSED-PRINT        PIC X(5) VALUE "*CMP*".

       01  EXPANDED-PRINT          PIC X(5) VALUE "*EXP*".
      *************************************************************
      *             WORK AREAS FOR ADD FUNCTION                   *
      *************************************************************

      *----------  USED TO COMPARE IF PRINT TYPE HAS BEEN CHANGED
       01  SAVE-P                        PIC X  VALUE SPACE.

      *----------  SEQUENCE NUMBER FOR ADDING TO DCOMMENT
       01  SEQ-NO-SAVE                   PIC 9(4)  VALUE ZEROES.

      *----------  FLAGS FOR EXPANDED, COMPRESSED, AND REGULAR PRINT
       01  PRINT-FLAG                    PIC 9  VALUE 0.
           88  EXP-PRINT                        VALUE 1.
           88  COMP-PRINT                       VALUE 2.

      *----------  WORK AREA FOR ADD FUNCTION
       01  CONTINUE-FLAG                 PIC 9  VALUE 0.
           88  CONTINUING-INSTRUCTION           VALUE 1.
      *************************************************************
      *               WORK AREAS FOR MODIFY FUNCTION              *
      *************************************************************
      *----------  KEEPS TRACK OF NEXT LINE NUMBER TO STORE IN THE
      *            DATASET FOR WHEN NUMBERS GET OUT OF ORDER BY
      *            ADDING/DELETING COMMENT LINES.
       01  LINE-SAVE                     PIC 9(4)   VALUE ZEROES.

      *----------  SUBSCRIPT INTO MODIFY SCREEN BUFFER
       01  M                             PIC 9      VALUE ZEROS.
      *************************************************************
      *                 CALLED  ROUTINES                          *
      *************************************************************

      *---------- VSETERROR AND VPUTWINDOW
       01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
       01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
           05  MSG-BUFFER            PIC X(68).
           05  MSG-VALUE             PIC X(8).
       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.
       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0     COMP-4.
       01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.

      *--------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
      *--------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)

       COPY TBLOWUP IN COPYLIB.

       COPY DATAB IN COPYLIB.

       01  COMMENT-ARG       PIC X(4) VALUE SPACES.

       COPY MCOMMENT IN COPYLIB.

       COPY DCOMMENT IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY TSHWRDFM IN COPYLIB.

       01  SCREEN-BUFFER  PIC X(2000).

      *----------  FORM NAMES
       01  FORM-MAIN-MENU             PIC X(8)  VALUE "MAINMENU".
       01  FORM-INQUIRY               PIC X(07) VALUE "MAININQ".
       01  FORM-INQUIRE               PIC X(7)  VALUE "INQUIRE".
       01  FORM-ADD                   PIC X(3)  VALUE "ADD".
       01  FORM-MODIFY                PIC X(6)  VALUE "MODIFY".
       01  FORM-MOD-NUM               PIC X(10) VALUE "MODIFYNUM".
       01  FORM-DELETE                PIC X(6)  VALUE "DELETE".

      *----------  SCREEN BUFFERS
        01  SCREEN-MAIN-MENU.
            05  MAIN-COMMAND-LINE     PIC X(79).
            05  MAIN-MSG-LINE         PIC X(79).

       01  SCREEN-INQUIRY.
           05  INQUIRY-NUM            PIC X(3).
           05  INQUIRY-COMMAND-LINE   PIC X(79).
           05  INQUIRY-MSG-LINE       PIC X(79).

       01  SCREEN-INQUIRE.
           05  INQUIRE-PRINT          PIC X(16).
           05  INQUIRE-NUM            PIC X(3).
           05  INQUIRE-INSTRUCTIONS.
               10  INQUIRE-INSTR  OCCURS 14 TIMES INDEXED BY I
                                      PIC X(72).
           05  INQUIRE-CONTINUE       PIC X(72).
           05  INQUIRE-COMMAND-LINE   PIC X(79).
           05  INQUIRE-MSG-LINE       PIC X(79).

       01  SCREEN-ADD.
           05  ADD-NUM                PIC X(3).
           05  ADD-LINES OCCURS 4 TIMES INDEXED BY L.
               10  ADD-FIRST          PIC X(36).
               10  ADD-LAST           PIC X(36).
           05  ADD-X                  PIC X.
           05  ADD-P                  PIC X.
           05  ADD-COMMAND-LINE       PIC X(79).
           05  ADD-MSG-LINE           PIC X(79).

       01  SCREEN-MODIFY.
           05  MOD-NUM                PIC X(3).
           05  MOD-PRINT              PIC X(16).
           05  MOD-LINES OCCURS 4 TIMES.
               10  MOD-FIRST          PIC X(36).
               10  MOD-LAST           PIC X(36).
           05  MOD-X                  PIC X.
           05  MOD-COMMAND-LINE       PIC X(79).
           05  MOD-MSG-LINE           PIC X(79).

       01  SCREEN-MOD.
           05  SCREEN-MOD-NUM                 PIC X(3).
           05  SCREEN-MOD-COMMAND-LINE        PIC X(79).
           05  SCREEN-MOD-MSG-LINE            PIC X(79).

       01  SCREEN-DEL.
           05  SCREEN-DEL-NUM                 PIC X(3).
           05  SCREEN-DEL-COMMAND-LINE        PIC X(79).
           05  SCREEN-DEL-MSG-LINE            PIC X(79).

       COPY LANGUAGE IN COPYLIB.

      *************************************************************
      *                  PROCEDURE DIVISION                       *
      *      OPEN FILES.  DISPLAY MAIN MENU.  THE USER CAN        *
      *      CHOOSE TO PERFORM THE FOLLOWING FUNCTIONS:           *
      *      INQUIRY, ADD, MODIFY, DELETE, OR EXIT PROGRAM.       *
      *      THE DATABASE IS UPDATED FOR AN ADD, MODIFY, OR       *
      *      DELETE.  WHEN THE USER SELECTS EXIT, CLOSE FILES.    *
      *************************************************************
       PROCEDURE DIVISION.
       00-MAIN.
           PERFORM 010-OPEN-FILES THRU 019-EXIT.

           PERFORM 020-SELECT-FUNCTION THRU 029-EXIT.

           PERFORM 050-CLOSE-FILES THRU 059-EXIT.

           GOBACK.

      *************************************************************
      *************************************************************
      *                     OPEN FILES                            *
      *************************************************************
      *************************************************************
       010-OPEN-FILES.
           OPEN I-O MCOMMENT-O, DCOMMENT-O.
           OPEN INPUT MCOMMENT-I, DCOMMENT-I.
           MOVE "ZRCVINST" TO VIEW-CFNAME.

       019-EXIT.  EXIT.
      ***********************************************************
      ***********************************************************
      *         CLOSE ALL FILES AND INITIALIZE USER KEYS        *
      ***********************************************************
      ***********************************************************
       050-CLOSE-FILES.
           CLOSE MCOMMENT-I, DCOMMENT-I,
                 MCOMMENT-O, DCOMMENT-O.

       059-EXIT.  EXIT.
      *************************************************************
      *************************************************************
      *                SELECT FUNCTION                            *
      *                                                           *
      *     DISPLAY MAIN MENU.  THE FOLLOWING PARAGRAPHS ARE      *
      *     PERFORMED DEPENDING ON THE FUNCTION SELECTED:         *
      *                    100  -  INQUIRY                        *
      *                    200  -  ADD                            *
      *                    300  -  MODIFY                         *
      *                    400  -  DELETE                         *
      *************************************************************
      *************************************************************
       020-SELECT-FUNCTION.
           MOVE FORM-MAIN-MENU           TO VIEW-NFNAME.
           MOVE SPACES     TO SCREEN-MAIN-MENU.

       022-SHOW-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-MAIN-MENU TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-MAIN-MENU.

           IF VIEW-LASTKEY = 1
              PERFORM 100-INQUIRY THRU 199-EXIT
              GO TO 020-SELECT-FUNCTION.

           IF VIEW-LASTKEY = 2
              PERFORM 200-ADD     THRU 299-EXIT
              GO TO 020-SELECT-FUNCTION.

           IF VIEW-LASTKEY = 8
              PERFORM 300-MODIFY  THRU 399-EXIT
              GO TO 020-SELECT-FUNCTION.

           IF VIEW-LASTKEY = 4
              PERFORM 400-DELETE  THRU 499-EXIT
              GO TO 020-SELECT-FUNCTION.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 029-EXIT.

           IF VIEW-LASTKEY EQUAL 6  OR
              VIEW-LASTKEY EQUAL 7
      **        I9: INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO MAIN-MSG-LINE
               MOVE B"1"  TO IND(99)
               GO TO  022-SHOW-FORM.

           MOVE SPACES TO SCREEN-MAIN-MENU.
           GO TO 022-SHOW-FORM.

       029-EXIT.  EXIT.
      *************************************************************
      *************************************************************
      *                        I N Q U I R Y                      *
      *       ENTER INSTRUCTION NUMBER.  COMMENT LINES ARE        *
      *       DISPLAYED ALONG WITH PLANT TYPE.  DATASET POINTERS  *
      *       ARE KEPT IN CASE THERE ARE MORE COMMENTS TO DISPLAY *
      *       THAT CANNOT ALL FIT ONTO ONE SCREEN.                *
      *************************************************************
      *************************************************************
       100-INQUIRY.
           MOVE FORM-INQUIRY             TO VIEW-NFNAME.
           MOVE SPACES TO SCREEN-INQUIRY.

       105-SHOW-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-INQUIRY TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-INQUIRY.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 199-EXIT.

           IF VIEW-LASTKEY EQUAL 1 OR
              VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 8
      **        I9: INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER      TO INQUIRY-MSG-LINE
               MOVE 1 TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
               GO TO  105-SHOW-FORM.

      *---------- MAKE SURE INST. NUMBER IS ENTERED
           IF INQUIRY-NUM = SPACES
      **  INSTRUCTION NUMBER MUST BE ENTERED
               MOVE ZERO  TO LANG-SETNUM
               MOVE 40    TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  INQUIRY-MSG-LINE
               MOVE B"1"  TO IND(1), IND(99)
               GO TO 105-SHOW-FORM.

      *----------  VALIDATE THAT INSTRUCTION EXISTS
           MOVE INQUIRY-NUM              TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO         TO COMMENT-ARG.
           PERFORM 500-GET-MCOMMENT-I.
           IF NO-ENTRY
      **    I28: INSTRUCTION DOES NOT EXIST - CORRECT AND REENTER
              MOVE   9 TO LANG-SETNUM
              MOVE  28 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE 1   TO FIELD-NUMBER
              MOVE MESSAGE-BUFFER  TO INQUIRY-MSG-LINE
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              GO TO 105-SHOW-FORM.

           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 105 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE SPACES                   TO SCREEN-INQUIRE.
           MOVE INQUIRY-NUM              TO INQUIRE-NUM.
           MOVE SPACES                   TO COMMENT-HOLD-AREA.
           MOVE 1  TO PAGE-CTR, LINE-CTR, CURRENT-PAGE-CTR.
           SET I TO 1.
           MOVE ZEROS TO PRINT-FLAG.
           PERFORM 500-FIND-DCOMMENT-I.
           IF NO-ENTRY
               GO TO 125-SHOW-COMMENTS.

      *----------  READ FIRST LINE TO FIND OUT TYPE OF PRINT
           PERFORM 500-GET-DCOMMENT-I.

           IF NOT GOOD-CALL
              MOVE "READ1 DCOMMENT 105 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE 0 TO PRINT-FLAG.
           IF COMP-PRT-START = COMPRESSED-PRINT
               MOVE 2 TO PRINT-FLAG
               MOVE COMP-DATA-COMMENT  TO INQUIRE-INSTR (I)
                                          COMMENT-LINE (1, 1)
               MOVE   3 TO LANG-SETNUM
               MOVE 146 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO INQUIRE-PRINT
           ELSE
               IF EXP-PRT-START = EXPANDED-PRINT
                   MOVE 1 TO PRINT-FLAG
                   MOVE EXP-DATA-COMMENT  TO  INQUIRE-INSTR (I)
                                              COMMENT-LINE (1, 1)
                   MOVE   5 TO LANG-SETNUM
                   MOVE  41 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO INQUIRE-PRINT
               ELSE
                   MOVE DCOM-DATA-LINE  TO  INQUIRE-INSTR (I)
                                            COMMENT-LINE (1, 1)
                   MOVE  18 TO LANG-SETNUM
                   MOVE  78 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO INQUIRE-PRINT.

           PERFORM 140-LOAD-COMMENT-AREA  THRU 140-LCA-X.


       125-SHOW-COMMENTS.
           PERFORM 160-GET-RIGHT-MSG.

           MOVE FORM-INQUIRE TO VIEW-NFNAME.

       127-SHOW-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-INQUIRE TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-INQUIRE.

           IF VIEW-LASTKEY = 0
               GO TO 127-SHOW-FORM.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 199-EXIT.

           IF VIEW-LASTKEY EQUAL 1
              IF PREV-AND-MORE
                 SUBTRACT 1 FROM CURRENT-PAGE-CTR
                 MOVE COMMENT-PAGE (CURRENT-PAGE-CTR) TO
                     INQUIRE-INSTRUCTIONS
                 GO TO 125-SHOW-COMMENTS
              ELSE
                 IF PREVIOUS-ONLY
                     SUBTRACT 1 FROM CURRENT-PAGE-CTR
                     MOVE COMMENT-PAGE (CURRENT-PAGE-CTR) TO
                         INQUIRE-INSTRUCTIONS
                     GO TO 125-SHOW-COMMENTS.

           IF VIEW-LASTKEY EQUAL 2
              IF MORE-ONLY
                 ADD 1 TO CURRENT-PAGE-CTR
                 MOVE COMMENT-PAGE (CURRENT-PAGE-CTR) TO
                     INQUIRE-INSTRUCTIONS
                 GO TO 125-SHOW-COMMENTS
              ELSE
                 IF PREV-AND-MORE
                     ADD 1 TO CURRENT-PAGE-CTR
                     MOVE COMMENT-PAGE (CURRENT-PAGE-CTR) TO
                         INQUIRE-INSTRUCTIONS
                     GO TO 125-SHOW-COMMENTS.
           IF VIEW-LASTKEY EQUAL 7
              GO TO 100-INQUIRY.

      **    I9: INVALID FUNCTION KEY
           MOVE   9 TO LANG-SETNUM
           MOVE  10 TO LANG-MSGNUM
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO INQUIRE-MSG-LINE.
           MOVE 1 TO FIELD-NUMBER.
           MOVE B"1" TO IND(FIELD-NUMBER) IND(99).
           GO TO  127-SHOW-FORM.

       140-LOAD-COMMENT-AREA.
           PERFORM 500-GET-DCOMMENT-I.
           IF END-OF-CHAIN
               GO TO 140-LCA-X.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 14
               MOVE 1 TO LINE-CTR
               ADD 1 TO PAGE-CTR
               IF PAGE-CTR > 7
                   MOVE 7  TO PAGE-CTR
                   GO TO 140-LCA-X.

           IF EXP-PRINT
              MOVE EXP-DATA-COMMENT
                  TO COMMENT-LINE (PAGE-CTR, LINE-CTR)
           ELSE
              IF COMP-PRINT
                 MOVE COMP-DATA-COMMENT
                     TO COMMENT-LINE (PAGE-CTR, LINE-CTR)
              ELSE
                 MOVE DCOM-DATA-LINE
                     TO COMMENT-LINE (PAGE-CTR, LINE-CTR).

           IF PAGE-CTR = 1
               SET I UP BY 1
               IF EXP-PRINT
                   MOVE EXP-DATA-COMMENT TO INQUIRE-INSTR (I)
               ELSE
                   IF COMP-PRINT
                       MOVE COMP-DATA-COMMENT TO INQUIRE-INSTR (I)
                   ELSE
                       MOVE DCOM-DATA-LINE TO INQUIRE-INSTR (I).

           GO TO 140-LOAD-COMMENT-AREA.

       140-LCA-X.  EXIT.

       160-GET-RIGHT-MSG.
           MOVE SPACES TO INQUIRE-CONTINUE.
           MOVE 0 TO DATASET-PLACE.

           IF PAGE-CTR > CURRENT-PAGE-CTR
              IF CURRENT-PAGE-CTR = 1
      *----------- FORWARD KEY ONLY
                 MOVE   6 TO LANG-SETNUM
                 MOVE   4 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO INQUIRE-CONTINUE
                 MOVE 2 TO DATASET-PLACE
              ELSE
      *----------- PREV AND FORWARD KEY
                 MOVE   6 TO LANG-SETNUM
                 MOVE   5 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO INQUIRE-CONTINUE
                 MOVE 3 TO DATASET-PLACE.

           IF PAGE-CTR = CURRENT-PAGE-CTR
              IF PAGE-CTR = 1
      *------------ NO PREV OR FORWARD KEY
                 MOVE 4 TO DATASET-PLACE
              ELSE
      *------------ PREV KEY ONLY
                 MOVE   6 TO LANG-SETNUM
                 MOVE   6 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE MESSAGE-BUFFER TO INQUIRE-CONTINUE
                 MOVE 1 TO DATASET-PLACE.


       199-EXIT.  EXIT.
      *************************************************************
      *************************************************************
      *                    A D D                                  *
      *                                                           *
      *    ENTER INSTRUCTION NUMBER AND AS MANY COMMENTS AS       *
      *    NEEDED.  EXPANDED PRINT MAY ONLY USE THE FIRST         *
      *    36 CHARACTERS OF EACH LINE.  COMPRESSED AND REGULAR    *
      *    PRINT MAY USE 72 CHARACTERS PER LINE.                  *
      *************************************************************
      *************************************************************
       200-ADD.
           MOVE FORM-ADD                 TO VIEW-NFNAME.
           MOVE SPACES  TO SCREEN-ADD.

       205-SHOW-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-ADD TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-ADD.
           IF VIEW-LASTKEY EQUAL 3
               GO TO 299-EXIT.

           IF VIEW-LASTKEY = 1 OR
              VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 8
      **        I9: INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1 TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
               MOVE MESSAGE-BUFFER TO ADD-MSG-LINE
               GO TO  205-SHOW-FORM.

      *----------  IF ON A CONTINUING SCREEN, SKIP NUMBER VALIDATION
           IF CONTINUING-INSTRUCTION
              GO TO 210-EDIT-INPUT.

      *---------- MAKE SURE INST. NUMBER IS ENTERED
           IF ADD-NUM = SPACES
      **  INSTRUCTION NUMBER MUST BE ENTERED
               MOVE ZERO  TO LANG-SETNUM
               MOVE 40    TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  ADD-MSG-LINE
               MOVE B"1"  TO IND(1), IND(99)
               GO TO 205-SHOW-FORM.

      *---------- VALIDATE CONTINUATION INDICATOR
           IF ADD-X = " " OR "X"
               NEXT SENTENCE
           ELSE
      **  ENTER AN 'X' TO CONTINUE ENTERING STANDARD INSTRUCTIONS
               MOVE ZERO TO LANG-SETNUM
               MOVE 41   TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  ADD-MSG-LINE
               MOVE B"1"  TO IND(10), IND(99)
               GO TO 205-SHOW-FORM.

      *---------- VALIDATE PRINT SIZE INDICATOR
           IF ADD-P = " " OR "C" OR "E"
               NEXT SENTENCE
           ELSE
      **   VALID ENTRIES ARE 'B', 'C', OR ' '; CORRECT AND REENTER
               MOVE ZEROS TO LANG-SETNUM
               MOVE 42    TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  ADD-MSG-LINE
               MOVE B"1"  TO IND(11), IND(99)
               GO TO 205-SHOW-FORM.

      *----------  VALIDATE THAT INSTRUCTION DOES NOT ALREADY EXIST
           MOVE ADD-NUM                  TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO         TO COMMENT-ARG.
           PERFORM 500-GET-MCOMMENT-I.
           IF NO-ENTRY
              NEXT SENTENCE
           ELSE
              IF GOOD-CALL
      *  INSTRUCTION NUMBER ALREADY EXISTS - CORRECT AND REENTER
                 MOVE   9 TO LANG-SETNUM
                 MOVE  29 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE 1 TO FIELD-NUMBER
                 MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
                 MOVE MESSAGE-BUFFER TO ADD-MSG-LINE
                 GO TO 205-SHOW-FORM
              ELSE
                 MOVE "READ DCOMMENT 210 " TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP  THRU 999-EXIT.

       210-EDIT-INPUT.
      *----------  CHECK IF THEY ENTERED ANYTHING IN DESCRIPTION LINES
           IF CONTINUING-INSTRUCTION
              NEXT SENTENCE
           ELSE
           IF ADD-LINES (1)  = SPACES
              IF ADD-LINES (2) = SPACES
              IF ADD-LINES (3) = SPACES
              IF ADD-LINES (4) = SPACES
      *   AT LEAST ON INSTRUCTION MUST BE ENTERED
                  MOVE   1 TO LANG-SETNUM
                  MOVE   5 TO LANG-MSGNUM
                  PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                  MOVE 2 TO FIELD-NUMBER
                  MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
                  MOVE MESSAGE-BUFFER  TO ADD-MSG-LINE
                  GO TO 205-SHOW-FORM.
      *----------  IF CONTINUING TO ENTER LINES, INSTRUCTION NUMBER
      *            AND PRINT TYPE CANNOT BE CHANGED.
           IF CONTINUING-INSTRUCTION
              IF ADD-NUM NOT = BUILD-COM-NO
      *  INSTRUCTION NUMBER CANNOT BE CHANGED WHILE ADDING INSTRUCTIONS
                 MOVE   9 TO LANG-SETNUM
                 MOVE  30 TO LANG-MSGNUM
                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                 MOVE 1 TO FIELD-NUMBER
                 MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
                 MOVE MESSAGE-BUFFER  TO ADD-MSG-LINE
                 GO TO 205-SHOW-FORM.

           IF CONTINUING-INSTRUCTION
           IF ADD-P NOT = SAVE-P
      *  PRINT TYPE CANNOT BE CHANGED WHILE STILL ADDING INSTRUCTION NO
              MOVE  16 TO LANG-SETNUM
              MOVE  32 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE 11 TO FIELD-NUMBER
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              MOVE MESSAGE-BUFFER TO ADD-MSG-LINE
              GO TO 205-SHOW-FORM.

           IF NOT CONTINUING-INSTRUCTION
              MOVE ADD-P TO SAVE-P.

      *----------  CHECK MESSAGE LENGTH FOR TYPE OF PRINT
           IF ADD-P NOT = "E"
              GO TO 215-ADD-TO-DATABASE.
           MOVE 0 TO FIELD-NUMBER.
           IF ADD-LAST (1) NOT = SPACES
              MOVE 3 TO FIELD-NUMBER
           ELSE
              IF ADD-LAST (2) NOT = SPACES
                 MOVE 5 TO FIELD-NUMBER
              ELSE
                 IF ADD-LAST (3) NOT = SPACES
                    MOVE 7 TO FIELD-NUMBER
                 ELSE
                    IF ADD-LAST (4) NOT = SPACES
                       MOVE 9 TO FIELD-NUMBER.

           IF FIELD-NUMBER NOT = 0
      **   E10: EXPANDED PRINT CAN ONLY CONTAIN 36 CHARACTERS PER LINES
              MOVE   5 TO LANG-SETNUM
              MOVE  10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              MOVE MESSAGE-BUFFER TO ADD-MSG-LINE
              GO TO 205-SHOW-FORM.
      *----------  ADD COMMENT TO DATABASE.  IF THIS IS THE FIRST TIME
      *            THRU, ADD COMMENT TO MASTER DATASET MCOMMENT.  IF
      *            THIS IS A CONTINUING SCREEN, ADD ONLY TO DETAIL
      *            DATASET DCOMMENT.
       215-ADD-TO-DATABASE.
           IF CONTINUING-INSTRUCTION
              GO TO 220-DCOMMENT.

           MOVE BUILD-COMMENT-NO         TO MCOM-COMMENT-NO.
           MOVE ZEROS TO COND-WORD.
           WRITE MCOMMENT-REC-O FROM BUF-MCOMMENT.
           IF FILE-STATUS  NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "WRITE MCOMMENT 215 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZEROS TO SEQ-NO-SAVE.

      *-----------  ADD LINES TO DCOMMENT
       220-DCOMMENT.
           SET L TO 1.

      *----------  PUT INSTRUCTION INTO DCOMMENT ALONG WITH CORRECT
      *            ESCAPE SEQUENCE IF EXPANDED OR COMPRESSED PRINT.
       225-ADD-LINES.
           IF ADD-LINES (L) = SPACES
              GO TO 227-CHECK-IF-FINISHED.
           MOVE SPACES TO DCOM-DATA-LINE.
           IF ADD-P = "E"
              MOVE ADD-FIRST (L) TO EXP-DATA-COMMENT
              MOVE EXPANDED-PRINT TO EXP-PRT-START
           ELSE
              IF ADD-P = "C"
                 MOVE ADD-LINES (L) TO COMP-DATA-COMMENT
                 MOVE COMPRESSED-PRINT TO COMP-PRT-START
              ELSE
                 MOVE ADD-LINES (L) TO DCOM-DATA-LINE.
           MOVE BUILD-COMMENT-NO  TO DCOM-COMMENT-NO.
           ADD 1                  TO SEQ-NO-SAVE
           MOVE SEQ-NO-SAVE       TO DCOM-LINE-NO.

           MOVE ZEROS TO COND-WORD.
           WRITE DCOMMENT-REC-O FROM BUF-DCOMMENT.
           IF FILE-STATUS  NOT = "00"
                MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "WRITE DCOMMENT 225 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

      *----------  IF ALL 4 LINES HAVE BEEN ADDED, UNLOCK DATASET
       227-CHECK-IF-FINISHED.
           IF L = 4
              GO TO 230-UNLOCK.
           SET L UP BY 1.
           GO TO 225-ADD-LINES.

       230-UNLOCK.
      *----------  SET FLAG IF USER MARKED THE CONTINUE BOX
           IF ADD-X = "X"
              MOVE 1 TO CONTINUE-FLAG
           ELSE
              MOVE 0 TO CONTINUE-FLAG.

           IF CONTINUING-INSTRUCTION
               MOVE SPACES TO ADD-LINES (1), ADD-LINES (2),
                              ADD-LINES (3), ADD-LINES (4), ADD-X
      *  CONTINUE ENTERING INSTRUCTION CONTENT
               MOVE   3 TO LANG-SETNUM
               MOVE  39 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2 TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER)
               MOVE MESSAGE-BUFFER TO ADD-COMMAND-LINE
               GO TO 205-SHOW-FORM.

      *----------  NOT CONTINUING, SO ERASE SCREEN AND GET READY FOR
      *            A NEW INSTRUCTION
           MOVE ZEROES TO SEQ-NO-SAVE.
           MOVE SPACES TO SCREEN-ADD.
           GO TO 205-SHOW-FORM.

       299-EXIT. EXIT.
      *************************************************************
      *************************************************************
      *                    M O D I F Y                            *
      *                                                           *
      *       ENTER INSTRUCTION NUMBER AND VERIFY THAT IT         *
      *       EXISTS.  DISPLAY 4 COMMENT LINES AT A TIME.         *
      *       LINES MAY BE CHANGED, DELETED, OR ADDED.            *
      *************************************************************
      *************************************************************
       300-MODIFY.
           MOVE FORM-MOD-NUM TO VIEW-NFNAME.
           MOVE SPACES                        TO SCREEN-MOD.

       305-SHOW-NUM-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-MOD TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-MOD.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 399-EXIT.

           IF VIEW-LASTKEY EQUAL 1 OR
              VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 8
      **        I9: INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1                         TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
               MOVE MESSAGE-BUFFER  TO SCREEN-MOD-MSG-LINE
               GO TO  305-SHOW-NUM-FORM.

      *---------- MAKE SURE INST. NUMBER IS ENTERED
           IF SCREEN-MOD-NUM = SPACES
      **  INSTRUCTION NUMBER MUST BE ENTERED
               MOVE ZERO  TO LANG-SETNUM
               MOVE 40    TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  SCREEN-MOD-MSG-LINE
               MOVE B"1"  TO IND(1), IND(99)
               GO TO 305-SHOW-NUM-FORM.
      *----------  VALIDATE THAT INSTRUCTION EXISTS
           MOVE SCREEN-MOD-NUM           TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO         TO COMMENT-ARG.
           PERFORM 500-GET-MCOMMENT-I.
           IF NO-ENTRY
              MOVE   9 TO LANG-SETNUM
              MOVE  28 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE 1 TO FIELD-NUMBER
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              MOVE MESSAGE-BUFFER TO SCREEN-MOD-MSG-LINE
              GO TO 305-SHOW-NUM-FORM.

           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 305 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE SPACES TO SCREEN-MODIFY.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-I.
           READ MCOMMENT-I INTO BUF-MCOMMENT.
           MOVE SCREEN-MOD-NUM TO MOD-NUM.
           MOVE 1 TO M.
           MOVE 0 TO PRINT-FLAG.
           MOVE ZERO TO SEQ-NO-SAVE, LINE-SAVE.
      *----------  READ FIRST LINE TO FIND OUT TYPE OF PRINT
           PERFORM 500-FIND-DCOMMENT-I.
           IF NO-ENTRY
               GO TO 312-WRITE-SCREEN
           ELSE
               PERFORM 500-GET-DCOMMENT-I.

           IF NOT GOOD-CALL
              MOVE "READ1 DCOMMENT 305" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE 0 TO PRINT-FLAG.
           IF COMP-PRT-START = COMPRESSED-PRINT
               MOVE 2 TO PRINT-FLAG
               MOVE COMP-DATA-COMMENT  TO MOD-LINES (M)
               MOVE   3 TO LANG-SETNUM
               MOVE 146 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO MOD-PRINT
           ELSE
               IF EXP-PRT-START = EXPANDED-PRINT
                   MOVE 1 TO PRINT-FLAG
                   MOVE EXP-DATA-COMMENT  TO  MOD-FIRST (M)
                   MOVE   5 TO LANG-SETNUM
                   MOVE  41 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO MOD-PRINT
               ELSE
                   MOVE DCOM-DATA-LINE  TO  MOD-LINES (M)
                   MOVE  18 TO LANG-SETNUM
                   MOVE  78 TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO MOD-PRINT.

           ADD 1 TO M.

       310-GET-COMMENT-FOR-SCREEN.
           PERFORM 500-GET-DCOMMENT-I.
           IF FILE-STATUS = "46"
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              GO TO 312-WRITE-SCREEN.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 315" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           IF EXP-PRINT
              MOVE EXP-DATA-COMMENT TO MOD-FIRST (M)
           ELSE
              IF COMP-PRINT
                 MOVE COMP-DATA-COMMENT TO MOD-LINES (M)
              ELSE
                 MOVE DCOM-DATA-LINE TO MOD-LINES (M).

           ADD 1 TO M.
           IF M < 5
              GO TO 310-GET-COMMENT-FOR-SCREEN.

       312-WRITE-SCREEN.
           MOVE FORM-MODIFY TO VIEW-NFNAME.

       315-SHOW-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-MODIFY TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-MODIFY.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 399-EXIT.
           IF VIEW-LASTKEY = 1
               MOVE ZEROES TO HELP-FORM-COUNTER
               GO TO 312-WRITE-SCREEN.
           IF VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 8
      **        INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 2 TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
               MOVE MESSAGE-BUFFER TO MOD-MSG-LINE
               GO TO  315-SHOW-FORM.

           PERFORM 500-UPDATE-MCOMMENT.

      *----------  CHECK INSTRUCTION LENGTH FOR EXPANDED PRINT ONLY
           IF NOT EXP-PRINT
              GO TO 320-DBLOCK-COMMENT.
           MOVE 0 TO FIELD-NUMBER.
           IF MOD-LAST (1) NOT = SPACES
              MOVE 3 TO FIELD-NUMBER
           ELSE
              IF MOD-LAST (2) NOT = SPACES
                 MOVE 5 TO FIELD-NUMBER
              ELSE
                 IF MOD-LAST (3) NOT = SPACES
                    MOVE 7 TO FIELD-NUMBER
                 ELSE
                    IF MOD-LAST (4) NOT = SPACES
                       MOVE 9 TO FIELD-NUMBER.

           IF FIELD-NUMBER NOT = 0
      **   E10: EXPANDED PRINT CAN ONLY CONTAIN 36 CHARACTERS PER LINES
              MOVE   5 TO LANG-SETNUM
              MOVE  10 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              MOVE MESSAGE-BUFFER TO MOD-MSG-LINE
              GO TO 315-SHOW-FORM.

       320-DBLOCK-COMMENT.
           MOVE 0 TO M.
           PERFORM 390-FIND-COMMENT-LINE-NO THRU 391-EXIT.
           IF FILE-STATUS = "23"
               ADD 1 TO M
               GO TO 345-ADD-NEW-LINES.

      *----------  CHECK FOR CHANGES AS WELL AS ADDITIONAL LINES
      *            BEING ADDED.
       330-GET-CHANGES.
           ADD 1 TO M.
           IF M > 4
              GO TO 350-UNLOCK-DCOMMENT.
           MOVE ZEROS TO COND-WORD.
           READ DCOMMENT-O NEXT RECORD INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF COMMENT-ARG NOT = MCOMCOMMNT OF DCOMMENT-REC-O
               REWRITE DCOMMENT-REC-O  FROM BUF-DCOMMENT
               MOVE 15  TO COND-WORD.

           IF END-OF-CHAIN
              GO TO 345-ADD-NEW-LINES.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 330 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF EXP-PRINT
              IF EXP-DATA-COMMENT = MOD-FIRST (M)
                 GO TO 335-UPDATE-LINE
              ELSE
                 IF MOD-FIRST (M) = SPACES
                    GO TO 340-DELETE-LINE
                 ELSE
                    MOVE MOD-FIRST (M) TO EXP-DATA-COMMENT
                    GO TO 335-UPDATE-LINE.

           IF COMP-PRINT
              IF COMP-DATA-COMMENT = MOD-LINES (M)
                 GO TO 335-UPDATE-LINE
              ELSE
                 IF MOD-LINES (M) = SPACES
                    GO TO 340-DELETE-LINE
                 ELSE
                    MOVE MOD-LINES (M) TO COMP-DATA-COMMENT
                    GO TO 335-UPDATE-LINE.

      *----------  REGULAR PRINT
           IF DCOM-DATA-LINE = MOD-LINES (M)
                 GO TO 335-UPDATE-LINE
              ELSE
                 IF MOD-LINES (M) = SPACES
                    GO TO 340-DELETE-LINE
                 ELSE
                    MOVE MOD-LINES (M) TO DCOM-DATA-LINE
                    GO TO 335-UPDATE-LINE.

       335-UPDATE-LINE.
           MOVE DCOM-LINE-NO TO LINE-SAVE.
           MOVE 0 TO COND-WORD.
           REWRITE DCOMMENT-REC-O FROM BUF-DCOMMENT.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "REWRITE DCOMMENT 335 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           GO TO 330-GET-CHANGES.

       340-DELETE-LINE.
           MOVE ZEROS TO COND-WORD.
           DELETE DCOMMENT-O.
           IF FILE-STATUS NOT = "00"
              MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DELETE DCOMMENT 340 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.
           GO TO 330-GET-CHANGES.

       345-ADD-NEW-LINES.
      *----------  IF LINE = SPACES, SKIP IT AND CHECK THE NEXT ONE
           IF MOD-LINES (M) = SPACES
              GO TO 347-CONTINUE-ADD.

           ADD 1 TO LINE-SAVE.
           MOVE BUILD-COMMENT-NO  TO  DCOM-COMMENT-NO.
           MOVE LINE-SAVE         TO  DCOM-LINE-NO.
           MOVE SPACES            TO  DCOM-DATA-LINE.

           IF EXP-PRINT
              MOVE MOD-FIRST (M) TO EXP-DATA-COMMENT
              MOVE EXPANDED-PRINT  TO  EXP-PRT-START
           ELSE
              IF COMP-PRINT
                 MOVE MOD-LINES (M) TO COMP-DATA-COMMENT
                 MOVE COMPRESSED-PRINT  TO  COMP-PRT-START
              ELSE
                 MOVE MOD-LINES (M) TO DCOM-DATA-LINE.
            MOVE ZEROS TO COND-WORD.
            WRITE DCOMMENT-REC-O FROM BUF-DCOMMENT.
            IF FILE-STATUS NOT = "00"
                MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "WRITE DCOMMENT 345" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

       347-CONTINUE-ADD.
           ADD 1 TO M.
           IF M < 5
              GO TO 345-ADD-NEW-LINES.

      *************************************************************
      *            FINISHED UPDATING 4 COMMENT LINES.  CHECK      *
      *            IF THE NEXT SET OF 4 WERE REQUESTED TO BE      *
      *            DISPLAYED AND MODIFIED.                        *
      *************************************************************
       350-UNLOCK-DCOMMENT.
      *---------- CHECK IF USER MARKED THE CONTINUE BOX
           IF MOD-X = "X"
              MOVE LINE-SAVE TO SEQ-NO-SAVE
              MOVE 1 TO M
              MOVE SPACES TO MOD-LINES (1), MOD-LINES (2),
                             MOD-LINES (3), MOD-LINES (4), MOD-X
              PERFORM 392-FIND-COMMENT-LINE-NO THRU 393-EXIT
              GO TO 310-GET-COMMENT-FOR-SCREEN.

      *----------  DO NOT CONTINUE, SO ASK FOR NEW COMMENT NUMBER
           GO TO 300-MODIFY.

       390-FIND-COMMENT-LINE-NO.
           MOVE ZEROS TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O
               KEY IS EQUAL TO MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS  NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

           IF SEQ-NO-SAVE = ZEROS
              GO TO 391-EXIT.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 390 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

       390-GET-COMMENT.
           MOVE ZEROS TO COND-WORD.
           READ DCOMMENT-O NEXT RECORD INTO BUF-DCOMMENT
               AT END GO TO 391-EXIT.
           IF COMMENT-ARG NOT = MCOMCOMMNT OF DCOMMENT-REC-O
               MOVE 99  TO COND-WORD
               MOVE "COMMENT NOS. NOT EQUAL 390-GC" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 390" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF DCOM-LINE-NO = SEQ-NO-SAVE
              GO TO 391-EXIT.
           IF DCOM-LINE-NO < SEQ-NO-SAVE
              GO TO 390-GET-COMMENT.
           MOVE "* SEQ. NUMBER NOT FOUND AT 390"
                TO BU-DISPLAY-MSG
           PERFORM 990-BLOWUP THRU 999-EXIT.
       391-EXIT.  EXIT.

       392-FIND-COMMENT-LINE-NO.
           PERFORM 500-FIND-DCOMMENT-I.

           IF SEQ-NO-SAVE = ZEROS
               GO TO 393-EXIT.
           IF NOT GOOD-CALL
               MOVE "START DCOMMENT-I *392-FCLN" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.

       392-GET-COMMENT.
           PERFORM 500-GET-DCOMMENT-I.
           IF COMMENT-ARG NOT = MCOMCOMMNT OF DCOMMENT-REC-I
               MOVE "COMMENT NOS. NOT EQUAL 392-GC" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 392-GC" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           IF DCOM-LINE-NO = SEQ-NO-SAVE
              GO TO 393-EXIT.
           IF DCOM-LINE-NO < SEQ-NO-SAVE
              GO TO 392-GET-COMMENT.
           MOVE "* SEQ. NUMBER NOT FOUND AT 390"
                TO BU-DISPLAY-MSG
           PERFORM 990-BLOWUP THRU 999-EXIT.
       393-EXIT.  EXIT.

       399-EXIT. EXIT.

      *************************************************************
      *************************************************************
      *                    D E L E T E                            *
      *                                                           *
      *       ENTER INSTRUCTION NUMBER TO BE DELETED.  DELETE     *
      *       ALL ENTRIES FROM DCOMMMENT AND MCOMMENT DATASETS.   *
      *************************************************************
      *************************************************************
       400-DELETE.
           MOVE FORM-DELETE TO VIEW-NFNAME.
           MOVE SPACES  TO SCREEN-DEL.

       405-SHOW-DELETE-FORM.
           MOVE 3 TO SRF-MODE.
           MOVE SCREEN-DEL TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-DEL.

           IF VIEW-LASTKEY EQUAL 3
               GO TO 499-EXIT.

           IF VIEW-LASTKEY EQUAL 1 OR
              VIEW-LASTKEY EQUAL 2 OR
              VIEW-LASTKEY EQUAL 4 OR
              VIEW-LASTKEY EQUAL 5 OR
              VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 7 OR
              VIEW-LASTKEY EQUAL 8
      **         I9: INVALID FUNCTION KEY
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 1 TO FIELD-NUMBER
               MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
               MOVE MESSAGE-BUFFER TO SCREEN-DEL-MSG-LINE
               GO TO  405-SHOW-DELETE-FORM.

      *---------- MAKE SURE INST. NUMBER IS ENTERED
           IF SCREEN-DEL-NUM = SPACES
      **  INSTRUCTION NUMBER MUST BE ENTERED
               MOVE ZERO  TO LANG-SETNUM
               MOVE 40    TO LANG-MSGNUM
               PERFORM 999-CATREAD  THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  SCREEN-DEL-MSG-LINE
               MOVE B"1"  TO IND(1), IND(99)
               GO TO 405-SHOW-DELETE-FORM.

      *----------  VALIDATE THAT INSTRUCTION EXISTS
           MOVE SCREEN-DEL-NUM           TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO         TO COMMENT-ARG.
           MOVE ZEROS                         TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O
              KEY IS EQUAL TO MCOMCOMMNT OF DCOMMENT-REC-O
              INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS  NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NO-ENTRY
              MOVE   9 TO LANG-SETNUM
              MOVE  28 TO LANG-MSGNUM
              PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
              MOVE MESSAGE-BUFFER  TO SCREEN-DEL-MSG-LINE
              MOVE 1 TO FIELD-NUMBER
              MOVE B"1" TO IND(FIELD-NUMBER) IND(99)
              GO TO 405-SHOW-DELETE-FORM.

           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 405" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

      **  N40: NOW PROCESSING P.O. INSTRUCTION DELETE
           MOVE  14 TO LANG-SETNUM
           MOVE  40 TO LANG-MSGNUM
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-DEL-COMMAND-LINE.
           MOVE 4 TO SRF-MODE.
           MOVE SCREEN-DEL TO SCREEN-BUFFER.
           CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
               VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
               LANGUAGE-PARMS, SCREEN-BUFFER.

      *----------  DELETE DCOMMENT
       410-DELETE-DCOMMENT.
           MOVE ZEROS TO COND-WORD.
           READ DCOMMENT-O NEXT RECORD INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF DCOM-COMMENT-NO NOT = COMMENT-ARG
               REWRITE DCOMMENT-REC-O FROM BUF-DCOMMENT
               MOVE 15 TO COND-WORD.
           IF END-OF-CHAIN
              GO TO 415-UNLOCK-DCOMMENT.
           IF NOT GOOD-CALL
              MOVE "READ DCOMMENT 410 " TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZEROS TO COND-WORD.
           DELETE DCOMMENT-O.
           IF FILE-STATUS NOT = "00"
               MOVE 99  TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DELETE DCOMMENT 410" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           GO TO 410-DELETE-DCOMMENT.

       415-UNLOCK-DCOMMENT.
           MOVE COMMENT-ARG  TO MCOMCOMMNT OF MCOMMENT-REC-O.
           MOVE ZERO TO COND-WORD.
           READ MCOMMENT-O INTO BUF-MCOMMENT
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS  NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "READ MCOMMENT 415" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE ZEROS TO COND-WORD.
           DELETE MCOMMENT-O.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
           IF NOT GOOD-CALL
              MOVE "DELETE MCOMMENT 415" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           GO TO 400-DELETE.

       499-EXIT.  EXIT.

       500-GET-MCOMMENT-I.
           MOVE COMMENT-ARG  TO MCOMCOMMNT OF MCOMMENT-REC-I.
           MOVE ZERO TO COND-WORD.
           READ MCOMMENT-I INTO BUF-MCOMMENT
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS  NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

       500-FIND-DCOMMENT-I.
           MOVE ZEROS TO COND-WORD.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-I.
           START DCOMMENT-I
               KEY IS EQUAL TO MCOMCOMMNT OF DCOMMENT-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS  NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

       500-GET-DCOMMENT-I.
           MOVE ZEROS TO COND-WORD.
           READ DCOMMENT-I NEXT RECORD INTO BUF-DCOMMENT
               AT END MOVE 15 TO COND-WORD.
           IF COMMENT-ARG NOT = MCOMCOMMNT OF DCOMMENT-REC-I
               MOVE 15  TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "1"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.


      ************************************************************
      ************************************************************
      *                    B L O W U P                           *
      *     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
      *     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
      *     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
      *                                                          *
      *     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
      *     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
      *                                                          *
      *         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
      ************************************************************
      ************************************************************
       990-BLOWUP.
           MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
           MOVE COMMENT-ARG TO BU-DISPLAY-FLD (2).
           MOVE "TRCVINST" TO BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS TO COND-WORD.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.
       999-EXIT.  EXIT.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM  TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM  TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT  TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.

       500-UPDATE-MCOMMENT.
           MOVE MOD-NUM           TO BUILD-COM-NO.
           MOVE BUILD-COMMENT-NO  TO MCOMCOMMNT OF MCOMMENT-REC-O.
           READ MCOMMENT-O INTO BUF-MCOMMENT.
           IF FILE-STATUS = "00"
               REWRITE MCOMMENT-REC-O FROM BUF-MCOMMENT
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE FAILED IN 500-UPDATE-MCOMMENT"
                       TO BU-DISPLAY-MSG
                   PERFORM 990-BLOWUP THRU 999-EXIT
               ELSE
               NEXT SENTENCE
           ELSE
           MOVE "READ FAILED IN 500-UPDATE-MCOMMENT"
               TO BU-DISPLAY-MSG
           PERFORM 990-BLOWUP THRU 999-EXIT.
      *    UNLOCK MCOMMENT RECORD SINCE I-O READ ABOVE
           REWRITE MCOMMENT-REC-O FROM BUF-MCOMMENT.
