       IDENTIFICATION DIVISION.
       PROGRAM-ID.         TRELINQ.
       AUTHOR.             CA YODER.
       DATE-WRITTEN.       JANUARY 1996.
       DATE-COMPILED.
      *INSTALLATION.       GOODYEAR TIRE & RUBBER CO.

      *D* REMARKS.
      *D*
      *D*   THIS PROGRAM DISPLAYS THE RECORDS IN THE SHIPPING RELEASE
      *D*   AUDIT FILE (MCFPCS6100).  IT ALSO ALLOWS THE USER TO PRINT
      *D*   A REPORT OF THE AUDIT FILE.  THE DISPLAY FILE IS ZRELINQ.
      *D*
      *C* CHANGES
      *C*
      *C* 12/10/1997    CA YODER
      *C*   Y2K TESTING FOUND THAT THE EUROPEAN DATE WAS NOT HANDLED
      *C*   PROPERLY IN THIS PROGRAM.  CORRECTED PROBLEM USING TDATECHK.
      *C*

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

       SOURCE-COMPUTER.          IBM-AS400.
       OBJECT-COMPUTER.          IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN         TO WORKSTATION-ZRELINQ-SI
               ORGANIZATION   IS TRANSACTION
               ACCESS         IS DYNAMIC
               RELATIVE KEY   IS REC-COUNT
               FILE STATUS    IS DISPLAY-STATUS
               CONTROL-AREA   IS WS-CONTROL.

           SELECT DRELTRAK-DT-I
               ASSIGN         TO DATABASE-MCFLCS6101
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                              WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

           SELECT DRELTRAK-PO-I
               ASSIGN         TO DATABASE-MCFLCS6102
               ORGANIZATION   IS INDEXED
               ACCESS MODE    IS DYNAMIC
               RECORD KEY     IS EXTERNALLY-DESCRIBED-KEY
                              WITH DUPLICATES
               FILE STATUS    IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(2000).

       FD  DRELTRAK-DT-I
           LABEL RECORDS ARE STANDARD.
       01  DRELTRAK-DT-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6101.

       FD  DRELTRAK-PO-I
           LABEL RECORDS ARE STANDARD.
       01  DRELTRAK-PO-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS6102.

       WORKING-STORAGE SECTION.

      *-----------------------------------------------------------------
      *                   B U F F E R S
      *-----------------------------------------------------------------

      *--- BUFFER FOR FIRST DISPLAY SCREEN.
       01  DE-BUF.
           05  DE-INQ-OPT1          PIC X.
           05  DE-PO-NUM            PIC X(7).
           05  DE-INQ-OPT2          PIC X.
           05  DE-INQ-DATE.
               10  DE-INQ-MM        PIC X(2).
               10  DE-INQ-DD        PIC X(2).
               10  DE-INQ-YY        PIC X(2).
           05  DE-RPT-OPT           PIC X.
           05  DE-RPT-DATE.
               10  DE-RPT-MM        PIC X(2).
               10  DE-RPT-DD        PIC X(2).
               10  DE-RPT-YY        PIC X(2).
           05  DE-ROUTE-NAME        PIC X(20).
           05  DE-MSGLINE           PIC X(78).

      *--- BUFFER FOR SUBFILE SCREEN LINE 1.
       01  BUF-SCREEN.
           05  SC-DATE              PIC X(8).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-USER              PIC X(8).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-PO.
               10  SC-PO-NUM        PIC X(7).
               10  HYPH-1           PIC X.
               10  SC-PO-RLSE       PIC X(3).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-CODE              PIC X(8).
           05  FILLER               PIC X(1) VALUE SPACES.
           05  SC-ORD-VEND          PIC X(7).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-ORD-PRICE         PIC ZZZZ9.99.
           05  SC-ERROR-1  REDEFINES SC-ORD-PRICE
                                    PIC X(8).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-LOW-VEND          PIC X(7).
           05  FILLER               PIC X(2) VALUE SPACES.
           05  SC-LOW-PRICE         PIC ZZZZ9.99.
           05  SC-ERROR-2  REDEFINES SC-LOW-PRICE
                                    PIC X(8).

       COPY DRELTRAK      OF COPYLIB.

       01  BUF-PO-NUM.
           05  FILLER               PIC X.
           05  BUF-PO               PIC X(7).
           05  BUF-REL              PIC X(3).
           05  BUF-RCVR             PIC X(3).

       01  DATE-HOLD.
           05  HOLD-MM              PIC X(2).
           05  HOLD-DD              PIC X(2).
           05  HOLD-YY              PIC X(2).

       01  CONTROL-FIELDS.
           05  CF-REPORT-TYPE       PIC X.
           05  CF-DATE              PIC X(8).
           05  CF-ROUTE-NAME        PIC X(20).

      *-----------------------------------------------------------------
      *         S W I T C H E S / C O U N T E R S
      *-----------------------------------------------------------------

       01  DRELTRAK-EOF-SW         PIC X  VALUE "N".

       01  REC-COUNT               PIC 9(5) VALUE 0.

       01  NUM-OPTIONS             PIC 9    VALUE 0.

      *-----------------------------------------------------------------
      *          D A T A B A S E   S T A T U S   A R E A
      *-----------------------------------------------------------------

       01  FILE-STATUS.
           05  FILE-STATUS-1        PIC X.
           05  FILE-STATUS-2        PIC X.

       COPY DATAB    OF COPYLIB.

      *-----------------------------------------------------------------
      *               U T I L I T Y   A R E A
      *-----------------------------------------------------------------

       COPY CATREAD OF COPYLIB.

       COPY TBLOWUP OF COPYLIB.

       COPY VCOMAREA OF COPYLIB.

       COPY CSTRMJB2 OF COPYLIB.

       01  WS-CONTROL.
           05  FUNCTION-KEY         PIC X(2).
               88  ENTER-KEY-USED            VALUE "00".
               88  F1-KEY-USED               VALUE "01".
               88  F2-KEY-USED               VALUE "02".
               88  F3-KEY-USED               VALUE "03".
               88  F4-KEY-USED               VALUE "04".
               88  F5-KEY-USED               VALUE "05".
               88  F6-KEY-USED               VALUE "06".
               88  F7-KEY-USED               VALUE "07".
               88  F8-KEY-USED               VALUE "08".
               88  F9-KEY-USED               VALUE "09".
               88  F10-KEY-USED              VALUE "10".
               88  F11-KEY-USED              VALUE "11".
               88  F12-KEY-USED              VALUE "12".
               88  ROLLUP-KEY-USED           VALUE "RU".
           05  TERMINAL-ID          PIC X(10).
           05  FORMAT-NAME          PIC X(10).

       01  DISPLAY-STATUS           PIC X(2).

       01  SRF-INDICATORS.
           05  IND                  PIC 1
                                    OCCURS 99 TIMES
                                    INDICATOR 1.
               88  IND-OFF          VALUE B"0".
               88  IND-ON           VALUE B"1".

       01  OFF-SWITCH               PIC 1  VALUE B"0".
       01  ON-SWITCH                PIC 1  VALUE B"1".

       01  PO-ARG.
           05  ARG-PREFIX           PIC X.
           05  ARG-PO               PIC X(7).
           05  ARG-RLSE             PIC X(3).
           05  ARG-RCVR             PIC X(3).

       01  DATE-ARG.
           05  ARG-CC               PIC X(2).
           05  ARG-YMD.
               10  ARG-YY           PIC X(2).
               10  ARG-MM           PIC X(2).
               10  ARG-DD           PIC X(2).

       COPY TDATECHK IN COPYLIB.

      *-----------------------------------------------------------------
      *          P R O C E D U R E   D I V I S I O N
      *-----------------------------------------------------------------

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
           PERFORM 2-EOJ.
           GOBACK.

       1-HSK.
           OPEN INPUT     DRELTRAK-DT-I
                          DRELTRAK-PO-I
                I-O       DISPLAY-FILE.

       2-EOJ.
           CLOSE          DRELTRAK-DT-I
                          DRELTRAK-PO-I
                          DISPLAY-FILE.


       6-MAIN SECTION.

       6-BEGIN.
           INITIALIZE DISPLAY-REC.

       6-DISPLAY-SCREEN.

      *--- SHOW FIRST SCREEN WHERE DATA IS ENTERED.
           WRITE DISPLAY-REC FORMAT IS "RELSCRN"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SCREEN WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           READ DISPLAY-FILE
               FORMAT IS "RELSCRN"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SCREEN" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.
           MOVE DISPLAY-REC    TO DE-BUF.

       6-CHECK-ERRORS.
           IF F3-KEY-USED
               GO TO 6-MAIN-X.

      *------- CHOOSE ONLY ONE OPTION.
           MOVE 0 TO NUM-OPTIONS.
           IF DE-INQ-OPT1 = "X"    ADD 1 TO NUM-OPTIONS.
           IF DE-INQ-OPT2 = "X"    ADD 1 TO NUM-OPTIONS.
           IF DE-RPT-OPT  = "X"    ADD 1 TO NUM-OPTIONS.
           IF NUM-OPTIONS > 1
      *       ***  CHOOSE ONLY ONE OPTION ***
               MOVE 03072 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH      TO  IND (60)
                                       IND (20)  IND (22)  IND (26)
               MOVE DE-BUF         TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           IF NUM-OPTIONS = 0
      *       ***  CHOOSE AN OPTION ***
               MOVE 25030 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH      TO  IND (60)
                                       IND (20)  IND (22)  IND (26)
               MOVE DE-BUF         TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           IF DE-INQ-OPT1 = "X" AND DE-PO-NUM NOT = SPACES
               MOVE "P"                 TO  ARG-PREFIX
               MOVE DE-PO-NUM           TO  ARG-PO
               MOVE "000"               TO  ARG-RLSE
                                            ARG-RCVR
           ELSE
               MOVE SPACES              TO  PO-ARG.

           INITIALIZE DATE-ARG
                      DATE-CHECK-AREA.

      *------- VALIDATE DATES.
           IF (DE-INQ-OPT2 = "X" AND DE-INQ-DATE NOT = SPACES) OR
              (DE-RPT-OPT  = "X" AND DE-RPT-DATE NOT = SPACES)
               IF DE-INQ-OPT2 = "X"
                   MOVE DE-INQ-DATE     TO  DATE-VALIDATE-IN
               ELSE
                   MOVE DE-RPT-DATE     TO  DATE-VALIDATE-IN
               END-IF
               MOVE 3                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               IF DATE-MSG NOT = SPACES
                   MOVE DATE-MSG        TO  DE-MSGLINE
                   MOVE ON-SWITCH  TO  IND (60)
                   IF DE-INQ-OPT2 = "X"
                       MOVE ON-SWITCH   TO  IND (23) IND (24) IND (25)
                   ELSE
                       MOVE ON-SWITCH   TO  IND (27) IND (28) IND (29)
                   END-IF
                   MOVE DE-BUF          TO  DISPLAY-REC
                   GO TO 6-DISPLAY-SCREEN
               ELSE
                   MOVE DATE-YMD-OUT    TO  DATE-HOLD
                                            ARG-YMD
                   IF ARG-YY < "90"
                       MOVE "20"        TO  ARG-CC
                   ELSE
                       MOVE "19"        TO  ARG-CC
                   END-IF
               END-IF
           END-IF.

           IF DE-RPT-OPT = "X" AND DE-ROUTE-NAME = SPACES
      *       ***  ENTER ROUTING INFORMATION ***
               MOVE 05102 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH   TO  IND (30) IND (60)
               MOVE DE-BUF          TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

      *------- START JOB TO PRINT REPORT.
           IF DE-RPT-OPT = "X"
               MOVE DATE-ARG        TO  CF-DATE
               MOVE "O"             TO  CF-REPORT-TYPE
               MOVE DE-ROUTE-NAME   TO  CF-ROUTE-NAME
               MOVE "BRELTOP"       TO  CSTRM-TOP-FILE
               MOVE "BRELBOT"       TO  CSTRM-BOTTOM-FILE
               MOVE CONTROL-FIELDS  TO  CSTRM-RUN-CARD (1)
               CALL "CSTRMJB2" USING CSTRMJB2-PARMS, VIEW-COMAREA
               INITIALIZE DE-BUF
      *       ***  REPORT PRINTED ***
               MOVE 18092 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH       TO  IND (60)
               MOVE DE-BUF          TO  DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

       60-LOAD-SCREEN.

           INITIALIZE REC-COUNT.

      *---- SHOW SFLCTL (71) AND CLEAR SFL (72), BUT DON'T SHOW IT (70).

           MOVE ON-SWITCH    TO IND (71)  IND (72).
           MOVE OFF-SWITCH   TO IND (70).

           WRITE SUBFILE DISPLAY-REC FROM BUF-SCREEN
               FORMAT IS "RELSFLC"
               INDICATORS ARE SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON INIT SFL WRITE" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.

      *-------- TURN CLEAR SFL OFF.

           MOVE OFF-SWITCH TO IND (72).

       61-GET-LIST.

           INITIALIZE BUF-SCREEN.
           PERFORM 64-LIST-RECORDS.

       62-SHOW-SCREEN.

      *--- SHOW FUNCTION KEYS.
           WRITE DISPLAY-REC
               FORMAT IS "RELREC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.

           MOVE ON-SWITCH TO IND (70)  IND (71)  IND (73).

      *--- WRITE THE SUBFILE TO SCREEN.
           WRITE SUBFILE DISPLAY-REC
               FORMAT IS "RELSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON SHOW SFL WRITE" TO BU-DISPLAY-MSG
               MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
               MOVE DISPLAY-STATUS TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP.

      *--- WAIT FOR USER TO PRESS A KEY.
           READ DISPLAY-FILE
               FORMAT IS "RELSFLC"
               INDICATORS ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF DISPLAY-STATUS NOT = "00"
               MOVE "PROBLEM ON READ SFL" TO BU-DISPLAY-MSG
               GO TO 9999-BLOWUP.


       63-ACTION.

      *--- THE ENTER KEY IS TREATED THE SAME AS PRESSING THE F3 KEY.
           IF F3-KEY-USED OR ENTER-KEY-USED
               MOVE "N" TO DRELTRAK-EOF-SW
               GO TO 6-BEGIN.

       64-LIST-RECORDS.

           MOVE "N" TO DRELTRAK-EOF-SW.

           IF DE-INQ-OPT1 = "X"
               IF DE-INQ-OPT1 = SPACES
                   PERFORM 9999-READ-FIRST-DRELTRAK-PO
               ELSE
                   PERFORM 9999-START-DRELTRAK-PO
                   IF FILE-STATUS NOT = "00"
                       MOVE "Y" TO DRELTRAK-EOF-SW
                   END-IF
               END-IF
               IF DRELTRAK-EOF-SW = "N"
                   PERFORM 9999-READ-NEXT-DRELTRAK-PO.

           IF DE-INQ-OPT2 = "X"
               IF DE-INQ-OPT2 = SPACES
                   PERFORM 9999-READ-FIRST-DRELTRAK-DT
               ELSE
                   PERFORM 9999-START-DRELTRAK-DT
                   IF FILE-STATUS NOT = "00"
                       MOVE "Y" TO DRELTRAK-EOF-SW
                   END-IF
               END-IF
               IF DRELTRAK-EOF-SW = "N"
                   PERFORM 9999-READ-NEXT-DRELTRAK-DT.

           IF DRELTRAK-EOF-SW = "Y"
               INITIALIZE DE-BUF
      *       ***  NO DATA TO DISPLAY ***
               MOVE 14129 TO CATREAD-MSG-NUMBER
               PERFORM 9999-CATREAD
               MOVE CATREAD-MSG-TEXT TO DE-MSGLINE
               MOVE ON-SWITCH             TO IND (60)
               MOVE DE-BUF                TO DISPLAY-REC
               GO TO 6-DISPLAY-SCREEN.

           PERFORM UNTIL DRELTRAK-EOF-SW = "Y"
      *------- MOVE FIELDS TO DISPLAY RECORD.

               MOVE TREL-PO               TO SC-PO-NUM
               MOVE TREL-RLSE             TO SC-PO-RLSE
               MOVE TREL-CODE             TO SC-CODE
               MOVE TREL-VENDOR           TO SC-ORD-VEND
               MOVE TREL-LOW-VENDOR       TO SC-LOW-VEND
               MOVE TREL-USER-NAME        TO SC-USER
               MOVE 4                     TO DATE-MODE
               MOVE TREL-DATE-YMD         TO DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT        TO SC-DATE
               MOVE "-"                   TO HYPH-1

      *------- IF THE PRICE IS GREATER THAN THE DISPLAY FIELD SIZE,
      *------- PRINT AN ERROR MESSAGE.
               IF TREL-PRICE > 99999.99
                   MOVE "**OVER**"        TO SC-ERROR-1
               ELSE
                   MOVE TREL-PRICE        TO SC-ORD-PRICE
               END-IF
               IF TREL-LOW-PRICE > 99999.99
                   MOVE "**OVER**"        TO SC-ERROR-2
               ELSE
                   MOVE TREL-LOW-PRICE    TO SC-LOW-PRICE
               END-IF

      *------- MOVE THE SCREEN BUFFER AND WRITE OUT.
               MOVE BUF-SCREEN            TO DISPLAY-REC
               ADD 1                      TO REC-COUNT
               IF REC-COUNT > 9999
                   MOVE "SUBFILE TOO SMALL-INCREASE ZRELINQ"
                       TO BU-DISPLAY-MSG
                   MOVE REC-COUNT TO BU-DISPLAY-FLD (1)
                   GO TO 9999-BLOWUP
               END-IF
               WRITE SUBFILE DISPLAY-REC
                   FORMAT IS "RELSFL"
                   INDICATORS ARE SRF-INDICATORS
               IF DISPLAY-STATUS NOT = "00"
                   MOVE "SUBFILE WRITE ERROR" TO BU-DISPLAY-MSG
                   MOVE REC-COUNT        TO BU-DISPLAY-FLD (1)
                   MOVE DISPLAY-STATUS   TO BU-DISPLAY-FLD (2)
               GO TO 9999-BLOWUP
               END-IF

      *------- GET THE NEXT DRELTRAK RECORD.
               IF DE-INQ-OPT1 = "X"
                   PERFORM 9999-READ-NEXT-DRELTRAK-PO
               ELSE
                   PERFORM 9999-READ-NEXT-DRELTRAK-DT
               END-IF
               INITIALIZE BUF-SCREEN
           END-PERFORM.

       6-MAIN-X.
           EXIT.

       9999-UTILITY SECTION.

       9999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

      *--- READS FOR DRELTRAK WITH PO AS THE KEY
       9999-READ-FIRST-DRELTRAK-PO.
           READ DRELTRAK-PO-I FIRST INTO BUF-DRELTRAK
               AT END MOVE "Y" TO DRELTRAK-EOF-SW.

       9999-READ-NEXT-DRELTRAK-PO.
           READ DRELTRAK-PO-I NEXT INTO BUF-DRELTRAK
               AT END MOVE "Y" TO DRELTRAK-EOF-SW.

       9999-START-DRELTRAK-PO.
           MOVE PO-ARG TO PORCVNO OF DRELTRAK-PO-REC.
           START DRELTRAK-PO-I KEY >= PORCVNO OF DRELTRAK-PO-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

      *--- READS FOR DRELTRAK WITH DATE AS THE KEY
       9999-READ-FIRST-DRELTRAK-DT.
           READ DRELTRAK-DT-I FIRST INTO BUF-DRELTRAK
               AT END MOVE "Y" TO DRELTRAK-EOF-SW.

       9999-READ-NEXT-DRELTRAK-DT.
           READ DRELTRAK-DT-I NEXT INTO BUF-DRELTRAK
               AT END MOVE "Y" TO DRELTRAK-EOF-SW.

       9999-START-DRELTRAK-DT.
           MOVE DATE-ARG TO DATECYMD OF DRELTRAK-DT-REC.
           START DRELTRAK-DT-I KEY >= DATECYMD OF DRELTRAK-DT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-BLOWUP.
           MOVE "TRELINQ" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.
