000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TREPAUTH.
000400*REMARKS.    THIS PROGRAM CALCULATES OVERAGE BASED ON
      *D           REPAIR ITEM COSTS.
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER. AS400.
000800 OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DPOITEM-FILE
               ASSIGN TO DATABASE-MCFLCS1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM-FILE
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
001900     SELECT SORT-FILE
               ASSIGN TO DISK-SORTFILE.
000900 DATA DIVISION.
       FILE SECTION.
       FD  DPOITEM-FILE
           LABEL RECORDS ARE STANDARD.
       01  DF-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS1001.
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-FILE
           LABEL RECORDS ARE STANDARD.
       01  MF-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.
       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE               PIC X(132).
008000 SD  SORT-FILE
008100     RECORD CONTAINS 42 CHARACTERS
008200     DATA RECORD IS SORTF.
008300 01  SORTF.
008400     05  SORT-DEPT                PIC X(4).
           05  SORT-CORP-CODE           PIC X(8).
           05  SORT-OVERAGE-AMTS        PIC S9(7)V9.
           05  SORT-OVERAGE-DOLLARS     PIC S9(14)V99.
           05  SORT-ONORDER             PIC 9(6).
001000 WORKING-STORAGE SECTION.
       77  HANDLE-BLOWUP-FLAG           PIC X(1)  VALUE "Y".
       77  LINE-CTR                     PIC 99.
       77  RECDS-CTR                    PIC 9(5).
       77  SAVE-CODE                    PIC X(8)   VALUE SPACES.
       77  SAVE-DEPT                    PIC X(4)   VALUE SPACES.
       77  TOTAL-OVERAGE-AMTS           PIC 9(7)V9.
       77  TOTAL-OVERAGE-DOLLARS        PIC 9(12)V99.
001300 01  BLOWUP-BASE                  PIC X(16).
       01  CDATE.
           05 YY                        PIC 99.
           05 MM                        PIC 99.
           05 DD                        PIC 99.
       COPY DATAB    IN COPYLIB.
       01  DDATE.
           05 DMM                       PIC 99.
           05 FILLER                    PIC X      VALUE "/".
           05 DDD                       PIC 99.
           05 FILLER                    PIC X      VALUE "/".
           05 DYY                       PIC 99.
       01  DETAIL-1.
           05  FILLER                   PIC X(2)   VALUE SPACES.
           05  D-DEPT                   PIC X(6)   VALUE SPACES.
           05  FILLER                   PIC X(2)   VALUE SPACES.
           05  D-CODE                   PIC X(8)   VALUE SPACES.
           05  FILLER                   PIC X(10)  VALUE SPACES.
           05  D-OVERAGE-AMTS           PIC Z(4)9.9.
           05  FILLER                   PIC X(10).
           05  D-OVERAGE-DOLLARS        PIC $$$,$$$,$$9.99.
           05  FILLER                   PIC X(10)  VALUE SPACES.
           05  D-ONORDER                PIC Z(5)9.
           05  FILLER                   PIC X(3)   VALUE SPACES.
       01  DETAIL-2.
           05  FILLER                   PIC X      VALUE SPACES.
           05  FILLER                   PIC X(8)   VALUE "TOTALS: ".
           05  D-RCDS-2                 PIC Z(5).
           05  FILLER                   PIC X(6)   VALUE " CODES".
           05  FILLER                   PIC X      VALUE SPACE.
           05  D-OVG-AMTS-2             PIC Z(7).9.
           05  FILLER                   PIC X(6)   VALUE SPACES.
           05  D-OVG-DOLLARS-2          PIC $$$,$$$,$$$,$$9.99.
           05  FILLER                   PIC X(26)  VALUE SPACES.
       COPY DPOITEM  IN COPYLIB.
       01  FILE-STATUS                  PIC XX.
       01  HEADER-0.
           05  FILLER                   PIC X(10)  VALUE SPACES.
           05  FILLER                   PIC X(27)
               VALUE "REPAIR PARTS WHICH REQUIRE ".
           05  FILLER                   PIC X(18)
               VALUE "AUTHORIZATION FLAG".
           05  FILLER                   PIC X(17) VALUE SPACES.
           05  H0-DATE                  PIC X(8)  VALUE SPACES.
       01  HEADER-1.
           05  FILLER                   PIC X(2)  VALUE SPACES.
           05  FILLER                   PIC X(6)  VALUE "DEPT  ".
           05  FILLER                   PIC X(2)  VALUE SPACES.
           05  FILLER                   PIC X(8)  VALUE "CORPCODE".
           05  FILLER                   PIC X(10) VALUE SPACES.
           05  FILLER                   PIC X(7)  VALUE "OVERAGE".
           05  FILLER                   PIC X(13) VALUE SPACES.
           05  FILLER                   PIC X(8)  VALUE "$OVERAGE".
           05  FILLER                   PIC X(12) VALUE SPACES.
           05  FILLER                   PIC X(6)  VALUE "ONORDR".
           05  FILLER                   PIC X(3)  VALUE SPACES.
       01  HEADER-U.
           05  FILLER                   PIC X(80) VALUE ALL "-".
       COPY IOFEEDBACK IN COPYLIB.
003800 COPY LANGSUB    IN COPYLIB.
       COPY MPLTINFO   IN COPYLIB.
       COPY MSTORERM   IN COPYLIB.
       01  OVERAGE-DOLLARS              PIC S9(9)V99.
       01  OVERAGE-WA                   PIC S9(7).

       COPY OVRPFDATA  IN COPYLIB.
004900 COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       COPY VCOMLINK   IN COPYLIB.
008200 01  CODE-ARG                      PIC X(8).
       01  PLT-ARG                       PIC X(4)  VALUE SPACES.
008300
008400 COPY SONORDER IN COPYLIB.
008500
008600 01  COMPANY-SAVE.
008700     05  COMPANY-SAVE-1-2          PIC X(2).
008800         88  AKRON-PLANT                     VALUE "11".
008900     05  FILLER                    PIC X(1).
009000
005200 PROCEDURE DIVISION.
005300 START-PGM SECTION.
       BEGIN-PGM.
005400     PERFORM 1-HSK.
005500     PERFORM 6-MAIN THRU 6-MAIN-X.
005600 2-EOJ.
           CLOSE DPOITEM-FILE.
           CLOSE MPLTINFO-PK-I.
           CLOSE MSTORERM-FILE.
           CLOSE ONLINE-PRT.
006000     GOBACK.
023200 2-BLOWUP.
023300     MOVE "TREPAUTH" TO BU-PGM-NAME.
023400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
023500                      VIEW-COMAREA DUMMY-KSAM-STAT
023600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
006100 1-HSK.
           OPEN INPUT  DPOITEM-FILE.
           OPEN INPUT  MPLTINFO-PK-I.
           OPEN INPUT  MSTORERM-FILE.
           MOVE "MCPRT"          TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           ACCEPT CDATE          FROM DATE.
           MOVE CDATE            TO H0-DATE.
           MOVE MM               TO DMM.
           MOVE DD               TO DDD.
           MOVE YY               TO DYY.
           MOVE 59               TO LINE-CTR.
           MOVE 0                TO RECDS-CTR.
           MOVE "P 01"           TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE MPLTINFO-COMPANY TO  COMPANY-SAVE.
           MOVE ZEROES           TO TOTAL-OVERAGE-AMTS,
                                    TOTAL-OVERAGE-DOLLARS.

       COPY OVRPFCALL IN COPYLIB.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2-BLOWUP.

       6-MAIN.
064800     SORT SORT-FILE ON ASCENDING KEY SORT-DEPT,
                                            SORT-CORP-CODE
065000         INPUT PROCEDURE  7-SORT-RECORDS
065100         OUTPUT PROCEDURE 8-WRITE-OUTPUT.
       6-MAIN-X.    EXIT.

       7-SORT-RECORDS SECTION.
       7-SR.
           READ MSTORERM-FILE NEXT INTO BUF-MSTORERM
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
           IF COND-WORD = 11 GO TO 7-SR-X.
           IF CORP-CODE = "NON-STR " GO TO 7-SORT-RECORDS.
           IF STR-OUT-REPAIR-COST = ZEROES GO TO 7-SR.
           MOVE CORP-CODE          TO CODE-ARG.
           MOVE "Y"                TO SONORDER-CALC-DIR-ORD-SW.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SONORDER" USING BASE,
                                 CODE-ARG,
                                 SONORDER-PARMS,
                                 COMPANY-SAVE,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2-BLOWUP.
           IF COMPANY-SAVE-1-2 = "11"
               COMPUTE OVERAGE-WA = (STR-ONHAND + SONORDER-TOTAL-ONORDER)
                   - STR-MAX)
               MULTIPLY OVERAGE-WA BY STR-AVG-COST
                   GIVING OVERAGE-DOLLARS ROUNDED
           ELSE
           COMPUTE OVERAGE-WA = (STR-ONHAND + SONORDER-STR-ONORDER)
               - STR-MAX
           MULTIPLY OVERAGE-WA BY STR-AVG-COST GIVING OVERAGE-DOLLARS
               ROUNDED.
           IF OVERAGE-DOLLARS < 1.01 GO TO 7-SR.
           ADD 1                     TO RECDS-CTR.
           ADD OVERAGE-WA            TO TOTAL-OVERAGE-AMTS.
           ADD OVERAGE-DOLLARS       TO TOTAL-OVERAGE-DOLLARS.
           MOVE STR-DFLT-DEPT        TO SORT-DEPT.
           MOVE CORP-CODE            TO SORT-CORP-CODE.
           MOVE OVERAGE-WA           TO SORT-OVERAGE-AMTS.
           MOVE OVERAGE-DOLLARS      TO SORT-OVERAGE-DOLLARS.
           IF COMPANY-SAVE-1-2 = "11"
               MOVE SONORDER-TOTAL-ONORDER TO SORT-ONORDER
           ELSE
           MOVE SONORDER-STR-ONORDER TO SORT-ONORDER.
           RELEASE SORTF.
           GO TO 7-SR.

014100 7-SR-X.    EXIT.

       8-WRITE-OUTPUT SECTION.
       8-WO.
150100     RETURN SORT-FILE AT END GO TO 8-WO-END.
           IF SORT-DEPT NOT = SAVE-DEPT
               MOVE SORT-DEPT         TO SAVE-DEPT
               WRITE PRINT-RCD FROM HEADER-0 AFTER
                   ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
               MOVE 5                 TO LINE-CTR
               MOVE SORT-DEPT         TO D-DEPT
           ELSE
           MOVE SPACES                TO D-DEPT.
           MOVE SORT-CORP-CODE        TO D-CODE.
           MOVE SORT-OVERAGE-AMTS     TO D-OVERAGE-AMTS.
           MOVE SORT-OVERAGE-DOLLARS  TO D-OVERAGE-DOLLARS.
           MOVE SORT-ONORDER          TO D-ONORDER.
           ADD 1                      TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER
                   ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
               WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 2
               MOVE 5 TO LINE-CTR
           ELSE
           WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 2.
           GO TO 8-WO.
       8-WO-END.
           MOVE RECDS-CTR             TO D-RCDS-2.
           MOVE TOTAL-OVERAGE-AMTS    TO D-OVG-AMTS-2.
           MOVE TOTAL-OVERAGE-DOLLARS TO D-OVG-DOLLARS-2.
           ADD 1                      TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER
                   ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING 1
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
               WRITE PRINT-RCD FROM DETAIL-2 AFTER ADVANCING 2
               GO TO 8-WO-X
           ELSE
           WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1
           WRITE PRINT-RCD FROM DETAIL-2 AFTER ADVANCING 2.
       8-WO-X.    EXIT.
