000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TREQFILU.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        8/1/83.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.   THIS SUBPROGRAM UPDATES PROVIDES THE INTERFACE TO THE
001000*           REQUISITION SYSTEM FROM ANY PROGRAMS THAT ISSUE FROM
001100*           OR RETURN TO STOREROOM ONHAND.  IT UPDATES THE REQFILE
001200*           BASED ON BEGINNING ONHAND AND ENDING ONHAND.
001300*
001400*    THE FOLLOWING ARE THE TYPES OF SITUATIONS THAT OCCUR AND
001500*    WHAT THIS SUBPROGRAM DOES FOR EACH:
001600*    NOTE - OPTIONS IN PARENTHESES - LIKE ("E") - SHOULD NEVER
001700*    OCCUR.
001800*
001900*    ISSUE TYPE 1       .          .
002000*                       :          :
002100*                    ---:----------:-------
002200*                       :          :
002300*                       V          :
002400*                                  :
002500*                    ______________:_______
002600*                                  :
002700*                                  V
002800*
002900*         A.  NOT EXIST  -   ADD WITH " " FLAG
003000*         B.  EXIST WITH "R" FLAG       -  DELETE
003100*         C.  EXIST WITH ("E") OR ("A") -  REWRITE WITH " "
003200*
003300*
003400*    ISSUE TYPE 2
003500*                    ______________________
003600*
003700*
003800*                                  .
003900*                                  :
004000*                    --------------:-------
004100*                                  :
004200*                                  V
004300*
004400*        A.  NOT EXIST                  -  ADD WITH "E" FLAG
004500*        B.  EXIST WITH ("R")           -  REWRITE WITH "E"
004600*        C.  EXIST WITH ("E"), " ", "A" -  LEAVE ALONE
004700*
004800*
004900*    RETURN TYPE 1      ¬          ¬
005000*                       :          :
005100*                    ---:----------:-------
005200*                       :          :
005300*                       .          :
005400*                                  :
005500*                    --------------:-------
005600*                                  .
005700*
005800*        A.  NOT EXIST                  -  ADD WITH "R"
005900*        B.  EXIST WITH "E", OR "A"     -  REWRITE WITH "R"
006000*        C.  EXIST WITH " ", OR ("R")   -  DELETE
006100*
006200*
006300*    RETURN TYPE 2   ----------------------
006400*
006500*                                  ¬
006600*                                  :
006700*                    --------------:-------
006800*                                  :
006900*                                  .
007000*
007100*        A.  NOT EXIST                  -  NO ACTION
007200*        B.  EXIST WITH "E", OR ("R")   -  DELETE
007300*        C.  EXIST WITH " ", OR "A"     -  NO ACTION
007400*
007500*
007600*    ACTIVITY BELOW REORDER  ---------------------
007700*                               .
007800*                               :
007900*                               V
008000*                            ---------------------
008100*                                         .
008200*                                         :
008300*                                         V
008400*
008500*        A.  NOT EXIST                  -  ADD WITH "A"
008600*        B.  EXIST                      -  NO ACTION
008700*
008800*
008900*    ON FEBRUARY 10, 1984, CHANGED THIS SUBPROGRAM TO UPDATE
009000*    REQFILE ON THE BASIS OF AVAILABLE (ONHAND - RESERVED)
009100*    RATHER THAN ONHAND ONLY.  TO ACHEIVE THIS, CALLING PGMS MUST
009200*    NOW PASS THE RESERVED QTY BEFORE THE TRANSACTION AND THE
009300*    RESERVED QTY AFTER THE TRANSACTION IN ADDITION TO OTHER
009400*    PARAMETERS. CIH.
009500*
009600*    ON FEB 10, 1984, CHANGED THE KSAM ERROR RETURN.
009700*    PREVIOUSLY, ON KSAM ERRORS, THE SUBPROGRAM RETURNED KSAM
009800*    STATUS IN RETURN CODE AND "RESULT" (IN CASE OF FILE SYSTEM
009900*    ERRORS) IN "DE-CODE".  NOW IT SIMPLY RETURNS KSAM STATUS
010000*    IN RET-CODE.  "TBLOWUP" WILL HANDLE THE CONVERSION IN
010100*    CASE OF FILE SYSTEM ERRORS (K-STAT-1 = "9").  CIH.
010200*
010300*    ON AUGUST 30, 1984, CHANGED THE OPENING AND CLOSING
010400*    PROCEDURES FOR "REQFILE".  A RET-CODE PASSED OF "01"
010500*    STILL MEANS TO OPEN AN CLOSE EACH TIME.  BUT NOW THE
010600*    DEFAULT (RET-CODE = ANYTHING BUT "01") WILL BE TO
010700*    OPEN THE FILE IF THE PASSED FILENUMBER IS 0, OTHERWISE
010800*    DO NOT OPEN THE FILE.  IF THE FILE IS OPENED, THE FILE NUMBER
010900*    IS NOW RETURNED.  THUS YOU CAN CALL THE SUBPROG, AND ON THE
011000*    FIRST CALL THE FILE WILL BE OPENED, AND ON ALL SUBSEQUENT
011100*    CALLS THE FILE WILL NOT BE OPENED.  CIH.
011200*
011300*    ON SEPT 7, 1984, ADDED A BASE PARAMETER TO THIS PROGRAM.
011400*    THIS BASE PARAMETER WILL BE IGNORED FOR NOW.  WHEN WE
011500*    CONVERT THE "REQFILE" DATA FROM THE KSAM FILE TO A
011600*    DATABASE SEGMENT, THIS SUBPROGRAM WILL BE CHANGED TO
011700*    UPDATE THE DATABASE, AND ALL PROGRAMS WILL ALREADY BE
011800*    PASSING THE BASE PARAMETER.  SINCE THIS SUBPROG IS IN THE
011900*    ACCOUNT SL, NO CALLING PROGRAMS WILL HAVE TO BE
012000*    RECOMPILED.  CIH.
012100*
012200*    ON APRIL 18, 1985, CHANGED THIS SUBPROGRAM TO UPDATE THE
012300*    DATASET "MREQFILE" IN THE "STORES" DATABASE, RATHER THAN
012400*    THE KSAM FILE "REQFILE". THIS CAN BE INSTALLED BY UPDATING
012500*    THE ACCOUNT SL IN EACH PLANT.  THE INSTALLATION MUST BE
012600*    DONE IN CONJUCTION WITH THE UPDATED REQUISITION PROGRAMS.
012700*    CIH.
      *C
      *C   JUNE 25, 1996  JEFF BUNGO
      *C     NAPANEE ONLY REQUEST!  CREATE A RECORD IN MCFPCS2800
      *C     FOR EVERY ISSUE OF A CODE TO CREATE A REQUISITION.
      *C
      *C   APRIL 28, 1997 JIM COFFMAN
      *C     ADD CODE TO NOT WRITE ANY MREQFILE/MCFPCS2800 RECORDS.
      *C     AN MA1 WAS ACCIDENTALLY EXECUTED CUTTING A SLEW OF
      *C     REQUISITIONS LOOSE (TYLER ONLY).
012800*
012900 ENVIRONMENT DIVISION.
013000 CONFIGURATION SECTION.
013100 SOURCE-COMPUTER.  HP-3000.
013200 OBJECT-COMPUTER.  HP-3000.
013300 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MREQFILE
                  ASSIGN TO DATABASE-MCFLCS2801
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS MREQFILE-STATUS.
      *-------NAPANEE ONLY CODE TO CREATE REQ ON EACH ISSUE
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS MREQFILE-STATUS.
      *-------END NAPANEE ONLY CODE------------------------

013400 DATA DIVISION.
       FILE SECTION.
       FD  MREQFILE
           LABEL RECORDS ARE STANDARD.
       01  MREQFILE-REC.
           COPY DDS-MCRPCS2800  OF MCFLCS2801.
      *-------NAPANEE ONLY CODE TO CREATE REQ ON EACH ISSUE
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
      *-------END NAPANEE ONLY CODE------------------------

013500 WORKING-STORAGE SECTION.
013600
013700 77  ISS-RET-FLAG                  PIC X(1).
013800 77  SAVE-RET-CODE                 PIC X(2).
013900 77  REQ-UPDATE-TYPE               PIC 9(1)  VALUE 0.
014000 77  AVAIL-BEFORE                  PIC S9(8) VALUE 0.
014100 77  AVAIL-AFTER                   PIC S9(8) VALUE 0.
014200 77  COND-WORD-9                   PIC 9(2)  VALUE 0.
014300
014400**************************************************************
014500**                                                          **
014600**             D A T A B A S E   W O R K                    **
014700**                                                          **
014800**************************************************************
014900
015000 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
015100 01  ST-CODE-ARG                   PIC X(8)  VALUE SPACES.
015200
015300 01  DSET-NAMES.
015400     05  DSET-MREQFILE             PIC X(16) VALUE "MREQFILE;".
015500
015600 COPY DBSTAT     IN COPYLIB.
015700
015800 01  MODE-AREA.
015900     05  MODE1                     PIC S9(4)   COMP-4     VALUE 1.
016000     05  MODE3                     PIC S9(4)   COMP-4     VALUE 3.
016100     05  MODE5                     PIC S9(4)   COMP-4     VALUE 5.
016200     05  MODE7                     PIC S9(4)   COMP-4     VALUE 7.
016300
016400 01  ITEM-LISTINGS.
016500     05  ALL-ITEMS                 PIC X(2)   VALUE "@;".
016600
       01  MREQFILE-STATUS               PIC X(2).

016700**************************************************************
016800**                                                          **
016900**              D A T A B A S E   B U F F E R S             **
017000**                                                          **
017100**************************************************************
017200
017300 COPY MREQFILE IN COPYLIB.
      *-------NAPANEE ONLY CODE TO CREATE REQ ON EACH ISSUE
       COPY MPLT0 IN COPYLIB.
       COPY MPLTP01 IN COPYLIB.
      *-------END OF NAPANEE ONLY CODE---------------------
017400**************************************************************
017500**                                                          **
017600**                L I N K A G E   S E C T I O N             **
017700**                                                          **
017800**************************************************************
017900
018000 LINKAGE SECTION.
018100
018200 01  RET-CODE                      PIC X(2).
018300 01  BASE                          PIC X(10).
018400 01  PASSED-FILE-NUMBER            PIC S9(4) COMP-4.
018500 01  DE-CODE.
018600     05  DE-CODE-1-7               PIC X(7).
018700     05  DE-CODE-8                 PIC X(1).
018800 01  SAVE-ONHAND-BEFORE            PIC S9(8).
018900 01  SAVE-RSRVD-BEFORE             PIC S9(8).
019000 01  STR-ONHAND                    PIC S9(8) COMP-4.
019100 01  STR-RESERVED                  PIC S9(8) COMP-4.
019200 01  STR-REORDER                   PIC S9(8) COMP-4.
019300 01  STR-EXPEDITE                  PIC S9(8) COMP-4.
019400
019500 PROCEDURE DIVISION USING RET-CODE, BASE, PASSED-FILE-NUMBER,
019600     DE-CODE, SAVE-ONHAND-BEFORE, SAVE-RSRVD-BEFORE, STR-ONHAND,
019700     STR-RESERVED, STR-REORDER, STR-EXPEDITE.
019800
019900 6-MAIN.
           OPEN I-O MREQFILE.

020000     MOVE RET-CODE                 TO  SAVE-RET-CODE.
020100     MOVE "00"                     TO  RET-CODE.
020200     MOVE 0                        TO  REQ-UPDATE-TYPE.
020300     MOVE SPACES                   TO  MREQFILE-REQ-NUM-MMIS.
020400     MOVE SPACES                   TO  DE-CODE-8.
020500
020600***  REQUISITIONS ARE CREATED ON THE BASIS OF AVAIL (WHAT WAS
020700***  AVAILABLE BEFORE THE TRANSACTION, AND WHAT WAS AVAIL AFTER).
020800
020900     SUBTRACT SAVE-RSRVD-BEFORE FROM SAVE-ONHAND-BEFORE
021000       GIVING AVAIL-BEFORE.
021100     SUBTRACT STR-RESERVED FROM STR-ONHAND
021200       GIVING AVAIL-AFTER.
021300
021400 61-TEST-FOR-UPDATE.

      *------NAPANEE ONLY! CREATE REQ FOR EACH ISSUE----------
           OPEN INPUT MPLTINFO.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO.
           IF MPLTINFO-COMPANY = "631"
               IF AVAIL-BEFORE > AVAIL-AFTER
                   MOVE 1 TO REQ-UPDATE-TYPE
                   MOVE "I" TO ISS-RET-FLAG
                   GO TO 62-LOCK-MREQFILE.
      *------END OF NAPANEE ONLY CODE-------------------------
      *------START TYLER CODE---------------------------------
           IF MPLTINFO-COMPANY = "285" GO TO 6-MAIN-X.
      *------END TYLER CODE-----------------------------------
021500
021600********************************************
021700**     ONHAND FALLS BELOW REORDER         **
021800********************************************
021900
022000     IF AVAIL-BEFORE > STR-REORDER OR = STR-REORDER
022100         IF AVAIL-AFTER < STR-REORDER
022200             MOVE 1  TO  REQ-UPDATE-TYPE
022300             MOVE "I"  TO  ISS-RET-FLAG
022400             GO TO 62-LOCK-MREQFILE.
022500
022600********************************************
022700**    ONHAND FALLS BELOW EXPEDITE         **
022800********************************************
022900
023000     IF AVAIL-BEFORE < STR-REORDER
023100         IF AVAIL-BEFORE > STR-EXPEDITE OR = STR-EXPEDITE
023200             IF AVAIL-AFTER < STR-EXPEDITE
023300                 MOVE 2   TO  REQ-UPDATE-TYPE
023400                 MOVE "I" TO  ISS-RET-FLAG
023500             GO TO 62-LOCK-MREQFILE.
023600
023700********************************************
023800**    ONHAND INCREASES ABOVE REORDER      **
023900********************************************
024000
024100     IF AVAIL-BEFORE < STR-REORDER
024200         IF AVAIL-AFTER > STR-REORDER OR = STR-REORDER
024300             MOVE 1       TO  REQ-UPDATE-TYPE
024400             MOVE "R"     TO  ISS-RET-FLAG
024500             GO TO 62-LOCK-MREQFILE.
024600
024700********************************************
024800**    ONHAND INCREASES ABOVE EXPEDITE     **
024900********************************************
025000
025100     IF AVAIL-BEFORE < STR-EXPEDITE
025200         IF AVAIL-AFTER > STR-EXPEDITE OR = STR-EXPEDITE
025300             IF AVAIL-AFTER < STR-REORDER
025400                 MOVE 2   TO  REQ-UPDATE-TYPE
025500                 MOVE "R" TO  ISS-RET-FLAG
025600                 GO TO 62-LOCK-MREQFILE.
025700
025800********************************************
025900**   ONHAND FALLS FURTHER BELOW REORDER   **
026000**   OR FURTHER BELOW EXPEDITE.           **
026100********************************************
026200
026300     IF AVAIL-BEFORE > AVAIL-AFTER
026400         IF AVAIL-AFTER < STR-REORDER
026500             MOVE "A"  TO  ISS-RET-FLAG
026600             GO TO 62-LOCK-MREQFILE.
026700
026800
026900     GO TO 6-MAIN-X.
027000
027100 62-LOCK-MREQFILE.
027200     MOVE DE-CODE         TO  ST-CODE-ARG, MREQFILE-CORP-CODE.
027300*    CALL "DBLOCK" USING BASE, DSET-MREQFILE, MODE3, STATUS-AREA.
027400*    IF COND-WORD NOT = 0
027500*        PERFORM 95-MOVE-ERROR
027600*        GO TO 6-MAIN-X.
027700
027800     MOVE DE-CODE TO ST-CODE-ARG.
027900     IF ISS-RET-FLAG = "I"
028000         PERFORM 7-UPDATE-REQFILE-ISS THRU 7-URI-X.
028100     IF ISS-RET-FLAG = "R"
028200         PERFORM 8-UPDATE-REQFILE-RET THRU 8-URR-X.
028300     IF ISS-RET-FLAG = "A"
028400         PERFORM 9-UPDATE-REQFILE-ACT THRU 9-URA-X.
028500
028600*    CALL "DBUNLOCK" USING BASE, DSET-MREQFILE, MODE1,
028700*      STATUS-AREA.
028800*    IF COND-WORD NOT = 0
028900*         PERFORM 95-MOVE-ERROR
029000*         GO TO 6-MAIN-X.
029100
029200     GO TO 6-MAIN-X.
029300
029400 7-UPDATE-REQFILE-ISS.
029500*    CALL "DBGET" USING BASE, DSET-MREQFILE, MODE7, STATUS-AREA,
029600*      ALL-ITEMS, BUF-MREQFILE, ST-CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE ST-CODE-ARG TO CORPCDE OF MREQFILE-REC.
           READ MREQFILE INTO BUF-MREQFILE INVALID KEY
                MOVE 17 TO COND-WORD.
029700     IF COND-WORD = 17
029800         PERFORM 91-ADD-REC-I
029900         IF COND-WORD NOT = 0
030000             PERFORM 95-MOVE-ERROR
030100             GO TO 6-MAIN-X
030200         ELSE
030300             NEXT SENTENCE
030400     ELSE
030500     IF COND-WORD = 0
030600         IF MREQFILE-REQ-STATUS = "R"
030700             IF REQ-UPDATE-TYPE = 1
030800                 PERFORM 93-DELETE-REC
030900                 IF COND-WORD NOT = 0
031000                     PERFORM 95-MOVE-ERROR
031100                     GO TO 6-MAIN-X
031200                 ELSE
031300                     NEXT SENTENCE
031400             ELSE
031500                 MOVE "E" TO MREQFILE-REQ-STATUS
031600                 PERFORM 94-REWRITE-REC
031700                 IF COND-WORD NOT = 0
031800                     PERFORM 95-MOVE-ERROR
031900                     GO TO 6-MAIN-X
032000                 ELSE
032100                     NEXT SENTENCE
032200         ELSE
032300         IF MREQFILE-REQ-STATUS = "E"
032400             IF REQ-UPDATE-TYPE = 1
032500                 MOVE " " TO MREQFILE-REQ-STATUS
032600                 PERFORM 94-REWRITE-REC
032700                 IF COND-WORD NOT = 0
032800                     PERFORM 95-MOVE-ERROR
032900                     GO TO 6-MAIN-X
033000                 ELSE
033100                     NEXT SENTENCE
033200             ELSE
033300                 NEXT SENTENCE
033400         ELSE
033500             NEXT SENTENCE
033600     ELSE
033700         PERFORM 95-MOVE-ERROR
033800         GO TO 6-MAIN-X.
033900
034000 7-URI-X.
034100     EXIT.
034200
034300 8-UPDATE-REQFILE-RET.
034400*    CALL "DBGET" USING BASE, DSET-MREQFILE, MODE7, STATUS-AREA,
034500*      ALL-ITEMS, BUF-MREQFILE, ST-CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE ST-CODE-ARG TO CORPCDE OF MREQFILE-REC.
           READ MREQFILE INTO BUF-MREQFILE INVALID KEY
                MOVE 17 TO COND-WORD.
034600     IF COND-WORD = 17
034700         IF REQ-UPDATE-TYPE = 1
034800             PERFORM 92-ADD-REC-R
034900             IF COND-WORD NOT = 0
035000                 PERFORM 95-MOVE-ERROR
035100                 GO TO 8-URR-X
035200             ELSE
035300                 NEXT SENTENCE
035400         ELSE
035500             NEXT SENTENCE
035600     ELSE
035700     IF COND-WORD = 0
035800         IF REQ-UPDATE-TYPE = 1
035900             IF MREQFILE-REQ-STATUS = "E" OR "A"
036000                 MOVE "R"          TO  MREQFILE-REQ-STATUS
036100                 PERFORM 94-REWRITE-REC
036200                 IF COND-WORD NOT = 0
036300                     PERFORM 95-MOVE-ERROR
036400                     GO TO 8-URR-X
036500                 ELSE
036600                     NEXT SENTENCE
036700             ELSE
036800                 PERFORM 93-DELETE-REC
036900                 IF COND-WORD NOT = 0
037000                     PERFORM 95-MOVE-ERROR
037100                     GO TO 8-URR-X
037200                 ELSE
037300                     NEXT SENTENCE
037400         ELSE
037500         IF MREQFILE-REQ-STATUS = " " OR "A"
037600             NEXT SENTENCE
037700         ELSE
037800             PERFORM 93-DELETE-REC
037900             IF COND-WORD NOT = 0
038000                 PERFORM 95-MOVE-ERROR
038100                 GO TO 8-URR-X
038200             ELSE
038300                 NEXT SENTENCE
038400     ELSE
038500         PERFORM 95-MOVE-ERROR
038600         GO TO 8-URR-X.
038700
038800
038900 8-URR-X.
039000     EXIT.
039100
039200 9-UPDATE-REQFILE-ACT.
039300*    CALL "DBGET" USING BASE, DSET-MREQFILE, MODE7, STATUS-AREA,
039400*      ALL-ITEMS, BUF-MREQFILE, ST-CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE ST-CODE-ARG TO CORPCDE OF MREQFILE-REC.
           READ MREQFILE INTO BUF-MREQFILE INVALID KEY
                MOVE 17 TO COND-WORD.
039500     IF COND-WORD = 17
039600         MOVE "A"        TO  MREQFILE-REQ-STATUS
039700*        CALL "DBPUT" USING BASE, DSET-MREQFILE, MODE1,
039800*          STATUS-AREA, ALL-ITEMS, BUF-MREQFILE
               MOVE 0 TO COND-WORD
               WRITE MREQFILE-REC FROM BUF-MREQFILE INVALID KEY
                   MOVE 99 TO COND-WORD
               END-WRITE
039900         IF COND-WORD NOT = 0
040000             PERFORM 95-MOVE-ERROR
040100             GO TO 6-MAIN-X
040200         ELSE
040300             NEXT SENTENCE
040400     ELSE
040500     IF COND-WORD NOT = 0
040600         PERFORM 95-MOVE-ERROR
040700         GO TO 9-URA-X.
040800
040900 9-URA-X.
041000     EXIT.
041100
041200 91-ADD-REC-I.
041300     IF REQ-UPDATE-TYPE = 1
041400         MOVE " " TO MREQFILE-REQ-STATUS
041500     ELSE
041600         MOVE "E" TO MREQFILE-REQ-STATUS.
041700*    CALL "DBPUT" USING BASE, DSET-MREQFILE, MODE1,
041800*      STATUS-AREA, ALL-ITEMS, BUF-MREQFILE.
           MOVE 0 TO COND-WORD.
           WRITE MREQFILE-REC FROM BUF-MREQFILE INVALID KEY
               MOVE 99 TO COND-WORD.
041900
042000 92-ADD-REC-R.
042100     MOVE "R"           TO MREQFILE-REQ-STATUS.
042200*    CALL "DBPUT" USING BASE, DSET-MREQFILE, MODE1,
042300*      STATUS-AREA, ALL-ITEMS, BUF-MREQFILE.
           MOVE 0 TO COND-WORD.
           WRITE MREQFILE-REC FROM BUF-MREQFILE INVALID KEY
               MOVE 99 TO COND-WORD.
042400
042500 93-DELETE-REC.
042600*    CALL "DBDELETE" USING BASE, DSET-MREQFILE, MODE1,
042700*      STATUS-AREA.
           MOVE 0 TO COND-WORD.
           DELETE MREQFILE INVALID KEY
               MOVE 99 TO COND-WORD.
042800
042900 94-REWRITE-REC.
043000*    CALL "DBUPDATE" USING BASE, DSET-MREQFILE, MODE1,
043100*      STATUS-AREA, ALL-ITEMS, BUF-MREQFILE.
           MOVE 0 TO COND-WORD.
           REWRITE MREQFILE-REC FROM BUF-MREQFILE INVALID KEY
               MOVE 99 TO COND-WORD.
043200
043300 95-MOVE-ERROR.
043400     MOVE COND-WORD                TO  COND-WORD-9.
043500     MOVE COND-WORD-9              TO  RET-CODE.
043600
043700 6-MAIN-X.
           CLOSE MREQFILE.
043800     GOBACK.
