000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TREQINQ.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        12/20/85.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.     EXECUTIVE PROGRAM (MAIN PROGRAM) FOR REQ INQUIRY
001000*             SUB-PROGRAM.
001100*

      *C   03/11/1998   CA YODER   REQ #97-1125
      *C     CHANGED PASSWORD FROM 6 TO 8 FOR CALL TO "TPERPASS."
      *C
      *C   20OCT1998    JE COFFMAN
      *C     ADDED LOGIC CHANGE TO SCREEN ALL USERS FROM LOOKING AT
      *C     ALL REQUISITIONS ON THE SYSTEM. NAPANEE HAD A SITUATION
      *C     WHERE THEY THOUGHT SOME PERSONNEL SHOULD NOT BE ABLE TO
      *C     LOOK AT SOME INFORMATION ON SOME REQS. BY INCLUDING A
      *C     NEW FLAG (MEMPL-INQUIRE-CAP) IN FILE MCFPCS4200, WE CAN
      *C     RESTRICT THE USER FROM VIEWING ANY OTHER THAN WHAT HE HAS
      *C     ORIGINATED.
      *C
      *C   01AUG2000    JE COFFMAN
      *C     REMOVED REQI-DATA AREA AND REPLACED WITH COPYLIB OF
      *C     SMREQINQ.
      *C
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.  HP-3000.
001500 OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL
                  ASSIGN TO DATABASE-MCFLCS4202
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

001600
001700 DATA DIVISION.
       FILE SECTION.
       FD  MEMPL
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC.
           COPY DDS-MCRPCS4200  OF MCFLCS4202.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

001800 WORKING-STORAGE SECTION.
001900
002000 77  PASS-SPOOL-PRT-NO             PIC S9(2) COMP-4 VALUE 0.
       77  SAVE-COMPANY                  PIC X(3).
002100
002200**************************************************************
002300**                                                          **
002400**     C O M M U N I C A T I O N S   A R E A S              **
002500**                                                          **
002600**************************************************************
002700
002800 COPY TBLOWUP    IN COPYLIB.
002900*COPY CWHO       IN COPYLIB.
003000 COPY ESCNAM2    IN COPYLIB.
003100 COPY REQGLOBS   IN COPYLIB.
003200
003300 01  REQI-RET-CODE                 PIC S9(4) COMP-4 VALUE 0.
003400 COPY SMREQINQ OF COPYLIB.
003900
       01  WHO-PARMS.
           05  USERNAME                            PIC X(10).
           05  TERMNUM                             PIC X(10).
           05  CURRLIB                             PIC X(10).
           05  JOBLIBX                             PIC X.
004000**************************************************************
004100**                                                          **
004200**                  V I E W   W O R K                       **
004300**                                                          **
004400**************************************************************
004500
       COPY VCOMAREA IN COPYLIB.
009200 01  FORMFILE.
009300     05  FORM-FNAME                PIC X(8)  VALUE "FCSISINQ".
009400     05  FILLER                    PIC X     VALUE ".".
009500     05  FORM-GNAME.
009600         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009700         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009800     05  FILLER                    PIC X(19) VALUE SPACES.
009900
010000 01  TERMFILENAME         PIC X(11) VALUE "MYFILE ;".
010100
010200 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76      COMP-4.
010300
010400 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE ZERO    COMP-4.
010500
010600 01  MESSAGE-BUFFER.
010700     05  MSG-TEXT              PIC X(68)    VALUE SPACE.
010800     05  MSG-FLD               PIC X(8)     VALUE SPACE.
010900     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC ZZZZZZZ9.
011000
011100**************************************************************
011200**                                                          **
011300**            D A T A B A S E   W O R K                     **
011400**                                                          **
011500**************************************************************
011600
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

011700 01  BASE                          PIC X(24) VALUE "  STORES;".
011800 01  BASE-STHIST                   PIC X(10) VALUE "  STHIST;".
011900 01  BASE-MMISA                    PIC X(24) VALUE "  MMISA;".
012000 01  BASE-BUDGET                   PIC X(24) VALUE "  BUDGET;".
012100
012200 01  PASSWORD                      PIC X(5)  VALUE "JADE;".
012300 COPY DBSTAT     IN COPYLIB.
012400
012500 01  DSET-NAMES.
012600     05  DSET-DUMMY                PIC X(2)  VALUE SPACES.
012700     05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".
012800
012900 01  MODE-AREA.
013000     05  MODE1                     PIC S9(4) COMP-4 VALUE 1.
013100     05  MODE7                     PIC S9(4) COMP-4 VALUE 7.
013200
013300 01  MPLTINFO-LIST.
013400     05  FILLER                  PIC X(13) VALUE "PLTINFO-DATA;".
013500
013600 01  PLT-ARG                       PIC X(4)  VALUE "P 01".
013700
004000*------ PARMS FOR CALL TO "TPERPASS" - PASSWORD SUBPROGRAM
004100 01  CC-BUFFER                     PIC X(4)  VALUE SPACES.
004200 01  NAME-BUFFER                   PIC X(16) VALUE SPACES.
      *---------- EXPANDED PASSWORD FIELD FROM 6 TO 8.
004300*01  PWORD-BUFFER                  PIC X(8)  VALUE SPACES.
       01  PWORD-BUFFER                  PIC X(10) VALUE SPACES.
004400 01  PWORD-SWITCH                  PIC X(1)  VALUE SPACES.
004500
013800**************************************************************
013900**                                                          **
014000**           D A T A B A S E   B U F F E R S                **
014100**                                                          **
014200**************************************************************
014300
       COPY MEMPL      IN COPYLIB.

       COPY MPLT0      IN COPYLIB.

       COPY MPLTP01    IN COPYLIB.

       COPY MPLTRQGB   IN COPYLIB.

014800**************************************
014900*                                    *
015000*    NATIVE LANGUAGE SUPPORT AREA    *
015100*                                    *
015200**************************************
015300
015400 COPY LANGUAGE   IN COPYLIB.
015500
015600
015700 PROCEDURE DIVISION.
015800 1-HOUSEKEEP SECTION.
015900 START-PGM.
016000     CALL "TESCSEQ" USING ESC-NAME.
           OPEN INPUT MEMPL.
           OPEN INPUT MPLTINFO.
016100
016200     MOVE "TREQINQ"                TO  BU-PGM-NAME.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
016300*    CALL INTRINSIC "WHO" USING MOD CAP LATTR
016400*          USERNAME GRPNAME ACCTNAME HOMEGRP TNUM.
016500*
016600*    CALL "DBOPEN" USING BASE, PASSWORD, MODE1, STATUS-AREA.
016700*    IF COND-WORD NOT = 0
016800*        MOVE "DBOPEN ERROR" TO BU-DISPLAY-MSG
016900*        GO TO 2-BLOWUP.
017000*
017100*    CALL INTRINSIC "FINDJCW" USING LANG-JCW-NAME, LANG-JCW-VALUE,
017200*                               LANG-JCW-STATUS.
017300*    IF LANG-JCW-STATUS NOT = 0
017400*        MOVE 1 TO LANG-JCW-VALUE.
017500*
017600*    CALL INTRINSIC "NLAPPEND" USING FORM-GNAME, LANG-JCW-VALUE,
017700*         LANG-ERROR.
017800*    IF LANG-ERROR1 NOT = 0
017900*        MOVE "001" TO FORM-GNAME2.
018000*
018100*    MOVE FORM-GNAME2 TO LANG-ERCAT-FNAME2, LANG-ERCAT-GNAME2.
018200*
018300*    CALL INTRINSIC "CATOPEN" USING LANG-ERCAT, LANG-ERROR,
018400*        GIVING LANG-INDEX.
018500*    IF LANG-ERROR1 NOT = 0
018600*        MOVE "CATOPEN FAILED * TMTSTEXC" TO BU-DISPLAY-MSG
018700*        GO TO 2-BLOWUP.
018800*
018900*    CALL "VOPENFORMF" USING VIEW-COMAREA FORMFILE.
019000*    IF VIEW-STATUS NOT = 0
019100*        MOVE "VOPENFORMF ERR 1-H" TO BU-DISPLAY-MSG
019200*        GO TO 2-BLOWUP.
019300*
019400*    CALL "VOPENTERM" USING VIEW-COMAREA TERMFILENAME.
019500*    IF VIEW-STATUS NOT = 0
019600*        MOVE "VOPENTERM ERR" TO BU-DISPLAY-MSG
019700*        GO TO 2-BLOWUP.
019800*
019900*    CALL "DBGET" USING BASE DSET-MPLTINFO MODE7 STATUS-AREA
020000*      MPLTINFO-LIST BUF-MPLTINFO PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
020100     IF COND-WORD NOT = 0
020200         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
020300         GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY TO SAVE-COMPANY.
020400
           MOVE 0 TO COND-WORD.
           MOVE "RQGB" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
020100     IF COND-WORD NOT = 0
020200         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
020300         GO TO 2-BLOWUP.
           MOVE MPLTINFO-RQGB TO REQ-GLOBALS.
           MOVE SPACES TO INQ-CC-INPUT.
           MOVE USERNAME TO USERID OF MEMPL-REC.
           READ MEMPL INTO BUF-MEMPL
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MEMPL-INQUIRE-CAP = "Y"
                   MOVE SPACES TO INQ-CC-INPUT
                   MOVE "Y"    TO INQ-INQ-FLAG
               ELSE
               MOVE MEMPL-EMPL TO INQ-CC-INPUT
               MOVE "N"        TO INQ-INQ-FLAG
           ELSE
           MOVE SPACES         TO INQ-CC-INPUT
           MOVE "Y"            TO INQ-INQ-FLAG.
           MOVE SAVE-COMPANY             TO  MPLTINFO-COMPANY
020500     MOVE SPACES                   TO  REQI-DATA
020600     CALL "SMREQINQ" USING         REQI-RET-CODE,
020700                                   BASE,
020800                                   BASE-STHIST,
020900                                   BASE-MMISA,
021000                                   BASE-BUDGET,
021100                                   STATUS-AREA,
021200                                   VIEW-COMAREA,
021300                                   LANGUAGE-PARMS,
021400                                   REQI-DATA,
021500                                   REQ-GLOBALS,
021600                                   MPLTINFO-COMPANY,
021700                                   PASS-SPOOL-PRT-NO,
021800                                   ESC-NAME.
021900
022000 2-EOJ.
022100*    CALL INTRINSIC "CATCLOSE" USING LANG-INDEX, LANG-ERROR.
022200*    CALL "VCLOSETERM" USING VIEW-COMAREA.
022300*    CALL "VCLOSEFORMF" USING VIEW-COMAREA.
022400*    CALL "DBCLOSE" USING BASE, DSET-DUMMY, MODE1,
022500*        STATUS-AREA.
           CLOSE MEMPL.
           CLOSE MPLTINFO.
022600     GOBACK.
022700
022800 2-BLOWUP.
022900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
023000       VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
023100       BU-DISPLAY-FLDS.
