       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TREQUSTR.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM SHOWS WORK ORDERS IN THE SYSTEM FOR A     **
      ** USER-INPUT REQUESTED.                                  **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT WO-PLANNED
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  WO-BASIC-REC.
           COPY DDS-MCRPMM1000  OF MCFLMM1001.

       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WO-PLANNED-REC.
           COPY DDS-MCRPMM1100  OF MCFLMM1101.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC.
           05  FILLER                    PIC X(39).
           05  PRINT-REC-DESC            PIC X(93).

       SD  SORT-FILE RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-WO                   PIC X(10).
           05  SORT-STATUS               PIC X(02).
           05  SORT-REQUESTER            PIC X(16).
           05  SORT-DESC                 PIC X(30).
           05  FILLER                    PIC X(22).

       WORKING-STORAGE SECTION.
       77  LINE-CTR                      PIC 99.
       77  SUB                           PIC S9(4) COMP-4.
       77  TOT-RECS-CTR                  PIC 9(5).
       77  TOT-WO-CTR                    PIC 9(5).
       01  BASE                          PIC X(10).
       01  COMPRESS-PRINT                PIC X(8).
       01  CUR-DATE.
           05  CUR-DATE-YY               PIC 99.
           05  CUR-DATE-MM               PIC 99.
           05  CUR-DATE-DD               PIC 99.
       01  CUR-DATE-WA.
           05  CUR-DATE-CCYY-WA.
               10  CUR-DATE-CC-WA        PIC 99.
               10  CUR-DATE-YY-WA        PIC 99.
           05  CDY-WA REDEFINES CUR-DATE-CCYY-WA
                                         PIC 9(4).
           05  CUR-DATE-MM-WA            PIC 99.
           05  CUR-DATE-DD-WA            PIC 99.

       01  D1.
           05  D1-WO   PIC X(10) VALUE SPACES.
           05  FILLER  PIC XX    VALUE SPACES.
           05  D1-ST   PIC X(02) VALUE SPACES.
           05  FILLER  PIC XX    VALUE SPACES.
           05  D1-DESC PIC X(30).
           05  FILLER  PIC X(37) VALUE SPACES.

       01  D2.
           05  D2-DESC PIC X(80) VALUE SPACES.

       COPY ESCNAM2 IN COPYLIB.

       01  FNUM                          PIC S9(4) COMP-4 VALUE 0.

       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

       01  HD-FILE-NAME PIC X(17) VALUE "DHDR108.PUB".
       01  HD-RET-CODE                   PIC S9(4) COMP-4 VALUE 0.

       01  H0.
           05  FILLER  PIC X(4)  VALUE SPACE.
           05  FILLER  PIC X(30)
               VALUE "WORK ORDERS IN THE SYSTEM FOR ".
           05  H0-RQST PIC X(16) VALUE SPACES.
           05  H0-DATE PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(18) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE "R108".

       01  H1.
           05  FILLER  PIC X(10) VALUE "WORK ORDER".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(02) VALUE "ST".
           05  FILLER  PIC XX    VALUE SPACES.
           05  FILLER  PIC X(30)
               VALUE "DESCRIPTION                   ".
           05  FILLER  PIC X(45) VALUE SPACES.

       01  H2.
           05  FILLER  PIC X(80) VALUE ALL "_".

       01  NORMAL-PRINT                  PIC X(8).

       01  T1.
           05  FILLER  PIC X     VALUE SPACE.
           05  FILLER  PIC X(20) VALUE "TOTAL WORK ORDERS = ".
           05  T1-CTR  PIC Z(5).
           05  FILLER  PIC X(54) VALUE SPACES.

      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY TBLOWUP  IN COPYLIB.
       COPY TDATECHK IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       COPY FILESTAT   IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       01  WO-BASIC-DATA.                COPY DWOBASIC IN COPYLIB.
       01  WO-PLANNED-DATA.              COPY DWOPLAN  IN COPYLIB.

       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC-1.
           05  OPT-REQUESTER             PIC X(16).
           05  FILLER                    PIC X(64).

       PROCEDURE DIVISION.
       START-PGM SECTION.
       START-IT.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY "HD-ROUTE DATE = " HD-ROUTE-DATA.
           ACCEPT OPTION-REC-1.
           DISPLAY "OPTION-REC-1  = " OPTION-REC-1.
           OPEN INPUT  WO-BASIC.
           OPEN INPUT  WO-PLANNED.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI       TO COMPRESS-PRINT.
           MOVE CHAR-10PI         TO NORMAL-PRINT.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT" TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
               HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * TREQUSTR" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "           TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE                TO BU-DISPLAY-FLD9 (1)
               PERFORM 2100-BLOWUP.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0 LINES.
           MOVE 0 TO TOT-RECS-CTR.
           ACCEPT CUR-DATE FROM DATE.
           MOVE CUR-DATE-MM TO CUR-DATE-MM-WA.
           MOVE CUR-DATE-DD TO CUR-DATE-DD-WA.
           MOVE CUR-DATE-YY TO CUR-DATE-YY-WA.
           IF CUR-DATE-YY-WA > 70
               MOVE 19      TO CUR-DATE-CC-WA
           ELSE
           MOVE 20          TO CUR-DATE-CC-WA.
           SORT SORT-FILE ASCENDING KEY SORT-WO
               INPUT PROCEDURE  7-SORT-RECORDS
               OUTPUT PROCEDURE 8-WRITE-REPORT.
           CLOSE WO-BASIC.
           CLOSE WO-PLANNED.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO PRINT-REC
           WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0 LINES.
           CLOSE PRINT-FILE.
           GOBACK.

       2100-BLOWUP.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.
           DISPLAY "COND-WORD = ", COND-WORD.
           GOBACK.

       COPY OVRPFCALL IN COPYLIB.

       7-SORT-RECORDS SECTION.
       7-SORT-IT.
           MOVE LOW-VALUES TO WONUM OF WO-BASIC-REC.
           START WO-BASIC KEY > WONUM OF WO-BASIC-REC
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-GET-PLANNED.
       7-BASIC-LOOP.
           READ WO-BASIC NEXT INTO WO-BASIC-DATA
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-GET-PLANNED.
           IF OPT-REQUESTER NOT = REQUESTER-B GO TO 7-BASIC-LOOP.
           MOVE SPACES TO SORT-REC.
           MOVE WO-NUM TO SORT-WO.
           MOVE WO-STATUS TO SORT-STATUS.
           MOVE DESCRIPTION-1 TO SORT-DESC.
           RELEASE SORT-REC.
           GO TO 7-BASIC-LOOP.

       7-GET-PLANNED.
           MOVE LOW-VALUES TO WONUM OF WO-PLANNED-REC.
           START WO-PLANNED KEY > WONUM OF WO-PLANNED-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-SR-EXIT.
       7-PLANNED-LOOP.
           READ WO-PLANNED NEXT INTO WO-PLANNED-DATA
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-SR-EXIT.
           IF OPT-REQUESTER NOT = REQUESTER-P GO TO 7-PLANNED-LOOP.
           MOVE SPACES TO SORT-REC.
           MOVE WO-NUM-PLANNED TO SORT-WO.
           MOVE WO-STATUS-P TO SORT-STATUS.
           MOVE DESCRIPTION-1-P TO SORT-DESC.
           RELEASE SORT-REC.
           GO TO 7-PLANNED-LOOP.

       7-SR-EXIT.
           EXIT.

       8-WRITE-REPORT SECTION.
       8-WRITE-IT.
           MOVE 60 TO LINE-CTR.
           MOVE 0  TO TOT-WO-CTR.
       8-WR-LOOP.
           RETURN SORT-FILE AT END
               MOVE SPACES  TO PRINT-REC
               MOVE TOT-WO-CTR TO T1-CTR
               MOVE T1 TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 2 LINES
               GO TO 8-WR-X.
           ADD 1            TO TOT-WO-CTR.
           ADD 1            TO LINE-CTR.
           IF LINE-CTR > 60 PERFORM 8-WRITE-HEADERS.
           MOVE SPACES      TO PRINT-REC.
           MOVE SORT-WO     TO D1-WO.
           MOVE SORT-STATUS TO D1-ST.
           MOVE SORT-DESC   TO D1-DESC.
           MOVE D1          TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           GO TO 8-WR-LOOP.

       8-WRITE-HEADERS.
           MOVE SPACES TO  PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           MOVE OPT-REQUESTER TO H0-RQST.
           MOVE CUR-DATE-WA TO H0-DATE.
           MOVE H0 TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE SPACES TO PRINT-REC.
           MOVE H1 TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINT-REC.
           MOVE H2 TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE 4 TO LINE-CTR.

       8-WR-X.    EXIT.
