000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TREQREMS.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPFD-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
000900 WORKING-STORAGE SECTION.
001000 01  DBPARAMETERS.        COPY DBPARMS  IN COPYLIB.
       01  WPFD-STATUS                   PIC XX.
001100 01  WO-PARTS-DATA.       COPY DWOPARTS IN COPYLIB.
001200 LINKAGE SECTION.
       01  BASE-MMISA                    PIC X(24).
001400 01  CSIS-WORKAREA.
001500     05  WO-NUMBER                 PIC X(10).
001600     05  PART-ITEM-NO              PIC X(4).
001700     05  PART-ERROR-STATUS         PIC X(2).
001800 01  PART-REMARKS.
001900     05  PR-1                      PIC X(79).
002000     05  PR-2                      PIC X(79).
002100                          COPY DBSTAT   IN COPYLIB.
002200 PROCEDURE DIVISION USING BASE-MMISA CSIS-WORKAREA PART-REMARKS
002300                      STATUS-AREA.
002400 START-PGM.
002500     PERFORM 1-HSK.
002600     IF PART-ERROR-STATUS NOT = "OK"
002700         GO TO 2-EOJ.
002800     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
002900 2-EOJ.
           CLOSE WO-PARTS-FILE.
003000     GOBACK.
003100 1-HSK.
           OPEN INPUT WO-PARTS-FILE.
003400     MOVE LOW-VALUES TO STATUS-AREA.
003500     MOVE "OK" TO PART-ERROR-STATUS.
004100
004900 6-MAIN.
005000     MOVE 0 TO COND-WORD.
005100     MOVE WO-NUMBER TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
005200     IF COND-WORD NOT = 0
005300         MOVE "WO" TO PART-ERROR-STATUS
005400         GO TO 6-MAIN-EXIT.
005500 6-MAIN-CONT.
005600     READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA                  ,
005700       AT END    MOVE 17 TO COND-WORD.
           IF WO-NUMBER NOT = WONUM OF WPFDREC MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
005800     IF COND-WORD NOT = 0
005900         MOVE "PT" TO PART-ERROR-STATUS
006000         GO TO 6-MAIN-EXIT.
006100     IF PART-ITEM-NO = PRT-ITEM-NO
006200         NEXT SENTENCE
006300     ELSE
006400     GO TO 6-MAIN-CONT.
006500     MOVE PRT-REMARKS   TO PR-1.
006600     MOVE PRT-REMARKS-2 TO PR-2.
006700 6-MAIN-EXIT.    EXIT.
