000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.       TREQPCNT.
000400 AUTHOR.           KURT MOVSESIAN.
000800
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C  05/10/01    JIM COFFMAN
      *C     PASSED USAGE-SW FROM TREQUPDT SO THAT DETERMINATION
      *C     COULD BE MADE IF WE WERE LOOKING FOR STORES USAGE OR
      *C     TOTAL-USAGE.
      *C

000900 ENVIRONMENT DIVISION.
001000 CONFIGURATION SECTION.
001100 SOURCE-COMPUTER.   HP-3000.
001200 OBJECT-COMPUTER.   HP-3000.
001300
025900 INPUT-OUTPUT SECTION.
026000 FILE-CONTROL.
           SELECT USAGEFIL
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

001400 DATA DIVISION.
       FILE SECTION.
       FD  USAGEFIL
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.
001500
001800**************************************************************
001900*           W O R K I N G         S T O R A G E              *
002000**************************************************************
001600 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
001700
001800**************************************************************
001900*           W O R K I N G         S T O R A G E              *
002000**************************************************************
002900
003000 01  SUB                      PIC 9(4) COMP-4 VALUE ZERO.
003100 01  DAILY-USAGE              PIC 9(8)V9(4) COMP-4 VALUE ZERO.
003200 01  LEAD-TIME-USAGE          PIC 9(8)V9(4) COMP-4 VALUE ZERO.
003300 01  SQ-LT-USAGE              PIC 9(8)V9(4) COMP-4 VALUE ZERO.
003400 01  YEAR-TOTAL               PIC 9(8) COMP-4 VALUE ZERO.
003500 01  LEAD-TIME                PIC 9(4) COMP-4 VALUE ZERO.
003600 01  NO-OF-DLV                PIC 9(4) COMP-4 VALUE ZERO.
003700 01  TOTAL-DLV-TIME           PIC 9(4) COMP-4 VALUE ZERO.
003800**************************************************************
003900**                                                          **
004000**               K S A M   W O R K                          **
004100**                                                          **
004200**************************************************************
004300
004900 01  USAGE-REC.
005000     05  FILLER                   PIC XX.
005100     05  K-CORP-CODE              PIC X(8).
005200     05  K-MONTHS    OCCURS 14 TIMES INDEXED BY M-INDEX.
005300         10  MTH-USAGE          PIC S9(9) COMP-4.
005200     05  K-MONTHS-DD OCCURS 14 TIMES INDEXED BY MDD-INDEX.
005300         10  MTH-USAGE-DD       PIC S9(9) COMP-4.
007100
007200********************************************************************
007300*                 L I N K A G E   S E C T I O N                    *
007400********************************************************************
007600
007700 LINKAGE SECTION.
007800 01  BASE                         PIC X(10).
007900
008000 01  USAGE-FILE-NO                PIC S9(4) COMP-4.
008100
008200 01  RET-CODE                     PIC XX.
008300
008400 01  MODEL                        PIC S9(4) COMP-4.
008500
008600 01  CODE-INFO.
008700     05  CODE-EST-LT              PIC S9(4).
008800     05  CODE-LAST-DLVTIME  OCCURS 3 TIMES  PIC S9(4).
008900     05  CODE-EOQ                 PIC S9(8).
009000
009100 01  BU-DISPLAY-MESS              PIC X(60).
009200
009300 01  LINK-CODE                    PIC X(8).
009400
009500 01  LINK-PERCENTS.
009600     05  EXPEDITE-95               PIC 9(8) COMP-4.
009700     05  REORDER-95                PIC 9(8) COMP-4.
009800     05  MAX-95                    PIC 9(8) COMP-4.
009900     05  EXPEDITE-99               PIC 9(8) COMP-4.
010000     05  REORDER-99                PIC 9(8) COMP-4.
010100     05  MAX-99                    PIC 9(8) COMP-4.
010200
       01  USAGE-SW                      PIC X.
010400
010500********************************************************************
010600*            P R O C E D U R E   D I V I S I O N                   *
010700********************************************************************
010800
010900 PROCEDURE DIVISION USING  BASE, USAGE-FILE-NO, RET-CODE,
011000     MODEL, CODE-INFO, BU-DISPLAY-MESS, LINK-CODE, LINK-PERCENTS,
           USAGE-SW.
011100 00-START.
           OPEN INPUT USAGEFIL.

011200     PERFORM 6-MAIN.

           CLOSE USAGEFIL.

011300     GOBACK.
011400
011500 6-MAIN.
011600     PERFORM 61-GET-USAGE.
011700     SET M-INDEX TO 1.
011800     PERFORM 61-CALCULATE-USAGE UNTIL M-INDEX > 12.
011900     PERFORM 61-COMPUTE-NEW-EXPEDITES.
012100
012200 61-GET-USAGE.
           MOVE LINK-CODE  TO CORPCDE OF USAGEFIL-REC.
           READ USAGEFIL INTO USAGE-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
012800         MOVE "KSAM ERROR IN TREQPCNT" TO BU-DISPLAY-MESS
012900         MOVE "1" TO RET-CODE.
013000
013100     MOVE ZEROS                    TO  YEAR-TOTAL.
013200 61-CALCULATE-USAGE.
013300     SET M-INDEX UP BY 1.
           IF USAGE-SW = "S"
               SUBTRACT MTH-USAGE-DD (M-INDEX) FROM MTH-USAGE (M-INDEX).
013400     ADD MTH-USAGE (M-INDEX) TO  YEAR-TOTAL.
013500
013600 61-COMPUTE-NEW-EXPEDITES.
013700     DIVIDE YEAR-TOTAL  BY  365  GIVING  DAILY-USAGE.
013800     IF CODE-EST-LT = ZEROS
013900         PERFORM 611-CALC-LAST-DLV-AVG  THRU  611-CLDA-X
014000     ELSE
014100         MOVE CODE-EST-LT           TO  LEAD-TIME.
014200     MULTIPLY DAILY-USAGE BY LEAD-TIME
014300         GIVING LEAD-TIME-USAGE.
014400     COMPUTE SQ-LT-USAGE = LEAD-TIME-USAGE ** .5
014500     MULTIPLY SQ-LT-USAGE  BY  1.65
014600         GIVING EXPEDITE-95 ROUNDED.
014700     MULTIPLY SQ-LT-USAGE  BY  3.09
014800         GIVING EXPEDITE-99 ROUNDED.
014900     ADD EXPEDITE-95, LEAD-TIME-USAGE
015000         GIVING REORDER-95 ROUNDED.
015100     ADD EXPEDITE-99, LEAD-TIME-USAGE
015200         GIVING REORDER-99 ROUNDED.
015300     ADD EXPEDITE-95, CODE-EOQ, 1
015400          GIVING MAX-95.
015500     ADD EXPEDITE-99, CODE-EOQ, 1
015600         GIVING MAX-99.
015700
015800 611-CALC-LAST-DLV-AVG.
015900     MOVE ZEROS                   TO  SUB,
016000                                      NO-OF-DLV,
016100                                      TOTAL-DLV-TIME.
016200 611-ADD-LAST-DLV-LOOP.
016300     ADD 1 TO SUB.
016400     IF SUB > 3
016500         GO TO 611-CALC-AVG-DLV.
016600     IF CODE-LAST-DLVTIME (SUB) = ZEROS
016700         NEXT SENTENCE
016800     ELSE
016900         ADD CODE-LAST-DLVTIME (SUB) TO TOTAL-DLV-TIME
017000         ADD 1                    TO  NO-OF-DLV.
017100
017200     GO TO 611-ADD-LAST-DLV-LOOP.
017300
017400 611-CALC-AVG-DLV.
017500     IF NO-OF-DLV = ZEROS
017600         MOVE ZEROS               TO  LEAD-TIME
017700     ELSE
017800         DIVIDE TOTAL-DLV-TIME    BY  NO-OF-DLV
017900             GIVING LEAD-TIME ROUNDED.
018000
018100 611-CLDA-X.
018200     EXIT.
