000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TREQBTDL2.
000600*REMARKS.
000700*D    THIS PROGRAM WAS COPIED FROM TREQBTDL.  IT WILL DELETE *ALL*
000800*D    REQS OLDER THAN A CERTAIN DATE.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.  IBM-AS400.
001600 OBJECT-COMPUTER.  IBM-AS400.
       COPY SPECIALN OF COPYLIB.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
002300     SELECT REQ-FILE
                  ASSIGN TO DATABASE-DREQFIL
                  ORGANIZATION IS SEQUENTIAL.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT MREQ
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQD
                  ASSIGN TO DATABASE-MCFLCS2101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM
                  ASSIGN TO DATABASE-MCFLCS2201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQDESC
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQQUE
                  ASSIGN TO DATABASE-MCFLCS4401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

002500 DATA DIVISION.
002600 FILE SECTION.
002800 FD  REQ-FILE
002900     LABEL RECORDS ARE OMITTED
003000     RECORD CONTAINS 12  CHARACTERS.
003100 01  REQ-RCD.
003200     05  REQ-NUMBER        PIC X(12).

       SD  SORT-FILE
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-REQ-NUMBER   PIC X(12).

       FD  MREQ
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQITM
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC.
           COPY DDS-MCRPCS2200  OF MCFLCS2201.

       FD  DREQDESC
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC.
           COPY DDS-MCRPCS2300  OF MCFLCS2301.

       FD  DREQQUE
           LABEL RECORDS ARE STANDARD.
       01  DREQQUE-REC.
           COPY DDS-MCRPCS4400  OF MCFLCS4401.

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE           PIC X(132).

003500 WORKING-STORAGE SECTION.
003600 77  DELETED-REQS-CTR      PIC 9(5) VALUE 0.
       77  LINE-CTR              PIC 99   VALUE 59.
003700 77  REQS-TO-DELETE-CTR    PIC 9(5) VALUE 0.
003800
022300 COPY CCRTFILE IN COPYLIB.

       01  CDATE.
           05 YY                 PIC 99.
           05 MM                 PIC 99.
           05 DD                 PIC 99.

       01  FILE-STATUS.
           05  FILE-STATUS-1     PIC X.
           05  FILE-STATUS-2     PIC X.

       01  DETAIL-1.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  D-REQ             PIC X(12) VALUE SPACES.
           05  FILLER            PIC X(63) VALUE SPACES.

       01  HEADER-0.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  FILLER            PIC X(29)
               VALUE "REQUISITIONS DELETED FROM THE".
           05  FILLER            PIC X(33)
               VALUE "SYSTEM ".
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  H0-DATE.
               10  H0-MM         PIC XX    VALUE SPACES.
               10  FILLER        PIC X     VALUE "/".
               10  H0-DD         PIC XX    VALUE SPACES.
               10  FILLER        PIC X     VALUE "/".
               10  H0-YY         PIC XX    VALUE SPACES.

       01  HEADER-U.
           05  FILLER            PIC X(80) VALUE ALL "-".

       01  INPUT-DATE-CN.
           05  INPUT-DATE-CC       PIC X(2).
           05  INPUT-DATE.
               10  INPUT-DATE-YY   PIC X(2).
               10  FILLER          PIC X(4).

       COPY IOFEEDBACK IN COPYLIB.

       COPY OVRPFDATA  IN COPYLIB.

003900**************************************************************
004000**************************************************************
004100**                                                          **
004200**                DATABASE I/O BUFFER AREA                  **
004300**                                                          **
004400**************************************************************
004500**************************************************************
004600
004700 COPY MREQ     IN COPYLIB.
004800
004900 COPY DREQD    IN COPYLIB.
005000
005100 COPY DREQITM  IN COPYLIB.
005200
005300 COPY DREQDESC IN COPYLIB.
005400
005500 COPY DREQQUE  IN COPYLIB.
005600
005700 COPY DATAB    IN COPYLIB.
005800
005900
006000*********************
006100*                   *
006200*   DATA SET NAMES  *
006300*                   *
006400*********************
006500
006600 01  DSET-NAMES.
006700     05  DSET-NAME              PIC X(16)  VALUE SPACES.
006800     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
006900     05  DSET-DREQITM           PIC X(16)  VALUE "DREQITM;".
007000     05  DSET-DREQD             PIC X(16)  VALUE "DREQD;".
007100     05  DSET-DREQDESC          PIC X(16)  VALUE "DREQDESC;".
007200     05  DSET-DREQQUE           PIC X(16)  VALUE "DREQQUE;".
007300
007400 01 ITEMS-LISTING.
007500     05  ALL-ITEMS              PIC XX    VALUE "@;".
007600     05  REQ-SEARCH             PIC X(11) VALUE "REQ-NUMBER;".
007700
007800 01 ARG-VALUES.
007900     05  REQ-ARG                PIC X(12) VALUE SPACES.
008000
008100 COPY MULTLOCK  IN COPYLIB.
008200
008300 01  ANSWER-SW PIC X  VALUE "N".
008400
008500 COPY TBLOWUP   IN COPYLIB.
008700
008800 PROCEDURE DIVISION.
008900 BEGIN-HERE.
009000     PERFORM 1-HSK THRU 1-H-X.
009100     PERFORM 6-MAIN  THRU 6-M-X.
009200
009300 2-EOJ.
           CLOSE MREQ, DREQD, DREQITM, DREQDESC, DREQQUE.
           CLOSE ONLINE-PRT.
009800     GOBACK.
009900
010000 1-HSK.
           OPEN I-O    MREQ.
           OPEN I-O    DREQD.
           OPEN I-O    DREQITM.
           OPEN I-O    DREQDESC.
           OPEN I-O    DREQQUE.
           MOVE "MCPRT"        TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           ACCEPT CDATE        FROM DATE.
           MOVE MM             TO H0-MM.
           MOVE DD             TO H0-DD.
           MOVE YY             TO H0-YY.
           MOVE 59 TO LINE-CTR.
010500 1-H-X.
010600     EXIT.
010700
010800*********************************************
010900*                                           *
011000*  BLOWUP ROUTINE EXECUTES WHENEVER A       *
011100*  FATAL ERROR OCCURS                       *
011200*                                           *
011300*********************************************
011400
011500 2-BLOWUP.
011600     MOVE "TREQBTDL2"  TO  BU-PGM-NAME.
011700     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
011800         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
011900                 BU-DISPLAY-FLDS.
012000
012100 6-MAIN.
      ***************************************************************
      **   CREATE TEMPORARY FILE ('DREQFIL') TO CONTAIN ALL REQS  ' *
      **   IN THE DATABASE THAT ARE NOT ASSIGNED TO A PURCHASE      *
      **   ORDER.                                                   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "DREQFIL"     TO CCRTFILE-FILE.
           MOVE "0012"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "10000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DREQFIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           DISPLAY "ENTER DATE TO DELETE REQS PRIOR TO - 'YYMMDD'".
           ACCEPT INPUT-DATE.

      *-------- ACCOUNT FOR CENTURY.
           IF INPUT-DATE-YY > "70"
               MOVE "19"      TO  INPUT-DATE-CC
           ELSE
               MOVE "20"      TO  INPUT-DATE-CC.

012200     OPEN OUTPUT REQ-FILE.
012300     PERFORM 61-GET-REQS-TO-DELETE  THRU  61-GRTD-X.
012400     CLOSE REQ-FILE.

           IF REQS-TO-DELETE-CTR > 0
               SORT SORT-FILE ON ASCENDING SORT-REQ-NUMBER
                   USING REQ-FILE
                   GIVING REQ-FILE.
012500
012600     DISPLAY REQS-TO-DELETE-CTR " REQS ARE DELETEABLE".
012700     DISPLAY "LAST CHANCE BEFORE DELETE - CONTINUE (Y/N)?".
012800     ACCEPT ANSWER-SW.
012900     IF ANSWER-SW = "Y"
013000         NEXT SENTENCE
013100     ELSE
013200     IF ANSWER-SW = "N"
013300         GO TO 6-M-X.
013400
013500     OPEN INPUT REQ-FILE.
013600     PERFORM 62-DELETE-REQ  THRU  62-DR-X.
013700     CLOSE REQ-FILE.
013800
013900 6-M-X.
014000     EXIT.
014100
014200*************************************************
014300*                                               *
014400*   SERIAL GET OF MREQ (MODE2)                  *
014500*                                               *
014600*************************************************
014700
014800 61-GET-REQS-TO-DELETE.
           MOVE 0 TO COND-WORD.
           READ MREQ NEXT INTO BUF-MREQ
               AT END MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 11 TO COND-WORD.
015100     IF COND-WORD NOT = 0
015200         IF COND-WORD = 11
015300             GO TO 61-GRTD-X
015400         ELSE
015500         MOVE MREQ-NUMBER  TO  BU-DISPLAY-FLD (1)
015600         MOVE "DBGET 61-GRTD"  TO  BU-DISPLAY-MSG
015700         GO TO 2-BLOWUP.
015800
015900**************************************************
016000*                                                *
016100*   CHECK TO SEE IF REQ. HAS BEEN RELEASED BY    *
016200*   MATCONT IF SO CHECK TO SEE IF REQ. HAS BEEN  *
016300*   PROCESSED (P.O.) BY PURCHASING               *
016400*                                                *
016500**************************************************
016600
      *---------- DELETE ALL REQS.
016700*****IF REQ-PURCH-RELEASE  =  "X"
016800*****    GO TO 61-GET-REQS-TO-DELETE.
016900
      *--------- ACCOUNT FOR CENTURY.
017000     IF REQ-DATE-CN < INPUT-DATE-CN
017100         NEXT SENTENCE
017200     ELSE
017300     GO TO 61-GET-REQS-TO-DELETE.
017400
017500     MOVE MREQ-NUMBER  TO  REQ-NUMBER
017600     ADD 1 TO REQS-TO-DELETE-CTR.
017700     WRITE REQ-RCD.
017800     GO TO 61-GET-REQS-TO-DELETE.
017900
018000 61-GRTD-X.
018100     EXIT.
018200
018300 62-DELETE-REQ.
018400     READ REQ-FILE  AT END
018500         DISPLAY DELETED-REQS-CTR " REQS WERE DELETED"
018600         GO TO 62-DR-X.
018700     MOVE REQ-NUMBER          TO  REQ-ARG, BU-DISPLAY-FLD (1).
018800
           MOVE REQ-ARG TO REQNO OF MREQ-REC.
           READ MREQ INTO BUF-MREQ.
           IF FILE-STATUS NOT = "00"
021100         MOVE "GET MREQ 62-LRS" TO BU-DISPLAY-MSG
021200         GO TO 2-BLOWUP.
021300
       62-DELETE-DREQD-SEGS.
           MOVE 0       TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQD-REC.
           START DREQD KEY = REQNO OF DREQD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
021600     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQITM-SEGS
               ELSE
021700         MOVE "DELETE DREQD SEGS" TO BU-DISPLAY-MSG
021800         GO TO 2-BLOWUP.
021900
022000     PERFORM 620-DELETE-DREQD  THRU  620-DD-X
022100         UNTIL COND-WORD = 15.
022200
       62-DELETE-DREQITM-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC.
           START DREQITM KEY = REQNO OF DREQITM-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
022500     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQDESC-SEGS
               ELSE
022600         MOVE "DELETE DREQITM SEGS" TO BU-DISPLAY-MSG
022700         GO TO 2-BLOWUP.
022800
022900     PERFORM 621-DELETE-DREQITM THRU 621-DD-X
023000         UNTIL COND-WORD = 15.
023100
       62-DELETE-DREQDESC-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC.
           START DREQDESC KEY = REQNO OF DREQDESC-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
023400     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-DREQQUE-SEGS
               ELSE
023500         MOVE "DELETE DREQDESC SEGS" TO BU-DISPLAY-MSG
023600         GO TO 2-BLOWUP.
023700
023800     PERFORM 622-DELETE-DREQDESC  THRU  622-DD-X
023900         UNTIL COND-WORD = 15.
024000
       62-DELETE-DREQQUE-SEGS.
           MOVE 0 TO COND-WORD.
           MOVE REQ-ARG TO REQNO OF DREQQUE-REC.
           START DREQQUE KEY = REQNO OF DREQQUE-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
024300     IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 62-DELETE-MREQ
               ELSE
024400         MOVE "DELETE DREQQUE SEGS" TO BU-DISPLAY-MSG
024500         GO TO 2-BLOWUP.
024600
024700     PERFORM 623-DELETE-DREQQUE THRU 623-DD-X
024800         UNTIL COND-WORD = 15.
024900
       62-DELETE-MREQ.
           DELETE MREQ
025200     IF FILE-STATUS NOT = "00"
025300         MOVE "DELETE MREQ SEGS" TO BU-DISPLAY-MSG
025400         GO TO 2-BLOWUP.
025500     ADD 1 TO DELETED-REQS-CTR.
           MOVE REQ-ARG TO D-REQ.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 59
               WRITE PRINT-RCD FROM HEADER-0 AFTER ADVANCING NEW-PAGE
               WRITE PRINT-RCD FROM HEADER-U AFTER ADVANCING 1 LINES
               WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1 LINES
               MOVE 3 TO LINE-CTR
           ELSE
           WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1 LINES.
026400     GO TO 62-DELETE-REQ.
026500
026600 62-DR-X.     EXIT.
026700
026800 620-DELETE-DREQD.
           MOVE 0 TO COND-WORD.
           READ DREQD NEXT INTO BUF-DREQD
               AT END    MOVE 15 TO COND-WORD.
026900     IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DREQD-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
027100     IF COND-WORD NOT = 0
027200         IF COND-WORD = 15
027300             NEXT SENTENCE
027400         ELSE
027500             MOVE "GET DREQD 620-DD" TO BU-DISPLAY-MSG
027600             GO TO 2-BLOWUP
027700     ELSE
           DELETE DREQD
028000     IF FILE-STATUS NOT = "00"
028100         MOVE "DELETE DREQD" TO BU-DISPLAY-MSG
028200         GO TO 2-BLOWUP.
028300
028400 620-DD-X.    EXIT.
028500
028600 621-DELETE-DREQITM.
           MOVE 0 TO COND-WORD.
           READ DREQITM NEXT INTO BUF-DREQITM
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQITM-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
028900     IF COND-WORD NOT = 0
029000         IF COND-WORD = 15
029100             NEXT SENTENCE
029200         ELSE
029300             MOVE "GET DREQITM 621-DD" TO BU-DISPLAY-MSG
029400             GO TO 2-BLOWUP
029500     ELSE
           DELETE DREQITM
029800     IF FILE-STATUS NOT = "00"
029900         MOVE "DELETE DREQITM" TO BU-DISPLAY-MSG
030000         GO TO 2-BLOWUP.
030100 621-DD-X.    EXIT.
030200
030300 622-DELETE-DREQDESC.
           MOVE 0 TO COND-WORD.
           READ DREQDESC NEXT INTO BUF-DREQDESC
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF REQDESC-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
030600     IF COND-WORD NOT = 0
030700         IF COND-WORD = 15
030800             NEXT SENTENCE
030900         ELSE
031000             MOVE "GET DREQDESC 622-DD" TO BU-DISPLAY-MSG
031100             GO TO 2-BLOWUP
031200     ELSE
           DELETE DREQDESC
031500     IF FILE-STATUS NOT = "00"
031600         MOVE "DELETE DREQDESC" TO BU-DISPLAY-MSG
031700         GO TO 2-BLOWUP.
031800 622-DD-X.    EXIT.
031900
032000 623-DELETE-DREQQUE.
           MOVE 0 TO COND-WORD.
           READ DREQQUE NEXT INTO BUF-DREQQUE
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF DRQQ-REQ-NUMBER NOT = REQ-ARG MOVE 15 TO COND-WORD.
032300     IF COND-WORD NOT = 0
032400         IF COND-WORD = 15
032500             NEXT SENTENCE
032600         ELSE
032700             MOVE "GET DREQQUE 623-DD" TO BU-DISPLAY-MSG
032800             GO TO 2-BLOWUP
032900     ELSE
           DELETE DREQQUE
033200     IF FILE-STATUS NOT = "00"
033300         MOVE "DELETE DREQQUE" TO BU-DISPLAY-MSG
033400         GO TO 2-BLOWUP.
033500 623-DD-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.
