000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TREQRPT.
000400 AUTHOR.     KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).

000600*     THIS PROGRAM GIVES A LISTING OF ALL REQUISITIONS NOT ACTED
000700*     UPON BY MATERIALS CONTROL. THE INPUT USED IS THE DATA BASE
000800*     THE OUTPUT IS A REPORT.
      *
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  MAY 2, 1996     CA YODER    REQ #95-041
      *C   ADDED THE DATE THAT THE REQ WAS RETURNED BY PURCHASING TO
      *C   MATERIALS CONTROL TO THE REPORT.
      *C
      *C  SEPT 05, 1996   CA YODER
      *C   MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
000900
002700
002800
002900 ENVIRONMENT DIVISION.
003000 CONFIGURATION SECTION.
003100 SOURCE-COMPUTER.  HP-3000.
003200 OBJECT-COMPUTER.  HP-3000.
003300
003400 SPECIAL-NAMES. C01 IS NEW-PAGE.
003600
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
004000     SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-I
                  ASSIGN TO DATABASE-MCFLCS2201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
026200
           SELECT DREQDESC-I
                  ASSIGN TO DATABASE-MCFLCS2301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
004100
004200 DATA DIVISION.
004300 FILE SECTION.
004400
004500 FD  ONLINE-PRT
004600     LABEL RECORDS ARE OMITTED
004700     RECORD CONTAINS 132 CHARACTERS
004800     DATA RECORD IS PRINT-RCD.
004900 01  PRINT-RCD.
005000     05  PRINT-LINE        PIC X(132).
005100
005200 SD  SORT-FILE
005300     RECORD CONTAINS 58 CHARACTERS.
005400 01  SORT-RCD.
005500     05  SORT-REQ-NO           PIC X(7).
           05  SORT-REQ-DATE-CN.
               10  SORT-DATE-CC      PIC X(2).
005600         10  SORT-REQ-DATE     PIC X(6).
           05  SORT-REQ-DATE-WANT-CN.
               10  SORT-WANT-CC        PIC X(2).
005700         10  SORT-REQ-DATE-WANT  PIC X(6).
           05  SORT-REQ-DATE-RET-CN.
               10  SORT-RET-CC       PIC X(2).
               10  SORT-REQ-DATE-RET PIC X(6).
005800     05  SORT-REQ-CODE         PIC X(7).
005900     05  SORT-SOQ              PIC S9(8).
006000     05  SORT-QTY-UM           PIC XX.
006100     05  SORT-HOLD-STATUS      PIC X(10).
006200
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0201.

       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2201.

       FD  DREQDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DREQDESC-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2301.

006400 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
9406CK 01  SCOPE   PIC X.
006500
006600**********************
006700*                    *
006800*  S W I T C H E S   *
006900*                    *
007000**********************
007100
007200 01  SWITCH-AREA.
007300     05  FATAL-ERR-SW            PIC X       VALUE "N".
007400
007500 COPY TDATECHK IN COPYLIB.
007600
007700 01  WORK-AREA.
007800     05  PAGE-CTR                PIC 9(2)    VALUE ZEROS.
007900     05  LINE-CTR                PIC 9(2)    VALUE ZEROS.
008000     05  AT-LEAST-ONE-ITEM       PIC X       VALUE SPACES.
008100     05  AT-LEAST-ONE-REQ        PIC X       VALUE "N".
008200
008300**** ACCEPT FIELD ****
008400 01  ROUTE-LINE                  PIC X(80)   VALUE SPACES.
008500
008600**** ESCAPE SEQUENCES ****
008700 COPY ESCNAM2 IN COPYLIB.
008800
008900 01  COMPRESS-PRINT              PIC X(8).
009000
009100 01  NORMAL-PRINT                PIC X(8).
009400
009500**** TBLOWUP ****
009600 COPY TBLOWUP IN COPYLIB.
009700 01  VIEW-COMAREA.
009800     05  FILLER                 PIC X(118)  VALUE ALL "0".
009900     05  FILLER                 PIC S9(4)   COMP-4 VALUE 9999.
010000 01  KSAM-STATUS                PIC X(2)    VALUE SPACES.
010100
010400
010500**************************************************************
010600**************************************************************
010700**                                                          **
010800**                DATABASE I/O BUFFER AREA                  **
010900**                                                          **
011000**************************************************************
011100**************************************************************
011200
011300 COPY MREQ IN COPYLIB.
011400
011500 COPY DREQITM IN COPYLIB.
011600
011700 COPY DREQDESC IN COPYLIB.
011800
011900 COPY MPLTINFO IN COPYLIB.
012000
012100 COPY MSTORERM IN COPYLIB.
012200*********************
012300*                   *
012400*   DATA SET NAMES  *
012500*                   *
012600*********************
012700
012800 01  DSET-NAMES.
012900     05  DSET-NAME              PIC X(16)  VALUE SPACES.
013000     05  DSET-MREQ              PIC X(16)  VALUE "MREQ;".
013100     05  DSET-DREQITM           PIC X(16)  VALUE "DREQITM;".
013200     05  DSET-DREQDESC          PIC X(16)  VALUE "DREQDESC;".
013300     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
013400     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
013500
013600 COPY DATAB IN COPYLIB.
013700
013800 01 ITEMS-LISTING.
013900     05  ALL-ITEMS              PIC XX    VALUE "@;".
014000     05  REQ-SEARCH             PIC X(11) VALUE "REQ-NUMBER;".
014100
014200 01 ARG-VALUES.
014300     05  REQ-ARG                PIC X(12) VALUE SPACES.
014400     05  PLT-ARG                PIC X(4)  VALUE SPACES.
014500     05  CODE-ARG               PIC X(8)  VALUE SPACES.
014600
014700
014800************************************************
014900*                                              *
015000*   PRINT HEADERS                              *
015100*                                              *
015200************************************************
015300
015400
015500 01  PRINT-HDR1.
015600     05  FILLER       PIC X(6)  VALUE " PAGE ".
015700     05  PAGE-NO-OUT  PIC ZZZ9  VALUE ZEROS.
015800     05  FILLER       PIC X(10) VALUE SPACES.
015900     05  FILLER       PIC X(17) VALUE "REQUISITIONS NOT ".
016000     05  FILLER       PIC X(18) VALUE "PROCESSED BY MATER".
016100     05  FILLER       PIC X(12) VALUE "IALS CONTROL".
016200     05  FILLER       PIC X(4)  VALUE SPACES.
016300     05  PRT-CO       PIC X(3)  VALUE SPACES.
016400     05  FILLER       PIC X(8)  VALUE SPACES.
016500     05  FILLER       PIC X(5)  VALUE "DATE ".
016600     05  PRT-DATE     PIC X(8)  VALUE SPACES.
016700     05  FILLER       PIC X(2)  VALUE SPACES.
016800     05  PRT-TIME     PIC X(8)  VALUE SPACES.
016900     05  FILLER       PIC X(10) VALUE SPACES.
017000     05  FILLER       PIC X(8)  VALUE "TREQRPT ".
017100
017200 01  PRINT-HDR2.
017300     05  FILLER       PIC X(10) VALUE "REQ. NO.  ".
017400     05  FILLER       PIC X(11) VALUE "CORP CODE  ".
017500     05  FILLER       PIC X(7)  VALUE "CLASS  ".
017600     05  FILLER       PIC X(9)  VALUE "REQ. DATE".
017700     05  FILLER       PIC X(2)  VALUE SPACES.
017800     05  FILLER       PIC X(11) VALUE "DATE WANTED".
017900     05  FILLER       PIC X(2) VALUE SPACES.
           05  FILLER       PIC X(13) VALUE "DATE RETURNED".
017900     05  FILLER       PIC X(7)  VALUE SPACES.
018000     05  FILLER       PIC X(7)  VALUE "SOQ  UM".
018100     05  FILLER       PIC X(13) VALUE "  REQUISITION".
018200     05  FILLER       PIC X(7)  VALUE " STATUS".
018300
018400 01  DETAIL-LINE.
018500     05  REQ-NO-OUT   PIC X(7).
018600     05  FILLER       PIC X(3)  VALUE SPACES.
018700     05  CORP-CODE-OUT  PIC X(7).
018800     05  FILLER       PIC X(4)  VALUE SPACES.
018900     05  CLASS-OUT    PIC X(4).
019000     05  FILLER       PIC X(3)  VALUE SPACES.
019100     05  REQ-DATE-OUT     PIC X(8).
019200     05  FILLER       PIC X(4)  VALUE SPACES.
019300     05  REQ-DATE-WANT-OUT     PIC X(8).
019400     05  FILLER       PIC X(2)  VALUE SPACES.
           05  FILLER       PIC X(4)  VALUE SPACES.
           05  REQ-DATE-RET-OUT      PIC X(8).
           05  FILLER       PIC X(5)  VALUE SPACES.
019500     05  SOQ-OUT      PIC Z(7)9.
019600     05  FILLER       PIC X(2)  VALUE SPACES.
019700     05  STR-UM-OUT   PIC X(2).
019800     05  FILLER       PIC X(2)  VALUE SPACES.
019900     05  HOLD-STATUS-OUT  PIC X(10).
020000     05  FILLER       PIC X(2)  VALUE SPACES.
020100     05  PRT-REMARK-1 PIC X(38) VALUE SPACES.
020200
020300 01  DOT-LINE.
020400     05  FILLER       PIC X(132) VALUE ALL "-".
020500
       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

       01  HD-RET-CODE                    PIC S9(4) COMP-4 VALUE 0.
       01  HD-FILE-NAME                   PIC X(17) VALUE SPACES.
       01  FNUM                           PIC S9(4) COMP-4 VALUE 0.

       LINKAGE SECTION.

030600 COPY THDPRTB IN COPYLIB.
030700
       01  OPTION-AREA.
           05  FILLER  PIC X(112).
020600
020700
020800 PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-AREA.
020900
021000 PROC-DIV SECTION 01.
021100
021200 BEGIN-HERE.
021300     PERFORM 1-HSK THRU 1-H-X.
021400     SORT SORT-FILE ON ASCENDING KEY SORT-HOLD-STATUS
                                           SORT-REQ-NO
021500         INPUT PROCEDURE IS FIND-OPEN-REQ
021600         OUTPUT PROCEDURE IS WRITE-REPORT.
021700
021800     PERFORM 2-EOJ THRU 2-EOJ-X.
021900     GOBACK.
022000
022100 1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT MPLTINFO-I, MREQ-I, DREQITM-I, MSTORERM-I,
                      DREQDESC-I.

022800******************************************
022900*                                        *
023000*   GET PLANT CODE FROM MPLTINFO USING   *
023100*   P 01 AS KEY TO BE USED ON REPORT HDR *
023200*                                        *
023300******************************************
023400
023500     MOVE "P 01"   TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
023900         MOVE "DBGET ERROR MPLTINFO IN 1-HSK" TO BU-DISPLAY-MSG
024000         GO TO 2-BLOWUP.
024100     MOVE MPLTINFO-COMPANY  TO  PRT-CO.
024200
024400     MOVE 1              TO  DATE-MODE.
024500     CALL "TDATECHK" USING DATE-CHECK-AREA.
024600     MOVE DATE-SLASH-OUT TO  PRT-DATE.
024700     MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
024800
082000     MOVE HD-SPOOLER-NUMBER       TO  OVRPRTF-TOFILE-NUM.
           MOVE "*YES"                  TO  OVRPRTF-SHARED.
082100     MOVE HD-NO-OF-COPIES         TO  OVRPRTF-COPIES.
           PERFORM 996-OVERRIDE-PRINT-FILE.

024300     OPEN OUTPUT ONLINE-PRT.
025100     MOVE "DHDR31.PUB" TO HD-FILE-NAME.
025200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
025300         HD-ROUTE-DATA, ESC-NAME.
025400     IF HD-RET-CODE NOT = 0
025500         MOVE "THDPRT2 ERROR IN 1-HSK" TO BU-DISPLAY-MSG
025600         MOVE "HD-RET-CODE = " TO BU-DISPLAY-FLD (1)
025700         MOVE HD-RET-CODE      TO BU-DISPLAY-FLD9 (1)
025800         GO TO 2-BLOWUP.
025900     CALL "TESCSEQ" USING ESC-NAME.
026000     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
026100     MOVE CHAR-10PI       TO NORMAL-PRINT.
026300
026400 1-H-X.
026500     EXIT.
026600
026700 2-EOJ.
026900     WRITE PRINT-RCD FROM NORMAL-PRINT  AFTER ADVANCING 0.
027000     CLOSE ONLINE-PRT.
           CLOSE MPLTINFO-I, MREQ-I, DREQITM-I, MSTORERM-I,
                 DREQDESC-I.

027500 2-EOJ-X.
027600     EXIT.
027700
027800
027900 2-BLOWUP.
022200     MOVE "TREQRPT" TO BU-PGM-NAME.
028000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
028100        VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
028200            BU-DISPLAY-AREA.
028300
028400 2-BLOWUP-X.
028500     EXIT.
028600
028700
028800 FIND-OPEN-REQ SECTION.
       60-START-MREQ.
           MOVE SPACES TO REQNO OF MREQ-REC-I.
           START MREQ-I KEY > REQNO OF MREQ-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
                   MOVE "START MREQ * 60-SM" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
028900
029000**************************************************
029100*                                                *
029200*   SERIAL READ OF MREQ TO CHECK IF REQ HAS NOT  *
029300*   NOT BEEN RELEASED BY MATCONT WHICH ARE THEN  *
029400*   RELEASED TO THE SORT                         *
029500*                                                *
029600**************************************************
029700
029800 60-GET-MREQ.
           READ MREQ-I NEXT INTO BUF-MREQ
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
030300             GO TO 60-G-M-X
030400         ELSE
030500             MOVE "DBGET 60-GET-MREQ"  TO  BU-DISPLAY-MSG
030600             GO TO 2-BLOWUP.
030700
030800     IF REQ-MATCONT-RELEASE  =  "X"
030900         GO TO 60-GET-MREQ.
031000     IF REQ-STATUS = "SS"
031100         NEXT SENTENCE
031200     ELSE
031300         GO TO 60-GET-MREQ.
031400     MOVE MREQ-NUMBER      TO  SORT-REQ-NO
      *---------- ACCOUNT FOR CENTURY.
031500     MOVE REQ-DATE-CN         TO  SORT-REQ-DATE-CN.
031600     MOVE REQ-DATE-WANTED-CN  TO  SORT-REQ-DATE-WANT-CN.
           MOVE REQ-DATE-RETURN-CN  TO  SORT-REQ-DATE-RET-CN.
031700     IF REQ-HOLD-STATUS  =  SPACES
               IF REQ-APPROVALS-LEFT = "  "
031800             MOVE "MTL. CTL."      TO  SORT-HOLD-STATUS
               ELSE
               IF REQ-APPROVALS-LEFT-9 > 0
                   MOVE "WAIT APP."  TO  SORT-HOLD-STATUS
               ELSE
               MOVE "MTL. CTL."      TO  SORT-HOLD-STATUS
031900     ELSE
032000         MOVE REQ-HOLD-STATUS  TO  SORT-HOLD-STATUS.
032100     PERFORM 60-GET-REQ-ITEM  THRU  60-GRI-X.
032400     GO TO 60-GET-MREQ.
032500
032600**************************************************
032700*                                                *
032800*   GET THE ITEM ON THE REQ IN DREQITM IF THERE  *
032900*   IS NOT ITEM ON THE REQ THEN MOVE 'XXXXXXX'   *
033000*   TO THE CORP-CODE SO THAT THE REQ CAN BE      *
033100*   DEALT WITH                                   *
033200*                                                *
033300**************************************************
033400
033500 60-GET-REQ-ITEM.
033600     MOVE "N"  TO  AT-LEAST-ONE-ITEM.
033700     MOVE MREQ-NUMBER  TO  REQ-ARG.
           MOVE REQ-ARG TO REQNO OF DREQITM-REC-I.
           START DREQITM-I KEY = REQNO OF DREQITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
034100             MOVE "DBFIND ERROR 60-GET-DREQITM" TO BU-DISPLAY-MSG
034200             GO TO 2-BLOWUP.
034300
034400 60-GET-DREQITM.
           READ DREQITM-I NEXT INTO BUF-DREQITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
034900             IF AT-LEAST-ONE-ITEM = "N"
035000                 MOVE "XXXXXXX" TO  SORT-REQ-CODE
035100                 MOVE SPACES    TO  SORT-QTY-UM
035200                 MOVE ZEROS     TO  SORT-SOQ
035300                 RELEASE SORT-RCD
035400                 GO TO 60-GRI-X
035500             ELSE
035600                 GO TO 60-GRI-X
035700         ELSE
035800             MOVE "DBGET ERROR 60-GET-DREQITM"  TO  BU-DISPLAY-MSG
035900             GO TO 2-BLOWUP.
           IF REQNO OF DREQITM-REC-I NOT = REQ-ARG
034900         IF AT-LEAST-ONE-ITEM = "N"
035000             MOVE "XXXXXXX"  TO  SORT-REQ-CODE
035100             MOVE SPACES    TO  SORT-QTY-UM
035200             MOVE ZEROS     TO  SORT-SOQ
035300             RELEASE SORT-RCD
035400             GO TO 60-GRI-X
035500         ELSE
035600             GO TO 60-GRI-X.

036100     MOVE "Y"  TO  AT-LEAST-ONE-ITEM.
036200     MOVE REQITM-CORP-CODE  TO  SORT-REQ-CODE.
036300     MOVE REQITM-QTY-TO-ORD TO  SORT-SOQ.
036400     MOVE REQITM-UM         TO  SORT-QTY-UM.
036500     RELEASE SORT-RCD.
036600     GO TO 60-GET-DREQITM.
036700
036800 60-GRI-X.
036900     EXIT.
037000
037100 60-G-M-X.
037200     EXIT.
037300
037400 WRITE-REPORT SECTION.
037500
037600 61-WRITE-RPT.
037700     IF PAPER-IS-132-COLS
037800          NEXT SENTENCE
037900     ELSE
038000          WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
038200     PERFORM 611-PAGE-HDR.
038300
038400**************************************************
038500*                                                *
038600*  RETURN EACH RECORD FROM SORT AN PUT ON REPORT *
038700*                                                *
038800**************************************************
038900
039000 61-LOOP.
039100     RETURN SORT-FILE
039200         AT END  GO TO 61-REPORT-FINISHED.
039300     PERFORM 61-REQ-REPORT  THRU  61-REQ-REPORT-X.
039400     GO TO 61-LOOP.
039500
039600**************************************************
039700*                                                *
039800*   IF THE SORT FILE IS EMPTY THEN PRINT         *
039900*   MESSAGE STATEING THAT ALL REQ. ARE PROCESSED *
040000*                                                *
040100**************************************************
040200
040300 61-REPORT-FINISHED.
040400     IF AT-LEAST-ONE-REQ  =  "Y"
040500         NEXT SENTENCE
040600     ELSE
040700         MOVE "* ALL REQUISITION HAVE BEEN PROCESSED *"
040800             TO PRINT-LINE
040900         WRITE PRINT-RCD AFTER ADVANCING 2 LINES.
041000     GO TO 61-WR-X.
041100
041200**************************************************
041300*                                                *
041400*   THIS ROUTINE PRINTS EACH ITEM ON THE REPORT  *
041500*   NOTE THAT THIS REPORT IS SET UP TO HANDLE    *
041600*   MULTI ITEM REQUISITION WHICH AT THIS TIME    *
041700*   ARE NOT AVAILABLE BUT WILL BE WHEN MANUAL    *
041800*   REQUISITIONS ARE INTRODUCED                  *
041900*                                                *
042000**************************************************
042100
042200 61-REQ-REPORT.
042300     IF LINE-CTR > 50
042400         PERFORM 611-PAGE-HDR.
042500     MOVE SORT-REQ-NO         TO REQ-NO-OUT.
042600     MOVE 4                   TO  DATE-MODE.
042700     MOVE SORT-REQ-DATE       TO  DATE-VALIDATE-IN.
042800     CALL "TDATECHK" USING DATE-CHECK-AREA.
042900     MOVE DATE-SLASH-OUT      TO  REQ-DATE-OUT.
043000     IF SORT-REQ-DATE-WANT  =  SPACES
043100         MOVE SPACES                TO REQ-DATE-WANT-OUT
043200     ELSE
043300         MOVE SORT-REQ-DATE-WANT  TO  DATE-VALIDATE-IN
043400         CALL "TDATECHK" USING DATE-CHECK-AREA
043500         MOVE DATE-SLASH-OUT      TO  REQ-DATE-WANT-OUT.
      *------------ MOVE DATE RETURNED TO REPORT LINE.
           IF SORT-REQ-DATE-RET  =  SPACES
               MOVE SPACES                TO REQ-DATE-RET-OUT
           ELSE
               MOVE SORT-REQ-DATE-RET   TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT      TO  REQ-DATE-RET-OUT.
043600     MOVE SORT-REQ-CODE       TO CORP-CODE-OUT,
043700                                 CODE-ARG.
043800     IF CODE-ARG NOT = "XXXXXXX"
               MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I
               READ MSTORERM-I INTO BUF-MSTORERM
                  INVALID KEY MOVE FILE-STATUS TO FILE-STATUS END-READ
               IF FILE-STATUS NOT = "00"
044200             MOVE "DBGET ERROR * MSTORERM *61-REQ-REPORT"
044300                              TO BU-DISPLAY-MSG
044400             MOVE CODE-ARG        TO BU-DISPLAY-FLD (1)
044500             GO TO 2-BLOWUP
044600         ELSE
044700             MOVE STR-CLASS   TO CLASS-OUT
044800     ELSE
044900         MOVE SPACES          TO CLASS-OUT.
045000
045100     MOVE SORT-SOQ            TO SOQ-OUT.
045200     MOVE SORT-QTY-UM         TO STR-UM-OUT.
045300     MOVE SORT-HOLD-STATUS    TO HOLD-STATUS-OUT.
045400     PERFORM 611-FIND-REMARKS  THRU 611-FR-X.
045500     MOVE DETAIL-LINE         TO PRINT-LINE.
045600     WRITE PRINT-RCD AFTER ADVANCING 2 LINES.
045700     ADD 2  TO  LINE-CTR.
045800     MOVE "Y"                 TO AT-LEAST-ONE-REQ.
045900
046000 61-REQ-REPORT-X.
046100     EXIT.
046200
046300 611-FIND-REMARKS.
046400     MOVE SPACES                  TO PRT-REMARK-1.
046500     MOVE SORT-REQ-NO             TO REQ-ARG.
           MOVE REQ-ARG TO REQNO OF DREQDESC-REC-I.
           START DREQDESC-I KEY = REQNO OF DREQDESC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
047000             GO TO 611-FR-X
047100         ELSE
047200             MOVE "FIND DREQDESC *611-FR" TO BU-DISPLAY-MSG
047300             GO TO 2-BLOWUP.
047400
047500 611-GET-DREQDESC.
           READ DREQDESC-I NEXT INTO BUF-DREQDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 611-FR-X
               ELSE
048200             MOVE "GET DREQDESC * 611-GD" TO BU-DISPLAY-MSG
048300             GO TO 2-BLOWUP.
           IF REQNO OF DREQDESC-REC-I NOT = REQ-ARG
               GO TO 611-FR-X.
048400     IF REQDESC-LINE-NO = "95" OR "96"
048500         MOVE REQDESC-DATA        TO PRT-REMARK-1
048600     ELSE
048700         GO TO 611-GET-DREQDESC.
048800
048900 611-FR-X.
049000     EXIT.
049100
049200**************************************************
049300*                                                *
049400*   PAGE HEADER ROUTINE                          *
049500*                                                *
049600**************************************************
049700
049800 611-PAGE-HDR.
049900     ADD 1                     TO  PAGE-CTR.
050000     MOVE PAGE-CTR             TO  PAGE-NO-OUT.
050100     MOVE PRINT-HDR1           TO  PRINT-LINE.
050200     WRITE PRINT-RCD  AFTER ADVANCING NEW-PAGE.
050300     MOVE PRINT-HDR2           TO  PRINT-LINE.
050400     WRITE PRINT-RCD  AFTER ADVANCING 2 LINES.
050500     MOVE DOT-LINE             TO  PRINT-LINE.
050600     WRITE PRINT-RCD  AFTER ADVANCING 1 LINES.
050700     MOVE ZEROS                TO  LINE-CTR.
050800
       COPY OVRPFCALL IN COPYLIB.

050900
051000 61-WR-X.
051100     EXIT.
051200
051300
051400 END-OF-PROGRAM SECTION.
051500
051600 END-OF-PGM-PAR.
051700     DISPLAY "*ERROR IN END OF OPEN REQ REPORT*".
