       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TRETHIST.
       AUTHOR.        R L ENSMINGER.
       INSTALLATION.  GTR.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT FILE1
           ASSIGN TO DATABASE-MCFLMM1002
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE2
           ASSIGN TO DATABASE-MCFLMM1102
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
           FILE STATUS IS FILE-STATUS.

           SELECT FILE3
           ASSIGN TO DATABASE-MCFPMM0800
           ORGANIZATION IS RELATIVE
           ACCESS MODE IS RANDOM
           RELATIVE KEY IS PFKEY
           FILE STATUS IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.

       FD  FILE2
           LABEL RECORDS ARE STANDARD.
       01  REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM1102.

       FD  FILE3
           LABEL RECORDS ARE STANDARD.
       01  REC3.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       EJECT
       WORKING-STORAGE SECTION.

       01  FILE-STATUS                      PIC XX.
       01  HISTORY-SEQUENCE                 PIC 9(4).
       01  PFKEY                            PIC 9(9).
       01  PLANT-IDENT1                     PIC X(3).
       01  PLANT-IDENT2                     PIC X(4).
       01  RECORD-TYPE                      PIC X.
       01  STOP-READ                        PIC X.
       01  WO-DATA                          PIC X(850).

       LINKAGE SECTION.

       01  R-SEQUENCE                       PIC X(4).

       EJECT
       PROCEDURE DIVISION USING R-SEQUENCE.

       OPEN-PAR.
           OPEN INPUT FILE1 FILE2 FILE3.

           PERFORM MAIN-PAR THRU MAIN-PAR-EXIT.

           PERFORM END-PAR.

       END-PAR.
           CLOSE FILE1 FILE2 FILE3.

           GOBACK.

       EJECT
       MAIN-PAR.
           MOVE 1 TO PFKEY.
           READ FILE3.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON READ OF FILE3"
             GO TO END-PAR.

           MOVE PLANTIDENT TO PLANT-IDENT1 PLANT-IDENT2.
           IF PLANT-IDENT1 NUMERIC
             NEXT SENTENCE
           ELSE
             DISPLAY "ERROR: INVALID PLANT IDENTIFICATION "
                     PLANT-IDENT1
             GO TO END-PAR.

           MOVE R-SEQUENCE TO HISTORY-SEQUENCE.

      *** WRITE BAD INDEX RECORD TO HISTORY FILE ***

           MOVE "F" TO RECORD-TYPE.
           CALL "THISTORY" USING RECORD-TYPE
                                 WO-DATA
                                 PLANT-IDENT2
                                 HISTORY-SEQUENCE.

      *** GATHER VERBAL WORK ORDERS ***

           MOVE "FF" TO WOSTATUS OF REC1.
           START FILE1
            KEY IS = WOSTATUS OF REC1.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM GET-VERBAL-FF THRU GET-VERBAL-FF-EXIT
              UNTIL STOP-READ = "Y".

      *** GATHER PLANNED WORK ORDERS ***

           MOVE "FF" TO WOSTATUS OF REC2.
           START FILE2
            KEY IS = WOSTATUS OF REC2.
           IF FILE-STATUS = "00"
             MOVE "N" TO STOP-READ
             PERFORM GET-PLNNED-FF THRU GET-PLNNED-FF-EXIT
              UNTIL STOP-READ = "Y".

      *** REWRITE INDEX RECORD TO INDICATE THAT HISTORY IS COMPLETE ***

           MOVE "L" TO RECORD-TYPE.
           CALL "THISTORY" USING RECORD-TYPE
                                 WO-DATA
                                 PLANT-IDENT2
                                 HISTORY-SEQUENCE.

       MAIN-PAR-EXIT.
           EXIT.

       EJECT
       GET-VERBAL-FF.
           READ FILE1 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO GET-VERBAL-FF-EXIT.

           IF WOSTATUS OF REC1 NOT = "FF"
             MOVE "Y" TO STOP-READ
             GO TO GET-VERBAL-FF-EXIT.

           IF BASSEQNUM NOT = R-SEQUENCE
             GO TO GET-VERBAL-FF-EXIT.

           MOVE REC1 TO WO-DATA.

      *** WRITE VERBAL HISTORY RECORDS ***

           MOVE "V" TO RECORD-TYPE.
           CALL "THISTORY" USING RECORD-TYPE
                                 WO-DATA
                                 PLANT-IDENT2
                                 HISTORY-SEQUENCE.

       GET-VERBAL-FF-EXIT.
           EXIT.

       EJECT
       GET-PLNNED-FF.
           READ FILE2 NEXT RECORD.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO GET-PLNNED-FF-EXIT.

           IF WOSTATUS OF REC2 NOT = "FF"
             MOVE "Y" TO STOP-READ
             GO TO GET-PLNNED-FF-EXIT.

           IF PLDSEQNUM NOT = R-SEQUENCE
             GO TO GET-PLNNED-FF-EXIT.

           MOVE REC2 TO WO-DATA.

      *** WRITE PLANNED HISTORY RECORDS ***

           MOVE "P" TO RECORD-TYPE.
           CALL "THISTORY" USING RECORD-TYPE
                                 WO-DATA
                                 PLANT-IDENT2
                                 HISTORY-SEQUENCE.

       GET-PLNNED-FF-EXIT.
           EXIT.
