000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TRETRECN.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER. AS400.
000700 OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZDISPLAY-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.
000800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                         PIC X(2000).
       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           DATA RECORD IS PRINTF.
       01  PRINTF                            PIC X(132).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
000900 WORKING-STORAGE SECTION.
       77  WRITE-YEAR-BUF                    PIC X.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
002800 01  CHECK-YEAR.
002900     05  FILLER                        PIC X.
003000     05  CHECK-YEAR-NUM                PIC 9.
           05  FILLER                        PIC X(4).
003700 01  DBPARAMETERS.                    COPY DBPARMS OF COPYLIB.
005000 01  ERROR-BUFFER.
003900     05  FILLER                        PIC X(40) VALUE SPACES.
004000     05  WO-1-10                       PIC X(10) VALUE SPACES.
004100     05  FILLER                        PIC X(30) VALUE SPACES.
       01  FILE-STATUSES.
           05  DSPLY-STATUS                  PIC XX.
           05  WBF-STATUS                    PIC XX.
           05  WPF-STATUS                    PIC XX.
       01  INPUT-BUFFER.
001800     05  WO-NUMBER.
001900         10  WO-NUMBER6                PIC X(6).
002000         10  WO-NUMBER7                PIC X.
002100         10  WO-NUM-SUFF               PIC XXX.
           05  INPUT-CMD-LINE                PIC X(79).
002200     05  INPUT-ERR-LINE                PIC X(79).
       COPY IOFEEDBACK OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       01  PRINT-LINE.
           05  FILLER  PIC X(5).
           05  P-WO    PIC X(10).
           05  FILLER  PIC XX.
           05  P-RECNO PIC 9(8).
           05  FILLER  PIC X(107).
006300 01  RETURN-CODE                       PIC X.
006400 01  RETURN-SW                         PIC X.
       COPY DBSTAT OF COPYLIB.
006600 COPY TBLOWUP IN COPYLIB.
       01  TRUE-VAL                          PIC 1 VALUE B"1".
       COPY VCOMLINK OF COPYLIB.
006900 01  WO-BASIC-DATA.                   COPY DWOBASIC OF COPYLIB.
009400 01  WO-PLANNED-DATA.                 COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
010000 PROCEDURE DIVISION.
010100 START-PROCESSING.
010200     PERFORM 1-HSK.
010300     PERFORM 6-MAIN.
010400 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE WO-PLANNED-FILE.
011000     GOBACK.
011100 1-HSK.
011200     MOVE LOW-VALUES TO STATUS-AREA VIEW-COMAREA.
           OPEN I-O    DISPLAY-FILE.
           OPEN OUTPUT PRINT-FILE.
           OPEN INPUT WO-BASIC-FILE WO-PLANNED-FILE.
011300     ACCEPT CHECK-YEAR FROM DATE.
011400     IF CHECK-YEAR-NUM = 0
011500         MOVE "A" TO WRITE-YEAR-BUF
011600     ELSE
011700     IF CHECK-YEAR-NUM = 1
011800         MOVE "B" TO WRITE-YEAR-BUF
011900     ELSE
012000     IF CHECK-YEAR-NUM = 2
012100         MOVE "C" TO WRITE-YEAR-BUF
012200     ELSE
012300     IF CHECK-YEAR-NUM = 3
012400         MOVE "D" TO WRITE-YEAR-BUF
012500     ELSE
012600     IF CHECK-YEAR-NUM = 4
012700         MOVE "E" TO WRITE-YEAR-BUF
012800     ELSE
012900     IF CHECK-YEAR-NUM = 5
013000         MOVE "F" TO WRITE-YEAR-BUF
013100     ELSE
013200     IF CHECK-YEAR-NUM = 6
013300         MOVE "G" TO WRITE-YEAR-BUF
013400     ELSE
013500     IF CHECK-YEAR-NUM = 7
013600         MOVE "H" TO WRITE-YEAR-BUF
013700     ELSE
013800     IF CHECK-YEAR-NUM = 8
013900         MOVE "J" TO WRITE-YEAR-BUF
014000     ELSE
014100     IF CHECK-YEAR-NUM = 9
               MOVE "K" TO WRITE-YEAR-BUF.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE SPACES TO PRINTF.
           WRITE PRINTF AFTER ADVANCING NEW-PAGE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
023500 6-MAIN.
           MOVE SPACES TO ERROR-BUFFER INPUT-BUFFER.
023600     PERFORM 621-WRITE-SCREEN THRU 621-WS-EXIT
024200         UNTIL VIEW-LASTKEY = 3.
024300*
024400*    PUT UP SCREEN
024500*
024600 621-WRITE-SCREEN.
013200     MOVE "FDISPWON" TO VIEW-CFNAME.
           IF ERROR-BUFFER = SPACES
               MOVE SPACES TO INPUT-BUFFER
               MOVE WRITE-YEAR-BUF TO WO-NUMBER7
               MOVE SPACES TO ERROR-BUFFER
               MOVE INPUT-BUFFER TO DSPLY-REC
           ELSE
014500*    MOVE WRITE-YEAR-BUF TO WO-NUMBER7
           MOVE ERROR-BUFFER TO INPUT-ERR-LINE
           MOVE INPUT-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO INPUT-BUFFER.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
018400*
018500*    ALIGN WORK ORDER NUMBER
018600*
018700     CALL "TALWONO" USING WO-NUMBER RETURN-CODE.
018800     IF RETURN-CODE = "1"
018900         MOVE "0" TO RETURN-CODE
019100         MOVE 47004 TO CATREAD-MSG-NUMBER
019300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
019500         MOVE WO-NUMBER TO WO-1-10
               MOVE TRUE-VAL TO INDS (1) INDS (99)
019900         GO TO 621-WRITE-SCREEN.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 621-WS-CONT.
           READ WO-BASIC-FILE INTO WO-BASIC-DATA
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF WO-NUMBER NOT = WONUM OF WBFREC MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 621-WRITE-SCREEN.
           MOVE SPACES TO PRINT-LINE.
           MOVE WO-NUM TO P-WO.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE IO-REL-NO TO P-RECNO.
           WRITE PRINTF FROM PRINT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES TO INPUT-BUFFER.
           GO TO 621-WS-EXIT.
       621-WS-CONT.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUMBER TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (98)
               MOVE ERROR-BUFFER TO INPUT-CMD-LINE
               MOVE INPUT-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               GO TO 6-MAIN.
           READ WO-PLANNED-FILE INTO WO-PLANNED-DATA
               INVALID KEY    MOVE 15 TO COND-WORD.
           IF WO-NUMBER NOT = WONUM OF WPFREC MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE 49002 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               GO TO 621-WRITE-SCREEN.
           MOVE SPACES TO PRINT-LINE.
           MOVE WO-NUM-PLANNED TO P-WO.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE IO-REL-NO TO P-RECNO.
           WRITE PRINTF FROM PRINT-LINE AFTER ADVANCING 1 LINES.
           MOVE SPACES TO INPUT-BUFFER.
       621-WS-EXIT.    EXIT.
040000
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       COPY OVRPFCALL OF COPYLIB.

040700 999-CATREAD.
040800     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
042300 999-CATREAD-EXIT.    EXIT.
