000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TRLSEINQ.
000400 AUTHOR.              BARBARA WINTER.
000500 DATE-WRITTEN.        MAY   1988.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.    CSIS/MMIS UPDATE RELEASE VERSION INQUIRY.
001000*************************************************************
001100*************************************************************
001200**                    R L S E I N Q                        **
001300**                                                         **
001400**      THIS IS THE INQUIRY PROGRAM THAT WILL SHOW         **
001500**      SOFTWARE RELEASE AND UPDATE DATE.                  **
001600**      THIS IS THE MAIN PROGRAM ONLY.  IT OPENS FILES     **
001700**      AND THE DATABASE AND THEN CALLS THE SCREEN PROGRAM.**
001800*************************************************************
001900*************************************************************
002000
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.    HP-3000.
002400 OBJECT-COMPUTER.    HP-3000.
002500 INPUT-OUTPUT SECTION.
002600 DATA DIVISION.
002700 FILE SECTION.
002800 WORKING-STORAGE SECTION.
003800 COPY VCOMAREA OF COPYCSIS.
       01  BASE              PIC X(10).
004600
004700 COPY LANGUAGE OF COPYCSIS.
004800
004900 PROCEDURE DIVISION.
005000 00-CONTROL.
005100
005400     PERFORM 100-CALL-SRLSEINQ        THRU 199-EXIT.
005700
005800     GOBACK.
005900
010800
010900 100-CALL-SRLSEINQ.
           MOVE "ZCSISINQ" TO VIEW-CFNAME.
011000     CALL "SRLSEINQ" USING BASE,
011100                          VIEW-COMAREA,
011200                          LANGUAGE-PARMS.
011300 199-EXIT.  EXIT.
