000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TRMCORR.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        11/26/84.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*
001100*    THIS IS THE CORRECTION TO BANBURY EXPLOSION PROGRAM.
001200*    THIS PROGRAM IS USED TO CORRECT ANY ERRORS FOUND ON THE
001300*    BANBURY EXPLOSION ERROR REPORT.  IT CALLS THE SUBPROGRAM
001400*    "TIRSNGL", THE SINGLE ISSUE/RETURN FROM STORES PROGRAM.
001500*    THE ONLY ACTUAL DIFFERENCE BETWEEN THE BANBURY CORRECTIONS
001600*    AND A NORMAL ISSUE OR RETURN IS THAT THE PRODUCTION DATE OF
001700*    THE BANBURY PRODUCTION BEING CORRECTED IS ENTERED ON
001800*    THE SCREEN.  THIS PRODUCTION DATE IS PLACED IN THE WORKORDER
001900*    FIELD IN THE TRANSACTION - KEYING THE CUTOFF PROGRAM
002000*    "XCDLYABS" THAT THIS CORRECTION IS FOR THE SPECIFIED PROD.
002100*    DATE.  THIS IS USED TO UPDATE USAGE, AND FOR SPECIAL MONTH-
002200*    END PROCESSING.  CIH.
002300*
002400*    ON JANUARY 21, 1985, ADDED A DUMMY PARAMETER TO THE CALL
002500*    OF THE SUBPROGRAM "TMTLSTAT" - MATERIAL STATUS INQUIRY.
002600*    THIS IS A DUMMY CORPORATE CODE PARAMETER - USED BY PROGRAMS
002700*    THAT MAY PASS THE CORP CODE TO THE INQUIRY, THUS BYPASSING
002800*    THE CORPORATE CODE ENTRY SCREEN.  IF THE PASSED CODE IS SPACES,
002900*    THE CODE ENTRY SCREEN IS BROUGHT, AND THE CODE PARAMETER IS
003000*    IGNORED.  CIH.
003100*
003200*
003300*
003400*   10/ 8/85  ADDED CALLS TO FINDJCW, NLAPPEND, CATOPEN, AND *
003500*             CATCLOSE IN ORDER TO ACCOMODATE THE NATIVE     *
003600*             LANGUAGE SUPPORT FACILITY.  ADDED LINKAGES AND *
003700*             ALSO MADE THE CHANGE TO THE FORMFILE NAMES.    *
003800*             CHANGED ALL REFERENCES OF TSCRPRNT TO TSCRPRT2,*
003900*             TDATECHK TO TDATECK2.                          *
004000*             THIS WAS TO INCORPORATE THE NATIVE LANGUAGE    *
004100*             SUPPORT VERSIONS OF THESE SUBROUTINES.         *
004200*                                         PD RAGLOW.         *
      *C
      *C   25FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
004300**************************************************************
004400
004600 ENVIRONMENT DIVISION.
004700 CONFIGURATION SECTION.
004800 SOURCE-COMPUTER.  HP-3000.
004900 OBJECT-COMPUTER.  HP-3000.
       COPY SPECIALN IN COPYLIB.
005000
005100 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZRMCORR-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.

005200 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC        PIC X(1500).

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
005300 WORKING-STORAGE SECTION.
005400
005500 77  SAVE-LASTKEY                 PIC S9(4) BINARY VALUE 0.
005600 77  SUB                          PIC 9(1)  VALUE 0.
005700 77  SAVE-PGM-KEY                 PIC X(3).
       77  MCXCBLERR-SCOPE              PIC X(1)  VALUE "C".
005800
005900**************************************************************
006000**                                                          **
006100**          S U B P R O G R A M   A R E A                   **
006200**                                                          **
006300**************************************************************
006400
006500 COPY ESCNAM2    IN COPYLIB.
006600 COPY TBLOWUP    IN COPYLIB.
006700 COPY CSWITCHF   IN COPYLIB.
006800 COPY TSHWRDFM   IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
006900 COPY MULTSTR    IN COPYLIB.
007000
007100 01  STORES-COMAREA.
007200     05  SCOM-PGM-KEY              PIC X(3)  VALUE SPACES.
007300     05  FILLER                    PIC X(21) VALUE SPACES.
007400
007500 01  RET-CODE                      PIC X(2)  VALUE SPACES.
007600**************************************************
007700**   PARAMETERS FOR INTRINSIC CALL TO "FINDJCW" **
007800**************************************************
007900
008000 01  JCW-NAME                     PIC X(6)  VALUE "STORES".
008100 01  JCW-VALUE                    PIC S9(4) BINARY VALUE 0.
008200 01  JCW-STATUS                   PIC S9(4) BINARY VALUE 0.
008300
008400*---------- DUMMY CODE PARM FOR CALL TO "TMTLSTAT"
008500 01  DUMMY-CODE-PARM               PIC X(7)  VALUE SPACES.
008600
008700**************************************************************
008800**                                                          **
008900**                  V I E W   W O R K                       **
009000**                                                          **
009100**************************************************************
009200
009300 COPY VCOMAREA   IN COPYLIB.
009400 01  MESSAGE-BUFFER.
009500     05  MSG-TEXT.
               10  MESSAGE-BUFFER-1        PIC X(1)  VALUE SPACES.
               10  FILLER                  PIC X(67) VALUE SPACES.
009600     05  MSG-FLD                     PIC X(8)  VALUE SPACES.
009700     05  MSG-FLD-9 REDEFINES MSG-FLD PIC ZZZZZZZ9.
009800
009900 01  MSG-BUFFLEN          PIC S9(4)  BINARY VALUE 76.
010000 01  MSG-ACTUALEN         PIC S9(4)  BINARY VALUE 76.
010100
010200 01  FORMFILE.
010300     05  FORM-FNAME                PIC X(8)  VALUE "FRMCORR".
010400     05  FILLER                    PIC X     VALUE ".".
010500     05  FORM-GNAME.
010600         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
010700         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
010800     05  FILLER                    PIC X(19) VALUE SPACES.
010900
011000 01  FIELD-NUMBER         PIC S9(4) BINARY VALUE 1.
011100 01  SCREEN-BUFFLEN       PIC S9(4) BINARY VALUE 408.
011200 01  NUMBER-OF-FORMS      PIC S9(4) BINARY VALUE 21.
011300
       01  DE-FIELDS.
           05  DE-COMMAND-LINE           PIC X(79).
           05  DE-MESSAGE-LINE           PIC X(79).

012000**************************************************************
012100**                                                          **
012200**            D A T A B A S E   W O R K                     **
012300**                                                          **
012400**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
012500
012600 01  BASE                       PIC X(10) VALUE "  STORES;".
012700 01  BASE-2                     PIC X(20) VALUE SPACES.
012800 01  PASSWORD                   PIC X(5)  VALUE "JADE;".
012900 01  MMIS-BASE                  PIC X(8)  VALUE "  MMISA;".
013000 01  MMIS-PASSWORD              PIC X(7)  VALUE "DO-ALL;".
013100
013200 COPY DBSTAT     IN COPYLIB.
013300 01  DSET-NAMES.
013400     05  DSET-DUMMY             PIC X(2)  VALUE SPACES.
013500
013600 01  MODE-AREA.
013700     05  MODE1                  PIC S9(4) BINARY VALUE 1.
013800     05  MODE7                  PIC S9(4) BINARY VALUE 7.
013900
014000 01  PLT-ARG                    PIC X(4)  VALUE "P 01".
014100
       COPY MPLT0 IN COPYLIB.
       COPY MPLTP01 IN COPYLIB.

014200**************************************
014300*                                    *
014400*    NATIVE LANGUAGE SUPPORT AREA    *
014500*                                    *
014600**************************************
014700
014800 COPY LANGUAGE   IN COPYLIB.
014900
015100 PROCEDURE DIVISION.
015200 1-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

015300*--------- MULTIPLE STOREROOM DATA DOES NOT APPLY TO THIS MODULE.
015400*--------- ONLY SINGLE ISSUE/RETURN ARE USED, MULT STR APPLIES ONLY
015500*--------- TO WORKSHEETS.
015600     MOVE SPACES                   TO   MULTIPLE-STR-DATA.
015700
015800     CALL "TESCSEQ" USING ESC-NAME.
           PERFORM 9999-OPEN-STUFF.
015900
019000*------- USE SUBPROG TO OPEN FORMFILE - HANDLES VIEW ERRORS
019100     MOVE "Y"                      TO   CSF-FIRST-OPENFORMF-FLAG.
019200     PERFORM 7150-CALL-CSWITCHF.
019300
019400*------- HANDLE POSSIBLE VIEW ERRORS ON OPENTERM
021200     PERFORM 6-MAIN THRU 6-MAIN-X.
021300
021400 2-EOJ.
           PERFORM 9999-CLOSE-STUFF.
           GOBACK.
022100
022200 2100-BLOWUP.
022300     MOVE "TRMCORR"                TO   BU-PGM-NAME.
022400     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
022500       VIEW-COMAREA FILE-STATUS BU-DISPLAY-MSG
022600       BU-DISPLAY-FLDS.
022700
024100 6-MAIN.
024200     MOVE "RMCORRMAIN" TO VIEW-NFNAME.
           PERFORM 9951-GETNEXTFORM.
024700
024800 61-SHOWFORM.
024900*----- f1,f2,F3,f6,f7,f8 APPLICATION, f4 REFRESH, f5 PRINT f7 CLR
025000     MOVE 1                        TO   SRF-KEYSET.
025100*-------  MOVE "I" TO   SRF-FKEY (3).
           PERFORM 9953-PUTBUFFER.
           PERFORM 998-WRITE-SCREEN THRU 9989-WS-X.
           IF MESSAGE-BUFFER-1 NOT = SPACES
               PERFORM 9954-SETERROR
               GO TO 61-SHOWFORM.

025800     IF VIEW-LASTKEY = 8 OR 3
025900         GO TO 6-MAIN-X
026000     ELSE
026100     IF VIEW-LASTKEY = 1
026200         MOVE "RM1"            TO  SCOM-PGM-KEY
026300         CALL "TIRSNGL" USING BASE, MMIS-BASE, STATUS-AREA,
026400           VIEW-COMAREA, STORES-COMAREA, SRF-COMAREA,
026500           SRF-SPOOLER-REC, LANGUAGE-PARMS, MULTIPLE-STR-DATA,
026600           ESC-NAME
026700     ELSE
026800     IF VIEW-LASTKEY = 2
026900         MOVE "RM2"           TO  SCOM-PGM-KEY
027000         CALL "TIRSNGL" USING BASE, MMIS-BASE, STATUS-AREA,
027100           VIEW-COMAREA, STORES-COMAREA, SRF-COMAREA,
027200           SRF-SPOOLER-REC, LANGUAGE-PARMS, MULTIPLE-STR-DATA,
027300           ESC-NAME
027400     ELSE
027500     IF VIEW-LASTKEY = 6
027600         PERFORM 611-MATERIAL-STATUS THRU 612-MT-X.
027700
027800     PERFORM 9955-CLEAR-FORM.
027900
028000     GO TO 6-MAIN.
028100
028200 6-MAIN-X.
028300     EXIT.
028400
028500 611-MATERIAL-STATUS.
028600     MOVE "FCSISINQ"               TO   CSF-NEW-FORMFILE-NAME.
028700     MOVE "N"                      TO   CSF-MODE.
028800     PERFORM 7150-CALL-CSWITCHF.
028900     IF CSF-OPENFORM-ERR-SW = "Y"
029000         GO TO 612-MT-X.
029100
029200     CALL "TMTLSTAT" USING BASE, VIEW-COMAREA,
029300       SRF-MPLTINFO-COMPANY, SRF-SPOOL-PRT-NO, DUMMY-CODE-PARM,
029400       LANGUAGE-PARMS.
029500
029600     MOVE "O"                      TO   CSF-MODE.
029700     PERFORM 7150-CALL-CSWITCHF.
029800
029900 612-MT-X.
030000     EXIT.
030100
030200 7150-CALL-CSWITCHF.
030300     CALL "CSWITCHF" USING VIEW-COMAREA, LANGUAGE-PARMS,
030400       FORMFILE, CSF-PARMS, BU-DISPLAY-MSG.
030500     IF BU-DISPLAY-MSG-1 NOT = SPACES
030600         PERFORM 2100-BLOWUP.
030700
       COPY DISPCALL IN COPYLIB.
       COPY DISPCAL2 IN COPYLIB.
       COPY HCATREAD IN COPYLIB.

       9930-LOCK.
       9940-UNLOCK.
       9951-GETNEXTFORM.
       9952-GETBUFFER.
           MOVE DISPLAY-REC TO DE-FIELDS.

       9953-PUTBUFFER.
           MOVE DE-FIELDS TO DISPLAY-REC.

       9954-SETERROR.
           MOVE B"1" TO IND (99).
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.

       9955-CLEAR-FORM.
           MOVE SPACES TO DE-FIELDS, MESSAGE-BUFFER.

       9956-PUTWINDOW.
       9957-FIELDEDITS.
       9958-INITFORM.
       9959-SHOWFORM.
       9960-SETKEYLABEL.
       9961-AUTOREAD.
       9962-OPENFORM.
       9963-CLOSEFORM.
       9964-FINISHFORM.

       9999-DBGET7-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET7 ERR 9999-DBGET7-MPLTINFO-PK-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN I-O DISPLAY-FILE.
           OPEN INPUT MPLTINFO-PK-I                              .

       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE.
           CLOSE      MPLTINFO-PK-I                              .
