       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TRPTSEYM.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM REPORTS ON MSTORERM CORPORATELY CODED     **
      ** ITEMS IN AN ATTEMPT TO SQUELCH STOCKOUT CONDITIONS.    **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CC-FILE
                  ASSIGN TO DATABASE-DCCFILE
                  ORGANIZATION IS SEQUENTIAL.

           SELECT DPOITEM-I
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD-I
               ASSIGN TO DATABASE-MCFLCS2101
               ORGANIZATION IS INDEXED
                 ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQITM-I
               ASSIGN TO DATABASE-MCFLCS2202
               ORGANIZATION IS INDEXED
                 ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MBUYER-I
               ASSIGN TO DATABASE-MCFLCS0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
               ASSIGN TO DATABASE-MCFLCS2001
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PER-PERSONNEL
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  CC-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 8 CHARACTERS.
       01  CC-RCD.
           05  CC-NUMBER         PIC X(8).

       FD  DPOITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC-I.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DREQD-I
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC-I.
           COPY DDS-MCRPCS2100  OF MCFLCS2101.

       FD  DREQITM-I
           LABEL RECORDS ARE STANDARD.
       01  DREQITM-REC-I.
           COPY DDS-MCRPCS2200  OF MCFLCS2202.

       FD  MBUYER-I
           LABEL RECORDS ARE STANDARD.
       01  MBUYER-REC-I.
           COPY DDS-MCRPCS0600  OF MCFLCS0601.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-MCRPCS2000  OF MCFLCS2001.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PP-REC.
           COPY DDS-MCRPMM0300  OF MCFLMM0301.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                     PIC X(132).

       SD  SORT-FILE RECORD CONTAINS 410 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-CORPCDE              PIC X(8).
           05  SORT-BINLOC               PIC X(12).
           05  SORT-LEADTIME             PIC 9(4).
           05  SORT-LASTIDAT             PIC X(8).
           05  SORT-MTHFRCST             PIC 9(8).
           05  SORT-ONHAND               PIC 9(8).
           05  SORT-MAX                  PIC 9(8).
           05  SORT-ONORDER              PIC 9(8).
           05  SORT-LASTREQ              PIC X(12).
           05  SORT-REQDATE              PIC X(8).
           05  SORT-DESC1                PIC X(80).
           05  SORT-DESC2                PIC X(80).
           05  SORT-DESC3                PIC X(80).
           05  SORT-DESC4                PIC X(80).
           05  FILLER                    PIC X(6).

       WORKING-STORAGE SECTION.
       77  LINE-CTR                      PIC 99.
       77  REQS-PER-PAGE-CTR             PIC 9.

       01  BASE-MMISA                    PIC X(24).

       COPY CATREAD  IN COPYLIB.

       01  COMPANY-SAVE                  PIC XXX.

       COPY CCRTFILE IN COPYLIB.

       01  DETAIL-LINE-1.
           05  D-LEADTIME                PIC Z(4).
           05  FILLER                    PIC XX.
           05  D-BINLOC                  PIC X(12).
           05  FILLER                    PIC XX.
           05  D-CORPCDE                 PIC X(8).
           05  FILLER                    PIC XX.
           05  D-DESC                    PIC X(40).
           05  FILLER                    PIC XX.
           05  D-LASTIDAT                PIC X(8).
           05  FILLER                    PIC X.
           05  D-MTHFRCST                PIC Z(7)9.
           05  FILLER                    PIC X.
           05  D-MAX                     PIC Z(7)9.
           05  FILLER                    PIC X.
           05  D-ONORDER                 PIC Z(7)9.
           05  FILLER                    PIC X.
           05  D-LASTREQ                 PIC X(12).
           05  FILLER                    PIC X.
           05  D-REQDATE                 PIC X(8).
           05  FILLER                    PIC X(3).

       01  DETAIL-LINE-1A.
           05  FILLER                    PIC X(30).
           05  D-DESC2                   PIC X(40).
           05  FILLER                    PIC X(62).

       01  DETAIL-LINE-2.
           05  FILLER                    PIC X.
           05  D-CC                      PIC X(8).
           05  FILLER                    PIC X(2).
           05  D-QTY                     PIC Z(7)9.9(4).
           05  FILLER                    PIC X.
           05  D-UM                      PIC XX.
           05  FILLER                    PIC X.
           05  D-ESTPRICE                PIC Z(10)9.9(4).
           05  FILLER                    PIC X(3).
           05  D-BGTAMT                  PIC Z(12).
           05  FILLER                    PIC X(3).
           05  D-BGTNO                   PIC X(14).

       01  DETAIL-LINE-2B.
           05  D-DATEWANT                PIC X(8).
           05  FILLER                    PIC XX.
           05  D-COMPANY                 PIC X(3).
           05  FILLER                    PIC X.
           05  D-PRIME                   PIC X(3).
           05  FILLER                    PIC X.
           05  D-CLS                     PIC X(3).
           05  FILLER                    PIC X.
           05  D-DEPT                    PIC X(4).
           05  FILLER                    PIC X.
           05  D-EXPNW                   PIC X(6).
           05  FILLER                    PIC X(3).
           05  D-STAG                    PIC X(4).
           05  FILLER                    PIC X.
           05  D-ORIG                    PIC X(4).
           05  FILLER                    PIC X.
           05  D-ORIGNAME                PIC X(16).
           05  FILLER                    PIC XX.
           05  D-WO                      PIC X(10).

       01  DETAIL-LINE-3.
           05  D-ADDLINFO                PIC X(16).
           05  FILLER                    PIC XX.
           05  D-SUGGVEND                PIC X(30).
           05  FILLER                    PIC XX.
           05  D-TYPE                    PIC X.
           05  FILLER                    PIC X(5).
           05  D-MOD                     PIC X.
           05  FILLER                    PIC X(5).
           05  D-PATH                    PIC X(3).
           05  FILLER                    PIC X(4).
           05  D-APPLEFT                 PIC -9.
           05  FILLER                    PIC X(9).

       01  DETAIL-LINE-4.
           05  D-DESC-4                  PIC X(80).

       01  DETAIL-LINE-5.
           05  D-REMARKS                 PIC X(80).

       01  DETAIL-LINE-6.
           05  FILLER                    PIC XX.
           05  D-PO.
               10  D-PO-7                PIC X(7).
               10  D-PO-REL              PIC X(3).
           05  FILLER                    PIC X(5).
           05  D-ORDERED                 PIC Z(7)9.9(4).
           05  FILLER                    PIC X(4).
           05  D-UM-6                    PIC X(2).
           05  FILLER                    PIC X(2).
           05  D-DLVR                    PIC Z(7)9.9(4).
           05  FILLER                    PIC X(3).
           05  D-DATEDLVR                PIC X(8).
           05  FILLER                    PIC X(4).
           05  D-BLANKET                 PIC X(7).
           05  FILLER                    PIC X(7).

       01  DETAIL-LINE-7.
           05  D-MESSAGE-1               PIC X(30).
           05  D-MESSAGE-2               PIC X(29).
           05  FILLER                    PIC X(21).

       01  DLVTIME-WA.
           05  DLVTIME                   PIC 9(4).
           05  DLVTIME-X REDEFINES DLVTIME
                                         PIC X(4).

       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

       01  HEADER-0.
           05  H0-DATE                   PIC X(8) VALUE SPACES.
           05  FILLER                    PIC X(4) VALUE SPACES.
           05  H0-TIME                   PIC X(6) VALUE SPACES.
           05  FILLER                    PIC X(114) VALUE SPACES.

       01  HEADER-1.
           05  FILLER                    PIC X(4)  VALUE "  LT".
           05  FILLER                    PIC XX    VALUE SPACES.
           05  FILLER                    PIC X(12) VALUE "LOCATION    ".
           05  FILLER                    PIC XX    VALUE SPACES.
           05  FILLER                    PIC X(10) VALUE "CORPCODE  ".
           05  FILLER                    PIC X(40) VALUE "DESCDTA".
           05  FILLER                    PIC XX    VALUE SPACES.
           05  FILLER                    PIC X(8)  VALUE "LASTIDAT".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(8)  VALUE "AVGMTHUS".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(8)  VALUE "     MAX".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(8)  VALUE " ONORDER".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(12) VALUE "LAST REQNUM".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(8)  VALUE "REQ DATE".
           05  FILLER                    PIC X(3)  VALUE SPACES.

       01  HEADER-2.
           05  FILLER                    PIC X(17)
               VALUE "OUTSTANDING REQ:".
           05  H2-REQ                    PIC X(12) VALUE SPACES.
           05  FILLER                    PIC X(21) VALUE SPACES.
           05  FILLER                    PIC X(5)  VALUE "DATE ".
           05  H2-DATE                   PIC X(8)  VALUE SPACES.
           05  FILLER                    PIC X(24) VALUE SPACES.

       01  HEADER-2A.
           05  FILLER                    PIC X(9)  VALUE "CORP CODE".
           05  FILLER                    PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(8)  VALUE "QUANTITY".
           05  FILLER                    PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE "UM".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(15)
               VALUE "ESTIMATED PRICE".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(13)
               VALUE "BUDGET AMOUNT".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(13)
               VALUE "BUDGET NUMBER".
           05  FILLER                    PIC X(4)  VALUE SPACES.

       01  HEADER-2B.
           05  FILLER                    PIC X(10) VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE "CO".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE "PRM".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(3)  VALUE "CLS".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(4)  VALUE "DEPT".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(6)  VALUE "EXP/NW".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "STAG".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(4)  VALUE "ORIG".
           05  FILLER                    PIC X     VALUE SPACE.
           05  FILLER                    PIC X(15)
               VALUE "ORIGINATOR NAME".
           05  FILLER                    PIC XX    VALUE SPACES.
           05  FILLER                    PIC X(9)  VALUE "WORKORDER".
           05  FILLER                    PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X(3)  VALUE "APP".
           05  FILLER                    PIC X     VALUE SPACE.

       01  HEADER-3.
           05  FILLER                    PIC X(15)
               VALUE "ADDITIONAL INFO".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(16)
               VALUE "SUGGESTED VENDOR".
           05  FILLER                    PIC X(15) VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "TYPE".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "MOD?".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(4)  VALUE "PATH".
           05  FILLER                    PIC X(2)  VALUE SPACES.
           05  FILLER                    PIC X(8)  VALUE "APP LEFT".
           05  FILLER                    PIC X(5)  VALUE SPACES.

       01  HEADER-4.
           05  FILLER                    PIC X(28)
               VALUE "FIRST 3 LINES OF DESCRIPTION".
           05  FILLER                    PIC X(52) VALUE SPACES.

       01  HEADER-5.
           05  FILLER                    PIC X(7)  VALUE "REMARKS".
           05  FILLER                    PIC X(73) VALUE SPACES.

       01  HEADER-6.
           05  FILLER                    PIC X(14)
               VALUE "PURCHASE ORDER".
           05  FILLER                    PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE "ORDERED".
           05  FILLER                    PIC X(7)  VALUE SPACES.
           05  FILLER                    PIC X(2)  VALUE "UM".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(9)  VALUE "DELIVERED".
           05  FILLER                    PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(9)  VALUE "DATE DLVR".
           05  FILLER                    PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(7)  VALUE "BLANKET".
           05  FILLER                    PIC X(7)  VALUE SPACES.

       01  HEADER-7.
           05  FILLER                    PIC X(7)  VALUE "BUYER: ".
           05  H7-BUYER                  PIC X(16) VALUE SPACES.
           05  FILLER                    PIC X(57) VALUE SPACES.

       01  HEADER-8.
           05  FILLER                    PIC X(17)
               VALUE "REQUESTING DEPT: ".
           05  H8-REQDEPT                PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X(57) VALUE SPACES.

       01  MESSAGE-BUFFER                PIC X(80).

006600 01  REQ-DESC-AREA.
006700     05  RQD-LINES                 PIC S9(4) COMP-4.
006800     05  RQD-ITEMS-DESC OCCURS 5 TIMES.
006900         10  RQD-ITEM              PIC X(4).
007000         10  RQD-DESC              PIC X(80).
007100
       01  REQ-STATUS-CREQREM            PIC X(2).

       01  REQ-REMARKS.
           05  REQ-REMARK-1              PIC X(79).
           05  REQ-REMARK-2              PIC X(79).

       01  WORK-LEADTIME                 PIC 9(4).
      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY CDESC    IN COPYLIB.
       COPY LANGSUB  IN COPYLIB.
       COPY SONORDER IN COPYLIB.
       COPY TBLOWUP  IN COPYLIB.
013000 COPY TCHKBLKT   IN COPYLIB.
       COPY TDATECHK IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.
       01  CODE-ARG                      PIC X(8).

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       COPY DPOITEM  IN COPYLIB.
       COPY DREQD    IN COPYLIB.
       COPY DREQITM  IN COPYLIB.
       01  PER-CC-BUF.           COPY MPERSONL IN COPYLIB.
       COPY MBUYER   IN COPYLIB.
       COPY MREQ     IN COPYLIB.
       COPY MSTORERM IN COPYLIB.

       PROCEDURE DIVISION.
       START-PGM SECTION.
       BEGIN.
           OPEN INPUT  DPOITEM-I.
           OPEN INPUT  DREQD-I.
           OPEN INPUT  DREQITM-I.
           OPEN INPUT  MBUYER-I.
           OPEN INPUT  MREQ-I.
           OPEN INPUT  MSTORERM-I.
           OPEN INPUT  PER-PERSONNEL.
           MOVE "MCPRT" TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
      ***************************************************************
      **   CREATE TEMPORARY FILE ('DCCFILE') TO CONTAIN ALL REQS  ' *
      **   IN THE DATABASE THAT ARE NOT ASSIGNED TO A PURCHASE      *
      **   ORDER.                                                   *
      ***************************************************************
           MOVE "*LIBL"       TO CCRTFILE-LIBRARY.
           MOVE "DCCFILE"     TO CCRTFILE-FILE.
           MOVE "0008"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "10000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "01"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'DCCFILE' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.
           OPEN OUTPUT CC-FILE.
           MOVE 2 TO REQS-PER-PAGE-CTR.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO H0-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO H0-TIME.
           MOVE 58 TO LINE-CTR.
           SORT SORT-FILE DESCENDING KEY SORT-LEADTIME
               INPUT PROCEDURE  7-SORT-RECORDS
               OUTPUT PROCEDURE 8-WRITE-REPORT.
           CLOSE CC-FILE.
           OPEN INPUT CC-FILE.
       READ-CC-LOOP.
           READ CC-FILE
               AT END GO TO 2-EOJ.
           MOVE CC-NUMBER TO CORPCDE OF DREQITM-REC-I.
           START DREQITM-I KEY >= CORPCDE OF DREQITM-REC-I
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO READ-CC-LOOP.
       READ-DREQITM-LOOP.
           READ DREQITM-I NEXT INTO BUF-DREQITM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "46"
                   GO TO READ-MREQ
               ELSE
               MOVE "READ ERROR DREQITM " TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           IF REQITM-CORP-CODE NOT = CC-NUMBER GO TO READ-CC-LOOP.
       READ-MREQ.
           MOVE REQITM-REQ-NUMBER TO REQNO OF MREQ-REC-I.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO READ-DREQITM-LOOP.
       READ-DREQD.
           MOVE REQITM-REQ-NUMBER TO REQNO OF DREQD-REC-I.
           READ DREQD-I INTO BUF-DREQD
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO READ-DREQITM-LOOP.
       READ-DPOITEM.
           MOVE DREQD-PO-RCV-NO TO PORCVNO OF DPOITEM-REC-I.
           MOVE DREQD-PO-ITM-NO TO ITEMNO OF DPOITEM-REC-I.
           READ DPOITEM-I INTO BUF-DPOITEM
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO READ-DREQITM-LOOP.
           IF ITM-QTY-DLVR-X = "            "
               NEXT SENTENCE
           ELSE
           IF ITM-QTY-DLVR >= ITM-QTY-ORD GO TO READ-DREQITM-LOOP.
       WRITE-Q8-FORMAT.
           MOVE REQITM-REQ-NUMBER TO H2-REQ.
           MOVE 4 TO DATE-MODE.
           MOVE REQ-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO H2-DATE.
           IF REQS-PER-PAGE-CTR = 2
               MOVE 0 TO REQS-PER-PAGE-CTR
               WRITE PRINT-REC FROM HEADER-2 AFTER ADVANCING NEW-PAGE
           ELSE
           MOVE SPACES TO PRINT-REC
           WRITE PRINT-REC AFTER ADVANCING 3 LINES
           WRITE PRINT-REC FROM HEADER-2 AFTER ADVANCING 3 LINES.
           WRITE PRINT-REC FROM HEADER-2A AFTER ADVANCING 1 LINES.
           ADD 1 TO REQS-PER-PAGE-CTR.
           MOVE SPACES TO DETAIL-LINE-2.
           MOVE REQITM-CORP-CODE TO D-CC
                                    CODE-ARG.
           MOVE REQITM-QTY-TO-ORD TO D-QTY.
           MOVE REQITM-UM TO D-UM.
           MOVE REQITM-UNIT-PRICE TO D-ESTPRICE.
           MOVE REQITM-BUDGET-AMT TO D-BGTAMT.
           MOVE REQITM-BUDGET-NO TO D-BGTNO.
           WRITE PRINT-REC FROM DETAIL-LINE-2 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 2 LINES.
           WRITE PRINT-REC FROM HEADER-2B AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-2B.
           MOVE 4 TO DATE-MODE.
           MOVE REQ-DATE-WANTED TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO D-DATEWANT.
           MOVE REQ-CO TO D-COMPANY.
           MOVE REQ-PRIME TO D-PRIME.
           MOVE REQ-SUB TO D-CLS.
           MOVE REQ-SUBD TO D-DEPT.
           MOVE REQ-ADDTL-DATA TO D-EXPNW.
           MOVE REQ-STAGING-AREA TO D-STAG.
           MOVE REQ-ORIGINATOR TO D-ORIG,
                                  PERCCNUM OF PP-REC.
           READ PER-PERSONNEL INTO PER-CC-BUF
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           MOVE PER-EMP-NAME TO D-ORIGNAME.
           MOVE DREQD-WO-NUMBER TO D-WO.
           WRITE PRINT-REC FROM DETAIL-LINE-2B AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM HEADER-3 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-3.
           MOVE REQ-ADDL-INFO TO D-ADDLINFO.
           MOVE REQITM-NOTE TO D-SUGGVEND.
           IF REQ-REPAIR-INDIC = "X"
               MOVE "R"                  TO   D-TYPE
           ELSE
               MOVE "P"                  TO   D-TYPE.
           IF REQ-MODIFY-FLAG = "X"
               MOVE "Y"                  TO   D-MOD
           ELSE
               MOVE "N"                  TO   D-MOD.
           IF REQ-APPROVALS-LEFT = "  "
               NEXT SENTENCE
           ELSE
           MOVE REQ-APPROVALS-LEFT-9 TO D-APPLEFT
           MOVE REQ-PATH TO D-PATH.
           WRITE PRINT-REC FROM DETAIL-LINE-3 AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM HEADER-4 AFTER ADVANCING 1 LINES.
123400     IF REQ-MAT-TYPE = "S"
123500         MOVE 3                    TO   CDESC-LINES-TO-GET
123600         MOVE "N"                  TO   CDESC-LOCAL-DESC-OPTION
123700         CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
123800           BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA
123900         IF BU-DISPLAY-MSG-1 NOT = SPACES
124000             PERFORM 2100-BLOWUP
124100         ELSE
               MOVE SPACES TO DETAIL-LINE-4
124200         MOVE CDESC (1)        TO   D-DESC-4
               WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES
               MOVE SPACES TO DETAIL-LINE-4
124300         MOVE CDESC (2)        TO   D-DESC-4
               WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES
               MOVE SPACES TO DETAIL-LINE-4
124400         MOVE CDESC (3)        TO   D-DESC-4
               WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES
124500     ELSE
124600     MOVE 3                    TO   RQD-LINES
124700     CALL "TNRQDESC" USING RQD-LINES, BASE, STATUS-AREA,
124800        REQITM-REQ-NUMBER, REQ-DESC-AREA, BU-DISPLAY-MSG
124900     IF BU-DISPLAY-MSG-1 NOT = SPACES
125000         PERFORM 2100-BLOWUP
125100     ELSE
           MOVE SPACES           TO   DETAIL-LINE-4
125200     MOVE RQD-DESC (1)     TO   D-DESC-4
           WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES
           MOVE SPACES           TO   DETAIL-LINE-4
125300     MOVE RQD-DESC (2)     TO   D-DESC-4
           WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES
           MOVE SPACES           TO   DETAIL-LINE-4
125400     MOVE RQD-DESC (3)     TO   D-DESC-4
           WRITE PRINT-REC FROM DETAIL-LINE-4 AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM HEADER-5 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-5.
           CALL "CREQREM" USING BASE, BASE-MMISA, STATUS-AREA,
             BUF-DREQD, REQ-STATUS-CREQREM, REQ-REMARKS, BU-DISPLAY-MSG.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               PERFORM 2100-BLOWUP.
           MOVE REQ-REMARK-1 TO D-REMARKS.
           WRITE PRINT-REC FROM DETAIL-LINE-5 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-5.
           MOVE REQ-REMARK-2 TO D-REMARKS.
           WRITE PRINT-REC FROM DETAIL-LINE-5 AFTER ADVANCING 1 LINES.
           WRITE PRINT-REC FROM HEADER-6 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO DETAIL-LINE-6.
           MOVE DREQD-PO-NUM TO D-PO-7.
           MOVE DREQD-PO-RLSE TO D-PO-REL.
           MOVE ITM-QTY-ORD TO D-ORDERED.
           MOVE ITM-UM TO D-UM-6.
           MOVE ITM-QTY-DLVR TO D-DLVR.
           MOVE 4 TO DATE-MODE.
           MOVE ITM-DATE-RCVD TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO D-DATEDLVR.
126500     IF REQITM-CORP-CODE = "NON-STR"
126600         MOVE SPACES               TO   D-BLANKET
126700     ELSE
126800         MOVE SPACES               TO   FIRST-UNEXPIRED-BLKT
                                              R11-SMALL-PO
                                              R11-LARGE-PO
126900         CALL "TCHKBLKT" USING BASE, CODE-ARG, CHKBLKT-PARMS
127000         MOVE FIRST-UNEXPIRED-BLKT TO   D-BLANKET.
127100
           WRITE PRINT-REC FROM DETAIL-LINE-6 AFTER ADVANCING 1 LINES.
130000     IF REQ-RELEASE-STAT = "  "
130100         IF REQ-STATUS = "SS" OR "S"
                   IF REQ-AUTH-CODE-FLAG = "X"
                       IF REQ-APPROVALS-LEFT = "  "
130200*                    "IN MATERIALS CONTROL"
130300                     MOVE   9 TO LANG-SETNUM
130400                     MOVE  85 TO LANG-MSGNUM
130500                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       ELSE
                       IF REQ-APPROVALS-LEFT-9 > 0
130700*                "AWAITING APPROVALS"
130800                     MOVE   1 TO LANG-SETNUM
130900                     MOVE  30 TO LANG-MSGNUM
131000                     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       ELSE
130200*                "IN MATERIALS CONTROL"
130300                 MOVE   9 TO LANG-SETNUM
130400                 MOVE  85 TO LANG-MSGNUM
130500                 PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   ELSE
130200*            "IN MATERIALS CONTROL"
130300             MOVE   9 TO LANG-SETNUM
130400             MOVE  85 TO LANG-MSGNUM
130500             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
130600         ELSE
130700*        "AWAITING APPROVALS"
130800         MOVE   1 TO LANG-SETNUM
130900         MOVE  30 TO LANG-MSGNUM
131000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
131100     ELSE
131200     IF REQ-RELEASE-STAT = "X "
131300*        "IN PURCHASING"
131400         MOVE   9 TO LANG-SETNUM
131500         MOVE  86 TO LANG-MSGNUM
131600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
131700     ELSE
131800     IF REQ-RELEASE-STAT = "XX"
131900*        "ASSIGNED TO A PURCHASE ORDER"
132000         MOVE   1 TO LANG-SETNUM
132100         MOVE  29 TO LANG-MSGNUM
132200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
132300     ELSE
132400     IF REQ-RELEASE-STAT = "U"
132500*        "REQ CURRENTLY BEING PROCESSED"
132600         MOVE  19 TO LANG-SETNUM
132700         MOVE  37 TO LANG-MSGNUM
132800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
132900     ELSE
133000     MOVE SPACES TO   D-MESSAGE-2.
           MOVE MESSAGE-BUFFER TO D-MESSAGE-2.
127200     IF REQ-STATUS = "SS" OR "S"
127300*        "CODED STOREROOM ITEM"
127400         MOVE  3  TO LANG-SETNUM
127500         MOVE 162 TO LANG-MSGNUM
127600         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
127700     ELSE
127800     IF REQ-STATUS = "SN"
127900*        "CODED NON-STOREROOM ITEM"
128000         MOVE   3 TO LANG-SETNUM
128100         MOVE 163 TO LANG-MSGNUM
128200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
128300     ELSE
128400     IF REQ-STATUS = "NM"
128500*        "NON CODED ITEM"
128600         MOVE  14 TO LANG-SETNUM
128700         MOVE 108 TO LANG-MSGNUM
128800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
128900     ELSE
129000     IF REQ-STATUS = "NI"
129100*        "NON-CODED INTERNATIONAL REQ"
129200         MOVE  14 TO LANG-SETNUM
129300         MOVE 109 TO LANG-MSGNUM
129400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
129500     ELSE
129600        MOVE SPACES                TO   D-MESSAGE-1.
129800     MOVE MESSAGE-BUFFER           TO   D-MESSAGE-1.
           WRITE PRINT-REC FROM DETAIL-LINE-7 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO H7-BUYER H8-REQDEPT.
           MOVE DREQD-BUYER-CODE TO BUYERCDE OF MBUYER-REC-I.
           READ MBUYER-I INTO BUF-MBUYER
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
           MOVE BUYER-NAME TO H7-BUYER.
           WRITE PRINT-REC FROM HEADER-7 AFTER ADVANCING 1 LINES.
           MOVE SPACES TO H8-REQDEPT.
           MOVE REQ-REQ-DEPT TO H8-REQDEPT.
           WRITE PRINT-REC FROM HEADER-8 AFTER ADVANCING 1 LINES.
           GO TO READ-DREQITM-LOOP.

       2-EOJ.
           CLOSE CC-FILE.
           CLOSE DPOITEM-I.
           CLOSE DREQD-I.
           CLOSE DREQITM-I.
           CLOSE MBUYER-I.
           CLOSE MREQ-I.
           CLOSE MSTORERM-I.
           CLOSE PER-PERSONNEL.
           CLOSE PRINT-FILE.
           GOBACK.

       2100-BLOWUP.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.
           DISPLAY "COND-WORD = ", COND-WORD.
           GOBACK.

       COPY OVRPFCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.

       9999-BEGFIL-MSTORERM-I.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-GETSER-MSTORERM-I.
           MOVE 0 TO COND-WORD.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MSTORERM-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       7-SORT-RECORDS SECTION.
       7-SR.
           PERFORM 9999-BEGFIL-MSTORERM-I.
       7-SR-LOOP.
           PERFORM 9999-GETSER-MSTORERM-I.
           IF END-OF-FILE
               GO TO 7-SR-EXIT.
           IF STR-LOC (1) NOT < "C            " AND < "D          "
               MOVE STR-LOC (1) TO SORT-BINLOC
           ELSE
           IF STR-LOC (2) NOT < "C           " AND < "D           "
               MOVE STR-LOC (2) TO SORT-BINLOC
           ELSE
           IF STR-LOC (3) NOT < "C           " AND < "D           "
               MOVE STR-LOC (3) TO SORT-BINLOC
           ELSE
           GO TO 7-SR-LOOP.
           IF STR-ONHAND = 0
               NEXT SENTENCE
           ELSE
           GO TO 7-SR-LOOP.
           IF STR-MAX > 0
               IF STR-REORDER NOT = ZEROES
                   NEXT SENTENCE
               ELSE
               GO TO 7-SR-LOOP
           ELSE
           GO TO 7-SR-LOOP.
           MOVE CORP-CODE            TO SORT-CORPCDE,
                                        CODE-ARG.
           MOVE STR-ONHAND           TO SORT-ONHAND.
      *    MOVE STR-REORDER          TO SORT-REORDER.
           MOVE STR-MTH-FCST         TO SORT-MTHFRCST.
           MOVE STR-MAX              TO SORT-MAX.
           MOVE STR-LAST-REQ-NO      TO SORT-LASTREQ.
           MOVE STR-LAST-REQ-DATE-CN TO SORT-REQDATE.
           MOVE STR-LAST-IDATE-CN    TO SORT-LASTIDAT.
           MOVE 0                    TO WORK-LEADTIME.
           MOVE STR-LAST-DLVTIMES (1) TO DLVTIME.
           IF DLVTIME-X = "    "
               ADD 0                 TO WORK-LEADTIME
           ELSE
           ADD DLVTIME               TO WORK-LEADTIME.
           MOVE STR-LAST-DLVTIMES (2) TO DLVTIME.
           IF DLVTIME-X = "    "
               ADD 0                 TO WORK-LEADTIME
           ELSE
           ADD DLVTIME               TO WORK-LEADTIME.
           MOVE STR-LAST-DLVTIMES (3) TO DLVTIME.
           IF DLVTIME-X = "    "
               ADD 0                 TO WORK-LEADTIME
           ELSE
           ADD DLVTIME               TO WORK-LEADTIME.
           DIVIDE WORK-LEADTIME BY 3 GIVING SORT-LEADTIME ROUNDED.
           IF SORT-LEADTIME > 2
               NEXT SENTENCE
           ELSE
           GO TO 7-SR-LOOP.
           MOVE "Y"                  TO SONORDER-CALC-DIR-ORD-SW.
           MOVE SPACES TO BU-DISPLAY-MSG.
           CALL "SONORDER" USING BASE,
                                 CODE-ARG,
                                 SONORDER-PARMS,
                                 COMPANY-SAVE,
                                 STATUS-AREA,
                                 BU-DISPLAY-MSG,
                                 BU-DISPLAY-FLDS.
           IF BU-DISPLAY-MSG NOT = SPACES
               GO TO 2100-BLOWUP.
           MOVE SONORDER-STR-ONORDER TO SORT-ONORDER.
           MOVE "F"                  TO CDESC-DESC-OPTION.
           MOVE 5                    TO CDESC-LINES-TO-GET.
           MOVE "N"                  TO CDESC-LOCAL-DESC-OPTION.
126000     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
126100       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
126200     IF BU-DISPLAY-MSG-1 NOT = SPACES
126300         PERFORM 2100-BLOWUP.
           MOVE CDESC (1)            TO SORT-DESC1.
           MOVE CDESC (2)            TO SORT-DESC2.
           MOVE CDESC (3)            TO SORT-DESC3.
           MOVE CDESC (4)            TO SORT-DESC4.
           RELEASE SORT-REC.
           GO TO 7-SR-LOOP.

       7-SR-EXIT.
           EXIT.

       8-WRITE-REPORT SECTION.
       8-WR.
           MOVE 0 TO LINE-CTR.
           PERFORM 8-WRITE-HEADERS.
       8-WR-LOOP.
           RETURN SORT-FILE AT END
               GO TO 8-WR-X.
           MOVE SPACES               TO PRINT-REC,
                                        DETAIL-LINE-1.
           MOVE SORT-CORPCDE         TO D-CORPCDE,
                                        CC-NUMBER.
           WRITE CC-RCD.
           MOVE SORT-LEADTIME        TO D-LEADTIME.
           MOVE SORT-BINLOC          TO D-BINLOC.
           MOVE SORT-DESC1           TO D-DESC.
           MOVE SORT-LASTIDAT        TO D-LASTIDAT.
           MOVE SORT-MTHFRCST        TO D-MTHFRCST.
           MOVE SORT-MAX             TO D-MAX.
           MOVE SORT-ONORDER         TO D-ONORDER.
           MOVE SORT-LASTREQ         TO D-LASTREQ.
           MOVE SORT-REQDATE         TO D-REQDATE.
           MOVE DETAIL-LINE-1        TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 58
               PERFORM 8-WRITE-HEADERS.
           MOVE SPACES               TO PRINT-REC,
                                        DETAIL-LINE-1A.
           MOVE SORT-DESC2           TO D-DESC2.
           MOVE DETAIL-LINE-1A       TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 58
               PERFORM 8-WRITE-HEADERS.
           MOVE SPACES               TO PRINT-REC,
                                        DETAIL-LINE-1A.
           MOVE SORT-DESC3           TO D-DESC2.
           MOVE DETAIL-LINE-1A        TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 58
               PERFORM 8-WRITE-HEADERS.
           MOVE SPACES               TO PRINT-REC,
                                        DETAIL-LINE-1A.
           MOVE SORT-DESC4           TO D-DESC2.
           MOVE DETAIL-LINE-1A        TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 58
               PERFORM 8-WRITE-HEADERS
               GO TO 8-WR-LOOP
           ELSE
           GO TO 8-WR-LOOP.

       8-WRITE-HEADERS.
           MOVE SPACES TO PRINT-REC.
           MOVE HEADER-0 TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           MOVE HEADER-1 TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE SPACES  TO PRINT-REC.
           MOVE 2 TO LINE-CTR.

       8-WR-X.    EXIT.
