000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TRPTMR.
000400 AUTHOR.         N W REGIMBAL.
000600 DATE-WRITTEN.   DEC 05, 1980.
000700*REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
000800*                CORP-CODES AND ITEM STATUS PER CODE.
000900*
001000*                ON JULY 13, 1982, THE BUFFER AREA MSTORERM
001100*                WAS CHANGED IN PREPARATION FOR THE NEW DATA
001200*                BASE CHANGE. B.J.P.
001300*
001400*                ON JULY 9, 1984;  ADDED THE STOREROOM MAINTENANCE
001500*                SWITCH TO THE PRINTOUT.  THIS WAS REQUESTED
001600*                BECAUSE AN "X" IS NOT THE ONLY ENTRY FOR THIS
001700*                FIELD ANYMORE.   -B. WINTER.
001800*
001900*       ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
002000*       MAY 21, 1985.    V.W.D.
002100*
002200*                ON NOVEMBER 25, 1986 - EXPANDED THE SIZE OF THE
002300*                AVERAGE COST FIELD FROM S9(6)V9(4) TO S9(11)V9(4).
002400*                ALSO ADD COPYLIB AND EXPANDED OTHER COST/PRICE
002500*                FIELDS.           D.A. PLUM.
002600*
002700*                ON FEB 5,1987 - THE FOLLOWING HAS BEEN ADDED
002800*                  OR CHANGED:
002900*                  1. ADDED CALL TO TRSCREEN FOR FRONT END REPORT
003000*                     OPTION.
003100*                  2. ADDED FULL DESCRIPTION OPTION.
003200*                  3. ADDED HEADER PAGE TO THE REPORT USING SUB-
003300*                     PROGRAM 'THDPRT2'.  (DHDR37.PUB)
003400*                  4. PRINT COMPRESSION FEATURE.
003500*                  5. NON-HP LOGIC
003600*                  6. REPLACED CALL TO DBEXPLAIN WITH CALL TO
003700*                     TBLOWUP.
003800*                  7. ADDED CALL TO CDESC TO GET FULL DESCRIPTION
003900*                     IF REQUESTED.
004000*                  8. CHANGED TO USE COPYLIB FOR ALL DATA SET
004100*                     BUFFER DESCRIPTIONS
004200*                  9. CHANGED COPY STATEMENTS TO "IN COPYCSIS".
004300*
004400*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 04, 1996   CA YODER
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  07/31/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C
004500 ENVIRONMENT DIVISION.
004600 CONFIGURATION SECTION.
004700 SOURCE-COMPUTER.    IBM-AS400.
004800 OBJECT-COMPUTER.    IBM-AS400.
004900 SPECIAL-NAMES.
005000     C01 IS NEW-PAGE.
005100
005200 INPUT-OUTPUT SECTION.
005300 FILE-CONTROL.
005400     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
005500     SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
005600
005700 DATA DIVISION.
005800 FILE SECTION.
005900 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
006000     LABEL RECORD IS OMITTED
006100     DATA RECORD IS PRT-REC.
006200 01  PRT-REC                 PIC X(132).
006300
       COPY MTLSSORT IN COPYLIB.

006400*SD  SORT-FILE RECORD CONTAINS 37 CHARACTERS
006500*    DATA RECORD IS SORT-REC.
006600*01  SORT-REC.
006700*     05  SRT-CORP-CODE      PIC X(8).
006800*     05  SRT-CLASS          PIC X(3).
006900*     05  SRT-UM             PIC X(2).
007000*     05  SRT-ONHAND         PIC S9(8).
007100*     05  SRT-AVG-COST       PIC S9(11)V9(4).
007200*     05  SRT-MR             PIC X(1).
007300
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200   OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400   OF MCFLCS1401.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

007400 WORKING-STORAGE SECTION.
007500
007600 77  NO-ARG                  PIC X(1)  VALUE SPACES.
007700 77  LINE-K                  PIC 9(2)  VALUE 60 COMP-4.
007800 77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
007900 77  TEXT-TO-PRT             PIC 9(2)  VALUE 0  COMP-4.
008000 77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
008100 77  GRAND-TOTAL             PIC S9(14)V9(4) VALUE +0.
008200 77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
008300 77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
008400 77  CODE-ARG                PIC X(8)  VALUE SPACES.
008500 77  SUB                     PIC S9(4)  COMP-4.
       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X     VALUE SPACES.
           05  FILE-STATUS-2       PIC X     VALUE SPACES.
9406CK 01  SCOPE   PIC X.
008700****PARMS FOR CALL TO "THDPRT2" (HEADER PAGE SUBPROG)  ****
008800****HD-ROUTE-DATA IS ACCEPTED FROM PGM "TRSCREEN".     ****
008900
009000 COPY THDPRTA IN COPYLIB.
009100
009200*****  ESCAPE SEQUENCES
009300 COPY ESCNAM2 IN COPYLIB.
009400
009500 01  COMPRESS-PRINT           PIC X(8).
009600
009700 01  NORMAL-PRINT             PIC X(8).
009800
009900 01  ESC-TEXT-61              PIC X(8).
010000
010100*****  ERROR MESSAGE AREAS
010200 COPY TBLOWUP IN COPYLIB.
010300 01  VIEW-COMAREA.
010400     05  FILLER               PIC X(118)  VALUE ALL "0".
010500     05  FILLER               PIC S9(4)   COMP-4 VALUE 9999.
010600 01  KSAM-STATUS              PIC X(2)    VALUE SPACES.
010700
011300
011400
011500 01  MESSAGE-AREA.
011600     05  NO-SORTED-RECORDS   PIC X(31) VALUE
011700                             "ZERO CODES QUALIFIED FOR REPORT".
011800
011900 01  SWITCH-AREA.
012000     05  END-OF-INPUT-FILE               PIC X VALUE "N".
012100         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
012200     05  END-OF-SORT-FILE                PIC X VALUE "N".
012300         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
012400     05  BLOWUP-SWITCH                   PIC X VALUE "N".
012500
012600 01  TIME-SAVE.
012700     05  HRS-SAVE            PIC XX.
012800     05  MIN-SAVE            PIC XX.
012900     05  SEC-SAVE            PIC XX.
013000
013100 COPY TDATECHK IN COPYLIB.
013200
013300 COPY DATAB IN COPYLIB.
013400
013500 01  DSET-NAMES.
013600     05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
013700     05  DSET-DDESC          PIC X(6)  VALUE "DDESC;".
013800
013900 COPY MSTORERM IN COPYLIB.
014000
014100 COPY DDESC IN COPYLIB.
014200
014300 COPY CDESC IN COPYLIB.
014400
       COPY TCHKBLKT IN COPYLIB.

014500 01  RET-CODE        PIC X(2)  VALUE SPACES.
014600
       COPY CCHKOBJ IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
014700
       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.

014800*01  HDR-1.
014900*    05  FILLER      PIC X(10) VALUE "  TRPTMR  ".
015000*    05  FILLER      PIC X(25) VALUE SPACES.
015100*    05  FILLER      PIC X(20) VALUE "C O R P O R A T E   ".
015200*    05  FILLER      PIC X(19) VALUE "C O D E   I T E M S".
015300*    05  FILLER      PIC X(28) VALUE SPACES.
015400*    05  PRT-DATE    PIC X(8)  VALUE SPACES.
015500*    05  FILLER      PIC X(4)  VALUE SPACES.
015600*    05  PRT-TIME    PIC X(8)  VALUE SPACES.
015700*
015800*01  HDR-2.
015900*    05  FILLER      PIC X(7)  VALUE "  PAGE ".
016000*    05  PRT-PAGE    PIC 999   VALUE ZEROS.
016100*    05  FILLER      PIC X(21) VALUE SPACES.
016200*    05  FILLER      PIC X(24) VALUE "M A I N T E N A N C E   ".
016300*    05  FILLER      PIC X(23) VALUE "R E P A I R   C L A S S".
016400*    05  FILLER      PIC X(26) VALUE SPACES.
016500*    05  FILLER      PIC X(12) VALUE "DATE        ".
016600*    05  FILLER      PIC X(4)  VALUE "TIME".
016700*    05  FILLER      PIC X(7)  VALUE SPACES.
016800*
016900 01  HDR-3.
017000     05  FILLER      PIC X(8)  VALUE "CORPCODE".
017100     05  FILLER      PIC X(4)  VALUE " CLS".
017200     05  FILLER      PIC X(3)  VALUE "   ".
017300     05  FILLER      PIC X(13) VALUE " DESCRIPTION ".
017400     05  FILLER      PIC X(58) VALUE SPACES.
017500     05  FILLER      PIC X(10) VALUE "ONHAND  UM".
017600     05  FILLER      PIC X(9)  VALUE SPACES.
017700     05  PRT-COST-LIT  PIC X(8).
017800     05  FILLER      PIC X(9)  VALUE SPACES.
017900     05  FILLER      PIC X(12) VALUE "  TOTAL COST".
018000
018100 01  PRT-ITEM-DATA.
018200     05  PRT-CODE      PIC X(7)  VALUE SPACES.
018300     05  FILLER        PIC X(2)  VALUE SPACES.
018400     05  PRT-CLASS     PIC X(3)  VALUE SPACES.
018500     05  FILLER        PIC X(1)  VALUE SPACES.
018600*    05  PRT-MR        PIC X(1)  VALUE SPACES.
018600     05  FILLER        PIC X(1)  VALUE SPACES.
018700     05  FILLER        PIC X(2)  VALUE SPACES.
018800     05  PRT-DESC      PIC X(65) VALUE SPACES.
018900     05  FILLER        PIC X(3)  VALUE SPACES.
019000     05  PRT-ONHAND    PIC Z(7)9 VALUE ZEROS.
019100     05  FILLER        PIC X(2)  VALUE SPACES.
019200     05  PRT-UM        PIC X(2)  VALUE SPACES.
019300     05  FILLER        PIC X(1)  VALUE SPACES.
019400     05  PRT-AVG-COST  PIC Z(10)9.9(4) VALUE ZEROS.
019500     05  FILLER        PIC X(3)  VALUE SPACES.
019600     05  PRT-TOTAL     PIC Z(12)9.9(4) VALUE ZEROS.
019700
019800 01  FULL-DESC-LINE.
019900     05  FILLER           PIC X(14)  VALUE SPACES.
020000     05  PRT-FULL-DESC    PIC X(80)  VALUE SPACES.
020100
020200 01  GRAND-TOTAL-LINE.
020300     05  FILLER        PIC X(60) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS  PIC Z(4)9 VALUE ZERO.
           05  FILLER        PIC X(3)  VALUE SPACES.
020400     05  FILLER        PIC X(19) VALUE "GRAND TOTAL OF ALL ".
020500     05  FILLER        PIC X(13) VALUE "MAINTENANCE  ".
020600     05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROS.
020700
      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
011000*01  R26-DATA-LINE.
011100*    05  R26-DESC-OPTION      PIC X.
011200*    05  FILLER               PIC X(111).

      *PROCEDURE DIVISION USING HD-ROUTE-DATA, R26-DATA-LINE.
       PROCEDURE DIVISION.
       BEGIN-SORT SECTION.
       1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
021100     OPEN OUTPUT PRINT-FILE.
021300     CALL "TESCSEQ" USING ESC-NAME.
021400     MOVE CHAR-1636PI TO COMPRESS-PRINT.
021500     MOVE CHAR-10PI   TO NORMAL-PRINT.
021600     MOVE TEXT-LENGTH-61 TO ESC-TEXT-61.
021700
           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "  TRPTMR"         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.

021800     MOVE 1 TO DATE-MODE.
021900     CALL "TDATECHK" USING DATE-CHECK-AREA.
022000     MOVE DATE-SLASH-OUT TO PRT-DATE.
022100     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
022200
022300*********************************************************
022400**  ACCEPT ROUTE LINE AND THE INPUT LINE TO FIND OUT   **
022500**  PARMS FOR REPORT                                   **
022600*********************************************************
023000
023100     MOVE "DHDR37.PUB" TO HD-FILE-NAME.
023200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
023300          HD-ROUTE-DATA, ESC-NAME.
023400     IF HD-RET-CODE NOT = 0
023500          MOVE "THDPRT2 ERROR IN 1-HSK" TO BU-DISPLAY-MSG
023600          MOVE "HD-RET-CODE = "         TO BU-DISPLAY-FLD (1)
023700          MOVE HD-RET-CODE              TO BU-DISPLAY-FLD9 (1)
023800          GO TO 2-BLOWUP.

            PERFORM 9-MOVE-OPTION-LINES.
            WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
            WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
            WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

           OPEN INPUT MSTORERM-I, DDESC-I, DMANPART-I.
024300
           COPY MTLSPROC IN COPYLIB.

024400*    SORT SORT-FILE
024500*         ON ASCENDING KEY SRT-CORP-CODE
024600*         INPUT  PROCEDURE IS 8-INPUT-RECORDS
024700*         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.
024800
024900 2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
025100     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
025200     CLOSE PRINT-FILE.
           CLOSE MSTORERM-I, DDESC-I.
025700     GOBACK.
025800
025900 2-BLOWUP.
026000     MOVE "TRPTMR" TO BU-PGM-NAME.
026100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
026200         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
026300         BU-DISPLAY-AREA.
026400
026500 7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *    READ MSTORERM-I FIRST RECORD INTO BUF-MSTORERM
      *       AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *       MOVE "Y" TO END-OF-INPUT-FILE.
026600*    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
026700*            ALL-INPUT-RECORDS-PROCESSED.
026800*    GO TO 8-IR-EXIT.
026900*
027000*81-PROCESS-INPUT-RECORDS.
028100*    IF CORP-CODE = "NON-STR "
028200*        NEXT SENTENCE
028300*    ELSE
028500*    IF STR-MAINT NOT = SPACE
028400*        MOVE SPACES        TO SORT-REC
028600*        MOVE CORP-CODE     TO SRT-CORP-CODE
028700*        MOVE STR-CLASS     TO SRT-CLASS
028800*        MOVE STR-MAINT     TO SRT-MR
028900*        MOVE STR-AVG-COST  TO SRT-AVG-COST
029000*        MOVE STR-UM        TO SRT-UM
029100*        MOVE STR-ONHAND    TO SRT-ONHAND
029200*        RELEASE SORT-REC.
      *
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
027400*           MOVE "Y" TO END-OF-INPUT-FILE
027500*           GO TO 81-PIR-EXIT
027600*        ELSE
027800*            MOVE "DBGET ERROR 81-P-I-R  " TO BU-DISPLAY-MSG
027900*            GO TO 2-BLOWUP.
029300*
029400*81-PIR-EXIT.
029500*    EXIT.
029600
029700 7-IR-EXIT.
029800     EXIT.
029900
030000 8-WRITE-RECORDS SECTION.
030100     IF PAPER-IS-132-COLS
030200         NEXT SENTENCE
030300     ELSE
030400         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
030600
030700     RETURN SORT-FILE AT END
030800         MOVE "Y" TO END-OF-SORT-FILE
030900         MOVE  1  TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
031000*        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
031100*        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
031200         WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
031300         MOVE NO-SORTED-RECORDS TO PRT-REC
031400         WRITE PRT-REC AFTER ADVANCING 2 LINES
031500         GO TO 2-EOJ.
031600
           PERFORM 9-MOVE-CONTROL-BREAK.

031700     PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
031800             UNTIL ALL-SORTED-RECORDS-PROCESSED.
031900
           PERFORM 9-CHECK-HEADINGS.

      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               MOVE CODES-RELEASED TO PRT-GRD-ITMS
032000         MOVE GRAND-TOTAL TO PRT-GRD-TOTAL
032100         WRITE PRT-REC FROM GRAND-TOTAL-LINE
032200             AFTER ADVANCING 3 LINES.
032300     GO TO 8-WR-EXIT.
032400
032500 82-PROCESS-SORTED-RECORDS.
           PERFORM 9-CHECK-HEADINGS.
033600     MOVE SPACES        TO PRT-REC, PRT-ITEM-DATA.
033700     MOVE  SRT-CORP-CODE     TO  CODE-ARG.
033800     MOVE 0 TO SUB.
           MOVE SRT-KEYWD-MOD      TO  PRT-DESC.
033900
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
      *        GO TO 92-CONT.
      *
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS = "00"
      *        MOVE DESC-DATA      TO  PRT-DESC
      *    ELSE
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.

035200     IF MTLS-DESC-OPT NOT = "X"
035300         MOVE 0 TO TEXT-TO-PRT
035400         GO TO 82-CONT.
035500
035600 82-GET-MULT-DESC.
035700     CALL "CDESC"  USING  RET-CODE,
035800                          BASE,
035900                          STATUS-AREA,
036000                          BU-DISPLAY-MSG,
036100                          CODE-ARG,
036200                          CDESC-DATA.
036300
036400     IF BU-DISPLAY-MSG-1  NOT = SPACES
036500         MOVE CODE-ARG  TO  BU-DISPLAY-FLD (2)
036600         GO TO 2-BLOWUP.
036700     IF CDESC-LINES-GOT > 1
036800         ADD CDESC-LINES-GOT, LINE-K GIVING TEXT-TO-PRT.
036900
037000
037100 82-CONT.
037200     COMPUTE TOTAL-COST = SRT-ONHAND * SRT-COST.
037300     ADD TOTAL-COST TO GRAND-TOTAL.
037400     MOVE SRT-CORP-CODE TO PRT-CODE.
037500     MOVE SRT-CLASS TO PRT-CLASS.
037600*    MOVE SRT-MR TO PRT-MR.
037700     MOVE SRT-ONHAND TO PRT-ONHAND.
037800     MOVE SRT-UM TO PRT-UM.
037900     MOVE SRT-COST TO PRT-AVG-COST.
038000     MOVE TOTAL-COST TO PRT-TOTAL.
038100
           PERFORM 9-CHECK-HEADINGS.
039200
039300     MOVE 1 TO SUB.
039400     ADD 1 TO LINE-K.
039500     WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 1 LINES.
039600
      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

039700     IF MTLS-DESC-OPT NOT = "X"
039800         GO TO 822-RTN-SORT-FILE.
039900
040000 821-PRT-MULT-DESC.
040100     ADD 1 TO SUB.
040200     IF SUB > CDESC-LINES-GOT
040300        GO TO 822-RTN-SORT-FILE.
040400     MOVE CDESC (SUB) TO PRT-FULL-DESC.
040500     WRITE PRT-REC FROM FULL-DESC-LINE AFTER ADVANCING 1.
040600     ADD 1 TO LINE-K.
040700
040800     GO TO 821-PRT-MULT-DESC.
040900
041000 822-RTN-SORT-FILE.
041100     RETURN SORT-FILE
041200        AT END
041300          MOVE "Y" TO END-OF-SORT-FILE.
041400
      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   WRITE PRT-REC             AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       MOVE 60            TO  LINE-K
                       PERFORM 9-CHECK-HEADINGS.

041500 82-PSR-EXIT.
041600     EXIT.
041700
041800 8-WR-EXIT.
041900     EXIT.

       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

       9-CHECK-HEADINGS.
           IF LINE-K > 59
               ADD     1      TO PAGE-K
               MOVE    1      TO LINE-K
               MOVE PAGE-K    TO PRT-PAGE
               ADD     3      TO LINE-K
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
               IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
                 MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
                 WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
                 ADD   1      TO LINE-K
               END-IF
      *        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
      *        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
               MOVE SPACES TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1 LINES.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
