       IDENTIFICATION DIVISION.
       PROGRAM-ID.      TRPTPCAT.
       AUTHOR.          CA YODER.
       DATE-WRITTEN.    SEPTEMBER 1997.

      ************************************************************
      *                                                          *
      *   T R P T P C A T      THIS PROGRAM WILL PRINT A REPORT  *
      *     SHOWING CODES IN THE MCFPCSPCAT FILE (832 EDI TRANS- *
      *     ACTIONS).  THE OPTIONS FOR THE REPORT ARE SPECIFIED  *
      *     IN THE "TPCATINQ" PROGRAM.                           *
      *                                                          *
      ************************************************************
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MSTORERM-CD
               ASSIGN           TO DATABASE-MCFLCS0201
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS      IS FILE-STATUS.

           SELECT DPORECD-PO-O
               ASSIGN           TO DATABASE-MCFLCS0901
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT DPOITEM-CD
               ASSIGN           TO DATABASE-MCFLCS1001
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT PCAT-DT
               ASSIGN           TO DATABASE-MCFLCSPCA1
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT REPORT-FILE
               ASSIGN           TO PRINTER-MCPRT.

       DATA DIVISION.
       FILE SECTION.

       FD  MSTORERM-CD
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DPORECD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPOITEM-CD
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-CD-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  PCAT-DT
           LABEL RECORDS ARE STANDARD.
       01  PCAT-DT-REC.
           COPY DDS-MCRPCSPCAT  OF MCFLCSPCA1.

       FD  REPORT-FILE
           DATA RECORD IS REPORT-FILE-REC.
       01  REPORT-FILE-REC      PIC X(132).

       WORKING-STORAGE SECTION.
       77  PAGE-COUNT                   PIC 999.
       77  LINE-COUNT                   PIC 99.
       77  REC-PROCESSED                PIC 9(5)  VALUE 0.
       77  HOLD-DIFF                    PIC S9(6)V9(4)  VALUE +0.
       77  HOLD-PERCENT                 PIC S9V9(4)     VALUE +0.
       77  HOLD-CALC                    PIC S9(6)V9(4)  VALUE +0.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  CURRENT-DATE-CN.
           05  CURR-CC            PIC X(2).
           05  CURR-YMD.
               10  CURR-YY        PIC X(2).
               10  CURR-MM        PIC X(2).
               10  CURR-DD        PIC X(2).

       01  CURRENT-TIME                        VALUE SPACES.
           05  CURR-HR            PIC X(2).
           05  CURR-MIN           PIC X(2).
           05  CURR-SEC           PIC X(2).

      *-------------------------------------------------------------*
      *           S W I T C H E S   &   T A B L E S                 *
      *-------------------------------------------------------------*

       01  INPUT-PO-EOF-SW             PIC X       VALUE "N".

      *-------------------------------------------------------------*
      *               D A T A B A S E   B U F F E R S               *
      *-------------------------------------------------------------*

       COPY CSISPCAT IN COPYLIB.

       COPY MSTORERM IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY DPOITEM  IN COPYLIB.

       COPY MPLT0    IN COPYLIB.

      *-------------------------------------------------------------*
      *              U T I L I T Y   B U F F E R S                  *
      *-------------------------------------------------------------*

       COPY TBLOWUP  IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       COPY DATAB    IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY TUMCF    IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

       COPY CATREAD  IN COPYLIB.

      *--- PASSED PARAMETERS FROM "TPCATINQ".
       01  TRPTPCAT-PARMS.
           05  PASS-DATE1.
               10  PASS-DATE1-CN     PIC X(2).
               10  PASS-DATE1-YMD    PIC X(6).
           05  PASS-DATE2.
               10  PASS-DATE2-CN     PIC X(2).
               10  PASS-DATE2-YMD    PIC X(6).
           05  PASS-CODE1            PIC X(7).
           05  PASS-CODE2            PIC X(7).
           05  PASS-PERCENT          PIC 9(2).
           05  PASS-ROUTE-NAME       PIC X(20).

      *-------------------------------------------------------------*
      *                  R E P O R T   L I N E S                    *
      *-------------------------------------------------------------*

        01  ROUTE-1.
            05  FILLER             PIC X(5)  VALUE SPACES.
            05  FILLER             PIC X(35) VALUE ALL "*".
            05  FILLER             PIC X(92) VALUE SPACES.

        01  ROUTE-2.
            05  FILLER             PIC X(5)  VALUE SPACES.
            05  FILLER             PIC X(35) VALUE
                "*                                 *".
            05  FILLER             PIC X(92) VALUE SPACES.

       01  ROUTE-3.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(35) VALUE
               "*  PLEASE ROUTE THIS REPORT TO:   *".
           05  FILLER             PIC X(92) VALUE SPACES.

       01  ROUTE-4.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(8)  VALUE "*       ".
           05  R4-NAME            PIC X(20).
           05  FILLER             PIC X(7)  VALUE "      *".
           05  FILLER             PIC X(92) VALUE SPACES.

       01  PRT-RPT-HDG-1.
           05                    PIC X(3).
           05  PRT-HDG-1-MM      PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-HDG-1-DD      PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-HDG-1-YY      PIC X(2).
           05                    PIC X(38).
           05                    PIC X(35)
               VALUE "   AUTOMATIC PRICE UPDATE REPORT   ".
           05                    PIC X(38).
           05                    PIC X(8) VALUE "TRPTPCAT".
           05                    PIC X(3).

       01  PRT-RPT-HDG-2.
           05                    PIC X(3).
           05  PRT-HDG-2-HR      PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-HDG-2-MIN     PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-HDG-2-SEC     PIC X(2).
           05  PRT-HDG-2-DESC    PIC X(111).
           05                    PIC X(5) VALUE "PAGE ".
           05  PRT-HDG-2-PG      PIC ZZ9.
           05                    PIC X(2).

       01  PRT-HDG-2-RANGE.
           05                    PIC X(17).
           05                    PIC X(12) VALUE "DATE RANGE: ".
           05  PRT-HDG-2-DATE1   PIC X(8).
           05                    PIC X(4)  VALUE " TO ".
           05  PRT-HDG-2-DATE2   PIC X(8).
           05                    PIC X(3).
           05                    PIC X(8)  VALUE "CODES:  ".
           05  PRT-HDG-2-CODE1   PIC X(7).
           05                    PIC X(4)  VALUE " TO ".
           05  PRT-HDG-2-CODE2   PIC X(7).
           05                    PIC X(3).
           05                    PIC X(9)  VALUE "CHANGE > ".
           05  PRT-HDG-2-PCNT    PIC Z9.
           05                    PIC X(2)  VALUE " %".
           05                    PIC X(17).

       01  PRT-RPT-HDG-3.
           05                    PIC X(5).
           05                    PIC X(9)  VALUE "CORP CODE".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "CATALOG # ".
           05                    PIC X(3).
           05                    PIC X(8)  VALUE "EFF DATE".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "  VENDOR  ".
           05                    PIC X(3).
           05                    PIC X(15) VALUE " CURRENT PRICE ".
           05                    PIC X(3).
           05                    PIC X(2)  VALUE "UM".
           05                    PIC X(3).
           05                    PIC X(15) VALUE "   NEW PRICE   ".
           05                    PIC X(3).
           05                    PIC X(2)  VALUE "UM".
           05                    PIC X(3).
           05                    PIC X(11) VALUE "   CHANGE  ".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "APPLY DATE".

       01  PRT-RPT-HDG-4.
           05                    PIC X(5).
           05                    PIC X(9)  VALUE "---------".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "----------".
           05                    PIC X(3).
           05                    PIC X(8)  VALUE "--------".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "----------".
           05                    PIC X(3).
           05                    PIC X(15) VALUE "---------------".
           05                    PIC X(3).
           05                    PIC X(2)  VALUE "--".
           05                    PIC X(3).
           05                    PIC X(15) VALUE "---------------".
           05                    PIC X(3).
           05                    PIC X(2)  VALUE "--".
           05                    PIC X(3).
           05                    PIC X(11) VALUE "-----------".
           05                    PIC X(3).
           05                    PIC X(10) VALUE "----------".

       01  PRT-RPT-DETAIL.
           05                    PIC X(5).
           05  PRT-DET-CODE      PIC X(7).
           05                    PIC X(5).
           05  PRT-DET-CAT-NUM   PIC X(10).
           05                    PIC X(3).
           05  PRT-DET-EFF-DATE  PIC X(8).
           05                    PIC X(3).
           05  PRT-DET-VENDOR    PIC X(10).
           05                    PIC X(3).
           05  PRT-DET-CUR-PRICE PIC Z(9)9.9999.
           05  PRT-DET-CUR-PRICE-X  REDEFINES  PRT-DET-CUR-PRICE
                                 PIC X(15).
           05                    PIC X(3).
           05  PRT-DET-CUR-UM    PIC X(2).
           05                    PIC X(3).
           05  PRT-DET-PRICE     PIC Z(9)9.9999.
           05                    PIC X(3).
           05  PRT-DET-UM        PIC X(2).
           05                    PIC X(3).
           05  PRT-DET-CHANGE    PIC Z(4)9.9999-.
           05                    PIC X(3).
           05  PRT-DET-APL-DATE  PIC X(8).

       01  PRT-RPT-TOTAL.
           05                    PIC X(8).
           05                    PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-ITEM-TOT      PIC Z(4)9.

      *-------------------------------------------------------------*
      *            P R O C E D U R E   D I V I S I O N              *
      *-------------------------------------------------------------*

       PROCEDURE DIVISION.

       BEGIN SECTION.

       0-BEGIN.
           PERFORM 1-HSK.

           PERFORM 6-MAIN THRU 6-MAIN-X
               UNTIL FILE-STATUS NOT = "00".

           PERFORM 2-EOJ.

           GOBACK.

       1-HSK.
           OPEN INPUT   MSTORERM-CD    PCAT-DT
                OUTPUT  REPORT-FILE.

           ACCEPT TRPTPCAT-PARMS.
           ACCEPT CURR-YMD FROM DATE.
           IF CURR-YY > "70"
               MOVE "19"                TO  CURR-CC
           ELSE
               MOVE "20"                TO  CURR-CC.
           ACCEPT CURRENT-TIME FROM TIME.
           PERFORM 10-MOVE-RPT-HDG-DATA.

           MOVE 0                       TO  PRT-HDG-2-PG
                                            PAGE-COUNT
                                            LINE-COUNT.
           MOVE 0                       TO  REC-PROCESSED.
           MOVE "00"                    TO  FILE-STATUS.

           IF PASS-DATE1 > SPACES
               MOVE PASS-DATE1-YMD      TO  DATE-VALIDATE-IN
               MOVE 4                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT      TO  PRT-HDG-2-DATE1.
           IF PASS-DATE2 > SPACES
               MOVE PASS-DATE2-YMD      TO  DATE-VALIDATE-IN
               MOVE 4                   TO  DATE-MODE
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT      TO  PRT-HDG-2-DATE2.
           MOVE PASS-CODE1              TO  PRT-HDG-2-CODE1.
           MOVE PASS-CODE2              TO  PRT-HDG-2-CODE2.
           IF PASS-PERCENT > 0
               MOVE PASS-PERCENT        TO  PRT-HDG-2-PCNT.

           IF  PASS-DATE1 > SPACES OR PASS-DATE2 > SPACES OR
               PASS-CODE1 > SPACES OR PASS-CODE2 > SPACES OR
               PASS-PERCENT > 0
                   MOVE PRT-HDG-2-RANGE TO  PRT-HDG-2-DESC.

           IF PASS-DATE1 > SPACES AND PASS-DATE2 = SPACES
               MOVE HIGH-VALUES         TO  PASS-DATE2.
           IF PASS-CODE1 > SPACES AND PASS-CODE2 = SPACES
               MOVE HIGH-VALUES         TO  PASS-CODE2.

           IF PASS-PERCENT NUMERIC
               COMPUTE HOLD-PERCENT = PASS-PERCENT / 100
           ELSE
               MOVE 0 TO HOLD-PERCENT.

           MOVE PASS-ROUTE-NAME         TO  R4-NAME.
           WRITE REPORT-FILE-REC FROM ROUTE-1 AFTER ADVANCING PAGE.
           WRITE REPORT-FILE-REC FROM ROUTE-2 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-3 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-4 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-2 AFTER ADVANCING 1.
           WRITE REPORT-FILE-REC FROM ROUTE-1 AFTER ADVANCING 1.

           PERFORM 999-WRITE-RPT-HDGS.

      *------- START PRICE CATALOG FILE.
           IF PASS-DATE1 > SPACES
               MOVE PASS-DATE1     TO  EFFECTDATE OF PCAT-DT-REC
           ELSE
               MOVE LOW-VALUES     TO  EFFECTDATE OF PCAT-DT-REC.
           START PCAT-DT KEY >= EFFECTDATE OF PCAT-DT-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS > "00"
               MOVE "   **** NO RECORDS PROCESSED ****"
                                   TO  REPORT-FILE-REC
               WRITE REPORT-FILE-REC AFTER ADVANCING 2 LINES
           ELSE
               PERFORM 999-READ-NEXT-PCAT.

      *------- MOVE HEADING DATA TO REPORT.
       10-MOVE-RPT-HDG-DATA.
           MOVE CURR-MM            TO  PRT-HDG-1-MM.
           MOVE CURR-DD            TO  PRT-HDG-1-DD.
           MOVE CURR-YY            TO  PRT-HDG-1-YY.
           MOVE CURR-HR            TO  PRT-HDG-2-HR.
           MOVE CURR-MIN           TO  PRT-HDG-2-MIN.
           MOVE CURR-SEC           TO  PRT-HDG-2-SEC.
           MOVE SPACES             TO  REPORT-FILE-REC.

       2-EOJ.
           IF REC-PROCESSED = 0
               MOVE "   **** NO RECORDS PROCESSED ****"
                                   TO  REPORT-FILE-REC
               WRITE REPORT-FILE-REC   AFTER ADVANCING 2 LINES
           ELSE
               MOVE REC-PROCESSED  TO  PRT-ITEM-TOT
               WRITE REPORT-FILE-REC FROM PRT-RPT-TOTAL
                                       AFTER ADVANCING 2 LINES.
           CLOSE        MSTORERM-CD     PCAT-DT     REPORT-FILE.

      *-------------------------------------------------------------*
      *               B L O W U P   R O U T I N E                   *
      *-------------------------------------------------------------*

       2-BLOWUP.
           MOVE "TRPTPCAT"                 TO  BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS            TO  COND-WORD.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.

      *-------------------------------------------------------------*
      *                        6 - M A I N                          *
      *-------------------------------------------------------------*

       6-MAIN SECTION.

       6-CHECK-RANGE.
           MOVE SPACES TO PRT-RPT-DETAIL.
           IF PASS-DATE1 > SPACES OR PASS-DATE2 > SPACES
               IF PCAT-EFFECT-DATE-CN < PASS-DATE1 OR
                  PCAT-EFFECT-DATE-CN > PASS-DATE2
                   GO TO 60-READ-NEXT.

           IF PASS-CODE1 > SPACES OR PASS-CODE2 > SPACES
               IF PCAT-CORP-CODE < PASS-CODE1 OR
                  PCAT-CORP-CODE > PASS-CODE2
                   GO TO 60-READ-NEXT.

           MOVE PCAT-CORP-CODE     TO  CORPCDE OF MSTORERM-CD-REC.
           READ MSTORERM-CD INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF HOLD-PERCENT NOT = 0
                   GO TO 60-READ-NEXT
               END-IF
               MOVE "*CODE NOT IN DB"
                                   TO  PRT-DET-CUR-PRICE-X
               MOVE "--"           TO  PRT-DET-CUR-UM
               MOVE 0              TO  PRT-DET-CHANGE
           ELSE
               COMPUTE HOLD-DIFF = PCAT-UNIT-PRICE - STR-MKT-COST
               IF HOLD-PERCENT NOT = 0
                   COMPUTE HOLD-CALC = HOLD-DIFF
                                     / STR-MKT-COST
                   IF HOLD-CALC NEGATIVE
                       COMPUTE HOLD-CALC = HOLD-CALC * -1
                   END-IF
                   IF HOLD-CALC < HOLD-PERCENT
                       GO TO 60-READ-NEXT
                   END-IF
               END-IF
               MOVE HOLD-DIFF      TO  PRT-DET-CHANGE
               MOVE STR-MKT-COST   TO  PRT-DET-CUR-PRICE
               MOVE STR-UM         TO  PRT-DET-CUR-UM.

           PERFORM 999-WRITE-DETAIL-LINE.
           ADD 1                   TO  REC-PROCESSED.

       60-READ-NEXT.
           PERFORM 999-READ-NEXT-PCAT.

       6-MAIN-X.
           EXIT.

      *-------------------------------------------------------------*
      *           U T I L I T Y   P A R A G R A P H S               *
      *-------------------------------------------------------------*

       9-UTILITY SECTION.

       999-READ-NEXT-PCAT.
           READ PCAT-DT NEXT INTO BUF-CSISPCAT
               AT END MOVE FILE-STATUS TO FILE-STATUS.

       999-WRITE-DETAIL-LINE.
           MOVE PCAT-CATALOG-NUM    TO  PRT-DET-CAT-NUM.
           MOVE PCAT-VENDOR-CODE    TO  PRT-DET-VENDOR.
           MOVE PCAT-CORP-CODE      TO  PRT-DET-CODE.
           MOVE PCAT-UNIT-PRICE     TO  PRT-DET-PRICE.
           MOVE PCAT-PRICE-UM       TO  PRT-DET-UM.
           MOVE PCAT-EFFECT-YMD     TO  DATE-VALIDATE-IN.
           MOVE 4                   TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  PRT-DET-EFF-DATE.
           IF PCAT-APPLY-DATE-CN > SPACES
               MOVE 4               TO  DATE-MODE
               MOVE PCAT-APPLY-YMD  TO  DATE-VALIDATE-IN
               CALL "TDATECHK" USING DATE-CHECK-AREA
               MOVE DATE-SLASH-OUT  TO  PRT-DET-APL-DATE
           ELSE
               MOVE SPACES          TO  PRT-DET-APL-DATE.
           MOVE PRT-RPT-DETAIL      TO  REPORT-FILE-REC.
           WRITE REPORT-FILE-REC    AFTER ADVANCING 2 LINES.
           ADD 2                    TO  LINE-COUNT.
           IF LINE-COUNT > 55
               PERFORM 999-WRITE-RPT-HDGS.

       999-WRITE-RPT-HDGS.
           ADD 1                TO  PAGE-COUNT.
           MOVE PAGE-COUNT      TO  PRT-HDG-2-PG.

           MOVE PRT-RPT-HDG-1   TO  REPORT-FILE-REC.
           WRITE REPORT-FILE-REC    AFTER ADVANCING PAGE.

           MOVE PRT-RPT-HDG-2   TO  REPORT-FILE-REC.
           WRITE REPORT-FILE-REC    AFTER ADVANCING 1 LINE.

           MOVE PRT-RPT-HDG-3   TO  REPORT-FILE-REC.
           WRITE REPORT-FILE-REC    AFTER ADVANCING 2 LINES.

           MOVE PRT-RPT-HDG-4   TO  REPORT-FILE-REC.
           WRITE REPORT-FILE-REC    AFTER ADVANCING 1 LINE.

           MOVE 6               TO  LINE-COUNT.

       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

