000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TRPTJ084.
000400 AUTHOR.     A.M.TREUDLER.
001000*
001100*    THIS PROGRAM SETS THE JCW FOR REPORT SAR19 OPEN RECEIVER
001200*    REPORT.  JCW IS SET TO 84.  THE PROGRAM
      *    'SRSCRNS2' IS USED INSTEAD OF 'SRSCRNS'.
001700*
006800 ENVIRONMENT DIVISION.
006900 CONFIGURATION SECTION.
007000 SOURCE-COMPUTER.  HP-3000.
007100 OBJECT-COMPUTER.  HP-3000.
007400

007900 DATA DIVISION.
008900 WORKING-STORAGE SECTION.
       01  BASE    PIC X(10).

       COPY JCWAREA IN COPYCSIS.

       COPY TBLOWUP IN COPYCSIS.

       COPY DBSTAT IN COPYCSIS.

       PROCEDURE DIVISION.
       1000-START.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GOBACK.

029200 2100-BLOWUP.
029300     MOVE "TRPTJ084"             TO   BU-PGM-NAME.
029400     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
029500       DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
029600           BU-DISPLAY-FLDS.

       6000-MAIN.
           MOVE "084"       TO SETJCW-VALUE.
           MOVE 278         TO SETJCW-STARTING-POS.
           MOVE 3           TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           CALL "TRSCREN2".

       6990-MAIN-X.
           EXIT.
