000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TRPTJ062.
000600 DATE-COMPILED.
001000*
001100*    THIS PROGRAM SETS THE JCW FOR REPORT #62 END-OF-SHIFT
001200*    SUMMARY REPORT.
001700*
006800 ENVIRONMENT DIVISION.
006900 CONFIGURATION SECTION.
007000 SOURCE-COMPUTER.  AS400.
007100 OBJECT-COMPUTER.  AS400.
007400

007900 DATA DIVISION.
008900 WORKING-STORAGE SECTION.
       01  BASE    PIC X(10).

       COPY JCWAREA IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       COPY DBSTAT  IN COPYLIB.

       PROCEDURE DIVISION.
       1000-START.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GOBACK.

029200 2100-BLOWUP.
029300     MOVE "TRPTJ062"             TO   BU-PGM-NAME.
029400     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
029500       DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
029600           BU-DISPLAY-FLDS.

       6000-MAIN.
           MOVE "062"       TO SETJCW-VALUE.
           MOVE 278         TO SETJCW-STARTING-POS.
           MOVE 3           TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           CALL "TRSCREEN".

       6990-MAIN-X.
           EXIT.
