000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TRPTADJ.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   JULY, 1982.
000600*REMARKS.        THIS PROGRAM PRODUCES A REPORT WHICH SHOWS ALL
000700*                ADJUSTMENTS MADE ON THE DAY THE REPORT IS RUN.
000800*
000900*                ADDED INTERNATIONAL DATE ROUTINR "TDATECHK"
001000*                ON MAY 21, 1985.   V.W.D.
001100*
001200*    ON JUNE 9, 1985, CHANGED THIS PROGRAM IN ORDER TO
001300*    ELIMINATE THE OLD MODE PROGRAM "TR17MODE", WHICH WAS IN
001400*    "DEL".  THIS PROGRAM IS CHANGED TO USE THE "TRSCREEN"
001500*    MODE PROGRAM TO SELECT REPORT OPTIONS, AND THUS DOES AN
001600*    "ACCEPT" FROM THE JOB STREAM RATHER THAN READING A FILE
001700*    TO GET THE OPTIONS.  ALSO ADDED "THDPRT2" TO PRINT A
001800*    REPORT HEADER AND ROUTING DATA PASSED FROM "TRSCREEN".
001900*    CIH.
002000*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C 09/13/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C 02/19/97  JIM COFFMAN
      *C   ADDED LOGIC TO PRINT THE AVERAGE COST PER VERBAL REQUEST
      *C   FROM GERALD BRYANT IN DANVILLE.
      *C
      *C 09/12/97  JEFF BUNGO
      *C   REMOVED THE LOGIC TO COMBINE ADJUSTMENTS OF CODES.  THIS
      *C   COMBINATION WAS GIVING CONFUSING AND INACCURATE INFORMATION.
      *C   NOW EACH ADJUSTMENT FOR A CODE WILL BE REPORTED WITH NO
      *C   COMBINATIONS.
      *C
      *C 08OCT1997  DAVE PLUM
      *C   REVISED TO HANDLE THE SITUATION WHERE THE DDAILYTC FILE IS
      *C   EMPTY WHEN THIS PROGRAM IS EXECUTED.  PRIOR TO THIS CHANGE
      *C   THE START ON DDAILYTC WOULD RESULT IN TBLOWUP BEING CALLED.
      *C
      *C 11/17/1997  CA YODER
      *C   ADDED A TOTAL FIELD FOR THE TRANSACTION VALUE COLUMN.
      *C   JIM THOMAS REQUESTED THIS CHANGE.
      *C
      *C 19JAN1998  DAVE PLUM
      *C   REVISED TO HANDLE THE SITUATION WHERE AN INVALID SORT OPTION
      *C   IS SPECIFIED.  DEFAULT TO SORT OPTION 1 INSTEAD OF BLOWING UP.
      *C
      *C JANUARY 29, 1998, JEFF BUNGO
      *C   ADDED A NEW REPORT TOTAL OF "CODES ADJUSTED AS PERCENTAGE OF
      *C   TOTAL CODES INVENTORIED (ALL 332 TRANS, INCLUDING ADJ OF 0).
      *C
      *C 04/27/00  JIM COFFMAN
      *C   ADD CHANGES TO HANDLE A PROBLEM UNCOVERED IN THE
      *C   PHILIPPINES WHEREBY THE COST FIELD WAS BEING TRUNCATED
      *C   DUE TO THE BIG AVERAGE COST FIELD NOT BEING USED AS
      *C   IT IS IN TDCLYAB2 TO CALCULATE VALUE.
      *C
      *C 12/08/04  CA YODER    REQUEST #2004-84029
      *C   CHANGED THE WORDING ON ONE TOTAL LINE AND ADDED TWO
      *C   MORE TOTAL LINES AT THE END OF THE REPORT.
      *C
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400 OBJECT-COMPUTER.
002500 SPECIAL-NAMES. C01 IS NEW-PAGE.
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
002900     SELECT SORT-FILE ASSIGN TO DISK-SORT.
003000     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
003100     SELECT COMBINED-CODE-FILE ASSIGN TO DATABASE-COMBCODE.
003200     SELECT ADJ-FILE ASSIGN TO DATABASE-ABSTFIL2.
003300
           SELECT DDAILYTC-I
                  ASSIGN TO DATABASE-MCFLCS1601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

003400 DATA DIVISION.
003500 FILE SECTION.
003600 FD  ONLINE-PRT
003700     LABEL RECORDS ARE OMITTED
003800     RECORD CONTAINS 132 CHARACTERS
003900     DATA RECORD IS ONLINE-PRT-REC.
004000 01  ONLINE-PRT-REC            PIC X(132).
004100
004200 SD  SORT-FILE
004300     RECORD CONTAINS 84 CHARACTERS
004400     DATA RECORD IS SORT-REC.
004500 01  SORT-REC.
004600     05  SORT-CODE             PIC X(8).
004700     05  SORT-DATE             PIC X(6).
004800     05  SORT-TIME.
004900         10  SORT-TIME-HH      PIC X(2).
005000         10  SORT-TIME-MM      PIC X(2).
005100         10  SORT-TIME-SS      PIC X(2).
005200     05  SORT-CHARGED          PIC X(6).
005300     05  SORT-PREV-QTY         PIC S9(8).
005400     05  SORT-ADJ-QTY          PIC S9(8).
005500     05  SORT-ADJ-QTY-UNSIGNED PIC S9(8).
005600     05  SORT-AVG-COST         PIC 9(11)V9(4).
005700     05  SORT-UM               PIC X(2).
005800     05  SORT-ONHAND           PIC S9(8).
005900     05  SORT-PERCT-ADJ        PIC 9(8)V9.
006000
006100 FD  COMBINED-CODE-FILE
006200     RECORD CONTAINS 84 CHARACTERS
006300     DATA RECORD IS COMBINED-CODE-REC.
006400 01  COMBINED-CODE-REC    PIC X(84).
006500
006600 FD  ADJ-FILE
006700     LABEL RECORDS ARE STANDARD
006800     RECORD CONTAINS 80 CHARACTERS
006900     DATA RECORD IS ADJ-RCD-IN.
       01  ADJ-RCD-IN  PIC X(80).

       FD  DDAILYTC-I
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-I.
           COPY DDS-MCRPCS1600  OF MCFLCS1601.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

008500
008600 WORKING-STORAGE SECTION.
008700
008800 COPY TDATECHK   IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.
       COPY CCHKOBJ    IN COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
008900
009000 77  LINE-K                         PIC 99    VALUE ZERO.
009100 77  PAGE-K                         PIC 9(4)  VALUE ZERO.
       77  TOTAL-CODES-INVENTORIED        PIC 9(5)  VALUE ZERO.
009200 77  TOTAL-CODES-ADJUSTED           PIC 9(5)  VALUE ZERO.
009200 77  TOTAL-ADJUSTMENTS              PIC 9(5)  VALUE ZERO.
009300 77  TOTAL-CODES                    PIC 9(5)  VALUE ZERO.
009400 77  TOTAL-ADJUSTMENT-UNITS         PIC 9(9)  VALUE ZERO.
009500 77  TOTAL-PREV-UNITS               PIC 9(9)  VALUE ZERO.
009600 77  TOTAL-NEW-UNITS                PIC 9(9)  VALUE ZERO.
009700 77  TOTAL-PERCT-ADJ                PIC 9(8)V9  VALUE ZERO.
009800 77  TOTAL-ADJ-COST                 PIC 9(9)V9(4)  VALUE ZERO.
009900 77  HOLD-PREV-QTY                  PIC S9(8).
010000 77  HOLD-ADJ-QTY                   PIC S9(8).
010100 77  HOLD-PERCT-ADJ                 PIC 9(8)V999.
010200 77  HOLD-CODES-ADJ-PERCT           PIC 9(3)V9(6).
010300 77  HOLD-AVG-PERCT-OF-ADJ          PIC 9(8)V9(3).
9406CK 01  SCOPE   PIC X.
       77  TOTAL-VALUE                    PIC S9(12)V9(4).
       77  HOLD-CP-TRAN-VALUE             PIC S9(12)V9(4).
       77  TOTAL-STRM-VALUE               PIC S9(12)V9(4).
       77  TOTAL-STRM-VALUE-RND           PIC S9(12).
       77  TOTAL-PREV-VALUE               PIC S9(12)V9(4).
010400
007000 01  ADJ-RCD.
007100         10  ADJ-DATE        PIC X(6).
007200         10  ADJ-TIME        PIC X(6).
007300         10  ADJ-TC          PIC X(3).
007400         10  ADJ-PLT         PIC X(3).
007500         10  ADJ-CODE.
007600             15  ADJ-CODE-1-2 PIC X(2).
007700             15  FILLER           PIC X(5).
007800         10  ADJ-CHRG        PIC X(6).
007900         10  ADJ-QTY     PIC S9(8).
008000         10  ADJ-AVG-COST    PIC S9(5)V9(4).
008100         10  ADJ-UM          PIC XX.
008200         10  ADJ-ONHAND      PIC S9(8).
               10  ADJ-AVG-COST-BIG  PIC 9(11)V9(2).
008300         10  FILLER              PIC X(09).
008400
010500 01  SAVE-REC.
010600     05  SAVE-CODE             PIC X(8).
010700     05  SAVE-DATE             PIC X(6).
010800     05  SAVE-TIME.
010900         10  SAVE-TIME-HH      PIC X(2).
011000         10  SAVE-TIME-MM      PIC X(2).
011100         10  SAVE-TIME-SS      PIC X(2).
011200     05  SAVE-CHARGED          PIC X(6).
011300     05  SAVE-PREV-QTY         PIC S9(8).
011400     05  SAVE-ADJ-QTY          PIC S9(8).
011500     05  SAVE-ADJ-QTY-UNSIGNED PIC S9(8).
011600     05  SAVE-AVG-COST         PIC 9(11)V9(4).
011700     05  SAVE-UM               PIC X(2).
011800     05  SAVE-ONHAND           PIC S9(8).
011900     05  SAVE-PERCT-ADJ        PIC 9(8)V9.
012000 COPY THDPRTA   IN COPYLIB.
016000 COPY ESCNAM2   IN COPYLIB.
016100
016200 01  JCW-PARMS.
016300     05  JCW-NAME             PIC X(12) VALUE SPACES.
016400     05  JCW-VALUE            PIC S9(4) COMP-4 VALUE ZEROES.
016500     05  JCW-STATUS           PIC S9(4) COMP-4 VALUE ZEROES.
016600
016700 77  PAPER-VALUE              PIC S9(4) COMP-4 VALUE ZEROES.
016800
016900 01  COMP-ESC-SEQ             PIC X(8)  VALUE SPACES.
017000 01  STAND-ESC-SEQ            PIC X(8)  VALUE SPACES.
017100
020600**************************************************************
020700**                                                          **
020800**       C O M M U N I C A T I O N S   A R E A S            **
020900**                                                          **
021000**************************************************************
021100
      *------ PARMS FOR CALL TO 'QCMDEXC': EXECUTE A COMMAND
       01  COMMAND-WORK                      PIC X(70).
       01  COMMAND-LEN      PIC S9(10)V9(5) COMP-3 VALUE 70.

021200 01  SPOOLER-AREA.
021300     05  SPOOL-STAT           PIC S9     COMP-4 VALUE 0.
021400     05  SPOOL-PRT            PIC S9(2)  COMP-4 VALUE 8.
021500     05  SPOOL-COPIES         PIC S9(2)  COMP-4 VALUE 1.
021600     05  SPOOL-PRIOR          PIC S9     COMP-4 VALUE ZERO.
021700     05  SPOOL-MSG            PIC X(75) VALUE SPACES.
021800
022600**************************************************************
022700**                                                          **
022800**           D A T A B A S E   W O R K                      **
022900**                                                          **
023000**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
023100
023200 01  BASE                    PIC X(9)   VALUE "  STORES;".
023300 01  PASSWORD                PIC X(8)   VALUE "JADE;   ".
023400
023500 01  DB-DATASETS.
023600     05  DSET-DDAILYTC       PIC X(16)  VALUE "DDAILYTC;".
023700     05  DSET-MSTORERM       PIC X(16)  VALUE "MSTORERM;".
023800
023900 01  ITEM-LISTS.
024000     05  ALL-ITEM-LIST          PIC XX   VALUE "@;".
024100
024200 01  MODE-AREA.
024300     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
024400     05  MODE2                  PIC S9(4)   COMP       VALUE 2.
024500     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
024600
       COPY DBSTAT IN COPYLIB.
025500 01  NO-ARG                     PIC X     VALUE SPACES.
025600 01  ST-CODE-ARG                PIC X(8)  VALUE SPACES.
025700
025800**************************************************************
025900**                                                          **
026000**           D A T A B A S E   B U F F E R S                **
026100**                                                          **
026200**************************************************************
026300
026400 COPY MSTORERM   IN COPYLIB.
026500 01  BUF-DDAILYTC.
026600     05  DAILY-TC.
026700         10  DLY-TC-DATE         PIC X(6).
026800         10  DLY-TC-TIME         PIC X(6).
026900         10  DLY-TC-TC           PIC X(3).
027000         10  DLY-TC-PLT          PIC X(3).
027100         10  DLY-TC-CODE         PIC X(7).
027200         10  DLY-ADJ-CHRG        PIC X(6).
027300         10  DLY-ADJ-QTY         PIC S9(8).
027400         10  DLY-ADJ-AVG-CST     PIC S9(5)V9(4).
027500         10  DLY-ADJ-UM          PIC XX.
027600         10  FILLER              PIC X(30).
027700
027800**************************************************************
027900**                                                          **
028000**       H E A D E R   &   D E T A I L   L I N E S          **
028100**                                                          **
028200**************************************************************
028300
028400 01  CP-HDR-1.
028500     05  FILLER         PIC X(4)  VALUE "PAGE".
028600     05  CP-PRT-PAGE    PIC ZZZ9.
028700     05  FILLER         PIC X(9)  VALUE "  TRPTADJ".
028800     05  FILLER         PIC X(8)  VALUE SPACES.
028900     05  FILLER         PIC X(21) VALUE "INVENTORY ADJUSTMENTS".
029000     05  FILLER         PIC X(10) VALUE SPACES.
029100     05  FILLER         PIC X(5)  VALUE "DATE ".
029200     05  CP-PRT-DATE    PIC X(8).
029300     05  FILLER         PIC X(2)  VALUE SPACES.
029400     05  CP-PRT-TIME   PIC X(8)  VALUE SPACES.
029500     05  FILLER         PIC X(2)  VALUE SPACES.
029600
029700 01  CP-HDR-2.
029800     05  FILLER      PIC X(2)  VALUE SPACES.
029900     05  FILLER      PIC X(4)  VALUE "CORP".
030000     05  FILLER      PIC X(5)  VALUE SPACES.
030100     05  FILLER      PIC X(7)  VALUE "ADJUST.".
030200     05  FILLER      PIC X(2)  VALUE SPACES.
030300     05  FILLER      PIC X(8)  VALUE "PREVIOUS".
030400     05  FILLER      PIC X(16) VALUE SPACES.
030500     05  FILLER      PIC X(7)  VALUE "CURRENT".
030600     05  FILLER      PIC X(2)  VALUE SPACES.
030700     05  FILLER      PIC X(10) VALUE "PERCENT OF".
           05  FILLER      PIC X(16) VALUE "        TRANS   ".
030900
031000 01  CP-HDR-3.
031100     05  FILLER      PIC X(2)  VALUE SPACES.
031200     05  FILLER      PIC X(4)  VALUE "CODE".
031300     05  FILLER      PIC X(6)  VALUE SPACES.
031400     05  FILLER      PIC X(4)  VALUE "TIME".
031500     05  FILLER      PIC X(4)  VALUE SPACES.
031600     05  FILLER      PIC X(8)  VALUE "QUANTITY".
031700     05  FILLER      PIC X(2)  VALUE SPACES.
031800     05  FILLER      PIC X(10) VALUE "ADJUSTMENT".
031900     05  FILLER      PIC X(3)  VALUE SPACES.
032000     05  FILLER      PIC X(8)  VALUE "QUANTITY".
032100     05  FILLER      PIC X(2)  VALUE SPACES.
032200     05  FILLER      PIC X(10) VALUE "ADJUSTMENT".
           05  FILLER      PIC X(16) VALUE "        VALUE   ".
032300
032400 01  CP-DETAIL-1.
032500     05  FILLER      PIC X(1)  VALUE SPACES.
032600     05  CP-PRT-CODE PIC X(7).
032700     05  FILLER      PIC X(2)  VALUE SPACES.
032800     05  CP-ADJUST-TIME.
032900         10  CP-T-HH PIC X(2).
033000         10  FILLER  PIC X     VALUE ":".
033100         10  CP-T-MM PIC X(2).
033200         10  FILLER  PIC X     VALUE ":".
033300         10  CP-T-SS PIC X(2).
033400     05  FILLER      PIC X(2)  VALUE SPACES.
033500     05  CP-PRT-PREV-QTY    PIC Z(7)9.
033600     05  FILLER             PIC X(2)  VALUE SPACES.
033700     05  CP-PRT-ADJ         PIC --------9.
033800     05  FILLER             PIC X(2)  VALUE SPACES.
033900     05  CP-PRT-NEW-QTY     PIC Z(7)9.
034000     05  CP-PRT-PERCT-ADJ   PIC ZZZZZZZ9.9.
034100     05  CP-PRT-PERCT-ADJ-X REDEFINES CP-PRT-PERCT-ADJ
034200            PIC X(10).
034300     05  CP-PRT-PERCT       PIC X     VALUE "%".
           05  CP-TRAN-VALUE      PIC -----------9.9(4).
034500
034600 01  CP-TOTAL-LINE-0.
034700     05  FILLER             PIC X(2) VALUE SPACES.
034800     05  FILLER             PIC X(16) VALUE "TOTAL QUANTITIES".
034900     05  CP-PRT-TOT-PREV-QTY PIC Z(9)9.
035000     05  FILLER              PIC X(1)  VALUE SPACES.
035100     05  CP-PRT-TOT-ADJ-1    PIC Z(9)9.
035200*    05  FILLER              PIC X(2)  VALUE SPACES.
035300     05  CP-PRT-TOT-NEW-QTY  PIC Z(9)9.
           05  FILLER              PIC X(11) VALUE SPACES.
           05  CP-PRT-TOT-VALUE   PIC -----------9.9(4).
035400
035500 01  CP-TOTAL-LINE-1.
035600     05  FILLER             PIC X(16) VALUE "     TOTAL CODES".
035700     05  FILLER             PIC X(32) VALUE SPACES.
035800     05  CP-TOT-CODES       PIC ZZZZ9.
035900
       01  CP-TOTAL-LINE-1B.
           05  FILLER             PIC X(16) VALUE "     TOTAL VALUE".
           05  FILLER             PIC X(25) VALUE SPACES.
           05  CP-TOT-STRM-VALUE  PIC -----------9.

036000 01  CP-TOTAL-LINE-2A.
036100     05  FILLER             PIC X(5)  VALUE SPACES.
036200     05  FILLER             PIC X(17) VALUE "CODES INVENTORIED".
036300     05  FILLER             PIC X(26) VALUE SPACES.
036400     05  CP-TOT-CODES-INV   PIC ZZZZ9.
035900
036000 01  CP-TOTAL-LINE-2.
036100     05  FILLER             PIC X(5)  VALUE SPACES.
036200     05  FILLER             PIC X(14) VALUE "CODES ADJUSTED".
036300     05  FILLER             PIC X(29) VALUE SPACES.
036400     05  CP-TOT-CODES-ADJ   PIC ZZZZ9.
036500
       01  CP-TOTAL-LINE-3A.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER            PIC X(20) VALUE "CODES INVENTORIED AS".
           05  FILLER             PIC X(15) VALUE " PERCENTAGE OF ".
           05  FILLER             PIC X(10) VALUE "ALL CODES ".
           05  CP-CODES-IVA-PERCT PIC ZZ9.999.
           05  FILLER             PIC X     VALUE "%".

036600 01  CP-TOTAL-LINE-3.
036700     05  FILLER             PIC X(5)  VALUE SPACES.
036800     05  FILLER             PIC X(17) VALUE "CODES ADJUSTED AS".
036900     05  FILLER             PIC X(15) VALUE " PERCENTAGE OF ".
037000     05  FILLER             PIC X(13) VALUE "ALL CODES    ".
037100     05  CP-CODES-ADJ-PERCT PIC ZZ9.999.
037200     05  FILLER             PIC X     VALUE "%".
037300
       01  CP-TOTAL-LINE-3B.
           05  FILLER             PIC X(5)  VALUE SPACES.
      *****05  FILLER             PIC X(17) VALUE "CODES ADJUSTED AS".
           05  FILLER             PIC X(17) VALUE "COUNT ADJUSTED AS".
           05  FILLER             PIC X(15) VALUE " PERCENTAGE OF ".
           05  FILLER             PIC X(13) VALUE "INV CODES    ".
           05  CP-CODES-INV-PERCT PIC ZZ9.999.
           05  FILLER             PIC X     VALUE "%".

       01  CP-TOTAL-LINE-3C.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(18) VALUE "DOLLAR ADJUSTED AS".
           05  FILLER             PIC X(15) VALUE " PERCENTAGE OF ".
           05  FILLER             PIC X(12) VALUE "ALL CODES   ".
           05  CP-DOLLR-ALL-ADJ   PIC ZZ9.999.
           05  FILLER             PIC X     VALUE "%".

       01  CP-TOTAL-LINE-3D.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  FILLER             PIC X(18) VALUE "DOLLAR ADJUSTED AS".
           05  FILLER             PIC X(15) VALUE " PERCENTAGE OF ".
           05  FILLER             PIC X(12) VALUE "INV CODES   ".
           05  CP-DOLLR-INV-ADJ   PIC ZZ9.999.
           05  FILLER             PIC X     VALUE "%".

037400 01  CP-TOTAL-LINE-4.
037500     05  FILLER             PIC X(5)  VALUE SPACES.
037600     05  FILLER             PIC X(15) VALUE "AVERAGE PERCENT".
037700*****05  FILLER             PIC X(14) VALUE " OF ADJUSTMENT".
           05  FILLER             PIC X(18) VALUE " OF ADJUSTED COUNT".
037800     05  FILLER             PIC X(7)  VALUE SPACES.
037900     05  CP-AVG-PERCT-OF-ADJ PIC ZZZZZZZ9.9.
038000     05  FILLER             PIC X     VALUE "%".
038100
038200 01  CP-TOTAL-LINE-5.
038300     05  FILLER             PIC X(5)  VALUE SPACES.
038400     05  FILLER             PIC X(16) VALUE "TOTAL ADJUSTMENT".
038500     05  FILLER             PIC X(6)  VALUE " UNITS".
038600     05  FILLER             PIC X(17) VALUE SPACES.
038700     05  CP-ADJ-UNITS       PIC Z(8)9.
038800
038900 01  CP-TOTAL-LINE-6.
039000     05  FILLER             PIC X(5)  VALUE SPACES.
039100     05  FILLER             PIC X(16) VALUE "TOTAL ADJUSTMENT".
039200     05  FILLER             PIC X(5)  VALUE " COST".
039300     05  FILLER             PIC X(18) VALUE SPACES.
039400     05  CP-ADJ-COST        PIC $(8)9.
039500
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
012100 01  R17-REC.
012200     05  R17-SORT-OPTION      PIC X.
012300     05  R17-MATERIAL-OPTION  PIC X.
012400     05  R17-CLASS-1.
012500         10  R17-MG-1         PIC X(2).
012600         10  FILLER           PIC X(2).
012700     05  R17-CLASS-2.
012800         10  R17-MG-2         PIC X(2).
012900         10  FILLER           PIC X(2).
013000     05  R17-CLASS-3.
013100         10  R17-MG-3         PIC X(2).
013200         10  FILLER           PIC X(2).
013300     05  R17-CLASS-4.
013400         10  R17-MG-4         PIC X(2).
013500         10  FILLER           PIC X(2).
013600     05  R17-CLASS-5.
013700         10  R17-MG-5         PIC X(2).
013800         10  FILLER           PIC X(2).
013900     05  DDAILY-OR-FILE       PIC X(1).
014000     05  FILLER               PIC X(57).
           05  FILLER               PIC X(81).
014100
039600 PROCEDURE DIVISION USING HD-ROUTE-DATA, R17-REC.
039700 1-HOUSEKEEP SECTION.
039800 1-BEGIN-HOUSEKEEP.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           MOVE ZERO TO LINE-K, PAGE-K, TOTAL-CODES-ADJUSTED,
             TOTAL-CODES, TOTAL-ADJUSTMENT-UNITS,
             TOTAL-PREV-UNITS, TOTAL-NEW-UNITS,
             TOTAL-PERCT-ADJ, TOTAL-ADJ-COST, TOTAL-VALUE,
             TOTAL-STRM-VALUE, TOTAL-PREV-VALUE.
           OPEN INPUT MSTORERM-I, DDAILYTC-I.
040500************************************************
040600**  ACCEPT ROUTING INFO FROM PGM "TRSCREEN"   **
040700**  WHICH WILL BE PASSED ON TO PGM "THDPRT2".  **
040800************************************************
040900
041000     DISPLAY "ENTER ROUTING DATA".
041200     DISPLAY "HD-ROUTE-DATA = ", HD-ROUTE-DATA.
041300
041400************************************************
041500**  ACCEPT R17-REC TO DETERMINE PARMS FOR     **
041600**  REPORT.  PARMS ARE ESTABLISHED BY PROGRAM **
041700**  XRSCREEN.OBJECT.                          **
041800************************************************
041900
042000     DISPLAY "ENTER REPORT OPTIONS".
042200     DISPLAY "R17-REC = ", R17-REC.
042300
042400     MOVE HD-SPOOLER-NUMBER TO SPOOL-PRT.
042500**************************************************************
042600**   DATA IN THE JOB STREAM TELLS US WHETHER TO GO TO       **
042700**   DDAILYTC OR TO A FILE FOR TRANSACTION DATA.  IF FILE   **
042800**   IS CHOSEN, THE JOB WILL DETERMINE WHICH ABSTFILE THRU  **
042900**   THE USE OF A FILE COMMAND :FILE ADJFILE=ABSTFILx       **
043000**************************************************************
043100
043200     IF DDAILY-OR-FILE = "D" OR "F"
043300         NEXT SENTENCE
043400     ELSE
043500         MOVE "D"  TO  DDAILY-OR-FILE.
043600
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
043800     OPEN OUTPUT ONLINE-PRT
043900
           MOVE "DHDR17.PUB" TO HD-FILE-NAME.
044200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
044300          HD-ROUTE-DATA, ESC-NAME.
044400     IF HD-RET-CODE NOT = 0
044500         MOVE "THDPRT2 ERR 7-WR" TO BU-DISPLAY-MSG
044600         MOVE HD-RET-CODE       TO BU-DISPLAY-FLD (5)
044700         GO TO 2-BLOWUP.
044800
044900     CALL "TESCSEQ" USING ESC-NAME.
045000     MOVE CHAR-1636PI TO COMP-ESC-SEQ.
045100     MOVE CHAR-10PI TO STAND-ESC-SEQ.
045200
046500     IF NOT PAPER-IS-132-COLS
046600        MOVE COMP-ESC-SEQ TO ONLINE-PRT-REC
046700        WRITE ONLINE-PRT-REC BEFORE ADVANCING 0 LINES.
046800
046900     MOVE 1 TO DATE-MODE.
047000     CALL "TDATECHK" USING DATE-CHECK-AREA.
047100     MOVE DATE-SLASH-OUT TO CP-PRT-DATE.
047200     MOVE DATE-FORMATTED-TIME-OUT TO CP-PRT-TIME.
047400
047500     PERFORM 922-WRITE-CP-HEADERS.
047600
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'XXXXXXXX'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "COMBCODE"    TO CCRTFILE-FILE.
           MOVE "0084"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'COMBCODE' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

047700     SORT SORT-FILE
047800         ON ASCENDING KEY SORT-CODE
047900         INPUT PROCEDURE IS 7-READ-ADJ
048000         OUTPUT PROCEDURE IS 7-COMBINE-CODES.
048100
048200     IF R17-SORT-OPTION = "1"
048300         SORT SORT-FILE
048400             ON DESCENDING KEY SORT-PERCT-ADJ
048500             USING COMBINED-CODE-FILE
048600             OUTPUT PROCEDURE IS 9-PRINT-REPORT
048700     ELSE
048800     IF R17-SORT-OPTION = "2"
048900         SORT SORT-FILE
049000             ON ASCENDING KEY SORT-CODE
049100             USING COMBINED-CODE-FILE
049200             OUTPUT PROCEDURE IS 9-PRINT-REPORT
049300     ELSE
049400     IF R17-SORT-OPTION = "3"
049500         SORT SORT-FILE
049600             ON ASCENDING KEY SORT-DATE SORT-TIME
049700             USING COMBINED-CODE-FILE
049800             OUTPUT PROCEDURE IS 9-PRINT-REPORT
049900     ELSE
050000     IF R17-SORT-OPTION = "4"
050100         SORT SORT-FILE
050200             ON DESCENDING KEY SORT-ADJ-QTY-UNSIGNED
050300             USING COMBINED-CODE-FILE
050400             OUTPUT PROCEDURE IS 9-PRINT-REPORT
050500     ELSE
050600*********MOVE "INVALID SORT OPTION 1-BH" TO BU-DISPLAY-MSG
050700*********MOVE R17-SORT-OPTION            TO BU-DISPLAY-FLD (5)
050800*********GO TO 2-BLOWUP.
               DISPLAY "R17-SORT-OPTION = ", R17-SORT-OPTION
               DISPLAY "*** DEFAULTING TO SORT OPTION 1 ***"
               MOVE "1" TO R17-SORT-OPTION
               SORT SORT-FILE
                   ON DESCENDING KEY SORT-PERCT-ADJ
                   USING COMBINED-CODE-FILE
                   OUTPUT PROCEDURE IS 9-PRINT-REPORT.

051000     IF BU-DISPLAY-MSG = SPACES
051100         GO TO 2-EOJ.
051200
051300 2-BLOWUP.
           MOVE ST-CODE-ARG TO BU-DISPLAY-FLD (1).
           MOVE "TRPTADJ" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-AREA.
053600
053700 2-EOJ.
           CLOSE MSTORERM-I, DDAILYTC-I.
054000     GOBACK.
054100
054200 7-READ-ADJ SECTION.
       7-READ-ADJ-PARA.
054300     IF DDAILY-OR-FILE = "F"
054400         OPEN INPUT ADJ-FILE.
054500
           MOVE SPACES TO DLYTCDTE OF DDAILYTC-REC-I.
           START DDAILYTC-I KEY >= DLYTCDTE OF DDAILYTC-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
      *****IF FILE-STATUS NOT = "00"   *REPLACED 08OCT1997*
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERR DDAILYTC 7-RAP" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE ZERO TO TOTAL-CODES-INVENTORIED.

054600 7-READ-ADJ-FILE.
054700
           IF DDAILY-OR-FILE = "F"
               READ ADJ-FILE INTO ADJ-RCD AT END
                   CLOSE ADJ-FILE
                   GO TO 7-RA-X.

056400     IF DDAILY-OR-FILE = "D"
056500*        CALL "DBGET" USING BASE DSET-DDAILYTC MODE2 STATUS-AREA
056600*          ALL-ITEM-LIST BUF-DDAILYTC ST-CODE-ARG
               READ DDAILYTC-I NEXT INTO BUF-DDAILYTC
                   AT END MOVE FILE-STATUS TO FILE-STATUS
               END-READ
056700*********IF FILE-STATUS-1 = "1"    *REPLACED 08OCT1997*
               IF FILE-STATUS = "10" OR "14" OR "46"
056800             GO TO 7-RA-X
056900         ELSE
057000         IF FILE-STATUS = "00"
057100             MOVE DAILY-TC TO ADJ-RCD
057200         ELSE
057300             MOVE "DBGET ERR DDAILYTC" TO BU-DISPLAY-MSG
057500             GO TO 2-BLOWUP.
057600
057700     IF ADJ-TC NOT = "332"
057800         GO TO 7-READ-ADJ-FILE.
057900
058000     IF R17-MATERIAL-OPTION = "2"
058100         IF ADJ-CODE-1-2 = R17-MG-1 OR R17-MG-2 OR
058200                               R17-MG-3 OR R17-MG-4 OR
058300                               R17-MG-5
058400             NEXT SENTENCE
058500         ELSE
058600             GO TO 7-READ-ADJ-FILE
058700     ELSE
058800     IF R17-MATERIAL-OPTION = "3"
058900         MOVE ADJ-CODE TO ST-CODE-ARG
059000*        CALL "DBGET" USING BASE DSET-MSTORERM MODE7
059100*          STATUS-AREA ALL-ITEM-LIST BUF-MSTORERM ST-CODE-ARG
               MOVE ST-CODE-ARG TO CORPCDE OF MSTORERM-REC-I
               READ MSTORERM-I INTO BUF-MSTORERM
                   INVALID KEY MOVE 17 TO COND-WORD
               END-READ
059200         IF STR-CLASS = R17-CLASS-1 OR R17-CLASS-2 OR R17-CLASS-3
059300                                    OR R17-CLASS-4 OR R17-CLASS-5
059400              NEXT SENTENCE
059500         ELSE
059600              GO TO 7-READ-ADJ-FILE.

           ADD 1 TO TOTAL-CODES-INVENTORIED.

           IF ADJ-QTY = 0
               GO TO 7-READ-ADJ-FILE.
059700
059800     MOVE ADJ-CODE        TO SORT-CODE.
059900     MOVE ADJ-DATE        TO SORT-DATE.
060000     MOVE ADJ-TIME        TO SORT-TIME.
060100     MOVE ADJ-CHRG        TO SORT-CHARGED.
060200     MOVE ADJ-QTY         TO SORT-ADJ-QTY.
060300     MOVE ADJ-QTY         TO SORT-ADJ-QTY-UNSIGNED.
060400     MOVE ADJ-AVG-COST-BIG  TO SORT-AVG-COST.
060500     MOVE ADJ-UM          TO SORT-UM.
060600     MOVE ADJ-ONHAND      TO SORT-ONHAND.
060700
060800     SUBTRACT SORT-ADJ-QTY FROM SORT-ONHAND
060900        GIVING HOLD-PREV-QTY.
061000     MOVE HOLD-PREV-QTY       TO SORT-PREV-QTY.
           DISPLAY "SORT-PERCT-ADJ:  " SORT-PERCT-ADJ.
061100
061200 7-CONTINUE.
061300     RELEASE SORT-REC.
061400
061500     GO TO 7-READ-ADJ-FILE.
061600
061700 7-RA-X.
061800     EXIT.
061900
062000 7-COMBINE-CODES SECTION.
       7-COMBINE-CODES-PARA.
062100     OPEN OUTPUT COMBINED-CODE-FILE.
062200     RETURN SORT-FILE AT END
062300         CLOSE COMBINED-CODE-FILE
062400         GO TO 7-CC-X.
062500     MOVE SORT-REC TO SAVE-REC.
           ADD 1 TO TOTAL-CODES-ADJUSTED.
062600
062700 71-COMBINE-LOOP.
062800     RETURN SORT-FILE AT END
062900         PERFORM 73-WRITE-TO-FILE THRU 73-WTF-X
063000         CLOSE COMBINED-CODE-FILE
063100         GO TO 7-CC-X.
063200
      *-----9/12/97 JSB, REMOVE COMBINATION OF CODES
      *----- BUT KEEP TRACK OF NUMBER OF UNIQUE CODES
063300     IF SORT-CODE = SAVE-CODE
063400*        PERFORM 72-COMBINE-A-CODE THRU 72-CAC-X
               PERFORM 73-WRITE-TO-FILE THRU 73-WTF-X
063500     ELSE
               ADD 1 TO TOTAL-CODES-ADJUSTED
063600         PERFORM 73-WRITE-TO-FILE THRU 73-WTF-X.
063700
063800     GO TO 71-COMBINE-LOOP.
063900
      *-----9/12/97 JSB, REMOVE COMBINATION OF CODES
064000*72-COMBINE-A-CODE.
064100*    ADD SAVE-ADJ-QTY   TO SORT-ADJ-QTY.
064200*    ADD SAVE-ADJ-QTY-UNSIGNED TO SORT-ADJ-QTY-UNSIGNED.
064300*    MOVE SAVE-PREV-QTY TO SORT-PREV-QTY.
064400*    MOVE SORT-REC      TO SAVE-REC.
064500*72-CAC-X.
064600*    EXIT.
064700
064800 73-WRITE-TO-FILE.
064900     IF SAVE-ADJ-QTY-UNSIGNED < 1
065000          MULTIPLY -1 BY SAVE-ADJ-QTY-UNSIGNED.
065100     IF SAVE-PREV-QTY < 1
065200         MOVE 99999999.9 TO SAVE-PERCT-ADJ
065300         GO TO 73-CONT.
065400
065500     IF SAVE-ADJ-QTY < 0
065600         MULTIPLY SAVE-ADJ-QTY BY -1 GIVING HOLD-ADJ-QTY
065700     ELSE
065800         MOVE SAVE-ADJ-QTY TO HOLD-ADJ-QTY.
065900     DIVIDE HOLD-ADJ-QTY BY SAVE-PREV-QTY
066000         GIVING HOLD-PERCT-ADJ ROUNDED.
066100     MULTIPLY HOLD-PERCT-ADJ BY 100 GIVING HOLD-PERCT-ADJ.
066200     MOVE HOLD-PERCT-ADJ TO SAVE-PERCT-ADJ.
066300
066400 73-CONT.
066500     MOVE SAVE-REC TO COMBINED-CODE-REC.
066600     WRITE COMBINED-CODE-REC.
066700     MOVE SORT-REC TO SAVE-REC.
066800
066900 73-WTF-X.
067000     EXIT.
067100
067200 7-CC-X.
067300     EXIT.
067400 9-PRINT-REPORT SECTION.
       9-PRINT-REPORT-PARA.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE "START ERR MSTORERM 9-PRP" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

067500 91-COUNT-CODES.
067600*    CALL "DBGET" USING BASE DSET-MSTORERM MODE2 STATUS-AREA
067700*       ALL-ITEM-LIST BUF-MSTORERM NO-ARG.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
067800     IF FILE-STATUS-1 = "1"
067900         GO TO 92-WRITE-DETAIL-LINES
068000     ELSE
068100     IF FILE-STATUS NOT = "00"
068200         MOVE "DBGET ERR MSTORE 91-CC" TO BU-DISPLAY-MSG
068400         GO TO 9-WR-X.
068500
068600     IF R17-MATERIAL-OPTION = "2"
068700         IF CORP-CODE-1-2 = R17-MG-1 OR R17-MG-2 OR
068800                                R17-MG-3 OR R17-MG-4 OR
068900                                R17-MG-5
069000             ADD 1 TO TOTAL-CODES
                   COMPUTE TOTAL-STRM-VALUE ROUNDED =
                           TOTAL-STRM-VALUE +
                                        (STR-ONHAND * STR-AVG-COST)
069100         ELSE
069200             NEXT SENTENCE
069300     ELSE
069400     IF R17-MATERIAL-OPTION = "3"
069500         IF STR-CLASS = R17-CLASS-1 OR R17-CLASS-2 OR R17-CLASS-3
069600                                    OR R17-CLASS-4 OR R17-CLASS-5
069700             ADD 1 TO TOTAL-CODES
                   COMPUTE TOTAL-STRM-VALUE ROUNDED =
                           TOTAL-STRM-VALUE +
                                        (STR-ONHAND * STR-AVG-COST)
069800          ELSE
069900             NEXT SENTENCE
070000     ELSE
070100         ADD 1 TO TOTAL-CODES
               COMPUTE TOTAL-STRM-VALUE ROUNDED =
                       TOTAL-STRM-VALUE + (STR-ONHAND * STR-AVG-COST).
070200
070300     GO TO 91-COUNT-CODES.
070400
070700 92-WRITE-DETAIL-LINES.
070800     RETURN SORT-FILE
070900         AT END GO TO 93-WRITE-TOTALS.
071000
071100     IF SORT-ADJ-QTY = 0
071200         GO TO 92-WRITE-DETAIL-LINES.
071300
071400     ADD 1                TO TOTAL-ADJUSTMENTS.
071500     ADD SORT-PREV-QTY    TO TOTAL-PREV-UNITS.
071600     ADD SORT-ONHAND      TO TOTAL-NEW-UNITS.
071700     IF SORT-ADJ-QTY < 0
071800         MULTIPLY SORT-ADJ-QTY BY -1 GIVING HOLD-ADJ-QTY
071900         ADD HOLD-ADJ-QTY TO TOTAL-ADJUSTMENT-UNITS
072000     ELSE
072100         ADD SORT-ADJ-QTY TO TOTAL-ADJUSTMENT-UNITS.
           COMPUTE TOTAL-PREV-VALUE ROUNDED = TOTAL-PREV-VALUE
                                    + (SORT-AVG-COST * SORT-PREV-QTY).
072200
072300     IF HD-SPOOLER-NUMBER NOT = SPACES
072400         PERFORM 921-MOVE-CP-FIELDS
072500         WRITE ONLINE-PRT-REC FROM CP-DETAIL-1
072600             AFTER ADVANCING 1.
072700     ADD 1 TO LINE-K.
072800     IF LINE-K > 55
072900          IF HD-SPOOLER-NUMBER NOT = SPACES
073000              PERFORM 922-WRITE-CP-HEADERS.
073100
073200
073300     GO TO 92-WRITE-DETAIL-LINES.
073400
073500 921-MOVE-CP-FIELDS.
073600     MOVE SORT-CODE          TO CP-PRT-CODE.
073700     MOVE SORT-TIME-HH       TO CP-T-HH.
073800     MOVE SORT-TIME-MM       TO CP-T-MM.
073900     MOVE SORT-TIME-SS       TO CP-T-SS.
074000     MOVE SORT-PREV-QTY      TO CP-PRT-PREV-QTY.
074100     MOVE SORT-ADJ-QTY       TO CP-PRT-ADJ.
074200     MOVE SORT-ONHAND        TO CP-PRT-NEW-QTY.
074300     IF SORT-PERCT-ADJ = 99999999.9
074400         MOVE "       ***"   TO CP-PRT-PERCT-ADJ-X
074500         MOVE " "            TO CP-PRT-PERCT
074600     ELSE
074700         ADD SORT-PERCT-ADJ  TO TOTAL-PERCT-ADJ
074800         MOVE "%"            TO CP-PRT-PERCT
074900         MOVE SORT-PERCT-ADJ TO CP-PRT-PERCT-ADJ.
           MULTIPLY SORT-ADJ-QTY BY SORT-AVG-COST
               GIVING HOLD-CP-TRAN-VALUE ROUNDED.
           MOVE HOLD-CP-TRAN-VALUE TO CP-TRAN-VALUE.
           ADD HOLD-CP-TRAN-VALUE  TO TOTAL-VALUE.
075000
075100 922-WRITE-CP-HEADERS.
075200     ADD 1 TO PAGE-K.
075300     MOVE PAGE-K TO CP-PRT-PAGE.
075400     WRITE ONLINE-PRT-REC FROM CP-HDR-1 AFTER ADVANCING NEW-PAGE.
075500     WRITE ONLINE-PRT-REC FROM CP-HDR-2 AFTER ADVANCING 2.
075600     WRITE ONLINE-PRT-REC FROM CP-HDR-3 AFTER ADVANCING 1.
075700     MOVE 2 TO LINE-K.
075800
075900 93-WRITE-TOTALS.
076000     ADD 1 TO LINE-K.
076100
076200     MOVE TOTAL-CODES           TO CP-TOT-CODES.
           COMPUTE TOTAL-STRM-VALUE-RND ROUNDED = TOTAL-STRM-VALUE.
           MOVE TOTAL-STRM-VALUE-RND  TO CP-TOT-STRM-VALUE.
076300     MOVE TOTAL-CODES-ADJUSTED  TO CP-TOT-CODES-ADJ.
           MOVE TOTAL-CODES-INVENTORIED TO CP-TOT-CODES-INV.
076400
076500     DIVIDE TOTAL-CODES-ADJUSTED BY TOTAL-CODES
076600         GIVING HOLD-CODES-ADJ-PERCT ROUNDED.
076700     MULTIPLY 100 BY HOLD-CODES-ADJ-PERCT.
076800     MOVE HOLD-CODES-ADJ-PERCT  TO CP-CODES-ADJ-PERCT.
076900
           DIVIDE TOTAL-CODES-ADJUSTED BY TOTAL-CODES-INVENTORIED
               GIVING HOLD-CODES-ADJ-PERCT ROUNDED.
           MULTIPLY 100 BY HOLD-CODES-ADJ-PERCT.
           MOVE HOLD-CODES-ADJ-PERCT  TO CP-CODES-INV-PERCT.

           DIVIDE TOTAL-CODES-INVENTORIED BY TOTAL-CODES
               GIVING HOLD-CODES-ADJ-PERCT ROUNDED.
           MULTIPLY 100 BY HOLD-CODES-ADJ-PERCT.
           MOVE HOLD-CODES-ADJ-PERCT  TO CP-CODES-IVA-PERCT.

077000     DIVIDE TOTAL-PERCT-ADJ BY TOTAL-ADJUSTMENTS
077100         GIVING HOLD-AVG-PERCT-OF-ADJ ROUNDED.
077200     MOVE HOLD-AVG-PERCT-OF-ADJ TO CP-AVG-PERCT-OF-ADJ.

           DIVIDE TOTAL-VALUE BY TOTAL-PREV-VALUE
               GIVING HOLD-CODES-ADJ-PERCT ROUNDED.
           MULTIPLY 100 BY HOLD-CODES-ADJ-PERCT.
           MOVE HOLD-CODES-ADJ-PERCT  TO CP-DOLLR-INV-ADJ.

           DIVIDE TOTAL-VALUE BY TOTAL-STRM-VALUE
               GIVING HOLD-CODES-ADJ-PERCT ROUNDED.
           MULTIPLY 100 BY HOLD-CODES-ADJ-PERCT.
           MOVE HOLD-CODES-ADJ-PERCT  TO CP-DOLLR-ALL-ADJ.
077300
077400     MOVE TOTAL-ADJUSTMENT-UNITS TO CP-ADJ-UNITS.
077500     MOVE TOTAL-ADJ-COST         TO CP-ADJ-COST
077600
077700     MOVE TOTAL-PREV-UNITS       TO CP-PRT-TOT-PREV-QTY.
077800     MOVE TOTAL-ADJUSTMENT-UNITS TO CP-PRT-TOT-ADJ-1.
077900     MOVE TOTAL-NEW-UNITS        TO CP-PRT-TOT-NEW-QTY.
           MOVE TOTAL-VALUE            TO CP-PRT-TOT-VALUE.
078000
078100     WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-0
078200         AFTER ADVANCING 2.
078300     IF LINE-K < 51
078400         WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-1
078500            AFTER ADVANCING 4
078600     ELSE
078700         PERFORM 922-WRITE-CP-HEADERS
078800         WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-1
078900            AFTER ADVANCING NEW-PAGE.
           WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-1B
               AFTER ADVANCING 2.
079000     WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-2A
079100         AFTER ADVANCING 2.
079000     WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-2
079100         AFTER ADVANCING 2.
           WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-3A
               AFTER ADVANCING 2.
079200     WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-3
079300         AFTER ADVANCING 2.
           WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-3B
               AFTER ADVANCING 2.
           WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-3C
               AFTER ADVANCING 2.
           WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-3D
               AFTER ADVANCING 2.
079400     WRITE ONLINE-PRT-REC FROM CP-TOTAL-LINE-4
079500         AFTER ADVANCING 2.
079600
           IF NOT PAPER-IS-132-COLS
080400         MOVE STAND-ESC-SEQ TO ONLINE-PRT-REC.
080500     WRITE ONLINE-PRT-REC BEFORE ADVANCING 0 LINES.
080600
080700     CLOSE ONLINE-PRT.
080800
080900 9-WR-X.
081000     EXIT.
       COPY OVRPFCALL IN COPYLIB.
