000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TRPTROD.
000400 AUTHOR.         KURT MOVSESIAN.
000500 DATE-WRITTEN.   JANUARY 2,1981.
000600*REMARKS.        THIS PROGRAM PRODUCES A REPORT WHICH SHOWS ALL
000700*                STOREROOM ITEM RECEIVING SLIPS THAT HAVE BEEN
000800*                RECEIVED BUT NOT STORED (ON DOCK).
000900*           ON NOV 12, 1981
001000*                1.  ADDED CORP-CODE, QTY ON DOCK, UM,
001100*                    KEYWORD ADJ DESC OF CORP-CODE,
001200*                    AND REPLACED PO-DATE WITH DATE RCVD.
001300*                    ALSO WENT THROUGH AND CLEANED UP LOGIC A
001400*                    LITTLE TO MAKE IT RUN FASTER.
001500*                2. MUST BE PREP WITH MAXDATA=25000.
001600*                      KURT MOVSESIAN
001700*
001800*           ON JULY 2, 1982
001900*                1.  THE BUFFER AREAS - DPOITEM AND
002000*                    DPORECD - WERE CHANGED IN PREP-
002100*                    ARATION FOR THE NEW DATA BASE CHANGES.
002200*                       B.J.P.
002300*           ON APRIL 13, 1983, MPORCV STATUS WAS INCREASED
002400*                 TO FOUR BYTES FOR THE DATABASE CHANGE. LMB.
002500*
002600*           ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
002700*           MAY 14, 1985.  V.W.D.
002800*
002900*           ON JANUARY 8, 1987
003000*                CHANGED PROGRAM TO USE DRPTDEF, COPYLIB,
003100*                WROTE A NEW HEADER PAGE, AND CHANGED LOGIC
003200*                TO INCORPORATE THE NEW DATA SET DRCVITEM.
003300*                       B.J.P.
003400*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  APRIL 15, 1996  CA YODER   REQ. #95-042
      *C     ADDED THE PRIMARY LOCATION FIELD ON THE REPORT.
      *C
      *C  JULY 9, 1996  JEFF BUNGO
      *C     CHANGED FOR YEAR 2000 COMPLIANCE.
      *C
003500 ENVIRONMENT DIVISION.
003600 CONFIGURATION SECTION.
003700 SOURCE-COMPUTER.
003800 OBJECT-COMPUTER.
003900 SPECIAL-NAMES. C01 IS NEWPAGE.
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
004400     SELECT SORT-FILE ASSIGN TO DISK-SORT.
           SELECT DRCVITEM-I
                  ASSIGN TO DATABASE-MCFLCS1201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV-I
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

004500
004600 DATA DIVISION.
004700 FILE SECTION.
004800 FD  PRINT-FILE
004900     LABEL RECORDS ARE OMITTED
005000     RECORD CONTAINS 132 CHARACTERS
005100     DATA RECORD IS PRT-REC.
005200 01  PRT-REC              PIC X(132).
005300
005400 SD  SORT-FILE
005500     RECORD CONTAINS 52 CHARACTERS
005600     DATA RECORD IS SORT-REC.
005700 01  SORT-REC.
005800     05  PO-NUMBER-SORT.
005900         10  PONUM-SORT        PIC X(7).
006000         10  BLANKET-SORT      PIC X(3).
006100         10  RECEIVER-SORT     PIC X(3).
006200     05  ITEM-SORT             PIC X(4).
006300     05  CORP-CODE-SORT        PIC X(7).
006400     05  QTY-ON-DOCK-SORT      PIC 9(8)V9(4).
006500     05  ITM-UM-SORT           PIC XX.
006600     05  PORECDATE-SORT-CN.
               10  PORECDATE-SORT-CC PIC X(2).
               10  PORECDATE-SORT    PIC X(6).
006700     05  SEQ-NUM               PIC X(6).
006800
       FD  DRCVITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DRCVITEM-REC-I.
           COPY DDS-MCRPCS1200  OF MCFLCS1201.

       FD  MPORCV-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0101.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0201.

006900 WORKING-STORAGE SECTION.
007000
007100 COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.
007300 COPY ESCNAM2 IN COPYLIB.
007400
007500 COPY DATAB IN COPYLIB.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
007600
007700 COPY DRCVITEM IN COPYLIB.
007800
007900 COPY MPORCV IN COPYLIB.
008000
       COPY MSTORERM IN COPYLIB.

       01  HD-RET-CODE   PIC S9(4) COMP VALUE 0.
       01  HD-FILE-NAME  PIC X(17) VALUE SPACES.
       01  FNUM          PIC S9(4) COMP VALUE 0.
008200
008300
008400 77  ALL-RECORDS-WRITTEN-SW       PIC X VALUE "N".
008500 77  REC-N-STOR-RPT-SW            PIC X VALUE "N".
008600 77  LINE-K                       PIC 9(4) VALUE 0.
008700 77  QTY-LEFT-ON-DOCK             PIC S9(8)V9(4) VALUE ZEROS.
008800 77  ALL-ITEMS                    PIC XX  VALUE "@;".
       77  END-OF-INPUT-FLAG            PIC X(1).
008900
9406CK 01  SCOPE   PIC X.

009000 01  PO-ARG                       PIC X(14) VALUE SPACES.
009100
009200 01  CODE-ARG                     PIC X(8)  VALUE SPACES.
009300
009400 COPY CDESC IN COPYLIB.
009500
009600 01  HOLD-QTY-RECD.
009700     05  SAVE-QTY-RECD            PIC 9(8)V9(4).
009800     05  SAVE-QTY-RECD-R  REDEFINES SAVE-QTY-RECD.
009900         10  SAVE-QTY-FIRST-2-DEC  PIC 9(8)V9(2).
010000         10  SAVE-3-4-DEC          PIC 99.
010100
010200 01 DSET-NAMES.
010300     05  DSET-DRCVITEM    PIC X(16)  VALUE "DRCVITEM;".
010400     05  DSET-MPORCV      PIC X(16)  VALUE "MPORCV; ".
010500
010600 01  HEADING-1-H.
010700     05  FILLER   PIC X(8)  VALUE "TRPTROD ".
010800     05  FILLER   PIC X(27) VALUE SPACES.
010900     05  FILLER   PIC X(20) VALUE "STOREROOM ITEMS RECE".
011000     05  FILLER   PIC X(19) VALUE "IVED (ON DOCK) BUT ".
011100     05  FILLER   PIC X(14) VALUE "NOT STORED    ".
011200     05  FILLER   PIC X(20) VALUE "              DATE  ".
011300     05  DATE-3-H PIC X(8).
011400     05  FILLER   PIC XX    VALUE SPACES.
011500     05  TIME-3-H            PIC X(8).
011600     05  FILLER   PIC X(6)  VALUE SPACES.
011700
011800 01  HEADING-2-H.
011900     05  FILLER   PIC X(16) VALUE "  RECEIVING SLIP".
012000     05  FILLER   PIC X(26) VALUE "   ITEM  SEQ NO  CORP CODE".
           05  FILLER   PIC X(15) VALUE "  PRIMARY LOC  ".
012100     05  FILLER   PIC X(16) VALUE "QUANTITY ON DOCK".
012200     05  FILLER   PIC X(15) VALUE "  UM  DATE RCVD".
012300     05  FILLER   PIC X(13) VALUE "  DESCRIPTION".
012400     05  FILLER   PIC X(31) VALUE SPACES.
012500
012600 01  DETAIL-LINE.
012700     05  FILLER             PIC X(2)  VALUE SPACES.
012800     05  PO-NUM-L2.
012900         10  PONUM-7-L2     PIC X(7).
013000         10  FIL-1-L2       PIC X.
013100         10  BLANKET-L2     PIC X(3).
013200         10  FIL-2-L2       PIC X.
013300         10  RECEIVER-L2    PIC X(3).
013400     05  FILLER             PIC X(2)  VALUE SPACES.
013500     05  ITEM-L2            PIC X(4).
013600     05  FILLER             PIC X(2)  VALUE SPACES.
013700     05  SEQ-OUT            PIC X(6).
013800     05  FILLER             PIC X(2)  VALUE SPACES.
013900     05  CORP-CODE-OUT      PIC X(7).
           05  FILLER             PIC X(4)  VALUE SPACES.
           05  PRIMARY-LOC-OUT    PIC X(12).
014000     05  FILLER             PIC X(4)  VALUE SPACES.
014100     05  QTY-RECD-OUT       PIC Z(7)9.9(4).
014200     05  QTY-RECD-OUT-R  REDEFINES  QTY-RECD-OUT.
014300         10  QTY-FIRST-2-DEC-OUT  PIC Z(7)9.99.
014400         10  LAST-TWO-DEC         PIC XX.
014500     05  FILLER             PIC X(2)  VALUE SPACES.
014600     05  UM-OUT             PIC XX.
014700     05  FILLER             PIC X(2)  VALUE SPACES.
014800     05  PO-DATE-OUT        PIC X(8)  VALUE SPACES.
014900     05  FILLER             PIC X(3)  VALUE SPACES.
015000     05  DESC-OUT           PIC X(42).
015100
015200
015300*-------------- ESCAPE SEQUENCES
015400
015500 01  COMPRESS-PRINT             PIC X(8).
015600
015700 01  NORMAL-PRINT               PIC X(8).
015800
016100 COPY TBLOWUP IN COPYLIB.
016200
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC                PIC X(161).
016300
016400 PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-REC.
016500 BEGIN-SORT SECTION.
016600 BEGIN-PROC.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           MOVE "N" TO ALL-RECORDS-WRITTEN-SW, REC-N-STOR-RPT-SW.
           MOVE 0 TO LINE-K, QTY-LEFT-ON-DOCK.
           OPEN INPUT DRCVITEM-I, MPORCV-I, MSTORERM-I.
016700     SORT SORT-FILE ASCENDING KEY PORECDATE-SORT-CN SEQ-NUM
016800          INPUT PROCEDURE 8-INPUT-RECORDS
016900          OUTPUT PROCEDURE 9-OUTPUT-RECORDS.
           CLOSE DRCVITEM-I, MPORCV-I, MSTORERM-I.
017000     GOBACK.
017100
017200*************************************************************
017300*                    BLOWUP   ROUTINE                       *
017400*************************************************************
017500 2-BLOWUP.
017700     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
017800     MOVE PO-ARG TO BU-DISPLAY-FLD (1).
017900     MOVE "TRPTROD"               TO BU-PGM-NAME.
018000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
018100           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
018200               BU-DISPLAY-AREA.
018300
018400
018500 8-INPUT-RECORDS SECTION.
018600     PERFORM 81-HOUSEKEEPING THRU 81-H-EXIT.
018700     PERFORM 82-GET-PARAMETERS THRU 82-G-P-EXIT.
           MOVE SPACES TO PORCVNO OF DRCVITEM-REC-I.
           START DRCVITEM-I KEY >= PORCVNO OF DRCVITEM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE "START DRCVITEM ERR 8-IR" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.
           MOVE "N" TO END-OF-INPUT-FLAG.
018800     PERFORM 83-GET-RECEIVER-ITEMS THRU 83-GRI-EXIT
018900         UNTIL END-OF-INPUT-FLAG = "Y".
019000     GO TO 8-IR-EXIT.
019100
019200 81-HOUSEKEEPING.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
019300     OPEN OUTPUT PRINT-FILE.
019400
019500     MOVE  1                      TO DATE-MODE.
019600     CALL "TDATECHK" USING DATE-CHECK-AREA.
019700     MOVE DATE-SLASH-OUT          TO DATE-3-H.
019800     MOVE DATE-FORMATTED-TIME-OUT TO TIME-3-H.
019900
020500 81-H-EXIT.
020600     EXIT.
020700
020800*************************************************************
020900*************************************************************
021000*   ACCEPT TWO LINES OF DATA: 1) ALL HEADER INFORMATION -   *
021100*     WHO AND WHERE THIS REPORT WILL BE ROUTED TO  2) IF    *
021200*     THE REPORT IS TO BE SORTED BY THE HP OR IBM CODE.     *
021300*                                                           *
021400*************************************************************
021500*************************************************************
021600
021700 82-GET-PARAMETERS.
021900     DISPLAY HD-ROUTE-DATA.
022000
022300     MOVE "DHDR23.PUB"   TO HD-FILE-NAME.
022400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
022500         HD-ROUTE-DATA, ESC-NAME.
022600     IF HD-RET-CODE NOT = 0
022700         MOVE "THDPRT2 ERROR * HPIBM" TO BU-DISPLAY-MSG
022800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
022900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
023000         PERFORM 2-BLOWUP.
023100
023200     CALL "TESCSEQ" USING ESC-NAME.
023300     MOVE CHAR-1636PI             TO COMPRESS-PRINT.
023400     MOVE CHAR-10PI               TO NORMAL-PRINT.
023600
023700 82-G-P-EXIT.
023800     EXIT.
023900
024000 83-GET-RECEIVER-ITEMS.
024100*    CALL "DBGET" USING BASE DSET-DRCVITEM MODE2 STATUS-AREA
024200*        ALL-ITEMS BUF-DRCVITEM PO-ARG.
           READ DRCVITEM-I NEXT INTO BUF-DRCVITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
024300     IF FILE-STATUS NOT = "00"
024400         IF FILE-STATUS-1 = "1"
                   MOVE "Y" TO END-OF-INPUT-FLAG
024500             GO TO 83-GRI-EXIT
024600         ELSE
024700             MOVE "DBGET DRCVITEM *83-GRI" TO BU-DISPLAY-MSG
024800             PERFORM 2-BLOWUP.
024900
025000     IF RCV-CORP-CODE = "NON-STR"
025100         GO TO 83-GRI-EXIT
025200     ELSE
025300     IF RCV-QTY-DLVR > RCV-QTY-STORED
025400         SUBTRACT RCV-QTY-STORED FROM RCV-QTY-DLVR
025500             GIVING QTY-LEFT-ON-DOCK
025600         PERFORM 831-RELEASE-SORT THRU 831-RS-EXIT.
025700
025800 83-GRI-EXIT.
025900     EXIT.
026000
026100 831-RELEASE-SORT.
026200     MOVE RCV-PO-RCV-NO           TO PO-ARG.
026300     PERFORM 832-GET-SEQ  THRU  832-EXIT.
026400     MOVE M-PO-RCV-SEQ            TO SEQ-NUM.
026500     MOVE RCV-DATE-RCVD-CN        TO PORECDATE-SORT-CN.
026600     MOVE RCV-PO-NO               TO PONUM-SORT.
026700     MOVE RCV-PO-REL              TO BLANKET-SORT.
026800     MOVE RCV-ITEM-NUMBER         TO ITEM-SORT.
026900     MOVE RCV-CORP-CODE           TO CORP-CODE-SORT.
027000     MOVE QTY-LEFT-ON-DOCK        TO QTY-ON-DOCK-SORT.
027100     MOVE RCV-PO-RCVR             TO RECEIVER-SORT.
027200     MOVE RCV-ITEM-UM             TO ITM-UM-SORT.
027300     MOVE "Y"                     TO REC-N-STOR-RPT-SW.
027400     RELEASE SORT-REC.
027500
027600 831-RS-EXIT.
027700     EXIT.
027800
027900 832-GET-SEQ.
028000*    CALL "DBGET" USING BASE DSET-MPORCV MODE7 STATUS-AREA
028100*        ALL-ITEMS BUF-MPORCV PO-ARG.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-I.
           READ MPORCV-I INTO BUF-MPORCV
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS-1 = "2"
               MOVE "000000" TO M-PO-RCV-SEQ
           ELSE
028200     IF FILE-STATUS NOT = "00"
028300        MOVE "DBGET MPORCV *832-GS" TO BU-DISPLAY-MSG
028400        PERFORM 2-BLOWUP.
028500
028600 832-EXIT.
028700     EXIT.
028800
028900 8-IR-EXIT.
029000     EXIT.
029100
029200 9-OUTPUT-RECORDS SECTION.
       9-OUTPUT-RECORDS-PARA.
029300     IF PAPER-IS-132-COLS
029400         NEXT SENTENCE
029500     ELSE
029600     WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
029800
029900     PERFORM 97-HEADINGS.
030000     PERFORM 96-MAIN THRU 96-M-EXIT UNTIL
030100             ALL-RECORDS-WRITTEN-SW = "Y".
030200     PERFORM 98-CHECK-ALL-REPORTS THRU 98-CAR-EXIT.
029300     IF PAPER-IS-132-COLS
029400         NEXT SENTENCE
029500     ELSE
029600     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
030300     PERFORM 92-EOJ THRU 92-EOJ-EXIT.
030400     GO TO 9-OR-EXIT.
030500
030600 92-EOJ.
030700     CLOSE PRINT-FILE.
031200
031300 92-EOJ-EXIT.
031400     EXIT.
031500
031600 96-MAIN.
031700     RETURN SORT-FILE AT END
031800         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
031900         GO TO 96-M-EXIT.
032000     MOVE "-"                     TO FIL-1-L2 FIL-2-L2.
032100     MOVE PONUM-SORT              TO PONUM-7-L2.
032200     MOVE BLANKET-SORT            TO BLANKET-L2.
032300     MOVE RECEIVER-SORT           TO RECEIVER-L2.
032400     MOVE ITEM-SORT               TO ITEM-L2.
032500     MOVE SEQ-NUM                 TO SEQ-OUT.
032600     MOVE CORP-CODE-SORT          TO CORP-CODE-OUT.
032700     MOVE QTY-ON-DOCK-SORT        TO HOLD-QTY-RECD.
032800     IF SAVE-3-4-DEC  =  ZEROS
032900         MOVE SAVE-QTY-FIRST-2-DEC TO QTY-FIRST-2-DEC-OUT
033000         MOVE SPACES              TO LAST-TWO-DEC
033100     ELSE
033200         MOVE SAVE-QTY-RECD       TO QTY-RECD-OUT.
033300     MOVE ITM-UM-SORT             TO UM-OUT.
033400     MOVE 4                       TO DATE-MODE.
033500     MOVE PORECDATE-SORT          TO  DATE-VALIDATE-IN.
033600     CALL "TDATECHK" USING DATE-CHECK-AREA.
033700     MOVE DATE-SLASH-OUT          TO  PO-DATE-OUT.
033800
033900     MOVE CORP-CODE-SORT          TO  CODE-ARG.
034000     MOVE "K"                     TO  CDESC-DESC-OPTION.
034100     CALL "CDESC" USING CDESC-RET-CODE,
034200                        BASE,
034300                        STATUS-AREA,
034400                        BU-DISPLAY-MSG,
034500                        CODE-ARG,
034600                        CDESC-DATA.
034700     IF BU-DISPLAY-MSG-1  NOT = SPACES
034800         MOVE CODE-ARG            TO  BU-DISPLAY-FLD (2)
034900         GO TO 2-BLOWUP
035000     ELSE
035100         MOVE CDESC (1)           TO DESC-OUT.
035200
      *-------- FIND PRIMARY LOCATION FROM MSTORERM.  IF THE CODE
      *-------- CANNOT BE FOUND, JUST MOVE SPACES TO THE REPORT.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES              TO PRIMARY-LOC-OUT
           ELSE
               MOVE STR-LOC (1)         TO PRIMARY-LOC-OUT.

035300     WRITE PRT-REC FROM DETAIL-LINE AFTER
035400         ADVANCING 1 LINES.
035500     ADD 1                        TO LINE-K.
035600     IF LINE-K > 58
035700         PERFORM 97-HEADINGS THRU 97-H-EXIT.
035800
035900 96-M-EXIT.
036000     EXIT.
036100
036200 97-HEADINGS.
036300     MOVE 0 TO LINE-K.
036400     WRITE PRT-REC FROM HEADING-1-H AFTER ADVANCING NEWPAGE.
036500     WRITE PRT-REC FROM HEADING-2-H AFTER
036600           ADVANCING 3 LINES.
036700     ADD 5 TO LINE-K.
036800
036900 97-H-EXIT.
037000     EXIT.
037100
037200 98-CHECK-ALL-REPORTS.
037300     IF REC-N-STOR-RPT-SW = "N"
037400         MOVE SPACES TO PRT-REC
037500         MOVE "THERE ARE CURRENTLY NO STOREROOM ITEMS ON THE DOCK"
037600                      TO PRT-REC
037700         WRITE PRT-REC AFTER ADVANCING 3 LINES.
037800
037900 98-CAR-EXIT.
038000     EXIT.
038100
038200 9-OR-EXIT.
038300     EXIT.

       COPY OVRPFCALL IN COPYLIB.
