001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TRPTOR.
001300 AUTHOR.         N W REGIMBAL.
001400 INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500 DATE-WRITTEN.   DEC 05, 1980.
001600*REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
001700*                CORP-CODES AND ITEM STATUS PER CODE.
001800*
001900*                ON JULY 13, 1982, THE BUFFER AREA MSTORERM
002000*                WAS CHANGED IN PREPARATION FOR THE NEW DATA
002100*                BASE CHANGES. B.J.P.
002200*
002300*         ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
002400*         MAY 21, 1985.     V.W.D.
002500*
002600*                ON NOVEMBER 25, 1986 - EXPANDED THE SIZE OF THE
002700*                AVERAGE COST FIELD FROM S9(6)V9(4) TO S9(11)V9(4).
002800*                ALSO ADDED COPYLIB AND EXPANDED OTHER COST/PRICE
002900*                FIELDS.           D.A. PLUM.
003000*
003010*                ON JANUARY 29, 1987 - ADDED REPORT TO XRSCREEN AND
003020*                ADDED NON-HP LOGIC AND ALSO REPLACED DBEXPLAIN WITH
003030*                TBLOWUP CALLS.
003040*                                  A. M. KRAUSS.
003050*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 03, 1996   CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  07/31/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C

003100 ENVIRONMENT DIVISION.
003200 CONFIGURATION SECTION.
003300 SOURCE-COMPUTER.    HP-3000.
003400 OBJECT-COMPUTER.    HP-3000.
003500 SPECIAL-NAMES. C01 IS NEW-PAGE.
003700
003800 INPUT-OUTPUT SECTION.
003900 FILE-CONTROL.
004000     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
004100     SELECT SORT-FILE ASSIGN  TO DISK-SORT.
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
004200
004300 DATA DIVISION.
004400 FILE SECTION.
004500 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
004600     LABEL RECORD IS OMITTED
004700     DATA RECORD IS PRT-REC.
004800 01  PRT-REC                 PIC X(132).
004900
       COPY MTLSSORT IN COPYLIB.

005000*SD  SORT-FILE RECORD CONTAINS 33 CHARACTERS
005100*    DATA RECORD IS SORT-REC.
005200*01  SORT-REC.
005300*     05  SRT-CORP-CODE      PIC X(8).
005400*     05  SRT-UM             PIC X(2).
005500*     05  SRT-ONHAND         PIC S9(8).
005600*     05  SRT-AVG-COST       PIC S9(11)V9(4).
005700
       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

005800 WORKING-STORAGE SECTION.
005900
006000 77  NO-ARG                  PIC X(1)  VALUE SPACES.
006100 77  LINE-K                  PIC 9(2)  VALUE 60 COMP-4.
006200 77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
006300 77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
006400 77  GRAND-TOTAL             PIC S9(14)V9(4) VALUE +0.
006500 77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
006600 77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
006700 77  CODE-ARG                PIC X(8)  VALUE SPACES.
       77  SUB                     PIC 9(3)  VALUE 0.
       77  RET-CODE                PIC X(2)  VALUE SPACES.
006800
9406CK 01  SCOPE   PIC X.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
006900 01  MESSAGE-AREA.
007000     05  NO-SORTED-RECORDS   PIC X(31) VALUE
007100                             "ZERO CODES QUALIFIED FOR REPORT".
007200
007300 01  SWITCH-AREA.
007400     05  END-OF-INPUT-FILE               PIC X VALUE "N".
007500         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
007600     05  END-OF-SORT-FILE                PIC X VALUE "N".
007700         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
007800
007900 COPY TBLOWUP IN COPYLIB.
008100 COPY THDPRTA IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.

       COPY CDESC IN COPYLIB.

       COPY TCHKBLKT IN COPYLIB.
008400
008410*-------------- ESCAPE SEQUENCES
008420 COPY ESCNAM2 IN COPYLIB.
008430
008440 01  COMPRESS-PRINT             PIC X(8).
008450
008460 01  NORMAL-PRINT               PIC X(8).
008470
009100
009200 COPY TDATECHK IN COPYLIB.
009300
009400 COPY DATAB IN COPYLIB.
009500
009600 01  DSET-NAMES.
009700     05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
009800     05  DSET-DDESC          PIC X(6)  VALUE "DDESC;".
009900
010000 COPY MSTORERM IN COPYLIB.
010100
010200 COPY DDESC IN COPYLIB.

       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.
010300
010400*01  HDR-1.
010500*    05  FILLER      PIC X(10) VALUE "  TRPTOR  ".
010600*    05  FILLER      PIC X(25) VALUE SPACES.
010700*    05  FILLER      PIC X(20) VALUE "C O R P O R A T E   ".
010800*    05  FILLER      PIC X(19) VALUE "C O D E   I T E M S".
010900*    05  FILLER      PIC X(28) VALUE SPACES.
011000*    05  PRT-DATE    PIC X(8)  VALUE SPACE.
011100*    05  FILLER      PIC X(4)  VALUE SPACES.
011200*    05  PRT-TIME    PIC X(8)  VALUE SPACE.
011300*
011400*01  HDR-2.
011500*    05  FILLER      PIC X(7)  VALUE "  PAGE ".
011600*    05  PRT-PAGE    PIC 999   VALUE ZEROS.
011700*    05  FILLER      PIC X(25) VALUE SPACES.
011800*    05  FILLER      PIC X(16) VALUE "O U T S I D E   ".
011900*    05  FILLER      PIC X(23) VALUE "R E P A I R   C L A S S".
012000*    05  FILLER      PIC X(30) VALUE SPACES.
012100*    05  FILLER      PIC X(12) VALUE "DATE        ".
012200*    05  FILLER      PIC X(4)  VALUE "TIME".
012300*    05  FILLER      PIC X(7)  VALUE SPACES.
012400
012500 01  HDR-3.
012600     05  FILLER      PIC X(9)  VALUE "CORPCODE ".
012700     05  FILLER      PIC X(13) VALUE " DESCRIPTION ".
012800     05  FILLER      PIC X(62) VALUE SPACES.
012900     05  FILLER      PIC X(10) VALUE "ONHAND  UM".
013000     05  FILLER      PIC X(9)  VALUE SPACES.
013100     05  PRT-COST-LIT  PIC X(8).
013200     05  FILLER      PIC X(9)  VALUE SPACES.
013300     05  FILLER      PIC X(12) VALUE "  TOTAL COST".
013400
013500 01  PRT-ITEM-DATA.
013600     05  PRT-CODE      PIC X(7)  VALUE SPACES.
013700     05  FILLER        PIC X(3)  VALUE SPACES.
013800     05  PRT-DESC      PIC X(69) VALUE SPACES.
013900     05  FILLER        PIC X(3)  VALUE SPACES.
014000     05  PRT-ONHAND    PIC Z(7)9 VALUE ZEROS.
014100     05  FILLER        PIC X(2)  VALUE SPACES.
014200     05  PRT-UM        PIC X(2)  VALUE SPACES.
014300     05  FILLER        PIC X(1)  VALUE SPACES.
014400     05  PRT-AVG-COST  PIC Z(10)9.9(4) VALUE ZEROS.
014500     05  FILLER        PIC X(3)  VALUE SPACES.
014600     05  PRT-TOTAL     PIC Z(12)9.9(4) VALUE ZEROS.
014700
       01  PRT-ITEM-DESC.
           05  FILLER        PIC X(8)  VALUE SPACES.
           05  PRT-DESC-2    PIC X(80) VALUE SPACES.

014800 01  GRAND-TOTAL-LINE.
014900     05  FILLER        PIC X(58) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS  PIC Z(4)9 VALUE ZEROS.
           05  FILLER        PIC X(3)  VALUE SPACES.
015000     05  FILLER        PIC X(19) VALUE "GRAND TOTAL OF ALL ".
015100     05  FILLER        PIC X(15) VALUE "OUTSIDE REPAIR ".
015200     05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROS.
015300
      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
      *01  OPTION-REC   PIC X(161).
015400*PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-REC.
       PROCEDURE DIVISION.
015500 BEGIN-SORT SECTION.
015600 1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

           MOVE 60 TO LINE-K.
           MOVE ZERO TO PAGE-K, TOTAL-COST, GRAND-TOTAL.
           OPEN INPUT DDESC-I, MSTORERM-I, DMANPART-I.
           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "TRPTINS "         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
015800     ELSE
015900     IF MTLS-COST-OPT = "R"
016000         MOVE "REP COST"     TO PRT-COST-LIT.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
016200
016212     DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
016227     OPEN OUTPUT PRINT-FILE.
016228
016231     MOVE "DHDR96.PUB"   TO HD-FILE-NAME.
016232     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
016233         HD-ROUTE-DATA, ESC-NAME.
016234     IF HD-RET-CODE NOT = 0
016235         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
016236         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
016237         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
016238         GO TO 2-BLOWUP.
016239
           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.
016240
016241     CALL "TESCSEQ" USING ESC-NAME.
016251     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
016261     MOVE CHAR-10PI       TO NORMAL-PRINT.
016272
           COPY MTLSPROC IN COPYLIB.

017000*    SORT SORT-FILE
017100*         ON ASCENDING KEY SRT-CORP-CODE
017200*         INPUT  PROCEDURE IS 8-INPUT-RECORDS
017300*         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.
017400
017500 2-EOJ.
019200     CLOSE PRINT-FILE.
           CLOSE MSTORERM-I, DDESC-I.
019400     GOBACK.
019500
019510*************************************************************
019511*                    BLOWUP   ROUTINE                       *
019512*************************************************************
019513 2-BLOWUP.
019515     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
019516
019517     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
019518           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
019519           BU-DISPLAY-AREA.
019520
019600 7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *    MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *       INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "START ERROR MSTORERM 8-IR" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
019700*    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
019800*            ALL-INPUT-RECORDS-PROCESSED.
019900*    GO TO 8-IR-EXIT.
020000*
020100*81-PROCESS-INPUT-RECORDS.
020200*    CALL "DBGET" USING BASE DSET-MSTORERM MODE2 STATUS-AREA,
020300*                   ALL-ITEM-LIST BUF-MSTORERM NO-ARG.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
020400*    IF FILE-STATUS-1 = "1"
020500*        MOVE "Y" TO END-OF-INPUT-FILE
020600*        GO TO 81-PIR-EXIT
020700*    ELSE
020800*        IF FILE-STATUS NOT = "00"
020900*            MOVE "DBGET ERROR PARA 81-PIR    " TO BU-DISPLAY-MSG
021200*            GO TO 2-BLOWUP.
021300*
021400*    MOVE SPACES          TO SORT-REC.
021500*    IF STR-OUT-REP = "X"
021600*        MOVE CORP-CODE     TO SRT-CORP-CODE
021700*        MOVE STR-AVG-COST  TO SRT-AVG-COST
021800*        MOVE STR-UM        TO SRT-UM
021900*        MOVE STR-ONHAND    TO SRT-ONHAND
022000*        RELEASE SORT-REC.
022100*
022200*81-PIR-EXIT.
022300*    EXIT.
022400
022500 7-IR-EXIT.
022600     EXIT.
022700
022800 8-WRITE-RECORDS SECTION.
022810     IF PAPER-IS-132-COLS
022820         NEXT SENTENCE
022830     ELSE
022840         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
022850
022900     RETURN SORT-FILE AT END
023000         MOVE "Y" TO END-OF-SORT-FILE
023100         MOVE  1  TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
023200*        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
023300*        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
023400         WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
023500         MOVE NO-SORTED-RECORDS TO PRT-REC
023600         WRITE PRT-REC AFTER ADVANCING 2 LINES
023700         GO TO 2-EOJ.
023800
           PERFORM 9-MOVE-CONTROL-BREAK.

023900     PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
024000             UNTIL ALL-SORTED-RECORDS-PROCESSED.
024100
      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               MOVE CODES-RELEASED TO PRT-GRD-ITMS
024200         MOVE GRAND-TOTAL TO PRT-GRD-TOTAL
               PERFORM 9-CHECK-HEADINGS
024300         WRITE PRT-REC FROM GRAND-TOTAL-LINE
024400             AFTER ADVANCING 2 LINES.
024500     GO TO 8-WR-EXIT.
024600
024700 82-PROCESS-SORTED-RECORDS.
           PERFORM 9-CHECK-HEADINGS.
025800
025900     MOVE SPACES        TO PRT-REC, PRT-ITEM-DATA.
026000     MOVE  SRT-CORP-CODE     TO  CODE-ARG.
           MOVE SRT-KEYWD-MOD      TO  PRT-DESC.
026100
026200*    CALL "DBFIND" USING BASE, DSET-DDESC, MODE1, STATUS-AREA,
026300*            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
026500*        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
026600*        GO TO 92-CONT.
026700*
026800*    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
026900*            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
027000*    IF COND-WORD = 0
027100*        MOVE DESC-DATA      TO  PRT-DESC
027200*    ELSE
027300*        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.
027400
027500 82-CONT.
027600     COMPUTE TOTAL-COST = SRT-ONHAND * SRT-COST.
027700     ADD TOTAL-COST TO GRAND-TOTAL.
027800     MOVE SRT-CORP-CODE TO PRT-CODE.
027900     MOVE SRT-ONHAND TO PRT-ONHAND.
028000     MOVE SRT-UM TO PRT-UM.
028100     MOVE SRT-COST TO PRT-AVG-COST.
028200     MOVE TOTAL-COST TO PRT-TOTAL.
028300
028400     ADD 1 TO LINE-K.
028500     WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 1 LINES.

      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.
028600
      *---------- PRINT COMPLETE DESCRIPTION IF REQUESTED.
           IF MTLS-DESC-OPT = "X"
               MOVE 2 TO SUB
               MOVE SRT-CORP-CODE  TO  CODE-ARG
               CALL "CDESC" USING  RET-CODE,
                                   BASE,
                                   STATUS-AREA,
                                   BU-DISPLAY-MSG,
                                   CODE-ARG,
                                   CDESC-DATA
               IF BU-DISPLAY-MSG-1  NOT = SPACES
                   MOVE CODE-ARG    TO  BU-DISPLAY-FLD (2)
                   GO TO 2-BLOWUP
               END-IF
               PERFORM UNTIL SUB > CDESC-LINES-GOT
                   MOVE CDESC (SUB)   TO  PRT-DESC-2
                   ADD 1              TO  LINE-K
                   WRITE PRT-REC FROM PRT-ITEM-DESC
                                               AFTER ADVANCING 1 LINE
                   PERFORM 9-CHECK-HEADINGS
                   ADD 1              TO  SUB
               END-PERFORM
               MOVE SPACES TO PRT-REC
               ADD 1              TO  LINE-K
               WRITE PRT-REC AFTER ADVANCING 1 LINE.

028700     RETURN SORT-FILE AT END
028800         MOVE "Y" TO END-OF-SORT-FILE.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   WRITE PRT-REC             AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       MOVE 60            TO  LINE-K
                       PERFORM 9-CHECK-HEADINGS.
028900
029000 82-PSR-EXIT.
029100     EXIT.
029200
029300 8-WR-EXIT.
029400     EXIT.

       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

       9-CHECK-HEADINGS.
           IF LINE-K > 59
               ADD     1      TO PAGE-K
               MOVE    1      TO LINE-K
               MOVE PAGE-K    TO PRT-PAGE
               ADD     5      TO LINE-K
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
               IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
                 MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
                 WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
                 ADD   1      TO LINE-K
               END-IF
      *        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
      *        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
               MOVE SPACES TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1 LINES.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
