       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TRPTNOHPOS.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM WILL REPORT ALL PURCHASE ORDERS THAT      **
      ** SHOULD BE MOVING TO HISTORY BUT ARE NOT.               **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DINVRCD
                  ASSIGN TO DATABASE-MCFLCS2502
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DREQD
               ASSIGN TO DATABASE-MCFLCS2102
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DINVRCD
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS2502.

       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DREQD
           LABEL RECORDS ARE STANDARD.
       01  DREQD-REC.
           COPY DDS-MCRPCS2100  OF MCFLCS2102.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                     PIC X(132).

       SD  SORT-FILE RECORD CONTAINS 120 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-PO.
               10  FILLER             PIC X.
               10  SORT-PO-13         PIC X(13).
           05  SORT-PO-DATE           PIC X(6).
           05  SORT-LAST-PAYMENT      PIC X(4).
           05  SORT-EXPECT-DATE       PIC X(6).
           05  SORT-ITM-NUMBER        PIC X(4).
           05  SORT-ORDERED           PIC 9(8)V9(4).
           05  SORT-DELIVERED         PIC 9(8)V9(4).
           05  SORT-STORED            PIC 9(8)V9(4).
           05  SORT-PAID              PIC 9(8)V9(4).
           05  SORT-REQ-NUMBER        PIC X(12).
           05  SORT-FLAGS             PIC X(6).
           05  SORT-WO                PIC X(10).
           05  SORT-INVLIT            PIC X(6).
           05  FILLER                 PIC X(4).

       WORKING-STORAGE SECTION.
       77  ITM-CHECK-SW                  PIC 9.
       77  LINE-CTR                      PIC 99.
       77  OPEN-INV-RECS-CTR             PIC 9(5).
       77  OPEN-ITM-RECS-CTR             PIC 9(5).
       77  OPEN-WOS-RECS-CTR             PIC 9(5).
       77  PO-DELETE-MONTHS              PIC 99.
       77  PO-RECS-CTR                   PIC 9(5).
       77  SAVE-PO                       PIC X(14).

013100 01  BUILD-PO-LAST-PAYMENT.
013200     05  BUILD-PO-LAST-PAY-YYMM PIC X(4)  VALUE SPACES.
013300     05  BUILD-PO-LAST-PAY-DD   PIC 9(2)  VALUE ZEROS.

019800 01  DATES-AND-TIMES.
019900     05  TODAYS-DATE.
020000         10  YY               PIC 99.
020100         10  MM               PIC 99.
020200         10  DD               PIC 99.
020300
020400     05  DELETE-DATE.
020500         10  DELETE-DATE-YY   PIC 99.
020600         10  DELETE-DATE-MM   PIC 99.
020700         10  DELETE-DATE-DD   PIC 99.
020800
       01  DETAIL-LINE.
           05  D-PO                      PIC X(14) VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-PO-DATE                 PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACES.
           05  D-LAST-PAYMENT            PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-EXPECT-DATE             PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-ITM-NUMBER              PIC X(4)  VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-ORDERED                 PIC Z(5)9.9(4).
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-DELIVERED               PIC Z(5)9.9(4).
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-STORED                  PIC Z(5)9.9(4).
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-PAID                    PIC Z(5)9.9(4).
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-REQ-NUMBER              PIC X(12) VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-FLAGS                   PIC X(6)  VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-WO                      PIC X(10) VALUE SPACES.
           05  FILLER                    PIC X     VALUE SPACE.
           05  D-RCVLIT                  PIC X(6)  VALUE SPACES.

       01  DETAIL-LINE-2.
           05  D2-LIT                    PIC X(30) VALUE SPACES.
           05  D2-CTR                    PIC Z(5).
           05  FILLER                    PIC X(97) VALUE SPACES.

       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

012800 01  PO-COMPLETE-SW             PIC X     VALUE SPACES.
012900     88  PO-COMPLETE                      VALUE "Y".
013000
      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY TBLOWUP  IN COPYLIB.
       COPY TDATECHK IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT IN COPYLIB.
       COPY DBSTAT   IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.
       01  PO-ARG                        PIC X(14).
       COPY DBPOARG1 IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       COPY DINVRCD  IN COPYLIB.
       COPY DPOITEM  IN COPYLIB.
       COPY DPORECD  IN COPYLIB.
       COPY DREQD    IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       PROCEDURE DIVISION.
       START-PGM SECTION.
           OPEN INPUT  DINVRCD.
           OPEN INPUT  DPORECD.
           OPEN INPUT  DPOITEM.
           OPEN INPUT  DREQD.
           OPEN INPUT  MPLTINFO.
           MOVE "MCPRT" TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE "PODL"       TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
026800         GO TO 2100-BLOWUP
026900     ELSE
027000     MOVE MPLTINFO-PO-DEL-MTH   TO  PO-DELETE-MONTHS.
027200
           MOVE "P 01"       TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
026800         GO TO 2100-BLOWUP.
027700     MOVE 1            TO  DATE-MODE.
027800     CALL "TDATECHK" USING DATE-CHECK-AREA.
027900     MOVE DATE-YMD-OUT    TO  TODAYS-DATE.
028000     MOVE TODAYS-DATE     TO  DELETE-DATE.
028100     MOVE ZERO            TO  DELETE-DATE-DD.
028200
028300     IF DELETE-DATE-MM > PO-DELETE-MONTHS
028400         NEXT SENTENCE
028500     ELSE
028600         SUBTRACT 1 FROM DELETE-DATE-YY
028700         ADD 12 TO DELETE-DATE-MM.
028800     SUBTRACT PO-DELETE-MONTHS  FROM  DELETE-DATE-MM.
028900*    DISPLAY "DELETE DATE ", DELETE-DATE.
029000
           MOVE 61 TO LINE-CTR.
           MOVE 0 TO PO-RECS-CTR, OPEN-INV-RECS-CTR,
               OPEN-ITM-RECS-CTR, OPEN-WOS-RECS-CTR.
           MOVE SPACES TO SAVE-PO.
           SORT SORT-FILE ASCENDING KEY SORT-PO-DATE SORT-PO
               INPUT PROCEDURE  7-SORT-INPUTS
               OUTPUT PROCEDURE 8-WRITE-OUTPUT.
           CLOSE DINVRCD.
           CLOSE DPOITEM.
           CLOSE DPORECD.
           CLOSE DREQD.
           CLOSE MPLTINFO.
           CLOSE PRINT-FILE.
           GOBACK.

       2100-BLOWUP.
           MOVE "TRPTNOHPOS" TO BU-PGM-NAME.
078300     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
078400       VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
078500       BU-DISPLAY-FLDS.
           GOBACK.

       COPY OVRPFCALL IN COPYLIB.

       7-SORT-INPUTS SECTION.
           PERFORM 7-BEGFIL-DPORECD.
       7-SORT-LOOP.
           PERFORM 7-GETSER-DPORECD.
           IF END-OF-FILE
               GO TO 7-SL-X.
           MOVE SPACES          TO SORT-REC.
           IF PO-RLS-NO = "999"
               IF PO-EXPECT-DATE < DELETE-DATE
                   NEXT SENTENCE
               ELSE
               GO TO 7-SORT-LOOP.
           IF PO-LAST-PAYMENT = SPACES
               IF PO-DATE < DELETE-DATE
                   NEXT SENTENCE
               ELSE
               GO TO 7-SORT-LOOP
           ELSE
           MOVE PO-LAST-PAYMENT TO BUILD-PO-LAST-PAY-YYMM
           IF BUILD-PO-LAST-PAYMENT < DELETE-DATE
               NEXT SENTENCE
           ELSE
           GO TO 7-SORT-LOOP.
           IF PO-NON-RCV-INDIC = "X"
               IF PO-EXPECT-DATE < DELETE-DATE
                   MOVE "NONRCV" TO SORT-FLAGS
               ELSE
               IF PO-EXPECT-DATE = SPACES
                   MOVE "NONRCV" TO SORT-FLAGS
               ELSE
               GO TO 7-SORT-LOOP.
           MOVE PO-RCV-NO TO SORT-PO,
                             PORCVNO OF DPOITEM-REC,
                             PORCVNO OF DREQD-REC,
                             PORCVNO OF DINVRCD-REC.
           MOVE PO-LAST-PAYMENT TO SORT-LAST-PAYMENT.
           MOVE PO-DATE         TO SORT-PO-DATE.
           MOVE PO-EXPECT-DATE  TO SORT-EXPECT-DATE.
           ADD 1                TO PO-RECS-CTR.
           MOVE 0               TO ITM-CHECK-SW.
           START DPOITEM KEY >= PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "START DPOITEM"  TO  BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

       7-SL-ITEMS.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 7-SORT-LOOP
               ELSE
               DISPLAY "ERROR READING DPOITEM SEGMENTS"
               GO TO 7-SORT-LOOP.
           IF ITM-PO-RCV-NO NOT = PO-RCV-NO
               IF ITM-CHECK-SW = 0
                   SUBTRACT 1 FROM PO-RECS-CTR
                   GO TO 7-SORT-LOOP
               ELSE
               GO TO 7-SORT-LOOP.
           IF ITM-QTY-ORD = 0
               NEXT SENTENCE
           ELSE
           IF ITM-QTY-ORD = ITM-QTY-DLVR
               IF ITM-QTY-ORD = ITM-QTY-STORED
                  IF ITM-QTY-ORD = ITM-QTY-PAID
                      GO TO 7-SL-ITEMS.
           MOVE 1                TO ITM-CHECK-SW.
           ADD 1                 TO OPEN-ITM-RECS-CTR.
           MOVE ITM-NUMBER       TO SORT-ITM-NUMBER.
           MOVE ITM-QTY-ORD      TO SORT-ORDERED.
           MOVE ITM-QTY-DLVR     TO SORT-DELIVERED.
           MOVE ITM-QTY-STORED   TO SORT-STORED.
           MOVE ITM-QTY-PAID     TO SORT-PAID.
           PERFORM 7-GET-REQ-WO THRU 7-GRW-X.
           IF SORT-WO NOT = SPACES
               ADD 1             TO OPEN-WOS-RECS-CTR.
           PERFORM 7-CHECK-OPEN-INVOICES THRU 7-COI-X.
           RELEASE SORT-REC.
           GO TO 7-SL-ITEMS.

       7-BEGFIL-DPORECD.
           MOVE SPACES TO PORCVNO OF DPORECD-REC.
           START DPORECD KEY >= PORCVNO OF DPORECD-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       7-GETSER-DPORECD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 7-GETSER-DPORECD"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       7-GET-REQ-WO.
           START DREQD KEY = PORCVNO OF DREQD-REC
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00" GO TO 7-GRW-X.
       7-GRW-CONT.
           READ DREQD NEXT INTO BUF-DREQD
               AT END    MOVE FILE-STATUS TO FILE-STATUS.
           IF DREQD-PO-RCV-NO NOT = PO-RCV-NO
               MOVE SPACES       TO SORT-REQ-NUMBER
                                    SORT-WO
               GO TO 7-GRW-X
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE SPACES       TO SORT-REQ-NUMBER
                                    SORT-WO
               GO TO 7-GRW-X
           ELSE
           IF DREQD-PO-ITM-NO = ITM-NUMBER
               MOVE DREQD-REQ-NUMBER TO SORT-REQ-NUMBER
               MOVE DREQD-WO-NUMBER  TO SORT-WO
               GO TO 7-GRW-X.
           GO TO 7-GRW-CONT.
       7-GRW-X.    EXIT.

       7-CHECK-OPEN-INVOICES.
           START DINVRCD KEY = PORCVNO OF DINVRCD-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               MOVE "FIND DINVRCD *7-COI" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.

       7-GET-DINVRCD.
           READ DINVRCD NEXT INTO BUF-DINVRCD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "Y"  TO  PO-COMPLETE-SW
                   GO TO 7-COI-X
               ELSE
               MOVE "GET DINVRCD*7-GD" TO BU-DISPLAY-MSG
               GO TO 2100-BLOWUP.
           IF PORCVNO OF DINVRCD-REC NOT = PO-RCV-NO
               MOVE "Y"  TO  PO-COMPLETE-SW
               GO TO 7-COI-X.

      ********  INVOICE IS COMPLETE (MANIFESTED) IF INV-STATUS = 2

           IF INV-STATUS = "2"
               GO TO 7-GET-DINVRCD
           ELSE
           MOVE "OPNINV"       TO SORT-INVLIT
           ADD 1               TO OPEN-INV-RECS-CTR.
       7-COI-X.    EXIT.

       7-SL-X.    EXIT.

       8-WRITE-OUTPUT SECTION.
           RETURN SORT-FILE AT END
               PERFORM 8-WRITE-SUMMARY
               GO TO 8-WO-X.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               PERFORM 8-HEADER.
           MOVE SPACES TO PRINT-REC, DETAIL-LINE.
           IF SAVE-PO = SPACES
               MOVE SORT-PO           TO SAVE-PO
               MOVE SORT-PO-13        TO D-PO
               MOVE SORT-PO-DATE      TO D-PO-DATE
               MOVE SORT-LAST-PAYMENT TO D-LAST-PAYMENT
               MOVE SORT-EXPECT-DATE  TO D-EXPECT-DATE
           ELSE
           IF SORT-PO = SAVE-PO
               MOVE SPACES            TO D-PO
                                         D-PO-DATE
                                         D-LAST-PAYMENT
                                         D-EXPECT-DATE
           ELSE
           MOVE SORT-PO               TO SAVE-PO
           MOVE SORT-PO-13            TO D-PO
           MOVE SORT-PO-DATE          TO D-PO-DATE
           MOVE SORT-LAST-PAYMENT     TO D-LAST-PAYMENT
           MOVE SORT-EXPECT-DATE      TO D-EXPECT-DATE.
           MOVE SORT-ITM-NUMBER       TO D-ITM-NUMBER.
           MOVE SORT-ORDERED          TO D-ORDERED.
           MOVE SORT-DELIVERED        TO D-DELIVERED.
           MOVE SORT-STORED           TO D-STORED.
           MOVE SORT-PAID             TO D-PAID.
           MOVE SORT-REQ-NUMBER       TO D-REQ-NUMBER.
           MOVE SORT-FLAGS            TO D-FLAGS.
           MOVE SORT-WO               TO D-WO.
           MOVE SORT-INVLIT           TO D-RCVLIT.
           STRING DETAIL-LINE
               DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 8-WRITE-OUTPUT.

       8-HEADER.
           MOVE SPACES TO  PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           STRING MPLTINFO-COMPANY,
             "                                  PO'S NOT ",
             "AUTOMATICALLY MOVING TO HISTORY            ",
             TODAYS-DATE,
             DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           STRING "    PO #       PODATE LPAY EXDATE ITM#    ORDERED ",
             "  DELIVERED      STORED        PAID",
             "    REQ #      FLAGS  TIED TO WO INVLIT       ",
             DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE ALL "-" TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE 5 TO LINE-CTR.

       8-WRITE-SUMMARY.
           ADD 5 TO LINE-CTR.
           IF LINE-CTR > 56
               PERFORM 8-HEADER.
           MOVE SPACES TO PRINT-REC, DETAIL-LINE-2.
           MOVE "PURCHASE ORDERS ON REPORT = "
               TO D2-LIT.
           MOVE PO-RECS-CTR       TO D2-CTR.
           WRITE PRINT-REC FROM DETAIL-LINE-2
               AFTER ADVANCING 2 LINES.
           MOVE "P.O. ITEMS REPORTED       = "
               TO D2-LIT.
           MOVE OPEN-ITM-RECS-CTR TO D2-CTR.
           WRITE PRINT-REC FROM DETAIL-LINE-2
               AFTER ADVANCING 1 LINES.
           MOVE "P.O. INVOICES NOT CLOSED  = "
               TO D2-LIT.
           MOVE OPEN-INV-RECS-CTR TO D2-CTR.
           WRITE PRINT-REC FROM DETAIL-LINE-2
               AFTER ADVANCING 1 LINES.
           MOVE "P.O'S TIED TO WORK ORDERS = "
               TO D2-LIT.
           MOVE OPEN-WOS-RECS-CTR TO D2-CTR.
           WRITE PRINT-REC FROM DETAIL-LINE-2
               AFTER ADVANCING 1 LINES.
       8-WO-X.    EXIT.
