000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TRPTJ039.
000400 AUTHOR.     A TREUDLER.
000500 DATE-WRITTEN. MAY, 1989.
000600 DATE-COMPILED.
001000*
001100*    THIS PROGRAM SETS THE JCW FOR REPORT R27 WRITE DOWN
001200*    ITEMS REPORT, JCW VALUE IS SET TO 39.
001700*
      *  07/31/1997    CA YODER
      *    CHANGED CALL TO "TRSCREEN" TO "TRSCREN2" SO THAT THE
      *    COMMON MATERIALS CONTROL SCREENS CAN BE DISPLAYED.
      *
006800 ENVIRONMENT DIVISION.
006900 CONFIGURATION SECTION.
007000 SOURCE-COMPUTER.  HP-3000.
007100 OBJECT-COMPUTER.  HP-3000.
007400

007900 DATA DIVISION.
008900 WORKING-STORAGE SECTION.
       01  BASE    PIC X(10).

       COPY JCWAREA IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       PROCEDURE DIVISION.
       1000-START.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GOBACK.

029200 2100-BLOWUP.
029300     MOVE "TRPTJ039"             TO   BU-PGM-NAME.
029400     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
029500       DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
029600           BU-DISPLAY-FLDS.

       6000-MAIN.
           MOVE "039"       TO SETJCW-VALUE.
           MOVE 278         TO SETJCW-STARTING-POS.
           MOVE 3           TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           CALL "TRSCREN2".

       6990-MAIN-X.
           EXIT.
