001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TRPTACC.
001300 AUTHOR.              KURT MOVSESIAN.
001400 DATE-WRITTEN.       MAR 4,1981.
003200 DATE-COMPILED.
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.  AS-400.
003700 OBJECT-COMPUTER.  AS-400.
      *REMARKS.
      *D   *******************************************************
      *D   *   REPORT -- R 13                                    *
      *D   *   VALID ACCOUNTING LISTING                          *
      *D   *                                                     *
      *D   *   CALLED FROM TRSCREEN - JCW 25                     *
      *D   *   USES ZRSCREEN, FORM FACCRPT                       *
      *D   *                                                     *
      *D   *******************************************************
      *C
      *C  2-9-93  BK DISMUKES  REQUEST 6233
      *C    UPDATED TO REPORT COMPANY, PRIME AND ACCOUNTING CLASS
      *C    CODES.  WILL ALSO REPORT DEPARTMENT WITH COMPANY & PRIME
      *C    LINKS.
      *C
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  11/28/1994  CA ZUBEK
      *C   INCREASED SIZE OF BAD-CODE TABLE.  PROGRAM BLEW UP IN GADSDEN
      *C   DUE TO LIMITED TABLE SIZE ON 11/22/1994.
      *C
      *C  11/29/1994   DAVE PLUM
      *C   ADDED LOGIC TO SKIP OVER RECORDS IN DATASET MVALIDPLTDATA
      *C   WHICH HAVE "RC" AS THE FIRST 2 CHARACTERS OF THEIR KEY.  THESE
      *C   RECORDS ARE USED BY THE ELECTRONIC REQUISITION SYSTEM FOR
      *C   REQUESTING (R) AND CHARGE (C) DEPARTMENTS.  THEY ARE
      *C   ADDED/MODIFIED/DELETED BY PROGRAM TEASETUP.  PRIOR TO THIS
      *C   CHANGE, THESE RECORDS WERE BEING INCLUDED ON THE "INVALID
      *C   CLASS CODES" REPORT.  (GADSDEN 11/28/1994)
      *C
      *C
      *C  05/02/2002  CA YODER
      *C   CHANGED WORDING OF HEADINGS ON VALID NEW WORK NUMBER
      *C   REPORT.  FOR SAP PLANTS, THESE ARE REFERRED TO AS
      *C   SAP INTERNAL ORDER NUMBERS.
      *C
003800 SPECIAL-NAMES.  C01 IS NEW-PAGE.
004000
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300     SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
004400     SELECT SORT-MVALIDPLT-FILE  ASSIGN TO DISK-SORT.
004400     SELECT SORT-MCLASS-FILE  ASSIGN TO DISK-SORT.
004500
           SELECT MVALIDPLTDATA-I
                  ASSIGN TO DATABASE-MCFLCS1701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-I
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

004600 DATA DIVISION.
004700 FILE SECTION.
004900 FD  ONLINE-PRT
005000     LABEL RECORDS ARE OMITTED
005100     RECORD CONTAINS 132 CHARACTERS
005200     DATA RECORD IS PRINT-RCD.
005300 01  PRINT-RCD.
005400     05  PRINT-LINE             PIC X(132).
005500
005600 SD  SORT-MVALIDPLT-FILE
005700     RECORD CONTAINS 26 CHARACTERS.
005800 01  SORT-RCD.
005900     05  SORT-DETAIL.
C06000         10  SORT-FIELD         PIC X(10).
C06000         10    FILLER           PIC X(10).
C06000         10  SORT-CO-PR         PIC X(6).
005500
005600 SD  SORT-MCLASS-FILE
005700     RECORD CONTAINS 64 CHARACTERS.
005800 01  SORT-MCLASS-RCD.
005900     05  SORT-MCLASS-DETAIL.
C06000         10  SORT-MCLASS-CLS    PIC X(4).
C06000         10  SORT-MCLASS-DESC   PIC X(60).
006100
       FD  MVALIDPLTDATA-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDPLTDATA-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS1701.

       FD  MCLASS-I
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS4901.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

006200 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE "0".
           05  FILE-STATUS-2          PIC X      VALUE "0".
006300
006400 COPY TDATECHK IN COPYLIB.
006500
006600 01  EOF-SW                     PIC X      VALUE SPACE.
006700
006800 77  KOUNT                      PIC 9      VALUE ZEROS.
006900 77  CLASS-PAGE                 PIC XX     VALUE ZEROS.
007000 77  BAD-KOUNT                  PIC 9(3)   VALUE ZEROS.
007100 77  BAD-KOUNT-OUT              PIC 9(3)   VALUE ZEROS.
       77  SAVE-REQ-SYNR3-SW          PIC X(1).

       01  PLT-ARG                    PIC X(4)   VALUE SPACE.
9406CK 01  SCOPE   PIC X.
007200
007300******ARGUMENT VALUES******
007500
007600 77  ITMS-PER-PAGE              PIC 99     VALUE ZEROS.
007700
007800 77  PG-CTR                     PIC 999    VALUE ZEROS.
007900
008000 COPY DATAB IN COPYLIB.
009100
009200************* ESCAPE SEQUENCES
009300 COPY ESCNAM2 IN COPYLIB.
009400
009500 01  COMPRESS-PRINT              PIC X(8).
009600
009700 01  NORMAL-PRINT                PIC X(8).
010000
010100 COPY TBLOWUP IN COPYLIB.
010600
010700************* PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG
010800
010900 01  HD-RET-CODE                PIC S9(4)  COMP-4 VALUE 0.
011000 01  HD-FILE-NAME               PIC X(17)  VALUE SPACES.
011100 01  FNUM                       PIC S9(4)  COMP-4 VALUE 0.
012500
012600 01  TRANS-TIME.
012700     05  HH                     PIC XX.
012800     05  MIN                    PIC XX.
012900     05  SS                     PIC XX.
013000
013500*********************
013600*                   *
013700*   DATA SET NAMES  *
013800*                   *
013900*********************
014000
014100 01  DSET-NAMES.
014300     05  DSET-MVALIDPLTDATA      PIC X(16)
014400                       VALUE "MVALIDPLTDATA".
014300     05  DSET-MCLASS             PIC X(16)  VALUE "MCLASS".
014500
014600*********************************
014700*                               *
014800*  BELOW ARE THE BUFFER AREAS   *
014900*    SET UP FOR EACH DATASET IN *
015000*    THE DATABASE - STORES      *
015100*                               *
015200*********************************
015300
       COPY MVALDPLT IN COPYLIB.

       COPY MCLASS   IN COPYLIB.

       COPY MPLT0      IN COPYLIB.
       COPY MPLTPREQ   IN COPYLIB.
015700
015800*****************
015900*               *
016000* H E A D E R S *
016100*               *
016200*****************
016300
016400 01  DOT-LINE.
016500     05 FILLER              PIC X(132) VALUE ALL "-".
016600 01  REPORT-HEADER.
016700     05  FILLER    PIC X(5)   VALUE "PAGE ".
016800     05  PRT-OVER-PG PIC ZZ9  VALUE ZEROS.
016900     05  FILLER    PIC X(35)  VALUE SPACES.
017000     05  FILLER    PIC X(21)  VALUE "V A L I D   P L A N T".
017100     05  FILLER    PIC X(10)  VALUE "   D A T A".
017200     05  FILLER    PIC X(30)  VALUE SPACES.
017300     05  FILLER    PIC X(5)   VALUE "DATE ".
017400     05  PRT-DATE  PIC X(8) VALUE SPACES.
017500     05  FILLER    PIC XX     VALUE SPACES.
017600     05  PRT-TIME   PIC X(8).
017700
017800 01  HDR-DP.
017900     05  FILLER       PIC X(7)  VALUE "TRPTACC".
018000     05  FILLER       PIC X(43)  VALUE SPACES.
018100     05  FILLER       PIC X(16)  VALUE "DEPARTMENT CODES".
018200
018300 01  HDR-DL.
018400     05  FILLER       PIC X(40)  VALUE SPACES.
018500     05  FILLER       PIC X(38)
018600              VALUE "DEPARTMENTS WITH COMPANY & PRIME LINKS".
018600
018300 01  HDR-EC.
018400     05  FILLER       PIC X(50)  VALUE SPACES.
018500     05  FILLER       PIC X(15)  VALUE "EXPENSE CLASSES".
018600
018700 01  HDR-NW.
018800     05  FILLER       PIC X(50)  VALUE SPACES.
018900     05  FILLER       PIC X(16)  VALUE "NEW WORK NUMBERS".
019000
       01  HDR-NW-R3.
           05  FILLER       PIC X(45)  VALUE SPACES.
           05  FILLER       PIC X(26)  VALUE
                               "SAP INTERNAL ORDER NUMBERS".

018700 01  HDR-CO.
018800     05  FILLER       PIC X(50)  VALUE SPACES.
018900     05  FILLER       PIC X(13)  VALUE "COMPANY CODES".
019000
018700 01  HDR-PR.
018800     05  FILLER       PIC X(50)  VALUE SPACES.
018900     05  FILLER       PIC X(11)  VALUE "PRIME CODES".
019000
018700 01  HDR-AC.
018800     05  FILLER       PIC X(40)  VALUE SPACES.
018500     05  FILLER       PIC X(33)
018600              VALUE "ACCOUNTING CLASSES & DESCRIPTIONS".
019000
019100 01  CODE-LINE.
019200     05 CLASS-CODE              PIC XX.
019300     05 CLASS-CODE-X REDEFINES CLASS-CODE.
019400        10 CLASS-CODE-1X        PIC X(1).
019500        10 CLASS-FILLER         PIC X(1).
019600     05 NUM-PART                PIC X(6).
019700     05   FILLER                PIC X(12).
019700     05 CODE-DESC.
019700        10  CO-CODE             PIC X(3).
019700        10  PR-CODE             PIC X(3).
019700
019700
019800 01  BAD-CODE.
019900     05 B-CODE OCCURS 500 TIMES PIC X(8).
020000
020100 01  BAD-CODE-HDR.
020200     05 FILLER                  PIC X(50) VALUE SPACES.
020300     05 FILLER                  PIC X(8)  VALUE "INVALID ".
020400     05 FILLER                  PIC X(11) VALUE "CLASS CODES".
020500
020600 01  ITEM-LINE-1.
020700     05 DP-LINE OCCURS 4 TIMES.
020800        10   FILLER             PIC X(10).
020900        10 ITEM-DP              PIC X(6).
021000
020600 01  ITEM-LINE-1-DL.
020700     05 DL-LINE OCCURS 4 TIMES.
020800        10   FILLER             PIC X(8)  VALUE "   DEPT-".
020900        10 ITEM-DP-LINK         PIC X(6).
020800        10   FILLER             PIC X(4)  VALUE " CO-".
020900        10 ITEM-CO-LINK         PIC X(3).
020800        10   FILLER             PIC X(4)  VALUE " PR-".
020900        10 ITEM-PR-LINK         PIC X(3).
021000
021100 01  ITEM-LINE-2.
021200     05 EC-NW-ONE OCCURS 4 TIMES.
021300        10   FILLER             PIC X(10).
021400        10 ITEM-EC-NW           PIC X(8).
021000
021100 01  ITEM-LINE-3.
021200     05 CO-PR-ONE OCCURS 4 TIMES.
021300        10   FILLER             PIC X(10).
021400        10 ITEM-CO-PR           PIC X(5).
021000
021100 01  ITEM-LINE-4.
021200     05 AC-AND-DESCRIPTION.
021300        10   FILLER             PIC X(2).
021400        10 ITEM-AC              PIC X(4).
021300        10   FILLER             PIC X(2).
021400        10 ITEM-DESC            PIC X(60).
021500
       COPY OVRPFDATA IN COPYLIB.

       COPY CCHKOBJ IN COPYLIB.

       LINKAGE SECTION.

030600 COPY THDPRTB IN COPYLIB.
030700
       01  OPTION-AREA.
008600     05  SELECT-D               PIC X(1).
008600     05  SELECT-O               PIC X(1).
008700     05  SELECT-E               PIC X(1).
008800     05  SELECT-N               PIC X(1).
008800     05  SELECT-C               PIC X(1).
008800     05  SELECT-P               PIC X(1).
008900     05  SELECT-I               PIC X(1).
008900     05  SELECT-L               PIC X(1).
           05  FILLER                 PIC X(104).

021600*****************************************************************
021700*****          P R O C E D U R E   D I V I S I O N         ******
021800*****************************************************************
021900
022000 PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-AREA.
022100 START-UP SECTION.
022200 HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT MVALIDPLTDATA-I,
                      MCLASS-I,
                      MPLTINFO-I.
022900     MOVE 1 TO DATE-MODE.
023000     CALL "TDATECHK" USING DATE-CHECK-AREA.
023100     MOVE DATE-SLASH-OUT           TO  PRT-DATE.
023200     MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.
           MOVE "PREQ"                   TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "N"                       TO  SAVE-REQ-SYNR3-SW
           ELSE
               MOVE MPLTINFO-REQ-SYNR3-SW     TO  SAVE-REQ-SYNR3-SW.
023300
023400******* ACCEPT SELECTION CRITERIA AND HEADER INFORMATION
023500 1-GET-SELECTION.
      ************************************
      **   DISPLAY ROUTE DATA
      ************************************
023600     DISPLAY HD-ROUTE-DATA.
082000     MOVE HD-SPOOLER-NUMBER       TO  OVRPRTF-TOFILE-NUM.
           MOVE "*YES"                  TO  OVRPRTF-SHARED.
082100     MOVE HD-NO-OF-COPIES         TO  OVRPRTF-COPIES.
           PERFORM 996-OVERRIDE-PRINT-FILE.
023800
023900     OPEN OUTPUT ONLINE-PRT.
024100     MOVE "DHDR25.PUB"  TO HD-FILE-NAME.
024200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
024300       HD-ROUTE-DATA, ESC-NAME.
024400     IF HD-RET-CODE NOT = 0
024500         MOVE "THDPRT2 ERROR IN 3-GET-SELECTION"
024600            TO BU-DISPLAY-MSG
024700         MOVE "HD-RET-CODE = "          TO BU-DISPLAY-FLD (1)
024800         MOVE HD-RET-CODE               TO BU-DISPLAY-FLD9 (1)
024900         GO TO 2-BLOWUP.
025000
025100      CALL "TESCSEQ" USING ESC-NAME.
025200      MOVE CHAR-1636PI     TO COMPRESS-PRINT.
025300      MOVE CHAR-10PI       TO NORMAL-PRINT.
025600
025600     IF SELECT-D = "X" OR
025600        SELECT-O = "X" OR
025600        SELECT-E = "X" OR
025600        SELECT-N = "X" OR
025600        SELECT-C = "X" OR
025600        SELECT-P = "X" OR
025600        SELECT-I = "X"
025700         SORT SORT-MVALIDPLT-FILE
025800           ON ASCENDING KEY      SORT-FIELD
025900              INPUT  PROCEDURE IS  ABSTRACT-CODES
026000              OUTPUT PROCEDURE IS  WRITE-REPORT.
026100
025600     IF SELECT-L = "X"
025700         SORT SORT-MCLASS-FILE
025800           ON ASCENDING KEY      SORT-MCLASS-CLS
025900              INPUT  PROCEDURE IS  SORT-ACCT-CODES
026000              OUTPUT PROCEDURE IS  WRITE-ACCT-REPORT.
026000
026200
026200
026300 2-SHUTDOWN-DB.
026500     WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.
026600     CLOSE ONLINE-PRT.
           CLOSE MVALIDPLTDATA-I,
                 MCLASS-I,
                 MPLTINFO-I.
027100     GOBACK.
027200
027300 2-BLOWUP.
022300     MOVE "TRPTACC" TO BU-PGM-NAME.
027400     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
027500         DUMMY-VIEW-AREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
027600             BU-DISPLAY-AREA.
027700
027800 2-BLOWUP-X.
027900     EXIT.
028000
028100
028200*******************************************
028300*                                         *
028400*    I N P U T    P R O C E D U R E       *
028500*           FOR  MVALIDPLTDATA            *
028600*******************************************
028700
028800 ABSTRACT-CODES SECTION.
028900 ABSTRACT-LOOP.
029000
029100*** SERIAL GET THRU MVALIDPLTDATA
029200
           READ MVALIDPLTDATA-I NEXT INTO BUF-MVALIDPLTDATA
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
030000             GO TO AC-X
030100         ELSE
030200             MOVE "READ MVALIDPLTDATA *AL" TO BU-DISPLAY-MSG
030400             GO TO 2-BLOWUP.
030500
030600 DOES-CODE-QUALIFY.
030700     MOVE VALID-DATA-KEY    TO SORT-FIELD.
030700     MOVE VALID-DATA-CO-PR  TO SORT-CO-PR.
030800
030900     RELEASE SORT-RCD.
031000
031100     GO TO ABSTRACT-LOOP.
031200 AC-X.
031300     EXIT.
031400
031500*******************************************
031600*                                         *
031700*    O U T P U T   P R O C E D U R E      *
031800*          FOR   MVALIDPLTDATA            *
031900*******************************************
032000
032100 WRITE-REPORT SECTION.
032200 WRITE-RPT.
032300     IF PAPER-IS-132-COLS
032400         NEXT SENTENCE
032500     ELSE
032600         WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
032800     MOVE SPACES TO ITEM-LINE-1, ITEM-LINE-2, ITEM-LINE-3.

032900 AGAIN.
033000     PERFORM RETURN-RCD.
033100     IF EOF-SW = "Y"
033100         GO TO FINAL-PROCEDURE.
033200     MOVE SORT-DETAIL   TO CODE-LINE.
033300
033400     IF CLASS-CODE = "DP"
033500         IF SELECT-D = "X" OR
033500            SELECT-O = "X"
033600             NEXT SENTENCE
033700         ELSE
033800             GO TO AGAIN
033900     ELSE
034000     IF CLASS-CODE = "EC"
034100         IF SELECT-E = "X"
034200             NEXT SENTENCE
034300         ELSE
034400             GO TO AGAIN
034500     ELSE
034600     IF CLASS-CODE = "NW"
034700         IF SELECT-N = "X"
034800             NEXT SENTENCE
034900         ELSE
035000             GO TO AGAIN
035100     ELSE
034600     IF CLASS-CODE = "CO"
034700         IF SELECT-C = "X"
034800             NEXT SENTENCE
034900         ELSE
035000             GO TO AGAIN
035100     ELSE
034600     IF CLASS-CODE = "PR"
034700         IF SELECT-P = "X"
034800             NEXT SENTENCE
034900         ELSE
035000             GO TO AGAIN
035100     ELSE
           IF CLASS-CODE = "RC"
                GO TO AGAIN
           ELSE
035200     IF CLASS-CODE-1X = "S"
035300          GO TO AGAIN
035400     ELSE
035500          PERFORM BADONE
035600          GO TO AGAIN.
035800
035900     IF CLASS-CODE NOT EQUAL TO CLASS-PAGE
036000         IF KOUNT > 0
036100         PERFORM CHANGE-OF-CLASS
036200         PERFORM PAGE-HDR
036300     ELSE
036400         PERFORM PAGE-HDR.
036500
036600     IF ITMS-PER-PAGE > 49 PERFORM PAGE-HDR.
036700     PERFORM TYPE-PROCEDURE.
036800     GO TO AGAIN.

036900 FINAL-PROCEDURE.
037000     IF KOUNT > 0 PERFORM  CHANGE-OF-CLASS.
037100     IF BAD-KOUNT > 0
037200         PERFORM BAD-CODE-LISTING
037300         PERFORM BAD-LOOP
037400             VARYING BAD-KOUNT-OUT FROM 1 BY 1
037500                 UNTIL BAD-KOUNT-OUT > BAD-KOUNT
037600         IF KOUNT > 0
037700             MOVE ITEM-LINE-2 TO PRINT-LINE
037800             PERFORM WRITE-ITEM-LINE.
037900     GO TO WR-X.
038300
038000 RETURN-RCD.
038100     RETURN SORT-MVALIDPLT-FILE
038200         AT END MOVE "Y" TO EOF-SW.
038300
038400*******************************************
038500*                                         *
038600*    V A L I D  C O D E S  R E P O R T    *
038700*           FOR   MVALIDPLTDATA           *
038800*******************************************
038900
039000 WRITE-ITEM-LINE.
039100     WRITE PRINT-RCD  AFTER ADVANCING 1 LINES.
039200     MOVE 0 TO KOUNT.
039300     ADD 1 TO ITMS-PER-PAGE.
032800     MOVE SPACES TO ITEM-LINE-1, ITEM-LINE-2, ITEM-LINE-3.
039500
039600 PAGE-HDR.
039700     MOVE SPACES         TO PRINT-LINE.
039800     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
039900     ADD 1               TO PG-CTR.
040000     MOVE PG-CTR         TO PRT-OVER-PG.
040100     MOVE REPORT-HEADER          TO PRINT-RCD.
040200     WRITE PRINT-RCD AFTER  ADVANCING 1 LINES.
040300     MOVE 0 TO ITMS-PER-PAGE.
040400     MOVE CLASS-CODE TO CLASS-PAGE.

040500     IF CLASS-PAGE = "DP"
              IF SELECT-O = "X"
                  PERFORM TYPE-1-DL-HDR
              ELSE
                  PERFORM TYPE-1-HDR.
040600     IF CLASS-PAGE = "EC"
040600         PERFORM TYPE-2-HDR.
040700     IF CLASS-PAGE = "NW"
040600         PERFORM TYPE-3-HDR.
040700     IF CLASS-PAGE = "CO"
040600         PERFORM TYPE-4-HDR.
040700     IF CLASS-PAGE = "PR"
040600         PERFORM TYPE-5-HDR.
040800     IF CLASS-PAGE = "XX"
040800         PERFORM BAD-CLASS-CODE.
040900     WRITE PRINT-RCD  AFTER ADVANCING 1 LINES.
041000     MOVE SPACES TO PRINT-LINE.
041100     WRITE PRINT-RCD FROM DOT-LINE AFTER ADVANCING 1 LINES.
041200     MOVE SPACES TO PRINT-LINE.
041300     WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
041400
041500 TYPE-PROCEDURE.
041600     IF CLASS-PAGE = "DP"
041400         IF SELECT-O = "X"
041400             PERFORM TYPE-DL
041400         ELSE
041400             PERFORM TYPE-DP
041700     ELSE
041800     IF CLASS-PAGE = "EC" OR "NW"
042100         PERFORM TYPE-EC-NW
041900     ELSE
042000     IF CLASS-PAGE = "CO" OR "PR"
042100         PERFORM TYPE-CO-PR.
042100
042200 CHANGE-OF-CLASS.
042300     IF CLASS-PAGE = "DP"
042100         IF SELECT-O = "X"
042100             MOVE ITEM-LINE-1-DL TO PRINT-LINE
042100         ELSE
042100             MOVE ITEM-LINE-1    TO PRINT-LINE.
042400     IF CLASS-PAGE = "EC" OR "NW"
042400         MOVE ITEM-LINE-2        TO PRINT-LINE.
042500     IF CLASS-PAGE = "CO" OR "PR"
042400         MOVE ITEM-LINE-3        TO PRINT-LINE.

042600     PERFORM WRITE-ITEM-LINE.

042700 TYPE-1-HDR.
042800     MOVE HDR-DP TO PRINT-LINE.

042700 TYPE-1-DL-HDR.
042800     MOVE HDR-DL TO PRINT-LINE.
042900
043000 TYPE-2-HDR.
043100     MOVE HDR-EC TO PRINT-LINE.
043200
043300 TYPE-3-HDR.
           IF SAVE-REQ-SYNR3-SW = "Y"
               MOVE HDR-NW-R3 TO PRINT-LINE
           ELSE
043400     MOVE HDR-NW TO PRINT-LINE.
043200
043300 TYPE-4-HDR.
043400     MOVE HDR-CO TO PRINT-LINE.
043200
043300 TYPE-5-HDR.
043400     MOVE HDR-PR TO PRINT-LINE.
043200
043500 BAD-CLASS-CODE.
043600     MOVE BAD-CODE-HDR TO PRINT-LINE.
043700
043800 TYPE-DP.
043900     ADD 1 TO KOUNT.
044000     MOVE NUM-PART TO  ITEM-DP(KOUNT).
044100     IF KOUNT = 4
044200         MOVE ITEM-LINE-1 TO PRINT-LINE
044300         PERFORM WRITE-ITEM-LINE.
043700
043800 TYPE-DL.
043900     ADD 1 TO KOUNT.
044000     MOVE SPACES   TO  ITEM-DP-LINK (KOUNT),
044000                       ITEM-CO-LINK (KOUNT),
044000                       ITEM-PR-LINK (KOUNT).
044000     MOVE NUM-PART TO  ITEM-DP-LINK (KOUNT).
044000     MOVE CO-CODE  TO  ITEM-CO-LINK (KOUNT).
044000     MOVE PR-CODE  TO  ITEM-PR-LINK (KOUNT).
044100     IF KOUNT = 4
044200         MOVE ITEM-LINE-1-DL TO PRINT-LINE
044300         PERFORM WRITE-ITEM-LINE.
044400
044500 TYPE-EC-NW.
044600     ADD 1 TO KOUNT.
044700     MOVE NUM-PART TO ITEM-EC-NW(KOUNT).
044800     IF KOUNT = 4
044900         MOVE ITEM-LINE-2 TO PRINT-LINE
045000         PERFORM WRITE-ITEM-LINE.
044400
044500 TYPE-CO-PR.
044600     ADD 1 TO KOUNT.
044700     MOVE NUM-PART TO ITEM-CO-PR(KOUNT).
044800     IF KOUNT = 4
044900         MOVE ITEM-LINE-3 TO PRINT-LINE
045000         PERFORM WRITE-ITEM-LINE.
045100
045200 BAD-CODE-LISTING.
045300     MOVE "XX" TO CLASS-CODE.
045400     PERFORM PAGE-HDR.
045500
045600 BAD-LOOP.
045700     ADD 1 TO KOUNT.
045800     MOVE B-CODE(BAD-KOUNT-OUT) TO ITEM-EC-NW(KOUNT).
045900     IF KOUNT = 4
046000         MOVE ITEM-LINE-2 TO PRINT-LINE
046100         PERFORM WRITE-ITEM-LINE.
046200 BADONE.
046300     ADD 1 TO BAD-KOUNT.
046400     MOVE CODE-LINE TO B-CODE(BAD-KOUNT).
046500
       COPY OVRPFCALL IN COPYLIB.
046800
046900 WR-X.
047000     EXIT.
028100
028200*******************************************
028300*                                         *
028400*    I N P U T    P R O C E D U R E       *
028500*           FOR    MCLASS                 *
028600*******************************************
028700
028800 SORT-ACCT-CODES SECTION.
028900 SORT-ACCT-LOOP.
029000
029100*** SERIAL GET THRU MCLASS
029200
           READ MCLASS-I NEXT INTO BUF-MCLASS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
030000             GO TO SAC-X
030100         ELSE
030200             MOVE "READ MCLASS *AL" TO BU-DISPLAY-MSG
030400             GO TO 2-BLOWUP.
030500
030600 DOES-ACCT-CODE-QUALIFY.
030700     MOVE MCLASS-CLS          TO SORT-MCLASS-CLS
030700     MOVE MCLASS-CLASS-DESCR  TO SORT-MCLASS-DESC.
030800
030900     RELEASE SORT-MCLASS-RCD.
031000
031100     GO TO SORT-ACCT-LOOP.
031200 SAC-X.
031300     EXIT.
031400
031500*******************************************
031600*                                         *
031700*    O U T P U T   P R O C E D U R E      *
031800*          FOR   MCLASS                   *
031900*******************************************
032000
032100 WRITE-ACCT-REPORT SECTION.
032200 WRITE-ACCT-RPT.
025600
032300     IF PAPER-IS-132-COLS
032400         NEXT SENTENCE
032500     ELSE
032600         WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
032800     MOVE "N"    TO EOF-SW.
032800     MOVE SPACES TO ITEM-LINE-4.
           PERFORM MCLASS-PAGE-HDR.

032900 DO-AGAIN.
033000     PERFORM RETURN-MCLASS-RCD.
033100     IF EOF-SW = "Y"
033100         GO TO WAR-X.
033200     MOVE SORT-MCLASS-CLS   TO ITEM-AC.
033200     MOVE SORT-MCLASS-DESC  TO ITEM-DESC.
036500
036600     IF ITMS-PER-PAGE > 49
036600         PERFORM MCLASS-PAGE-HDR.
036600     IF ITEM-AC NOT = SPACES
033200         MOVE ITEM-LINE-4   TO PRINT-LINE
036700         PERFORM WRITE-MCLASS-LINE.
036800     GO TO DO-AGAIN.

038000 RETURN-MCLASS-RCD.
038100     RETURN SORT-MCLASS-FILE
038200         AT END MOVE "Y" TO EOF-SW.
038900
039000 WRITE-MCLASS-LINE.
039100     WRITE PRINT-RCD  AFTER ADVANCING 1 LINES.
039300     ADD 1 TO ITMS-PER-PAGE.
032800     MOVE SPACES TO ITEM-LINE-4.
039500
039600 MCLASS-PAGE-HDR.
039700     MOVE SPACES         TO PRINT-LINE.
039800     WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE.
039900     ADD 1               TO PG-CTR.
040000     MOVE PG-CTR         TO PRT-OVER-PG.
040100     MOVE REPORT-HEADER          TO PRINT-RCD.
040200     WRITE PRINT-RCD AFTER  ADVANCING 1 LINES.
040100     MOVE HDR-AC                 TO PRINT-RCD.
040200     WRITE PRINT-RCD AFTER  ADVANCING 1 LINES.
040300     MOVE 0 TO ITMS-PER-PAGE.
039700     MOVE SPACES         TO PRINT-LINE.

       WAR-X.
038300     EXIT.
047100
047200 END-OF-PROGRAM SECTION.
047300 END-OF-PGM-PAR.
