001200 IDENTIFICATION DIVISION.
001300 PROGRAM-ID.    TRPTVEN.
001400 AUTHOR.        VW DELUCA.
001500 DATE-WRITTEN.  FEBRUARY 1, 1985.
001600*INSTALLATION.  GOODYEAR TIRE AND RUBBER CO.
001700*
001800*REMARKS.       PURCHASE ORDER STATUS BY VENDOR CODE.
001900*
002000*               ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
002100*               MAY 8, 1985.     V.W.D.
002200*
002300*               REVISED PROGRAM TO PRINT A VENDOR DELIVERY SUMMARY
002400*               PAGE.  BOTH OPEN AND RECEIVED ITEMS ARE CATAGORIZED
002500*               BY THE DAYS BETWEEN PO-EXPECT-DATE (OR SHIP-DATE IF
002600*               EXPECT-DATE NA) AND THE DATE EACH ITEM IS RECEIVED.
002700*               AUG 20, 1985     V.W.D.
002800*
002900*
003000*
003100*                   ***  PREP WITH MAXDATA  ***.
003200*
003300*C 06/09/92  BK DISMUKES  REQUEST 6219
003300*C     1. ADDED LOGIC TO SELECT BY RECEIVING DEPARTMENT AND/OR
003300*C        A RANGE OF DATES IN 550-GET-PO-HEADER.
003300*C     2. ZRSCREEN/FCODE WAS CHANGED TO PICK UP NEW SELECTION
003300*C        CRITERIA.
003300*C
      *C 09/06/96  WL MCINTYRE  REQUEST 6623
      *C     MAKE REVISIONS FOR YEAR 2000 COMPATABILITY
      *C
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.    HP-3000.
003700 OBJECT-COMPUTER.    HP-3000.
003800 SPECIAL-NAMES. C01 IS NEW-PAGE.
004000
004100 INPUT-OUTPUT SECTION.
004200 FILE-CONTROL.
004300      SELECT PO-HEADER-FILE ASSIGN TO DISK-VENDOUT.
004500      SELECT ONLINE-PRT     ASSIGN TO PRINTER-MCPRT.
            SELECT DPOITEM
               ASSIGN TO DATABASE-MCFLCS1002
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
            SELECT DVENDOR
              ASSIGN TO DATABASE-MCFLCS0701
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
             SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0902
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
004600 DATA DIVISION.
004700 FILE SECTION.
004800 FD    ONLINE-PRT RECORD CONTAINS 132 CHARACTERS
004900       LABEL RECORD IS OMITTED
005000       DATA RECORD IS PRINT-REC.
005100 01    PRINT-REC                       PIC X(132).
005200
005300
005400 FD    PO-HEADER-FILE
005500        LABEL RECORD IS STANDARD.
005600 01    PO-HEAD-REC.
005700   05   PO-HEADER.
005800         10  PO-KEY-OUT                PIC X(14).
005900         10  PO-RCV-NO-OUT.
006000             15  PO-NO-OUT             PIC X(7).
006100             15  PO-RLSE-OUT           PIC X(3).
006200         10  PO-DATE-OUT               PIC X(6).
006300         10  PO-SHIP-DATE-OUT          PIC X(6).
006400         10  PO-EXPECT-DATE-OUT        PIC X(6).
006500
       FD  DPOITEM
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1002.

       FD  DVENDOR
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0902.

006600
006700 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X.
           05  FILE-STATUS-2          PIC X.
006800
006900 COPY TDATECHK IN COPYLIB.
007000 COPY SPOOLER IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
021600*----------  E S C A P E   S E Q U E N C E S
021700 01  COMPRESS-PRINT             PIC X(8).
021800 01  NORMAL-PRINT               PIC X(8).
021900 01  ESC-TEXT-61                PIC X(8).
022000 01  ESC-TEXT-60                PIC X(8).
022100
022200 COPY ESCNAM2 OF COPYLIB.
       COPY CCHKOBJ OF COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
007100
007200 77  BASE-WO                PIC X(20)
007300                              VALUE "  STORES.PUB.STORES;".
007400 77  DBOPEN-SW              PIC X        VALUE "N".
007500
007600
007700 01 LINE-CNTR               PIC 9(2)  VALUE 0.
007800 01 PG-COUNTER              PIC 9(4)  VALUE 1.
007900 01 ITEM-CNTR               PIC 9(4)  VALUE 0.

       01 SELECTION-VARS.
          05 CRITERIA-WORD        PIC 99    VALUE 0.
008100
       01 WORK-LOW-DATE.
          05  WL-CC               PIC X(2)  VALUE SPACES.
          05  WL-YMD              PIC X(6)  VALUE SPACES.
       01 WORK-HI-DATE.
          05  WH-CC               PIC X(2)  VALUE SPACES.
          05  WH-YMD              PIC X(6)  VALUE SPACES.
008200 01 TOT-PO-CNTR             PIC 9(4)       VALUE ZERO.
008300 01 TOT-ITEM-CNTR           PIC 9(5)       VALUE ZERO.
008400 01 TOT-ITEMS  REDEFINES  TOT-ITEM-CNTR.
008500    05  TOT-ITEMS-X         PIC X(5).
008600 01 ITEM-COST               PIC S9(8)V9(4)  VALUE ZERO.
008700 01 TOT-COST-ACCUM          PIC  9(10)V9(2) VALUE ZERO.
008800
008900 01 SUB-QTY-DLVRD           PIC S9(8)V9(4) VALUE 0.
009000 01 SUB-QTY-ORDERED         PIC S9(8)V9(4) VALUE 0.
009100 01 RET-CODE                PIC S9(4)  COMP-4.
009200 01 OPEN-ITEM-FLAG          PIC X.
009300 01 CALC-FLAG               PIC X.
009400 01 OVER-16-FLAG            PIC X.
009500 01 DAY-OF-YEAR-EXP         PIC S9(5)  VALUE ZERO.
009600 01 JUL-DAY-RCVD            PIC S9(5)  VALUE ZERO.
009700 01 DAYS-TO-RCV-ITM         PIC S9(5)  VALUE ZERO.
009800 01 YRS-DIFF                PIC S9(5)  VALUE ZERO.
009900 01 YR-DIFF-IN-DAYS         PIC S9(5)  VALUE ZERO.
010000 01 DAY-OF-YR-EXP           PIC S9(5)  VALUE ZERO.
010100
010200 01 DELIVERY-DAYS-9.
010300    05  N-DAYS-EARLY        PIC 9(4) VALUE ZERO.
010400    05  ZERO-DAYS-LATE      PIC 9(4) VALUE ZERO.
010500    05  1-3-DAYS-LATE       PIC 9(4) VALUE ZERO.
010600    05  4-7-DAYS-LATE       PIC 9(4) VALUE ZERO.
010700    05  8-15-DAYS-LATE      PIC 9(4) VALUE ZERO.
010800    05  OVER-15-DAYS-LATE   PIC 9(4) VALUE ZERO.
010900    05  PRTIAL-RECPT        PIC 9(4) VALUE ZERO.
011000    05  CMPLT-RECPTS        PIC 9(5) VALUE ZERO.
011100 01 DELIVERY-DAYS-X  REDEFINES DELIVERY-DAYS-9.
011200    05 SUM-EARLY            PIC X(4).
011300    05 SUM-ON-TIME          PIC X(4).
011400    05 SUM-1-3-LATE         PIC X(4).
011500    05 SUM-4-7-LATE         PIC X(4).
011600    05 SUM-8-15-LATE        PIC X(4).
011700    05 SUM-OVER-15          PIC X(4).
011800    05 SUM-PRTIAL-RECPT     PIC X(4).
011900    05 SUM-CMPLT-RECPTS     PIC X(5).
012000
014500 01  CUR-DATE2.
014600     05  YY                  PIC XX.
014700     05  MM                  PIC XX.
014800     05  DD                  PIC XX.
014900 01  CUR-DATE-9  REDEFINES  CUR-DATE2.
015000     05  YY-9                PIC 99.
015100     05  MM-9                PIC 99.
015200     05  DD-9                PIC 99.
012100 01 DECIMAL-RECEIPTS.
012200    05  DEC-EARLY           PIC 9V999 VALUE ZERO.
012300    05  DEC-ONTIME          PIC 9V999 VALUE ZERO.
012400    05  DEC-1-3-LATE        PIC 9V999 VALUE ZERO.
012500    05  DEC-4-7-LATE        PIC 9V999 VALUE ZERO.
012600    05  DEC-8-15-LATE       PIC 9V999 VALUE ZERO.
012700    05  DEC-OVER-15-LATE    PIC 9V999 VALUE ZERO.
012800    05  DEC-PRTIAL-RECPT    PIC 9V999 VALUE ZERO.
012900    05  DEC-CMPLT-RECPTS    PIC 9V999 VALUE ZERO.
013000 01 PERCENT-RECEIPTS.
013100    05  PCT-EARLY           PIC 999V9 VALUE ZERO.
013200    05  PCT-ONTIME          PIC 999V9 VALUE ZERO.
013300    05  PCT-1-3-LATE        PIC 999V9 VALUE ZERO.
013400    05  PCT-4-7-LATE        PIC 999V9 VALUE ZERO.
013500    05  PCT-8-15-LATE       PIC 999V9 VALUE ZERO.
013600    05  PCT-OVER-15-LATE    PIC 999V9 VALUE ZERO.
013700    05  PCT-PRTIAL-RECPT    PIC 999V9 VALUE ZERO.
013800    05  PCT-CMPLT-RECPTS    PIC 999V9 VALUE ZERO.
013900
014000 01 TOT-RECEIPTS-9.
014100    05 SUM-SHIPMENTS-9      PIC 9(5) VALUE ZERO.
014200 01 TOT-RECEIPTS-X  REDEFINES TOT-RECEIPTS-9.
014300    05 SUM-SHIPMENTS-X      PIC X(5).
014400
014500 01 OPEN-ITM-DAYS-9.
014600    05 NOT-DUE-OPEN         PIC 9(4) VALUE ZERO.
014700    05 1-3-OPEN             PIC 9(4) VALUE ZERO.
014800    05 4-7-OPEN             PIC 9(4) VALUE ZERO.
014900    05 8-15-OPEN            PIC 9(4) VALUE ZERO.
015000    05 OVER-15-OPEN         PIC 9(4) VALUE ZERO.
015100 01 OPEN-ITM-DAYS-X  REDEFINES OPEN-ITM-DAYS-9.
015200    05 TOT-NOT-DUE-OPEN     PIC X(4).
015300    05 TOT-1-3-OPEN         PIC X(4).
015400    05 TOT-4-7-OPEN         PIC X(4).
015500    05 TOT-8-15-OPEN        PIC X(4).
015600    05 TOT-OVER-15-OPEN     PIC X(4).
015700
015800 01 DECIMAL-OPENS.
015900    05 DEC-NOT-DUE-OPEN     PIC 9V999 VALUE ZERO.
016000    05 DEC-1-3-OPEN         PIC 9V999 VALUE ZERO.
016100    05 DEC-4-7-OPEN         PIC 9V999 VALUE ZERO.
016200    05 DEC-8-15-OPEN        PIC 9V999 VALUE ZERO.
016300    05 DEC-OVER-15-OPEN     PIC 9V999 VALUE ZERO.
016400 01 PERCENT-OPENS.
016500    05 PCT-NOT-DUE-OPEN     PIC 999V9 VALUE ZERO.
016600    05 PCT-1-3-OPEN         PIC 999V9 VALUE ZERO.
016700    05 PCT-4-7-OPEN         PIC 999V9 VALUE ZERO.
016800    05 PCT-8-15-OPEN        PIC 999V9 VALUE ZERO.
016900    05 PCT-OVER-15-OPEN     PIC 999V9 VALUE ZERO.
017000
017100 01 TOT-OPENS-9.
017200    05 TOT-OPEN-ITEMS-9     PIC 9(5) VALUE ZERO.
017300 01 TOT-OPENS-X  REDEFINES TOT-OPENS-9.
017400    05 TOT-OPEN-ITEMS-X     PIC X(5).
017500
017600 01 DECIMAL-SHIPMENTS.
017700    05 DEC-TOT-SHIP         PIC 9V999 VALUE ZERO.
017800 01 PERCENT-SHIPMENTS.
017900    05 PCT-SHIPPED          PIC 999V9 VALUE ZERO.
018000
018100 01 DECIMAL-OPEN.
018200    05 DEC-OPEN-ITEMS         PIC 9V999 VALUE ZERO.
018300 01 PERCENT-OPEN.
018400    05 PCT-OPEN               PIC 999V9 VALUE ZERO.
018500
018600 01 DAYS-TO-DLVR-ITM          PIC  S9(5) VALUE ZERO.
018700 01 DAYS-DEL-TIME-X  REDEFINES DAYS-TO-DLVR-ITM.
018800    05 DAYS-TO-DELIVER        PIC -(4)9.
018900
019000 01 JUL-SYS-DAY               PIC S9(5) VALUE ZERO.
019100 01 JUL-DAYS                  PIC S9(5) VALUE ZERO.

      *--------- PARAMETERS FOR "JULGREG" ROUTINE.
       01  JULGREG-PARMS.
           05  GREG-DATE.
               10  GREG-CC          PIC X(2).
               10  GREG-YMD.
                   15  GREG-YY      PIC X(2).
                   15  GREG-MM      PIC X(2).
                   15  GREG-DD      PIC X(2).
           05  JULIAN-DATE.
               10  JUL-CC           PIC X(2).
               10  JUL-YY           PIC X(2).
               10  JUL-DDD          PIC X(3).
           05  JULIAN-DATE-9  REDEFINES  JULIAN-DATE.
               10  JUL-CC-9         PIC 9(2).
               10  JUL-YY-9         PIC 9(2).
               10  JUL-DDD-9        PIC 9(3).
           05  DAY-DIGIT            PIC X.
           05  LEAP-YEAR-FLAG       PIC X.

019200
019300 01  DATE-WORK-AREA.
019400   03 EXPECT-DATE-X.
019500     05 EXPECT-YY             PIC XX.
019600     05 EXPECT-MM             PIC XX.
019700     05 EXPECT-DD             PIC XX.
019800   03 EXPECT-DATE-9  REDEFINES EXPECT-DATE-X.
019900     05 EXPECT-Y9             PIC 99.
020000     05 EXPECT-M9             PIC 99.
020100     05 EXPECT-D9             PIC 99.
020200   03 SHIP-DATE-X.
020300     05 SHIP-YY               PIC XX.
020400     05 SHIP-MM               PIC XX.
020500     05 SHIP-DD               PIC XX.
020600   03 SHIP-DATE-9  REDEFINES SHIP-DATE-X.
020700     05 SHIP-Y9               PIC 99.
020800     05 SHIP-M9               PIC 99.
020900     05 SHIP-D9               PIC 99.
021000   03 RECV-DATE-X.
021100     05 RCV-YY                PIC XX.
021200     05 RCV-MM                PIC XX.
021300     05 RCV-DD                PIC XX.
021400   03 RECV-DATE-9    REDEFINES RECV-DATE-X.
021500     05 RCV-Y9                PIC 99.
021600     05 RCV-M9                PIC 99.
021700     05 RCV-D9                PIC 99.
023100
023200 01 SYS-DATE-X.
023300    05 SYS-MM                 PIC XX.
023400    05 SLASH-1                PIC X.
023500    05 SYS-DD                 PIC XX.
023600    05 SLASH-2                PIC X.
023700    05 SYS-YY                 PIC XX.
023800 01 SYS-DATE-9  REDEFINES SYS-DATE-X.
023900    05 SYS-MM-9               PIC 99.
024000    05 SLASH-1                PIC X.
024100    05 SYS-DD-9               PIC 99.
024200    05 SLASH-2                PIC X.
024300    05 SYS-YY-9               PIC 99.
024400
024500 01 PRINT-AREA.
024600    05  CUR-DATE.
024700        10  FILLER                   PIC X(70)  VALUE SPACE.
024800        10  ACT-DATE                 PIC X(8).
024900    05  PAGE-NO.
025000        10  FILLER                   PIC X(69)  VALUE SPACE.
025100        10  PAGE-LABEL               PIC X(5)  VALUE "PAGE".
025200        10  PAGE-NUMBER              PIC ZZZ9  VALUE "   1".
025300    05 PRT-REPORT-TYPE.
025400        10  FILLER                   PIC X(2)  VALUE SPACE.
025500        10  REPORT-LABEL       PIC X(10) VALUE "REPORT OF ".
025600        10  REPORT-TYPE              PIC X(20).
          05 PRT-SEL-CRITERIA.
              10    FILLER                 PIC X(2) VALUE SPACES.
              10    FILLER                 PIC X(12)
                                               VALUE "DATING FROM ".
              10  PRT-LOW-DATE.
                  15  PRT-Y1               PIC XX   VALUE SPACES.
                  15    FILLER             PIC X    VALUE "/".
                  15  PRT-M1               PIC XX   VALUE SPACES.
                  15    FILLER             PIC X    VALUE "/".
                  15  PRT-D1               PIC XX   VALUE SPACES.
              10    FILLER                 PIC X(6) VALUE " THRU ".
              10  PRT-HI-DATE.
                  15  PRT-Y2               PIC XX   VALUE SPACES.
                  15    FILLER             PIC X    VALUE "/".
                  15  PRT-M2               PIC XX   VALUE SPACES.
                  15    FILLER             PIC X    VALUE "/".
                  15  PRT-D2               PIC XX   VALUE SPACES.
              10    FILLER                 PIC X(6) VALUE SPACES.
              10    FILLER                 PIC X(22)
                                       VALUE "RECEIVING DEPARTMENT: ".
              10  PRT-RCVDEPT1             PIC X(6) VALUE SPACES.
              10    FILLER                 PIC X(2) VALUE SPACES.
              10  PRT-RCVDEPT2             PIC X(6) VALUE SPACES.
              10    FILLER                 PIC X(2) VALUE SPACES.
              10  PRT-RCVDEPT3             PIC X(6) VALUE SPACES.
025700    05  PRT-VENDOR-CODE.
025800        10  FILLER                   PIC X(2)  VALUE SPACE.
025900        10  VEN-CODE-LABEL       PIC X(10) VALUE "VEN CODE:".
026000        10  PRT-VEND-CODE            PIC X(10)  VALUE SPACE.
026100    05  PRT-VENDOR.
026200        10  FILLER                   PIC X(2)  VALUE SPACE.
026300        10  VEN-LABEL           PIC X(10)  VALUE "VENDOR:".
026400        10  PRT-VEN-NAME             PIC X(44)  VALUE SPACE.
026500    05  PRT-VEN-STR.
026600        10  FILLER                   PIC X(2)  VALUE SPACE.
026700        10  STREET-LABEL        PIC X(10)  VALUE "ADDRESS:".
026800        10  PRT-VEN-STREET           PIC X(44)  VALUE SPACE.
026900    05  PRT-CITY-ST-ZIP.
027000        10  FILLER                   PIC X(2)  VALUE SPACE.
027100        10  CITY-LABEL               PIC X(10)  VALUE SPACE.
027200        10  PRT-VEN-CITY             PIC X(24)  VALUE SPACE.
027300        10  PRT-VEN-STATE-CODE       PIC X(2)   VALUE SPACE.
027400        10  PRT-VEN-PROV-CODE        PIC X(4)   VALUE SPACE.
027500        10  PRT-VEN-ZIP              PIC X(9)   VALUE SPACE.
027600        10  PRT-VEN-ACTIVITY-DTE     PIC X(6)   VALUE SPACE.
027700        10  PRT-VEN-COUNTRY          PIC X(18)  VALUE SPACE.
027800    05  PRT-CONTACT.
027900        10  FILLER                   PIC X(2) VALUE SPACE.
028000        10  CONTACT-LABEL       PIC X(10)  VALUE "CONTACT:".
028100        10  PRT-VEN-CONTACT          PIC X(34)  VALUE SPACE.
028200    05  PRT-PHONE.
028300        10  FILLER                   PIC X(2) VALUE SPACE.
028400        10  PHONE-LABEL         PIC X(10)  VALUE "PHONE:".
028500        10  PRT-VEN-CONTACT-PHONE    PIC X(10)  VALUE SPACE.
028600    05  PRT-NOTE.
028700        10  FILLER                   PIC XX  VALUE SPACE.
028800        10  PRT-NOTE-1               PIC X(30) VALUE
028900                       "'*' DENOTES OPEN ITEMS 15 DAYS".
029000        10  PRT-NOTE-2               PIC X(25) VALUE
029100                             " PAST SHIP OR EXPECT DATE".
029200    05  PRT-SUBHEAD-01.
029300        10  FILLER           PIC X(2)  VALUE SPACE.
029400        10  PO-NO-LABL       PIC X(16)  VALUE "PO NUMBER".
029500        10  PO-DATE-LABL     PIC X(12)  VALUE "PO DATE".
029600        10  SHIP-DT-LABL     PIC X(12)  VALUE "SHIP DATE".
029700        10  EXPT-DT-LABL     PIC X(12)  VALUE "EXPECT DATE".
029800    05  PRT-PO-HEADER.
029900        10  FILLER                   PIC XX    VALUE SPACE.
030000        10  PRT-PO-NO                PIC X(7)  VALUE SPACE.
030100        10  PRT-PO-RLSE              PIC X(3)  VALUE SPACE.
030200        10  FILLER                   PIC X(6)  VALUE SPACE.
030300        10  PRT-PO-DATE              PIC X(8).
030400        10  FILLER                   PIC X(4).
030500        10  PRT-PO-SHIP-DATE         PIC X(8).
030600        10  FILLER                   PIC X(4).
030700        10  PRT-PO-EXPECT-DATE       PIC X(8).
030800        10  FILLER                   PIC XXX VALUE SPACE.
030900        10  PRT-S-TOT-PO             PIC Z(4)9.
031000    05  PRT-SUBHEAD-02.
031100        10  FILLER                   PIC X(2)  VALUE SPACE.
031200        10  CRP-CODE-LABL      PIC X(9)  VALUE "CORP CODE".
031300        10  FILLER                   PIC X(4)  VALUE SPACE.
031400        10  ITM-NO-LABL        PIC X(4)  VALUE "ITEM".
031500        10  FILLER                   PIC X(8)  VALUE SPACE.
031600        10  QTY-ORD-LABL       PIC X(7)  VALUE "ORDERED".
031700        10  FILLER                   PIC X(8)  VALUE SPACE.
031800        10  QTY-DLVR-LABL      PIC X(9)  VALUE "DELIVERED".
031900        10  FILLER                   PIC X(7)  VALUE SPACE.
032000        10  QTY-OPEN-LABL      PIC X(10) VALUE "UNITS OPEN".
032100        10  FILLER                   PIC X(3)  VALUE SPACE.
032200        10  DATE-RCVD-LABL        PIC X(9) VALUE "RECEIVED".
032300    05  PRT-STR-PO-ITEMS.
032400        10  FILLER                   PIC X(2)  VALUE SPACE.
032500        10  PRT-CORP-CODE            PIC X(9)  VALUE SPACE.
032600        10  FILLER                   PIC X(4)  VALUE SPACE.
032700        10  PRT-ITM-NO               PIC X(4)  VALUE SPACE.
032800        10  FILLER                   PIC X(2)  VALUE SPACE.
032900        10  PRT-ITM-QTY-ORD     PIC Z(7)9.9(4) VALUE ZERO.
033000        10  FILLER                   PIC X     VALUE SPACE.
033100        10  PRT-STR-ITM-UM           PIC XX    VALUE SPACE.
033200        10  FILLER                   PIC X     VALUE SPACE.
033300        10  PRT-ITM-QTY-DLVR    PIC Z(7)9.9(4)  VALUE ZERO.
033400        10  FILLER                   PIC X      VALUE SPACE.
033500        10  PRT-STR-PRICE-UM         PIC XX     VALUE SPACE.
033600        10  FILLER                   PIC X      VALUE SPACE.
033700        10  PRT-AMT-OPEN        PIC Z(8).Z(4)   VALUE ZERO.
033800        10  FILLER                   PIC X     VALUE SPACE.
033900        10  PRT-S-OPN-OVR-15         PIC X.
034000        10  FILLER                   PIC X      VALUE SPACE.
034100        10  PRT-STR-RCVD             PIC X(8).
034200    05  PRT-REQUIREMENT-ORDERS.
034300        10  FILLER                PIC X(2)  VALUE SPACE.
034400        10  PRT-REQM-CORP-CODE    PIC X(9)  VALUE SPACE.
034500        10  FILLER                PIC X(4)  VALUE SPACE.
034600        10  PRT-REQM-ITEM-NO      PIC X(4)  VALUE SPACE.
034700        10  FILLER                PIC X(2)  VALUE SPACE.
034800        10  PRT-REQM-PRICE           PIC Z(10)9.9(4).
034900        10  FILLER                   PIC X     VALUE SPACE.
035000        10  PRT-REQM-PRICE-UM        PIC XX    VALUE SPACE.
035100        10  FILLER                   PIC X(5)  VALUE SPACE.
035200        10  PRT-REQM-RCVD            PIC X(8).
035300
035400    05  PRT-SUM-L0.
035500        10  FILLER                   PIC X(22) VALUE SPACE.
035600        10  PRT-SUM-HEADER           PIC X(38) VALUE
035700                           "VENDOR DELIVERY PERFORMANCE SUMMARY".
035800    05  PRT-SUM-TYPE.
035900        10 FILLER                    PIC X(19) VALUE SPACE.
036000        10 TYPE-LABL                 PIC X(44) VALUE SPACE.
036100    05  PRT-SUM-L00.
036200        10  FILLER                   PIC X(22) VALUE SPACE.
036300        10  TOT-ITM-LABL             PIC X(12) VALUE
036400                                     "TOTAL P0s:".
036500        10 FILLER                   PIC X(9)  VALUE SPACE.
036600        10  PRT-TOT-POS              PIC Z(4)9.
036700    05  PRT-SUM-L0A.
036800        10  FILLER                   PIC X(22) VALUE SPACE.
036900        10  TOT-ITM-LABL             PIC X(12) VALUE
037000                                     "TOTAL ITEMS:".
037100        10 FILLER                   PIC X(9)  VALUE SPACE.
037200        10  PRT-TOT-ITEMS            PIC Z(4)9.
037300    05  PRT-SUM-L0B.
037400        10  FILLER                   PIC X(22) VALUE SPACE.
037500        10  TOT-COST-LABL            PIC X(11) VALUE
037600                                     "TOTAL COST:".
037700        10  PRT-TOT-COST           PIC $$$,$$$,$$$,$$$.99.
037800    05  PRT-SUM-L0C.
037900        10  FILLER                   PIC X(22) VALUE SPACE.
038000        10  PRT-SUM-HEADER-2         PIC X(26) VALUE
038100              "BREAKDOWN OF PO RECEIPTS".
038200    05  PRT-SUM-L1.
038300        10  FILLER                   PIC X(22) VALUE SPACE.
038400        10  EARLY-LABL               PIC X(20) VALUE
038500                         "EARLY: ".
038600        10  FILLER                   PIC X(4)  VALUE SPACE.
038700        10  PRT-EARLY                PIC Z(4)9.
038800        10  FILLER                   PIC X(3) VALUE SPACE.
038900        10  PRT-PCT-EARLY            PIC ZZ9.9.
039000        10  FILLER                   PIC XX VALUE " %".
039100    05  PRT-SUM-L2.
039200        10  FILLER                   PIC X(22) VALUE SPACE.
039300        10  ON-TIME-LABL             PIC X(20) VALUE
039400                       "ON TIME: ".
039500        10  FILLER                   PIC X(4)  VALUE SPACE.
039600        10  PRT-ON-TIME              PIC Z(4)9.
039700        10  FILLER                    PIC X(3) VALUE SPACE.
039800        10  PRT-PCT-ONTIME            PIC ZZ9.9.
039900        10  FILLER                   PIC XX VALUE " %".
040000    05  PRT-SUM-L3.
040100        10  FILLER                   PIC X(22) VALUE SPACE.
040200        10  1-3-LABL                 PIC X(20) VALUE
040300            "1-3 DAYS LATE: ".
040400        10  FILLER                   PIC X(4) VALUE SPACE.
040500        10  PRT-1-3-LATE             PIC Z(4)9.
040600        10  FILLER                   PIC X(3)  VALUE SPACE.
040700        10  PRT-PCT-1-3              PIC ZZ9.9.
040800        10  FILLER                   PIC XX VALUE " %".
040900    05  PRT-SUM-L4.
041000        10  FILLER                   PIC X(22) VALUE SPACE.
041100        10  4-7-LABL                 PIC X(20) VALUE
041200            "4-7 DAYS LATE: ".
041300        10  FILLER                   PIC X(4)  VALUE SPACE.
041400        10  PRT-4-7-LATE             PIC Z(4)9.
041500        10  FILLER                   PIC X(3)  VALUE SPACE.
041600        10  PRT-PCT-4-7              PIC ZZ9.9.
041700        10  FILLER                   PIC XX VALUE " %".
041800    05  PRT-SUM-L5.
041900        10  FILLER                   PIC X(22) VALUE SPACE.
042000        10  8-15-LABL                PIC X(20) VALUE
042100            "8-15 DAYS LATE: ".
042200        10  FILLER                   PIC X(4)  VALUE SPACE.
042300        10  PRT-8-15-LATE            PIC Z(4)9.
042400        10  FILLER                   PIC X(3)  VALUE SPACE.
042500        10  PRT-PCT-8-15             PIC ZZ9.9.
042600        10  FILLER                   PIC XX VALUE " %".
042700    05  PRT-SUM-L6.
042800        10  FILLER                   PIC X(22) VALUE SPACE.
042900        10  OVER-15-LABL             PIC X(20) VALUE
043000            "OVER 15 DAYS LATE: ".
043100        10  FILLER                   PIC X(4) VALUE SPACE.
043200        10  PRT-OVER-15-LATE         PIC Z(4)9.
043300        10  FILLER                   PIC X(3) VALUE SPACE.
043400        10  PRT-PCT-OVER-15          PIC ZZ9.9.
043500        10  FILLER                   PIC XX VALUE " %".
043600    05  PRT-SUM-L7.
043700        10  FILLER                   PIC X(23) VALUE SPACE.
043800        10  PRTIAL-LABL              PIC X(20) VALUE
043900            "PARTIAL RECEIPTS:".
044000        10  PRT-PRTIAL-RECPT         PIC Z(4)9.
044100        10  FILLER                   PIC X(6)  VALUE SPACE.
044200        10  PRT-PCT-PRTIAL           PIC ZZ9.9.
044300        10  FILLER                   PIC XX VALUE " %".
044400    05  PRT-SUM-L8.
044500        10  FILLER                   PIC X(23) VALUE SPACE.
044600        10  CMPLT-LABL               PIC X(20) VALUE
044700            "COMPLETED RECEIPTS:".
044800        10  PRT-CMPLT-RECPTS         PIC Z(4)9.
044900        10  FILLER                   PIC X(6) VALUE SPACE.
045000        10  PRT-PCT-CMPLT            PIC ZZ9.9.
045100        10  FILLER                   PIC XX VALUE " %".
045200    05  PRT-SUM-L9.
045300        10  FILLER                   PIC X(22) VALUE SPACE.
045400        10  TOTAL-SHIP-LABL          PIC X(20) VALUE
045500                 "TOTAL RECEIPTS: ".
045600        10  FILLER                   PIC X(4)  VALUE SPACE.
045700        10  PRT-TOTAL-SHIPMENTS      PIC Z(4)9.
045800        10  FILLER                   PIC X(3) VALUE SPACE.
045900        10 PRT-PCT-SHIPPED           PIC ZZ9.9.
046000        10 FILLER                    PIC XX VALUE " %".
046100
046200
046300    05  PRT-SUM-O0A.
046400        10  FILLER                   PIC X(22) VALUE SPACE.
046500        10  PRT-SUM-HEADER-2         PIC X(26) VALUE
046600              "BREAKDOWN OF OPEN POs".
046700    05  PRT-SUM-O2.
046800        10  FILLER                   PIC X(22) VALUE SPACE.
046900        10  NOT-DUE-LABL             PIC X(20) VALUE
047000            "OPEN NOT DUE: ".
047100        10  FILLER                   PIC X(4)  VALUE SPACE.
047200        10  PRT-NOT-DUE-OPEN         PIC Z(4)9.
047300        10  FILLER                   PIC X(3)  VALUE SPACE.
047400        10  PRT-PCT-NOT-DUE-OPEN     PIC ZZ9.9.
047500        10  FILLER                   PIC XX VALUE " %".
047600    05  PRT-SUM-O3.
047700        10  FILLER                   PIC X(22) VALUE SPACE.
047800        10  1-3-LABL                 PIC X(20) VALUE
047900            "1-3 DAYS LATE: ".
048000        10  FILLER                   PIC X(4)  VALUE SPACE.
048100        10  PRT-1-3-OPEN             PIC Z(4)9.
048200        10  FILLER                   PIC X(3)  VALUE SPACE.
048300        10  PRT-PCT-1-3-OPEN         PIC ZZ9.9.
048400        10  FILLER                   PIC XX VALUE " %".
048500    05  PRT-SUM-O4.
048600        10  FILLER                   PIC X(22) VALUE SPACE.
048700        10  4-7-LABL                 PIC X(20) VALUE
048800            "4-7 DAYS LATE: ".
048900        10  FILLER                   PIC X(4)  VALUE SPACE.
049000        10  PRT-4-7-OPEN             PIC Z(4)9.
049100        10  FILLER                   PIC X(3)  VALUE SPACE.
049200        10  PRT-PCT-4-7-OPEN         PIC ZZ9.9.
049300        10  FILLER                   PIC XX VALUE " %".
049400    05  PRT-SUM-O5.
049500        10  FILLER                   PIC X(22) VALUE SPACE.
049600        10  8-15-LABL                PIC X(20) VALUE
049700            "8-15 DAYS LATE: ".
049800        10  FILLER                   PIC X(4)  VALUE SPACE.
049900        10  PRT-8-15-OPEN            PIC Z(4)9.
050000        10  FILLER                   PIC X(3)  VALUE SPACE.
050100        10  PRT-PCT-8-15-OPEN        PIC ZZ9.9.
050200        10  FILLER                   PIC XX VALUE " %".
050300    05  PRT-SUM-O6.
050400        10  FILLER                   PIC X(22) VALUE SPACE.
050500        10  OVER-15-LABL             PIC X(20) VALUE
050600            "OVER 15 DAYS LATE: ".
050700        10  FILLER                   PIC X(4)  VALUE SPACE.
050800        10  PRT-OVER-15-OPEN         PIC Z(4)9.
050900        10  FILLER                   PIC X(3) VALUE SPACE.
051000        10  PRT-PCT-OVER-15-OPEN     PIC ZZ9.9.
051100        10  FILLER                   PIC XX VALUE " %".
051200    05  PRT-SUM-O7.
051300        10  FILLER                   PIC X(22) VALUE SPACE.
051400        10  TOTAL-SHIP-LABL          PIC X(20) VALUE
051500                 "TOTAL ITEMS OPEN:".
051600        10  FILLER                   PIC X(4)  VALUE SPACE.
051700        10  PRT-TOTAL-OPENS          PIC ZZZZ9.
051800        10  FILLER                   PIC X(3) VALUE SPACE.
051900        10  PRT-PCT-OPEN             PIC ZZ9.9.
052000        10  FILLER                   PIC XX VALUE " %".
052100
052200*************************************************************
052300**                                                          **
052400**          C O M M U N I C A T I O N S   A R E A S         **
052500**                                                          **
052600**************************************************************
052700
052800 COPY THDPRTA OF COPYLIB.
053700
053800*************************************************************
053900**                                                         **
054000**  D A T A B A S E   C O M M U N I C A T I O N   A R E A  **
054100**                                                         **
054200*************************************************************
054300
054400 COPY DATAB IN COPYLIB.
054500
055200
055800 01  ARGUMENT-VALUES.
055900     05  PLT-ARG               PIC X(4)     VALUE SPACE.
056000     05  PO-ARG                PIC X(14)    VALUE SPACE.
056100     05  VEN-ARG               PIC X(10)    VALUE SPACE.
056200
056300
056400*************************************************************
056500**                                                         **
056600**             D A T A B A S E   B U F F E R S             **
056700**                                                         **
056800*************************************************************
056900
057000 COPY DPOITEM IN COPYLIB.
057100
057200 COPY DVENDOR IN COPYLIB.
057300
057400 COPY DPORECD IN COPYLIB.
057500
057600 LINKAGE SECTION.
057700 COPY THDPRTB OF COPYLIB.
022000 01 SCREEN-INPUT.
022100     05  MERCHANT             PIC X(10).
022200     05  O-A-R-OPTION         PIC X.
           05  LOW-DATE.
               10  Y1               PIC XX.
               10  M1               PIC XX.
               10  D1               PIC XX.
           05  HI-DATE.
               10  Y2               PIC XX.
               10  M2               PIC XX.
               10  D2               PIC XX.
           05  RCVDEPT1             PIC X(6).
           05  RCVDEPT2             PIC X(6).
           05  RCVDEPT3             PIC X(6).
022300     05     FILLER            PIC X(39).
057800
057900 PROCEDURE DIVISION USING HD-ROUTE-DATA SCREEN-INPUT.
058000
058100 100-INPUT-AND-PASS-TO-XRSCREEN.

      *-----  IF DATE(S) PASSED TO PROGRAM ARE NUMERIC, THEN DETERMINE
      *-----  CENTURY AND FORMAT IN CYMD FORMAT, ELSE MOVE SPACES

           IF LOW-DATE NUMERIC
              MOVE LOW-DATE TO WL-YMD
              IF Y1 > "70"
                 MOVE "19" TO WL-CC
              ELSE
                 MOVE "20" TO WL-CC
           ELSE
              MOVE SPACES  TO WORK-LOW-DATE.
           IF HI-DATE NUMERIC
              MOVE HI-DATE TO WH-YMD
              IF Y2 > "70"
                 MOVE "19" TO WH-CC
              ELSE
                 MOVE "20" TO WH-CC
           ELSE
              MOVE SPACES  TO WORK-HI-DATE.

           MOVE MERCHANT TO VEN-ARG, PRT-VEND-CODE.
059200     IF O-A-R-OPTION = "O"
059300       MOVE "OPEN PURCHASE ORDERS" TO REPORT-TYPE
059400     ELSE
059500          IF O-A-R-OPTION = "A"
059600            MOVE "ALL PURCHASE ORDERS" TO REPORT-TYPE
059700     ELSE
059800          IF O-A-R-OPTION = "R"
059900            MOVE SPACES TO PRT-NOTE-1, PRT-NOTE-2
060000            MOVE "REQUIREMENT ORDERS" TO REPORT-TYPE.
060100
060200 175-REPORT-DATE.
060300       MOVE 1 TO DATE-MODE.
060400       CALL "TDATECHK" USING DATE-CHECK-AREA.
060500       MOVE DATE-SLASH-OUT TO ACT-DATE, SYS-DATE-X.
060600       MOVE DATE-YMD-OUT TO CUR-DATE2.
060700
       180-SET-UP-SELECTION-CRITERIA.
             MOVE Y1            TO PRT-Y1.
             MOVE M1            TO PRT-M1.
             MOVE D1            TO PRT-D1.
             MOVE Y2            TO PRT-Y2.
             MOVE M2            TO PRT-M2.
             MOVE D2            TO PRT-D2.
             MOVE RCVDEPT1      TO PRT-RCVDEPT1.
             MOVE RCVDEPT2      TO PRT-RCVDEPT2.
             MOVE RCVDEPT3      TO PRT-RCVDEPT3.


060800 200-OPEN-FILES-DBASE.
061800
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'VENDOUT'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "VENDOUT"     TO CCRTFILE-FILE.
           MOVE "0043"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "99"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
              DISPLAY "CCRTFILE CREATE OF 'VENDOUT' FAILED"
              GO TO 2000-BLOWUP.

033300*----------  PRINT HEADER PAGE
078400*----------  OPEN OUTPUT FILE
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
021100     OPEN OUTPUT ONLINE-PRT.
033500     MOVE "DHDRPT6.PUB" TO HD-FILE-NAME.
033600     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME,
033700        FNUM, HD-ROUTE-DATA, ESC-NAME.
033800     IF PAPER-IS-132-COLS
033900          NEXT SENTENCE
034000     ELSE
034100         WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
034200         WRITE PRINT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
034300     IF HD-RET-CODE NOT = 0
034400         DISPLAY "THDRPT ERROR".
062000       OPEN OUTPUT PO-HEADER-FILE.
062300
062400       MOVE 1 TO RET-CODE.
062500
063200      OPEN INPUT DVENDOR DPORECD DPOITEM.
063700 300-FIND-VENDOR.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDOR-REC.
           START DVENDOR KEY = VENCDE OF DVENDOR-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
064000
064100         IF COND-WORD NOT EQUAL ZERO
064300             MOVE "*** VENDOR CODE DOES NOT EXIST ***"
064400               TO PRT-VEN-NAME
064500             PERFORM 880-START-PRINT
064600             PERFORM 900-CLOSE-ALL.
065000
065100 400-GET-VENDOR.
           MOVE 0 TO COND-WORD.
           READ DVENDOR NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDOR-REC NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
065400
065900         IF NOT GOOD-CALL
066000            GO TO 400-GET-VENDOR-X.
066100
066200
066300          IF VEN-ITM-NO = 0
066400             MOVE VEN-NAME           TO PRT-VEN-NAME.
066500
066600          IF VEN-ITM-NO = 1
066700             MOVE VEN-ADDRESS        TO PRT-VEN-STREET.
066800
066900          IF VEN-ITM-NO = 7
067000             MOVE VEN-STATE-CODE     TO PRT-VEN-STATE-CODE
067100             MOVE VEN-CITY           TO PRT-VEN-CITY
067200             MOVE VEN-PROV-CODE      TO PRT-VEN-PROV-CODE
067300             MOVE VEN-ZIP            TO PRT-VEN-ZIP.
067400
067500          IF VEN-ITM-NO = 8
067600             MOVE VEN-COUNTRY        TO PRT-VEN-COUNTRY.
067700
067800          IF VEN-ITM-NO = 9
067900             MOVE VEN-CONTACT        TO PRT-VEN-CONTACT
068000             MOVE VEN-CONTACT-PHONE  TO PRT-VEN-CONTACT-PHONE.
068100
068200       GO TO 400-GET-VENDOR.
068300
068400 400-GET-VENDOR-X.
068500       EXIT.
068600
068700 500-FIND-PO-HEADER.
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DPORECD-REC.
           START DPORECD KEY = VENCDE OF DPORECD-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
069300
069400 550-GET-PO-HEADER.
           MOVE 0 TO COND-WORD.
           READ DPORECD NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DPORECD-REC NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
070200
070300     IF END-OF-CHAIN
               PERFORM 880-START-PRINT
               GO TO   700-READ-FILE
           ELSE
               IF GOOD-CALL
                   PERFORM 575-CHECK-CRITERIA THRU 575-CC-EXIT
                   IF CRITERIA-WORD = 15
                      MOVE 0 TO CRITERIA-WORD
                      GO TO 550-GET-PO-HEADER
070200             ELSE
                      NEXT SENTENCE
               ELSE
070500             GO TO   2000-BLOWUP.
070600
070700
070800           MOVE PO-RCV-NO       TO  PO-ARG, PO-KEY-OUT.
070900           MOVE PO-PO-NO        TO  PO-NO-OUT.
071000           MOVE PO-RLS-NO       TO  PO-RLSE-OUT.
071100           MOVE PO-DATE         TO  PO-DATE-OUT.
                 IF PO-SHIP-DATE = "AS REL" OR "BELOW "
                         OR "REC'D "
                     MOVE PO-DATE     TO  PO-SHIP-DATE-OUT
                                          PO-SHIP-DATE
                 ELSE
071200           MOVE PO-SHIP-DATE    TO  PO-SHIP-DATE-OUT.
071300           MOVE PO-EXPECT-DATE  TO  PO-EXPECT-DATE-OUT.
071400
071500       IF O-A-R-OPTION EQUAL "O"
071600           PERFORM 600-FIND-STR-OPEN-ITEMS
071700                      THRU 600-EXIT
071800            PERFORM 625-GET-STR-OPEN-ITEMS
071900                      THRU 625-EXIT UNTIL END-OF-CHAIN
072000             PERFORM 690-WRITE-OPEN-PO-HEADERS THRU 690-EXIT
072100              GO TO   550-GET-PO-HEADER
072200       ELSE
072300            WRITE PO-HEAD-REC
072400             GO TO 550-GET-PO-HEADER.
072500
093000 575-CHECK-CRITERIA.
070200     IF CRITERIA-WORD = 0
070200         IF SPACES = RCVDEPT1 AND
070200                     RCVDEPT2 AND
070200                     RCVDEPT3
070200             NEXT SENTENCE
070200         ELSE
070200             IF PO-RCV-DEPT = RCVDEPT1 OR
070200                              RCVDEPT2 OR
070200                              RCVDEPT3
070200                 NEXT SENTENCE
070200             ELSE
070200                 MOVE 15 TO CRITERIA-WORD.
070200
070200     IF CRITERIA-WORD = 0
070200         IF LOW-DATE = SPACES
070200             IF HI-DATE = SPACES
070200                 NEXT SENTENCE
070200             ELSE
070200                 IF PO-DATE-CN <= WORK-HI-DATE
070200                     NEXT SENTENCE
070200                 ELSE
070200                     MOVE 15 TO CRITERIA-WORD
070200         ELSE
070200             IF HI-DATE = SPACES
070200                 IF PO-DATE-CN >= WORK-LOW-DATE
070200                     NEXT SENTENCE
070200                 ELSE
070200                     MOVE 15 TO CRITERIA-WORD
070200             ELSE
070200                 IF (PO-DATE-CN >= WORK-LOW-DATE)
                     AND
070200                    (PO-DATE-CN <= WORK-HI-DATE)
070200                     NEXT SENTENCE
070200                 ELSE
070200                     MOVE 15 TO CRITERIA-WORD.

       575-CC-EXIT.
           EXIT.

072600
072700 600-FIND-STR-OPEN-ITEMS.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
073000
073400 600-EXIT.
073500      EXIT.
073600
073700 625-GET-STR-OPEN-ITEMS.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 15 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
074200
074800          IF ITM-QTY-DLVR LESS THAN ITM-QTY-ORD
074900            MOVE "X" TO OPEN-ITEM-FLAG.
075000
075100 625-EXIT.
075200      EXIT.
075300
075400 690-WRITE-OPEN-PO-HEADERS.
075500        IF OPEN-ITEM-FLAG = "X"
075600          WRITE PO-HEAD-REC
075700          MOVE SPACE TO OPEN-ITEM-FLAG.
075800 690-EXIT.
075900        EXIT.
076000
076100*---------- END OF WRITE PO HEADER FILE ROUTINE.
076200
076300
076400*---------- START OF READ PO HEADER FILE ROUTINE.
076500
076600 700-READ-FILE.
076700       READ PO-HEADER-FILE; AT END
076800                               PERFORM 1300-SUMMARY-PAGE
076900                                       THRU 1300-EXIT
077000                               GO TO 900-CLOSE-ALL.
077100
077200     MOVE PO-KEY-OUT         TO PO-ARG.
077300     MOVE PO-NO-OUT          TO PRT-PO-NO.
077400     MOVE PO-RLSE-OUT        TO PRT-PO-RLSE.
077500     MOVE 4 TO DATE-MODE.
077600     IF PO-DATE-OUT NOT NUMERIC
077700       MOVE SPACES TO PRT-PO-DATE
077800     ELSE
077900       MOVE PO-DATE-OUT TO DATE-VALIDATE-IN
078000       CALL "TDATECHK" USING DATE-CHECK-AREA
078100       MOVE DATE-SLASH-OUT TO PRT-PO-DATE.
078200     IF PO-SHIP-DATE-OUT NOT NUMERIC
078300       MOVE SPACES TO PRT-PO-SHIP-DATE
078400     ELSE
078500       MOVE PO-SHIP-DATE-OUT TO DATE-VALIDATE-IN
078600       CALL "TDATECHK" USING DATE-CHECK-AREA
078700       MOVE DATE-SLASH-OUT TO PRT-PO-SHIP-DATE.
078800     IF PO-EXPECT-DATE-OUT NOT NUMERIC
078900       MOVE SPACES TO PRT-PO-EXPECT-DATE
079000     ELSE
079100       MOVE PO-EXPECT-DATE-OUT TO DATE-VALIDATE-IN
079200       CALL "TDATECHK" USING DATE-CHECK-AREA
079300       MOVE DATE-SLASH-OUT TO PRT-PO-EXPECT-DATE.
079400     MOVE 0 TO ITEM-CNTR.
079500
079600*------ CALCULATE TODAYS JULIAN DAY.
079700 725-CURRENT-JUL-SYS-DAY.
           MOVE SPACES          TO JULGREG-PARMS.
           MOVE CUR-DATE2       TO GREG-YMD.
           IF GREG-YY > "70"
              MOVE "19"         TO GREG-CC
           ELSE
              MOVE "20"         TO GREG-CC.
           CALL "JULGREG"  USING GREG-DATE, JULIAN-DATE,
                                 DAY-DIGIT, LEAP-YEAR-FLAG.
           MOVE JUL-DDD         TO JUL-SYS-DAY.
080700
080800*------ IF AVAILABLE, CALCULATE JULIAN DAY OF EXPECT OR SHIP DATE.
080900*------ IF NOT AVAILABLE, PO WILL BE INCLUDED IN TOTALS FOR
081000*------ TOTAL POs AND TOTAL ITEMs BUT WILL NOT BE CATAGORIZED.
081100 750-CALC-JULIAN-PO-DATE.
081200     IF PO-EXPECT-DATE-OUT NOT NUMERIC OR
              PO-EXPECT-DATE-OUT = "000000"
081300       MOVE SPACES TO EXPECT-DATE-X
081400         IF PO-SHIP-DATE-OUT NOT NUMERIC OR
                  PO-SHIP-DATE-OUT = "000000"
081500              MOVE SPACES TO SHIP-DATE-X
081600              MOVE "X" TO CALC-FLAG
081700         ELSE
081800              MOVE PO-SHIP-DATE-OUT      TO  SHIP-DATE-X
                    MOVE SPACES                TO JULGREG-PARMS
                    IF SHIP-YY > "70"
                       MOVE "19"               TO GREG-CC
                    ELSE
                       MOVE "20"               TO GREG-CC
                    END-IF
                    MOVE SHIP-DATE-X           TO GREG-YMD
                    CALL "JULGREG"  USING GREG-DATE, JULIAN-DATE,
                                          DAY-DIGIT, LEAP-YEAR-FLAG
                    MOVE JUL-DDD  TO DAY-OF-YR-EXP
082700              MOVE SPACE TO CALC-FLAG
082800     ELSE
082900         MOVE PO-EXPECT-DATE-OUT TO  EXPECT-DATE-X
               MOVE SPACES TO JULGREG-PARMS
               IF EXPECT-YY > "70"
                  MOVE "19"            TO  GREG-CC
               ELSE
                  MOVE "20"            TO  GREG-CC
               END-IF
               MOVE EXPECT-DATE-X      TO  GREG-YMD
               CALL "JULGREG"  USING GREG-DATE, JULIAN-DATE,
                                     DAY-DIGIT, LEAP-YEAR-FLAG
083700         MOVE JUL-DDD            TO  DAY-OF-YR-EXP
083800         MOVE SPACE TO CALC-FLAG.
083900
084000
084100 800-FIND-PO-ITEM-CHAINS.
           MOVE 0 TO COND-WORD.
           MOVE PO-ARG TO PORCVNO OF DPOITEM-REC.
           START DPOITEM KEY = PORCVNO OF DPOITEM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
084400
085000 825-GET-STR-ITEMS.
           MOVE 0 TO COND-WORD.
           READ DPOITEM NEXT INTO BUF-DPOITEM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF PORCVNO OF DPOITEM-REC NOT = PO-ARG
               MOVE 15 TO COND-WORD.
085500
085700     IF NOT GOOD-CALL
086100        GO TO 700-READ-FILE.

086400        ADD 1 TO LINE-CNTR.
086500
086600        MULTIPLY ITM-UNIT-PRICE  BY  ITM-QTY-ORD
086700                                GIVING ITEM-COST ROUNDED.
086800        ADD ITEM-COST  TO  TOT-COST-ACCUM        ROUNDED.
086900
087000          IF LINE-CNTR GREATER THAN 59
087100             PERFORM 1000-PUT-PAGE
087200             WRITE PRINT-REC FROM PAGE-NO
087300             MOVE SPACES TO PRINT-REC
087400             WRITE PRINT-REC AFTER ADVANCING 2 LINES.
087500
087600           MOVE ITM-CORP-CODE TO PRT-CORP-CODE, PRT-REQM-CORP-CODE.
087700           MOVE ITM-NUMBER    TO PRT-ITM-NO, PRT-REQM-ITEM-NO.
087800           MOVE ITM-QTY-ORD   TO PRT-ITM-QTY-ORD,
087900                                  SUB-QTY-ORDERED.
088000           MOVE ITM-QTY-DLVR  TO PRT-ITM-QTY-DLVR,
088100                                  SUB-QTY-DLVRD.
088200
088300
088400           MOVE ITM-UNIT-PRICE TO PRT-REQM-PRICE.
088500           MOVE ITM-UM        TO PRT-STR-ITM-UM,
088600                                  PRT-REQM-PRICE-UM.
088700           MOVE ITM-PRICE-UM  TO PRT-STR-PRICE-UM.
088800
088900        IF ITM-DATE-RCVD NOT EQUAL SPACE
089000           MOVE ITM-DATE-RCVD  TO DATE-VALIDATE-IN,
089100                                   RECV-DATE-X
089200           CALL "TDATECHK" USING DATE-CHECK-AREA
089300           MOVE DATE-SLASH-OUT TO PRT-STR-RCVD, PRT-REQM-RCVD
089400          IF CALC-FLAG EQUAL SPACE
089500             PERFORM 1200-ITEMS-RCVD-CALCS
089600          ELSE
089700             MOVE SPACE TO PRT-S-OPN-OVR-15
089800        ELSE
089900           MOVE SPACES TO PRT-STR-RCVD, PRT-REQM-RCVD,
090000                          RECV-DATE-X, PRT-S-OPN-OVR-15.
090100
090200      IF O-A-R-OPTION NOT EQUAL "R"
090300       IF CALC-FLAG EQUAL SPACE
090400        IF ITM-QTY-DLVR LESS THAN ITM-QTY-ORD
090500             PERFORM 1250-ITEMS-OPEN-CALCS THRU 1250-EXIT
090600          ELSE
090700             MOVE SPACE  TO PRT-S-OPN-OVR-15.
090800
090900      IF O-A-R-OPTION EQUAL "O" AND PO-RLSE-OUT NOT EQUAL "999"
091000         IF ITM-QTY-DLVR LESS THAN ITM-QTY-ORD
091100            PERFORM 895-PRINT-STR-ITEMS
091200            GO TO 825-GET-STR-ITEMS
091300         ELSE
091400            GO TO 825-GET-STR-ITEMS.
091500
091600
091700
091800      IF O-A-R-OPTION EQUAL "A" AND PO-RLSE-OUT NOT EQUAL "999"
091900            PERFORM 895-PRINT-STR-ITEMS
092000            GO TO   825-GET-STR-ITEMS.
092100
092300
092400      IF O-A-R-OPTION EQUAL "R" AND PO-RLSE-OUT EQUAL "999"
092500            PERFORM 896-PRINT-REQUIREMENT-ITEMS
092600            GO TO   825-GET-STR-ITEMS.
092700
092800
092900      GO TO 700-READ-FILE.
092800
092800
093100 880-START-PRINT.
093200       WRITE PRINT-REC FROM CUR-DATE AFTER ADVANCING NEW-PAGE.
093300       WRITE PRINT-REC FROM PAGE-NO.
093400       WRITE PRINT-REC FROM PRT-REPORT-TYPE.
093400       WRITE PRINT-REC FROM PRT-SEL-CRITERIA.
093500       WRITE PRINT-REC FROM PRT-VENDOR-CODE.
093600       WRITE PRINT-REC FROM PRT-VENDOR.
093700       WRITE PRINT-REC FROM PRT-VEN-STR.
093800       WRITE PRINT-REC FROM PRT-CITY-ST-ZIP.
093900       WRITE PRINT-REC FROM PRT-CONTACT.
094000       WRITE PRINT-REC FROM PRT-PHONE.
094100       WRITE PRINT-REC FROM PRT-NOTE AFTER ADVANCING 2 LINES.
094200       ADD 10 TO LINE-CNTR.
094300
094400     IF O-A-R-OPTION EQUAL "R"
094500       MOVE "PRICE" TO QTY-ORD-LABL
094600       MOVE "RECEIVED" TO QTY-DLVR-LABL
094700       MOVE SPACES  TO  QTY-OPEN-LABL, DATE-RCVD-LABL,
094800                        PRT-NOTE-1, PRT-NOTE-2.
094900
095000       CLOSE PO-HEADER-FILE.
095100       OPEN INPUT PO-HEADER-FILE.
095200
095300 890-PRINT-HEADERS.
095400     WRITE PRINT-REC FROM PRT-SUBHEAD-01 AFTER ADVANCING 3 LINES.
095500     WRITE PRINT-REC FROM PRT-PO-HEADER.
095600     ADD 7 TO LINE-CNTR.
095700     ADD 1 TO TOT-PO-CNTR.
095800     WRITE PRINT-REC FROM PRT-SUBHEAD-02 AFTER ADVANCING 2 LINES.
095900
096000
096100 895-PRINT-STR-ITEMS.
096200
096300      ADD 1 TO TOT-ITEM-CNTR.
096400
096500      IF SUB-QTY-DLVRD GREATER THAN SUB-QTY-ORDERED
096600        MOVE ZERO TO PRT-AMT-OPEN
096700      ELSE
096800        SUBTRACT  SUB-QTY-DLVRD  FROM  SUB-QTY-ORDERED
096900        MOVE SUB-QTY-ORDERED  TO  PRT-AMT-OPEN.
097000
097100           IF ITEM-CNTR EQUAL 0
097200             PERFORM 890-PRINT-HEADERS
097300             WRITE PRINT-REC FROM PRT-STR-PO-ITEMS
097400             ADD 1 TO ITEM-CNTR
097500           ELSE
097600             WRITE PRINT-REC FROM PRT-STR-PO-ITEMS
097700             ADD 1 TO ITEM-CNTR.
097800
097900
098000
098100 896-PRINT-REQUIREMENT-ITEMS.
098200           IF ITEM-CNTR EQUAL 0
098300             PERFORM 890-PRINT-HEADERS
098400             WRITE PRINT-REC FROM PRT-REQUIREMENT-ORDERS
098500             ADD 1 TO ITEM-CNTR
098600           ELSE
098700             WRITE PRINT-REC FROM PRT-REQUIREMENT-ORDERS
098800             ADD 1 TO ITEM-CNTR.
098900
099000 900-CLOSE-ALL.
099100       MOVE SPACES TO PRINT-REC.
099200       WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
099300
099400       CLOSE DVENDOR DPOITEM DPORECD.
099500
100500       CLOSE ONLINE-PRT.
100600       CLOSE PO-HEADER-FILE.
100700       GOBACK.
046400 COPY OVRPFCALL IN COPYLIB.
100800
100900 1000-PUT-PAGE.
101000       ADD 1 TO PG-COUNTER.
101100       MOVE PG-COUNTER TO PAGE-NUMBER.
101200       MOVE 0 TO LINE-CNTR.
101300       MOVE SPACES TO PRINT-REC.
101400       WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
101500
101600*------ CATAGORIZE ITEMS RECEIVED BY THE NUMBER OF DAYS BETWEEN
101700*------ DATE EXPECTED (OR SHIPPED) AND DATE RECEIVED.
101800 1200-ITEMS-RCVD-CALCS.
             IF RECV-DATE-X = SPACES
                MOVE 0 TO YRS-DIFF
             ELSE
                MOVE SPACES TO JULGREG-PARMS
                IF RCV-YY > "70"
                   MOVE "19" TO GREG-CC
                ELSE
                   MOVE "20" TO GREG-CC
                END-IF
                MOVE RECV-DATE-X TO GREG-YMD
                CALL "JULGREG"  USING GREG-DATE, JULIAN-DATE,
                                      DAY-DIGIT, LEAP-YEAR-FLAG
                MOVE JUL-DDD     TO JUL-DAY-RCVD.
102700
             IF EXPECT-DATE-X = SPACES
                MOVE 0      TO YRS-DIFF
             ELSE
102800       IF EXPECT-DATE-X NOT = SPACES
102900          SUBTRACT EXPECT-Y9 FROM RCV-Y9 GIVING
103000                                  YRS-DIFF
103100       ELSE
103200          SUBTRACT SHIP-Y9   FROM RCV-Y9 GIVING
103300                                  YRS-DIFF.
103400       IF YRS-DIFF > 0
103500       MULTIPLY YRS-DIFF BY 365 GIVING YR-DIFF-IN-DAYS.
103600
103700       ADD      JUL-DAY-RCVD,  YR-DIFF-IN-DAYS
103800                    GIVING DAYS-TO-RCV-ITM.
103900       SUBTRACT DAY-OF-YR-EXP FROM DAYS-TO-RCV-ITM
104000                    GIVING DAYS-TO-DLVR-ITM.
104100
104200     IF DAYS-TO-DLVR-ITM LESS THAN 0
104300       ADD 1 TO N-DAYS-EARLY
104400     ELSE
104500        IF DAYS-TO-DLVR-ITM EQUAL 0
104600          ADD 1 TO ZERO-DAYS-LATE
104700        ELSE
104800          IF DAYS-TO-DLVR-ITM LESS THAN 4
104900            ADD 1 TO 1-3-DAYS-LATE
105000          ELSE
105100            IF DAYS-TO-DLVR-ITM LESS THAN 8
105200              ADD 1 TO 4-7-DAYS-LATE
105300            ELSE
105400              IF DAYS-TO-DLVR-ITM LESS THAN 16
105500                ADD 1 TO 8-15-DAYS-LATE
105600              ELSE
105700                ADD 1 TO OVER-15-DAYS-LATE.
105800
105900
106000*------ CATAGORIZE OPEN ITEMS BY THE NUMER OF DAYS
106100*------ BETWEEN PO EXPECT (OR SHIP) DATE AND EITHER DATE
106200*------ ITEM WAS PARTIALLY RECEIVED OR TODAYS DATE
106300*------ IF NOTHING HAS BEEN RECEIVED.
106400 1250-ITEMS-OPEN-CALCS.
106500     MOVE SPACE TO OVER-16-FLAG.
106600
106700     IF RECV-DATE-X NOT = SPACES
106800      IF EXPECT-DATE-X  = SPACES
106900         SUBTRACT SHIP-Y9 FROM RCV-Y9 GIVING YRS-DIFF
107000         ADD 1 TO PRTIAL-RECPT
107100      ELSE
107200         SUBTRACT EXPECT-Y9 FROM RCV-Y9 GIVING YRS-DIFF
107300         ADD 1 TO PRTIAL-RECPT
107400     ELSE
107500      IF SHIP-DATE-X = SPACES
107600         SUBTRACT EXPECT-Y9 FROM SYS-YY-9 GIVING YRS-DIFF
107700      ELSE
107800         SUBTRACT SHIP-Y9 FROM SYS-YY-9 GIVING YRS-DIFF.
107900
108000     MULTIPLY YRS-DIFF BY 365 GIVING YR-DIFF-IN-DAYS.
108100
108200     IF ITM-DATE-RCVD EQUAL SPACE
108300        SUBTRACT  DAY-OF-YR-EXP  FROM  JUL-SYS-DAY
108400                                 GIVING  JUL-DAYS
108500        ADD       YR-DIFF-IN-DAYS  TO   JUL-DAYS
108600     ELSE
108700        SUBTRACT DAY-OF-YR-EXP FROM JUL-DAY-RCVD
108800                               GIVING  DAYS-TO-DLVR-ITM
108900        ADD       DAYS-TO-DLVR-ITM,   YR-DIFF-IN-DAYS
109000                               GIVING JUL-DAYS.
109100
109200      IF JUL-DAYS GREATER THAN ZERO
109300        IF JUL-DAYS LESS THAN 4
109400           ADD 1 TO 1-3-OPEN
109500        ELSE
109600        IF JUL-DAYS LESS THAN 8
109700           ADD 1 TO 4-7-OPEN
109800        ELSE
109900        IF JUL-DAYS LESS THAN 15
110000           ADD 1 TO 8-15-OPEN
110100        ELSE
110200           ADD 1 TO OVER-15-OPEN
110300           MOVE "X" TO OVER-16-FLAG
110400      ELSE
110500        ADD 1 TO NOT-DUE-OPEN.
110600
110700      IF OVER-16-FLAG EQUAL "X"
110800         MOVE "*" TO PRT-S-OPN-OVR-15
110900      ELSE
111000         MOVE SPACES TO PRT-S-OPN-OVR-15.
111100
111200     MOVE ZERO TO JUL-DAYS.
111300
111400 1250-EXIT.
111500      EXIT.
111600
111700
111800 1300-SUMMARY-PAGE.
111900     IF O-A-R-OPTION EQUAL "A"
112000       MOVE "SUMMARY OF ITEMS HAVING SHIP OR EXPECT DATES"
112100           TO TYPE-LABL
112200     ELSE
112300       MOVE SPACES TO TYPE-LABL.
112400
112500     IF O-A-R-OPTION EQUAL "A"
112600       MOVE TOT-PO-CNTR  TO  PRT-TOT-POS
112700       MOVE TOT-ITEMS-X   TO  PRT-TOT-ITEMS
112800       MOVE TOT-COST-ACCUM    TO  PRT-TOT-COST
112900       MOVE SUM-EARLY     TO  PRT-EARLY
113000       MOVE SUM-ON-TIME   TO  PRT-ON-TIME
113100       MOVE SUM-1-3-LATE  TO  PRT-1-3-LATE
113200       MOVE SUM-4-7-LATE  TO  PRT-4-7-LATE
113300       MOVE SUM-8-15-LATE TO  PRT-8-15-LATE
113400       MOVE SUM-OVER-15   TO  PRT-OVER-15-LATE
113500       ADD  N-DAYS-EARLY, ZERO-DAYS-LATE, 1-3-DAYS-LATE,
113600            4-7-DAYS-LATE, 8-15-DAYS-LATE, OVER-15-DAYS-LATE
113700       GIVING
113800            SUM-SHIPMENTS-9
113900       SUBTRACT PRTIAL-RECPT FROM SUM-SHIPMENTS-9   GIVING
114000                                     CMPLT-RECPTS    ROUNDED
114100       MOVE SUM-SHIPMENTS-X  TO  PRT-TOTAL-SHIPMENTS
114200       MOVE SUM-PRTIAL-RECPT TO  PRT-PRTIAL-RECPT
114300       MOVE SUM-CMPLT-RECPTS TO  PRT-CMPLT-RECPTS
114400       DIVIDE TOT-ITEM-CNTR INTO  N-DAYS-EARLY GIVING
114500                                    DEC-EARLY        ROUNDED
114600       DIVIDE TOT-ITEM-CNTR INTO  ZERO-DAYS-LATE    GIVING
114700                                    DEC-ONTIME       ROUNDED
114800       DIVIDE TOT-ITEM-CNTR INTO  1-3-DAYS-LATE     GIVING
114900                                    DEC-1-3-LATE     ROUNDED
115000       DIVIDE TOT-ITEM-CNTR INTO  4-7-DAYS-LATE     GIVING
115100                                    DEC-4-7-LATE     ROUNDED
115200       DIVIDE TOT-ITEM-CNTR INTO  8-15-DAYS-LATE    GIVING
115300                                    DEC-8-15-LATE    ROUNDED
115400       DIVIDE TOT-ITEM-CNTR INTO  OVER-15-DAYS-LATE GIVING
115500                                    DEC-OVER-15-LATE ROUNDED
115600       DIVIDE TOT-ITEM-CNTR INTO  PRTIAL-RECPT      GIVING
115700                                    DEC-PRTIAL-RECPT ROUNDED
115800       DIVIDE TOT-ITEM-CNTR INTO  CMPLT-RECPTS      GIVING
115900                                    DEC-CMPLT-RECPTS ROUNDED
116000       DIVIDE TOT-ITEM-CNTR INTO  SUM-SHIPMENTS-9   GIVING
116100                                    DEC-TOT-SHIP     ROUNDED
116200       MULTIPLY DEC-EARLY        BY 100 GIVING
116300                                    PCT-EARLY        ROUNDED
116400       MULTIPLY DEC-ONTIME       BY 100 GIVING
116500                                     PCT-ONTIME      ROUNDED
116600       MULTIPLY DEC-1-3-LATE     BY 100 GIVING
116700                                    PCT-1-3-LATE     ROUNDED
116800       MULTIPLY DEC-4-7-LATE     BY 100 GIVING
116900                                    PCT-4-7-LATE     ROUNDED
117000       MULTIPLY DEC-8-15-LATE    BY 100 GIVING
117100                                    PCT-8-15-LATE    ROUNDED
117200       MULTIPLY DEC-OVER-15-LATE BY 100 GIVING
117300                                    PCT-OVER-15-LATE ROUNDED
117400       MULTIPLY DEC-PRTIAL-RECPT BY 100 GIVING
117500                                    PCT-PRTIAL-RECPT ROUNDED
117600       MULTIPLY DEC-CMPLT-RECPTS BY 100 GIVING
117700                                    PCT-CMPLT-RECPTS ROUNDED
117800       MULTIPLY DEC-TOT-SHIP     BY 100 GIVING
117900                                    PCT-SHIPPED      ROUNDED
118000       MOVE  PCT-EARLY          TO  PRT-PCT-EARLY
118100       MOVE  PCT-ONTIME         TO  PRT-PCT-ONTIME
118200       MOVE  PCT-1-3-LATE       TO  PRT-PCT-1-3
118300       MOVE  PCT-4-7-LATE       TO  PRT-PCT-4-7
118400       MOVE  PCT-8-15-LATE      TO  PRT-PCT-8-15
118500       MOVE  PCT-OVER-15-LATE   TO  PRT-PCT-OVER-15
118600       MOVE  PCT-PRTIAL-RECPT   TO  PRT-PCT-PRTIAL
118700       MOVE  PCT-CMPLT-RECPTS   TO  PRT-PCT-CMPLT
118800       MOVE  PCT-SHIPPED        TO  PRT-PCT-SHIPPED
118900
119000       MOVE  TOT-NOT-DUE-OPEN   TO  PRT-NOT-DUE-OPEN
119100       MOVE  TOT-1-3-OPEN       TO  PRT-1-3-OPEN
119200       MOVE  TOT-4-7-OPEN       TO  PRT-4-7-OPEN
119300       MOVE  TOT-8-15-OPEN      TO  PRT-8-15-OPEN
119400       MOVE  TOT-OVER-15-OPEN   TO  PRT-OVER-15-OPEN
119500       ADD  1-3-OPEN, 4-7-OPEN, 8-15-OPEN, OVER-15-OPEN,
119600            NOT-DUE-OPEN
119700       GIVING  TOT-OPEN-ITEMS-9
119800
119900       DIVIDE TOT-ITEM-CNTR INTO  NOT-DUE-OPEN     GIVING
120000                                    DEC-NOT-DUE-OPEN ROUNDED
120100       DIVIDE TOT-ITEM-CNTR INTO  1-3-OPEN     GIVING
120200                                    DEC-1-3-OPEN     ROUNDED
120300       DIVIDE TOT-ITEM-CNTR INTO  4-7-OPEN     GIVING
120400                                    DEC-4-7-OPEN     ROUNDED
120500       DIVIDE TOT-ITEM-CNTR INTO  8-15-OPEN    GIVING
120600                                    DEC-8-15-OPEN    ROUNDED
120700       DIVIDE TOT-ITEM-CNTR INTO  OVER-15-OPEN GIVING
120800                                    DEC-OVER-15-OPEN ROUNDED
120900       DIVIDE TOT-ITEM-CNTR INTO  TOT-OPEN-ITEMS-9 GIVING
121000                                    DEC-OPEN-ITEMS   ROUNDED
121100       MULTIPLY DEC-NOT-DUE-OPEN BY 100 GIVING
121200                                    PCT-NOT-DUE-OPEN ROUNDED
121300       MULTIPLY DEC-1-3-OPEN     BY 100 GIVING
121400                                    PCT-1-3-OPEN     ROUNDED
121500       MULTIPLY DEC-4-7-OPEN     BY 100 GIVING
121600                                    PCT-4-7-OPEN     ROUNDED
121700       MULTIPLY DEC-8-15-OPEN    BY 100 GIVING
121800                                    PCT-8-15-OPEN    ROUNDED
121900       MULTIPLY DEC-OVER-15-OPEN BY 100 GIVING
122000                                    PCT-OVER-15-OPEN ROUNDED
122100       MULTIPLY DEC-OPEN-ITEMS   BY 100 GIVING
122200                                    PCT-OPEN         ROUNDED
122300
122400       MOVE  PCT-NOT-DUE-OPEN   TO  PRT-PCT-NOT-DUE-OPEN
122500       MOVE  PCT-1-3-OPEN       TO  PRT-PCT-1-3-OPEN
122600       MOVE  PCT-4-7-OPEN       TO  PRT-PCT-4-7-OPEN
122700       MOVE  PCT-8-15-OPEN      TO  PRT-PCT-8-15-OPEN
122800       MOVE  PCT-OVER-15-OPEN   TO  PRT-PCT-OVER-15-OPEN
122900       MOVE PCT-OPEN            TO  PRT-PCT-OPEN
123000       MOVE TOT-OPEN-ITEMS-X    TO  PRT-TOTAL-OPENS
123100       WRITE PRINT-REC FROM CUR-DATE AFTER ADVANCING NEW-PAGE
123200       WRITE PRINT-REC FROM PRT-REPORT-TYPE
093400       WRITE PRINT-REC FROM PRT-SEL-CRITERIA.
123300       WRITE PRINT-REC FROM PRT-VENDOR-CODE
123400       WRITE PRINT-REC FROM PRT-VENDOR
123500       WRITE PRINT-REC FROM PRT-VEN-STR
123600       WRITE PRINT-REC FROM PRT-CITY-ST-ZIP
123700       WRITE PRINT-REC FROM PRT-CONTACT
123800       WRITE PRINT-REC FROM PRT-PHONE
123900       WRITE PRINT-REC FROM PRT-SUM-L0 AFTER
124000                                       ADVANCING 5 LINES
124100       WRITE PRINT-REC FROM PRT-SUM-L00 AFTER
124200                                       ADVANCING 2 LINES
124300       WRITE PRINT-REC FROM PRT-SUM-L0A AFTER
124400                                       ADVANCING 2 LINES
124500       WRITE PRINT-REC FROM PRT-SUM-L0B AFTER
124600                                       ADVANCING 2 LINES
124700       WRITE PRINT-REC FROM PRT-SUM-TYPE AFTER
124800                                         ADVANCING 3 LINES
124900       WRITE PRINT-REC FROM PRT-SUM-L0C AFTER
125000                                       ADVANCING 2 LINES
125100       WRITE PRINT-REC FROM PRT-SUM-L1
125200       WRITE PRINT-REC FROM PRT-SUM-L2
125300       WRITE PRINT-REC FROM PRT-SUM-L3
125400       WRITE PRINT-REC FROM PRT-SUM-L4
125500       WRITE PRINT-REC FROM PRT-SUM-L5
125600       WRITE PRINT-REC FROM PRT-SUM-L6
125700       WRITE PRINT-REC FROM PRT-SUM-L7
125800       WRITE PRINT-REC FROM PRT-SUM-L8
125900       WRITE PRINT-REC FROM PRT-SUM-L9
126000
126100       WRITE PRINT-REC FROM PRT-SUM-O0A AFTER
126200                                       ADVANCING 2 LINES
126300       WRITE PRINT-REC FROM PRT-SUM-O2
126400       WRITE PRINT-REC FROM PRT-SUM-O3
126500       WRITE PRINT-REC FROM PRT-SUM-O4
126600       WRITE PRINT-REC FROM PRT-SUM-O5
126700       WRITE PRINT-REC FROM PRT-SUM-O6
126800       WRITE PRINT-REC FROM PRT-SUM-O7.
127100
127200 1300-EXIT.
127300      EXIT.
127400
127500 2000-BLOWUP.
127600
127700     DISPLAY "*** 2000 BLOWUP ***".
127800       DISPLAY "COND-WORD=", COND-WORD.
127900       CLOSE DVENDOR DPORECD DPOITEM.
128000       CLOSE ONLINE-PRT.
128100       CLOSE PO-HEADER-FILE.
128200       GOBACK.
