001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TRPTDUIN.
001300 AUTHOR.              ANDREW T LEPERA.
001400 DATE-WRITTEN.        FEB 1,1980.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS.             THIS PROGRAM PRINTS A REPORT OF ITEMS
001900*                     TO BE INVENTORIED AS OF THE REPORT DATE.
002000*
002100*    ON W 2/17/81, THE FOLLOWING CHANGES WERE MADE:
002200*    1.  STOREROOM CLASS WILL BE PRINTED OUT FOR THE REPORT
002300*        ONLY IF UNION CITY.
002400*    2.  PHYSICAL INVENTORY CYCLE WILL BE PRINTED OUT IF OTHER
002500*        THAN 180 DAYS.
    00*    3.  DUE TO BE INVENTORIED DATE WILL BE CALCULATED CORRECTLY
002700*        FOR ANY CYCLE, FROM 0 - 9999, INSTEAD OF ONLY BEING
002800*        CORRECT FOR INV CYCLE LESS THAN 2 YEARS.
002900*
003000*    ON JULY 12, 1982 THE BUFFER AREA MSTORERM WAS CHANGED
003100*    IN PREPARATION FOR THE NEW DATA BASE CHANGES. B.J.P.
003200*
003300*    ON SEPTEMBER 7, THE PROGRAM WAS CHANGED TO EXCLUDE ALL
003400*    CODES THAT HAVE '9999' ENTERED AS THEIR PHYSICAL INVENTORY
003500*    CYCLE, AND A HEADER PAGE WAS ADDED TO THE PROGRAM. BJP.
003600*
003700*    ON NOVEMBER 26, MADE CORRECTIONS TO HEADER PAGE. BJP.
003800*
003900*    ON JULY 24, 1984;                 -B. WINTER
004000*       1.  IF THE STOREROOM ONHAND IS ZERO, INSTEAD OF PRINTING
004100*           THAT CODE AUTOMATICALLY ON THE REPORT, IT IS NOW PRINTED
004200*           ONLY IF THE LAST INVENTORIED DATE IS OLDER THAN 60 DAYS.
004300*       2.  ADDED 60 DAYS TO THE TABLE OF COMMON INVENTORY CYCLES.
004400*       3.  ADDED THIRD REASON IN REPORT HEADER FOR NOT PRINTING
004500*           ITEMS.
004600*       4.  ELIMINATED AND CLEANED UP ABOUT HALF OF PRINT CODE
004700*           THAT WAS NOT NEEDED.
004800*
004900*
005000*    ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
005100*    MAY 18, 1985.    V.W.D.
005200*
005300*    THE FOLLOWING HAS BEEN ADDED:
005400*     -TRSCREEN FOR FRONT END REPORT OPTIONS
005500*     -ADDED HEADER PAGE TO THE REPORT USING SUPROGRAM THDPRT2
005600*     -PRINT COMPRESSION FEATURE
005700*     -NON-HP LOGIC
005800*     -CHANGED TO USE COPYLIB FOR ALL DATA SET BUFFER DESC.
005900*     -CHANGED COPY STATEMENTS TO "IN COPYCSIS".
006000*      JAN 5,1987.  C.J.R.
006100*
006200*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  06/13/96        JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   CHANGED CALLS TO JULIAN AND GREGDATE TO USE
      *C   NEW SUBROUTINE JULGREG TO USE CENTURY IN CALCS.
      *C   INCLUDED CENTURY ON THE COMPARISONS AND SORT OF
      *C   LAST INVENTORIED DATE.

006300 ENVIRONMENT DIVISION.
006400 CONFIGURATION SECTION.
006500 SOURCE-COMPUTER.  HP-3000.
006600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  C01 IS NEW-PAGE.
010600 INPUT-OUTPUT SECTION.
010700 FILE-CONTROL.
010800       SELECT DISC-PRT     ASSIGN TO PRINTER-MCPRT.
011000       SELECT SORT-FILE          ASSIGN TO DISK-SORT.
011100
             SELECT DDESC-I
               ASSIGN TO DATABASE-MCFLCS1401
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
             SELECT MSTORERM-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
             SELECT MPLTINFO-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
011200 DATA DIVISION.
011300 FILE SECTION.
011400
011500 FD  DISC-PRT
011600     RECORD CONTAINS 132 CHARACTERS.
011700 01  PRINT-REC.
011900     05  PRT-LINE                PIC X(132).
012000
008500 SD  SORT-FILE
008600     RECORD CONTAINS 24 CHARACTERS.
008700 01  SORT-RCD.
008800     05  SORT-DETAIL.
008900         10  SORT-CODE          PIC X(8).
009000         10  SORT-WORK-DATE-CN.
                   15  SORT-WORK-DATE-CC PIC X(2).
                   15  SORT-WORK-DATE    PIC X(6).
009100         10  SORT-CLASS         PIC X(4).
009200         10  SORT-INV-CYL       PIC 9(4).
014400
       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.
008400
009400 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
009500
009600 COPY TDATECHK IN COPYLIB.
009700
       01  CUR-DATE-CN.
           05  CUR-DATE-CC         PIC XX.
018900     05  CUR-DATE.
019000         10  CUR-DATE-YY     PIC XX.
019100         10  CUR-DATE-MM     PIC XX.
019200         10  CUR-DATE-DD     PIC XX.
019700
009800 77  TERM-NAME                  PIC X(16)  VALUE SPACES.
009900 77  EOF-SW                     PIC X      VALUE "N".
010000 77  SUB                        PIC 99     VALUE ZEROS.
010100 77  I                          PIC 99     VALUE ZEROS.
9406CK 01  SCOPE   PIC X.
010200
010300*****ARGUMENT VALUES*****
010400 77  WL-ARG                     PIC X(6)   VALUE "SLMOVE".
010500 77  CODE-ARG                   PIC X(8)   VALUE SPACES.
010600 77  PLT-ARG                    PIC X(4)   VALUE "P 01".
010700 77  LINE-ADV                   PIC 99     VALUE ZEROS.
010800 77  ITMS-PER-PAGE              PIC 99     VALUE ZEROS.
010900 77  PG-CTR                     PIC 999    VALUE ZEROS.
011000 77  HOLD-CLASS                 PIC XXX    VALUE SPACES.
011100 77  SAVE-JULIAN                PIC 9(5)   VALUE ZERO.
       77  DAY-DIGIT                  PIC X(1).
       77  LEAP-YEAR-FLAG             PIC X(1).
013200*----------  CURRENT DATE COMPUTED INTO A JULIAN DATE
013300 01  TODAYS-JULIAN .
           05  TJ-CC                   PIC 9(2).
           05  TJ-YY                   PIC 9(2).
           05  TJ-DDD                  PIC 9(3).
013400
013600 01  DATE-WANTED-JULIAN.
           05  DW-CCYY                PIC 9(4).
           05  DW-DDD                 PIC 9(3).
011400 77  YR-COUNT                   PIC 99     VALUE ZERO.
011500 77  EDIT-INV-CYL               PIC ZZZ9   VALUE ZERO.
011600 77  PI                         PIC 9      VALUE ZERO.
       01  CALC-INV-DATE-CN.
           05  CALC-INV-DATE-CC       PIC X(2).
           05  CALC-INV-DATE.
               10  CALC-INV-DATE-YY   PIC X(2).
               10  FILLER             PIC X(4).
011700
011800 COPY DATAB IN COPYLIB.
011900
012000
012100*******  ACCEPT FIELDS ******
012200 01  ROUTE-LINE    PIC X(80)  VALUE SPACES.
012300 COPY CCHKOBJ OF COPYLIB.
012400 COPY OVRPFDATA OF COPYLIB.
       COPY CCRTFILE IN COPYLIB.
012500*******  ESCAPE SEQUENCES  *******
012600 COPY ESCNAM2 IN COPYLIB.
012700
012800 01  COMPRESS-PRINT     PIC X(8).
013000 01  NORMAL-PRINT       PIC X(8).
013200 01  ESC-TEXT-61        PIC X(8).
013300
013400 COPY TBLOWUP IN COPYLIB.
013500 01  VIEW-COMAREA.
013600     05  FILLER         PIC X(118)  VALUE ALL "0".
013700     05  FILLER         PIC S9(4)   COMP-4 VALUE 9999.
013800 01  KSAM-STATUS        PIC X(2)    VALUE SPACES.
013900
014000********  PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
014100 01  HD-RET-CODE        PIC S9(4)   COMP-4 VALUE 0.
014200 01  HD-FILE-NAME       PIC X(17)   VALUE SPACES.
014300 01  FNUM               PIC S9(4)   COMP-4 VALUE 0.
014400
023500*-----  DATE ROUTINES "JULIANDATE" AND "GREGORIANDATE"
023600 01  J-DATE-AREA.
023800     05  J-JULIAN                PIC 9(7).
023900     05  J-JULIANX               PIC X(7).
024200
016400
016500 01  DATE-WORKAREA.
016600     05  UNEDITED-DATE.
016700      07  YY       PIC XX.
016800      07  MM       PIC XX.
016900      07  DD       PIC XX.
017000     05  UNEDIT-DATE-9  REDEFINES  UNEDITED-DATE.
017100      07  YY-9     PIC 99.
017200      07  MM-9     PIC 99.
017300      07  DD-9     PIC 99.
017400     05  EDITED-DATE.
017500      07  PRT-MM   PIC XX     VALUE SPACES.
017600      07  FILLER   PIC X      VALUE "/".
017700      07  PRT-DD   PIC XX     VALUE SPACES.
017800      07  FILLER   PIC X      VALUE "/".
017900      07  PRT-YY   PIC XX     VALUE SPACES.
018000     05  PRT-DATE  PIC X(8)   VALUE SPACES.
018100     05  PRT-TIME           PIC X(8).
018200
018300 01  PHYS-INV-DATE-TABLE.
018400     05  PHYS-INV-DATE-TBL-ENTRY OCCURS 6 TIMES.
018500         10  PI-DAYS            PIC 9(4).
018600         10  PI-DD              PIC X(8).
018700
018800 01  TRANS-TIME.
018900     05  HH                     PIC XX.
019000     05  MIN                    PIC XX.
019100     05  SS                     PIC XX.
019200
019300 01  ITEM-LISTINGS.
019400     05  ALL-ITEM-LIST          PIC XX     VALUE "@;".
019500     05  CODE-SEARCH            PIC X(10)  VALUE "CORP-CODE;".
019600
019700*********************
019800*                   *
019900*   DATA SET NAMES  *
020000*                   *
020100*********************
020200
020300 01  DSET-NAMES.
020400     05  DSET-NAME              PIC X(16)  VALUE SPACES.
020500     05  DSET-STOREROOM         PIC X(16)  VALUE "MSTORERM;".
020600     05  DSET-DESC              PIC X(16)  VALUE "DDESC;".
020700     05  DSET-MPLTINFO          PIC X(16)  VALUE "MPLTINFO;".
020800
020900*********************************
021000*                               *
021100*  BELOW ARE THE BUFFER AREAS   *
021200*    SET UP FOR EACH DATASET IN *
021300*    THE DATABASE - STORES      *
021400*                               *
021500*********************************
021600
021700 COPY MSTORERM IN COPYLIB.
021800
021900 COPY DDESC IN COPYLIB.
022000
022100*        AN 00 ID
022200*           KWRD-ADJ OF 46
022300*           MFR DATA OF 50
022400*        AN 01 ID
022500*           FIRST 96 CHAR OF CATLG
022600
022700 COPY MPLTINFO IN COPYLIB.
022800
022900*********************
023000*                   *
023100*   H E A D E R S   *
023200*
023300*********************
023400
023500 01  INV-HDR-1.
023600     05  FILLER    PIC X(5)   VALUE "PAGE ".
023700     05 PRT-INV-PG PIC ZZ9    VALUE ZEROS.
023800     05  FILLER    PIC X(16)  VALUE SPACES.
023900     05  FILLER    PIC X(20)  VALUE "S T O R E R O O M   ".
024000     05  FILLER    PIC X(23)  VALUE "I T E M S   T O   B E  ".
024100     05  FILLER    PIC X(22)  VALUE " I N V E N T O R I E D".
024200     05  FILLER    PIC X(17)  VALUE SPACES.
024300     05  FILLER    PIC X(5)   VALUE "DATE ".
024400     05 PRT-INV-DT PIC X(8)   VALUE SPACES.
024500     05  FILLER    PIC XX     VALUE SPACES.
024600     05  PRT-INV-TIME PIC X(8) VALUE SPACES.
024700     05  FILLER    PIC XXX    VALUE SPACES.
024800 01  INV-HDR-2.
024900     05  FILLER    PIC XXX    VALUE SPACES.
025000     05  FILLER    PIC X(14)  VALUE "THE FOLLOWING ".
025100     05  FILLER    PIC X(16)  VALUE "ITEMS ARE TO BE ".
025200     05  FILLER    PIC X(14)  VALUE "INVENTORIED : ".
025300     05 PRT-DT-OF-INV PIC X(8) VALUE SPACES.
025400     05  FILLER    PIC X(75)  VALUE SPACES.
025500 01  INV-HDR-3.
025600     05  FILLER    PIC X(99)  VALUE SPACES.
025700     05  FILLER    PIC X(13)  VALUE "LAST PHYSICAL".
025800     05  FILLER    PIC X(7)   VALUE SPACES.
025900     05  FILLER    PIC X(8)   VALUE "PHYSICAL".
026000     05  FILLER    PIC X(5)   VALUE SPACES.
026100 01  INV-HDR-4.
026200     05  CLASS-HDR PIC X(5)   VALUE SPACES.
026300     05  FILLER    PIC X(2)   VALUE SPACES.
026400     05  FILLER    PIC X(11)  VALUE "STORES CODE".
026500     05  FILLER    PIC X(3)   VALUE SPACES.
026600     05  FILLER    PIC X(12)  VALUE "DESCRIPTION".
026700     05  FILLER    PIC X(66)  VALUE SPACES.
026800     05  FILLER    PIC X(14)  VALUE "INVENTORY DATE".
026900     05  FILLER    PIC X(3)   VALUE SPACES.
027000     05  FILLER    PIC X(15)  VALUE "INVENTORY CYCLE".
027100     05  FILLER    PIC X      VALUE SPACES.
027200 01  INV-HDR-5.
027300     05  FILLER      PIC X      VALUE SPACES.
027400     05 PRT-CLASS    PIC X(4)   VALUE SPACES.
027500     05  FILLER      PIC X(4)   VALUE SPACES.
027600     05 PRT-INV-CD   PIC X(7)   VALUE SPACES.
027700     05  FILLER      PIC X(5)   VALUE SPACES.
027800     05 PRT-INV-DESC PIC X(80)  VALUE SPACES.
027900     05  FILLER      PIC X      VALUE SPACES.
028000     05 PRT-INV-DATE PIC X(8)   VALUE SPACES.
028100     05  FILLER      PIC X(11)  VALUE SPACES.
028200     05  PRT-INV-CYL PIC X(4)   VALUE ZERO.
028300     05  FILLER      PIC X(6)   VALUE SPACES.
028400
       LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.
       01  DATA-LINE                PIC X(161).
028500*****************************************************
028600*****  P R O C E D U R E      D I V I S I O N   *****
028700*****************************************************
028800
028900
029000 PROCEDURE DIVISION USING HD-ROUTE-DATA DATA-LINE.
029100 START-UP SECTION.
029200 HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

029300     MOVE "TRPTDUIN" TO BU-PGM-NAME.
           OPEN INPUT MSTORERM-I DDESC-I MPLTINFO-I.

029800     MOVE 1 TO DATE-MODE.
029900     CALL "TDATECHK" USING DATE-CHECK-AREA.
030000     MOVE DATE-SLASH-OUT TO PRT-DATE.
030100     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
045700     MOVE DATE-YMD-OUT TO CUR-DATE.
           IF CUR-DATE-YY > "70"
               MOVE "19" TO CUR-DATE-CC
           ELSE
               MOVE "20" TO CUR-DATE-CC.
030200
030300 1-GET-SELECTION.
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE FOR SORTING
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "SORTED"      TO CCRTFILE-FILE.
           MOVE "0075"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "90000"       TO CCRTFILE-NO-RECORDS.
           MOVE "02000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "10"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'SORTED' FAILED"
                  TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.
031600     CALL "TESCSEQ" USING ESC-NAME.
031700     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
031800     MOVE CHAR-10PI       TO NORMAL-PRINT.
031900     MOVE TEXT-LENGTH-61  TO ESC-TEXT-61.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
021100     OPEN OUTPUT DISC-PRT.
021900*----------  PRINT HEADER PAGE
022100     MOVE "DHDR80.PUB" TO HD-FILE-NAME.
022200     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME,
022300        FNUM, HD-ROUTE-DATA, ESC-NAME.
022400     IF PAPER-IS-132-COLS
022500          NEXT SENTENCE
022600     ELSE
022700         WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
022800         WRITE PRINT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
022900     IF HD-RET-CODE NOT = 0
023000         DISPLAY "THDRPT ERROR".
023200
032000
050500     MOVE "P 01"         TO  PLT-ARG.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
033300     IF COND-WORD NOT = 0
033400         MOVE "DBGET ERR MPLTINFO HSK" TO BU-DISPLAY-MSG
033500         GO TO 2-BLOWUP.
033600
033700**************************************
033800**   IF UC, WE WANT STR-CLASS       **
033900**   HEADER, OTHERWISE NOT.         **
034000**************************************
034100
034200     IF MPLTINFO-COMPANY = "129"
034300         MOVE "CLASS" TO CLASS-HDR.
034400
      *----------  COMPUTE TODAY'S JULIAN DATE
           MOVE SPACES TO J-JULIANX.
034500     CALL "JULGREG" USING CUR-DATE-CN, J-JULIANX
                                DAY-DIGIT LEAP-YEAR-FLAG.
034700     MOVE J-JULIANX    TO   TODAYS-JULIAN DATE-WANTED-JULIAN.

035200 PHYS-INV-TBL-HSK.
035300     MOVE SPACES                 TO   PHYS-INV-DATE-TABLE.
035500     MOVE 365                    TO   PI-DAYS (6).
035600     SUBTRACT 1                  FROM DW-CCYY.
035700     MOVE DATE-WANTED-JULIAN     TO   PI-DD (6).
035800
035900     MOVE 30   TO PI-DAYS (1).
036000     MOVE 60   TO PI-DAYS (2).
036100     MOVE 90   TO PI-DAYS (3).
036200     MOVE 180  TO PI-DAYS (4).
036300     MOVE 360  TO PI-DAYS (5).
036400
036500     MOVE 0 TO PI.
036600
036700**************************************************************
036800**   IN ORDER TO AVOID THOUSANDS OF CALLS TO "GREGORIANDATE"**
036900**   A TABLE IS SET UP WITH THE MOST COMMON INVENTORY CYCLES**
037000**  (30, 90, 180, AND 360).  FOR EACH CYCLE, WE CALCULATE   **
037100**  THE DATE THAT MANY DAYS AGO FROM TODAY (IE. 30 DAYS     **
037200**  AGO, 90 DAYS AGO, ETC.).  THEN, COMPARING THIS CALCUL-  **
037300**  ATED DATE TO LAST INVENTORY DATE, WE CAN DETERMINE      **
037400**  WHETHER THE ITEM IS TO BE INVENTORIED.                  **
037500**************************************************************
037600
037700 STACK-PI-TABLE.
037800     ADD 1 TO PI.
037900     IF PI > 5
038000         GO TO TBL-IS-STACKED.
038100
038600     MOVE TODAYS-JULIAN TO DATE-WANTED-JULIAN.
038700     IF PI-DAYS (PI) < DW-DDD
038800         SUBTRACT PI-DAYS (PI) FROM DW-DDD
038900     ELSE
039000         ADD 365 TO DW-DDD
039100         SUBTRACT 1 FROM DW-CCYY
039200         SUBTRACT PI-DAYS (PI) FROM DW-DDD.
039300
           MOVE SPACES TO PI-DD(PI).
           MOVE DATE-WANTED-JULIAN TO J-JULIANX.
039400     CALL "JULGREG" USING PI-DD(PI) J-JULIANX
                                DAY-DIGIT LEAP-YEAR-FLAG.
040100
040200     GO TO STACK-PI-TABLE.
040300
040400 TBL-IS-STACKED.
040500
040600     ADD 1 TO I.
040700     IF I < 10
040800        GO TO TBL-IS-STACKED.

           MOVE 0 TO COND-WORD.
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY IS GREATER OR EQUAL
                    CORPCDE OF MSTORERM-REC-I
                 INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              GO TO 2-SHUTDOWN-DB.
040900
041000     SORT SORT-FILE
041100       ON ASCENDING KEY      SORT-WORK-DATE-CN
041200                             SORT-CODE
041300          INPUT  PROCEDURE IS  ABSTRACT-LOOP  THRU AC-X
041400          OUTPUT PROCEDURE IS  WRITE-REPORT THRU WR-X.
041500
041600 2-SHUTDOWN-DB.
041700     CLOSE DDESC-I MSTORERM-I MPLTINFO-I.
042100 2-STOP-RUN.
042200     WRITE PRINT-REC FROM ESC-TEXT-61  AFTER ADVANCING 0.
042300     WRITE PRINT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
042400     CLOSE DISC-PRT.
042500     GOBACK.
042600
042700 2-BLOWUP.
042800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
042900         VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
043000         BU-DISPLAY-AREA.
043100
043200 2-BLOWUP-X.
043300     EXIT.
043400
043500*******************************************
043600*                                         *
043700*    I N P U T    P R O C E D U R E       *
043800*                                         *
043900*******************************************
044000
044300 ABSTRACT-LOOP.
044400
044500*** SERIAL GET THRU MSTORERM FOR CODES
044600
044700*    CALL "DBGET" USING BASE, DSET-STOREROOM, MODE2, STATUS-AREA,
044800*            ALL-ITEM-LIST, BUF-MSTORERM, CODE-ARG.

           MOVE 0 TO COND-WORD.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE 99 TO COND-WORD.
044900
045000*** END OF SEGMENT (MODE2) GIVES A COND-CODE OF "11"
045100
045200     IF COND-WORD NOT = 0
045400             GO TO AC-X.
045800
045900*************************************************
046000**   IF UNION CITY, WE WANT TO SEE STR-CLASS,  **
046100**   OTHERWISE NOT.                            **
046200*************************************************
046300
046400     IF MPLTINFO-COMPANY  NOT = "129"
046500         MOVE SPACES TO STR-CLASS.
046600
046700 DOES-CODE-QUALIFY.
046800*************************************************
046900**   IF THE PHYSICAL INVENTORY CYCLE IS 9999,  **
047000**   THE CODE IS A NON-INVENTORY ITEM.         **
047100*************************************************
047200
047300     IF STR-PHY-INV-CYL = "9999"
047400       GO TO ABSTRACT-LOOP.
047500
047600*****************************************************
047700*                                                   *
047800*    IF ONHAND IS ZEROS, CODE AUTOMATICALLY IS TO   *
047900*      GO ON INVENTORY LISTING. LAST PHY INV DATE   *
048000*      WILL READ "ONHAND=0".                        *
048100*                                                   *
048200*    THERE ARE 2 EXCEPTIONS TO THIS RULE:           *
048300*      1.  IF THE LAST DATE OF ACTIVITY IS THE      *
048400*          SAME AS THE LAST INVENTORY DATE, DO      *
048500*          NOT PRINT.                               *
048600*      2.  IF LAST INVENTORY DATE IS NOT AT         *
048700*          LEAST 60 DAYS OLD, DO NOT PRINT.         *
048800*                                                   *
048900*****************************************************
049000     MOVE SPACES          TO SORT-RCD.
049100     MOVE STR-INV-DATE-CN TO SORT-WORK-DATE-CN.
049200
049300     IF STR-ONHAND = ZEROS
049400       IF STR-INV-DATE-CN = STR-ACT-DATE-CN
049500         GO TO ABSTRACT-LOOP
049600       ELSE
049700         MOVE 2               TO  PI
049800         MOVE LOW-VALUES      TO  SORT-WORK-DATE-CN
049900         GO TO FOUND-MATCH.
050000
050100**************************************************
050200**   IF THE ITEMS INVENTORY CYCLE IS ON OUR     **
050300**   TABLE, SKIP THE CALL TO "GREGORIANDATE"    **
050400**   AND  USE THE GREGORIAN  DATE FROM THE TABLE**
050500**************************************************
050600
050700     MOVE 0 TO PI.
050800 SEARCH-TABLE.
050900     ADD 1 TO PI.
051000     IF PI > 5
051100         GO TO DERIVE-INV-DATE.
051200     IF PI-DAYS (PI) = STR-PHY-INV-CYL-9
051300         GO TO FOUND-MATCH.
051400     GO TO SEARCH-TABLE.
051500
051600 DERIVE-INV-DATE.
051700
051800**************************************************************
051900**   FOR CYCLES NOT ON OUR TABLE, CALCULATE THE GREGORIAN   **
052000**   DATE.  THIS PROC WILL CALCULATE THE DATE X NUMBER OF   **
052100**   DAYS AGO FOR ANY CYCLE FROM 0 TO 9998.                 **
052200**                                                          **
052300**   NOTE THAT ON A STRANGE INV CYCLE LIKE 9999 (ABOUT 28   **
052400**   YEARS), THE CALCULATED DATE WILL BE OFF BY A FEW DAYS  **
052500**    DUE TO LEAP YEARS.                                    **
052600**************************************************************
052700
052800
053300     MOVE TODAYS-JULIAN          TO DATE-WANTED-JULIAN.
053400     IF STR-PHY-INV-CYL-9 < DW-DDD
053500         SUBTRACT STR-PHY-INV-CYL-9 FROM DW-DDD
053600     ELSE
053700         MOVE 0 TO YR-COUNT
053800         MOVE DW-DDD TO SAVE-JULIAN
053900         PERFORM CALCULATE-PREV-JULIAN THRU CPJ-X.
054000
           MOVE SPACES TO CALC-INV-DATE-CN.
           MOVE DATE-WANTED-JULIAN TO J-JULIANX.
           CALL "JULGREG" USING CALC-INV-DATE-CN J-JULIANX
                                DAY-DIGIT LEAP-YEAR-FLAG.
054800     GO TO DOES-CODE-QUAL-FOR-INV.
054900
055000 FOUND-MATCH.
055100     MOVE PI-DD (PI) TO CALC-INV-DATE-CN.
055200*    IF IT IS CALCULATED AND FOUND THAT CODE IS     *
055300*      OVERDUE TO BE INVENTORIED (PAST OR TODAY)    *
055400*      IT WILL BE INCLUDED ON PHYS INV REPORT       *
055500*****************************************************
055600
055700 DOES-CODE-QUAL-FOR-INV.
055800     IF CALC-INV-DATE-CN > STR-INV-DATE-CN
055900         MOVE CORP-CODE   TO SORT-CODE
056000         MOVE STR-CLASS       TO SORT-CLASS
056100         MOVE STR-PHY-INV-CYL TO SORT-INV-CYL
056200         RELEASE SORT-RCD.
056300
056400     GO TO ABSTRACT-LOOP.
056500
056600 CALCULATE-PREV-JULIAN.
056700     ADD 1 TO YR-COUNT.
056800     ADD 365 TO SAVE-JULIAN.
056900     IF SAVE-JULIAN > STR-PHY-INV-CYL-9
057000         SUBTRACT STR-PHY-INV-CYL-9 FROM SAVE-JULIAN
057100         SUBTRACT YR-COUNT FROM DW-CCYY
057200         MOVE SAVE-JULIAN TO DW-DDD
057300         GO TO CPJ-X
057400     ELSE
057500         GO TO CALCULATE-PREV-JULIAN.
057600 CPJ-X.
057700     EXIT.
057800
057900 AC-X.
058000     EXIT.
058100
058200*******************************************
058300*                                         *
058400*                                         *
058500*    O U T P U T   P R O C E D U R E      *
058600*                                         *
058700*******************************************
058800
058900
059000 WRITE-REPORT SECTION.
059100 WRITE-RPT.
059200     IF PAPER-IS-132-COLS
059300         NEXT SENTENCE
059400     ELSE
059500         WRITE PRINT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0
059600         WRITE PRINT-REC FROM ESC-TEXT-61 AFTER ADVANCING 0.
059700     MOVE SPACES TO PRINT-REC.
059800     PERFORM RETURN-RCD.
059900     IF EOF-SW = "Y"             GO TO  WR-X.
060000
060100
060200     MOVE 0 TO PG-CTR.
060300     MOVE PRT-TIME TO PRT-INV-TIME.
060400     MOVE PRT-DATE TO PRT-DT-OF-INV
060500                      PRT-INV-DT.
060600     MOVE 51 TO ITMS-PER-PAGE.
060700
060800
060900*******************************************
061000*                                         *
061100*    T O   B E   I N V E N T O R I E D    *
061200*                                         *
061300*******************************************
061400
061500 62-PHYS-INV.
061600     IF ITMS-PER-PAGE > 50
061700         MOVE 1 TO ITMS-PER-PAGE
061800         PERFORM 622-PRT-PHYS-INV-TOP.
061900
062000     MOVE SORT-CODE          TO  PRT-INV-CD.
062100     IF SORT-WORK-DATE-CN = LOW-VALUES
062200       MOVE "ONHAND=0"       TO  PRT-INV-DATE
062300     ELSE
062400       MOVE SORT-WORK-DATE   TO  UNEDITED-DATE
062500       MOVE 4 TO DATE-MODE
062600       MOVE SORT-WORK-DATE   TO  DATE-VALIDATE-IN
062700       CALL "TDATECHK" USING DATE-CHECK-AREA
062800       MOVE DATE-SLASH-OUT   TO  PRT-INV-DATE.
062900     MOVE SORT-CLASS         TO PRT-CLASS.
063000     IF SORT-INV-CYL = 180
063100         MOVE SPACES         TO PRT-INV-CYL
063200     ELSE
063300         MOVE SORT-INV-CYL   TO EDIT-INV-CYL
063400         MOVE EDIT-INV-CYL   TO PRT-INV-CYL.
063500
063600     MOVE SORT-CODE          TO  CODE-ARG.
063700*    CALL "DBFIND" USING BASE, DSET-DESC, MODE1, STATUS-AREA,
063800*            CODE-SEARCH, CODE-ARG.
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
           START DDESC-I KEY = CORPCDE OF DDESC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
063900     IF COND-WORD NOT = 0
064000         MOVE "* NO DESCRIPTION ON FILE *" TO PRT-INV-DESC
064100         GO TO 621-CONT.
064200
064300*    CALL "DBGET" USING BASE, DSET-DESC, MODE5, STATUS-AREA,
064400*            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
           MOVE 0 TO COND-WORD.
           READ DDESC-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
064500     IF COND-WORD = 0
064600         MOVE DESC-DATA      TO  PRT-INV-DESC
064700     ELSE
064800         MOVE "* NO DESCRIPTION ON FILE *" TO PRT-INV-DESC.
064900
065000 621-CONT.
065100     MOVE INV-HDR-5          TO  PRINT-REC.
065200     MOVE 1                  TO  LINE-ADV.
065300     WRITE PRINT-REC BEFORE ADVANCING LINE-ADV LINES.
065400     ADD 1 TO ITMS-PER-PAGE.
065500     GO TO 623-CONT.
065600
065700 622-PRT-PHYS-INV-TOP.
065800     MOVE SPACES             TO  PRINT-REC.
065900     WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
066000     ADD 1 TO PG-CTR.
066100     MOVE PG-CTR             TO  PRT-INV-PG.
066200     MOVE 2                  TO  LINE-ADV.
066300     WRITE PRINT-REC FROM INV-HDR-1 BEFORE ADVANCING LINE-ADV LINES.
066400     WRITE PRINT-REC FROM INV-HDR-2 BEFORE ADVANCING LINE-ADV LINES.
066500     MOVE 1                  TO  LINE-ADV.
066600     WRITE PRINT-REC FROM INV-HDR-3 BEFORE ADVANCING LINE-ADV LINES.
066700     MOVE 2                  TO  LINE-ADV.
066800     WRITE PRINT-REC FROM INV-HDR-4
066900          BEFORE ADVANCING LINE-ADV LINES.
067000
067100 623-CONT.
067200     PERFORM RETURN-RCD.
067300     IF EOF-SW = "N"
067400         GO TO 62-PHYS-INV.
067500     GO TO WR-X.
067600
067700 62-X.
067800     EXIT.
067900
       COPY OVRPFCALL OF COPYLIB.
068000
068100 99-CALL-DBEXPLAIN.
068200     CALL "DBEXPLAIN" USING STATUS-AREA.
068300
068400  RETURN-RCD.
068500         RETURN SORT-FILE
068600             AT END MOVE SPACES TO SORT-RCD
068700                    MOVE "Y" TO EOF-SW.
068800 WR-X.
068900     EXIT.
