000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TRPTHU.
000400 AUTHOR.         N W REGIMBAL.
000500*INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
000600*DATE-WRITTEN.   DEC 05, 1980.
000700*REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
000800*                CORP-CODES AND ITEM STATUS PER CODE.
000900*
001000*                JULY 1, 1982, THE BUFFER AREA MSTORERM WAS
001100*                CHANGED IN PREPARATION FOR THE NEW DATA
001200*                BASE CHANGES. B.J.P.
001300*
001400*                JUNE 16,1983, ADDED DISBURSEMENT INSTRUCTIONS
001500*                TO PRINT LINE AND FIRST LINE OF DESCRIPTION.
001600*                ATL.
001700*
001800*                ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
001900*                MAY 21, 1985.    V.W.D.
002000*
002100*       ON AUGUST 16, 1985 ADDED A SORT OPTION TO THE PROGRAM.
002200*       THE PROGRAM MAY NOW SORT BY CORP-CODE OR HIGH-USAGE
002300*       AREA.  HIGH-USAGE IS NOW DETERMINED BY STR-HIGH-USAGE
002400*       INSTEAD OF DISB-INSTR||  IF THE REPORT IS SORTED BY
002500*       CODE A GRAND-TOTAL IS GIVEN AND IF THE REPORT IS SORTED
002600*       BY HIGH-USAGE AREA A TOTAL IS GIVEN FOR EACH AREA.
002700*
002800*                FEB 05, 1986
002900*                1. CALLS TESCSEQ FOR EXTERNALLY SUPPLIED
003000*                   ESCAPE SEQUENCES.
003100*                2. COPIES ESC-NAME FROM COPYLIB.DB.
003200*                3. MOVES ADDED TO INSERT PROPER ESCAPE
003300*                   SEQUENCES FOR PRINTING.
003400*                       C.R.K.
003500*
003600*      SEPTEMBER 8, 1986                   BARBARA WINTER.
003700*        1.  MODIFY REPORT TO SHOW COMPLETE DESCRIPTION
003800*            INSTEAD OF FIRST LINE ONLY.
003900*        2.  MODIFY REPORT TO SHOW BIN LOCATIONS.
004000*        3.  ALLOW USER TO SPECIFY UP TO THREE DIFFERENT
004100*            BIN LOCATIONS OR ENTER ALL LOCATIONS.
004200*
004300*      DECEMBER 1, 1986
004400*        EXPANDED THE SIZE OF ALL PRICE/COST FIELDS.  ALSO ADDED
004500*        COPYLIB AS NEEDED.        D.A. PLUM.
004600*
004700*      JANUARY 20, 1987
004800*        REPLACED CALLS TO DBEXPLAIN WITH TBLOWUP.
004900*        USER CAN NOW CHOOSE THE NUMBER OF REPTS DESIRED.
005000*                                   A. M. KRAUSS.
005100*
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 04, 1996   CA YODER
      *C   MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
      *C  08/05/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C
005200 ENVIRONMENT DIVISION.
005300 CONFIGURATION SECTION.
005400 SOURCE-COMPUTER.    HP-3000.
005500 OBJECT-COMPUTER.    HP-3000.
005600 SPECIAL-NAMES. C01 IS NEW-PAGE.
005800
005900 INPUT-OUTPUT SECTION.
006000 FILE-CONTROL.
006100     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
006300     SELECT SORT-FILE ASSIGN TO DISK-SORT.
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
006400
006500 DATA DIVISION.
006600 FILE SECTION.
006700 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
006800     LABEL RECORD IS OMITTED
006900     DATA RECORD IS PRT-REC.
007000 01  PRT-REC                 PIC X(132).
007100
       COPY MTLSSORT IN COPYLIB.

007200*SD  SORT-FILE RECORD CONTAINS 145 CHARACTERS
007300*    DATA RECORD IS SORT-REC.
007400*01  SORT-REC.
007500*     05  SRT-CORP-CODE      PIC X(8).
007600*     05  SRT-HIGH-USAGE     PIC X(2).
007700*     05  SRT-UM             PIC X(2).
007800*     05  SRT-ONHAND         PIC S9(8).
007900*     05  SRT-AVG-COST       PIC S9(11)V9(4).
008000*     05  SRT-DISB-INSTR     PIC X(30).
      *     05  SRT-LAST-IDATE-CN.
      *         10  SRT-CC         PIC XX.
008100*         10  SRT-LAST-IDATE.
008200*             15  SRT-YY     PIC XX.
008300*             15  SRT-MM     PIC XX.
008400*             15  SRT-DD     PIC XX.
008500*     05  SRT-LOC1           PIC X(12).
008600*     05  SRT-LOC2           PIC X(12).
008700*     05  SRT-LOC3           PIC X(12).
008800*     05  SRT-LOC4           PIC X(12).
008900*     05  SRT-LOC5           PIC X(12).
009000*     05  SRT-LOC6           PIC X(12).
009100
       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

009200 WORKING-STORAGE SECTION.
009300
009400 COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.
009500
009600 77  NO-ARG                  PIC X     VALUE SPACE.
009700 77  LINE-K                  PIC 99    VALUE 60 COMP-4.
009800 77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
009900 77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
010000 77  GRAND-TOTAL             PIC S9(14)V9(4) VALUE +0.
010100 77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
010200 77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
010300 77  CODE-ARG                PIC X(8)  VALUE SPACES.
       77  SUB                     PIC 9(3)  VALUE 0.
       77  RET-CODE                PIC X(2)  VALUE SPACES.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
010400
010500 01  DUMMY                        PIC 99.
010600 01  PREV-CODE                    PIC X(7)  VALUE SPACES.
010700 01  PREV-HIGH-USAGE              PIC XX   VALUE SPACES.
010800 01  HU-TOTAL                     PIC S9(14)V9(4) VALUE +0.
010900
011000*01  TEMP-HIGH-USAGE.
011100*    05  T-DATA  OCCURS 6 TIMES INDEXED BY T-INDEX.
011200*        10  T-HU                 PIC X(2).
011300
9406CK 01  SCOPE   PIC X.
011300
012100**************************************************************
012200**                                                          **
012300**            E S C A P E   S E Q U E N C E S               **
012400**                                                          **
012500**************************************************************
012600
012700 01  COMPRESS-PRINT             PIC X(8).
012800
012900 01  NORMAL-PRINT               PIC X(8).
013000
013500 COPY ESCNAM2 IN COPYLIB.
013600
013700*---------- SPOOL2631
013800 01  SPOOLER-AREA.
013900     03  SPOOL-STAT              PIC S9      VALUE 0      COMP-4.
014000     03  SPOOL-PRT               PIC S9(2)   VALUE 0      COMP-4.
014100     03  SPOOL-COPIES            PIC S9(2)   VALUE 1      COMP-4.
014200     03  SPOOL-PRIOR             PIC S9      VALUE 0      COMP-4.
014300     03  SPOOL-MSG               PIC X(75)   VALUE SPACES.
014400
014500 01  SPOOL-LIMIT                PIC S9(8)    VALUE 100000  COMP-4.
014600 01  SPOOL-FEQ-NAME             PIC X(8)     VALUE "SXXXXXXX".
014700 01  MPLTINFO-ARG.
014800     05  MPLTINFO-SPOOLTYP-KEY  PIC X(1)  VALUE "*".
014900     05  MPLTINFO-PRT           PIC X(3).
015000
015100
015200 COPY THDPRTA IN COPYLIB.
015300
015400 COPY TBLOWUP IN COPYLIB.
015500
       COPY CDESC IN COPYLIB.

       COPY TCHKBLKT IN COPYLIB.

015600
015700 01  MESSAGE-AREA.
015800     05  NO-SORTED-RECORDS   PIC X(31) VALUE
015900                             "ZERO CODES QUALIFIED FOR REPORT".
016000
016100 01  SWITCH-AREA.
016200     05  END-OF-INPUT-FILE               PIC X VALUE "N".
016300         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
016400     05  END-OF-SORT-FILE                PIC X VALUE "N".
016500         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
016600     05  BLOWUP-SWITCH                   PIC X VALUE "N".
016700
016800 01  DSET-NAMES.
016900     05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
017000     05  DSET-DDESC      PIC X(6)  VALUE "DDESC;".
017100
017200 01  DISPLAY-AREA.
017300     05  FILLER              PIC XX    VALUE "**".
017400     05  DISPLAY-MSG         PIC X(27) VALUE SPACES.
017500     05  FILLER              PIC XX    VALUE "**".
017600     05  DISPLAY-STAT        PIC S9(4) VALUE ZEROES.
017700     05  FILLER              PIC XX    VALUE "**".
017800
017900 01  TIME-SAVE.
018000     05  HRS-SAVE            PIC XX.
018100     05  MIN-SAVE            PIC XX.
018200     05  SEC-SAVE            PIC XX.
018300
018400 COPY DATAB IN COPYLIB.
018500
018600 COPY VCOMAREA IN COPYLIB.
018700
018800 COPY MSTORERM IN COPYLIB.
018900
019000 COPY DDESC IN COPYLIB.
019100
       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.

019200*01  HDR-1.
019300*    05  FILLER      PIC X(10) VALUE "  TRPTHU  ".
019400*    05  FILLER      PIC X(25) VALUE SPACES.
019500*    05  FILLER      PIC X(20) VALUE "C O R P O R A T E   ".
019600*    05  FILLER      PIC X(19) VALUE "C O D E   I T E M S".
019700*    05  FILLER      PIC X(28) VALUE SPACES.
019800*    05  PRT-DATE.
019900*        10  PRT-MM  PIC XX    VALUE SPACES.
020000*        10  FILLER  PIC X     VALUE SPACES.
020100*        10  PRT-DD  PIC XX    VALUE SPACES.
020200*        10  FILLER  PIC X     VALUE SPACES.
020300*        10  PRT-YY  PIC XX    VALUE SPACES.
020400*    05  FILLER      PIC X(4)  VALUE SPACES.
020500*    05  PRT-TIME            PIC X(8).
020600*
020700*01  HDR-2.
020800*    05  FILLER      PIC X(7)  VALUE "  PAGE ".
020900*    05  PRT-PAGE    PIC 999   VALUE ZEROS.
021000*    05  FILLER      PIC X(29)  VALUE SPACES.
021100*    05  FILLER      PIC X(19)  VALUE "H I G H   U S A G E".
021200*    05  FILLER      PIC X(12)  VALUE "   C L A S S".
021300*    05  FILLER      PIC X(34)  VALUE SPACES.
021400*    05  FILLER      PIC X(12) VALUE "DATE        ".
021500*    05  FILLER      PIC X(4)  VALUE "TIME".
021600*    05  FILLER      PIC X(7)  VALUE SPACES.
021700
021800 01  HDR-3.
021900     05  FILLER      PIC X(9)  VALUE "CORPCODE ".
022000     05  FILLER      PIC X(13) VALUE " DESCRIPTION ".
022100     05  FILLER      PIC X(29) VALUE SPACES.
022200     05  FILLER      PIC X(20)  VALUE "HIGH USAGE AREA".
022300     05  FILLER      PIC X(13) VALUE "LAST ISSUE   ".
022400     05  FILLER      PIC X(10) VALUE "ONHAND  UM".
022500     05  FILLER      PIC X(9)  VALUE SPACES.
022600     05  PRT-COST-LIT PIC X(8).
022700     05  FILLER      PIC X(9)  VALUE SPACES.
022800     05  FILLER      PIC X(12) VALUE "  TOTAL COST".
022900
023000 01  PRT-ITEM-DATA.
023100     05  PRT-CODE       PIC X(7)  VALUE SPACES.
023200     05  FILLER         PIC X(3)  VALUE SPACES.
023300     05  PRT-DISB       PIC X(30) VALUE SPACES.
023400     05  FILLER         PIC X(23) VALUE SPACES.
023500     05  PRT-HIGH-USAGE PIC X(10) VALUE SPACES.
023600     05  PRT-LAST-IDATE PIC X(8) VALUE SPACES.
023700     05  FILLER         PIC X VALUE SPACES.
023800     05  PRT-ONHAND     PIC Z(7)9 VALUE ZEROS.
023900     05  FILLER         PIC X(2)  VALUE SPACES.
024000     05  PRT-UM         PIC X(2)  VALUE SPACES.
024100     05  FILLER         PIC X(1)  VALUE SPACES.
024200     05  PRT-AVG-COST   PIC Z(10)9.9(4) VALUE ZEROES.
024300     05  FILLER         PIC X(3)  VALUE SPACES.
024400     05  PRT-TOTAL      PIC Z(12)9.9(4) VALUE ZEROES.
024500
024600 01  PRT-LOC-DATA.
024700     05  FILLER        PIC X(10) VALUE SPACES.
024800     05  FILLER        PIC X(16) VALUE "BIN LOCATIONS:  ".
024900     05  PRT-LOC1      PIC X(14) VALUE SPACES.
025000     05  PRT-LOC2      PIC X(14) VALUE SPACES.
025100     05  PRT-LOC3      PIC X(14) VALUE SPACES.
025200     05  PRT-LOC4      PIC X(14) VALUE SPACES.
025300     05  PRT-LOC5      PIC X(14) VALUE SPACES.
025400     05  PRT-LOC6      PIC X(14) VALUE SPACES.
025500
025600 01  PRT-DESC-DATA.
025700     05  FILLER        PIC X(10) VALUE SPACES.
025800     05  PRT-DESC      PIC X(80) VALUE SPACES.
025900     05  FILLER        PIC X(42) VALUE SPACES.
026000
026100 01  TOTAL-LINE.
026200     05  FILLER        PIC X(36)      VALUE SPACES.
026300     05  FILLER        PIC X(27)
026400                 VALUE "TOTAL FOR HIGH USAGE AREA".
026500     05  TOT-HIGH-USAGE        PIC X(2).
026600     05  P-TOTAL PIC Z(13)9.9(4) VALUE ZEROES.
026700
026800 01  GRAND-TOTAL-LINE.
026900     05  FILLER        PIC X(53)      VALUE SPACES.
           05  FILLER        PIC X(13)  VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS  PIC Z(4)9  VALUE ZERO.
           05  FILLER        PIC X(3)   VALUE SPACES.
027000     05  FILLER        PIC X(37)
027100                 VALUE "TOTAL FOR ALL HIGH USAGE AREAS".
027200     05  FILLER                PIC X(2) VALUE SPACES.
027300     05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROES.
027400
027500 01  DASHES.
027600     05  FILLER         PIC X(36) VALUE SPACES.
027700     05  FILLER         PIC X(49) VALUE ALL "-".
027800
      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
011400*01  SORT-DATA.
011500*    05  DE-KEY                   PIC X.
011600*    05  DE-AREA  OCCURS 3 TIMES  PIC X(2).
011700*    05  DE-ALL                   PIC X.
011800*        88  ALL-AREAS                 VALUE "X".
011900*    05  FILLER                   PIC X(72).
      *    05  FILLER                   PIC X(81).
012000
027900*PROCEDURE DIVISION USING HD-ROUTE-DATA, SORT-DATA.
       PROCEDURE DIVISION.
028000 BEGIN-SORT SECTION.
028100 1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.
           ACCEPT MTLS-DATA-LINE-3.

           MOVE "N" TO END-OF-INPUT-FILE, END-OF-SORT-FILE,
             BLOWUP-SWITCH.
           MOVE 60 TO LINE-K.
           MOVE 0 TO PAGE-K, TOTAL-COST, GRAND-TOTAL.
           OPEN INPUT MSTORERM-I, DDESC-I, DMANPART-I.
028200     CALL "TESCSEQ" USING ESC-NAME.
028300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
028400     MOVE CHAR-10PI       TO NORMAL-PRINT.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
028900     OPEN OUTPUT PRINT-FILE.
029100     DISPLAY HD-ROUTE-DATA.
029300     DISPLAY MTLS-DATA-LINE-1.
           DISPLAY MTLS-DATA-LINE-1B.
           DISPLAY MTLS-DATA-LINE-2.
           DISPLAY MTLS-DATA-LINE-3.
029500     MOVE "DHDR85.PUB" TO HD-FILE-NAME.
029600     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME,
029700        FNUM, HD-ROUTE-DATA, ESC-NAME.
029800     IF PAPER-IS-132-COLS
029900          NEXT SENTENCE
030000     ELSE
030100         WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
030300     IF HD-RET-CODE NOT = 0
030400         DISPLAY "THDRPT ERROR".
030500     MOVE HD-SPOOLER-NUMBER TO SPOOL-PRT.

           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "  TRPTHU"         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.

030600     MOVE 1 TO DATE-MODE.
030700     CALL "TDATECHK" USING DATE-CHECK-AREA.
030800     MOVE DATE-SLASH-OUT TO PRT-DATE.
030900     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
031000
           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-HU AFTER ADVANCING 1 LINE.

031600*    IF DE-KEY = "C"
031700*    SORT SORT-FILE
031800*         ON ASCENDING KEY SRT-CORP-CODE
031900*         INPUT  PROCEDURE IS 8-INPUT-RECORDS
032000*         OUTPUT PROCEDURE IS 9-WRITE-RECORDS
032100*    ELSE
032200*    SORT SORT-FILE
032300*         ON ASCENDING KEY SRT-HIGH-USAGE, SRT-CORP-CODE
032400*         INPUT  PROCEDURE IS 8-INPUT-RECORDS
032500*         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

           COPY MTLSPROC IN COPYLIB.

032600 2-EOJ.
032700     IF PAPER-IS-132-COLS
032800         NEXT SENTENCE
032900     ELSE
033000         WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0
033200
033300     MOVE HD-NO-OF-COPIES TO SPOOL-COPIES.
033400
033500
033900     CLOSE PRINT-FILE.
           CLOSE MSTORERM-I, DDESC-I, DMANPART-I.
034100     GOBACK.
034200
034300
034400*************************************************************
034500*                    BLOWUP   ROUTINE                       *
034600*************************************************************
034700 2-BLOWUP.
034900     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
035000
035100     MOVE "TRPTHU" TO BU-PGM-NAME.
035200     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
035300           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
035400           BU-DISPLAY-AREA.
035500
035600 7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *8-INPUT-RECORDS-PARA.
      *    MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "START ERR MSTORERM 8-IR" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
035700*    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
035800*            ALL-INPUT-RECORDS-PROCESSED.
035900*    GO TO 8-IR-EXIT.
036000*
036100*81-PROCESS-INPUT-RECORDS.
036200*    CALL "DBGET" USING BASE DSET-MSTORERM MODE2 STATUS-AREA
036300*                  ALL-ITEM-LIST BUF-MSTORERM NO-ARG.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
036400*    IF FILE-STATUS-1 = "1"
036500*        MOVE "Y" TO END-OF-INPUT-FILE
036600*        GO TO 81-PIR-EXIT
036700*    ELSE
036800*    IF FILE-STATUS NOT = "00"
036900*        MOVE "DBGET ERROR PARA 81-PIR    " TO BU-DISPLAY-MSG
037000*        GO TO 2-BLOWUP.
037100*
037200*    MOVE SPACES TO TEMP-HIGH-USAGE.
037300*    MOVE STR-HIGH-USAGE TO TEMP-HIGH-USAGE.
037400*    SET T-INDEX TO 1.
037500*    IF TEMP-HIGH-USAGE NOT = SPACES
037600*        PERFORM 811-CHECK-USAGE 6 TIMES.
037700*    GO TO 81-PIR-EXIT.
037800*
037900*811-CHECK-USAGE.
038000*    MOVE SPACES                            TO SORT-REC.
038100*    IF T-HU (T-INDEX) NOT = SPACES
038200*      IF ALL-AREAS
038300*        MOVE CORP-CODE                     TO SRT-CORP-CODE
038400*        MOVE T-HU (T-INDEX)                TO SRT-HIGH-USAGE
038500*        MOVE STR-AVG-COST                  TO SRT-AVG-COST
038600*        MOVE STR-UM                        TO SRT-UM
038700*        MOVE STR-ONHAND                    TO SRT-ONHAND
038800*        MOVE STR-DISB-INSTR                TO SRT-DISB-INSTR
038900*        MOVE STR-LAST-IDATE-CN             TO SRT-LAST-IDATE-CN
039000*        MOVE STR-LOC (1)                   TO SRT-LOC1
039100*        MOVE STR-LOC (2)                   TO SRT-LOC2
039200*        MOVE STR-LOC (3)                   TO SRT-LOC3
039300*        MOVE STR-LOC (4)                   TO SRT-LOC4
039400*        MOVE STR-LOC (5)                   TO SRT-LOC5
039500*        MOVE STR-LOC (6)                   TO SRT-LOC6
039600*        RELEASE SORT-REC
039700*    ELSE
039800*     IF T-HU (T-INDEX) = DE-AREA (1) OR
039900*      T-HU (T-INDEX) = DE-AREA (2) OR
040000*      T-HU (T-INDEX) = DE-AREA (3)
040100*        MOVE CORP-CODE                     TO SRT-CORP-CODE
040200*        MOVE T-HU (T-INDEX)                TO SRT-HIGH-USAGE
040300*        MOVE STR-AVG-COST                  TO SRT-AVG-COST
040400*        MOVE STR-UM                        TO SRT-UM
040500*        MOVE STR-ONHAND                    TO SRT-ONHAND
040600*        MOVE STR-DISB-INSTR                TO SRT-DISB-INSTR
040700*        MOVE STR-LAST-IDATE-CN             TO SRT-LAST-IDATE-CN
040800*        MOVE STR-LOC (1)                   TO SRT-LOC1
040900*        MOVE STR-LOC (2)                   TO SRT-LOC2
041000*        MOVE STR-LOC (3)                   TO SRT-LOC3
041100*        MOVE STR-LOC (4)                   TO SRT-LOC4
041200*        MOVE STR-LOC (5)                   TO SRT-LOC5
041300*        MOVE STR-LOC (6)                   TO SRT-LOC6
041400*        RELEASE SORT-REC.
041500*    SET T-INDEX UP BY 1.
041600*
041700*81-PIR-EXIT.
041800*    EXIT.
041900
042000 7-IR-EXIT.
042100     EXIT.
042200
042300 8-WRITE-RECORDS SECTION.
       8-WRITE-RECORDS-PARA.
042400     RETURN SORT-FILE AT END
042500         MOVE "Y" TO END-OF-SORT-FILE
042600         MOVE  1  TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
042700*        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
042800*        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
042900         WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
043000         MOVE NO-SORTED-RECORDS TO PRT-REC
043100         WRITE PRT-REC AFTER ADVANCING 2 LINES
043200         GO TO 2-EOJ.
043300
           PERFORM 9-MOVE-CONTROL-BREAK.

043400     PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
043500             UNTIL ALL-SORTED-RECORDS-PROCESSED.
043600*    IF DE-KEY = "C"

      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               MOVE CODES-RELEASED TO PRT-GRD-ITMS
043700         MOVE GRAND-TOTAL TO PRT-GRD-TOTAL
043800         WRITE PRT-REC FROM GRAND-TOTAL-LINE AFTER
043900         ADVANCING 3 LINES.
044000*    ELSE
044100*          MOVE SRT-HIGH-USAGE TO TOT-HIGH-USAGE
044200*          MOVE HU-TOTAL TO P-TOTAL
044300*          WRITE PRT-REC FROM TOTAL-LINE AFTER
044400*                      ADVANCING 2
044500*          MOVE DASHES TO PRT-REC
044600*          WRITE PRT-REC AFTER ADVANCING 1.
044700     GO TO 8-WR-EXIT.
044800
044900 82-PROCESS-SORTED-RECORDS.
045000     IF LINE-K > 57
               PERFORM 9-CHECK-HEADINGS.
045800     MOVE SPACES                   TO PRT-REC, PRT-ITEM-DATA.
045900     MOVE  SRT-CORP-CODE                    TO CODE-ARG.
046000
046100*    IF (DE-KEY = "C") AND (PREV-CODE = SRT-CORP-CODE)
046200*        MOVE SRT-HIGH-USAGE TO PRT-HIGH-USAGE
046300*        WRITE PRT-REC FROM PRT-ITEM-DATA AFTER
046400*                            ADVANCING 1
046500*        ADD 1 TO LINE-K
046600*        PERFORM 92-RETURN-SORT
046700*        GO TO 92-PSR-EXIT
046800*    ELSE
046900*       IF (DE-KEY NOT = "C") AND (SRT-HIGH-USAGE NOT =
047000*          PREV-HIGH-USAGE) AND (PREV-HIGH-USAGE NOT = SPACES)
047100*          MOVE PREV-HIGH-USAGE TO TOT-HIGH-USAGE
047200*          MOVE HU-TOTAL TO P-TOTAL
047300*          WRITE PRT-REC FROM TOTAL-LINE AFTER
047400*                      ADVANCING 2
047500*          MOVE DASHES TO PRT-REC
047600*          WRITE PRT-REC AFTER ADVANCING 1
047700*          MOVE ZERO TO HU-TOTAL
047800*          ADD 3 TO LINE-K.
047900*
048000*    MOVE SRT-HIGH-USAGE TO PREV-HIGH-USAGE.
048100*
048200*
048300*    CALL "DBFIND" USING BASE, DSET-DDESC, MODE1, STATUS-AREA,
048400*            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
048600*        MOVE "DBFIND ERR DDESC" TO BU-DISPLAY-MSG
048700*        PERFORM 2-BLOWUP.
048800*
048900*    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
049000*            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
049100*    IF COND-WORD = 0
049200*        MOVE DESC-DATA                     TO PRT-DESC
049300*    ELSE
049400*        MOVE "* NO DESCRIPTION ON FILE *"  TO PRT-DESC.

           MOVE SRT-KEYWD-MOD      TO  PRT-DESC.
049500
049600 92-CONT.
049700     COMPUTE TOTAL-COST  =  SRT-ONHAND * SRT-COST.
049800     ADD TOTAL-COST TO HU-TOTAL.
049900     MOVE SRT-CORP-CODE TO PREV-CODE.
050000     ADD TOTAL-COST                         TO GRAND-TOTAL.
050100     MOVE SRT-CORP-CODE                     TO PRT-CODE.
050300     MOVE SRT-ONHAND                        TO PRT-ONHAND.
050400     MOVE SRT-UM                            TO PRT-UM.
050500     MOVE SRT-COST                          TO PRT-AVG-COST.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "2"
               INITIALIZE BUF-MSTORERM
           ELSE
           IF FILE-STATUS NOT = "00"
              MOVE "MSTORERM DBGET ERR: 92-CONT" TO BU-DISPLAY-MSG
              PERFORM 2-BLOWUP.
           MOVE STR-HIGH-USAGE-AREA (1)           TO PRT-HIGH-USAGE.
050600     MOVE STR-DISB-INSTR                    TO PRT-DISB.
050700     MOVE 4                            TO DATE-MODE.
050800     MOVE SRT-LAST-IDATE               TO DATE-VALIDATE-IN.
050900     CALL "TDATECHK"  USING DATE-CHECK-AREA.
051000     MOVE DATE-SLASH-OUT                TO PRT-LAST-IDATE.
051100     MOVE STR-LOC (1)                  TO PRT-LOC1.
051200     MOVE STR-LOC (2)                  TO PRT-LOC2.
051300     MOVE STR-LOC (3)                  TO PRT-LOC3.
051400     MOVE STR-LOC (4)                  TO PRT-LOC4.
051500     MOVE STR-LOC (5)                  TO PRT-LOC5.
051600     MOVE STR-LOC (6)                  TO PRT-LOC6.
051700     MOVE TOTAL-COST                        TO PRT-TOTAL.
051800     WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 2 LINES.
051900     WRITE PRT-REC FROM PRT-LOC-DATA  AFTER ADVANCING 1 LINES.
052000     WRITE PRT-REC FROM PRT-DESC-DATA AFTER ADVANCING 1 LINES.
052100     ADD 4              TO LINE-K.
052200
           PERFORM VARYING SUB FROM 2 BY 1 UNTIL SUB > 6
               IF STR-HIGH-USAGE-AREA (SUB) > SPACES
                   PERFORM 9-PRINT-USAGE
               END-IF
           END-PERFORM.

      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

           IF LINE-K > 57
               PERFORM 9-CHECK-HEADINGS.

           IF MTLS-DESC-OPT NOT = "X"
               GO TO 82-RETURN-SORT.

052300 92-GET-DESC.
052400*----------  PRINT REST OF DESCRIPTION
052500*    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
052600*            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
           MOVE 0 TO COND-WORD.
           READ DDESC-I NEXT INTO BUF-DDESC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
052700     IF COND-WORD = 0
052800        MOVE DESC-DATA                      TO PRT-DESC
052900      ELSE
053000        GO TO 82-RETURN-SORT.
053100     WRITE PRT-REC FROM PRT-DESC-DATA AFTER ADVANCING 1 LINES.
053200     ADD 1 TO LINE-K.
053300     IF LINE-K > 57
               PERFORM 9-CHECK-HEADINGS.

054100     GO TO 92-GET-DESC.
054200
054300 82-RETURN-SORT.
054400     RETURN SORT-FILE AT END
054500         MOVE "Y"                           TO END-OF-SORT-FILE.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   ADD 1              TO  LINE-K
                   WRITE PRT-REC AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       PERFORM 9-CHECK-HEADINGS.
054600
054700 82-PSR-EXIT.
054800     EXIT.
054900
055000 8-WR-EXIT.
055100     EXIT.
055200
       9-UTILITY SECTION.

       9-PRINT-USAGE.
           MOVE SPACES                     TO PRT-REC, PRT-ITEM-DATA.
           MOVE STR-HIGH-USAGE-AREA (SUB)  TO PRT-HIGH-USAGE.
           WRITE PRT-REC FROM PRT-ITEM-DATA AFTER
                               ADVANCING 1.
           ADD 1 TO LINE-K.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

       9-CHECK-HEADINGS.
           ADD     1      TO PAGE-K.
           MOVE    1      TO LINE-K.
           MOVE PAGE-K    TO PRT-PAGE.
           ADD     3      TO LINE-K.
           WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE.
           WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE.
           IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
             MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
             WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
             ADD   1      TO LINE-K.
      *    WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE.
      *    WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES.
           WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
