       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TRPTOBS.
       AUTHOR.         N W REGIMBAL.
       DATE-WRITTEN.   DEC 05, 1980.
      *REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
      *                CORP-CODES AND ITEM STATUS PER CODE.
      *
      *                ON JULY 13, 1982, THE BUFFER AREA MSTORERM WAS
      *                CHANGED IN PREPARATION FOR THE NEW DATA
      *                BASE CHANGES. B.J.P.
      *
      *                JUNE 1,1983 - ADDED ALL LINES OF DESC
      *                  AND SEPARATED ITEMS WITH ONHANDS
      *                  FROM THOSE WITH ZERO ONHANDS.  ATL.
      *
      *    ON DECEMBER 14, 1984, ADDED A FRONT END OPTION PROGRAM FOR
      *    THIS REPORT.  THE OPTION PARAMETERS ARE COBOL "ACCEPT"ed
      *    THRU THE JOB STREAM, WHICH IS CREATED AND STREAMED
      *    INTERACTIVELY BY THE OPTION PROGRAM "TR24SCRN".  THE
      *    FOLLOWING OPTIONS ARE ADDED:
      *      1.  USER MAY NOW REPORT ON ONLY OBSOLETE ITEMS THAT EXCEED A
      *          CERTAIN DOLLAR VALUE (SPECIFIED IN OPTION PROGRAM).
      *      2.  USER MAY NOW EXCLUDE ITEMS THAT MAY HAVE APPEARED
      *          ON AN EARLIER OVERAGE ITEMS REPORT.  THE MINIMUM
      *          VALUE FOR OVERAGE ITEMS TO EXCLUDE, AND PROJECTED
      *          OVERAGE MONTHS PARAMETER IS ENTERED BY USER.
      *      3.  USER MAY NOW EXCLUDE ITEMS THAT MAY HAVE APPEARED
      *          ON AN EARLIER SLOW MOVER REPORT.  THE MINIMUM VALUE
      *          FOR SLOW MOVERS TO EXCLUDE, AND THE SLOW MOVER DATE OF
      *          THE EARLIER REPORT, MUST BE ENTERED.
      *
      *    ON DECEMBER 28, 1984, MADE THE FOLLOWING CHANGES:
      *    1.  ADDED A CALL TO THE SUBPROG "THDPRT2" TO PRINT A HEADER
      *    PAGE FROM THE FILE "DHDR24.PUB".
      *    2.  ADDED AN ACCEPT OF ROUTING DATA WHICH IS PROVIDED BY
      *    THE OPTION PROGRAM.
      *      3.  ELIMINATED "TR24SCRN" AS THE OPTION PROGRAM.
      *      "TRSCREEN" WILL NOW BE THE OPTION PROGRAM ("TRSCREEN" IS A
      *      UNIVERSAL REPORT OPTION PROGRAM WHICH WILL HANDLE MANY
      *      REPORTS).
      *    CIH.
      *
      *       ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
      *       MAY 21, 1985.    V.W.D.
      *
      *    ON NOVEMBER 26, 1986 - EXPANDED THE SIZE OF ALL COST/PRICE
      *    FIELDS AND ADDED COPYLIB TO THIS PROGRAM.
      *                                  D.A. PLUM.
      *
      *    ON JANUARY 1987 - ADDED TBLOWUP LOGIC.
      *                                  A. M. KRAUSS.
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  28DEC1994     DAVE PLUM
      *C   REVISED PROGRAM TO USE SUBPROGRAM CDESC TO OBTAIN EACH
      *C   STOREROOM CODE'S FULL DESCRIPTION WHEN PRINTING THE REPORT
      *C   IN THE OUTPUT PROCEDURE.  THE PROGRAM HAD BEEN SIMPLY USING
      *C   DATASET DDESC WHICH DOES NOT CONTAIN THE MANUFACTURER
      *C   INFORMATION.
      *C
      *C 09/13/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY ON SLOW MOVER DATE FOR
      *C   COMPARISONS.
      *C
      *C  07/16/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.
           C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
9412       SELECT DDESC-I
9412              ASSIGN TO DATABASE-MCFLCS1401
9412              ORGANIZATION IS INDEXED
9412                ACCESS MODE IS DYNAMIC
9412              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
9412                WITH DUPLICATES
9412              FILE STATUS IS FILE-STATUS.
           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  ONLINE-PRT RECORD CONTAINS 132 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS PRT-REC.
       01  PRT-REC                 PIC X(132).

       COPY MTLSSORT IN COPYLIB.

      *SD  SORT-FILE RECORD CONTAINS 48 CHARACTERS
      *    DATA RECORD IS SORT-REC.
      *01  SORT-REC.
      *     05  SRT-TYPE           PIC X.
      *     05  SRT-CORP-CODE      PIC X(8).
      *     05  SRT-UM             PIC X(2).
      *     05  SRT-ONHAND         PIC S9(8).
      *     05  SRT-AVG-COST       PIC S9(11)V9(4).
      *     05  SRT-LAST-IDATE     PIC X(6).
      *     05  SRT-MTH-FCST       PIC S9(8).

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200   OF MCFLCS0201.

9412   FD  DDESC-I
9412       LABEL RECORDS ARE STANDARD.
9412   01  DDESC-REC-I.
9412       COPY DDS-MCRPCS1400   OF MCFLCS1401.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       WORKING-STORAGE SECTION.
       77  NO-ARG                  PIC X     VALUE SPACE.
      *77  OPTION-HDR-FLAG         PIC X(1)  VALUE "N".
       77  LINE-K                  PIC 99    VALUE 60 COMP-4.
       77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
       77  ITEM-CTR                PIC 9(5)  VALUE 0.
       77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
      *77  PROJECTED-ONHAND        PIC S9(9) VALUE 0.
       77  OVERAGE                 PIC S9(9) VALUE 0.
       77  OVERAGE-COST            PIC S9(13)V9(4) VALUE +0.
       77  GRAND-TOTAL             PIC S9(14)V9(4) VALUE +0.
       77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
       77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
       77  CODE-ARG                PIC X(8)  VALUE SPACES.
       77  SUB                     PIC S9(4) COMP VALUE +0.

       01  SLOW-MOVE-DATE-CN.
           05  SLOW-MOVE-DATE-CC   PIC X(2)  VALUE SPACES.
           05  SLOW-MOVE-DATE      PIC X(6)  VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1       PIC X     VALUE SPACES.
           05  FILE-STATUS-2       PIC X     VALUE SPACES.

9406CK 01  SCOPE   PIC X.

       COPY TDATECHK IN COPYLIB.

      *---------- PARMS FOR CALL TO "THDPRT2" - HEADER PAGE SUBPROG.
       COPY THDPRTA IN COPYLIB.

       COPY ESCNAM2 IN COPYLIB.

9412DP COPY CDESC   IN COPYLIB.
9412DP
9412DP 01  RET-CODE                 PIC X(2)  VALUE SPACES.

       COPY TCHKBLKT IN COPYLIB.

       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       01  JCW-PARMS.
           05  JCW-NAME             PIC X(12) VALUE SPACES.
           05  JCW-VALUE            PIC S9(4) COMP VALUE ZEROES.
           05  JCW-STATUS           PIC S9(4) COMP VALUE ZEROES.

       01  COMP-ESC-SEQ             PIC X(8)  VALUE SPACES.
       01  STAND-ESC-SEQ            PIC X(8)  VALUE SPACES.

       01  MESSAGE-AREA.
           05  NO-SORTED-RECORDS   PIC X(31) VALUE
                                   "ZERO CODES QUALIFIED FOR REPORT".

       01  SWITCH-AREA.
           05  END-OF-INPUT-FILE               PIC X VALUE "N".
               88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
           05  END-OF-SORT-FILE                PIC X VALUE "N".
               88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
           05  ONHAND-SWITCH                   PIC X VALUE "N".
           05  BLOWUP-SWITCH                   PIC X VALUE "N".

       COPY TBLOWUP IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY CCRTFILE IN COPYLIB.
       COPY CCHKOBJ  IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.

       01  DATE-WORKAREA.
           05  MDY-DATE.
            07  MDY-MM                PIC XX.
            07  MDY-DD                PIC XX.
            07  MDY-YY                PIC XX.
           05  UNEDITED-DATE.
            07  YY                    PIC XX.
            07  MM                    PIC XX.
            07  DD                    PIC XX.
           05  EDITED-DATE.
            07  PRT-MM                PIC XX     VALUE SPACES.
            07  FILLER                PIC X      VALUE "/".
            07  PRT-DD                PIC XX     VALUE SPACES.
            07  FILLER                PIC X      VALUE "/".
            07  PRT-YY                PIC XX     VALUE SPACES.

       COPY DATAB IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
9412DP*    05  DSET-DDESC          PIC X(6)  VALUE "DDESC;".

       COPY MSTORERM IN COPYLIB.

       COPY DDESC    IN COPYLIB.

9412DP*COPY DDESC IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.

      *01  HDR-1.
      *    05  FILLER        PIC X(10) VALUE "  TRPTOBS ".
      *    05  FILLER        PIC X(25) VALUE SPACES.
      *    05  FILLER        PIC X(20) VALUE "C O R P O R A T E   ".
      *    05  FILLER        PIC X(19) VALUE "C O D E   I T E M S".
      *    05  FILLER        PIC X(28) VALUE SPACES.
      *    05  PRT-DATE      PIC X(8)  VALUE SPACES.
      *    05  FILLER        PIC X(4)  VALUE SPACES.
      *    05  PRT-TIME      PIC X(8) VALUE SPACE.
      *
      *01  HDR-2.
      *    05  FILLER        PIC X(7)  VALUE "  PAGE ".
      *    05  PRT-PAGE      PIC 999   VALUE ZEROS.
      *    05  FILLER        PIC X(28) VALUE SPACES.
      *    05  FILLER        PIC X(15) VALUE "O B S O L E T E".
      *    05  FILLER        PIC X(18) VALUE "   M A T E R I A L".
      *    05  FILLER        PIC X(33) VALUE SPACES.
      *    05  FILLER        PIC X(12) VALUE "DATE        ".
      *    05  FILLER        PIC X(4)  VALUE "TIME".
      *    05  FILLER        PIC X(7)  VALUE SPACES.

       01  HDR-3.
           05  FILLER        PIC X(9)  VALUE "CORPCODE ".
           05  FILLER        PIC X(13) VALUE " DESCRIPTION ".
           05  FILLER        PIC X(62) VALUE SPACES.
           05  FILLER        PIC X(10) VALUE "ONHAND  UM".
           05  FILLER        PIC X(9)  VALUE SPACES.
      *    05  FILLER        PIC X(11) VALUE "AVG-COST   ".
           05  PRT-COST-LIT  PIC X(8).
           05  FILLER        PIC X(9)  VALUE SPACES.
           05  FILLER        PIC X(12) VALUE "  TOTAL COST".

      *01  HDR-OPTIONS.
      *    05  MIN-OBS-AREA.
      *        10  FILLER    PIC X(11) VALUE "(MIN VALUE ".
      *        10  PRT-MIN-OBS PIC Z(7)9.
      *        10  FILLER      PIC X(10) VALUE " REPORTED)".
      *        10  FILLER      PIC X(1)  VALUE SPACES.
      *    05  MIN-SL-AREA.
      *        10  FILLER    PIC X(19) VALUE "(SLOW MOVERS SINCE ".
      *        10  PRT-SL-DT      PIC X(8).
      *        10  FILLER         PIC X(5)  VALUE " MIN ".
      *        10  PRT-MIN-SL     PIC Z(7)9.
      *        10  FILLER         PIC X(10) VALUE " EXCLUDED)".
      *        10  FILLER         PIC X(1)  VALUE SPACES.
      *    05  MIN-OV-AREA.
      *        10  FILLER         PIC X(7)  VALUE "(PROJ. ".
      *        10  FILLER         PIC X(12) VALUE "OVERAGE FOR ".
      *        10  PRT-OV-MTHS    PIC Z9.
      *        10  FILLER         PIC X(12) VALUE " MONTHS MIN ".
      *        10  PRT-MIN-OV     PIC Z(7)9.
      *        10  FILLER         PIC X(10) VALUE " EXCLUDED)".

       01  PRT-ITEM-DATA.
           05  PRT-CODE      PIC X(7)  VALUE SPACES.
           05  FILLER        PIC X(3)  VALUE SPACES.
           05  PRT-DESC      PIC X(69) VALUE SPACES.
           05  FILLER        PIC X(3)  VALUE SPACES.
           05  PRT-ONHAND    PIC Z(7)9 VALUE ZEROS.
           05  FILLER        PIC X(2)  VALUE SPACES.
           05  PRT-UM        PIC X(2)  VALUE SPACES.
           05  FILLER        PIC X(1)  VALUE SPACES.
           05  PRT-AVG-COST  PIC Z(10)9.9(4) VALUE ZEROES.
           05  FILLER        PIC X(3)  VALUE SPACES.
           05  PRT-TOTAL     PIC Z(12)9.9(4) VALUE ZEROES.

       01  PRT-DESC-DATA.
           05  FILLER        PIC X(10) VALUE SPACES.
           05  PRT-DESC1     PIC X(80) VALUE SPACES.
           05  PRT-DESC-LST-ISS  PIC X(11) VALUE "LAST ISSUE:".
           05  LAST-ISSUE-DATE  PIC X(8) VALUE SPACE.
           05  FILLER        PIC XX VALUE SPACES.
           05  PRT-DESC-MTH-FCST  PIC X(13) VALUE "MTH FORCAST:".
           05  PRT-MTH-FCST  PIC Z(7)9.

       01  GRAND-TOTAL-LINE.
           05  FILLER        PIC X(60) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-ITM-CTR   PIC ZZZZ9.
           05  FILLER        PIC X(3)  VALUE SPACES.
           05  FILLER        PIC X(19) VALUE "GRAND TOTAL OF ALL ".
           05  FILLER        PIC X(13) VALUE "STOCKOUT     ".
           05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROES.

      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
      *01  R24-REC.
      *    05  R24-MIN-OBS         PIC 9(8).
      *    05  R24-MIN-SL-OPT      PIC X(1).
      *    05  R24-SL-DT           PIC X(6).
      *    05  R24-MIN-SL          PIC 9(8).
      *    05  R24-MIN-OV-OPT      PIC X(1).
      *    05  R24-OV-MTHS         PIC 9(2).
      *    05  R24-MIN-OV          PIC 9(8).
      *    05  FILLER              PIC X(78).

      *PROCEDURE DIVISION USING HD-ROUTE-DATA, R24-REC.
       PROCEDURE DIVISION.
       BEGIN-SORT SECTION.
       1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

      *---------- DISPLAY ROUTING DATA AND OPTION CARD
           DISPLAY "ROUTING INFORMATION ENTERED WAS:".
           DISPLAY HD-ROUTE-DATA.
           DISPLAY "OPTION RECORD ENTERED WAS".
           DISPLAY MTLS-DATA-LINE-1.
           DISPLAY MTLS-DATA-LINE-2.
      *    DISPLAY R24-REC.
      *    MOVE R24-SL-DT         TO  MDY-DATE.
      *    MOVE MDY-MM            TO  MM, PRT-MM.
      *    MOVE MDY-DD            TO  DD, PRT-DD.
      *    MOVE MDY-YY            TO  YY, PRT-YY.
      *    MOVE 4 TO DATE-MODE.
      *    MOVE UNEDITED-DATE TO DATE-VALIDATE-IN.
      *    CALL "TDATECHK"  USING DATE-CHECK-AREA.
      *    MOVE DATE-SLASH-OUT TO PRT-SL-DT.
      *    MOVE UNEDITED-DATE     TO  SLOW-MOVE-DATE.
      *    IF YY > "70"
      *       MOVE "19" TO SLOW-MOVE-DATE-CC
      *    ELSE
      *       MOVE "20" TO SLOW-MOVE-DATE-CC.

      *---------- IF SPECIAL OPTIONS WERE CHOSEN, SET FLAG TO PRINT
      *---------- THE OPTION HEADER.  BLANK OUT ANY OPTIONS NOT CHOSEN.

      *    IF R24-MIN-OBS NOT NUMERIC
      *       MOVE ZEROS TO R24-MIN-OBS.
      *    IF R24-OV-MTHS NOT NUMERIC
      *       MOVE ZEROS TO R24-OV-MTHS.
      *    IF R24-MIN-SL NOT NUMERIC
      *       MOVE ZEROS TO R24-MIN-SL.
      *    IF R24-MIN-OV NOT NUMERIC
      *       MOVE ZEROS TO R24-MIN-OV.
      *    IF R24-MIN-OBS > 0
      *       MOVE R24-MIN-OBS            TO  PRT-MIN-OBS
      *       MOVE "Y"                    TO  OPTION-HDR-FLAG
      *    ELSE
      *        MOVE SPACES                 TO  MIN-OBS-AREA.
      *
      *    IF R24-MIN-SL-OPT = "X"
      *        MOVE R24-MIN-SL             TO  PRT-MIN-SL
      *        MOVE "Y"                    TO  OPTION-HDR-FLAG
      *    ELSE
      *        MOVE SPACES                 TO  MIN-SL-AREA.
      *
      *    IF R24-MIN-OV-OPT = "X"
      *        MOVE R24-MIN-OV             TO  PRT-MIN-OV
      *        MOVE R24-OV-MTHS            TO  PRT-OV-MTHS
      *        MOVE "Y"                    TO  OPTION-HDR-FLAG
      *    ELSE
      *        MOVE SPACES                 TO  MIN-OV-AREA.
      *
           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "TRPTINS "         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.

           MOVE "DHDR24.PUB" TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM
             HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR * TRPTOBS" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "          TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE               TO BU-DISPLAY-FLD9 (1)
               GO TO 2-BLOWUP.

           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI TO COMP-ESC-SEQ.
           MOVE CHAR-10PI TO STAND-ESC-SEQ.

           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               MOVE COMP-ESC-SEQ TO PRT-REC
               WRITE PRT-REC BEFORE ADVANCING 0 LINES.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.

9412DP*****OPEN INPUT MSTORERM-I, DDESC-I.
9412DP     OPEN INPUT MSTORERM-I, DDESC-I, DMANPART-I.

           COPY MTLSPROC IN COPYLIB.

      *    SORT SORT-FILE
      *         ON ASCENDING KEY    SRT-TYPE
      *                             SRT-CORP-CODE
      *         INPUT  PROCEDURE IS 8-INPUT-RECORDS
      *         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

       2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRT-REC FROM STAND-ESC-SEQ AFTER ADVANCING 0.
           CLOSE ONLINE-PRT.
9412DP*****CLOSE MSTORERM-I, DDESC-I.
9412DP     CLOSE MSTORERM-I, DDESC-I, DMANPART-I.
           GOBACK.

      *************************************************************
      *                    BLOWUP   ROUTINE                       *
      *************************************************************
       2-BLOWUP.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRT-REC FROM STAND-ESC-SEQ AFTER ADVANCING 0.

           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-AREA.

      *8-INPUT-RECORDS SECTION.
       7-INPUT-RECORDS SECTION.

           COPY MTLSINPT IN COPYLIB.

      *    READ MSTORERM-I FIRST RECORD INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "Y" TO END-OF-INPUT-FILE.
      *    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
      *            ALL-INPUT-RECORDS-PROCESSED.
      *    GO TO 8-IR-EXIT.
      *
      *81-PROCESS-INPUT-RECORDS.
      *    IF STR-STOCK-OT = "X"
      *        NEXT SENTENCE
      *    ELSE
      *        GO TO 81-READ-NEXT-MSTORERM.
      *
      *    COMPUTE TOTAL-COST = STR-ONHAND * STR-AVG-COST.
      *
      *---------- IF THE MINIMUM VALUE FOR OBSOLETE ITEMS OPTION WAS
      *---------- CHOSEN, CHECK FOR THAT MINIMUM VALUE.
      *
      *     IF TOTAL-COST < R24-MIN-OBS
      *        GO TO 81-READ-NEXT-MSTORERM.
      *
      *---------- IF THE USER WANTED TO EXCLUDE ITEMS THAT APPEARED
      *---------- ON AN EARLIER OVERAGE REPORT, EXCLUDE THESE ITEMS.
      *---------- ALSO TAKE INTO ACCOUNT PROJECTED OVERAGE IF ENTERED
      *
      *    IF R24-MIN-OV-OPT = "X"
      *      COMPUTE PROJECTED-ONHAND =
      *        STR-ONHAND - (STR-MTH-FCST * R24-OV-MTHS)
      *      COMPUTE OVERAGE = (PROJECTED-ONHAND - STR-MAX)
      *      IF OVERAGE > 0
      *        COMPUTE OVERAGE-COST =
      *          OVERAGE * STR-AVG-COST
      *        IF OVERAGE-COST < R24-MIN-OV
      *            NEXT SENTENCE
      *        ELSE
      *            GO TO 81-READ-NEXT-MSTORERM.
      *
      *---------- IF THE USER WANTED TO EXCLUDE SLOW MOVERS FROM
      *---------- THE REPORT, EXCLUDE THESE ITEMS, TAKING INTO ACCOUNT
      *---------- THE SLOW MOVER DATE TO EXCLUDE AND THE MINIMUM VALUE.
      *
      *    IF R24-MIN-SL-OPT = "X"
      *        IF STR-INS-ITM = "X" OR "B" OR "1"
      *            NEXT SENTENCE
      *        ELSE
      *        IF STR-REORDER = 0 AND STR-EXPEDITE = 0
      *          AND STR-ONHAND = 0
      *             NEXT SENTENCE
      *        ELSE
      *        IF STR-LAST-IDATE = SPACES
      *            IF STR-INIT-DATE-CN < SLOW-MOVE-DATE-CN
      *                IF TOTAL-COST < R24-MIN-SL
      *                    NEXT SENTENCE
      *                ELSE
      *                    GO TO 81-READ-NEXT-MSTORERM
      *            ELSE
      *                NEXT SENTENCE
      *        ELSE
      *        IF STR-LAST-IDATE-CN < SLOW-MOVE-DATE-CN
      *            IF TOTAL-COST < R24-MIN-SL
      *                NEXT SENTENCE
      *            ELSE
      *                GO TO 81-READ-NEXT-MSTORERM.
      *
      *    MOVE SPACES                        TO SORT-REC.
      *    MOVE CORP-CODE                     TO SRT-CORP-CODE.
      *    MOVE STR-AVG-COST                  TO SRT-AVG-COST.
      *    MOVE STR-UM                        TO SRT-UM.
      *    MOVE STR-ONHAND                    TO SRT-ONHAND.
      *    MOVE STR-LAST-IDATE TO SRT-LAST-IDATE.
      *    MOVE STR-MTH-FCST TO SRT-MTH-FCST.
      *    IF STR-ONHAND = ZEROS
      *      MOVE "2"                         TO SRT-TYPE
      *      RELEASE SORT-REC
      *    ELSE
      *      MOVE "1"                         TO SRT-TYPE
      *      RELEASE SORT-REC.
      *
      * 81-READ-NEXT-MSTORERM.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE "Y" TO END-OF-INPUT-FILE
      *            GO TO 81-PIR-EXIT
      *        ELSE
      *            MOVE "DBGET ERROR PARA 81-PIR    " TO BU-DISPLAY-MSG
      *            GO TO 2-BLOWUP.
      *81-PIR-EXIT.
      *    EXIT.

       7-IR-EXIT.
           EXIT.

      *9-WRITE-RECORDS SECTION.
       8-WRITE-RECORDS SECTION.
           RETURN SORT-FILE AT END
               MOVE "Y" TO END-OF-SORT-FILE
               ADD     1      TO PAGE-K
               MOVE    5      TO LINE-K
               MOVE PAGE-K    TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
               MOVE NO-SORTED-RECORDS TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               GO TO 2-EOJ.

           PERFORM 9-MOVE-CONTROL-BREAK.

           PERFORM 99-HEADERS.

           PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
                   UNTIL ALL-SORTED-RECORDS-PROCESSED.

           GO TO 8-WR-EXIT.

      **************************************************************
      *                                                            *
      *   ITEMS WITH SRT-TYPE "1" HAVE ONHAND VALUES               *
      *   AFTER I PROCESS THESE TYPE "1" ITEMS I WANT TO PRINT     *
      *     THE TOTALS AND SKIP TO THE NEXT PAGE.                  *
      *   THEN THE ITEMS WITH SRT-TYPE "2" - ZERO ONHAND ITEMS     *
      *     WILL PRINT.                                            *
      *   MATCONT CAN THEN SEPARATE THESE TWO GROUPS FOR THEIR     *
      *     OWN PURPOSE - ZEROS SHOULD BE DELETED FROM CSIS.       *
      *                                                            *
      **************************************************************

       82-PROCESS-SORTED-RECORDS.
           MOVE "LAST ISSUE:" TO PRT-DESC-LST-ISS.
           MOVE "MTH FORCAST:" TO PRT-DESC-MTH-FCST.
      *    IF ONHAND-SWITCH = "N"
      *      IF SRT-TYPE = "2"
      *        MOVE "Y"                 TO ONHAND-SWITCH
      *        MOVE ITEM-CTR            TO PRT-ITM-CTR
      *        MOVE GRAND-TOTAL         TO PRT-GRD-TOTAL
      *        WRITE PRT-REC FROM GRAND-TOTAL-LINE
      *                AFTER ADVANCING 3 LINES
      *        PERFORM 99-HEADERS.

           MOVE SPACES                        TO PRT-REC, PRT-ITEM-DATA.
           MOVE  SRT-CORP-CODE                    TO CODE-ARG.

9412DP     CALL "CDESC" USING RET-CODE, BASE, STATUS-AREA,
9412DP        BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
9412DP     IF BU-DISPLAY-MSG-1 NOT = SPACES
9412DP          MOVE CODE-ARG TO BU-DISPLAY-FLD (1)
9412DP          GO TO 2-BLOWUP.
9412DP
9412DP     MOVE 1 TO SUB.
9412DP
9412DP*    IF CDESC-LINES-GOT = 0
9412DP*        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
9412DP*    ELSE
9412DP*        MOVE CDESC (SUB)                  TO PRT-DESC.
      *
           MOVE SRT-KEYWD-MOD                    TO PRT-DESC.

      *********28DEC1994 COMMENTED OUT THE FOLLOWING CODE*********
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
      *        GO TO 92-CONT.
      *
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS = "00"
      *        MOVE DESC-DATA      TO  PRT-DESC
      *    ELSE
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.
      *************************************************************

       82-CONT.
           COMPUTE TOTAL-COST = SRT-ONHAND * SRT-COST.
           ADD TOTAL-COST                         TO GRAND-TOTAL.
           MOVE SRT-CORP-CODE                     TO PRT-CODE.
           MOVE SRT-ONHAND                        TO PRT-ONHAND.
           MOVE SRT-UM                            TO PRT-UM.
           MOVE SRT-COST                          TO PRT-AVG-COST.
           MOVE TOTAL-COST                        TO PRT-TOTAL.

           MOVE 4 TO DATE-MODE.
           MOVE SRT-LAST-IDATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO LAST-ISSUE-DATE.
           MOVE SRT-MTH-FCST TO PRT-MTH-FCST.

           ADD 1 TO LINE-K.
           ADD 1 TO ITEM-CTR.
           WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 1 LINES.

      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

      *-------- PRINT FULL DESCRIPTION IF REQUESTED.
           IF MTLS-DESC-OPT = "X"
               PERFORM 93-DESC-LOOP THRU 93-EXIT.

           RETURN SORT-FILE AT END
               MOVE "Y"                           TO END-OF-SORT-FILE.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   WRITE PRT-REC              AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       MOVE 60            TO  LINE-K
                       PERFORM 99-HEADERS.

           IF END-OF-SORT-FILE = "Y"
      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
             IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               IF ONHAND-SWITCH = "N"
                 MOVE GRAND-TOTAL                 TO PRT-GRD-TOTAL
                 MOVE CODES-RELEASED              TO PRT-ITM-CTR
                 WRITE PRT-REC FROM GRAND-TOTAL-LINE
                       AFTER ADVANCING 3 LINES.

           IF END-OF-SORT-FILE NOT = "Y"
             IF LINE-K > 57
               PERFORM 99-HEADERS.

       82-PSR-EXIT.
           EXIT.

       93-DESC-LOOP.
      ********28DEC1994 REPLACED THE FOLLOWING BLOCK OF LOGIC******
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS = "00"
      *      AND CORPCDE OF DDESC-REC-I = CODE-ARG
      *        MOVE DESC-DATA      TO  PRT-DESC1
      *    ELSE
      *        MOVE SPACES         TO  PRT-DESC1.
      *    ADD 1 TO LINE-K.
      *    WRITE PRT-REC FROM PRT-DESC-DATA AFTER ADVANCING 1 LINES.
      *    MOVE SPACES TO PRT-DESC-DATA.
      *    IF FILE-STATUS = "00"
      *      AND CORPCDE OF DDESC-REC-I = CODE-ARG
      *        GO TO 93-DESC-LOOP.
      **************************************************************

           ADD 1 TO SUB.
           IF SUB > CDESC-LINES-GOT
               MOVE SPACES         TO  PRT-DESC1
           ELSE
               MOVE CDESC (SUB)    TO  PRT-DESC1.

           ADD 1 TO LINE-K.
           WRITE PRT-REC FROM PRT-DESC-DATA AFTER ADVANCING 1 LINE.
           MOVE SPACES TO PRT-DESC-DATA.

           IF SUB > CDESC-LINES-GOT
               NEXT SENTENCE
           ELSE
               GO TO 93-DESC-LOOP.

       93-EXIT.
           EXIT.

       99-HEADERS.
           ADD     1      TO PAGE-K.
           MOVE    5      TO LINE-K.
           MOVE PAGE-K    TO PRT-PAGE.
      *    WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE.
      *    WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES.
           WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE.
           WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE.
           IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
             MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
             WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
             ADD   1      TO LINE-K
           END-IF

      *    IF OPTION-HDR-FLAG = "Y"
      *        WRITE PRT-REC FROM HDR-OPTIONS
      *          AFTER ADVANCING 2
      *        ADD 2  TO  LINE-K.

           WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES.
           MOVE SPACES TO PRT-REC.
           WRITE PRT-REC AFTER ADVANCING 1 LINES.

       8-WR-EXIT.
           EXIT.

       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
