001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TRPTFS.
001300 AUTHOR.         N W REGIMBAL.
001500 DATE-WRITTEN.   DEC 05, 1980.
001600*REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
001700*                CORP-CODES AND ITEM STATUS PER CODE.
001800*
001900*                JULY 2, 1982, THE BUFFER AREA MSTORERM WAS
002000*                CHANGED IN PREPARATION FOR THE NEW DATA BASE
002100*                CHANGES. B.J.P.
002200*
002300*                ADDED INTERNATIONAL DATE ROUTINE "TDATECHK"
002400*                ON MAY 21, 1985.    V.W.D.
002500*
002600*                ON NOVEMBER 26, 1986 - EXPANDED THE SIZE OF ALL
002700*                COST/PRICE FIELDS AND ADDED COPYLIB.
002800*                                  D.A. PLUM.
002900*
002910*                ON JANUARY 22, 1987 - MODIFIED PROGRAM TO
002920*                RUN OUT OF XRSCREEN AND ALSO ADDED TESCSEQ.
002938*                                    A. M. KRAUSS.
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 04, 1996   CA YODER
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  07/31/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C

003000 ENVIRONMENT DIVISION.
003100 CONFIGURATION SECTION.
003200 SOURCE-COMPUTER.    IBM-AS400.
003300 OBJECT-COMPUTER.    IBM-AS400.
003400 SPECIAL-NAMES.
003500     C01 IS NEW-PAGE.
003600
003700 INPUT-OUTPUT SECTION.
003800 FILE-CONTROL.
003900     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
004000     SELECT SORT-FILE ASSIGN  TO DISK-SORT.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
004100
004200 DATA DIVISION.
004300 FILE SECTION.
004400 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
004500     LABEL RECORD IS OMITTED
004600     DATA RECORD IS PRT-REC.
004700 01  PRT-REC                 PIC X(132).
004800
       COPY MTLSSORT  IN COPYLIB.

004900*SD  SORT-FILE RECORD CONTAINS 33 CHARACTERS
005000*    DATA RECORD IS SORT-REC.
005100*01  SORT-REC.
005200*     05  SRT-CORP-CODE      PIC X(8).
005300*     05  SRT-UM             PIC X(2).
005400*     05  SRT-ONHAND         PIC S9(8).
005500*     05  SRT-AVG-COST       PIC S9(11)V9(4).
005600*
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200   OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400   OF MCFLCS1401.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       WORKING-STORAGE SECTION.
006100 77  NO-ARG                  PIC X     VALUE SPACE.
006200 77  LINE-K                  PIC 99    VALUE 60 COMP-4.
006300 77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
006400 77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
006500 77  GRAND-TOTAL             PIC S9(14)V9(4) VALUE +0.
006600 77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
006700 77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
006800 77  CODE-ARG                PIC X(8)  VALUE SPACES.
       77  SUB                     PIC 9(3)  VALUE 0.
       77  RET-CODE                PIC X(2)  VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1          PIC X      VALUE SPACES.
           05  FILE-STATUS-2          PIC X      VALUE SPACES.
005800
9406CK 01  SCOPE   PIC X.
006900
007000 01  MESSAGE-AREA.
007100     05  NO-SORTED-RECORDS   PIC X(31) VALUE
007200                             "ZERO CODES QUALIFIED FOR REPORT".
007300
007400 01  SWITCH-AREA.
007500     05  END-OF-INPUT-FILE               PIC X VALUE "N".
007600         88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
007700     05  END-OF-SORT-FILE                PIC X VALUE "N".
007800         88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
007900     05  BLOWUP-SWITCH                   PIC X VALUE "N".
008700
008800 01  TIME-SAVE.
008900     05  HRS-SAVE            PIC XX.
009000     05  MIN-SAVE            PIC XX.
009100     05  SEC-SAVE            PIC XX.
009200
005900 COPY TDATECHK IN COPYLIB.
006000
006010 COPY VCOMAREA IN COPYLIB.
006020
009300 COPY DATAB IN COPYLIB.
009400
009410 COPY TBLOWUP IN COPYLIB.

       COPY CCHKOBJ  IN COPYLIB.

       COPY CCRTFILE IN COPYLIB.

       COPY OVRPFDATA IN COPYLIB.

       COPY THDPRTA  IN COPYLIB.

       COPY CDESC IN COPYLIB.

       COPY TCHKBLKT IN COPYLIB.

009440
009450*-------------- ESCAPE SEQUENCES
009451 COPY ESCNAM2 IN COPYLIB.
009452
009453 01  COMPRESS-PRINT             PIC X(8).
009454
009455 01  NORMAL-PRINT               PIC X(8).
009456
009458
009500 01  DSET-NAMES.
009600     05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
009700     05  DSET-DDESC      PIC X(6)  VALUE "DDESC;".
009800
009900 COPY MSTORERM IN COPYLIB.
010000
010100 COPY DDESC IN COPYLIB.

       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.
010200
010300*01  HDR-1.
010400*    05  FILLER      PIC X(10) VALUE "  TRPTFS  ".
010500*    05  FILLER      PIC X(25) VALUE SPACES.
010600*    05  FILLER      PIC X(20) VALUE "C O R P O R A T E   ".
010700*    05  FILLER      PIC X(19) VALUE "C O D E   I T E M S".
010800*    05  FILLER      PIC X(28) VALUE SPACES.
010900*    05  PRT-DATE    PIC X(8)  VALUE SPACES.
011000*    05  FILLER      PIC X(4)  VALUE SPACES.
011100*    05  PRT-TIME    PIC X(8) VALUE SPACES.
011200*
011300*01  HDR-2.
011400*    05  FILLER      PIC X(7)  VALUE "  PAGE ".
011500*    05  PRT-PAGE    PIC 999   VALUE ZEROS.
011600*    05  FILLER      PIC X(28) VALUE SPACES.
011700*    05  FILLER      PIC X(21) VALUE "F R E E   S T O R E S".
011800*    05  FILLER      PIC X(12) VALUE "   C L A S S".
011900*    05  FILLER      PIC X(33) VALUE SPACES.
012000*    05  FILLER      PIC X(12) VALUE "DATE        ".
012100*    05  FILLER      PIC X(4)  VALUE "TIME".
012200*    05  FILLER      PIC X(7)  VALUE SPACES.
012300
012400 01  HDR-3.
012500     05  FILLER      PIC X(9)  VALUE "CORPCODE ".
012600     05  FILLER      PIC X(13) VALUE " DESCRIPTION ".
012700     05  FILLER      PIC X(62) VALUE SPACES.
012800     05  FILLER      PIC X(10) VALUE "ONHAND  UM".
012900     05  FILLER      PIC X(9)  VALUE SPACES.
013000     05  PRT-COST-LIT  PIC X(8).
013100     05  FILLER      PIC X(9)  VALUE SPACES.
013200     05  FILLER      PIC X(12) VALUE "  TOTAL COST".
013300
013400 01  PRT-ITEM-DATA.
013500     05  PRT-CODE      PIC X(7)  VALUE SPACES.
013600     05  FILLER        PIC X(3)  VALUE SPACES.
013700     05  PRT-DESC      PIC X(69) VALUE SPACES.
013800     05  FILLER        PIC X(3)  VALUE SPACES.
013900     05  PRT-ONHAND    PIC Z(7)9 VALUE ZEROS.
014000     05  FILLER        PIC X(2)  VALUE SPACES.
014100     05  PRT-UM        PIC X(2)  VALUE SPACES.
014200     05  FILLER        PIC X(1)  VALUE SPACES.
014300     05  PRT-AVG-COST  PIC Z(10)9.9(4) VALUE ZEROES.
014400     05  FILLER        PIC X(3)  VALUE SPACES.
014500     05  PRT-TOTAL     PIC Z(12)9.9(4) VALUE ZEROES.
014600
       01  PRT-ITEM-DESC.
           05  FILLER        PIC X(8)  VALUE SPACES.
           05  PRT-DESC-2    PIC X(80) VALUE SPACES.

014700 01  GRAND-TOTAL-LINE.
014800     05  FILLER        PIC X(60) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS  PIC Z(4)9 VALUE ZERO.
           05  FILLER        PIC X(3)  VALUE SPACES.
014900     05  FILLER        PIC X(19) VALUE "GRAND TOTAL OF ALL ".
015000     05  FILLER        PIC X(13) VALUE "FREE STORES  ".
015100     05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROES.

      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
      *01  DATA-LINE                  PIC X(112).
015200
015300*PROCEDURE DIVISION USING HD-ROUTE-DATA, DATA-LINE.
       PROCEDURE DIVISION.
015400 BEGIN-SORT SECTION.
015500 1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
015600     OPEN OUTPUT PRINT-FILE.

016112     MOVE "DHDR93.PUB"   TO HD-FILE-NAME.
016113     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
016114         HD-ROUTE-DATA, ESC-NAME.
016115     IF HD-RET-CODE NOT = 0
016116         MOVE "THDPRT2 ERROR * TRPTFS" TO BU-DISPLAY-MSG
016117         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
016118         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
016119         GO TO 2-BLOWUP.

           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "  TRPTFS"         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
015700     MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.
016120
           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

016129     CALL "TESCSEQ" USING ESC-NAME.
016130     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
016131     MOVE CHAR-10PI       TO NORMAL-PRINT.
016133
           OPEN INPUT MSTORERM-I, DDESC-I, DMANPART-I.
016800
           COPY MTLSPROC IN COPYLIB.

016900*    SORT SORT-FILE
017000*         ON ASCENDING KEY SRT-CORP-CODE
017100*         INPUT  PROCEDURE IS 8-INPUT-RECORDS
017200*         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.
017300
017301 2-EOJ.
023110     IF PAPER-IS-132-COLS
023120         NEXT SENTENCE
023130     ELSE
023140        WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
017303     CLOSE PRINT-FILE.
           CLOSE MSTORERM-I, DDESC-I, DMANPART-I.
017305     GOBACK.
017306
017310*************************************************************
017311*                    BLOWUP   ROUTINE                       *
017312*************************************************************
017313 2-BLOWUP.
017315     WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
017316
017317     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
017318           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
017319           BU-DISPLAY-AREA.
017320
019700 7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *    READ MSTORERM-I FIRST RECORD INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "READ FIRST ERROR*8-INPUT-RECORDS"
      *            TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
019800*    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
019900*            ALL-INPUT-RECORDS-PROCESSED.
020000*    GO TO 8-IR-EXIT.
020100*
020200*81-PROCESS-INPUT-RECORDS.
021500*    MOVE SPACES          TO SORT-REC.
021600*    IF STR-REORDER = 0 AND STR-EXPEDITE = 0
021700*        AND STR-ORD-ENG NOT = "X"
021800*        AND STR-STOCK-OT NOT = "X"
021900*        MOVE CORP-CODE TO SRT-CORP-CODE
022000*        MOVE STR-AVG-COST TO SRT-AVG-COST
022100*        MOVE STR-UM TO SRT-UM
022200*        MOVE STR-ONHAND TO SRT-ONHAND
022300*        RELEASE SORT-REC.
      *
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
020600*            MOVE "Y" TO END-OF-INPUT-FILE
020700*            GO TO 81-PIR-EXIT
      *        ELSE
021000*            MOVE "DBGET ERROR MSTORERM*81-PIR" TO BU-DISPLAY-MSG
021300*            GO TO 2-BLOWUP.
022400*
022500*81-PIR-EXIT.
022600*    EXIT.
022700
022800 7-IR-EXIT.
022900     EXIT.
023000
023100 8-WRITE-RECORDS SECTION.
023110     IF PAPER-IS-132-COLS
023120         NEXT SENTENCE
023130     ELSE
023140        WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.
023160
023200     RETURN SORT-FILE AT END
023300         MOVE "Y" TO END-OF-SORT-FILE
023400         MOVE  1  TO PRT-PAGE
023500*        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
023600*        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
023700         WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
023800         MOVE NO-SORTED-RECORDS TO PRT-REC
023900         WRITE PRT-REC AFTER ADVANCING 2 LINES
024000         GO TO 2-EOJ.
024100
           PERFORM 9-MOVE-CONTROL-BREAK.

024200     PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
024300             UNTIL ALL-SORTED-RECORDS-PROCESSED.
024400
      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               MOVE CODES-RELEASED TO PRT-GRD-ITMS
024500         MOVE GRAND-TOTAL TO PRT-GRD-TOTAL
024600         WRITE PRT-REC FROM GRAND-TOTAL-LINE
024700             AFTER ADVANCING 2 LINES.
024800     GO TO 8-WR-EXIT.
024900
025000 82-PROCESS-SORTED-RECORDS.
           PERFORM 9-CHECK-HEADINGS.
026000
026100     MOVE SPACES        TO PRT-REC, PRT-ITEM-DATA.
026200     MOVE  SRT-CORP-CODE     TO  CODE-ARG.
           MOVE SRT-KEYWD-MOD      TO  PRT-DESC.
026300
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
026700*        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
026800*        GO TO 92-CONT.
026900*
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS  = "00"
027300*        MOVE DESC-DATA      TO  PRT-DESC
027400*    ELSE
027500*        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.
027600
027700 82-CONT.
027800     COMPUTE TOTAL-COST = SRT-ONHAND * SRT-COST.
027900     ADD TOTAL-COST TO GRAND-TOTAL.
028000     MOVE SRT-CORP-CODE TO PRT-CODE.
028100     MOVE SRT-ONHAND TO PRT-ONHAND.
028200     MOVE SRT-UM TO PRT-UM.
028300     MOVE SRT-COST TO PRT-AVG-COST.
028400     MOVE TOTAL-COST TO PRT-TOTAL.
028500
028600     ADD  1  TO LINE-K.
028700     WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 1 LINES.
028800
      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

      *---------- PRINT COMPLETE DESCRIPTION IF REQUESTED.
           IF MTLS-DESC-OPT = "X"
               MOVE 2 TO SUB
               MOVE SRT-CORP-CODE  TO  CODE-ARG
               CALL "CDESC" USING  RET-CODE,
                                   BASE,
                                   STATUS-AREA,
                                   BU-DISPLAY-MSG,
                                   CODE-ARG,
                                   CDESC-DATA
               IF BU-DISPLAY-MSG-1  NOT = SPACES
                   MOVE CODE-ARG    TO  BU-DISPLAY-FLD (2)
                   GO TO 2-BLOWUP
               END-IF
               PERFORM UNTIL SUB > CDESC-LINES-GOT
                   MOVE CDESC (SUB)   TO  PRT-DESC-2
                   ADD 1              TO  LINE-K
                   WRITE PRT-REC FROM PRT-ITEM-DESC
                                               AFTER ADVANCING 1 LINE
                   PERFORM 9-CHECK-HEADINGS
                   ADD 1              TO  SUB
               END-PERFORM
               MOVE SPACES TO PRT-REC
               ADD 1              TO  LINE-K
               WRITE PRT-REC AFTER ADVANCING 1 LINE.

028900     RETURN SORT-FILE AT END
029000         MOVE "Y"       TO END-OF-SORT-FILE.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   WRITE PRT-REC             AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       MOVE 60            TO  LINE-K
                       PERFORM 9-CHECK-HEADINGS.
029100
029200 82-PSR-EXIT.
029300     EXIT.
029400
029500 8-WR-EXIT.
029600     EXIT.

       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

       9-CHECK-HEADINGS.
           IF LINE-K > 59
               ADD     1      TO PAGE-K
               MOVE    5      TO LINE-K
               MOVE PAGE-K    TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
               IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
                 MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
                 WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
                 ADD   1      TO LINE-K
               END-IF
      *        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
      *        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
               MOVE SPACES TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1 LINES.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
