       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TRPTWD.
       AUTHOR.         N W REGIMBAL.
       DATE-WRITTEN.   DEC 05, 1980.
      *REMARKS.        THIS PROGRAM PRINTS A REPORT SHOWING ALL
      *                CORP-CODES AND ITEM STATUS PER CODE.
      *
      *                ON JULY 13, 1982, THE BUFFER AREA MSTORERM
      *                WAS CHANGED IN PREPARATION FOR THE NEW DATA
      *                BASE CHANGES. B.J.P.
      *
      *                ON SEPTEMBER 29, 1982 THE DEFAULT DEPARTMENT
      *                WAS ADDED TO THE PROGRAM. B.J.P.
      *
      *                ON NOVEMBER 4, 1983 ADDED STR-CLASS TO PRINTOUT
      *                A.T.L.
      *
      *       ADDED INTERNATIONAL DATE ROUTINE "TDATECHK" ON
      *       MAY 21, 1985.    V.W.D.
      *
      *        ADDED LOCAL CODE TO PRINTOUT FOR NEW TORONTO ONLY.
      *        THIS IS TEMPORARY REQUESTED BY JEFF PRAY.
      *        DECEMBER 20, 1985.  BARBARA WINTER.
      *
      *        ON NOVEMBER 25, 1986 - EXPANDED THE SIZE OF THE AVERAGE
      *        COST FIELD FROM S9(6)V9(4) TO S9(11)V9(4).  ALSO ADDED
      *        COPYLIB AND EXPANDED OTHER PRICE/COST FIELDS.
      *                                  D.A. PLUM.
      *
      *        ON FEB 6,1987 - THE FOLLOWING HAS BEEN ADDED OR CHANGED:
      *          1. ADDED CALL TO TRSCREEN FOR FRONT END REPORT OPTIONS
      *          2. ADDED FULL DESCRIPTION OPTION.
      *          3. ADDED HEADER PAGE TO THE REPORT USING SUBPROGRAM
      *             'THDPRT2'.  (DHDR39.PUB)
      *          4. PRINT COMPRESSION FEATURE
      *          5. NON-HP LOGIC
      *          6. REPLACED CALL TO DBEXPLAIN WITH CALL TO SUB-PROGRAM
      *               TBLOWUP
      *          7. ADDED CALL TO 'CDESC' TO GET FULL DESCRIPTION IF
      *             REQUESTED.
      *          8. CHANGED TO USE COPYLIB FOR ALL DATA SET BUFFER
      *             DESCRIPTIONS
      *          9. CHANGED COPY STATEMENTS TO "IN COPYCSIS"
      *                  C.J.R.
      *
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 03, 1996   CA YODER
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  07/31/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    IBM-AS400.
       OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES.
           C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT SORT-FILE  ASSIGN TO DISK-SORT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
           LABEL RECORD IS OMITTED
           DATA RECORD IS PRT-REC.
       01  PRT-REC                 PIC X(132).

       COPY MTLSSORT IN COPYLIB.

      *SD  SORT-FILE RECORD CONTAINS 42 CHARACTERS
      *    DATA RECORD IS SORT-REC.
      *01  SORT-REC.
      *     05  SRT-CORP-CODE      PIC X(8).
      *     05  SRT-DFLT-DEPT      PIC X(6).
      *     05  SRT-UM             PIC X(2).
      *     05  SRT-ONHAND         PIC S9(8).
      *     05  SRT-AVG-COST       PIC S9(11)V9(4).
      *     05  SRT-CLASS          PIC X(3).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500   OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200   OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400   OF MCFLCS1401.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       WORKING-STORAGE SECTION.
       77  NO-ARG                  PIC X(1)  VALUE SPACES.
       77  LINE-K                  PIC 9(2)  VALUE 60 COMP-4.
       77  PAGE-K                  PIC 9(3)  VALUE 0  COMP-4.
       77  TEXT-TO-PRT             PIC 9(2)  VALUE 0  COMP-4.
       77  TOTAL-COST              PIC S9(13)V9(4) VALUE +0.
       77  GRAND-TOTAL             PIC S9(13)V9(4) VALUE +0.
       77  CODE-SEARCH             PIC X(10) VALUE "CORP-CODE;".
       77  ALL-ITEM-LIST           PIC X(2)  VALUE "@;".
       77  CODE-ARG                PIC X(8)  VALUE SPACES.
       77  SUB                     PIC S9(4) COMP.
       77  RET-CODE                PIC X(2)  VALUE SPACES.

       COPY TDATECHK IN COPYLIB.

       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X(1).
           05  FILE-STATUS-2      PIC X(1).

9406CK 01  SCOPE   PIC X.

      ****PARMS FOR CALL TO "THDPRT2" (HEADER PAGE SUBPROG)****
      ****HD-ROUTE-DATA IS ACCEPTED FROM PGM "TRSCREEN"    ****

       COPY THDPRTA IN COPYLIB.

      ****ESCAPE SEQUENCES

       COPY ESCNAM2 IN COPYLIB.

       01  COMPRESS-PRINT          PIC X(8).

       01  NORMAL-PRINT            PIC X(8).

       01  ESC-TEXT-61             PIC X(8).

      ****ERROR MESSAGE AREAS
       COPY TBLOWUP IN COPYLIB.
       01  VIEW-COMAREA.
           05  FILLER             PIC X(118) VALUE ALL "0".
           05  FILLER             PIC S9(4)  COMP VALUE 9999.
       01  KSAM-STATUS            PIC X(2)   VALUE SPACES.

       COPY CCRTFILE IN COPYLIB.
       COPY CCHKOBJ  IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       01  MPLTINFO-ARG            PIC X(4)  VALUE "P 01".

       01  MESSAGE-AREA.
           05  NO-SORTED-RECORDS   PIC X(31) VALUE
                                   "ZERO CODES QUALIFIED FOR REPORT".

       01  SWITCH-AREA.
           05  END-OF-INPUT-FILE               PIC X VALUE "N".
               88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".
           05  END-OF-SORT-FILE                PIC X VALUE "N".
               88  ALL-SORTED-RECORDS-PROCESSED      VALUE "Y".
           05  BLOWUP-SWITCH                   PIC X VALUE "N".

       01  TIME-SAVE.
           05  HRS-SAVE            PIC XX.
           05  MIN-SAVE            PIC XX.
           05  SEC-SAVE            PIC XX.

       COPY DATAB IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-MSTORERM       PIC X(16) VALUE "MSTORERM;".
           05  DSET-DDESC          PIC X(6)  VALUE "DDESC;".
           05  MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".

       COPY MSTORERM IN COPYLIB.

       COPY DDESC IN COPYLIB.

       COPY MPLT0 IN COPYLIB.

       COPY MPLTP01 IN COPYLIB.

       COPY CDESC IN COPYLIB.

       COPY TCHKBLKT IN COPYLIB.

       COPY DMANPART IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

       COPY MTLSHDNG IN COPYLIB.

      *01  HDR-1.
      *    05  FILLER      PIC X(10) VALUE "  TRPTWD  ".
      *    05  FILLER      PIC X(25) VALUE SPACES.
      *    05  FILLER      PIC X(20) VALUE "C O R P O R A T E   ".
      *    05  FILLER      PIC X(19) VALUE "C O D E   I T E M S".
      *    05  FILLER      PIC X(28) VALUE SPACES.
      *    05  PRT-DATE    PIC X(8)  VALUE SPACE.
      *    05  FILLER      PIC X(4)  VALUE SPACES.
      *    05  PRT-TIME    PIC X(8)  VALUE SPACE.
      *
      *01  HDR-2.
      *    05  FILLER      PIC X(7)  VALUE "  PAGE ".
      *    05  PRT-PAGE    PIC 999   VALUE ZEROS.
      *    05  FILLER      PIC X(29) VALUE SPACES.
      *    05  FILLER      PIC X(19) VALUE "W R I T E   D O W N".
      *    05  FILLER      PIC X(12) VALUE "   C L A S S".
      *    05  FILLER      PIC X(34) VALUE SPACES.
      *    05  FILLER      PIC X(12) VALUE "DATE        ".
      *    05  FILLER      PIC X(4)  VALUE "TIME".
      *    05  FILLER      PIC X(7)  VALUE SPACES.

       01  HDR-3.
           05  FILLER      PIC X(13) VALUE "CODE    CLS  ".
           05  FILLER      PIC X(13) VALUE "DESCRIPTION  ".
           05  FILLER      PIC X(49) VALUE SPACES.
           05  FILLER      PIC X(14) VALUE "DEFAULT DEPT  ".
           05  FILLER      PIC X(11) VALUE "  ONHAND UM".
           05  FILLER      PIC X(7)  VALUE SPACES.
           05  PRT-COST-LIT  PIC X(8).
           05  FILLER      PIC X(7)  VALUE SPACES.
           05  FILLER      PIC X(10) VALUE "TOTAL COST".

       01  PRT-ITEM-DATA.
           05  PRT-CODE      PIC X(7)  VALUE SPACES.
           05  FILLER        PIC X     VALUE SPACES.
           05  PRT-CLASS     PIC X(3)  VALUE SPACES.
           05  FILLER        PIC X     VALUE SPACES.
           05  PRT-DESC      PIC X(69) VALUE SPACES.
           05  FILLER        PIC X(2)  VALUE SPACES.
           05  PRT-DEPT      PIC X(4)  VALUE SPACES.
           05  FILLER        PIC X(2)  VALUE SPACES.
           05  PRT-ONHAND    PIC Z(7)9 VALUE ZEROS.
           05  FILLER        PIC X     VALUE SPACES.
           05  PRT-UM        PIC X(2)  VALUE SPACES.
           05  FILLER        PIC X(1)  VALUE SPACES.
           05  PRT-AVG-COST  PIC Z(10)9.99 VALUE ZEROES.
           05  FILLER        PIC X     VALUE SPACES.
           05  PRT-TOTAL     PIC Z(12)9.99 VALUE ZEROES.

       01  PRT-PREV.
           05  FILLER             PIC X(13) VALUE "LOCAL CODE:  ".
           05  PRT-PREV-CODE      PIC X(12) VALUE SPACES.

       01  FULL-DESC-LINE.
           05  FILLER             PIC X(12)  VALUE SPACES.
           05  PRT-FULL-DESC      PIC X(80)  VALUE SPACES.

       01  GRAND-TOTAL-LINE.
           05  FILLER        PIC X(60) VALUE SPACES.
           05  FILLER        PIC X(13) VALUE "TOTAL ITEMS: ".
           05  PRT-GRD-ITMS  PIC Z(4)9 VALUE ZERO.
           05  FILLER        PIC X(5)  VALUE SPACES.
           05  FILLER        PIC X(19) VALUE "GRAND TOTAL OF ALL ".
           05  FILLER        PIC X(13) VALUE "WRITE DOWN   ".
           05  PRT-GRD-TOTAL PIC Z(13)9.9(4) VALUE ZEROES.

      *LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       COPY MTLSLINK IN COPYLIB.
      *01  R27-DATA-LINE.
      *    05  R27-DESC-OPTION    PIC X.
      *    05  FILLER             PIC X(111).

      *PROCEDURE DIVISION USING HD-ROUTE-DATA, R27-DATA-LINE.
       PROCEDURE DIVISION.
       BEGIN-SORT SECTION.
       1-HOUSEKEEPING.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

      *---------- OPEN THE PRINT FILE, GET THE FILE NUMBER OF THE PRINT
      *---------- FILE, AND PRINT THE HEADER PAGE.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI TO COMPRESS-PRINT.
           MOVE CHAR-10PI   TO NORMAL-PRINT.

           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "  TRPTWD"         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           IF MTLS-COST-OPT = "M"
               MOVE "MKT COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "A"
               MOVE "AVG COST"     TO PRT-COST-LIT
           ELSE
           IF MTLS-COST-OPT = "R"
               MOVE "REP COST"     TO PRT-COST-LIT.

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.

           MOVE "DHDR39.PUB" TO HD-FILE-NAME.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
                HD-ROUTE-DATA, ESC-NAME.
           IF HD-RET-CODE NOT = 0
               MOVE "THDPRT2 ERROR IN 1-HSK" TO BU-DISPLAY-MSG
               MOVE "HD-RET-CODE = "         TO BU-DISPLAY-FLD (1)
               MOVE HD-RET-CODE              TO BU-DISPLAY-FLD9 (1)
               GO TO 2-BLOWUP.

           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRT-REC FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRT-REC FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRT-REC FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

           OPEN INPUT MPLTINFO-I, MSTORERM-I, DDESC-I, DMANPART-I.

           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
              MOVE "DBGET ERR ON MPLTINFO IN 1-HSK"   TO BU-DISPLAY-MSG
              GO TO 2-BLOWUP.

           COPY MTLSPROC IN COPYLIB.

      *    SORT SORT-FILE
      *         ON ASCENDING KEY SRT-CORP-CODE
      *         INPUT  PROCEDURE IS 8-INPUT-RECORDS
      *         OUTPUT PROCEDURE IS 9-WRITE-RECORDS.

       2-EOJ.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
           WRITE PRT-REC FROM NORMAL-PRINT AFTER ADVANCING 0.
           CLOSE PRINT-FILE.
           CLOSE MPLTINFO-I, MSTORERM-I, DDESC-I, DMANPART-I.
           GOBACK.

       2-BLOWUP.
           MOVE "TRPTWD" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
              VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
              BU-DISPLAY-AREA.


       7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *    READ MSTORERM-I FIRST RECORD INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "Y" TO END-OF-INPUT-FILE.
      *    PERFORM 81-PROCESS-INPUT-RECORDS THRU 81-PIR-EXIT UNTIL
      *            ALL-INPUT-RECORDS-PROCESSED.
      *    GO TO 8-IR-EXIT.
      *
      *81-PROCESS-INPUT-RECORDS.
      *    IF CORP-CODE = "NON-STR "
      *        NEXT SENTENCE
      *    ELSE
      *    IF STR-WR-DOWN = "X"
      *        MOVE SPACES        TO SORT-REC
      *        MOVE CORP-CODE     TO SRT-CORP-CODE
      *        MOVE STR-AVG-COST  TO SRT-AVG-COST
      *        MOVE STR-UM        TO SRT-UM
      *        MOVE STR-ONHAND    TO SRT-ONHAND
      *        MOVE STR-DFLT-DEPT TO SRT-DFLT-DEPT
      *        MOVE STR-CLASS     TO SRT-CLASS
      *        RELEASE SORT-REC.
      *
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE "Y" TO END-OF-INPUT-FILE
      *            GO TO 81-PIR-EXIT
      *        ELSE
      *            MOVE "DBGET ERROR PARA 81-PIR    " TO BU-DISPLAY-MSG
      *            GO TO 2-BLOWUP.
      *
      *81-PIR-EXIT.
      *    EXIT.

       7-IR-EXIT.
           EXIT.

       8-WRITE-RECORDS SECTION.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRT-REC FROM COMPRESS-PRINT AFTER ADVANCING 0.

           RETURN SORT-FILE AT END
               MOVE "Y" TO END-OF-SORT-FILE
               MOVE  1  TO PRT-PAGE
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
      *        WRITE PRT-REC FROM HDR-1 AFTER  ADVANCING NEW-PAGE
      *        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
               MOVE NO-SORTED-RECORDS TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 2 LINES
               GO TO 2-EOJ.

           PERFORM 9-MOVE-CONTROL-BREAK.

           PERFORM 82-PROCESS-SORTED-RECORDS THRU 82-PSR-EXIT
                   UNTIL ALL-SORTED-RECORDS-PROCESSED.

      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
               MOVE CODES-RELEASED TO PRT-GRD-ITMS
               MOVE GRAND-TOTAL TO PRT-GRD-TOTAL
               WRITE PRT-REC FROM GRAND-TOTAL-LINE
                   AFTER ADVANCING 2 LINES.
           GO TO 8-WR-EXIT.

       82-PROCESS-SORTED-RECORDS.
           PERFORM 9-CHECK-HEADINGS.

           MOVE SPACES        TO PRT-REC, PRT-ITEM-DATA.
           MOVE  SRT-CORP-CODE     TO  CODE-ARG.
           MOVE 0 TO SUB.
           MOVE SRT-KEYWD-MOD      TO  PRT-DESC.

      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC
      *        GO TO 92-CONT.
      *
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS = "00"
      *        MOVE DESC-DATA      TO  PRT-DESC
      *    ELSE
      *        MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.

       82-GET-MULT-DESC.
           CALL "CDESC"  USING  RET-CODE,
                                BASE,
                                STATUS-AREA,
                                BU-DISPLAY-MSG,
                                CODE-ARG,
                                CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE CODE-ARG  TO BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP.
           IF CDESC-LINES-GOT > 1
               ADD CDESC-LINES-GOT, LINE-K GIVING TEXT-TO-PRT.


       82-CONT.
           COMPUTE TOTAL-COST = SRT-ONHAND * SRT-COST.
           ADD TOTAL-COST TO GRAND-TOTAL.
           MOVE SRT-CORP-CODE TO PRT-CODE.
           MOVE SRT-ONHAND TO PRT-ONHAND.
           MOVE SRT-UM TO PRT-UM.
           MOVE SRT-COST TO PRT-AVG-COST.
           MOVE SRT-DFLT-DEPT TO PRT-DEPT.
           MOVE SRT-CLASS     TO PRT-CLASS.
           MOVE TOTAL-COST TO PRT-TOTAL.

           PERFORM 9-CHECK-HEADINGS.

           MOVE 1 TO SUB.
           ADD 1 TO LINE-K.
           WRITE PRT-REC FROM PRT-ITEM-DATA AFTER ADVANCING 1 LINES.

      *-----------  FOR TORONTO ONLY TEMPORARILY
           IF MPLTINFO-COMPANY = "630"
              MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I
              READ MSTORERM-I INTO BUF-MSTORERM
                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
              END-READ
              IF FILE-STATUS NOT = "00"
                 MOVE "DBGET MSTORERM ERR IN 92-CONT" TO BU-DISPLAY-MSG
                 GO TO 2-BLOWUP
              ELSE
                 MOVE SPACES TO PRT-REC, PRT-PREV-CODE
                 MOVE STR-PREV-CODE TO PRT-PREV-CODE
                 ADD 1 TO LINE-K
                 WRITE PRT-REC FROM PRT-PREV AFTER ADVANCING 1 LINES.

      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-K
               WRITE PRT-REC FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

           IF MTLS-DESC-OPT NOT = "X"
               GO TO 822-RTN-SORT-FILE.

       821-PRT-MULT-DESC.
           ADD 1 TO SUB.
           IF SUB > CDESC-LINES-GOT
               GO TO 822-RTN-SORT-FILE.
           MOVE CDESC (SUB) TO PRT-FULL-DESC.
           WRITE PRT-REC FROM FULL-DESC-LINE AFTER ADVANCING 1.
           ADD 1 TO LINE-K.

           GO TO 821-PRT-MULT-DESC.

       822-RTN-SORT-FILE.
           RETURN SORT-FILE AT END
               MOVE "Y" TO END-OF-SORT-FILE.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF END-OF-SORT-FILE NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF END-OF-SORT-FILE = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRT-REC
                   WRITE PRT-REC             AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRT-REC FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
                   IF END-OF-SORT-FILE = "N"
                       MOVE 60            TO  LINE-K
                       PERFORM 9-CHECK-HEADINGS.

       82-PSR-EXIT.
           EXIT.

       8-WR-EXIT.
           EXIT.

       9-UTILITY SECTION.

       COPY OVRPFCALL IN COPYLIB.

       COPY MTLSUTIL  IN COPYLIB.

       9-CHECK-HEADINGS.
           IF LINE-K > 59
               ADD     1      TO PAGE-K
               MOVE    1      TO LINE-K
               MOVE PAGE-K    TO PRT-PAGE
               ADD     3      TO LINE-K
               WRITE PRT-REC FROM HEADING-1 AFTER ADVANCING NEW-PAGE
               WRITE PRT-REC FROM HEADING-2 AFTER ADVANCING 1 LINE
               IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
                 MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
                 WRITE PRT-REC FROM HEADING-2B AFTER ADVANCING 1 LINE
                 ADD   1      TO LINE-K
               END-IF
      *        WRITE PRT-REC FROM HDR-1 AFTER ADVANCING NEW-PAGE
      *        WRITE PRT-REC FROM HDR-2 AFTER ADVANCING 1 LINES
               WRITE PRT-REC FROM HDR-3 AFTER ADVANCING 2 LINES
               MOVE SPACES TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1 LINES.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
