       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TRPTJ103.
       AUTHOR.        CA YODER.
       DATE-WRITTEN.  DECEMBER 1997.
       DATE-COMPILED.
      *
      *    THIS PROGRAM SETS THE JCW FOR REPORT #103 REQUIREMENT ORDERS
      *    BY VENDOR CODE AND CALLS TRSCREEN TO PRINT THE REPORT
      *    (TBLKBYVN).
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS-400.
       OBJECT-COMPUTER.  AS-400.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  BASE    PIC X(10).

       COPY JCWAREA IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       PROCEDURE DIVISION.
       1000-START.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           GOBACK.

       2100-BLOWUP.
           MOVE "TRPTJ103"             TO   BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
             DUMMY-VIEW-AREA DUMMY-KSAM-STAT BU-DISPLAY-MSG
                 BU-DISPLAY-FLDS.

       6000-MAIN.
           MOVE "103"       TO SETJCW-VALUE.
           MOVE 278         TO SETJCW-STARTING-POS.
           MOVE 3           TO SETJCW-LENGTH.
           CALL "SETJCW" USING SETJCW-VALUE,
                               SETJCW-STARTING-POS,
                               SETJCW-LENGTH,
                               SETJCW-STATUS.
           IF SETJCW-STATUS NOT = "00"
               MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           CALL "TRSCREEN".

       6990-MAIN-X.
           EXIT.
