       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TRPTUSE.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        OCTOBER, 1982.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *C REMARKS.             USAGE REPORT.
      *C
      *C   CI HILLES       NOVEMBER  8, 1983
      *C   UPPED THE FILE LIMIT OF THE S-FILE FOR REPORT FROM 40,000
      *C   TO 50,000 RECORDS.
      *C
      *C   CI HILLES       DECEMBER 13, 1983
      *C   MADE THE FOLLOWING MODIFICATIONS:
      *C     1.  "FULL DESCRIPTION" CAPABILITY ADDED.  IF "FULL DESC"
      *C         OPTION IS PICKED IN "XR10MODE", THIS PGM WILL PRINT
      *C         ALL LINES OF DESCRIPTION FOR EACH CODE.
      *C
      *C     2.  SLIGHT CHANGES TO PRINT FORMAT.  THE CODE HEADING NOW
      *C         PRINTS FOR EACH CODE, RATHER THAN ONLY ONCE AT TOP OF
      *C         PAGE.
      *C
      *C     3.  A PROGRAM ERROR WAS CORRECTED.  IF AN ACCOUNTING
      *C         CLASS WAS SELECTED THAT DID NOT EXIST, SEVERAL "CVAD"
      *C         ERRORS APPEARED IN THE JOB STREAM.
      *C
      *C     4.  IF NO CODES QUALIFIED FOR SELECT OPTION, A MESSAGE
      *C         IS PRINTED ON THE REPORT TO THAT EFFECT.
      *C
      *C   CI HILLES       JUNE 8, 1984
      *C   CHANGED THE "AVG ISS" HEADING
      *C   (STR-MTH-FCST ITEM IN MSTORERM SEGMENT) TO "AVG USE".
      *C   THIS REFLECTS THE CHANGE MADE STARTING JULY 1 - FROM THIS
      *C   TIME ON, THE STR-MTH-FCST FIELD WILL BE UPDATED FROM THE
      *C   USAGE DATA ON THE HP, RATHER THAN TRANSMISSIONS FROM THE
      *C   IBM MAINFRAME.
      *C   NOTE :  THE HEADER FILE FOR THIS REPORT "R10HEAD" WAS
      *C   CHANGED TO REFLECT THE NEW AVERAGE USAGE ALSO.
      *C
      *C   CI HILLES       SEPTEMBER 6, 1984
      *C   CHANGED THE PROGRAM TO USE A SP SPOOLFILE EOF LIMIT OF 60,000
      *C   IF "ALL ITEMS" OPTION IS PICKED (UP FROM 50,000).
      *C
      *C   DA PLUM         MARCH 25, 1984
      *C   MADE THE FOLLOWING PROGRAM CHANGES:
      *C     1) THE REPORT OPTIONS WILL NOW BE COBOL "ACCEPT"ED FROM
      *C        PROGRAM "TRSCREEN" RATHER THAN READ IN FROM A FILE.
      *C        PROGRAM "XR10MODE" IS NO LONGER IN USE.
      *C     2) ADDED AN ACCEPT OF ROUTING DATA WHICH IS PROVIDED BY
      *C        "TRSCREEN" AND A CALL TO "THDPRT2" WHICH USES THIS DATA
      *C        TO PRINT A HEADER PAGE.
      *C     3) THE REPORT OPTIONS WERE REVISED TO ALLOW THE SELECTION
      *C        OF A RANGE OF CORPORATE CODES OR ACCOUNTING CLASSES,
      *C        RATHER THAN HAVING THE USER SELECT A FIXED NUMBER OF
      *C        MAJOR GROUPS OR ACCOUNTING CLASSES.
      *C     4) THE REPORT HEADING WAS REVISED TO IDENTIFY THE SORT AND
      *C        MATERIAL OPTIONS CHOOSEN, INCLUDING THE RANGE SPECIFIED.
      *C     5) SUBPROGRAM "TDATECHK" WAS INCORPORATED WHICH SOLVES THE
      *C        PROBLEM OF EUROPEAN DATES.  THIS SUBPROGRAM RETURNS THE
      *C        DATE IN THE PROPER FORMAT FOR EACH PLANT.
      *C
      *C   DA PLUM         JULY 30, 1985
      *C   CHANGED TEXT LENGTH TO 55 FOR ALL TYPES OF
      *C   PRINTERS REGARDLESS OF THE REPORT OPTIONS CHOOSEN.
      *C
      *C   CJ ROBINSON     JANUARY 20, 1987
      *C   CHANGED TO CALL SUBPROGRAM "CDESC" TO GET FULL DESCRIPTION
      *C   IF REQUESTED.
      *C
      *C   CR KALMAN       DECEMBER 1, 1993
      *C   WHEN THIS PROGRAM WAS CONVERTED TO THE AS/400 THE SCREEN
      *C   SHOWING THE POSSIBLE SELECTIONS NO LONGER REQUIRES THE
      *C   SORT OPTION TO BE ENTERED. IF LEFT EMPTY, THIS CAUSES THE
      *C   PROGRAM TO BLOWUP. SINCE THERE IS NO EASY WAY TO FORCE THIS
      *C   OPTION TO BE REQUIRED, I AM DEFAULTING THE SORT OPTION TO "1"
      *C   IF IT IS LEFT BLANK. THIS CAN BE CHANGED TO ANOTHER OPTION
      *C   IF IT'S BETTER.  ALSO ADDED THE COMMENT "(DEFAULT = 1)" TO
      *C   THE DSPF ZRSCREEN, RECORD FR10SCRN.
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
      *C
      *C  SEPT 03, 1996   CA YODER
      *C     MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
      *C  07/24/1997   CA YODER     REQ #95-015
      *C    MODIFIED PROGRAM TO ACCEPT AND USE THE NEW OPTIONS ADDED
      *C    TO THE MATERIALS CONTROL REPORTS.
      *C    NOTE:  THIS PROGRAM NOW USES COPYLIB MEMBERS FOR MOST OF
      *C           ITS PROCESSING LOGIC.  TO SEE ALL OF THE MEMBERS,
      *C           LOOK IN COPYLIB FOR THE FILES THAT START WITH THE
      *C           PREFIX "MTLS".
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
      *C  01/28/98    CA YODER
      *C     TOOK OUT PAGE ADVANCE BETWEEN CONTROL BREAKS FOR KEYWORD/
      *C     MODIFIER SORT.  USERS COMPLAINED THAT THE REPORT IS TOO
      *C     LONG WITH ALL THE PAGE BREAKS.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. C01 IS NEWPAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-FILE     ASSIGN TO DISK-SORT.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DDESC-I
                  ASSIGN TO DATABASE-MCFLCS1401
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-I
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DMANPART-I
                  ASSIGN TO DATABASE-MCFLCS3603
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       COPY MTLSSORT IN COPYLIB.

      *SD  SORT-FILE
      *    RECORD CONTAINS 242 CHARACTERS.
      *01  SORT-RCD.
      *    05  SORT-DETAIL.
      *        10  SORT-CODE          PIC X(8).
      *        10  SORT-CLASS         PIC X(4).
      *        10  SORT-UM            PIC XX.
      *        10  SORT-ONHAND        PIC S9(8).
      *        10  SORT-MTH-FCST      PIC S9(8).
      *        10  SORT-YTD-USAGE     PIC S9(8).
      *        10  SORT-USAGES OCCURS 14 TIMES.
      *            15  SORT-USAGE     PIC S9(8).
      *        10  SORT-PRIM-LOC      PIC X(12).
      *        10  SORT-DESC          PIC X(80).

       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE           PIC X(132).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  DDESC-I
           LABEL RECORDS ARE STANDARD.
       01  DDESC-REC-I.
           COPY DDS-MCRPCS1400  OF MCFLCS1401.

       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  DMANPART-I
           LABEL RECORDS ARE STANDARD.
       01  DMANPART-REC-I.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       WORKING-STORAGE SECTION.

       77  PLT-ARG                    PIC X(4)   VALUE "P 01".
      *----------  CODE-CTR :  NUMBER OF CODES PRINTED ON REPORT
       77  CODE-CTR                   PIC 9(5)   VALUE 0.
       77  PAGE-CTR                   PIC S9(4)  COMP       VALUE 0.
       77  LINE-ADV                   PIC S9(4)  COMP       VALUE 0.
       77  FILE-IS-RETURNED           PIC X      VALUE "N".
       77  YEAR-TO-DATE               PIC S9(9)  COMP-4.
       77  TOTAL-ONHAND               PIC S9(9)  VALUE 0.
       77  TOTAL-MTD-USAGE            PIC S9(9)  VALUE 0.
       77  TOTAL-YTD-USAGE            PIC S9(9)  VALUE 0.
       77  SUB                        PIC S9(4)  COMP-4.
       77  SUB2                       PIC S9(4)  COMP-4.
       77  SUB3                       PIC S9(4)  COMP-4.
       77  MM-9                       PIC 99.
       77  PREV-MONTH                 PIC 99.
       77  SAVE-CLASS                 PIC X(4).
      *---------- CODES-RELEASED:  NUMBER OF CODES RELEASED TO PRINT ROUTINES
      *77  CODES-RELEASED             PIC 9(5)   VALUE 0.
       77  TEXT-LEFT                  PIC 9(2)   VALUE 0.
       77  TEXT-LENGTH                PIC 9(2)   VALUE 55.
       77  TEXT-TO-PRINT              PIC 9(2)   VALUE 0.
       77  LINE-CTR                   PIC 9(2)   VALUE 1.
      *------------ CODES-STR-TOTAL:  TOTAL NUMBER OF CODES IN STOREROOM
      *------------ DEFINED AS CODES WHOSE REORDER POINT > 0
       77  CODES-STR-TOTAL            PIC 9(5)   VALUE 0.

9406CK 01  SCOPE   PIC X.

      *-------- ACCOUNT FOR CENTURY.
       01  DATE-BUFFER-CN.
           05  CC-BUF                 PIC 99.
           05  DATE-BUFFER.
               10  YY-BUF             PIC 99.
               10  MM-BUF             PIC 99.
               10  DD-BUF             PIC 99.

       01  DATE-BUFFER-R   REDEFINES  DATE-BUFFER-CN.
           05  R-YEAR                 PIC 9(4).
           05  FILLER                 PIC 9(4).

       01  YEAR-AGO-DATE-CN.
           05  YEAR-AGO-YYYY          PIC 9(4).
           05  YEAR-AGO-MM            PIC 99.
           05  YEAR-AGO-DD            PIC 99.

      ****** PARMS FOR CALL TO "THDPRT2" (HEADER PAGE SUBPROG)  ******
      ****** HD-ROUTE-DATA IS ACCEPTED FROM PGM "TRSCREEN".    ******

       01  HD-RET-CODE                PIC S9(4) COMP-4 VALUE 0.
       01  HD-FILE-NAME               PIC X(17) VALUE SPACES.
       01  FNUM                       PIC S9(4) COMP-4 VALUE 0.

       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.

       01  SAVE-DESC-AREA.
           05  SAVE-DESC-LINE OCCURS 15 TIMES.
               10  SAVE-DESC          PIC X(80).

       COPY TCHKBLKT IN COPYLIB.

       COPY MTLSWORK IN COPYLIB.

      *---------- USAGE INFO.
       01  HOLD-YTD-USAGE     PIC S9(8).
       01  USAGE-TABLE.
           05  HOLD-USAGES OCCURS 14 TIMES.
               10  HOLD-USAGE     PIC S9(8).

       01  SWITCH-AREA.
           05  END-OF-INPUT-FILE               PIC X VALUE "N".
               88  ALL-INPUT-RECORDS-PROCESSED       VALUE "Y".

      **************************************************************
      **                                                          **
      **            E S C A P E   S E Q U E N C E S               **
      **                                                          **
      **************************************************************

       01  COMPRESS-PRINT            PIC X(8).

       01  NORMAL-PRINT              PIC X(8).

       COPY ESCNAM2 IN COPYLIB.

      **************************************************************
      **                                                          **
      **             D A T E / T I M E   A R E A S                **
      **                                                          **
      **************************************************************

       COPY TDATECHK IN COPYLIB.

      **************************************************************
      **                                                          **
      **         E R R O R   M E S S A G E   A R E A S            **
      **                                                          **
      **************************************************************

       COPY TBLOWUP IN COPYLIB.
       01  VIEW-COMAREA.
           05  FILLER                 PIC X(118) VALUE ALL "0".
           05  FILLER                 PIC S9(4)  COMP-4 VALUE 9999.

      **************************************************************
      **                                                          **
      **       C O M M U N I C A T I O N S   A R E A S            **
      **                                                          **
      **************************************************************

       01  SPOOLER-AREA.
           05  SPOOL-STAT           PIC S9     COMP-4 VALUE 0.
           05  SPOOL-PRT            PIC S9(2)  COMP-4 VALUE 19.
           05  SPOOL-COPIES         PIC S9(2)  COMP-4 VALUE 1.
           05  SPOOL-PRIOR          PIC S9     COMP-4 VALUE 0.
           05  SPOOL-MSG            PIC X(75) VALUE SPACES.

       01  SPOOL-LIMIT          PIC S9(8) COMP-4 VALUE 50000.
       01  SPOOL-FEQ-NAME       PIC X(8)  VALUE "SXXXXXXX".

      **************************************************************
      **                                                          **
      **           D A T A B A S E   W O R K                      **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       COPY DATAB IN COPYLIB.

       01  DB-DATASETS.
           05  DSET-NAME           PIC X(16)  VALUE SPACES.
           05  DSET-MSTORERM       PIC X(16)  VALUE "MSTORERM;".
           05  DSET-DDESC          PIC X(16)  VALUE "DDESC;".
           05  DSET-MPLTINFO       PIC X(16)  VALUE "MPLTINFO;".

       01  ITEM-LISTS.
           05  ALL-ITEM-LIST          PIC XX   VALUE "@;".
           05  CODE-SEARCH            PIC X(10) VALUE "CORP-CODE;".

       01  CODE-ARG.
           05  CODE-ARG-1-2           PIC X(2).
           05  FILLER                 PIC X(6).

      **************************************************************
      **                                                          **
      **           D A T A B A S E   B U F F E R S                **
      **                                                          **
      **************************************************************

       COPY MSTORERM IN COPYLIB.

       01  BUF-DDESC.
           05  DESC-CORP-CODE         PIC X(8).
           05  DESC-ID-NUM            PIC XX.
           05  DESC-DATA              PIC X(80).
           05  DESC-ID-00  REDEFINES DESC-DATA.
               10  DESC-KWRDADJ       PIC X(46).
               10  FILLER             PIC X(34).
      *        AN 00 ID
      *           KWRD-ADJ OF 46
      *           MFR DATA OF 34
      *        AN 01 ID
      *           FIRST 80 CHAR OF CATLG

       01  BUF-MPLTINFO.
           05  MPLTINFO-KEY             PIC X(4).
           05  MPLTINFO-DATA            PIC X(60).
           05  MPLTINFO-01 REDEFINES MPLTINFO-DATA.
               10  MPLTINFO-COMP        PIC X(3).
               10  MPLTINFO-PRIME       PIC X(3).
               10  MPLTINFO-TERR        PIC X(4).
               10  MPLTINFO-PLT-NAME    PIC X(50).

           COPY DMANPART IN COPYLIB.

      **************************************************************
      **                                                          **
      **               K S A M   W O R K                          **
      **                                                          **
      **************************************************************

       01  USAGE-REC.
           05  FILLER                   PIC XX.
           05  K-CORP-CODE.
               10  K-CORP-CODE-1-2      PIC X(2).
               10  FILLER               PIC X(6).
           05  K-MONTHS                 OCCURS 14 TIMES.
               10  K-MTH-USAGE          PIC S9(9) COMP-4.
           05  K-MONTHS-DD              OCCURS 14 TIMES.
               10  K-MTH-USAGE-DD       PIC S9(9) COMP-4.

       01  STARTING-POINT.
           05  STARTING-POINT-1-7       PIC X(7) VALUE LOW-VALUES.
           05     FILLER                PIC X(1) VALUE LOW-VALUES.

       01  ENDING-POINT.
           05  ENDING-POINT-1-7         PIC X(7) VALUE HIGH-VALUES.
           05     FILLER                PIC X(1) VALUE HIGH-VALUES.


       COPY CDESC IN COPYLIB.

       01  RET-CODE             PIC X(2)  VALUE SPACES.

      **************************************************************
      **                                                          **
      **       H E A D E R   &   D E T A I L   L I N E S          **
      **                                                          **
      **************************************************************

      *01  HEADER-1.
      *    05  FILLER           PIC X(5)  VALUE " PAGE".
      *    05  PRT-PAGENO       PIC ZZZ9.
      *    05  FILLER           PIC X(4)  VALUE SPACES.
      *    05  CLASS-HD         PIC X(7).
      *    05  PRT-CLASS        PIC X(4).
      *    05  FILLER           PIC X(23)  VALUE SPACES.
      *    05  FILLER           PIC X(12)  VALUE "U S A G E   ".
      *    05  FILLER           PIC X(11)  VALUE "R E P O R T".
      *    05  FILLER           PIC X(31) VALUE SPACES.
      *    05  FILLER           PIC X(6)  VALUE "DATE: ".
      *    05  PRT-DATE         PIC X(8).
      *    05  FILLER           PIC X(2)  VALUE SPACES.
      *    05  FILLER           PIC X(6)  VALUE "TIME: ".
      *    05  PRT-TIME         PIC X(8).
      *
      *01  HEADER-2.
      *    05     FILLER        PIC X(34) VALUE SPACES.
      *    05  HEADER-2-MSG     PIC X(48) VALUE SPACES.
      *    05     FILLER        PIC X(50) VALUE SPACES.
      *
      *01  HEADER-2-MESSAGES.
      *    05     FILLER        PIC X(48) VALUE
      *      "             SORTED BY CORPORATE CODE           ".
      *    05     FILLER        PIC X(48) VALUE
      *      "SORTED BY CORPORATE CODE WITHIN ACCOUNTING CLASS".
      *    05     FILLER        PIC X(48) VALUE
      *      "           SORTED BY KEYWORD-ADJECTIVE          ".
      *    05     FILLER        PIC X(48) VALUE
      *      "          SORTED BY LAST 12 MONTH USAGE         ".
      *    05     FILLER        PIC X(48) VALUE
      *      "             SORTED BY AVERAGE USAGE            ".
      *
      *01  HEADER-2-MSG-TBL REDEFINES HEADER-2-MESSAGES.
      *    05  HEADER-2-MSG-VALUE  OCCURS 5 TIMES
      *                            INDEXED BY HD2-INDEX   PIC X(48).
      *
      *01  HEADER-3.
      *    05     FILLER        PIC X(19) VALUE SPACES.
      *    05  HEADER-3-MSG     PIC X(77) VALUE SPACES.
      *    05     FILLER        PIC X(36) VALUE SPACES.
      *
      *01  HEADER-3-MESSAGES.
      *    05  HD3-MAT1-MSG.
      *        10   FILLER      PIC X(25) VALUE SPACES.
      *        10   FILLER      PIC X(14) VALUE "ALL CORPORATE ".
      *        10   FILLER      PIC X(14) VALUE "CODES SELECTED".
      *        10   FILLER      PIC X(24) VALUE SPACES.
      *    05  HD3-MAT2-MSG.
      *        10   FILLER      PIC X(31) VALUE "CORPORATE CODES ".
      *        10 HD3-MAT2-LOW  PIC X(7)  VALUE SPACES.
      *        10   FILLER      PIC X(9)  VALUE " THROUGH ".
      *        10 HD3-MAT2-HIGH PIC X(7)  VALUE SPACES.
      *        10   FILLER      PIC X(23) VALUE " SELECTED".
      *    05  HD3-MAT3-MSG.
      *        10   FILLER      PIC X(18) VALUE SPACES.
      *        10   FILLER      PIC X(19) VALUE "ACCOUNTING CLASSES ".
      *        10 HD3-MAT3-LOW  PIC X(3)  VALUE SPACES.
      *        10   FILLER      PIC X(9)  VALUE " THROUGH ".
      *        10 HD3-MAT3-HIGH PIC X(3)  VALUE SPACES.
      *        10   FILLER      PIC X(25) VALUE " SELECTED  ".
      *    05  HD3-MAT4-MSG.
      *        10   FILLER      PIC X(25) VALUE SPACES.
      *        10   FILLER      PIC X(15) VALUE "SARA REPORTABLE".
      *        10   FILLER      PIC X(15) VALUE " CODES SELECTED".
      *        10   FILLER      PIC X(22) VALUE SPACES.
      *    05  HD3-OH-MSG.
      *        10   FILLER      PIC X(16) VALUE SPACES.
      *        10   FILLER      PIC X(16) VALUE "CORPORATE CODES".
      *        10   FILLER      PIC X(21) VALUE "WHOSE ONHAND IS ZERO".
      *        10   FILLER      PIC X(24) VALUE "SELECTED".
      *    05  HD3-OH-ACTIVITY-MSG.
      *        10   FILLER      PIC X(16) VALUE "CORPORATE CODES".
      *        10   FILLER      PIC X(21) VALUE "WHOSE ONHAND IS ZERO".
      *        10   FILLER      PIC X(22) VALUE "AND HAVE MOVED IN THE".
      *        10   FILLER      PIC X(18) VALUE "PAST YEAR SELECTED".

       COPY MTLSHDNG IN COPYLIB.

       01  CODE-HEADER.
           05  FILLER           PIC X(6)  VALUE "CODE  ".
           05  FILLER           PIC X(3)  VALUE SPACES.
           05  FILLER           PIC X(11) VALUE "DESCRIPTION".
           05  FILLER           PIC X(51) VALUE SPACES.
           05  FILLER           PIC X(8)  VALUE "  ONHAND".
           05  FILLER           PIC X(4)  VALUE SPACES.
           05  FILLER           PIC X(8)  VALUE "LOCATION".
           05  FILLER           PIC X(5)  VALUE SPACES.
           05  FILLER           PIC X(7)  VALUE "AVG USE".
           05  FILLER           PIC X(6)  VALUE SPACES.
           05  FILLER           PIC X(3)  VALUE "MTD".
           05  FILLER           PIC X(3)  VALUE SPACES.
           05  FILLER           PIC X(6)  VALUE "   LTM".
           05  FILLER           PIC X(5)  VALUE SPACES.
           05  FILLER           PIC X(4)  VALUE "YEST".

       01  DETAIL-1.
           05  PRT-CODE         PIC X(7).
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-DESC         PIC X(60).
           05  FILLER           PIC X(1)  VALUE SPACES.
           05  PRT-ONHND        PIC ZZZZZZZ9.
           05  FILLER           PIC X(1)  VALUE SPACES.
           05  PRT-UM           PIC X(2).
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-LOC          PIC X(12).
           05  PRT-AVG-ISS      PIC -------9.
           05  PRT-MTD-USE      PIC --------9.
           05  PRT-YTD-USE      PIC --------9.
           05  PRT-YEST-USE     PIC --------9.

       01  DESC-LINE.
           05  FILLER           PIC X(9)  VALUE SPACES.
           05  PRT-DESC-2       PIC X(80).

       01  USAGE-HEADER.
           05  FILLER           PIC X(9)  VALUE "      JAN".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      FEB".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      MAR".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      APR".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      MAY".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      JUN".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      JUL".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      AUG".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      SEP".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      OCT".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      NOV".
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  FILLER           PIC X(9)  VALUE "      DEC".
           05  FILLER           PIC X(2)  VALUE SPACES.

       01  DETAIL-2.
           05  PRT-JAN-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-FEB-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-MAR-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-APR-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-MAY-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-JUN-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-JUL-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-AUG-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-SEP-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-OCT-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-NOV-USAGE    PIC --------9.
           05  FILLER           PIC X(2)  VALUE SPACES.
           05  PRT-DEC-USAGE    PIC --------9.
       01  TOTAL-LINE-1.
           05  FILLER           PIC X(12) VALUE "TOTAL UNITS ".
           05  FILLER           PIC X(13) VALUE "ONHAND   ".
           05  PRT-TOTAL-ONHAND PIC ---------9.

       01  TOTAL-LINE-2.
           05  FILLER           PIC X(12) VALUE "TOTAL UNITS ".
           05  FILLER           PIC X(13) VALUE "USED MTD".
           05  PRT-TOTAL-MTD    PIC ---------9.

       01  TOTAL-LINE-3.
           05  FILLER           PIC X(12) VALUE "TOTAL UNITS ".
           05  FILLER           PIC X(13) VALUE "USED YTD".
           05  PRT-TOTAL-YTD    PIC ---------9.

       01  TOTAL-LINE-4.
           05  FILLER           PIC X(12) VALUE "TOTAL CODES ".
           05  FILLER           PIC X(13) VALUE "SELECTED ".
           05  PRT-TOTAL-CODES  PIC ---------9.

       01  TOTAL-LINE-5.
           05  FILLER           PIC X(12) VALUE "TOTAL CODES ".
           05  FILLER           PIC X(13) VALUE "IN STOREROOM ".
           05  PRT-CODES-STR-TOTAL  PIC ---------9.

      *******************************************************************
      *******************************************************************
      **                                                               **
      **     P R O C E D U R E    D I V I S I O N                      **
      **                                                               **
      *******************************************************************
      *******************************************************************

      *LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.

       COPY MTLSLINK IN COPYLIB.

      ****** R10-REC IS ACCEPTED FROM PGM "TRSCREEN". ******
      *01  R10-REC.
      *    05  R10-SORT-OPTION      PIC X(1).
      *    05  R10-SORT-OPTION-NUM REDEFINES R10-SORT-OPTION PIC 9(1).
      *    05  R10-MATERIAL-OPTION  PIC X(1).
      *    05 R10-CORP-CODE-1.
      *       10 R10-ACCT-CLASS-1   PIC X(3).
      *       10    FILLER          PIC X(4).
      *    05 R10-CORP-CODE-2.
      *       10 R10-ACCT-CLASS-2   PIC X(3).
      *       10    FILLER          PIC X(4).
      *    05  R10-DESC-OPTION      PIC X(1).
      *    05  R10-STOCK-OUT-OPTION PIC X(1).
      *    05  R10-ACTIVITY-OPTION  PIC X(1).
      *    05  FILLER               PIC X(61).
      *    05  FILLER               PIC X(81).

      *PROCEDURE DIVISION USING HD-ROUTE-DATA, MTLS-CNTL-DATA.
       PROCEDURE DIVISION.
       START-UP SECTION.
       1-HOUSEKEEPING.
           ACCEPT HD-ROUTE-DATA.
           ACCEPT MTLS-DATA-LINE-1.
           ACCEPT MTLS-DATA-LINE-1B.
           ACCEPT MTLS-DATA-LINE-2.

9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT MPLTINFO-I, MSTORERM-I, DDESC-I, USAGEFIL-I,
                                                       DMANPART-I.
           MOVE "DHDR10.PUB" TO HD-FILE-NAME.
           CALL "TESCSEQ" USING ESC-NAME.
           MOVE CHAR-1636PI     TO COMPRESS-PRINT.
           MOVE CHAR-10PI       TO NORMAL-PRINT.
      *    CALL "DBGET" USING BASE, DSET-MPLTINFO, MODE7, STATUS-AREA,
      *        ALL-ITEM-LIST, BUF-MPLTINFO, PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET ERR MPLTINFO 1-BH" TO BU-DISPLAY-MSG
               MOVE PLT-ARG                   TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

      ************************************************
      ** CALL TO "TDATECHK" RETURNS THE PROPERLY    **
      ** FORMATTED DATE AND TIME.                   **
      ************************************************

           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT            TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT   TO PRT-TIME.
           MOVE DATE-YMD-OUT              TO DATE-BUFFER.
      *--------- ACCOUNT FOR CENTURY.
           IF YY-BUF > 70
               MOVE 19             TO CC-BUF
           ELSE
               MOVE 20             TO CC-BUF.

      **************************************************************
      *  CALCULATE THE DATE ONE-YEAR-AGO.                          *
      **************************************************************
      *-------- THIS IS NOW DONE IN THE MATERIALS CONTROL
      *-------- COMMON ROUTINES.
      *    MOVE MM-BUF             TO YEAR-AGO-MM.
      *    MOVE DD-BUF             TO YEAR-AGO-DD.
      *-------- ACCOUNT FOR CENTURY.
      *    COMPUTE YEAR-AGO-YYYY = R-YEAR - 1.

      ************************************************
      **  ACCEPT ROUTING INFO FROM PGM "TRSCREEN"   **
      **  WHICH WILL BE PASSED ON TO PGM "THDPRT2".  **
      ************************************************

           DISPLAY "H-R-D = " HD-ROUTE-DATA.
      ************************************************
      **  ACCEPT R10-REC TO DETERMINE PARMS FOR     **
      **  REPORT.  PARMS ARE ESTABLISHED BY PROGRAM **
      **  XRSCREEN.OBJECT.                          **
      ************************************************

           DISPLAY "MTLS-CNTL-DATA = " MTLS-CNTL-DATA.

           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
             HD-ROUTE-DATA, ESC-NAME.

           PERFORM 9-MOVE-OPTION-LINES.
           WRITE PRINT-RCD FROM OPTION-LINE-1  AFTER ADVANCING 3 LINES.
           WRITE PRINT-RCD FROM OPTION-LINE-2  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-2B AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-2C AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-3  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-4  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-5  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-6  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-7  AFTER ADVANCING 1 LINE.
           WRITE PRINT-RCD FROM OPTION-LINE-8  AFTER ADVANCING 1 LINE.

      *------- MOVE HEADING INFO.
           MOVE MTLS-RPT-TITLE     TO PRT-RPT-TITLE.
           MOVE "TRPTUSE "         TO PRT-PGM-NAME.
           IF MTLS-FROM-RANGE > SPACES OR MTLS-TO-RANGE > SPACES
               PERFORM 9-MOVE-HEADING-DESC.
           MOVE 1 TO DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT TO PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT TO PRT-TIME.

      *---------- IF THE "ALL ITEMS" OPTION IS PICKED, WE MOVE
      *           60,000 TO THE EOF LIMIT FOR THE PRINT FILE.
      *
      *    IF R10-MATERIAL-OPTION = "1"
      *        MOVE 60000  TO  SPOOL-LIMIT.

9312CK*----TO AVOID BLOWING UP BECAUSE NO SORT OPTION WAS ENTERED
  .   *----DEFAULT TO SORT OPTION = 1.
  .   *    IF R10-SORT-OPTION = SPACES
9312CK*       MOVE "1" TO R10-SORT-OPTION.

      *    IF R10-SORT-OPTION > "0" AND < "6"
      *      SET HD2-INDEX TO R10-SORT-OPTION-NUM
      *      MOVE HEADER-2-MSG-VALUE (HD2-INDEX) TO HEADER-2-MSG
      *    ELSE
      *      MOVE SPACES TO HEADER-2-MSG.
      *
      *    IF R10-MATERIAL-OPTION = "1"
      *        IF R10-STOCK-OUT-OPTION = "X"
      *            IF R10-ACTIVITY-OPTION = "X"
      *                MOVE HD3-OH-ACTIVITY-MSG
      *                               TO HEADER-3-MSG
      *            ELSE
      *                MOVE HD3-OH-MSG
      *                               TO HEADER-3-MSG
      *        ELSE
      *            MOVE HD3-MAT1-MSG  TO HEADER-3-MSG
      *    ELSE IF R10-MATERIAL-OPTION = "2"
      *        MOVE R10-CORP-CODE-1  TO HD3-MAT2-LOW
      *        MOVE R10-CORP-CODE-2  TO HD3-MAT2-HIGH
      *        MOVE HD3-MAT2-MSG     TO HEADER-3-MSG
      *    ELSE IF R10-MATERIAL-OPTION = "3"
      *          MOVE R10-ACCT-CLASS-1 TO HD3-MAT3-LOW
      *          MOVE R10-ACCT-CLASS-2 TO HD3-MAT3-HIGH
      *          MOVE HD3-MAT3-MSG     TO HEADER-3-MSG
      *    ELSE IF R10-MATERIAL-OPTION = "4"
      *          MOVE HD3-MAT4-MSG     TO HEADER-3-MSG
      *    ELSE
      *          MOVE SPACES TO HEADER-3-MSG.

       BEGIN-SORT.

       COPY MTLSPROC IN COPYLIB.

      **************************************************************
      **   IF SORT-OPTION IS BY CORP-CODE, WE CAN SAVE TIME BY    **
      **   NOT DOING A SORT, SINCE USAGEFIL IS LOGICALLY SORTED   **
      **   CORP-CODE.  IF MATERIAL-OPTION IS "SELECT A CORP CODE  **
      **   RANGE", (AND SORT OPTION IS NOT BY CORP-CODE), WE USE  **
      **   A DIFFERENT INPUT PROCEDURE TO SAVE TIME.  IN THIS CASE**
      **   SINCE USAGEFIL IS SORTED BY CODE, WE CAN AVOID THE     **
      **   SERIAL READ THROUGH THE WHOLE DATABASE.                **
      **************************************************************

      ***  SORT BY CODE WITHIN CLASS
      *    IF R10-SORT-OPTION = "2"
      ***  SELECT A CORP CODE RANGE
      *        IF R10-MATERIAL-OPTION = "2"
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-CLASS
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 5-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      ***  SELECT ON OTHER THAN A CORP CODE RANGE
      *        ELSE
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-CLASS
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 6-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *    ELSE
      ***  SORT ON CORPORATE CODE
      *    IF R10-SORT-OPTION = "1"
      *         PERFORM 9-CKREAD-REPORT THRU 9-CR-X
      *    ELSE
      ***  SORT BY KEYWORD ADJECTIVE
      *    IF R10-SORT-OPTION = "3"
      *        IF R10-MATERIAL-OPTION = "2"
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-DESC
      *                                       SORT-CODE
      *                  INPUT  PROCEDURE IS 5-INPUT-CODES
      *                  OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *        ELSE
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-DESC
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 6-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *    ELSE
      ***  SORT BY LAST 12 MONTHS
      *    IF R10-SORT-OPTION = "4"
      *        IF R10-MATERIAL-OPTION = "2"
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-YTD-USAGE
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 5-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *         ELSE
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-YTD-USAGE
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 6-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *    ELSE
      ***  SORT BY AVERAGE ISSUE
      *    IF R10-SORT-OPTION = "5"
      *        IF R10-MATERIAL-OPTION = "2"
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-MTH-FCST
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 5-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *         ELSE
      *            SORT SORT-FILE
      *              ON ASCENDING KEY         SORT-MTH-FCST
      *                                       SORT-CODE
      *                   INPUT  PROCEDURE IS 6-INPUT-CODES
      *                   OUTPUT PROCEDURE IS 7-WRITE-REPORT
      *    ELSE
      *        MOVE "INVALID SORT OPTION REC'D" TO BU-DISPLAY-MSG
      *        MOVE R10-SORT-OPTION TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.

           GO TO 2-STOP-RUN.

       2-BLOWUP.
           MOVE CODE-ARG TO BU-DISPLAY-FLD (1).
           MOVE "TRPTUSE" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-AREA.

       2-STOP-RUN.
           CLOSE MPLTINFO-I, MSTORERM-I, DDESC-I, USAGEFIL-I,
                                                  DMANPART-I.
           CLOSE ONLINE-PRT.
           GOBACK.

      *5-INPUT-CODES SECTION.
      *5-INPUT-CODES-PARA.
      *
      **************************************************************
      **   THIS IS THE INPUT TO THE SORT IF MATERIAL OPTION WAS   **
      **   "SELECT A CORP CODE RANGE". HERE WE ARE SAVING THE TIME**
      **   TO DO A SERIAL READ OF THE ENTIRE DATABASE.  INSTEAD,  **
      **   WE GO THRU A SECTION OF THE CODE-SORTED USAGEFIL FOR   **
      **   THE CORP CODE RANGE SELECTED, AND GET THE OTHER INFO   **
      **   NEEDED BY DIRECTED GETS.  FOR EXAMPLE, IF THE RANGE    **
      **   SELECTED IS 2500000 TO 2599999, WE GO DIRECTLY TO      **
      **   2500000 AND PROCESS THROUGH 2599999.                   **
      **************************************************************
      *
      *    MOVE R10-CORP-CODE-1 TO STARTING-POINT-1-7.
      *    MOVE R10-CORP-CODE-2 TO ENDING-POINT-1-7.
      *
      *    CALL "CKSTART" USING FILETABLE KSAM-STATUS
      *      RELATIONAL-OPERATOR STARTING-POINT KEY-LOC
      *      KEY-LENGTH.
      *    MOVE STARTING-POINT TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "START ERR MSTORERM CKSTART" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
      *
      *52-CKREAD-LOOP.
      *    CALL "CKREAD" USING FILETABLE KSAM-STATUS USAGE-REC
      *      RECSIZE.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS-1 = "1"
      *        GO TO 5-IC-X
      *    ELSE
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "CKREAD ERR 52-CL" TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *    IF CORP-CODE GREATER THAN ENDING-POINT
      *        GO TO 5-IC-X.
      *
      *    MOVE CORP-CODE TO CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
      *    READ USAGEFIL-I INTO USAGE-REC
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "CKREADBYKEY ERR 63-MF" TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *    MOVE CORP-CODE TO CODE-ARG.
      *    CALL "DBFIND" USING BASE, DSET-DDESC, MODE1, STATUS-AREA,
      *            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "DBFIND ERR DDESC 63-GD" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG                 TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
      *            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
      *    IF COND-WORD = 15
      *        MOVE "*NO DESCRIPTION ON FILE*" TO SORT-DESC
      *    ELSE
      *    IF COND-WORD = 0
      *        MOVE DESC-DATA TO SORT-DESC
      *    ELSE
      *        MOVE "DBGET ERR DDESC 6-GD" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG               TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *53-MOVE-FIELDS.
      *    MOVE STR-CLASS       TO  SORT-CLASS.
      *    MOVE CORP-CODE   TO  SORT-CODE.
      *    MOVE STR-UM          TO  SORT-UM.
      *    MOVE STR-ONHAND      TO  SORT-ONHAND.
      *    MOVE STR-LOC (1)     TO  SORT-PRIM-LOC.
      *    MOVE STR-MTH-FCST    TO  SORT-MTH-FCST.
      *
      *    MOVE 0 TO SUB.
      *53-MOVE-FIELDS-LOOP.
      *    ADD 1 TO SUB.
      *    IF SUB > 14
      *        GO TO 53-MF-CONT.
      *    MOVE K-MTH-USAGE (SUB) TO SORT-USAGE (SUB).
      *    GO TO 53-MOVE-FIELDS-LOOP.
      *53-MF-CONT.
      *    MOVE 0                TO SUB.
      *    MOVE 0 TO YEAR-TO-DATE.
      *531-CALCULATE-YTD-USAGE.
      *    ADD 1 TO SUB.
      *    IF SUB > 12
      *        GO TO 531-CYU-CONT.
      *    ADD K-MTH-USAGE (SUB) TO YEAR-TO-DATE.
      *    GO TO 531-CALCULATE-YTD-USAGE.
      *531-CYU-CONT.
      *    MOVE YEAR-TO-DATE                TO SORT-YTD-USAGE.
      *
      *    RELEASE SORT-RCD.
      *    ADD 1                            TO CODES-RELEASED.
      *
      *    GO TO 52-CKREAD-LOOP.
      *
      *5-IC-X.
      *    EXIT.

       7-INPUT-RECORDS SECTION.

       COPY MTLSINPT IN COPYLIB.

      *6-INPUT-CODES-PARA.
      *    MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "START MSTORERM ERROR 6-IC" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
      *
      *61-INPUT-LOOP.
      *
      *** SERIAL GET THRU MSTORERM FOR CODES
      *
      *    CALL "DBGET" USING BASE, DSET-MSTORERM, MODE2, STATUS-AREA,
      *            ALL-ITEM-LIST, BUF-MSTORERM, CODE-ARG.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS-1 = "1"
      *        GO TO 6-IC-X
      *    ELSE
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "READ NEXT ERR MSTORERM 61-IL" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
      *
      *62-DOES-CODE-QUALIFY.
      *
      **************************************************************
      **   IF THE MATERIAL OPTION IS CHOSEN, THE USER MAY LIMIT THE*
      **   REPORT TO A RANGE OF CORP CODES (2 IN MAT OPTION) OR   **
      **   A RANGE OF ACCOUNTING CLASSES (3 IN MAT OPTION).       **
      **   THIS INPUT PROCEDURE SHOULD NOT BE USED IF MATERIAL    **
      **   OPTION 2 (SELECT A RANGE OF CORP CODES) IS SELECTED.   **
      **************************************************************
      *
      *    IF CORP-CODE = "NON-STR "
      *        GO TO 61-INPUT-LOOP.
      *
      **************************************************************
      **   IF THE STOCK-OUT-OPTION AND ACTIVITY-OPTION FOR MOVEMENT*
      **   IN PAST YEAR WAS CHOOSEN, ONLY THOSE CODES             **
      **   WITH AN ONHAND OF ZERO, A POSITIVE REORDER POINT AND   **
      **   MOVEMENT IN THE PAST YEAR WILL BE REPORTED ON.         **
      **************************************************************
      *    IF R10-STOCK-OUT-OPTION = "X"
      *----------  DETERMINE TOTAL CODES IN PLANT
      *        IF R10-ACTIVITY-OPTION = "X"
      *            IF STR-REORDER > 0 AND
      *                   STR-LAST-IDATE-CN > YEAR-AGO-DATE-CN
      *                ADD 1 TO CODES-STR-TOTAL
      *                IF STR-ONHAND = 0
      *                    NEXT SENTENCE
      *                ELSE
      *                    GO TO 61-INPUT-LOOP
      *            ELSE
      *                GO TO 61-INPUT-LOOP
      *        ELSE
      *            IF STR-REORDER > 0
      *                ADD 1 TO CODES-STR-TOTAL
      *                IF STR-ONHAND = 0
      *                    NEXT SENTENCE
      *                ELSE
      *                    GO TO 61-INPUT-LOOP
      *            ELSE
      *                GO TO 61-INPUT-LOOP.
      *
      *    IF R10-MATERIAL-OPTION = "2"
      *      MOVE "WRONG INPUT PROC 6-I-C" TO BU-DISPLAY-MSG
      *      MOVE SPACES                   TO BU-DISPLAY-FLD (1)
      *      GO TO 2-BLOWUP
      *    ELSE IF R10-MATERIAL-OPTION = "3"
      *        IF STR-CLASS < R10-ACCT-CLASS-1 OR > R10-ACCT-CLASS-2
      *          GO TO 61-INPUT-LOOP
      *        ELSE
      *          NEXT SENTENCE
      *    ELSE IF R10-MATERIAL-OPTION = "4"
      *        IF STR-SARA-REPORTABLE NOT = "X"
      *          GO TO 61-INPUT-LOOP
      *        ELSE
      *          NEXT SENTENCE
      *    ELSE
      *        NEXT SENTENCE.
      *
      *    MOVE CORP-CODE      TO  CODE-ARG.
      *    CALL "DBFIND" USING BASE, DSET-DDESC, MODE1, STATUS-AREA,
      *            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "DBFIND ERR DDESC 63-GD" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG                 TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
      *            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
      *    IF COND-WORD = 15
      *        MOVE "*NO DESCRIPTION ON FILE*" TO SORT-DESC
      *    ELSE
      *    IF COND-WORD = 0
      *        MOVE DESC-DATA TO SORT-DESC
      *    ELSE
      *        MOVE "DBGET ERR DDESC 6-GD" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG               TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *63-MOVE-FIELDS.
      *    MOVE STR-CLASS       TO  SORT-CLASS.
      *    MOVE CORP-CODE   TO  SORT-CODE.
      *    MOVE STR-UM          TO  SORT-UM.
      *    MOVE STR-ONHAND      TO  SORT-ONHAND.
      *    MOVE STR-LOC (1)     TO  SORT-PRIM-LOC.
      *    MOVE STR-MTH-FCST    TO  SORT-MTH-FCST.
      *
      *    MOVE CORP-CODE TO CODE-ARG.
      *    CALL "CKREADBYKEY" USING FILETABLE KSAM-STATUS USAGE-REC
      *        KEY-VALUE KEY-LOC RECSIZE.
      *    MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
      *    READ USAGEFIL-I INTO USAGE-REC
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "CKREADBYKEY ERR 63-MF" TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *    MOVE 0 TO SUB.
      *63-MOVE-FIELDS-LOOP.
      *    ADD 1 TO SUB.
      *    IF SUB > 14
      *        GO TO 63-MF-CONT.
      *    MOVE K-MTH-USAGE (SUB) TO SORT-USAGE (SUB).
      *    GO TO 63-MOVE-FIELDS-LOOP.
      *63-MF-CONT.
      *    MOVE 0                TO SUB.
      *    MOVE 0                TO YEAR-TO-DATE.
      *631-CALCULATE-YTD-USAGE.
      *    ADD 1 TO SUB.
      *    IF SUB > 12
      *        GO TO 631-CYU-CONT.
      *    ADD K-MTH-USAGE (SUB) TO YEAR-TO-DATE.
      *    GO TO 631-CALCULATE-YTD-USAGE.
      *631-CYU-CONT.
      *    MOVE YEAR-TO-DATE                TO SORT-YTD-USAGE.
      *
      *    RELEASE SORT-RCD.
      *    ADD 1                            TO CODES-RELEASED.
      *
      *    GO TO 61-INPUT-LOOP.
      *
      *6-IC-X.
      *    EXIT.
       7-IR-EXIT.
           EXIT.

      *******************************************
      *                                         *
      *    O U T P U T   P R O C E D U R E      *
      *                                         *
      *******************************************

       8-WRITE-RECORDS SECTION.
       8-WRITE-RPT.
           MOVE HD-SPOOLER-NUMBER TO SPOOL-PRT.
           MOVE HD-NO-OF-COPIES TO SPOOL-COPIES.
      ***********************************************************
      **   IF PRINTING ON A CHARACTER PRINTER (HD-PAPER-FLAG   **
      **   NOT = "X"), WE USE COMPRESSED PRINT TO FIT 132      **
      **   CHARACTERS ON 8.5 IN WIDE PAPER.  ALSO, IF CP, WE   **
      **   CHANGE THE TEXT LENGTH TO 61 LINES.                 **
      ***********************************************************

           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               DISPLAY "COMPRESS PRINT EVOKED"
               WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.

           IF CODES-RELEASED = 0
               ADD 1 TO PAGE-CTR
               MOVE PAGE-CTR TO PRT-PAGE
               WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEWPAGE
               WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE
               PERFORM 999-NO-CODES THRU 999-NC-X
               GO TO 72-EXIT-PARA.


           MOVE 15 TO CDESC-LINES-TO-GET.
           PERFORM 81-RETURN-RCD.
           PERFORM 9-MOVE-CONTROL-BREAK.
           PERFORM 82-PAGE-HDR.
           MOVE SRT-CLASS TO SAVE-CLASS.

       81-REPORT-LOOP.

      *    IF R10-SORT-OPTION = "2"
      *        IF SORT-CLASS NOT = SAVE-CLASS
      *            MOVE 1 TO LINE-CTR
      *            MOVE SORT-CLASS TO SAVE-CLASS
      *            PERFORM 82-PAGE-HDR.

           MOVE SRT-CORP-CODE     TO PRT-CODE.
           MOVE SRT-UM            TO PRT-UM.
           MOVE SRT-ONHAND        TO PRT-ONHND.
           MOVE SRT-MTH-FCST      TO PRT-AVG-ISS.
           MOVE SRT-PRIM-LOC      TO PRT-LOC.
           MOVE SRT-KEYWD-MOD     TO PRT-DESC.

           ADD SRT-ONHAND         TO TOTAL-ONHAND.

           MOVE SRT-CORP-CODE TO CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
           READ USAGEFIL-I INTO USAGE-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "CKREADBYKEY ERR 81-RL" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE 0 TO SUB.
       83-MOVE-FIELDS-LOOP.
           ADD 1 TO SUB.
           IF SUB > 14
               GO TO 83-MF-CONT.
           MOVE K-MTH-USAGE (SUB) TO HOLD-USAGE (SUB).
           GO TO 83-MOVE-FIELDS-LOOP.
       83-MF-CONT.
           MOVE 0                TO SUB.
           MOVE 0                TO YEAR-TO-DATE.
       831-CALCULATE-YTD-USAGE.
           ADD 1 TO SUB.
           IF SUB > 12
               GO TO 831-CYU-CONT.
           ADD K-MTH-USAGE (SUB) TO YEAR-TO-DATE.
           GO TO 831-CALCULATE-YTD-USAGE.
       831-CYU-CONT.
           MOVE YEAR-TO-DATE                TO HOLD-YTD-USAGE.

           MOVE HOLD-USAGE (13)   TO PRT-MTD-USE.
           MOVE HOLD-YTD-USAGE    TO PRT-YTD-USE.
           ADD HOLD-USAGE (13)    TO TOTAL-MTD-USAGE.
           ADD HOLD-YTD-USAGE     TO TOTAL-YTD-USAGE.

           MOVE HOLD-USAGE (1)    TO PRT-JAN-USAGE.
           MOVE HOLD-USAGE (2)    TO PRT-FEB-USAGE.
           MOVE HOLD-USAGE (3)    TO PRT-MAR-USAGE.
           MOVE HOLD-USAGE (4)    TO PRT-APR-USAGE.
           MOVE HOLD-USAGE (5)    TO PRT-MAY-USAGE.
           MOVE HOLD-USAGE (6)    TO PRT-JUN-USAGE.
           MOVE HOLD-USAGE (7)    TO PRT-JUL-USAGE.
           MOVE HOLD-USAGE (8)    TO PRT-AUG-USAGE.
           MOVE HOLD-USAGE (9)    TO PRT-SEP-USAGE.
           MOVE HOLD-USAGE (10)   TO PRT-OCT-USAGE.
           MOVE HOLD-USAGE (11)   TO PRT-NOV-USAGE.
           MOVE HOLD-USAGE (12)   TO PRT-DEC-USAGE.
           MOVE HOLD-USAGE (13)   TO PRT-MTD-USE.
           MOVE HOLD-USAGE (14)   TO PRT-YEST-USE.
           MOVE SPACES            TO PRINT-LINE.

           IF LINE-CTR > TEXT-LENGTH
               MOVE 3 TO LINE-CTR
               PERFORM 82-PAGE-HDR.

           IF MTLS-DESC-OPT = "X"
               PERFORM 99-MULT-DESC THRU 994-MD-X
           ELSE
               WRITE PRINT-RCD FROM CODE-HEADER AFTER ADVANCING 2
               WRITE PRINT-RCD FROM DETAIL-1
                 AFTER ADVANCING 1
               ADD 3  TO LINE-CTR.

           WRITE PRINT-RCD FROM USAGE-HEADER AFTER ADVANCING 1.
           ADD 1 TO LINE-CTR.
           WRITE PRINT-RCD FROM DETAIL-2 AFTER ADVANCING 1.
           ADD 1 TO LINE-CTR.

      *---------- PRINT INV LEVELS IF REQUESTED.
           IF MTLS-CODE-OPT = "X"
               PERFORM 9-MOVE-LIMITS
               ADD 1 TO LINE-CTR
               WRITE PRINT-RCD FROM USAGE-LIMITS-LINE
                                             AFTER ADVANCING 1 LINE.

           PERFORM 81-RETURN-RCD.

      *--------- PRINT CONTROL BREAKS.
           IF MTLS-SORT-OPT NOT = "01" AND MTLS-SORT-OPT NOT = "  "
               IF FILE-IS-RETURNED NOT = "Y"
                   PERFORM 9-CHECK-CONTROL-BREAK
               END-IF
               IF FILE-IS-RETURNED = "Y" OR CNTL-BREAK-SW = "Y"
                   MOVE SPACES TO PRINT-RCD
                   WRITE PRINT-RCD           AFTER ADVANCING 1 LINE
                   PERFORM 9-PRINT-CONTROL-BREAK
                   WRITE PRINT-RCD FROM CONTROL-BREAK-LINE
                                             AFTER ADVANCING 1 LINE
                   PERFORM 9-MOVE-CONTROL-BREAK
      *----------------- DON'T ADVANCE PAGE BETWEEN KEYWD/MODIF BREAKS;
      *----------------- IT MAKES THE REPORT TOO LONG.
                   IF MTLS-SORT-OPT = "03"
                       MOVE SPACES TO PRINT-RCD
                       WRITE PRINT-RCD       AFTER ADVANCING 1 LINE
                       ADD 3 TO LINE-CTR
                   ELSE
                   IF FILE-IS-RETURNED = "N"
                       MOVE 4 TO LINE-CTR
                       PERFORM 82-PAGE-HDR.

           IF FILE-IS-RETURNED = "Y"
               GO TO 72-FINAL-PROCEDURE.

           GO TO 81-REPORT-LOOP.

       72-FINAL-PROCEDURE.
           MOVE TOTAL-ONHAND    TO PRT-TOTAL-ONHAND.
           MOVE TOTAL-MTD-USAGE TO PRT-TOTAL-MTD.
           MOVE TOTAL-YTD-USAGE TO PRT-TOTAL-YTD.

           MOVE CODE-CTR        TO PRT-TOTAL-CODES.
           MOVE CODES-STR-TOTAL TO PRT-CODES-STR-TOTAL.

      *    IF R10-STOCK-OUT-OPTION = "X"
      *        WRITE PRINT-RCD FROM TOTAL-LINE-2 AFTER ADVANCING
      *          NEWPAGE
      *        WRITE PRINT-RCD FROM TOTAL-LINE-3 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-4 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-5 AFTER ADVANCING 2
      *    ELSE
      *------- DON'T PRINT TOTAL LINE IF BIN LOC OR MANUF SORT BECAUSE
      *------- CODES COULD BE DUPLICATED.
           IF MTLS-SORT-OPT NOT = "06" AND MTLS-SORT-OPT NOT = "08"
             ADD 1 TO PAGE-CTR
             MOVE PAGE-CTR TO PRT-PAGE
             WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEWPAGE
             WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE
             WRITE PRINT-RCD FROM TOTAL-LINE-1 AFTER ADVANCING 2
             WRITE PRINT-RCD FROM TOTAL-LINE-2 AFTER ADVANCING 2
             WRITE PRINT-RCD FROM TOTAL-LINE-3 AFTER ADVANCING 2
             WRITE PRINT-RCD FROM TOTAL-LINE-4 AFTER ADVANCING 2.


      ***  IF CHAR. PRINTER, CHANGE BACK TO NORMAL PRINT AND NORMAL
      ***  TEXT LENGTH.

       72-EXIT-PARA.
           IF PAPER-IS-132-COLS
               NEXT SENTENCE
           ELSE
               WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.

           MOVE SPACES TO PRINT-RCD.
           WRITE PRINT-RCD AFTER ADVANCING NEWPAGE.

           MOVE HD-NO-OF-COPIES TO SPOOL-COPIES.

           GO TO 8-WR-X.

       81-RETURN-RCD.
           RETURN SORT-FILE
               AT END MOVE "Y" TO FILE-IS-RETURNED.
           IF FILE-IS-RETURNED NOT = "Y"
               ADD 1 TO CODE-CTR.

       82-PAGE-HDR.
           ADD 1 TO PAGE-CTR.
           MOVE PAGE-CTR TO PRT-PAGE.
      *    IF R10-SORT-OPTION = "2"
      *        MOVE "CLASS= "  TO CLASS-HD
      *        MOVE SORT-CLASS TO PRT-CLASS
      *    ELSE
      *        MOVE SPACES TO CLASS-HD PRT-CLASS.
      *    WRITE PRINT-RCD FROM HEADER-1 AFTER ADVANCING NEWPAGE.
      *    WRITE PRINT-RCD FROM HEADER-2 AFTER ADVANCING 1.
      *    WRITE PRINT-RCD FROM HEADER-3 AFTER ADVANCING 1.
           WRITE PRINT-RCD FROM HEADING-1 AFTER ADVANCING NEWPAGE.
           WRITE PRINT-RCD FROM HEADING-2 AFTER ADVANCING 1 LINE.
           IF MTLS-SORT-OPT > SPACES AND MTLS-SORT-OPT NOT = "01"
             MOVE CNTL-BREAK-HOLD-FIELD TO PRT-H2B-VALUE
             WRITE PRINT-RCD FROM HEADING-2B AFTER ADVANCING 1 LINE
             ADD   1      TO LINE-CTR.

       8-WR-X.
           EXIT.

      *9-CKREAD-REPORT SECTION.
      *    MOVE HD-SPOOLER-NUMBER TO SPOOL-PRT.
      *    MOVE HD-NO-OF-COPIES TO SPOOL-COPIES.
      ***********************************************************
      **   IF PRINTING ON A CHARACTER PRINTER (HD-PAPER-FLAG   **
      **   NOT = "X"), WE USE COMPRESSED PRINT TO FIT 132      **
      **   CHARACTERS ON 8.5 IN WIDE PAPER.  ALSO, IF CP, WE   **
      **   CHANGE THE TEXT LENGTH TO 61 LINES.                 **
      ***********************************************************
      *
      *    IF PAPER-IS-132-COLS
      *        NEXT SENTENCE
      *    ELSE
      *        DISPLAY "COMPRESS PRINT EVOKED"
      *        WRITE PRINT-RCD FROM COMPRESS-PRINT AFTER ADVANCING 0.
      *
      *
      *    PERFORM 82-PAGE-HDR.
      *
      **************************************************************
      **   IF MATERIAL OPTION IS "SELECT CORP CODE RANGE", WE CAN **
      **   SAVE TIME ON READS BY STARTING OUR READ WHERE THE      **
      **   RANGE BEGINS.                                          **
      **   NOTE THAT A RELATIONAL-OPERATOR OF 2 MEANS START AT    **
      **   KEY GREATER THAN OR EQUAL TO STARTING-POINT.           **
      **************************************************************
      *
      *    IF R10-MATERIAL-OPTION = "2"
      *        MOVE R10-CORP-CODE-1      TO STARTING-POINT-1-7
      *        MOVE R10-CORP-CODE-2      TO ENDING-POINT-1-7
      *    ELSE
      *        MOVE LOW-VALUES           TO STARTING-POINT-1-7
      *        MOVE HIGH-VALUES          TO ENDING-POINT-1-7.
      *
      *    CALL "CKSTART" USING FILETABLE KSAM-STATUS
      *      RELATIONAL-OPERATOR STARTING-POINT KEY-LOC
      *      KEY-LENGTH.
      *    MOVE STARTING-POINT TO CORPCDE OF MSTORERM-REC-I.
      *    START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "START ERR MSTORE 9-CR" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.
      *
      *91-CKREAD-LOOP.
      *    CALL "CKREAD" USING FILETABLE KSAM-STATUS USAGE-REC
      *      RECSIZE.
      *    READ MSTORERM-I NEXT INTO BUF-MSTORERM
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS-1 = "1"
      *        GO TO 94-FINAL-PROCEDURE
      *    ELSE
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "CKREAD ERR 91-CL" TO BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *92-DOES-CODE-QUALIFY.
      *
      **************************************************************
      **   IF SELECTING ON CORP CODE RANGE, AND IF CORP-CODE READ **
      **   IS GREATER THAN THE ENDING-POINT OF THAT RANGE, WE ARE **
      **   FINISHED.                                              **
      **************************************************************
      *
      *    IF R10-MATERIAL-OPTION = "2"
      *        IF CORP-CODE > ENDING-POINT
      *            GO TO 94-FINAL-PROCEDURE.
      *
      *    MOVE CORP-CODE        TO  CODE-ARG.
      *    CALL "DBGET" USING BASE DSET-MSTORERM MODE7 STATUS-AREA
      *      ALL-ITEM-LIST BUF-MSTORERM CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
      *    READ USAGEFIL-I INTO USAGE-REC
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF FILE-STATUS NOT = "00"
      *        GO TO 91-CKREAD-LOOP.
      *
      *    IF R10-MATERIAL-OPTION = "3"
      *        IF STR-CLASS < R10-ACCT-CLASS-1 OR > R10-ACCT-CLASS-2
      *            GO TO 91-CKREAD-LOOP
      *        ELSE
      *            NEXT SENTENCE.
      *
      *    IF R10-MATERIAL-OPTION = "4"
      *        IF STR-SARA-REPORTABLE NOT = "X"
      *            GO TO 91-CKREAD-LOOP
      *        ELSE
      *            NEXT SENTENCE.

      **************************************************************
      **   IF THE STOCK-OUT-OPTION AND THE ACTIVITY-OPTION        **
      **   IN PAST YEAR WAS CHOOSEN, ONLY THOSE CODES             **
      **   WITH AN ONHAND OF ZERO, A POSITIVE REORDER POINT AND   **
      **   MOVEMENT IN THE PAST YEAR WILL BE REPORTED ON.         **
      **************************************************************
      *    IF R10-STOCK-OUT-OPTION = "X"
      *----------- DETERMINE TOTAL CODES IN PLANT
      *        IF R10-ACTIVITY-OPTION = "X"
      *            IF STR-REORDER > 0 AND
      *                   STR-LAST-IDATE-CN > YEAR-AGO-DATE-CN
      *                ADD 1 TO CODES-STR-TOTAL
      *                IF STR-ONHAND = 0
      *                    NEXT SENTENCE
      *                ELSE
      *                    GO TO 91-CKREAD-LOOP
      *            ELSE
      *                GO TO 91-CKREAD-LOOP
      *        ELSE
      *----------- ACTIVITY IN PAST YEAR IS NOT REQUIREMENT FOR A STOCK
      *----------- OUT ITEM
      *            IF STR-REORDER > 0
      *                ADD 1 TO CODES-STR-TOTAL
      *                IF STR-ONHAND = 0
      *                    NEXT SENTENCE
      *                ELSE
      *                    GO TO 91-CKREAD-LOOP
      *            ELSE
      *                GO TO 91-CKREAD-LOOP.
      *
      *    ADD 1 TO CODE-CTR.
      *
      *    CALL "DBFIND" USING BASE, DSET-DDESC, MODE1, STATUS-AREA,
      *            CODE-SEARCH, CODE-ARG.
      *    MOVE CODE-ARG TO CORPCDE OF DDESC-REC-I.
      *    START DDESC-I KEY = CORPCDE OF DDESC-REC-I
      *        INVALID KEY MOVE 17 TO COND-WORD.
      *    IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
      *        MOVE "DBFIND ERR DDESC 92-DCQ" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG                 TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *    CALL "DBGET" USING BASE, DSET-DDESC, MODE5, STATUS-AREA,
      *            ALL-ITEM-LIST, BUF-DDESC, CODE-ARG.
      *    MOVE 0 TO COND-WORD.
      *    READ DDESC-I NEXT INTO BUF-DDESC
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            MOVE 15 TO COND-WORD
      *        ELSE
      *            MOVE 99 TO COND-WORD.
      *    IF CORPCDE OF DDESC-REC-I NOT = CODE-ARG
      *        MOVE 15 TO COND-WORD.
      *    IF COND-WORD = 15
      *        MOVE "*NO DESCRIPTION ON FILE*" TO PRT-DESC
      *    ELSE
      *    IF COND-WORD = 0
      *        MOVE DESC-DATA TO PRT-DESC
      *    ELSE
      *        MOVE "DBGET ERR DDESC 92-DCQ" TO BU-DISPLAY-MSG
      *        MOVE CODE-ARG               TO BU-DISPLAY-FLD (1)
      *        GO TO 2-BLOWUP.
      *
      *    MOVE STR-CLASS       TO  PRT-CLASS.
      *    MOVE CORP-CODE   TO  PRT-CODE.
      *    MOVE STR-UM          TO  PRT-UM.
      *    MOVE STR-ONHAND      TO  PRT-ONHND.
      *    MOVE STR-LOC (1)     TO  PRT-LOC.
      *    MOVE STR-MTH-FCST    TO  PRT-AVG-ISS.
      *
      *    MOVE K-MTH-USAGE (1)    TO PRT-JAN-USAGE.
      *    MOVE K-MTH-USAGE (2)    TO PRT-FEB-USAGE.
      *    MOVE K-MTH-USAGE (3)    TO PRT-MAR-USAGE.
      *    MOVE K-MTH-USAGE (4)    TO PRT-APR-USAGE.
      *    MOVE K-MTH-USAGE (5)    TO PRT-MAY-USAGE.
      *    MOVE K-MTH-USAGE (6)    TO PRT-JUN-USAGE.
      *    MOVE K-MTH-USAGE (7)    TO PRT-JUL-USAGE.
      *    MOVE K-MTH-USAGE (8)    TO PRT-AUG-USAGE.
      *    MOVE K-MTH-USAGE (9)    TO PRT-SEP-USAGE.
      *    MOVE K-MTH-USAGE (10)   TO PRT-OCT-USAGE.
      *    MOVE K-MTH-USAGE (11)   TO PRT-NOV-USAGE.
      *    MOVE K-MTH-USAGE (12)   TO PRT-DEC-USAGE.
      *    MOVE K-MTH-USAGE (13)   TO PRT-MTD-USE.
      *    MOVE K-MTH-USAGE (14)   TO PRT-YEST-USE.
      *
      *    MOVE 0 TO SUB.
      *    MOVE 0 TO YEAR-TO-DATE.
      *93-CALCULATE-YTD-USAGE.
      *    ADD 1 TO SUB.
      *    IF SUB > 12
      *        GO TO 93-CYU-CONT.
      *    ADD K-MTH-USAGE (SUB) TO YEAR-TO-DATE.
      *    GO TO 93-CALCULATE-YTD-USAGE.
      *93-CYU-CONT.
      *    MOVE YEAR-TO-DATE TO PRT-YTD-USE.
      *
      *    ADD STR-ONHAND           TO TOTAL-ONHAND.
      *    ADD K-MTH-USAGE (13)     TO TOTAL-MTD-USAGE.
      *    ADD YEAR-TO-DATE         TO TOTAL-YTD-USAGE.
      *
      *    IF LINE-CTR > TEXT-LENGTH
      *        MOVE 3 TO LINE-CTR
      *        PERFORM 82-PAGE-HDR.
      *
      *    IF R10-DESC-OPTION = "X"
      *         MOVE CORP-CODE TO SORT-CODE
      *         PERFORM 99-MULT-DESC  THRU  994-MD-X
      *    ELSE
      *        WRITE PRINT-RCD FROM CODE-HEADER AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1
      *        ADD 3 TO LINE-CTR.
      *
      *    WRITE PRINT-RCD FROM USAGE-HEADER AFTER ADVANCING 1.
      *    ADD 1 TO LINE-CTR.
      *
      *    WRITE PRINT-RCD FROM DETAIL-2 AFTER ADVANCING 1.
      *    ADD 1 TO LINE-CTR.
      *
      *    GO TO 91-CKREAD-LOOP.
      *
      *94-FINAL-PROCEDURE.
      *    IF CODE-CTR = 0
      *        PERFORM 999-NO-CODES THRU 999-NC-X.
      *
      *    MOVE TOTAL-ONHAND    TO PRT-TOTAL-ONHAND.
      *    MOVE TOTAL-MTD-USAGE TO PRT-TOTAL-MTD.
      *    MOVE TOTAL-YTD-USAGE TO PRT-TOTAL-YTD.
      *    MOVE CODE-CTR        TO PRT-TOTAL-CODES.
      *    MOVE CODES-STR-TOTAL TO PRT-CODES-STR-TOTAL.
      *    IF R10-STOCK-OUT-OPTION = "X"
      *        WRITE PRINT-RCD FROM TOTAL-LINE-2 AFTER ADVANCING
      *          NEWPAGE
      *        WRITE PRINT-RCD FROM TOTAL-LINE-3 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-4 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-5 AFTER ADVANCING 2
      *    ELSE
      *        WRITE PRINT-RCD FROM TOTAL-LINE-1 AFTER ADVANCING
      *          NEWPAGE
      *        WRITE PRINT-RCD FROM TOTAL-LINE-2 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-3 AFTER ADVANCING 2
      *        WRITE PRINT-RCD FROM TOTAL-LINE-4 AFTER ADVANCING 2.
      *
      *
      *    IF PAPER-IS-132-COLS
      *        NEXT SENTENCE
      *    ELSE
      *        WRITE PRINT-RCD FROM NORMAL-PRINT AFTER ADVANCING 0.
      *
      *    MOVE SPACES TO PRINT-RCD.
      *    WRITE PRINT-RCD AFTER ADVANCING NEWPAGE.
      *
      *    MOVE HD-NO-OF-COPIES TO SPOOL-COPIES.
      *
      *9-CR-X.
      *    EXIT.

       9-UTILITY SECTION.
       99-MULT-DESC.
           MOVE 0 TO SUB.
           MOVE SRT-CORP-CODE TO  CODE-ARG.
           CALL "CDESC" USING  RET-CODE,
                               BASE,
                               STATUS-AREA,
                               BU-DISPLAY-MSG,
                               CODE-ARG,
                               CDESC-DATA.

           IF BU-DISPLAY-MSG-1  NOT = SPACES
               MOVE CODE-ARG    TO  BU-DISPLAY-FLD (2)
               GO TO 2-BLOWUP.



      **************************************************************
      **   WHEN PRINTING MULTIPLE LINES OF DESCRIPTION, THIS PGM  **
      **   AVOIDS SPLITTING THE PRINTOUT FOR A CODE OVER TWO      **
      **   PAGES.  THEREFORE WE FIND UP TO 15 LINES OF DESCRIP    **
      **   AND PUT IT IN A SAVE TABLE.  THEN WE MAKE SURE THERE IS**
      **   ENOUGH ROOM LEFT ON THAT PAGE TO PRINT THE WHOLE THING,**
      **   ELSE WE DO A PAGE HEADER.                              **
      **************************************************************

       992-PRINT-DESC.
           MOVE 1   TO SUB.
           IF CDESC-LINES-GOT > 0
               MOVE CDESC (SUB)  TO PRT-DESC
           ELSE
               MOVE "* NO DESCRIPTION ON FILE *" TO PRT-DESC.

           SUBTRACT LINE-CTR FROM TEXT-LENGTH
               GIVING TEXT-LEFT.
           ADD CDESC-LINES-GOT, 3 GIVING TEXT-TO-PRINT.
           IF TEXT-TO-PRINT > TEXT-LEFT
               MOVE 3 TO LINE-CTR
               PERFORM 82-PAGE-HDR.

           WRITE PRINT-RCD FROM CODE-HEADER AFTER ADVANCING 2.
           WRITE PRINT-RCD FROM DETAIL-1 AFTER ADVANCING 1.
           ADD 3  TO  LINE-CTR.

       993-PRINT-DESC-LOOP.
           ADD 1 TO SUB.
           IF SUB > CDESC-LINES-GOT
               GO TO 994-MD-X.

           MOVE CDESC (SUB)  TO  PRT-DESC-2.
           WRITE PRINT-RCD FROM DESC-LINE AFTER ADVANCING 1.
           ADD 1  TO  LINE-CTR.

           GO TO 993-PRINT-DESC-LOOP.

       994-MD-X.
           EXIT.

       COPY OVRPFCALL IN COPYLIB.

       999-NO-CODES.
           MOVE
           "*** NO CODES QUALIFIED FOR MATERIAL SELECT OPTIONS ***"
           TO PRINT-RCD
           WRITE PRINT-RCD AFTER ADVANCING 2.

       999-NC-X.
           EXIT.

       999-NO-STOCKOUTS.
           MOVE
           "*** NO STOCKOUTS FOUND ***                            "
           TO PRINT-RCD
           WRITE PRINT-RCD AFTER ADVANCING 2.

       999-NS-X.
           EXIT.

       COPY MTLSUTIL  IN COPYLIB.

      *------- DUMMY PARAGRAPH; NOT USED IN THIS PROGRAM.
       9-COMPUTE-USAGE.
           EXIT.
