000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TRQREPRT.
000400 AUTHOR. KURT MOVSESIAN/JIM COFFMAN (MAINTAINER).
000600
000700**************************************************************
000800*                                                            *
000900*D  T R Q R E P R T    THIS PROGRAM ALLOWS PURCHASING TO     *
001000*D   TO REPRINT REQUISITIONS RELEASED BY MATERIALS CONTROL   *
001100*D   NOTE THE REQ. MUST FIRST BE RELEASED BEFORE IS CAN      *
001200*D   BE REPRINTED                                            *
001300*                                                            *
001400**************************************************************
      *C
      *C  09/11/1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
001500
010000
010100
010200 ENVIRONMENT DIVISION.
010300 CONFIGURATION SECTION.
010400 SOURCE-COMPUTER.  HP-3000.
010500 OBJECT-COMPUTER.  HP-3000.

       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
010600
010700 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZRQREPRT-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MREQ-I
                  ASSIGN TO DATABASE-MCFLCS2001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
010800
010900 DATA DIVISION.
026400 FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZRQREPRT.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  MREQ-I
           LABEL RECORDS ARE STANDARD.
       01  MREQ-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS2001.

011100
011200 WORKING-STORAGE SECTION.
011300 77  SAVE-REQ-PRT                 PIC 9(2)  COMP-4 VALUE ZEROS.
011400 77  SAVE-LOCAL-PRT               PIC 9(2)  COMP-4 VALUE ZEROS.
011600
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

011700**********************
011800*                    *
011900*  S W I T C H E S   *
012000*                    *
012100**********************
012500
012600 01  COMPANY-SAVE.
012700     05  COMPANY-SAVE-1-2         PIC XX      VALUE SPACES.
012800     05  FILLER                   PIC X       VALUE SPACES.
013000
013100**********************************************
013200*                                            *
013300*   JCW PARAMETERS                           *
013400*                                            *
013500**********************************************
013600
013700 01  JCW-PARMS.
013800     05  JCW-NAME                 PIC X(12)  VALUE SPACES.
013900     05  JCW-VALUE                PIC S9(4)  COMP  VALUE ZEROS.
014000     05  JCW-STATUS               PIC S9(4)  COMP  VALUE ZEROS.
014100
014200
014300 COPY VCOMAREA IN COPYLIB.
014400
015700 01  MESSAGE-BUFFER.
015800     05  MSG-TEXT                 PIC X(64)    VALUE SPACE.
015900     05  MSG-FLD                  PIC X(12)    VALUE SPACE.
016000     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.
016100
016600 01  FIELD-NUMBER                 PIC S9(4)    VALUE 1     COMP.
016700
016800 01  WHICH-LABELS                 PIC S9(4)    VALUE 1     COMP.
016900
017000 01  LABEL-NUMBER                 PIC S9(4)    VALUE ZEROS COMP.
017100
017200 01  LABEL-VALUE                  PIC X(16)    VALUE SPACES.
017300
017400 01  AKRON-PRINT-LABEL.
017500     05  FILLER  PIC X(16)  VALUE " LOCAL   PRINT  ".
018600
018700**************************************************************
018800**************************************************************
018900**                                                          **
019000**             TERMINAL I/O DATA AREA                       **
019100**                                                          **
019200**************************************************************
019300**************************************************************
019400
019500 01  SCREEN-1.
019600     05  DISP-COMPANY             PIC X(3)  VALUE SPACES.
019700     05  DE-REQ-NUM               PIC X(12) VALUE SPACES.
           05  DE1-COMMAND-LINE         PIC X(79) VALUE SPACES.
           05  DE1-MESSAGE-LINE         PIC X(79) VALUE SPACES.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.
019800
019900 COPY SREQPRNT IN COPYLIB.
020000
020100
020200**************************************************************
020300**************************************************************
020400**                                                          **
020500**                DATABASE I/O BUFFER AREA                  **
020600**                                                          **
020700**************************************************************
020800**************************************************************
020900
021000 COPY MREQ IN COPYLIB.
021100
021200 COPY MPLTINFO IN COPYLIB.
021300
021400*********************
021500*                   *
021600*   DATA SET NAMES  *
021700*                   *
021800*********************
021900
022000 01  DSET-NAMES.
022100     05  DSET-NAME                PIC X(16)  VALUE SPACES.
022200     05  DSET-MREQ                PIC X(16)  VALUE "MREQ;".
022300     05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
022400
022500 COPY DATAB IN COPYLIB.
022600
023000 01 ARG-VALUES.
023100     05  REQ-ARG                  PIC X(12) VALUE SPACES.
023200     05  PLT-ARG                  PIC X(4)  VALUE SPACES.
023300
023400 01  BASE-MMISA                   PIC X(24) VALUE SPACES.
023500
023600 COPY TBLOWUP IN COPYLIB.
023700
023800 COPY LANGUAGE IN COPYLIB.
023900
024000 COPY ESCNAM2 IN COPYLIB.
024100
024200 PROCEDURE DIVISION.
024300
024400 PROC-DIV SECTION 01.
024500
024600 BEGIN-HERE.
024700     PERFORM 1-HSK THRU 1-H-X.
024800
024900     PERFORM 6-MAIN THRU 6-M-X.
025000
025100     PERFORM 2-EOJ  THRU 2-EOJ-X.
025200
025300     GOBACK.
025400
025500 1-HSK.
           OPEN INPUT MPLTINFO-I, MREQ-I.
           OPEN I-O DISPLAY-FILE.

025600     CALL "TESCSEQ" USING ESC-NAME.
029700
029800     MOVE SPACES                  TO  SREQPRNT-PARMS.
030000
030100**************************************************
030200*                                                *
030300*   GET CO. AND PRIME FROM MPLTINFO              *
030400*   USING 'P 01' AS THE ARGUMENT                 *
030500*                                                *
030600**************************************************
030700
030800     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
031200         MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
031300         MOVE PLT-ARG            TO BU-DISPLAY-FLD (1)
031400         GO TO 2-BLOWUP.
031500     MOVE MPLTINFO-COMPANY        TO  COMPANY-SAVE,
031600                                      REQ-COMPANY-SAVE.
031700
031800**************************************************
031900*                                                *
032000*   GET REQUISITION PRINTER NUMBER FROM          *
032100*   MPLTINFO USING 'POPT' AS THE ARGUMENT        *
032200*                                                *
032300**************************************************
032400
032500     MOVE "POPT"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
032900         MOVE "DBGET MPLTINFO 1-HSK POPT"  TO  BU-DISPLAY-MSG
033000         MOVE PLT-ARG            TO BU-DISPLAY-FLD (1)
033100         GO TO 2-BLOWUP
033200     ELSE
033300         MOVE MPLTINFO-REQ-PRT-NO  TO  SAVE-REQ-PRT.
033400
033500
033600*****************************************************
033700*                                                   *
033800*    GET THE JCW  'PRT0001'                         *
033900*                                                   *
034000*****************************************************
034100
034200*    MOVE "PRT0001;"      TO  JCW-NAME.
034300*    CALL INTRINSIC "FINDJCW" USING JCW-NAME, JCW-VALUE,
034400*        JCW-STATUS.
034500*    IF JCW-STATUS  NOT = 0
034600*        IF JCW-STATUS = 3
034700*            MOVE SAVE-REQ-PRT  TO  SAVE-LOCAL-PRT
034800*        ELSE
034900*            MOVE "FINDJCW ERROR 1-HSK" TO BU-DISPLAY-MSG
035000*            MOVE JCW-STATUS       TO BU-DISPLAY-FLD9 (1)
035100*            GO TO 2-BLOWUP
035200*    ELSE
035300*        MOVE JCW-VALUE        TO  SAVE-LOCAL-PRT.

           MOVE ZEROS                TO SAVE-LOCAL-PRT.
035400
035500 1-H-X.
035600     EXIT.
035700
035800 2-EOJ.
           CLOSE MPLTINFO-I, MREQ-I, DISPLAY-FILE.
038700
038800 2-EOJ-X.
038900      EXIT.
039000
039100******************************************************
039200**                                                  **
039300**   BLOWUP ROUTINE                                 **
039400**                                                  **
039500******************************************************
039600
039700 2-BLOWUP.
039800     MOVE "TRQREPRT"  TO  BU-PGM-NAME.
039900     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
040000         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
040100                 BU-DISPLAY-FLDS.
040200
040300 2-BLOWUP-X.
040400     EXIT.
043400
043500 4-PGM-ERROR.
           MOVE B"1" TO IND(FIELD-NUMBER), IND(99).
           MOVE MESSAGE-BUFFER  TO DE1-MESSAGE-LINE.
044300
044400 4-PGM-ERROR-X.
044500     EXIT.
046500
046600*4-SETKEYLABEL.
046700*    CALL "VSETKEYLABEL" USING VIEW-COMAREA,
046800*                              WHICH-LABELS,
046900*                              LABEL-NUMBER,
047000*                              LABEL-VALUE.
047100*    IF VIEW-STATUS NOT = 0
047200*        MOVE "SETKEYLABEL * 4-S" TO BU-DISPLAY-MSG
047300*        GO TO 2-BLOWUP.
047400*
047500*4-SETKEYLABEL-X.
047600*    EXIT.
047700
047800
047900**************************************************
048000*                                                *
048100*     6 - M A I N                                *
048200*                                                *
048300**************************************************
048400
048500 6-MAIN.
048600     MOVE "RQREPRT1"  TO  VIEW-NFNAME.
050100     MOVE SPACES        TO  SCREEN-1.
050200     MOVE COMPANY-SAVE  TO  DISP-COMPANY.
051400
051500 6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
053300
053400     IF VIEW-LASTKEY = 3
053500         GO TO 6-M-X
053600     ELSE
055000     IF VIEW-LASTKEY = 6
055100         IF COMPANY-SAVE-1-2 = "11"
                   NEXT SENTENCE
055500         ELSE
055600             MOVE 7  TO  VIEW-LASTKEY.
055700
055800     IF VIEW-LASTKEY = 1 OR
055900        VIEW-LASTKEY = 2 OR
056000        VIEW-LASTKEY = 4 OR
056100        VIEW-LASTKEY = 5 OR
056200        VIEW-LASTKEY = 7 OR
056200        VIEW-LASTKEY = 8
056400*        *** INVALID FUNCTION KEY ENTERED ***
056500         MOVE   9 TO LANG-SETNUM
056600         MOVE  10 TO LANG-MSGNUM
056700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
056800         MOVE 2  TO  FIELD-NUMBER
056900         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
057000         GO TO 6-SHOWFORM-SCREEN-1.
059100
      *------ FIELD EDITS

           IF DE-REQ-NUM = SPACES
      *         REQUISITION NUMBER IS REQUIRED
               MOVE 66222 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 2  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 6-SHOWFORM-SCREEN-1.
067100
059200**************************************************
059300*                                                *
059400*   EDIT REQUISITION NUMBER                      *
059500*                                                *
059600**************************************************
059700
059800 6-EDIT-REQ-NO.
059900     MOVE DE-REQ-NUM   TO  REQ-ARG.
           MOVE REQ-ARG TO REQNO OF MREQ-REC-I.
           READ MREQ-I INTO BUF-MREQ
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
060400*            *** REQUISITION DOES NOT EXIST ***
060500             MOVE  18 TO LANG-SETNUM
060600             MOVE   5 TO LANG-MSGNUM
060700             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
060800             MOVE DE-REQ-NUM  TO  MSG-FLD
060900             MOVE 2   TO  FIELD-NUMBER
061000             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
061100             GO TO 6-SHOWFORM-SCREEN-1
061200         ELSE
061300             MOVE "DBGET MREQ 6-EDIT-REQ-NO" TO BU-DISPLAY-MSG
061400             MOVE REQ-ARG  TO  BU-DISPLAY-FLD (1)
061500             GO TO 2-BLOWUP.
061600
061700**************************************************
061800*                                                *
061900*  MAKE SURE REQ. HAS BEEN RELEASED BY MATCONT   *
062000*                                                *
062100**************************************************
062200
062300     IF REQ-MATCONT-RELEASE  =  SPACES
062400*        *** REQ. NOT RELEASED BY MATERIALS CONTROL; CANNOT PRINT ***
062500         MOVE  18 TO LANG-SETNUM
062600         MOVE  63 TO LANG-MSGNUM
062700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
062800         MOVE 2   TO  FIELD-NUMBER
062900         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR
063000         GO TO 6-SHOWFORM-SCREEN-1.
063100
063200     MOVE REQ-ARG              TO  REQ-NUMBER.
063300     MOVE "R"                  TO  REQ-REPRINT-INDIC.
063400     MOVE SPACES               TO  REQ-FREE-VERBAGE.
063500     IF VIEW-LASTKEY = 6
063600         MOVE SAVE-LOCAL-PRT   TO  REQ-SPOOL-PRT
063700     ELSE
063800         MOVE SAVE-REQ-PRT     TO  REQ-SPOOL-PRT.
063900
064000
064100*    ***  PROCESSING REQUISITION REPRINT  ***
064200     MOVE  16 TO LANG-SETNUM.
064300     MOVE  72 TO LANG-MSGNUM.
064400     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE1-COMMAND-LINE.
           MOVE B"1" TO IND(98).
           MOVE SCREEN-1 TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-AUTO-READ-SCREEN.
065900
066000     CALL "SREQPRNT" USING BASE,
066100                           BASE-MMISA,
066200                           SREQPRNT-PARMS,
066300                           ESC-NAME,
066400                           LANGUAGE-PARMS,
066500                           STATUS-AREA,
066600                           BU-DISPLAY-MSG,
066700                           BU-DISPLAY-FLDS,
066800                           VIEW-COMAREA.
066900     IF BU-DISPLAY-MSG-1  NOT = SPACES
067000         GO TO 2-BLOWUP.
067200
050100     MOVE SPACES        TO  SCREEN-1.
050200     MOVE COMPANY-SAVE  TO  DISP-COMPANY.
067300*    *** ENTER NEXT REQUISITION FOR REPRINT OR 'f8' TO END ***
067400     MOVE   5 TO LANG-SETNUM.
067500     MOVE  35 TO LANG-MSGNUM.
067600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO DE1-COMMAND-LINE.
           MOVE B"1" TO IND(98).
068100     GO TO 6-SHOWFORM-SCREEN-1.
068200
068300 6-M-X.
068400     EXIT.
068500
       COPY DISPCALL IN COPYLIB.

       998-AUTO-READ-SCREEN.
           READ  DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC ARE SRF-INDICATORS
                   NO DATA MOVE DISPLAY-STATUS TO DISPLAY-STATUS.
           MOVE ALL B"0" TO SRF-INDICATORS.

068600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
070200 999-CATREAD-EXIT.
070300     EXIT.
