001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TRSCREEN.
001300 AUTHOR.              C HILLES.
001400 DATE-WRITTEN.        02/12/86.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS.
001900*D   STAND-ALONE EXECUTIVE PROGRAM FOR REPORT OPTION SCREEN PROGRAM
      *C
      *C   01MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
002300 ENVIRONMENT DIVISION.
002400 CONFIGURATION SECTION.
002500 SOURCE-COMPUTER.  HP-3000.
002600 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES.  LOCAL-DATA IS LOCAL-DATA-AREA.
002700
002800 DATA DIVISION.
002900 WORKING-STORAGE SECTION.
003000
003100**************************************************************
003200**                                                          **
003300**     C O M M U N I C A T I O N S   A R E A S              **
003400**                                                          **
003500**************************************************************
003600
       77  MCXCBLERR-SCOPE               PIC X(1)  VALUE "C".

003700 COPY TBLOWUP IN COPYLIB.
       COPY JCWAREA IN COPYLIB.
003900
       01  JCW-CONVERT                   PIC 9(3).
003920 01  JCW-VALUE                     PIC S9(4) COMP-4 VALUE 0.
003940
004000**************************************************************
004100**                                                          **
004200**                  V I E W   W O R K                       **
004300**                                                          **
004400**************************************************************
       COPY VCOMAREA IN COPYLIB.
004500
009200 01  FORMFILE.
009300     05  FORM-FNAME                PIC X(8)  VALUE "FRSCREEN".
009400     05  FILLER                    PIC X     VALUE ".".
009500     05  FORM-GNAME.
009600         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
009700         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
009800     05  FILLER                    PIC X(19) VALUE SPACES.
009900
011100**************************************************************
011200**                                                          **
011300**            D A T A B A S E   W O R K                     **
011400**                                                          **
011500**************************************************************
011600
011700 01  BASE                       PIC X(24) VALUE "  STORES;".
       COPY DBSTAT IN COPYLIB.
013800
014900**************************************
015000*                                    *
015100*    NATIVE LANGUAGE SUPPORT AREA    *
015200*                                    *
015300**************************************
015400
015500 COPY LANGUAGE IN COPYLIB.
015600
015800 PROCEDURE DIVISION.
015900 1-HOUSEKEEP SECTION.
       1-HSK.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

      *------ GET THE JCW WHICH MUST BE SET FOR THE REPORT DESIRED.
           ACCEPT MC-LOCAL-DATA-AREA FROM LOCAL-DATA-AREA.
           IF JCW-RPT-278 NOT NUMERIC OR JCW-RPT-278 = "000"
               MOVE "FINDJCW ERROR OF REPORT NUMBER" TO BU-DISPLAY-MSG
               PERFORM 2-BLOWUP.

           MOVE JCW-RPT-278 TO JCW-CONVERT.
           MOVE JCW-CONVERT TO JCW-VALUE.
016000
019280     CALL "SRSCRNS" USING BASE, VIEW-COMAREA, LANGUAGE-PARMS,
019290       JCW-VALUE.
019300
019600 1-EOJ.
020200     GOBACK.
020300
020400 2-BLOWUP.
020500     MOVE "TRSCREEN"               TO  BU-PGM-NAME.
020600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
020700       VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
020800       BU-DISPLAY-FLDS.
020900
