001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TRSINQ.
001300 AUTHOR.              LYNN M BUNN/ BARBARA WINTER.
001400 DATE-WRITTEN.        05/23/83.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*REMARKS. THIS IS THE RECEIVING SLIP INQUIRY PROGRAM.
007900 ENVIRONMENT DIVISION.
008000 CONFIGURATION SECTION.
008100 SOURCE-COMPUTER.    HP-3000.
008200 OBJECT-COMPUTER.    HP-3000.
008400 DATA DIVISION.
008500 FILE SECTION.
008600 WORKING-STORAGE SECTION.
008700 COPY TBLOWUP OF COPYCSIS.
009400 COPY DATAB OF COPYCSIS.
009700
009800 COPY VCOMAREA OF COPYCSIS.
010600
010700 COPY LANGUAGE OF COPYCSIS.
010800
010900 PROCEDURE DIVISION.
011000 00-CONTROL.
011300
011400     PERFORM 100-CALL-SRSINQS  THRU 199-EXIT.
011800     GOBACK.
011900
016900 100-CALL-SRSINQS.
           MOVE "ZCSISINQ" TO VIEW-CFNAME.
017000     CALL "SRSINQS" USING BASE,
017100                          VIEW-COMAREA,
017200                          LANGUAGE-PARMS.
017300 199-EXIT.  EXIT.
017400
017500 990-BLOWUP.
017600     MOVE "TRSINQ"    TO BU-PGM-NAME.
017700     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
017800     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
017900           VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
018000           BU-DISPLAY-FLDS.
018100 999-EXIT.  EXIT.
