       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TRSPRTS.
       AUTHOR.        JEFF BUNGO.
      *INSTALLATION.  GOODYEAR.
       DATE-WRITTEN.  FEBRUARY 1996.
       DATE-COMPILED.
      *REMARKS.
      *
      *D   STAND ALONE DOCK RECEIPT REPRINT
      ***************************************************************
      *C 06/06/96  JEFF BUNGO
      *C    RETRIEVE DOCK-SPECIAL-PRINT FROM OVSH TO PASS TO
      *C    SUBPROGRAMS.
      ***************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.    AS400.
       OBJECT-COMPUTER.    AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS MPLTINFO-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       WORKING-STORAGE SECTION.
      ************************************************************
      *            W O R K I N G   S T O R A G E                 *
      ************************************************************


      **************************************************************
      *                 C A L L E D  R O U T I N E S               *
      **************************************************************
      *----------  WHO CALL RETURNS USER INFORMATION
       COPY TSPLPRT  IN COPYLIB.

       COPY TBLOWUP IN COPYLIB.
       01 RAW-MATERIAL-GROUP.
          05  RM-GROUP OCCURS 6 TIMES PIC X(2).

      **************************************************************
      *                    D A T A  B A S E                        *
      **************************************************************
       01  MPLTINFO-STATUS           PIC X(2).

       01  MPLTINFO-ARG              PIC X(4)     VALUE "P 01".

       COPY DBSTAT   IN COPYLIB.
       COPY MPLTINFO IN COPYLIB.
       COPY VCOMAREA IN COPYLIB.

      ******************************************************
      *   MISCELLANEOUS DATA TO PASS TO SUBPROGRAMS        *
      ******************************************************
       01  BASE-MMISA               PIC X(24)  VALUE SPACES.
       COPY DOCKMISC IN COPYLIB.
       COPY LANGUAGE IN COPYLIB.
       COPY ESCNAM2 IN COPYLIB.

      **************************************************************
      *                                                            *
      *        P R O C E D U R E        D I V I S I O N            *
      *                                                            *
      **************************************************************
       PROCEDURE DIVISION.
       00-CONTROL SECTION 00.
       00-RCVEXEC-MAIN.
           PERFORM 100-OPEN-ALL THRU 109-EXIT.

           PERFORM 130-INITIALIZATION THRU 139-EXIT.

           PERFORM 200-CALL-SRSPRTS THRU 299-EXIT.

           PERFORM 110-CLOSE-ALL THRU 119-EXIT.

           GOBACK.

      *************************************************************
      *              O P E N   A L L   F I L E S                  *
      *************************************************************
       100-OPEN-ALL.
           OPEN INPUT MPLTINFO.
           MOVE SPACES TO MISCELLANEOUS-DATA.
           MOVE "MGR     " TO MISC-USER-NAME.
           MOVE "ZUDCDOCK" TO VIEW-CFNAME.
       109-EXIT.  EXIT.
      ***********************************************************
      *         CLOSE ALL FILES AND INITIALIZE USER KEYS        *
      ***********************************************************
       110-CLOSE-ALL.
           CLOSE MPLTINFO.
       119-EXIT.  EXIT.

       130-INITIALIZATION.
      *----------  FIND THE USER AND SPOOLER NUMBERS
           CALL "TSPLPRT" USING SP-RET-CODE, SP-AREA.
           IF SP-RET-CODE = "NF"
              MOVE "SPOOL KEY NOT FOUND * TRSPRTS" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT
           ELSE
           IF SP-RET-CODE NOT = "00"
              MOVE "TSPLPRT ERROR * TRSPRTS" TO BU-DISPLAY-MSG
              PERFORM 990-BLOWUP THRU 999-EXIT.

           MOVE SP-USERNAME        TO MISC-USER-NAME.
           MOVE SP-SPOOL-NO (1)    TO SPOOL-PRT-NO.
           MOVE SP-SPOOL-NO (2)    TO ACCTG-PRT-NO.
           MOVE SP-SPOOL-NO (3)    TO PRINT-PRT-NO.
      *----------  FIND THE PLANT NUMBER AND PASS IT TO SUBROUTINES
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET MPLTINFO - TRSPRTS " TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE MPLTINFO-COMPANY TO PLT-NUMBER-PASS.

      *-------  FIND THE CAPITAL ITEM PRINTER AND RAW MATERIAL PRTR&P
           MOVE "POPT" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO   INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET MPLTINFO2 - TRSPRTS " TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE MPLTINFO-CAP-ITEM-PRT TO MISC-CAPITAL-SPOOLER.
           IF MPLTINFO-CAP-ITEM-PRT = "00"
              MOVE "N" TO MISC-PRINT-CAP-ITEMS
           ELSE
              MOVE "Y" TO MISC-PRINT-CAP-ITEMS.

           MOVE MPLTINFO-RAWMAT-PRT-NO TO RAW-MAT-SPOOLER.

      *-------  FIND P326 SWITCH TO PASS TO SUBROUTINES
           MOVE "P326" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
               MOVE "N" TO MISC-P326-SW
           ELSE
               MOVE MPLTINFO-P326-SW TO MISC-P326-SW.

      *-------  FIND RAW MATERIAL MAJOR GROUPS
           MOVE "OVSH" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0
                 MOVE "DBGET MPLTINFO2 - TRSPRTS " TO BU-DISPLAY-MSG
                 PERFORM 990-BLOWUP THRU 999-EXIT.
           MOVE MPLTINFO-RM-MAJOR-GROUP TO RAW-MATERIAL-GROUP.
           MOVE MPLTINFO-TALLY-CLASS TO TALLY-CLASS.
           IF MPLTINFO-DOCK-SPECIAL-PRINT = SPACES
               MOVE "Y" TO DOCK-SPECIAL-PRINT
           ELSE
               MOVE MPLTINFO-DOCK-SPECIAL-PRINT TO DOCK-SPECIAL-PRINT.
       139-EXIT.  EXIT.

       200-CALL-SRSPRTS.
              CALL "SRSPRTS" USING VIEW-COMAREA,
                                    BASE-MMISA,
                                    MISCELLANEOUS-DATA,
                                    LANGUAGE-PARMS,
                                    ESC-NAME
                                    RAW-MATERIAL-GROUP.
       299-EXIT.
           EXIT.

      ************************************************************
      *                    B L O W U P                           *
      ************************************************************
       990-BLOWUP.
           MOVE "TRSPRTS" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
                 VIEW-COMAREA, MPLTINFO-STATUS, BU-DISPLAY-MSG,
                 BU-DISPLAY-FLDS.
           GOBACK.
       999-EXIT.  EXIT.
