       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TRTVEQP.
       AUTHOR.                 W. ROXBURY.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER COMPANY.
       DATE-WRITTEN.           FEBRUARY  1998.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZRTVEQP-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS DYNAMIC
                  RELATIVE KEY IS RECNO
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-EQUIPMENT
           LABEL RECORDS       ARE STANDARD.
       01  CR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  RECNO               PIC 9999  VALUE 0.
       77  SUB                 PIC 9     VALUE 0.
       77  TRUE-VAL            PIC 1   VALUE B"1".
       77  NEG-VAL             PIC 1   VALUE B"0".

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X   VALUE "0".
           05  FILE-STAT-2     PIC X   VALUE "0".

       01  SCREEN-DATA.
           05  EQP-BUF         PIC XXXXXX.
           05  SCRN-MSGS.
               10  CMDMSG      PIC X(79).
               10  ERRMSG      PIC X(79).

       01  EQP-LIST-DATA.
           05  SEL-BUF         PIC X.
           05  LEQP            PIC XXXXXX.

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  EQUIP-DATA.
           COPY MEQPFILE       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  EQP-KEY.
           05  EQP-COMP        OCCURS 6 TIMES.
               10  EQP         PIC X.


       PROCEDURE DIVISION      USING EQP-KEY.
       BEGIN-PROC.
           OPEN INPUT          WO-EQUIPMENT.
           OPEN I-O            DISPLAY-FILE.

       6-MAIN.
           PERFORM VARYING SUB FROM 1 BY 1 UNTIL SUB > 6
               IF EQP(SUB) = "?"
                   MOVE SPACES TO EQP-KEY
               END-IF
           END-PERFORM.

       DISPLAY-EQPS.
           MOVE 0              TO RECNO.
           MOVE NEG-VAL        TO IND(75).
           MOVE TRUE-VAL       TO IND(77) IND(76).
           MOVE SPACES         TO DISPLAY-REC
                                  EQP-LIST-DATA.
           WRITE DISPLAY-REC   FORMAT "EQPLIST"
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY
               "SUBFILE CLEAR WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS.
           MOVE NEG-VAL        TO IND(77).

           MOVE EQP-KEY        TO EQPNUM OF WO-EQUIPMENT.
           START WO-EQUIPMENT  KEY >= EQPNUM OF WO-EQUIPMENT
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "23"
               GO TO DBGET-LOOP
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "START    "    TO DB-FUNC
               MOVE "WO-EQUIPMENT" TO DB-FILE
               MOVE FILE-STAT      TO CON-WORD
               DISPLAY             DB-ERROR
               GO TO DE-EXIT.

       DBGET-LOOP.
           READ WO-EQUIPMENT   NEXT INTO EQUIP-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "10" OR "14" OR "46"
               GO TO SUBF-CONT
           ELSE
           IF FILE-STAT NOT = "00"
               MOVE "READ     "    TO DB-FUNC
               MOVE "WO-EQUIPMENT" TO DB-FILE
               MOVE FILE-STAT      TO CON-WORD
               DISPLAY             DB-ERROR
               GO TO DE-EXIT.

           IF EQP-EQUIP-NUM = "      " OR
                              "SAFE01" OR "SAFE02" OR "SAFE03" OR
                              "SAFE04" OR "SAFE05" OR "SAFE06" OR
                              "SAFE07" OR "SAFE08" OR "SAFE09" OR
                              "SAFE10" OR "SAFE11" OR "SAFE12" OR
                              "SAFE13" OR "SAFE14" OR "SAFE15" OR
                              "SAFE16" OR "SAFE17" OR "SAFE18"
               GO TO DBGET-LOOP.

           MOVE SPACES         TO EQP-LIST-DATA.
           MOVE EQP-EQUIP-NUM  TO LEQP.
           ADD 1               TO RECNO.
           MOVE EQP-LIST-DATA  TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.
           WRITE SUBFILE       DISPLAY-REC FORMAT "EQUIPS"
                               INDIC ARE SCREEN-INDICATORS
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY   "SUBFILE 1 WRITE ERROR.  SCREEN STATUS IS "
                   SCREEN-STATUS
               GO TO END-OF-JOB.

           GO TO DBGET-LOOP.

       SUBF-CONT.
           IF RECNO EQUAL 0
               GO TO DE-EXIT.

           WRITE DISPLAY-REC   FORMAT "EQPCMD"
                               INDIC ARE SCREEN-INDICATORS.
           MOVE TRUE-VAL       TO IND(76).
           IF RECNO GREATER THAN 0
               MOVE TRUE-VAL   TO IND(75)
           ELSE
               MOVE NEG-VAL    TO IND(75).

           WRITE DISPLAY-REC   FORMAT "EQPLIST"
                               INDIC ARE SCREEN-INDICATORS.
           READ DISPLAY-FILE   FORMAT "EQPLIST"
                               INDIC ARE SCREEN-INDICATORS.

           MOVE SPACES         TO EQP-LIST-DATA.
           READ SUBFILE        DISPLAY-FILE
                               NEXT MODIFIED INTO EQP-LIST-DATA
                               FORMAT "EQUIPS"
                               INDIC ARE SCREEN-INDICATORS.

           IF SEL-BUF NOT = SPACE
               MOVE LEQP       TO EQP-KEY.

       DE-EXIT.                EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-EQUIPMENT.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

