       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TSCPRINT.
       AUTHOR.         W ROXBURY.
       DATE-WRITTEN.   05/15/1989.
       DATE-COMPILED.
      *REMARKS.        PRINTOUT OF THE SAFETY CONTACT FILE
      *                BASED ON DATE RANGE AND ZONE.
      *C
      *C 06/03/2003 WR FONAGY
      *C   ADDED THE TWO NEW SAFETY CONTACT TYPES TO THE REPORT
      *C   (5 - ERGONOMICS AND 6 - REPAIR HOSPITAL, WO REQUIRED)
      *C
      *C 06/13/2003 WR FONAGY
      *C   ADDED ABILITY TO REDIRECT REPORT TO ANY PRINTER USER
      *C   CHOOSES
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                               C01 IS NEW-PAGE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZSCSYSTEM-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT SAFETY-DATE
                  ASSIGN       TO DATABASE-MCFLSC0101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT SAFETY-ZONE
                  ASSIGN       TO DATABASE-MCFLSC0102
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-ZONE-PRTY
                  ASSIGN       TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT PRINT-FILE
                  ASSIGN       TO PRINTER-MCPRT
                  FILE STATUS  IS FILE-STAT.

           SELECT OUT-FILE
                  ASSIGN       TO DATABASE-SAFECONT
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  SAFETY-DATE
           LABEL RECORDS       ARE STANDARD.
       01  SD-REC.
           COPY DDS-ALL-FORMATS OF MCFLSC0101.

       FD  SAFETY-ZONE
           LABEL RECORDS       ARE STANDARD.
       01  SZ-REC.
           COPY DDS-ALL-FORMATS OF MCFLSC0102.

       FD  WO-ZONE-PRTY
           LABEL RECORDS       ARE STANDARD.
       01  WZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  PRINT-FILE RECORD   CONTAINS 80 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS PRINT-REC.
       01  PRINT-REC           PIC X(80).

       FD  OUT-FILE RECORD     CONTAINS 212 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-DATE-TIME.
               10  OUT-DATE.
                   15  OUT-CC  PIC 99.
                   15  OUT-YY  PIC 99.
                   15  OUT-MM  PIC 99.
                   15  OUT-DD  PIC 99.
               10  OUT-TIME.
                   15  OUT-HR  PIC 99.
                   15  OUT-MN  PIC 99.
           05  OUT-INIT        PIC X(16).
           05  OUT-EQUIP-NAM   PIC X(18).
           05  OUT-ZONE        PIC X(04).
           05  OUT-DESC1       PIC X(30).
           05  OUT-DESC2.
               10  OUT-OBS     PIC X(66).
               10  OUT-ACT     PIC X(66).

       SD  SORT-FILE RECORD    CONTAINS 212 CHARACTERS
           DATA RECORD         IS SORT-REC.
       01  SORT-REC.
           05  SORT-DATE-TIME.
               10  SORT-DATE.
                   15  SORT-CC PIC 99.
                   15  SORT-YY PIC 99.
                   15  SORT-MM PIC 99.
                   15  SORT-DD PIC 99.
               10  SORT-TIME.
                   15  SORT-HR PIC 99.
                   15  SORT-MN PIC 99.
           05  SORT-INIT       PIC X(16).
           05  SORT-EQUIP-NAM  PIC X(18).
           05  SORT-ZONE       PIC X(04).
           05  SORT-DESC1      PIC X(30).
           05  SORT-DESC2.
               10  SORT-OBS    PIC X(66).
               10  SORT-ACT    PIC X(66).

       WORKING-STORAGE SECTION.
       77  ACT-KEY             PIC 9(9).
       77  EOF-SW              PIC 9.
       77  DOT-SW              PIC 9     VALUE 0.
       77  TYP-SW              PIC 9     VALUE 0.
       77  PAGE-SW             PIC 9     VALUE 1.
       77  PAGE-CTR            PIC 99    VALUE 0.
       77  LINE-CTR            PIC 99    VALUE 0.
       77  LOC-SAVE            PIC X(18) VALUE SPACES.
       77  TYPESAVE            PIC X(30) VALUE SPACES.
       77  ZONESAVE            PIC X(04) VALUE SPACES.
       77  DOTS-LINE           PIC X(80) VALUE ALL "-".
       77  LINES-LINE          PIC X(80) VALUE ALL "=".
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  HOLD-PRINT-FILE             PIC X(10) VALUE SPACES.
       01  FILE-TYPE                   PIC X(7)  VALUE "*FILE".
       01  CHKOBJ-STATUS               PIC X(2)  VALUE SPACES.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  SCREEN-DATA.
           05  DATE1-BUF.
               10  DAT1-MM.
                   15  D1-M1   PIC X.
                   15  D1-M2   PIC X.
               10  DAT1-DD.
                   15  D1-D1   PIC X.
                   15  D1-D2   PIC X.
               10  DAT1-CT     PIC XX.
               10  DAT1-YY.
                   15  D1-Y1   PIC X.
                   15  D1-Y2   PIC X.
           05  DATE2-BUF.
               10  DAT2-MM.
                   15  D2-M1   PIC X.
                   15  D2-M2   PIC X.
               10  DAT2-DD.
                   15  D2-D1   PIC X.
                   15  D2-D2   PIC X.
               10  DAT2-CT     PIC XX.
               10  DAT2-YY.
                   15  D2-Y1   PIC X.
                   15  D2-Y2   PIC X.
           05  ZONE-BUF        PIC X(04).
           05  RPT-SW          PIC X.
               88  LONG                 VALUE " ".
           05  PRT-NUM         PIC X(2).
           05  CMDMSG          PIC X(79).
           05  ERRMSG          PIC X(79).

       01  CURR-DATE.
           05  CURR-YY         PIC X(02).
           05  CURR-MM         PIC X(02).
           05  CURR-DD         PIC X(02).

       01  TIME-BUFFER.
           05  TIME-BUF.
               10  HRS         PIC XX.
               10  MIN         PIC XX.
               10  SEC         PIC XX.
           05  TIME-EXP.
               10  TIME-H      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-M      PIC XX.
               10  FILLER      PIC X  VALUE ":".
               10  TIME-S      PIC XX.

       01  S-DATE.
           05  S-CT            PIC XX.
           05  S-YY            PIC XX.
           05  S-MM            PIC XX.
           05  S-DD            PIC XX.

       01  E-DATE.
           05  E-CT            PIC XX.
           05  E-YY            PIC XX.
           05  E-MM            PIC XX.
           05  E-DD            PIC XX.

       01  RPT-CTRS.
           05  TYPE-CTRS.
               10  TP1         PIC 9(08).
               10  TP2         PIC 9(08).
               10  TP3         PIC 9(08).
               10  TP4         PIC 9(08).
               10  TP5         PIC 9(08).
               10  TP6         PIC 9(08).
               10  TPT         PIC 9(08).
           05  TOT-CTRS.
               10  TT1         PIC 9(08).
               10  TT2         PIC 9(08).
               10  TT3         PIC 9(08).
               10  TT4         PIC 9(08).
               10  TT5         PIC 9(08).
               10  TT6         PIC 9(08).
               10  TTT         PIC 9(08).

       01  HEADER-DT.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "DATE:  ".
           05  PL-DAT.
               10  PL-DAT-MM   PIC X(02) VALUE SPACES.
               10  FILLER      PIC X(01) VALUE "/".
               10  PL-DAT-DD   PIC X(02) VALUE SPACES.
               10  FILLER      PIC X(01) VALUE "/".
               10  PL-DAT-YY   PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "TIME:  ".
           05  PL-TIM          PIC X(08) VALUE SPACES.
           05  FILLER          PIC X(12) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE "PAGE:".
           05  ZPAGE           PIC ZZZ   VALUE SPACES.
           05  FILLER          PIC X(10) VALUE SPACES.

       01  HEADER-TITLE.
           05  FILLER          PIC X(20) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "S A F E T Y".
           05  FILLER          PIC X(16) VALUE "   C O N T A C T".
           05  FILLER          PIC X(14) VALUE "   S Y S T E M".
           05  FILLER          PIC X(19) VALUE SPACES.

       01  HEADER1.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(13) VALUE "START DATE:  ".
           05  SD-BUF.
               10  SD-MM       PIC X(02).
               10  FILLER      PIC X(01) VALUE "/".
               10  SD-DD       PIC X(02).
               10  FILLER      PIC X(01) VALUE "/".
               10  SD-CT       PIC X(02).
               10  SD-YY       PIC X(02).
           05  FILLER          PIC X(10) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "END DATE:  ".
           05  ED-BUF.
               10  ED-MM       PIC X(02).
               10  SLASH1      PIC X(01) VALUE "/".
               10  ED-DD       PIC X(02).
               10  SLASH2      PIC X(01) VALUE "/".
               10  ED-CT       PIC X(02).
               10  ED-YY       PIC X(02).
           05  FILLER          PIC X(11) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "ZONE:  ".
           05  P-ZONE          PIC X(04).
           05  FILLER          PIC X(02) VALUE SPACES.

       01  HEADER-RPT1.
           05  FILLER          PIC X(20) VALUE SPACES.
           05  FILLER          PIC X(06) VALUE "UNSAFE".
           05  FILLER          PIC X(06) VALUE SPACES.
           05  FILLER          PIC X(06) VALUE "UNSAFE".
           05  FILLER          PIC X(17) VALUE SPACES.
           05  FILLER          PIC X(06) VALUE "REPAIR".
           05  FILLER          PIC X(06) VALUE SPACES.
           05  FILLER          PIC X(05) VALUE "TOTAL".
           05  FILLER          PIC X(08) VALUE SPACES.

       01  HEADER-RPT2.
           05  FILLER          PIC X(01) VALUE SPACES.
           05  FILLER          PIC X(08) VALUE "POSITIVE".
           05  FILLER          PIC X(01) VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "AT-RISK".
           05  FILLER          PIC X(03) VALUE SPACES.
           05  FILLER          PIC X(09) VALUE "CONDITION".
           05  FILLER          PIC X(03) VALUE SPACES.
           05  FILLER          PIC X(09) VALUE "CONDITION".
           05  FILLER          PIC X(14) VALUE SPACES.
           05  FILLER          PIC X(08) VALUE "HOSPITAL".
           05  FILLER          PIC X(04) VALUE SPACES.
           05  RH-LOC          PIC X(13) VALUE SPACES.

       01  HEADER-RPT3.
           05  FILLER          PIC X     VALUE SPACES.
           05  FILLER          PIC X(07) VALUE "CONTACT".
           05  FILLER          PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(08) VALUE "BEHAVIOR".
           05  FILLER          PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "(CORRECTED)".
           05  FILLER          PIC X     VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "WO REQUIRED".
           05  FILLER          PIC X     VALUE SPACES.
           05  FILLER          PIC X(10) VALUE "ERGONOMICS".
           05  FILLER          PIC X     VALUE SPACES.
           05  FILLER          PIC X(11) VALUE "WO REQUIRED".
           05  FILLER          PIC X     VALUE SPACES.
           05  FILLER          PIC X(08) VALUE "CONTACTS".
           05  FILLER          PIC X(05) VALUE SPACES.

       01  REPORT-CTRS.
           05  FILLER          PIC X     VALUE SPACES.
           05  PCT             PIC ZZ,ZZ9.
           05  FILLER          PIC X(03) VALUE SPACES.
           05  ARB             PIC ZZ,ZZ9.
           05  FILLER          PIC X(05) VALUE SPACES.
           05  UCC             PIC ZZ,ZZ9.
           05  FILLER          PIC X(07) VALUE SPACES.
           05  UCM             PIC ZZ,ZZ9.
           05  FILLER          PIC X(06) VALUE SPACES.
           05  ERG             PIC ZZ,ZZ9.
           05  FILLER          PIC X(06) VALUE SPACES.
           05  RHM             PIC ZZ,ZZ9.
           05  FILLER          PIC X(04) VALUE SPACES.
           05  TCT             PIC ZZ,ZZ9.
           05  FILLER          PIC X(06) VALUE SPACES.

       01  P-REC-1.
           05  FILLER          PIC X(11) VALUE "LOCATION:  ".
           05  LOCATE          PIC X(13).
           05  FILLER          PIC X(56) VALUE SPACES.

       01  P-REC-2.
           05  P-TYPE          PIC X(30).
           05  FILLER          PIC X(50) VALUE SPACES.

       01  P-REC-3.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  P-DATE.
               10  P-MM        PIC X(02).
               10  FILLER      PIC X(01) VALUE "/".
               10  P-DD        PIC X(02).
               10  FILLER      PIC X(01) VALUE "/".
               10  P-CC        PIC X(02).
               10  P-YY        PIC X(02).
           05  FILLER          PIC X(01) VALUE "-".
           05  P-TIME.
               10  P-H         PIC XX.
               10  FILLER      PIC X     VALUE ":".
               10  P-M         PIC XX.
           05  FILLER          PIC XX    VALUE SPACES.
           05  P-INIT          PIC X(16).
           05  FILLER          PIC X(44) VALUE SPACES.

       01  P-REC-4.
           05  FILLER          PIC X(14) VALUE SPACES.
           05  OB-ACT          PIC X(66).

       01  DB-ERROR.
           05  DB-FUNC         PIC X(10) VALUE SPACES.
           05  DB-FILE         PIC X(18) VALUE SPACES.
           05  FILLER          PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD        PIC XX.

       01  ZONE-ARGUMENT.
           05  Z-ARG           PIC X(4).
           05  FILLER          PIC XX    VALUE "1 ".

       01  ZONE-DATA.
           05  ZONE-FIELD      PIC X(4).
           05  PRTY-FIELD      PIC XX.

       COPY SCREENIO       IN COPYLIB.

       COPY CATREAD        IN COPYLIB.

       COPY TLSHIFT   IN COPYLIB.

       COPY TRSHIFT   IN COPYLIB.

       COPY OVRPFDATA      IN COPYLIB.

       COPY SAFECONT       IN COPYLIB.

       01  MESSAGE-DATA.
           COPY ERRORLIN       IN COPYLIB.

       PROCEDURE DIVISION.
       BEGIN-PGM.
           CALL "CLSCPRINT".
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          SAFETY-DATE.
           OPEN INPUT          SAFETY-ZONE.
           OPEN INPUT          WO-ZONE-PRTY.

           ACCEPT CURR-DATE    FROM DATE.
           MOVE CURR-YY        TO PL-DAT-YY.
           MOVE CURR-MM        TO PL-DAT-MM.
           MOVE CURR-DD        TO PL-DAT-DD.
           ACCEPT TIME-BUF     FROM TIME.
           MOVE HRS            TO TIME-H.
           MOVE MIN            TO TIME-M.
           MOVE SEC            TO TIME-S.
           MOVE TIME-EXP       TO PL-TIM.

       MAIN.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.
           MOVE 0              TO EOF-SW PAGE-CTR ACT-KEY.
           MOVE "SELPRINT"     TO SCREEN-NAME.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       SHOWFORM.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.

           IF KEY-HIT = 3
               GO TO END-OF-JOB.

           IF PRT-NUM = SPACES
               MOVE "REQUIRED FIELD" TO ERRMSG
               MOVE TRUE-VAL         TO IND(30) IND(99)
               GO TO SHOWFORM
           END-IF.

           IF D1-M2 = " "
               MOVE D1-M1      TO D1-M2
               MOVE "0"        TO D1-M1.
           IF D1-D2 = " "
               MOVE D1-D1      TO D1-D2
               MOVE "0"        TO D1-D1.
           IF D1-Y2 = " "
               MOVE D1-Y1      TO D1-Y2
               MOVE "0"        TO D1-Y1.
           IF D2-M2 = " "
               MOVE D2-M1      TO D2-M2
               MOVE "0"        TO D2-M1.
           IF D2-D2 = " "
               MOVE D2-D1      TO D2-D2
               MOVE "0"        TO D2-D1.
           IF D2-Y2 = " "
               MOVE D2-Y1      TO D2-Y2
               MOVE "0"        TO D2-Y1.

           IF D1-M1 = " "
               MOVE "0"        TO D1-M1.
           IF D1-D1 = " "
               MOVE "0"        TO D1-D1.
           IF D1-Y1 = " "
               MOVE "0"        TO D1-Y1.
           IF D2-M1 = " "
               MOVE "0"        TO D2-M1.
           IF D2-D1 = " "
               MOVE "0"        TO D2-D1.
           IF D2-Y1 = " "
               MOVE "0"        TO D2-Y1.

           IF DATE2-BUF = "0 0   0 "
               MOVE SPACES     TO DATE2-BUF.

           IF DATE1-BUF NOT = SPACES
               IF DATE1-BUF NOT NUMERIC
      ******************************************************************
      **    MESSAGE:  035/014
      **  INVALID START DATE
      ******************************************************************
                   MOVE 35014  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL TO IND(1) IND(99)
                   GO TO SHOWFORM
               ELSE
               NEXT SENTENCE
           ELSE
      ******************************************************************
      **    MESSAGE:  030/028
      **  DATE OR DATE RANGE REQUIRED
      ******************************************************************
           MOVE 30028          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO ERRMSG
           MOVE TRUE-VAL       TO IND(1) IND(99)
           GO TO SHOWFORM.

           IF DAT1-YY IS NUMERIC
               IF DAT1-MM > 0 AND DAT1-MM < 13
                   IF DAT1-DD > 0 AND DAT1-DD < 32
                       NEXT SENTENCE
                   ELSE
      ******************************************************************
      **    MESSAGE:  035/030
      **  INVALID DAY
      ******************************************************************
                   MOVE 35030  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL TO IND(2) IND(99)
                   GO TO SHOWFORM
               ELSE
      ******************************************************************
      **    MESSAGE:  035/031
      **  INVALID MONTH
      ******************************************************************
               MOVE 35031      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(1) IND(99)
               GO TO SHOWFORM
           ELSE
      ******************************************************************
      **    MESSAGE:  035/032
      **  INVALID YEAR
      ******************************************************************
           MOVE 35032          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO ERRMSG
           MOVE TRUE-VAL       TO IND(3) IND(99)
           GO TO SHOWFORM.

           IF DAT1-CT = "19" OR "20"
               NEXT SENTENCE
           ELSE
      ******************************************************************
      **    MESSAGE:  035/032
      **  INVALID YEAR
      ******************************************************************
               MOVE 35032      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(3) IND(99)
               GO TO SHOWFORM.

           IF DATE2-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF DATE2-BUF NOT NUMERIC
      ******************************************************************
      **    MESSAGE:  035/012
      **  INVALID COMPLETE DATE
      ******************************************************************
               MOVE 35012      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOWFORM
           ELSE
           IF DAT2-YY IS NUMERIC
               IF DAT2-MM > 0 AND DAT2-MM < 13
                   IF DAT2-DD > 0 AND DAT2-DD < 32
                       NEXT SENTENCE
                   ELSE
      ******************************************************************
      **    MESSAGE:  035/030
      **  INVALID DAY
      ******************************************************************
                   MOVE 35030  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ERRMSG
                   MOVE TRUE-VAL TO IND(5) IND(99)
                   GO TO SHOWFORM
               ELSE
      ******************************************************************
      **    MESSAGE:  035/031
      **  INVALID MONTH
      ******************************************************************
               MOVE 35031      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(4) IND(99)
               GO TO SHOWFORM
           ELSE
      ******************************************************************
      **    MESSAGE:  035/032
      **  INVALID YEAR
      ******************************************************************
           MOVE 35032          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO ERRMSG
           MOVE TRUE-VAL       TO IND(6) IND(99)
           GO TO SHOWFORM.

           IF DAT2-CT = SPACES OR "19" OR "20"
               NEXT SENTENCE
           ELSE
      ******************************************************************
      **    MESSAGE:  035/032
      **  INVALID YEAR
      ******************************************************************
               MOVE 35032      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(6) IND(99)
               GO TO SHOWFORM.

           MOVE DAT1-CT        TO S-CT SD-CT.
           MOVE DAT1-YY        TO S-YY SD-YY.
           MOVE DAT1-MM        TO S-MM SD-MM.
           MOVE DAT1-DD        TO S-DD SD-DD.
           MOVE "/"            TO SLASH1 SLASH2.
           MOVE DAT2-CT        TO E-CT ED-CT.
           MOVE DAT2-YY        TO E-YY ED-YY.
           MOVE DAT2-MM        TO E-MM ED-MM.
           MOVE DAT2-DD        TO E-DD ED-DD.
           IF DATE2-BUF = SPACES
               MOVE SPACES     TO ED-BUF.

      *    VALIDATE THAT THE PRINTER NUMBER THAT IS ENTERED
      *    IS AN OBJECT ON THE SYSTEM
           PERFORM 990-VALIDATE-PRINTER.
           IF CHKOBJ-STATUS NOT = "00"
      *    "I91: INVALID PRTR: USE ANOTHER OR 'LP' FOR LINE PRTR"
               MOVE 09             TO  CATREAD-MSG-SET
               MOVE 091            TO  CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL       TO IND(30) IND(99)
               GO TO SHOWFORM
           END-IF.
           MOVE RS-SHIFT-FLD-7-8   TO OVRPRTF-TOFILE-NUM-X.
           MOVE 66                 TO OVRPRTF-PAGESIZE.
           MOVE 60                 TO OVRPRTF-OVRFLW.
           MOVE 6                  TO OVRPRTF-LPI.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.

           IF ZONE-BUF = SPACES
               GO TO SORT-PROC.

           MOVE ZONE-BUF       TO Z-ARG.
           MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-ZONE-PRTY.
           START WO-ZONE-PRTY  KEY = ZONEPRTY OF WO-ZONE-PRTY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
      ******************************************************************
      **    MESSAGE:  035/044
      **  INVALID ZONE
      ******************************************************************
               MOVE 35044      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(7) IND(99)
               GO TO SHOWFORM.

       SORT-PROC.
           MOVE 0              TO ACT-KEY.
           SORT SORT-FILE      ASCENDING KEY SORT-ZONE
                                             SORT-EQUIP-NAM
                                             SORT-DESC1
                                             SORT-DATE-TIME
             INPUT PROCEDURE   SORT-INPUT-RECORDS
             OUTPUT PROCEDURE  SORT-WRITE-FILE.

           IF ACT-KEY = 0
      ******************************************************************
      **    MESSAGE:  040/011
      **  NO RECORDS FOUND TO MATCH YOUR SELECTION
      ******************************************************************
               MOVE 40011      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ERRMSG
               MOVE TRUE-VAL   TO IND(99)
               GO TO SHOWFORM.

           MOVE 0              TO ACT-KEY EOF-SW.
           OPEN INPUT          OUT-FILE.
           MOVE SPACES         TO LOC-SAVE ZONESAVE TYPESAVE.
           MOVE ZEROS          TO RPT-CTRS.
           MOVE 2              TO DOT-SW.
           MOVE 65             TO LINE-CTR.
           MOVE 1              TO TYP-SW PAGE-SW.
           PERFORM READ-FILE   THRU RF-EXIT
                               UNTIL EOF-SW = 1.

           MOVE TP1            TO PCT.
           MOVE TP2            TO ARB.
           MOVE TP3            TO UCC.
           MOVE TP4            TO UCM.
           MOVE TP5            TO ERG.
           MOVE TP6            TO RHM.
           MOVE TPT            TO TCT.
           PERFORM PRINT-SUMMARY.

           MOVE TT1            TO PCT.
           MOVE TT2            TO ARB.
           MOVE TT3            TO UCC.
           MOVE TT4            TO UCM.
           MOVE TT5            TO ERG.
           MOVE TT6            TO RHM.
           MOVE TTT            TO TCT.
           MOVE "PLANT WIDE"   TO RH-LOC.
           IF ZONE-BUF = SPACES
               PERFORM PRINT-SUMMARY.

           CLOSE               PRINT-FILE.
           GO TO MAIN.

       READ-FILE.
           ADD 1               TO ACT-KEY.
           READ OUT-FILE       INVALID KEY
               MOVE 1          TO EOF-SW
               CLOSE           OUT-FILE
               GO TO RF-EXIT.

           PERFORM WRITE-LINE.

       RF-EXIT.             EXIT.

       WRITE-LINE.
           IF OUT-ZONE NOT = ZONESAVE
               MOVE TP1        TO PCT
               MOVE TP2        TO ARB
               MOVE TP3        TO UCC
               MOVE TP4        TO UCM
               MOVE TP5        TO ERG
               MOVE TP6        TO RHM
               MOVE TPT        TO TCT
               IF ZONESAVE NOT = SPACES
                   PERFORM PRINT-SUMMARY
                   MOVE ZEROS  TO TYPE-CTRS
               END-IF
               MOVE OUT-ZONE   TO ZONESAVE
               IF LONG         MOVE 65 TO LINE-CTR.

           IF LONG
               IF LINE-CTR > 55
                   PERFORM PRINT-HEADINGS
               END-IF
           ELSE
               IF LINE-CTR > 52
                   PERFORM PRINT-HEADINGS.

           MOVE OUT-EQUIP-NAM  TO LOCATE.
           MOVE OUT-MM         TO P-MM.
           MOVE OUT-DD         TO P-DD.
           MOVE OUT-CC         TO P-CC.
           MOVE OUT-YY         TO P-YY.
           MOVE OUT-HR         TO P-H.
           MOVE OUT-MN         TO P-M.
           MOVE OUT-DESC1      TO P-TYPE.
           MOVE OUT-INIT       TO P-INIT.

           IF LOCATE NOT = LOC-SAVE
               MOVE TP1        TO PCT
               MOVE TP2        TO ARB
               MOVE TP3        TO UCC
               MOVE TP4        TO UCM
               MOVE TP5        TO ERG
               MOVE TP6        TO RHM
               MOVE TPT        TO TCT
               IF LONG
                   IF LOC-SAVE NOT = SPACES
                       PERFORM PRINT-SUMMARY
                       MOVE ZEROS  TO TYPE-CTRS
                   END-IF
               END-IF
               MOVE LOCATE     TO LOC-SAVE RH-LOC
               MOVE SPACES     TO TYPESAVE
               MOVE DOTS-LINE  TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING DOT-SW LINES
               ADD  DOT-SW     TO LINE-CTR
               MOVE 2          TO DOT-SW
               MOVE 1          TO TYP-SW
               MOVE P-REC-1    TO PRINT-REC
               WRITE PRINT-REC AFTER ADVANCING 1 LINES
               MOVE DOTS-LINE  TO PRINT-REC
               ADD  1          TO LINE-CTR
               IF LONG         WRITE PRINT-REC
                               AFTER ADVANCING 1 LINES
                   ADD  1      TO LINE-CTR.

           IF P-TYPE NOT = TYPESAVE
               MOVE P-TYPE     TO TYPESAVE
               MOVE P-REC-2    TO PRINT-REC
               IF LONG         WRITE PRINT-REC
                               AFTER ADVANCING TYP-SW LINES
                   ADD  TYP-SW TO LINE-CTR
               END-IF
               MOVE 2          TO TYP-SW.

           IF OUT-DESC1 = "POSITIVE CONTACT              "
               ADD  1          TO TP1 TT1 TPT TTT
           ELSE
           IF OUT-DESC1 = "AT-RISK BEHAVIOR              "
               ADD  1          TO TP2 TT2 TPT TTT
           ELSE
           IF OUT-DESC1 = "UNSAFE CONDITION (CORRECTED)  "
               ADD  1          TO TP3 TT3 TPT TTT
           ELSE
           IF OUT-DESC1 = "UNSAFE CONDITION, WO REQUIRED "
               ADD  1          TO TP4 TT4 TPT TTT
           ELSE
           IF OUT-DESC1 = "ERGONOMICS                    "
               ADD  1          TO TP5 TT5 TPT TTT
           ELSE
           IF OUT-DESC1 = "REPAIR HOSPITAL, WO REQUIRED  "
               ADD  1          TO TP6 TT6 TPT TTT.

           MOVE P-REC-3        TO PRINT-REC
           IF LONG             WRITE PRINT-REC
                               AFTER ADVANCING 1 LINES
               ADD  1          TO LINE-CTR.

           MOVE OUT-OBS        TO OB-ACT.
           MOVE P-REC-4        TO PRINT-REC.
           IF LONG             WRITE PRINT-REC
                               AFTER ADVANCING 1 LINES
               ADD  1          TO LINE-CTR.

           IF OUT-ACT NOT = SPACES
               MOVE OUT-ACT    TO OB-ACT
               MOVE P-REC-4    TO PRINT-REC
               IF LONG         WRITE PRINT-REC
                               AFTER ADVANCING 1 LINES
                   ADD  1      TO LINE-CTR.

       PRINT-HEADINGS.
           MOVE 1              TO DOT-SW.
           MOVE SPACES         TO LOC-SAVE TYPESAVE.
           ADD  1              TO PAGE-CTR.

           IF ZONE-BUF = SPACES
               MOVE "ALL "     TO P-ZONE
               IF LONG
                 MOVE OUT-ZONE TO P-ZONE
               END-IF
           ELSE
               MOVE ZONE-BUF   TO P-ZONE.

           IF P-ZONE = "...."
               MOVE SPACES     TO P-ZONE.

           MOVE PAGE-CTR       TO ZPAGE.
           MOVE HEADER-DT      TO PRINT-REC.
           IF PAGE-SW = 0
               WRITE PRINT-REC AFTER ADVANCING NEW-PAGE
           ELSE
               MOVE 0          TO PAGE-SW
               WRITE PRINT-REC AFTER ADVANCING 3 LINES.

           MOVE LINES-LINE     TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE HEADER-TITLE   TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE LINES-LINE     TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE HEADER1        TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE 7              TO LINE-CTR.

       PRINT-SUMMARY.
           MOVE DOTS-LINE      TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE HEADER-RPT1    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 2 LINES.
           MOVE HEADER-RPT2    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE HEADER-RPT3    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           MOVE REPORT-CTRS    TO PRINT-REC.
           WRITE PRINT-REC     AFTER ADVANCING 1 LINES.
           ADD  6              TO LINE-CTR.

       990-VALIDATE-PRINTER.
      *------ VALIDATE THAT THE PRINTER ENTERED BY THE USER EXISTS
      *------ AS AN FILE OBJECT STARTING WITH MCPRT AT THE PLANT.
           MOVE PRT-NUM                  TO  LS-SHIFT-FLD.
           CALL "TLSHIFT" USING LS-RET-CODE, LS-SHIFT-FLD.
           MOVE LS-SHIFT-FLD             TO  RS-SHIFT-FLD.
           CALL "TRSHIFT" USING LS-RET-CODE, RS-SHIFT-FLD.
           MOVE SPACES                   TO  HOLD-PRINT-FILE
                                             CHKOBJ-STATUS.
           STRING "MCPRT" DELIMITED BY SIZE,
                  RS-SHIFT-FLD-7-8 DELIMITED BY SPACES,
             INTO HOLD-PRINT-FILE.
           CALL "CCHKOBJ3" USING HOLD-PRINT-FILE, FILE-TYPE,
                                 CHKOBJ-STATUS.

       COPY OVRPFCALL IN COPYLIB.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               SAFETY-DATE.
           CLOSE               SAFETY-ZONE.
           CLOSE               WO-ZONE-PRTY.
           CLOSE               PRINT-FILE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.       EXIT.

       SORT-INPUT-RECORDS.
           PERFORM SORT-MAIN THRU SORT-M-EXIT.

       SORT-MAIN.
           IF ZONE-BUF NOT = SPACES
               MOVE ZONE-BUF     TO SCZONE OF SAFETY-ZONE
               START SAFETY-ZONE KEY = SCZONE OF SAFETY-ZONE
                   INVALID KEY   MOVE FILE-STAT TO FILE-STAT
               END-START
               IF FILE-STAT NOT = "00"
                   GO TO SORT-M-EXIT
               END-IF
               PERFORM SORT-BY-ZONE THRU SORT-ZONE-EXIT
           ELSE
               PERFORM SORT-DBGET THRU SORT-DBGET-EXIT.

       SORT-M-EXIT.            EXIT.

       SORT-DBGET.
           MOVE SPACES         TO SORT-REC.
           READ SAFETY-DATE    FIRST INTO CONTACT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-DBGET-EXIT.

           GO TO DBGET-CONT.

       DBGET-LOOP.
           MOVE SPACES         TO SORT-REC.
           READ SAFETY-DATE    NEXT INTO CONTACT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-DBGET-EXIT.

       DBGET-CONT.
           IF DATE2-BUF NOT = SPACES
               IF SC-DATE GREATER OR EQUAL S-DATE AND
                  SC-DATE LESS OR EQUAL E-DATE
                      NEXT SENTENCE
               ELSE
               GO TO DBGET-LOOP
           ELSE
           IF SC-DATE = S-DATE
               NEXT SENTENCE
           ELSE
           GO TO DBGET-LOOP.

           MOVE SC-TIME-STAMP  TO SORT-DATE-TIME.
           MOVE INITIATOR      TO SORT-INIT.
           MOVE SC-EQUIP-NAME  TO SORT-EQUIP-NAM.
           MOVE SC-ZONE        TO SORT-ZONE.
           IF SC-ZONE = SPACES
               MOVE "...."     TO SORT-ZONE.
           MOVE SC-DESC-1      TO SORT-DESC1.
           MOVE SC-DESC-2      TO SORT-DESC2.
           RELEASE             SORT-REC.
           GO TO DBGET-LOOP.

       SORT-DBGET-EXIT.        EXIT.

       SORT-BY-ZONE.
           MOVE SPACES         TO SORT-REC.
           READ SAFETY-ZONE    NEXT INTO CONTACT-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO SORT-ZONE-EXIT.

           IF SC-ZONE NOT = ZONE-BUF
               GO TO SORT-ZONE-EXIT.

           IF DATE2-BUF NOT = SPACES
               IF SC-DATE GREATER OR EQUAL S-DATE AND
                  SC-DATE LESS OR EQUAL E-DATE
                      NEXT SENTENCE
               ELSE
               GO TO SORT-BY-ZONE
           ELSE
           IF SC-DATE = S-DATE
               NEXT SENTENCE
           ELSE
           GO TO SORT-BY-ZONE.

           MOVE SC-TIME-STAMP  TO SORT-DATE-TIME.
           MOVE INITIATOR      TO SORT-INIT.
           MOVE SC-EQUIP-NAME  TO SORT-EQUIP-NAM.
           MOVE SC-ZONE        TO SORT-ZONE.
           MOVE SC-DESC-1      TO SORT-DESC1.
           MOVE SC-DESC-2      TO SORT-DESC2.
           RELEASE             SORT-REC.
           GO TO SORT-BY-ZONE.

       SORT-ZONE-EXIT.         EXIT.

       SORT-WRITE-FILE.
           MOVE 0              TO ACT-KEY.
           OPEN OUTPUT         OUT-FILE.
           PERFORM SWF-LOOP    THRU SWF-EXIT.
           CLOSE               OUT-FILE.

       SWF-LOOP.
           RETURN SORT-FILE    AT END
               GO TO SWF-EXIT.
           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-REC.
           WRITE OUT-REC       INVALID KEY
               GO TO SWF-EXIT.
           GO TO SWF-LOOP.

       SWF-EXIT.               EXIT.

