       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TSCREEN.
       INSTALLATION.           GOODYEAR TIRE AND RUBBER.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT TERMINAL-FILE
                  ASSIGN       TO WORKSTATION-ZSCREEN-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  TERMINAL-FILE
           LABEL RECORDS ARE OMITTED.
       01  TERMINAL-REC        PIC X(2000).

       WORKING-STORAGE SECTION.
       77  TO-CYCLE            PIC S9(3)        COMP-3.
       77  TO-CTR              PIC S9(3)        COMP-3.
       77  PARM1               PIC X(70).
       77  PARM2               PIC S9(10)V9(5)  COMP-3  VALUE 70.

       LINKAGE SECTION.

       COPY SCREENIO           OF COPYLIB.

       PROCEDURE DIVISION      USING SCREEN-PARMS.
       OPEN-PAR.
           MOVE 0              TO TO-CTR.
           MOVE "00"           TO SCREEN-STATUS.
           IF SCREEN-SW = "Y"
             CLOSE             TERMINAL-FILE
             MOVE SPACES       TO PARM1
             STRING "OVRDSPF   FILE(ZSCREEN) TOFILE("
                               SCREEN-FILE ")"
                  DELIMITED BY SIZE INTO PARM1
             CALL "QCMDEXC"    USING PARM1 PARM2
             MOVE "N"          TO SCREEN-SW
             OPEN I-O          TERMINAL-FILE.

       SHOW-SCREEN.
           IF TIMEOUT-VAL-X = SPACES
               MOVE 0          TO TIMEOUT-VAL.
           IF TIMEOUT-VAL < 0
               MOVE 0          TO TIMEOUT-VAL.
           IF TIMEOUT-VAL = 0
               MOVE " "        TO TIMEOUT-SW.
           IF TIMEOUT-SW NOT = " "
               MOVE "X"        TO TIMEOUT-SW
               MOVE B"1"       TO IND (97)
               COMPUTE TO-CYCLE = (TIMEOUT-VAL / 5.0).

           MOVE SCREEN-BUFFER  TO TERMINAL-REC.

       WRITE-REWRITE.
           WRITE TERMINAL-REC  FORMAT IS SCREEN-NAME
                 INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
             GO TO END-PAR.

           IF TIMEOUT-ON
               ADD 1           TO TO-CTR
               IF TO-CTR NOT > TO-CYCLE
                   CALL "MCXWAIT5"
                   READ  TERMINAL-FILE TERMINAL TERMINAL-ID
                       INDIC ARE SCREEN-INDICATORS
                       NO DATA GO TO WRITE-REWRITE
               ELSE
                   MOVE "TO"   TO SCREEN-STATUS
                   MOVE 0      TO KEY-HIT
                   GO TO END-READ-CYCLE
           ELSE
           READ  TERMINAL-FILE FORMAT IS SCREEN-NAME
                 INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
             GO TO END-PAR.

       END-READ-CYCLE.
           MOVE TERMINAL-REC   TO SCREEN-BUFFER.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

       END-PAR.
           GOBACK.
