       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TSELEQP.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZSCHDULE-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

           SELECT OUT-FILE
                  ASSIGN       TO DATABASE-OUTSELEQ
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE  IS RANDOM
                  RELATIVE KEY IS ACT-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT SORT-FILE
                  ASSIGN       TO DISK-SORTFILE.

           SELECT WO-CRAFTS-REQD
                  ASSIGN       TO DATABASE-MCFLMM0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-PLANNED
                  ASSIGN       TO DATABASE-MCFLMM1101
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-SCHEDULE
                  ASSIGN       TO DATABASE-MCFLMM2303
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS       ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       FD  OUT-FILE RECORD     CONTAINS 70 CHARACTERS
           LABEL RECORDS       ARE OMITTED
           DATA RECORD         IS OUT-REC.
       01  OUT-REC.
           05  OUT-DATA.
               10  OUT-ZP.
                   15  OUT-Z                 PIC X(4).
                   15  OUT-P                 PIC X(2).
               10  OUT-WO                    PIC X(10).
               10  OUT-EQ-NUM                PIC X(6).
               10  OUT-DATE.
                   15  OUT-CC                PIC X(02).
                   15  OUT-YY                PIC X(02).
                   15  OUT-MM                PIC X(02).
                   15  OUT-DD                PIC X(02).
               10  OUT-SHFT.
                   15  OUT-SHIFT             PIC X.
                   15  OUT-SORT-SHIFT        PIC X.
               10  OUT-QTY                   PIC X(02).
               10  OUT-CRAFT                 PIC X(02).
               10  OUT-HOURS.
                   15  OUT-HRS               PIC X(03).
                   15  OUT-TENTHS            PIC X.
               10  OUT-REM                   PIC X(30).

       SD  SORT-FILE RECORD CONTAINS 70 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-ZP.
               10  SORT-Z                     PIC X(4).
               10  SORT-P                     PIC X(2).
           05  SORT-WO                        PIC X(10).
           05  SORT-EQ-NUM.
               10  SORT-EQ1                   PIC X.
               10  SORT-EQ2                   PIC X.
               10  SORT-EQ3                   PIC X.
               10  SORT-EQ4                   PIC X.
               10  SORT-EQ5                   PIC X.
               10  SORT-EQ6                   PIC X.
           05  SORT-DATE.
               10  SORT-CC                    PIC X(02).
               10  SORT-YY                    PIC X(02).
               10  SORT-MM                    PIC X(02).
               10  SORT-DD                    PIC X(02).
           05  SORT-SHFT.
               10  SORT-SHIFT                 PIC X.
               10  SORT-SORT-SHIFT            PIC X.
           05  SORT-QTY                       PIC X(02).
           05  SORT-CRAFT                     PIC X(02).
           05  SORT-HOURS.
               10  SORT-HRS                   PIC X(03).
               10  SORT-TENTHS                PIC X.
           05  SORT-REM                       PIC X(30).

       FD  WO-CRAFTS-REQD
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.

       FD  WO-PLANNED
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  WO-SCHEDULE
           LABEL RECORDS       ARE STANDARD
           DATA RECORD         IS WSFREC.
       01  WSFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM2303.

       WORKING-STORAGE SECTION.
       77  ACT-KEY             PIC 9(09).
       77  CRAFT-KEY           PIC XX.
       77  DATE-HOLD           PIC X(08)  VALUE SPACES.
       77  EOF-SW              PIC 9.
       77  FIELD-CTR           PIC 99    VALUE 0.
       77  FIELD-HOLD          PIC X(79).
       77  MAX-KEY             PIC 9(05).
       77  PAGE-HD             PIC 999.
       77  SHIFT-HOLD          PIC X     VALUE SPACE.
       77  SKILL-DATA          PIC XX.
       77  WO-NUM-HOLD         PIC X(10) VALUE SPACES.
       77  ERROR-BUFFER        PIC X(80).
       77  TRUE-VAL            PIC 1 VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TSELEQP ".
           05  PROGRAM-TYPE        PIC X(02) VALUE "IN".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " J0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "PLANNED W/O ".
                   15  FILLER      PIC X(17) VALUE "SCHEDULE INQUIRY ".
                   15  FILLER      PIC X(09) VALUE "BY LOCAL ".
                   15  FILLER      PIC X(22) VALUE "EQUIPMENT NUMBER".
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F3 ".
                   15  FILLER      PIC X(15) VALUE "KEY OF THE PWO ".
                   15  FILLER      PIC X(17) VALUE "SCHEDULE INQUIRY ".
                   15  FILLER      PIC X(11) VALUE "MENU ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05  FILE-STAT-1     PIC X.
           05  FILE-STAT-2     PIC X.

       01  CUR-DATE-WA.
           05  CUR-DATE-YY     PIC XX.
           05  CUR-DATE-MM     PIC XX.
           05  CUR-DATE-DD     PIC XX.

       01  TIME-BUFFER.
           05  CUR-TIME.
               10  CUR-HRS     PIC XX.
               10  CUR-MINS    PIC XX.
           05  CUR-SECS        PIC XX.

       01  DATA-LINE-1.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  DATE-SCH.
               10  SCH-MM      PIC XX.
               10  SLASH1      PIC X.
               10  SCH-DD      PIC XX.
               10  SLASH2      PIC X.
               10  SCH-YY      PIC XX.
           05  FILLER          PIC X(03) VALUE SPACES.
           05  WO-NUM-SCH.
               10  WO-6        PIC X(06).
               10  WO-Y        PIC X.
               10  WO-S        PIC X(03).
           05  FILLER          PIC X(04) VALUE SPACES.
           05  EQP-SCH         PIC X(06).
           05  FILLER          PIC X(07) VALUE SPACES.
           05  DESC-SCH        PIC X(30).
           05  FILLER          PIC X(09) VALUE SPACE.

       01  DATA-LINE-2.
           05  FILLER          PIC X(04) VALUE SPACES.
           05  SHIFT-HD        PIC X(07) VALUE SPACES.
           05  SHIFT-SCH       PIC X.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  QTY-SCH         PIC Z9.
           05  FILLER          PIC X(02) VALUE SPACES.
           05  CRAFT-SCH       PIC XX.
           05  FILLER          PIC X(05) VALUE " FOR ".
           05  HOURS-SCH.
               10  HR-3        PIC ZZ9.
               10  HR-DOT      PIC X.
               10  HR-T        PIC 9.
           05  FILLER          PIC X(08) VALUE " HOURS. ".
           05  REMS-HD         PIC X(08).
           05  FILLER          PIC X(02) VALUE SPACES.
           05  REMS-SCH        PIC X(30).
           05  FILLER          PIC X     VALUE SPACE.

       01  HEAD-1.
           05  FILLER          PIC X(17) VALUE "          DATE:  ".
           05  DATE-HD.
               10  D-MM        PIC X(02) VALUE SPACES.
               10  D-SL1       PIC X(01) VALUE "/".
               10  D-DD        PIC X(02) VALUE SPACES.
               10  D-SH2       PIC X(01) VALUE "/".
               10  D-YY        PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(18) VALUE "           TIME:  ".
           05  TIME-HD.
               10  T-HR        PIC X(02) VALUE SPACES.
               10  T-COL       PIC X(01) VALUE ":".
               10  T-MN        PIC X(02) VALUE SPACES.
           05  FILLER          PIC X(18) VALUE "           PAGE:  ".
           05  PAGE-HD-Z       PIC ZZ9.
           05  FILLER          PIC X(10) VALUE SPACES.

       01  HEAD-2.
           05  FILLER          PIC X(13) VALUE SPACES.
           05  FILLER          PIC X(16) VALUE "P L A N N E D   ".
           05  FILLER          PIC X(22) VALUE "W O R K   O R D E R   ".
           05  FILLER          PIC X(15) VALUE "S C H E D U L E".
           05  FILLER          PIC X(13) VALUE SPACES.

       01  HEAD-3.
           05  FILLER          PIC X(13) VALUE "    DATE     ".
           05  FILLER          PIC X(13) VALUE "W/O NUMBER   ".
           05  FILLER          PIC X(14) VALUE "EQUIPMENT     ".
           05  FILLER          PIC X(12) VALUE "DESCRIPTION:".
           05  FILLER          PIC X(27) VALUE SPACES.

       01  HEAD-4.
           05  FILLER          PIC X(79) VALUE ALL "=".

       01  E-DATE.
           05  E-DATE-CC       PIC 99.
           05  E-DATE-YY       PIC 99.
           05  E-DATE-MM       PIC 99.
           05  E-DATE-DD       PIC 99.

       01  S-DATE.
           05  S-DATE-CC       PIC 99.
           05  S-DATE-YY       PIC 99.
           05  S-DATE-MM       PIC 99.
           05  S-DATE-DD       PIC 99.

       01  SCREEN-DATA.
           05  FIELD-1         PIC X(79).
           05  FIELD-2         PIC X(79).
           05  FIELD-3         PIC X(79).
           05  FIELD-4         PIC X(79).
           05  FIELD-5         PIC X(79).
           05  FIELD-6         PIC X(79).
           05  FIELD-7         PIC X(79).
           05  FIELD-8         PIC X(79).
           05  FIELD-9         PIC X(79).
           05  FIELD-10        PIC X(79).
           05  FIELD-11        PIC X(79).
           05  FIELD-12        PIC X(79).
           05  FIELD-13        PIC X(79).
           05  FIELD-14        PIC X(79).
           05  FIELD-15        PIC X(79).
           05  FIELD-16        PIC X(79).
           05  FIELD-17        PIC X(79).
           05  FIELD-18        PIC X(79).
           05  FIELD-19        PIC X(79).
           05  FIELD-20        PIC X(79).
           05  FIELD-21        PIC X(79).
           05  FIELD-22        PIC X(79).
           05  SCREEN-MSG-LINE PIC X(79).
           05  SCREEN-CMD-LINE PIC X(79).
           05  SCREEN-ERR-LINE PIC X(79).

       01  SELECT-BUFFER.
           05  EQUIP-BUF.
               10  EQ1         PIC X.
               10  EQ2         PIC X.
               10  EQ3         PIC X.
               10  EQ4         PIC X.
               10  EQ5         PIC X.
               10  EQ6         PIC X.
           05  DAT1-BUF.
               10  DAT1-MM     PIC XX.
               10  DAT1-MM-9   REDEFINES DAT1-MM    PIC 99.
               10  DAT1-DD     PIC XX.
               10  DAT1-DD-9   REDEFINES DAT1-DD    PIC 99.
               10  DAT1-YY     PIC XX.
               10  DAT1-YY-9   REDEFINES DAT1-YY    PIC 99.
           05  DAT2-BUF.
               10  DAT2-MM     PIC XX.
               10  DAT2-MM-9   REDEFINES DAT2-MM    PIC 99.
               10  DAT2-DD     PIC XX.
               10  DAT2-DD-9   REDEFINES DAT2-DD    PIC 99.
               10  DAT2-YY     PIC XX.
               10  DAT2-YY-9   REDEFINES DAT2-YY    PIC 99.
           05  SHIFT-BUF       PIC X.
           05  CRAFT-BUF       PIC XX.
           05  SELECT-CMD-LINE PIC X(79).
           05  SELECT-ERR-LINE PIC X(79).

       01  SHIFT-DATA.
           05  ZONE-BUF        PIC X(04).
           05  TIME-IN.
               10  HRS-IN      PIC 99.
               10  MIN-IN      PIC 99.
           05  CODE-BUF        PIC X.
           05  SHIFTS.
               10  S-1         PIC 9999.
               10  E-1         PIC 9999.
               10  S-2         PIC 9999.
               10  E-2         PIC 9999.
               10  S-3         PIC 9999.
               10  E-3         PIC 9999.
               10  S-4         PIC 9999.
               10  E-4         PIC 9999.
           05  CURR-SHIFT      PIC 9.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

       01  WO-SCHED-DATA.
           COPY DWOSCHED       IN COPYLIB.

       01  WO-PLANNED-DATA.
           COPY DWOPLAN        IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION      USING DBPARAMETERS.
       BEGIN-PGM.
           CALL "TPWORD"       USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N"
               GOBACK.

           CALL "CLSELEQ".
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          WO-CRAFTS-REQD.
           OPEN INPUT          WO-PLANNED.
           OPEN INPUT          WO-SCHEDULE.

           MOVE 0              TO KEY-HIT EOF-SW ACT-KEY PAGE-HD.
           MOVE SPACES         TO SELECT-BUFFER ERROR-BUFFER.

           ACCEPT CUR-DATE-WA  FROM DATE.
           MOVE CUR-DATE-YY    TO D-YY.
           MOVE CUR-DATE-MM    TO D-MM.
           MOVE CUR-DATE-DD    TO D-DD.
           IF DATE-FLAG = 3
               MOVE CUR-DATE-DD TO D-MM
               MOVE CUR-DATE-MM TO D-DD.

       6-MAIN.
           MOVE "FSELEQP"      TO SCREEN-NAME.

       6-SHOWFORM.
           MOVE SELECT-BUFFER  TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.
           MOVE DISPLAY-REC    TO SELECT-BUFFER.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT NOT = 0
               GO TO 6-SHOWFORM.

           IF EQUIP-BUF = SPACES
               MOVE 31016          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(1) IND(99)
               GO TO 6-SHOWFORM.

           IF DAT1-BUF NOT = SPACES
               IF DAT1-BUF NOT NUMERIC
                   MOVE 35014          TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                   MOVE TRUE-VAL       TO IND(2) IND(99)
                   GO TO 6-SHOWFORM
               ELSE
                   NEXT SENTENCE
           ELSE
               MOVE 30028          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(2) IND(99)
               GO TO 6-SHOWFORM.

           IF DAT1-YY-9 IS NUMERIC
               IF DATE-FLAG = 1
                   IF DAT1-MM-9 > 0 AND DAT1-MM-9 < 13
                       IF DAT1-DD-9 > 0 AND DAT1-DD-9 < 32
                           NEXT SENTENCE
                       ELSE
                           MOVE 35030          TO CATREAD-MSG-NUMBER
                           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                           MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                           MOVE TRUE-VAL       TO IND(2) IND(99)
                           GO TO 6-SHOWFORM
                   ELSE
                       MOVE 35031          TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                       MOVE TRUE-VAL       TO IND(2) IND(99)
                       GO TO 6-SHOWFORM
               ELSE
               IF DAT1-MM-9 > 0 AND DAT1-MM-9 < 32
                   IF DAT1-DD-9 > 0 AND DAT1-DD-9 < 13
                       NEXT SENTENCE
                   ELSE
                       MOVE 35031          TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                       MOVE TRUE-VAL       TO IND(2) IND(99)
                       GO TO 6-SHOWFORM
               ELSE
                   MOVE 35030          TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                   MOVE TRUE-VAL       TO IND(2) IND(99)
                   GO TO 6-SHOWFORM
           ELSE
               MOVE 35032          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(2) IND(99)
               GO TO 6-SHOWFORM.

           IF DAT2-BUF = SPACES
               NEXT SENTENCE
           ELSE
           IF DAT2-BUF NOT NUMERIC
               MOVE 35012          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(3) IND(99)
               GO TO 6-SHOWFORM
           ELSE
           IF DAT2-YY-9 IS NUMERIC
               IF DATE-FLAG = 1
                   IF DAT2-MM-9 > 0 AND DAT2-MM-9 < 13
                       IF DAT2-DD-9 > 0 AND DAT2-DD-9 < 32
                           NEXT SENTENCE
                       ELSE
                           MOVE 35030          TO CATREAD-MSG-NUMBER
                           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                           MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                           MOVE TRUE-VAL       TO IND(3) IND(99)
                           GO TO 6-SHOWFORM
                   ELSE
                       MOVE 35031          TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                       MOVE TRUE-VAL       TO IND(3) IND(99)
                       GO TO 6-SHOWFORM
               ELSE
               IF DAT2-MM-9 > 0 AND DAT2-MM-9 < 32
                   IF DAT2-DD-9 > 0 AND DAT2-DD-9 < 13
                       NEXT SENTENCE
                   ELSE
                       MOVE 35031          TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                       MOVE TRUE-VAL       TO IND(3) IND(99)
                       GO TO 6-SHOWFORM
               ELSE
                   MOVE 35030          TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
                   MOVE TRUE-VAL       TO IND(3) IND(99)
                   GO TO 6-SHOWFORM
           ELSE
               MOVE 35032          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(3) IND(99)
               GO TO 6-SHOWFORM.

           MOVE DAT1-MM        TO S-DATE-MM.
           MOVE DAT1-DD        TO S-DATE-DD.
           MOVE DAT1-YY        TO S-DATE-YY.
           IF DATE-FLAG = 3
               MOVE DAT1-DD    TO S-DATE-MM
               MOVE DAT1-MM    TO S-DATE-DD.

           MOVE 20             TO S-DATE-CC
           IF DAT1-YY-9 > 70
               MOVE 19         TO S-DATE-CC.

           IF DAT2-BUF = SPACES
               MOVE "000000"   TO E-DATE
           ELSE
               MOVE DAT2-MM        TO E-DATE-MM
               MOVE DAT2-DD        TO E-DATE-DD
               MOVE DAT2-YY        TO E-DATE-YY
               MOVE 20         TO E-DATE-CC
               IF DAT2-YY-9 > 70
                   MOVE 19     TO E-DATE-CC
               END-IF
               IF DATE-FLAG = 3
                   MOVE DAT2-DD TO E-DATE-MM
                   MOVE DAT2-MM TO E-DATE-DD
               END-IF
               SUBTRACT 1          FROM S-DATE-DD
               ADD 1               TO E-DATE-DD.

           IF SHIFT-BUF = "1" OR "2" OR "3" OR "4" OR " "
               NEXT SENTENCE
           ELSE
               MOVE 35034          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(4) IND(99)
               GO TO 6-SHOWFORM.

           IF CRAFT-BUF = SPACES
               NEXT SENTENCE
           ELSE
           MOVE CRAFT-BUF      TO CRAFTREQD IN WCRFREC
           START WO-CRAFTS-REQD KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT
           END-START
           IF FILE-STAT NOT = "00"
               MOVE 35035          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-ERR-LINE
               MOVE TRUE-VAL       TO IND(5) IND(99)
               GO TO 6-SHOWFORM.

           MOVE 0              TO ACT-KEY.
           SORT SORT-FILE ASCENDING KEY SORT-DATE
                                        SORT-WO
                                        SORT-SORT-SHIFT
               INPUT PROCEDURE  7-SORT-INPUT-RECORDS
               OUTPUT PROCEDURE 8-SORT-WRITE-FILE.

           IF ACT-KEY = 0
               MOVE 40011          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SELECT-CMD-LINE
               MOVE SELECT-BUFFER  TO DISPLAY-REC
               MOVE TRUE-VAL       TO IND(98)
               GO TO 6-SHOWFORM.

           MOVE 0              TO ACT-KEY.
           CLOSE               OUT-FILE.
           OPEN INPUT          OUT-FILE.
           MOVE "FFULSCRN"     TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA ERROR-BUFFER.

       61-RESET-SCREEN.
           PERFORM 62-FILL-SCREEN THRU 62-FS-EXIT.

           IF EOF-SW = 0
               MOVE 42069          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SCREEN-MSG-LINE
           ELSE
               MOVE 31062          TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER   TO SCREEN-MSG-LINE.

           MOVE 66132          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER   TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA    TO DISPLAY-REC.
           MOVE "00"           TO SCREEN-STATUS.

           WRITE DISPLAY-REC   FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE  FORMAT IS SCREEN-NAME
                               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                               SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO END-OF-JOB.

           IF KEY-HIT = 2
               GO TO 6-MAIN.

           IF EOF-SW = 1
               GO TO END-OF-JOB.

           MOVE SPACES          TO SCREEN-DATA ERROR-BUFFER.
           GO TO 61-RESET-SCREEN.

       62-FILL-SCREEN.
           ADD 1               TO PAGE-HD.
           MOVE PAGE-HD        TO PAGE-HD-Z.
           MOVE SPACES         TO DATE-HOLD WO-NUM-HOLD SHIFT-HOLD.
           ACCEPT TIME-BUFFER  FROM TIME.
           MOVE CUR-HRS        TO T-HR.
           MOVE CUR-MINS       TO T-MN.
           MOVE HEAD-1         TO FIELD-1.
           MOVE HEAD-2         TO FIELD-2.
           MOVE HEAD-3         TO FIELD-3.
           MOVE HEAD-4         TO FIELD-4.
           MOVE 4              TO FIELD-CTR.

           PERFORM 62-READ-FILE THRU 62-RF-EXIT
                               UNTIL FIELD-CTR > 21.

       62-FS-EXIT.             EXIT.

       62-READ-FILE.
           ADD 1               TO ACT-KEY.
           IF ACT-KEY > MAX-KEY
               MOVE 1          TO EOF-SW
               MOVE 30         TO FIELD-CTR
               CLOSE           OUT-FILE
               GO TO 62-RF-EXIT.

           READ OUT-FILE       INVALID KEY
               MOVE 1          TO EOF-SW
               MOVE 30         TO FIELD-CTR
               CLOSE           OUT-FILE
               GO TO 62-RF-EXIT.

           PERFORM 62-WRITE-LINE.

       62-RF-EXIT.             EXIT.

       62-WRITE-LINE.
           IF OUT-DATE NOT = DATE-HOLD
               MOVE OUT-DATE   TO DATE-HOLD
               MOVE SPACES     TO WO-NUM-HOLD SHIFT-HOLD.

           IF OUT-WO = WO-NUM-HOLD
               NEXT SENTENCE
           ELSE
               MOVE OUT-MM     TO SCH-MM
               MOVE OUT-DD     TO SCH-DD
               MOVE OUT-YY     TO SCH-YY
               IF DATE-FLAG = 3
                   MOVE OUT-MM TO SCH-DD
                   MOVE OUT-DD TO SCH-MM
               END-IF
               MOVE "/"        TO SLASH1 SLASH2
               MOVE OUT-WO     TO WO-NUM-SCH WO-NUM-HOLD
               MOVE OUT-EQ-NUM TO EQP-SCH
               MOVE SPACES     TO SHIFT-HOLD
               MOVE SPACES     TO DESC-SCH
               PERFORM 62-GET-DESC THRU 62-GD-EXIT
               MOVE DATA-LINE-1 TO FIELD-HOLD
               PERFORM 62-WRITE-FIELDS.

           IF OUT-SHIFT NOT = SHIFT-HOLD
               MOVE OUT-SHIFT  TO SHIFT-SCH SHIFT-HOLD
               MOVE "SHIFT: "  TO SHIFT-HD
           ELSE
               MOVE SPACES     TO SHIFT-HD SHIFT-SCH.

           MOVE OUT-QTY        TO QTY-SCH.
           MOVE OUT-CRAFT      TO CRAFT-SCH.
           MOVE OUT-HRS        TO HR-3.
           MOVE "."            TO HR-DOT.
           MOVE OUT-TENTHS     TO HR-T.

           IF OUT-REM NOT = SPACES
               MOVE "REMARKS:" TO REMS-HD
               MOVE OUT-REM    TO REMS-SCH
           ELSE
               MOVE SPACES     TO REMS-HD REMS-SCH.

           MOVE DATA-LINE-2    TO FIELD-HOLD.
           PERFORM 62-WRITE-FIELDS.

       62-WRITE-FIELDS.
           ADD 1               TO FIELD-CTR.
           IF FIELD-CTR = 5
               MOVE FIELD-HOLD TO FIELD-5
           ELSE
           IF FIELD-CTR = 6
               MOVE FIELD-HOLD TO FIELD-6
           ELSE
           IF FIELD-CTR = 7
               MOVE FIELD-HOLD TO FIELD-7
           ELSE
           IF FIELD-CTR = 8
               MOVE FIELD-HOLD TO FIELD-8
           ELSE
           IF FIELD-CTR = 9
               MOVE FIELD-HOLD TO FIELD-9
           ELSE
           IF FIELD-CTR = 10
               MOVE FIELD-HOLD TO FIELD-10
           ELSE
           IF FIELD-CTR = 11
               MOVE FIELD-HOLD TO FIELD-11
           ELSE
           IF FIELD-CTR = 12
               MOVE FIELD-HOLD TO FIELD-12
           ELSE
           IF FIELD-CTR = 13
               MOVE FIELD-HOLD TO FIELD-13
           ELSE
           IF FIELD-CTR = 14
               MOVE FIELD-HOLD TO FIELD-14
           ELSE
           IF FIELD-CTR = 15
               MOVE FIELD-HOLD TO FIELD-15
           ELSE
           IF FIELD-CTR = 16
               MOVE FIELD-HOLD TO FIELD-16
           ELSE
           IF FIELD-CTR = 17
               MOVE FIELD-HOLD TO FIELD-17
           ELSE
           IF FIELD-CTR = 18
               MOVE FIELD-HOLD TO FIELD-18
           ELSE
           IF FIELD-CTR = 19
               MOVE FIELD-HOLD TO FIELD-19
           ELSE
           IF FIELD-CTR = 20
               MOVE FIELD-HOLD TO FIELD-20
           ELSE
           IF FIELD-CTR = 21
               MOVE FIELD-HOLD TO FIELD-21
           ELSE
           IF FIELD-CTR = 22
               MOVE FIELD-HOLD TO FIELD-22.

       62-GET-DESC.
           MOVE WO-NUM-HOLD    TO WONUM OF WPFREC.
           START WO-PLANNED    KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "****  DESCRIPTION NOT FOUND" TO DESC-SCH
               GO TO 62-GD-EXIT.

           READ WO-PLANNED     NEXT INTO WO-PLANNED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE "****  DESCRIPTION NOT FOUND" TO DESC-SCH
               GO TO 62-GD-EXIT.

           MOVE DESCRIPTION-1-P TO DESC-SCH.

       62-GD-EXIT.             EXIT.

       END-OF-JOB.
           CLOSE               DISPLAY-FILE.
           CLOSE               WO-CRAFTS-REQD.
           CLOSE               WO-PLANNED.
           CLOSE               WO-SCHEDULE.
           GOBACK.

       999-CATREAD.
           MOVE SPACES         TO ERROR-BUFFER.
           CALL "CCATREAD"     USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.

       999-CATREAD-EXIT.       EXIT.

       7-SORT-INPUT-RECORDS.
           PERFORM 7-SORT-MAIN THRU 7-SORT-M-EXIT.

       7-SORT-MAIN.
           MOVE SPACES         TO SORT-REC.
           MOVE EQUIP-BUF      TO EQPNUM OF WSFREC.
           START WO-SCHEDULE   KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 7-SORT-M-EXIT.

           PERFORM 70-SORT-DBGET THRU 70-SORT-DBGET-EXIT.

       7-SORT-M-EXIT.          EXIT.

       70-SORT-DBGET.
           READ WO-SCHEDULE    NEXT INTO WO-SCHED-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 70-SORT-DBGET-EXIT.

           IF EQUIP-BUF NOT = EQPNUM OF WSFREC
               GO TO 70-SORT-DBGET-EXIT.

           MOVE SCHED-EQ-NUM  TO SORT-EQ-NUM.
           IF EQ1 = SORT-EQ1 OR SPACES
             IF EQ2 = SORT-EQ2 OR SPACES
               IF EQ3 = SORT-EQ3 OR SPACES
                 IF EQ4 = SORT-EQ4 OR SPACES
                   IF EQ5 = SORT-EQ5 OR SPACES
                     IF EQ6 = SORT-EQ6 OR SPACES
                         NEXT SENTENCE
                     ELSE
                     GO TO 70-SORT-DBGET
                   ELSE
                   GO TO 70-SORT-DBGET
                 ELSE
                 GO TO 70-SORT-DBGET
               ELSE
               GO TO 70-SORT-DBGET
             ELSE
             GO TO 70-SORT-DBGET
           ELSE
           GO TO 70-SORT-DBGET.

           IF DAT2-BUF NOT = SPACES
               IF SCHED-DATE-CN > S-DATE AND
                  SCHED-DATE-CN < E-DATE
                   NEXT SENTENCE
               ELSE
                   GO TO 70-SORT-DBGET
           ELSE
           IF SCHED-DATE-CN = S-DATE
               NEXT SENTENCE
           ELSE
               GO TO 70-SORT-DBGET.

           MOVE SCHED-Z        TO ZONE-BUF.
           MOVE ZEROS          TO TIME-IN.
           CALL "TGETSHFT"     USING SHIFT-DATA DBPARAMETERS.

           IF SHIFT-BUF = SCHED-SHFT OR SPACES
             IF CRAFT-BUF = SCHED-CRAFT OR SPACES
               MOVE SCHED-ZP      TO SORT-ZP
               MOVE SCHED-WO      TO SORT-WO
               MOVE SCHED-EQ-NUM  TO SORT-EQ-NUM
               MOVE SCHED-DATE-CN TO SORT-DATE
               MOVE SCHED-SHFT    TO SORT-SHIFT
               MOVE SCHED-QTY     TO SORT-QTY
               MOVE SCHED-CRAFT   TO SORT-CRAFT
               MOVE SCHED-HOURS   TO SORT-HOURS
               MOVE SCHED-REM     TO SORT-REM
               IF SCHED-SHFT = "1"
                   MOVE "B"       TO SORT-SORT-SHIFT
                   RELEASE        SORT-REC
               ELSE
               IF SCHED-SHFT = "2"
                   MOVE "C"       TO SORT-SORT-SHIFT
                   RELEASE        SORT-REC
               ELSE
               IF SCHED-SHFT = "3"
                   IF CODE-BUF = "3"
                       MOVE "A"   TO SORT-SORT-SHIFT
                       RELEASE    SORT-REC
                   ELSE
                       MOVE "D"   TO SORT-SORT-SHIFT
                       RELEASE    SORT-REC
               ELSE
                   MOVE "A"       TO SORT-SORT-SHIFT
                   RELEASE        SORT-REC.

           GO TO 70-SORT-DBGET.

       70-SORT-DBGET-EXIT.     EXIT.

       8-SORT-WRITE-FILE.
           MOVE 0              TO ACT-KEY.
           OPEN OUTPUT         OUT-FILE.
           PERFORM 8-SWF-LOOP  THRU 8-SWF-EXIT.

       8-SWF-LOOP.
           RETURN SORT-FILE    AT END
               MOVE ACT-KEY    TO MAX-KEY
               GO TO 8-SWF-EXIT.

           ADD 1               TO ACT-KEY.
           MOVE SORT-REC       TO OUT-DATA.
           WRITE OUT-REC       INVALID KEY
               GO TO 8-SWF-EXIT.
           GO TO 8-SWF-LOOP.

       8-SWF-EXIT.             EXIT.

