       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TSEQUPD.
       AUTHOR.        CA YODER.

      ***************************************************************
      **                                                           **
      **  TSEQUPD -- UTILITY PROGRAM FOR UPDATING THE RECEIVING    **
      **             SLIP SEQUENCE NUMBER FOR KELLY PLANTS.        **
      **             WHEN DUPLICATE SEQUENCE NUBMERS EXIST, THE    **
      **             BATCH RECEIVING PROCESS WILL NOT WORK.  IN    **
      **             ORDER TO MAKE THE SEQUENCE NUMBERS UNIQUE,    **
      **             A "9" WILL BE INSERTED AS THE FIRST DIGIT     **
      **             OF THE SEQUENCE NUMBER.                       **
      **                                                           **
      ***************************************************************
      *
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       SPECIAL-NAMES.   I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                        LOCAL-DATA IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSEQUPD-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPORCV-O
                  ASSIGN TO DATABASE-MCFLCS0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MPORCV2-I
                  ASSIGN TO DATABASE-MCFLCS0102
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

003600 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZSEQUPD.

       FD  MPORCV-O
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0101.

       FD  MPORCV2-I
           LABEL RECORDS ARE STANDARD.
       01  MPORCV-REC2-I.
           COPY DDS-MCRPCS0100  OF MCFLCS0102.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.


       WORKING-STORAGE SECTION.
       77  UPDATE-SW                    PIC X.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  MESSAGE-BUFFER.
           05  MSG-TEXT               PIC X(64)  VALUE SPACES.
           05  MSG-FLD                PIC X(12)  VALUE SPACES.
           05  MSG-FLD-9 REDEFINES MSG-FLD
                                      PIC Z(11)9.

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MPLTINFO IN COPYLIB.

       COPY MPORCV IN COPYLIB.

       COPY DATAB IN COPYLIB.

       01  ARG-VALUES.
           05  PLT-ARG                  PIC X(4)  VALUE SPACES.
           05  PO-ARG                   PIC X(14) VALUE SPACES.

       01  BUILD-PO-NUM.
           05  FILLER                   PIC X(1)  VALUE "P".
           05  BUILD-PO-REL-RCV.
               10  PO-NUM-REL           PIC X(10).
               10  PO-NUM-RCV           PIC X(3).

      *--------- SCREEN INFORMATION.
       01  RCVR-SCREEN.
           05  SC-PO-REL-RCV.
               10  SC-PO-NUM            PIC X(7).
               10  SC-PO-REL            PIC 9(3).
               10  SC-PO-RCV            PIC 9(3).
           05  SC-SEQ-NUM               PIC X(6).
           05  SC-OPTION                PIC X.
           05  SC-MSG1                  PIC X(79).
           05  SC-MSG2                  PIC X(79).
           05  SC-MSGLINE               PIC X(79).

       COPY TBLOWUP IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.

       COPY PLANTS IN COPYLIB.

       PROCEDURE DIVISION.

       PROC-DIV SECTION 01.


       1-BEGIN.
           PERFORM 1-HSK THRU 1-H-X.

      *-------- THIS FUNCTION ONLY AVAILABLE TO KELLY PLANTS.
           IF KELLY-PLANT
               PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.

           OPEN INPUT MPLTINFO-I, MPORCV2-I.
           OPEN I-O MPORCV-O, DISPLAY-FILE.
           MOVE "N" TO UPDATE-SW.

      ******************************************
      *   GET CO. CODE FROM MPLTINFO
      ******************************************

           MOVE "P 01"       TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET MPLTINFO 'P 01' *1-HSK" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP
           ELSE
               MOVE MPLTINFO-COMPANY  TO  WHICH-PLANT.

       1-H-X.
           EXIT.


       2-EOJ.
           CLOSE MPORCV-O, MPORCV2-I, MPLTINFO-I, DISPLAY-FILE.


       2-EOJ-X.
           EXIT.

       2-BLOWUP.
           MOVE "TUPDSEQ"  TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                   BU-DISPLAY-FLDS.

      **************************************************
      *     6 - M A I N                                *
      **************************************************

       6-MAIN.
           MOVE "RCVSCRN" TO VIEW-NFNAME.

       6-PUT-BUFFER.
           MOVE SPACES            TO RCVR-SCREEN.
           MOVE ZEROS             TO SC-PO-REL
                                     SC-PO-RCV.
           MOVE B"0"              TO IND(10).
           IF UPDATE-SW = "Y"
               MOVE "SEQUENCE NUMBER UPDATED"
                                  TO SC-MSGLINE
               MOVE SPACES        TO SC-MSG1
                                     SC-MSG2
               MOVE B"1"          TO IND(99).
           MOVE "N"               TO UPDATE-SW.

       6-SHOW-FORM.
           MOVE RCVR-SCREEN       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC       TO RCVR-SCREEN.

       6-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-M-X.

           IF SC-PO-NUM = SPACES
      ***  RECEIVING SLIP DOESN'T EXIST ***
               MOVE  18  TO LANG-SETNUM
               MOVE  65  TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SC-MSGLINE
               MOVE SPACES         TO SC-MSG1
                                      SC-MSG2
               MOVE B"1"           TO IND(99)  IND(01)
               GO TO 6-SHOW-FORM.

           IF SC-PO-RCV = 0
      ***  ENTER A RECEIVING SLIP NUMBER ***
               MOVE  18  TO LANG-SETNUM
               MOVE  66  TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO SC-MSGLINE
               MOVE SPACES         TO SC-MSG1
                                      SC-MSG2
               MOVE B"1"           TO IND(99)  IND(03)
               GO TO 6-SHOW-FORM.

           MOVE SC-PO-REL-RCV           TO  BUILD-PO-REL-RCV.
           MOVE BUILD-PO-NUM            TO  PO-ARG.
           MOVE PO-ARG TO PORCVNO OF MPORCV-REC-O.
           READ MPORCV-O INTO BUF-MPORCV
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
      ***  RECEIVING SLIP DOESN'T EXIST  ***
                   MOVE  18  TO LANG-SETNUM
                   MOVE  65  TO LANG-MSGNUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE SPACES         TO SC-MSG1
                                          SC-MSG2
                   MOVE MESSAGE-BUFFER TO SC-MSGLINE
                   MOVE B"1"           TO IND(99), IND(1)
                   GO TO 6-SHOW-FORM
               ELSE
                   MOVE "FIND MPORCV * 6-MAIN" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           IF M-PO-RCV-SEQ NOT NUMERIC
               MOVE SPACES         TO SC-MSG1
                                      SC-MSG2
               MOVE "CANNOT UPDATE SEQUENCE NUMBER--NOT NUMERIC"
                                   TO SC-MSGLINE
               MOVE B"1"           TO IND(99), IND(1)
               GO TO 6-SHOW-FORM.

           IF M-PO-RCV-SEQ (1:1) = "9"
               MOVE SPACES         TO SC-MSG1
                                      SC-MSG2
               MOVE "CANNOT UPDATE SEQUENCE NUMBER--ALREADY BEGINS WITH
      -             "9"
                                   TO SC-MSGLINE
               MOVE B"1"           TO IND(99), IND(1)
               GO TO 6-SHOW-FORM.


       61-SHOW-FORM.
           MOVE M-PO-RCV-SEQ      TO SC-SEQ-NUM.
           MOVE "Y"               TO SC-OPTION.
           MOVE B"1"              TO IND(10).
           MOVE RCVR-SCREEN       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC       TO RCVR-SCREEN.

       61-READ-FIELDS.
           IF VIEW-LASTKEY = 3
               GO TO 6-M-X.

           IF SC-OPTION = "Y"
               MOVE "9"           TO M-PO-RCV-SEQ (1:1)
               MOVE M-PO-RCV-SEQ TO PORCVSEQ OF MPORCV-REC2-I
               READ MPORCV2-I
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-READ
               IF FILE-STATUS = "00"
                   MOVE SPACES         TO SC-MSG1
                                          SC-MSG2
                   MOVE "CANNOT UPDATE SEQUENCE NUMBER--ALREADY EXISTS"
                                       TO SC-MSGLINE
                   MOVE B"1"           TO IND(99), IND(1)
                   GO TO 6-SHOW-FORM
               END-IF
               REWRITE MPORCV-REC-O FROM BUF-MPORCV
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-REWRITE
               MOVE "Y"                TO UPDATE-SW.

           GO TO 6-PUT-BUFFER.

       6-M-X.
           EXIT.

        COPY DISPCALL IN COPYLIB.
      *********************************************************
       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.
           EXIT.
