       IDENTIFICATION DIVISION.
       PROGRAM-ID. TSHIFTCT.
      *REMARKS.    THIS PROGRAM READS WO-BASIC (MCFPMM1000) AND
      *C           WO-PLANNED (MCFPMM1100) TO OBTAIN A COUNT OF
      *C           THE WORK ORDERS THAT FALL WITHIN THE DATE
      *C           RANGE THAT WAS SPECIFIED BY THE USER ON THE
      *C           INPUT SCREEN OR VIA A BATCH JOB. A REPORT
      *C           IS PRODUCED TO SHOW THE TOTALS.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.
           SELECT SHIFT-STRUCTURE
               ASSIGN TO DATABASE-MCFLMM2501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT SORT-FILE ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
           SELECT WO-PLANNED
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  ONLINE-PRT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 80 CHARACTERS
           DATA RECORD IS PRINT-RCD.
       01  PRINT-RCD.
           05  PRINT-LINE           PIC X(80).
       FD  SHIFT-STRUCTURE
           LABEL RECORDS ARE STANDARD.
       01  SS-REC.
           COPY DDS-ALL-FORMSTA OF MCFLMM2501.
       SD  SORT-FILE
           RECORD CONTAINS 100 CHARACTERS
           DATA RECORD IS SORT-REC.
       01  SORT-REC.
           05  SORT-ZONE            PIC X(4).
           05  SORT-TOTB            PIC 9(4).
           05  SORT-TOTP            PIC 9(4).
           05  SORT-SHF1V           PIC 9(4).
           05  SORT-SHF1P           PIC 9(4).
           05  SORT-SHF2V           PIC 9(4).
           05  SORT-SHF2P           PIC 9(4).
           05  FILLER               PIC X(72).
       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  WBF-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-PLANNED
           LABEL RECORDS ARE STANDARD.
       01  WBF-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       77  B-SW                     PIC 9.
       77  LINE-CTR                 PIC 99.
       77  SUB                      PIC 9(4) COMP-3.
       01  BLOWUP-BASE              PIC X(16).
       01  CDATE.
           05 YY                    PIC 99.
           05 MM                    PIC 99.
           05 DD                    PIC 99.
       01  COUNTS-TABLE.
           05  ZONE-COUNTS OCCURS 25 TIMES.
               10  ZONET            PIC X(4).
               10  TOTB-CTR         PIC 9(5).
               10  TOTP-CTR         PIC 9(5).
               10  SHIFT-CTRS OCCURS 2.
                   15  B-CTR        PIC 9(5).
                   15  P-CTR        PIC 9(5).
       COPY DATAB    IN COPYLIB.
       01  DATE-TIME-LOW.
           05  DATE-LOW-CC          PIC 99.
           05  DATE-LOW-YY          PIC 99.
           05  DATE-LOW-MM          PIC 99.
           05  DATE-LOW-DD          PIC 99.
           05  TIME-LOW-HHMM        PIC 9(4).
       01  DATE-TIME-LOW-1.
           05  DATE-LOW-CC-1        PIC 99.
           05  DATE-LOW-YY-1        PIC 99.
           05  DATE-LOW-MM-1        PIC 99.
           05  DATE-LOW-DD-1        PIC 99.
           05  TIME-LOW-HHMM-1      PIC 9(4).
       01  DATE-TIME-LOW-2.
           05  DATE-LOW-CC-2        PIC 99.
           05  DATE-LOW-YY-2        PIC 99.
           05  DATE-LOW-MM-2        PIC 99.
           05  DATE-LOW-DD-2        PIC 99.
           05  TIME-LOW-HHMM-2      PIC 9(4).
       01  DATE-TIME-HIGH.
           05  DATE-HIGH-CC         PIC 99.
           05  DATE-HIGH-YY         PIC 99.
           05  DATE-HIGH-MM         PIC 99.
           05  DATE-HIGH-DD         PIC 99.
           05  TIME-HIGH-HHMM       PIC 9(4).
       01  DATE-TIME-HIGH-1.
           05  DATE-HIGH-CC-1       PIC 99.
           05  DATE-HIGH-YY-1       PIC 99.
           05  DATE-HIGH-MM-1       PIC 99.
           05  DATE-HIGH-DD-1       PIC 99.
           05  TIME-HIGH-HHMM-1     PIC 9(4).
       01  DATE-TIME-HIGH-2.
           05  DATE-HIGH-CC-2       PIC 99.
           05  DATE-HIGH-YY-2       PIC 99.
           05  DATE-HIGH-MM-2       PIC 99.
           05  DATE-HIGH-DD-2       PIC 99.
           05  TIME-HIGH-HHMM-2     PIC 9(4).
       01  DDATE.
           05 DMM                   PIC 99.
           05 FILLER                PIC X      VALUE "/".
           05 DDD                   PIC 99.
           05 FILLER                PIC X      VALUE "/".
           05 DYY                   PIC 99.
       01  DETAIL-1.
           05  D1-ZONE              PIC X(04)  VALUE SPACES.
           05  FILLER               PIC X(03)  VALUE SPACES.
           05  D1-VCT               PIC Z(4)9.
           05  FILLER               PIC X(04)  VALUE SPACES.
           05  D1-PCT               PIC Z(4)9.
           05  FILLER               PIC X(04)  VALUE SPACES.
           05  D1-SHIFT1V           PIC Z(4)9.
           05  FILLER               PIC X(04)  VALUE SPACES.
           05  D1-SHIFT2V           PIC Z(4)9.
           05  FILLER               PIC X(04)  VALUE SPACES.
           05  D1-SHIFT1P           PIC Z(4)9.
           05  FILLER               PIC X(04)  VALUE SPACES.
           05  D1-SHIFT2P           PIC Z(4)9.
           05  FILLER               PIC X(23)  VALUE SPACES.
       01  FILE-STATUS              PIC XX.
       01  HEADER-0.
           05  FILLER               PIC X(21)
               VALUE "WORK ORDERS FOR ZONE ".
           05  H0-ZONE              PIC X(4)  VALUE SPACES.
           05  FILLER               PIC X(2)  VALUE SPACES.
           05  FILLER               PIC X(18)
               VALUE "WITHIN DATE RANGE ".
           05  H0-DATFR             PIC X(6)  VALUE SPACES.
           05  FILLER               PIC X     VALUE "-".
           05  H0-DATTO             PIC X(6)  VALUE SPACES.
           05  FILLER               PIC X(12) VALUE SPACES.
           05  H0-DATE              PIC X(8)  VALUE SPACES.
           05  FILLER               PIC XX    VALUE SPACES.
       01  HEADER-1.
           05  FILLER               PIC X(04) VALUE "ZONE".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(06) VALUE "VERBAL".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(07) VALUE "PLANNED".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(07) VALUE "VERBAL1".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(07) VALUE "VERBAL2".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(07) VALUE "PLANND1".
           05  FILLER               PIC X(02) VALUE SPACES.
           05  FILLER               PIC X(07) VALUE "PLANND2".
           05  FILLER               PIC X(23) VALUE SPACES.
       01  HEADER-U.
           05  FILLER               PIC X(80) VALUE ALL "-".
       COPY IOFEEDBACK IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.
       01  SHIFT-STRUCTURE-DATA.    COPY MSHFTSTR IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TDATECHK   IN COPYLIB.
       01  TEMP-TIME                PIC X(4).
       01  TEMP-ZONE                PIC X(4).
       COPY VCOMLINK   IN COPYLIB.
       01  WO-BASIC-DATA.           COPY DWOBASIC IN COPYLIB.
       01  WO-PLANNED-DATA.         COPY DWOPLAN  IN COPYLIB.
       01  WORK-REC.
           05  WORK-ZONE            PIC X(4).
           05  WORK-DATE-IN.
               10  WDI-MM           PIC 99.
               10  WDI-DD           PIC 99.
               10  WDI-YY           PIC 99.
           05  TIME-IN              PIC 9(4).
           05  WORK-DATE-OUT.
               10  WDO-MM           PIC 99.
               10  WDO-DD           PIC 99.
               10  WDO-YY           PIC 99.
           05  TIME-OUT             PIC 9(4).
           05  FILLER               PIC X(56).
       01  ZONE-ARG                 PIC X(4).
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  OPTION-REC            PIC X(80).

       PROCEDURE DIVISION USING HD-ROUTE-DATA, OPTION-REC.
       START-PGM SECTION.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X.
       2-EOJ.
           CLOSE SHIFT-STRUCTURE.
           CLOSE WO-BASIC.
           CLOSE WO-PLANNED.
           CLOSE ONLINE-PRT.
           GOBACK.
       2-BLOWUP.
           MOVE "TSHIFTCT" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.
       1-HSK.
           OPEN INPUT  SHIFT-STRUCTURE.
           OPEN INPUT  WO-BASIC.
           OPEN INPUT  WO-PLANNED.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT ONLINE-PRT.
           MOVE SPACES TO COUNTS-TABLE.
           PERFORM 11-SET-TABLE THRU 11-ST-X.
           MOVE OPTION-REC     TO WORK-REC.
           ACCEPT CDATE        FROM DATE.
           MOVE MM             TO DMM
                                  DATE-LOW-MM
                                  DATE-HIGH-MM.
           MOVE DD             TO DDD
                                  DATE-LOW-DD
                                  DATE-HIGH-DD.
           MOVE YY             TO DYY
                                  DATE-LOW-YY
                                  DATE-HIGH-YY.
           IF DATE-HIGH-YY > 70
               MOVE 19         TO DATE-HIGH-CC
                                  DATE-LOW-CC
           ELSE
           MOVE 20             TO DATE-HIGH-CC
                                  DATE-LOW-CC.
           IF DD > 01
               SUBTRACT 1 FROM DD GIVING DATE-LOW-DD
           ELSE
           IF MM > 01
               SUBTRACT 1 FROM MM GIVING DATE-LOW-MM
               IF MM = 01 OR 03 OR 05 OR 07 OR 08 OR
                   10 OR 12
                   MOVE 31 TO DATE-LOW-DD
               ELSE
               IF MM = 02
                   MOVE 28 TO DATE-LOW-DD
               ELSE
               MOVE 30 TO DATE-LOW-DD
           ELSE
           IF YY > 01
               SUBTRACT 1 FROM YY GIVING DATE-LOW-YY.
           MOVE "0000" TO TIME-LOW-HHMM.
           MOVE "2359" TO TIME-HIGH-HHMM.
           IF WORK-DATE-IN = SPACES
               NEXT SENTENCE
           ELSE
           MOVE WDI-MM TO DATE-LOW-MM
           MOVE WDI-DD TO DATE-LOW-DD
           MOVE WDI-YY TO DATE-LOW-YY
           IF TIME-IN = SPACES
               NEXT SENTENCE
           ELSE
           MOVE TIME-IN TO TIME-LOW-HHMM.
           IF WORK-DATE-OUT = SPACES
               NEXT SENTENCE
           ELSE
           MOVE WDO-MM TO DATE-HIGH-MM
           MOVE WDO-DD TO DATE-HIGH-DD
           MOVE WDO-YY TO DATE-HIGH-YY
           IF TIME-OUT = SPACES
               NEXT SENTENCE
           ELSE
           MOVE TIME-OUT TO TIME-HIGH-HHMM.

           DISPLAY "DATE-TIME-LOW  = " DATE-TIME-LOW.
           DISPLAY "DATE-TIME-HIGH = " DATE-TIME-HIGH.

           MOVE 62 TO LINE-CTR.
           MOVE 0 TO SUB.
           MOVE 0 TO B-SW.
           MOVE SPACES TO TEMP-ZONE.

       11-SET-TABLE.
           READ SHIFT-STRUCTURE NEXT INTO SHIFT-STRUCTURE-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 11-ST-X.
           IF SHIFT-ZONE = "MAST" OR "CLRL" GO TO 11-SET-TABLE.
           ADD 1           TO SUB.
           IF SUB > 25 GO TO 11-ST-X.
           MOVE SHIFT-ZONE TO ZONET (SUB).
           MOVE ZEROES     TO B-CTR (SUB, 1)
                              B-CTR (SUB, 2)
                              P-CTR (SUB, 1)
                              P-CTR (SUB, 2)
                              TOTB-CTR (SUB)
                              TOTP-CTR (SUB).
           GO TO 11-SET-TABLE.
       11-ST-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.

       6-MAIN.
           SORT SORT-FILE ON ASCENDING KEY SORT-ZONE
               INPUT  PROCEDURE 7-INPUT-RECORDS
               OUTPUT PROCEDURE 8-WRITE-OUTPUT.
       6-MAIN-X.    EXIT.

       7-INPUT-RECORDS SECTION.
       7-READ-BASIC.
           READ WO-BASIC NEXT INTO WO-BASIC-DATA
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 11 TO COND-WORD.
           IF COND-WORD = 11
               MOVE 0 TO COND-WORD
               MOVE 0 TO B-SW
               GO TO 7-READ-PLANNED-TOO.
           IF WORK-ZONE = "ALL "
               IF ZONE = "    "
                   GO TO 7-READ-BASIC
               ELSE
               NEXT SENTENCE
           ELSE
           IF ZONE = WORK-ZONE
               NEXT SENTENCE
           ELSE
           GO TO 7-READ-BASIC.
           IF DATE-TIME-COMP NOT LESS THAN DATE-TIME-LOW
              AND DATE-TIME-COMP NOT GREATER THAN DATE-TIME-HIGH
                  MOVE ZONE      TO TEMP-ZONE
                  MOVE TIME-COMP TO TEMP-TIME
                  MOVE 1         TO B-SW
                  PERFORM 70-SET-CTRS
                      VARYING SUB FROM 1 BY 1 UNTIL SUB > 25.
           GO TO 7-READ-BASIC.
       7-READ-PLANNED-TOO.
           READ WO-PLANNED NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 11 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               MOVE 11 TO COND-WORD.
           IF COND-WORD = 11
               MOVE 0           TO SUB
               PERFORM 7-RELEASE-SORT-REC THRU 7-RSR-X
               GO TO 7-IR-X.
           IF WORK-ZONE = "ALL "
               IF ZONE-P = "    "
                   GO TO 7-READ-PLANNED-TOO
               ELSE
               NEXT SENTENCE
           ELSE
           IF ZONE-P = WORK-ZONE
               NEXT SENTENCE
           ELSE
           GO TO 7-READ-PLANNED-TOO.
           IF DATE-TIME-COMP-P NOT LESS THAN DATE-TIME-LOW
              AND DATE-TIME-COMP-P NOT GREATER THAN DATE-TIME-HIGH
                  MOVE ZONE-P      TO TEMP-ZONE
                  MOVE TIME-COMP-P TO TEMP-TIME
                  PERFORM 70-SET-CTRS
                      VARYING SUB FROM 1 BY 1 UNTIL SUB > 25.
           GO TO 7-READ-PLANNED-TOO.

       7-RELEASE-SORT-REC.
           ADD 1 TO SUB.
           IF SUB > 25 OR ZONET (SUB) = SPACES
               GO TO 7-RSR-X.
           MOVE SPACES              TO SORT-REC.
           IF WORK-ZONE = "ALL "
               MOVE ZONET (SUB)     TO SORT-ZONE
               MOVE TOTB-CTR (SUB)  TO SORT-TOTB
               MOVE TOTP-CTR (SUB)  TO SORT-TOTP
               MOVE B-CTR (SUB, 1)  TO SORT-SHF1V
               MOVE B-CTR (SUB, 2)  TO SORT-SHF2V
               MOVE P-CTR (SUB, 1)  TO SORT-SHF1P
               MOVE P-CTR (SUB, 2)  TO SORT-SHF2P
           ELSE
           IF WORK-ZONE = ZONET (SUB)
               MOVE ZONET (SUB)     TO SORT-ZONE
               MOVE TOTB-CTR (SUB)  TO SORT-TOTB
               MOVE TOTP-CTR (SUB)  TO SORT-TOTP
               MOVE B-CTR (SUB, 1)  TO SORT-SHF1V
               MOVE B-CTR (SUB, 2)  TO SORT-SHF2V
               MOVE P-CTR (SUB, 1)  TO SORT-SHF1P
               MOVE P-CTR (SUB, 2)  TO SORT-SHF2P
           ELSE
           GO TO 7-RELEASE-SORT-REC.
           RELEASE SORT-REC.
           GO TO 7-RELEASE-SORT-REC.
       7-RSR-X.    EXIT.

       70-SET-CTRS.
           IF TEMP-ZONE = ZONET (SUB)
               MOVE TEMP-ZONE TO SHIFTZONE OF SS-REC
               READ SHIFT-STRUCTURE INTO SHIFT-STRUCTURE-DATA
               IF B-SW = 1
                   ADD 1 TO TOTB-CTR (SUB)
                   IF TEMP-TIME > FRST-SHIFT AND < SCND-SHIFT
                       ADD 1 TO B-CTR (SUB, 1)
                       MOVE 26 TO SUB
                   ELSE
                   ADD 1 TO B-CTR (SUB, 2)
                   MOVE 26 TO SUB
               ELSE
               ADD 1 TO TOTP-CTR (SUB)
               IF TEMP-TIME > FRST-SHIFT AND < SCND-SHIFT
                   ADD 1 TO P-CTR (SUB, 1)
                   MOVE 26 TO SUB
               ELSE
               ADD 1 TO P-CTR (SUB, 2)
               MOVE 26 TO SUB.

       7-IR-X.    EXIT.

       8-WRITE-OUTPUT SECTION.
       8-WRITE-OUT.
           RETURN SORT-FILE AT END GO TO 8-WO-X.
           MOVE SORT-ZONE         TO D1-ZONE.
           MOVE SORT-TOTB         TO D1-VCT.
           MOVE SORT-TOTP         TO D1-PCT.
           MOVE SORT-SHF1V        TO D1-SHIFT1V.
           MOVE SORT-SHF2V        TO D1-SHIFT2V.
           MOVE SORT-SHF1P        TO D1-SHIFT1P.
           MOVE SORT-SHF2P        TO D1-SHIFT2P.
           IF LINE-CTR > 61
               MOVE WORK-ZONE     TO H0-ZONE
               MOVE WORK-DATE-IN  TO H0-DATFR
               MOVE WORK-DATE-OUT TO H0-DATTO
               MOVE HEADER-0      TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING NEW-PAGE
               MOVE HEADER-1      TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1 LINES
               MOVE HEADER-U      TO PRINT-RCD
               WRITE PRINT-RCD AFTER ADVANCING 1 LINES
               MOVE 3             TO LINE-CTR.
           MOVE DETAIL-1          TO PRINT-RCD.
           WRITE PRINT-RCD AFTER ADVANCING 1 LINES.
           ADD 1                  TO LINE-CTR.
           GO TO 8-WRITE-OUT.
       8-WO-X.    EXIT.
