000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TSHOWJOB.
000400 AUTHOR.         C HILLES.
000500 DATE-WRITTEN.   JULY, 1982.
000600*REMARKS.        THIS PROGRAM READS THE REPORT PRODUCED BY
000700* THE 'WRKACTJOB *PRINT' COMMAND, SORTS IT BY USER NAME,
000800* ELIMINATES DUPLICATE USERS, AND FIGURES OUT HOW MANY
000900* USERS ARE SIGNED ON (NOT COUNTING PEOPLE THAT HAVE SIGNED
001000* ON TWICE).
001100*
002100 ENVIRONMENT DIVISION.
002200 CONFIGURATION SECTION.
002300 SOURCE-COMPUTER.
002400 OBJECT-COMPUTER.
002500 SPECIAL-NAMES. C01 IS NEW-PAGE.
002700 INPUT-OUTPUT SECTION.
002800 FILE-CONTROL.
002900     SELECT SORT-FILE ASSIGN TO DISK-SORT.
003000     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
003200     SELECT ACT-JOB-FILE ASSIGN TO DISK-MCFPACTJOB.
003300
003400 DATA DIVISION.
003500 FILE SECTION.
003600 FD  PRINT-FILE
003700     LABEL RECORDS ARE OMITTED
003800     RECORD CONTAINS 132 CHARACTERS
003900     DATA RECORD IS PRINT-REC.
004000 01  PRINT-REC            PIC X(132).
004100
004200 SD  SORT-FILE
004300     RECORD CONTAINS 37 CHARACTERS
004400     DATA RECORD IS SORT-REC.
004500 01  SORT-REC.
           05  SORT-USER        PIC X(12).
           05  SORT-CPU-PCT     PIC X(4).
           05  SORT-FUNCTION    PIC X(14).
           05  SORT-STATUS      PIC X(4).
           05  SORT-TYPE        PIC X(3).
006000
       FD  ACT-JOB-FILE
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS ACT-JOB-REC.
       01  ACT-JOB-REC.
           05  FILLER               PIC X(1).
           05  AJ-SUBSYSTEM.
               10  AJ-SUBSYS-1-2    PIC X(2).
               10  AJ-JOB           PIC X(13).
           05  AJ-USER              PIC X(10).
           05  FILLER               PIC X(2).
           05  AJ-NUMBER            PIC X(6).
           05  FILLER               PIC X(3).
           05  AJ-TYPE              PIC X(3).
           05  FILLER               PIC X(5).
           05  AJ-POOL              PIC X(1).
           05  FILLER               PIC X(4).
           05  AJ-PRIORITY          PIC X(2).
           05  FILLER               PIC X(6).
           05  AJ-CPU               PIC X(4).
           05  FILLER               PIC X(3).
           05  AJ-INT               PIC X(3).
           05  FILLER               PIC X(3).
           05  AJ-RSP               PIC X(4).
           05  FILLER               PIC X(4).
           05  AJ-AUXIO             PIC X(4).
           05  FILLER               PIC X(2).
           05  AJ-CPU-PCT           PIC X(4).
           05  FILLER               PIC X(3).
           05  AJ-FUNCTION.
               10  AJ-FUNCTION-TYPE PIC X(3).
               10  FILLER           PIC X(1).
               10  AJ-FUNCTION-F    PIC X(10).
           05  FILLER               PIC X(4).
           05  AJ-STATUS            PIC X(4).
           05  FILLER               PIC X(18).
008500
008600 WORKING-STORAGE SECTION.
008700
008800 COPY TDATECHK   IN COPYCSIS.
       COPY TBLOWUP    IN COPYCSIS.
       COPY OVRPFDATA  IN COPYCSIS.
       COPY CCHKOBJ    IN COPYCSIS.
       COPY CCRTFILE   IN COPYCSIS.
       COPY COMMAND    IN COPYCSIS.
008900
009000 77  LINE-K                         PIC 99    VALUE ZERO.
009100 77  PAGE-K                         PIC 9(4)  VALUE ZERO.
       77  TOTAL-INT          PIC 9(4) VALUE 0.
       77  TOTAL-BATCH        PIC 9(4) VALUE 0.
       77  TOTAL-DUPS         PIC 9(4) VALUE 0.
       77  TOTAL-SRQ          PIC 9(4) VALUE 0.
       77  TOTAL-INT-JOBS     PIC 9(4) VALUE 0.
       77  SAVE-USER          PIC X(10) VALUE SPACES.
       77  FOUND-IT-FLAG      PIC X(1)  VALUE "N".
       77  SUB                PIC 9(2).
       77  TOTAL-UNIQUE-USERS PIC 9(4)  VALUE 0.
       77  CREATE-FILENAME    PIC X(10) VALUE "MCFPACTJOB".

       01  STATUS-ARRAY-AREA.
           05  FILLER PIC X(4)  VALUE "TIMA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR TIME INTERVAL TO END (ACTIVITY LEVEL) ".
           05  FILLER PIC X(4)  VALUE "TIMW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR A TIME INTERVAL TO END                ".
           05  FILLER PIC X(4)  VALUE "BSCA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR BISYNC DEVICE (ACTIVITY LEVEL)        ".
           05  FILLER PIC X(4)  VALUE "BSCW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR BISYNC DEVICE                         ".
           05  FILLER PIC X(4)  VALUE "CMNA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO COMM DEVICE (ACTIVITY LEVEL)   ".
           05  FILLER PIC X(4)  VALUE "CMNW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO COMM DEVICE                    ".
           05  FILLER PIC X(4)  VALUE "DEQA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR DEQUEUE OPERATION (ACTIVITY LEVEL)    ".
           05  FILLER PIC X(4)  VALUE "DEQW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR DEQUEUE OPERATION                     ".
           05  FILLER PIC X(4)  VALUE "DKTA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO DISKETTE (ACTIVITY LEVEL)      ".
           05  FILLER PIC X(4)  VALUE "DKTW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO DISKETTE                       ".
           05  FILLER PIC X(4)  VALUE "DLYW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR TIME INTERVAL DUE TO DLYJOB COMMAND   ".
           05  FILLER PIC X(4)  VALUE "DSC ".
           05  FILLER PIC X(50) VALUE
           "DISCONNECTED FORM A WORK STATION DISPLAY          ".
           05  FILLER PIC X(4)  VALUE "DSPA".
           05  FILLER PIC X(50) VALUE
           "ON DISPLAY WAIT (ACTIVITY LEVEL)                  ".
           05  FILLER PIC X(4)  VALUE "DSPW".
           05  FILLER PIC X(50) VALUE
           "ON DISPLAY WAIT                                   ".
           05  FILLER PIC X(4)  VALUE "END ".
           05  FILLER PIC X(50) VALUE
           "ENDING                                            ".
           05  FILLER PIC X(4)  VALUE "EOFA".
           05  FILLER PIC X(50) VALUE
           "WAITING TO READ DATABASE AFTER EOF (ACTIVITY LEV) ".
           05  FILLER PIC X(4)  VALUE "EOFW".
           05  FILLER PIC X(50) VALUE
           "WAITING TO READ DATABASE AFTER EOF                ".
           05  FILLER PIC X(4)  VALUE "EOJ ".
           05  FILLER PIC X(50) VALUE
           "ENDING FOR SOME OTHER REASON THAN ENDJOB OR ENDSBS".
           05  FILLER PIC X(4)  VALUE "EVTW".
           05  FILLER PIC X(50) VALUE
           "ON EVENT WAIT                                     ".
           05  FILLER PIC X(4)  VALUE "GRP ".
           05  FILLER PIC X(50) VALUE
           "SUSPENDED DUE TO TFRGRPJOB COMMAND                ".
           05  FILLER PIC X(4)  VALUE "HLD ".
           05  FILLER PIC X(50) VALUE
           "HELD                                              ".
           05  FILLER PIC X(4)  VALUE "ICFA".
           05  FILLER PIC X(50) VALUE
           "WAITING ON I/O TO INTERACTIVE COMM FUNCT FILE (A) ".
           05  FILLER PIC X(4)  VALUE "ICFW".
           05  FILLER PIC X(50) VALUE
           "WAITING ON I/O TO INTERACTIVE COMM FUNCT FILE     ".
           05  FILLER PIC X(4)  VALUE "INEL".
           05  FILLER PIC X(50) VALUE
           "INELIGIBLE                                        ".
           05  FILLER PIC X(4)  VALUE "LCKW".
           05  FILLER PIC X(50) VALUE
           "ON LOCK WAIT                                      ".
           05  FILLER PIC X(4)  VALUE "MLTA".
           05  FILLER PIC X(50) VALUE
           "WAITING ON I/O TO MULTIPLE FILES (ACTIVITY LEVEL) ".
           05  FILLER PIC X(4)  VALUE "MLTW".
           05  FILLER PIC X(50) VALUE
           "WAITING ON I/O TO MULTIPLE FILES                  ".
           05  FILLER PIC X(4)  VALUE "MSGW".
           05  FILLER PIC X(50) VALUE
           "ON MESSAGE WAIT                                   ".
           05  FILLER PIC X(4)  VALUE "MXDW".
           05  FILLER PIC X(50) VALUE
           "WAITING ON I/O TO A MIXED DEVICE FILE             ".
           05  FILLER PIC X(4)  VALUE "PRTA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR PRINTER OUTPUT (ACTIVITY LEVEL)       ".
           05  FILLER PIC X(4)  VALUE "PRTW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR PRINTER OUTPUT                        ".
           05  FILLER PIC X(4)  VALUE "PSRW".
           05  FILLER PIC X(50) VALUE
           "PRESTART JOB WAITING FOR PROGRAM START REQUEST    ".
           05  FILLER PIC X(4)  VALUE "SVFA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR SAVE FILE OPERATION (ACTIVITY LEVEL)  ".
           05  FILLER PIC X(4)  VALUE "SVFW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR SAVE FILE OPERATION                   ".
           05  FILLER PIC X(4)  VALUE "TAPA".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO TAPE (ACTIVITY LEVEL)          ".
           05  FILLER PIC X(4)  VALUE "TAPW".
           05  FILLER PIC X(50) VALUE
           "WAITING FOR I/O TO TAPE                           ".
           05  FILLER PIC X(4)  VALUE "RUN ".
           05  FILLER PIC X(50) VALUE
           "RUNNING                                           ".
           05  FILLER PIC X(4)  VALUE "XXXX".
           05  FILLER PIC X(50) VALUE
           "OTHER                                             ".

       01  STATUS-ARRAY REDEFINES STATUS-ARRAY-AREA.
           05  STATUS-ARRAY-LINE OCCURS 38 TIMES.
               10  STATUS-VALUE         PIC X(4).
               10  STATUS-DESC          PIC X(50).

        01  INT-TOTALS.
            05  INT-TOTAL OCCURS 38 TIMES PIC 9(4).

        01  BATCH-TOTALS.
            05  BATCH-TOTAL OCCURS 38 TIMES PIC 9(4).

020600**************************************************************
020700**                                                          **
020800**       C O M M U N I C A T I O N S   A R E A S            **
020900**                                                          **
021000**************************************************************
021100
       01  BASE             PIC X(10) VALUE SPACES.
       COPY DBSTAT IN COPYCSIS.
       01  FILE-STATUS      PIC X(2).

027800**************************************************************
027900**                                                          **
028000**       H E A D E R   &   D E T A I L   L I N E S          **
028100**                                                          **
028200**************************************************************
028300
       01  DATE-TIME-LINE.
           05  FILLER             PIC X(6) VALUE "DATE: ".
           05  PRT-DATE           PIC X(8).
           05  FILLER             PIC X(5) VALUE SPACES.
           05  FILLER             PIC X(6) VALUE "TIME: ".
           05  PRT-TIME           PIC X(8).

       01  DETAIL-LINE.
           05  PRT-USER           PIC X(10).
           05  FILLER             PIC X(2)  VALUE SPACES.
           05  PRT-TYPE           PIC X(3).
           05  FILLER             PIC X(2)  VALUE SPACES.
           05  PRT-FUNCTION       PIC X(14).
           05  FILLER             PIC X(2)  VALUE SPACES.
           05  PRT-CPU-PCT        PIC X(4).
           05  FILLER             PIC X(2)  VALUE SPACES.
           05  PRT-STATUS         PIC X(4).

       01  TOTAL-LINE-1.
           05  FILLER             PIC X(3)  VALUE SPACES.
           05  PRT-TOTAL-1        PIC ZZZ9.
           05  FILLER             PIC X(1)  VALUE SPACES.
           05  PRT-TOTAL-TYPE-1   PIC X(50).

       01  TOTAL-LINE-DUP.
           05  FILLER             PIC X(3)  VALUE SPACES.
           05  PRT-TOTAL-DUP      PIC ZZZ9.
           05  FIL PIC X(20) VALUE " DUPLICATE USER IDS ".
           05  FIL PIC X(15) VALUE "FOR A TOTAL OF ".
           05  PRT-TOTAL-UNIQUE-USERS PIC ZZZ9.
           05  FIL PIC X(16) VALUE " UNIQUE USER IDs".

       01  TOTAL-LINE-SRQ.
           05  FILLER             PIC X(3)  VALUE SPACES.
           05  PRT-TOTAL-SRQ      PIC ZZZ9.
           05  FIL PIC X(20) VALUE " SUSPENDED HALFS OF ".
           05  FIL PIC X(19) VALUE "SRQ JOB PAIR FOR A ".
           05  FIL PIC X(9)  VALUE "TOTAL OF ".
           05  PRT-TOTAL-INT-JOBS PIC ZZZ9.
           05  FIL PIC X(17) VALUE " INTERACTIVE JOBS".

       01  TOTAL-LINE-2.
           05  FILLER             PIC X(5)  VALUE SPACES.
           05  PRT-TOTAL-2        PIC ZZZ9.
           05  FILLER             PIC X(1)  VALUE SPACES.
           05  PRT-TOTAL-TYPE-2   PIC X(50).

039600 PROCEDURE DIVISION.
039700 1-HOUSEKEEP SECTION.
039800 1-BEGIN-HOUSEKEEP.
           INITIALIZE INT-TOTALS.
           INITIALIZE BATCH-TOTALS.

      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'MCFPACTJOB'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "MCFPACTJOB"  TO CCRTFILE-FILE.
           MOVE "0132"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "10"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'MCFPACTJOB' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE "WRKACTJOB *PRINT" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "CPYSPLF FILE(QPDSPAJB) TOFILE(MCFPACTJOB)"
              TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTSPLF FILE(QPDSPAJB)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

043800     OPEN OUTPUT PRINT-FILE
043900     OPEN INPUT ACT-JOB-FILE.

047700     SORT SORT-FILE
047800         ON ASCENDING KEY SORT-TYPE,
                                SORT-USER
047900         INPUT PROCEDURE IS 6000-INPUT-STUFF THRU 6990-IS-X
048000         OUTPUT PROCEDURE IS 7000-OUTPUT-STUFF THRU 7990-OS-X.
048100
           ACCEPT PRT-DATE FROM DATE.
           ACCEPT PRT-TIME FROM TIME.
           WRITE PRINT-REC FROM DATE-TIME-LINE AFTER ADVANCING 2.

           MOVE TOTAL-INT TO PRT-TOTAL-1.
           MOVE "INTERACTIVE USERS" TO PRT-TOTAL-TYPE-1.
           WRITE PRINT-REC FROM TOTAL-LINE-1 AFTER ADVANCING 1.

           MOVE ZERO TO SUB.
           PERFORM 38 TIMES
               ADD 1 TO SUB
               IF INT-TOTAL (SUB) > ZERO
               OR STATUS-VALUE (SUB) = "RUN "
                   MOVE INT-TOTAL (SUB) TO PRT-TOTAL-2
                   MOVE STATUS-DESC (SUB) TO PRT-TOTAL-TYPE-2
                   WRITE PRINT-REC FROM TOTAL-LINE-2
                       AFTER ADVANCING 1
               END-IF
           END-PERFORM.

           MOVE TOTAL-DUPS TO PRT-TOTAL-DUP.
           SUBTRACT TOTAL-DUPS FROM TOTAL-INT
             GIVING TOTAL-UNIQUE-USERS.
           MOVE TOTAL-UNIQUE-USERS TO PRT-TOTAL-UNIQUE-USERS.
           WRITE PRINT-REC FROM TOTAL-LINE-DUP AFTER ADVANCING 1.

           IF TOTAL-SRQ > ZERO
               ADD TOTAL-INT, TOTAL-SRQ GIVING TOTAL-INT-JOBS
               MOVE TOTAL-INT-JOBS TO PRT-TOTAL-INT-JOBS
               MOVE TOTAL-SRQ TO PRT-TOTAL-SRQ
               WRITE PRINT-REC FROM TOTAL-LINE-SRQ AFTER ADVANCING 1.

           MOVE TOTAL-BATCH TO PRT-TOTAL-1.
           MOVE "BATCH JOBS" TO PRT-TOTAL-TYPE-1.
           WRITE PRINT-REC FROM TOTAL-LINE-1 AFTER ADVANCING 2.

           MOVE ZERO TO SUB.
           PERFORM 38 TIMES
               ADD 1 TO SUB
               IF BATCH-TOTAL (SUB) > ZERO
               OR STATUS-VALUE (SUB) = "RUN "
                   MOVE BATCH-TOTAL (SUB) TO PRT-TOTAL-2
                   MOVE STATUS-DESC (SUB) TO PRT-TOTAL-TYPE-2
                   WRITE PRINT-REC FROM TOTAL-LINE-2
                       AFTER ADVANCING 1
               END-IF
           END-PERFORM.

053700 2-EOJ.
           CLOSE PRINT-FILE.
           CLOSE ACT-JOB-FILE.
           MOVE "DLTF FILE(QTEMP/MCFPACTJOB)" TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

054000     GOBACK.
054100
051300 2100-BLOWUP.
           MOVE "TSHOWJOB" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
             BU-DISPLAY-AREA.
053600
       6000-INPUT-STUFF.
           READ ACT-JOB-FILE AT END
               CLOSE ACT-JOB-FILE
               GO TO 6990-IS-X.
           IF FOUND-IT-FLAG = "N"
               IF AJ-SUBSYSTEM = "Subsystem/Job"
                   READ ACT-JOB-FILE AT END
                      DISPLAY "NO USERS FOUND"
                      CLOSE ACT-JOB-FILE
                      GO TO 6990-IS-X
                   END-READ
                   MOVE "Y" TO FOUND-IT-FLAG
               ELSE
                   GO TO 6000-INPUT-STUFF.

           IF AJ-TYPE = "BCH" OR AJ-TYPE = "INT"
               NEXT SENTENCE
           ELSE
               GO TO 6000-INPUT-STUFF.

           IF AJ-STATUS = "SRQ"
               ADD 1 TO TOTAL-SRQ
               GO TO 6000-INPUT-STUFF.

           MOVE AJ-USER      TO SORT-USER.
           MOVE AJ-CPU-PCT   TO SORT-CPU-PCT.
           MOVE AJ-FUNCTION  TO SORT-FUNCTION.
           MOVE AJ-TYPE      TO SORT-TYPE.
           MOVE AJ-STATUS    TO SORT-STATUS.

           RELEASE SORT-REC.

           GO TO 6000-INPUT-STUFF.

       6990-IS-X.
           EXIT.

       7000-OUTPUT-STUFF.
           RETURN SORT-FILE AT END
               GO TO 7990-OS-X.
           IF SORT-USER = SAVE-USER AND SORT-TYPE = "INT"
               MOVE SORT-USER TO SAVE-USER
               ADD 1 TO TOTAL-DUPS
           ELSE
               MOVE SORT-USER TO SAVE-USER.

           MOVE SORT-USER         TO PRT-USER.
           MOVE SORT-TYPE         TO PRT-TYPE.
           MOVE SORT-FUNCTION     TO PRT-FUNCTION.
           MOVE SORT-CPU-PCT      TO PRT-CPU-PCT.
           MOVE SORT-STATUS       TO PRT-STATUS.
      *    WRITE PRINT-REC FROM DETAIL-LINE AFTER ADVANCING 1.

           IF SORT-TYPE = "INT"
               ADD 1 TO TOTAL-INT.

           IF SORT-TYPE = "BCH"
               ADD 1 TO TOTAL-BATCH.

           MOVE "N"      TO FOUND-IT-FLAG.
           MOVE ZERO     TO SUB.
           PERFORM UNTIL SUB > 37 OR FOUND-IT-FLAG = "Y"
               ADD 1 TO SUB
               IF STATUS-VALUE (SUB) = SORT-STATUS
                   MOVE "Y" TO FOUND-IT-FLAG
               END-IF
           END-PERFORM.
           IF FOUND-IT-FLAG = "N"
               MOVE 38      TO SUB
               PERFORM 9000-DISPLAY-NOT-FOUND.

           IF SORT-TYPE = "INT"
               ADD 1 TO INT-TOTAL (SUB).
           IF SORT-TYPE = "BCH"
               ADD 1 TO BATCH-TOTAL (SUB).

           GO TO 7000-OUTPUT-STUFF.
       7990-OS-X.
           EXIT.

       9000-DISPLAY-NOT-FOUND.
           DISPLAY "STATUS NOT FOUND, USER = ", SORT-USER,
             " FUNCTION = ", SORT-FUNCTION,
             " TYPE = ", SORT-TYPE,
             " STATUS = ", SORT-STATUS.

       COPY OVRPFCALL IN COPYCSIS.
