       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TSJOBCOP.
       AUTHOR.        R L ENSMINGER.
       INSTALLATION.  GTR.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE1
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT FILE2
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT FILE3
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  FILE2
           LABEL RECORDS ARE STANDARD.
       01  REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.
       FD  FILE3
           LABEL RECORDS ARE STANDARD.
       01  REC3.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS             PIC XX.
       01  INTERVAL                PIC 99.
       01  JOB-CMP-SEQ1            PIC 9999.
       01  JOB-CMP-SEQ2            PIC 9999.
       01  JOBPLAN-KEY1.
           05 JOBP-WO-NO1          PIC X(10).
           05 JOBP-SEQ-NO1         PIC 999.
           05 FILLER               PIC X.
       01  JOBPLAN-KEY2.
           05 JOBP-WO-NO2          PIC X(10).
           05 JOBP-SEQ-NO2         PIC 999.
           05 FILLER               PIC X.
       01  JOBPLAN-FILE1.
           COPY DJOBBANK OF COPYLIB.
       01  JOBPLAN-FILE2.
           COPY DJOBPLAN OF COPYLIB.
       01  S1                      PIC S9(4) COMP.
       01  SAVE-SEQ                PIC XXX.
       01  STOP-READ               PIC X.
       01  WO-PLANNED-DATA.
           COPY DWOPLAN OF COPYLIB.
       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS OF COPYLIB.
       01  SEQ-INT                 PIC X(2).
       01  MASTER-NAMES.
           05 MASTER-NAME OCCURS 15 TIMES
                                   PIC X(10).
       01  PLANNED-WO-NUM          PIC X(10).

       PROCEDURE DIVISION USING    DBPARAMETERS
                                   SEQ-INT
                                   MASTER-NAMES
                                   PLANNED-WO-NUM.
       START-PROGRAM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN VARYING S1 FROM 1 BY 1 UNTIL
               S1 > 15 OR MASTER-NAME (S1) = SPACES.
           PERFORM ADD-SEQUENCE-ONE.
           PERFORM UPDATE-SUFFIX.

       2-EOJ.
           CLOSE FILE1 FILE2 FILE3.
           GOBACK.

       1-HSK.
           OPEN INPUT FILE1.
           OPEN I-O   FILE2 FILE3.
           MOVE SEQ-INT TO INTERVAL.
           MOVE SPACES TO JOBPLAN-KEY1 JOBPLAN-KEY2.
           MOVE 0 TO JOB-CMP-SEQ2.

       ADD-SEQUENCE-ONE.
           IF INTERVAL NOT = 1
             MOVE SPACES TO REC2
             STRING PLANNED-WO-NUM "001 "
              DELIMITED BY SIZE INTO JOBPWOSEQ
             MOVE ALL "*" TO JOBPDESC

             WRITE REC2
             IF FILE-STATUS NOT = "00"
               DISPLAY "ERROR: FILE STATUS = "
                       FILE-STATUS
                       " ON WRITE TO FILE2"
               GO TO 2-EOJ.

       UPDATE-SUFFIX.
           MOVE PLANNED-WO-NUM TO WONUM.
           READ FILE3 INTO WO-PLANNED-DATA.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON READ OF FILE3"
             GO TO 2-EOJ.

           MOVE JOB-CMP-SEQ2 TO LAST-JOBPLAN-SEQ-1-3.
           REWRITE REC3 FROM WO-PLANNED-DATA.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON WRITE TO FILE3"
             GO TO 2-EOJ.

       6-MAIN.
           MOVE MASTER-NAME (S1) TO JOBP-WO-NO1.
           MOVE 0 TO JOBP-SEQ-NO1.
           MOVE JOBPLAN-KEY1 TO GJOBPSEQ.

           START FILE1
            KEY IS GREATER THAN GJOBPSEQ.
           IF FILE-STATUS = "00"
             MOVE "XXX" TO SAVE-SEQ
             MOVE "N" TO STOP-READ
             PERFORM 61-COPY-JOBPLAN THRU 61-CJ-EXIT
                 UNTIL STOP-READ = "Y".

       61-COPY-JOBPLAN.
           READ FILE1 NEXT RECORD INTO JOBPLAN-FILE1.
           IF FILE-STATUS NOT = "00"
             MOVE "Y" TO STOP-READ
             GO TO 61-CJ-EXIT.

           IF JOBPLAN-NAME NOT = MASTER-NAME (S1)
             MOVE "Y" TO STOP-READ
             GO TO 61-CJ-EXIT.

           IF JOBPLAN-SEQ-NO-1-3 OF JOBPLAN-FILE1 NOT = SAVE-SEQ
             MOVE JOBPLAN-SEQ-NO-1-3 OF JOBPLAN-FILE1 TO SAVE-SEQ
             ADD INTERVAL TO JOB-CMP-SEQ2
             IF JOB-CMP-SEQ2 > 998
               SUBTRACT INTERVAL FROM JOB-CMP-SEQ2
               PERFORM ADD-SEQUENCE-ONE
               PERFORM UPDATE-SUFFIX
               GO TO 2-EOJ.

           MOVE SPACES         TO JOBPLAN-FILE2.
           MOVE JOBPLAN-FILE1  TO JOBPLAN-FILE2.
           MOVE PLANNED-WO-NUM TO JOBPLAN-WO-NO.
           MOVE JOB-CMP-SEQ2   TO JOBP-SEQ-NO2.
           MOVE JOBP-SEQ-NO2   TO JOBPLAN-SEQ-NO-1-3 OF JOBPLAN-FILE2.

           WRITE REC2 FROM JOBPLAN-FILE2.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON WRITE TO FILE2"
             GO TO 2-EOJ.

       61-CJ-EXIT.
           EXIT.
