       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TSPRTCOP.
       AUTHOR.        R L ENSMINGER.
       INSTALLATION.  GTR.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE1
               ASSIGN TO DATABASE-MCFLMM3801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
           SELECT FILE2
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM3801.
       FD  FILE2
           LABEL RECORDS ARE STANDARD.
       01  REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS             PIC XX.
       01  PRTPLAN-KEY1            PIC X(10).
       01  PRTPLAN-KEY2            PIC X(10).
       01  PRTPLAN-FILE1.
           COPY DPRTBANK OF COPYLIB.
       01  PRTPLAN-FILE2.
           COPY DWOPARTS OF COPYLIB.
       01  S1                      PIC S9(4) COMP-4.
       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS OF COPYLIB.
       01  MASTER-NAMES.
           05 MASTER-NAME OCCURS 15 TIMES
                                   PIC X(10).
       01  PLANNED-WO-NUM          PIC X(10).
       PROCEDURE DIVISION USING    DBPARAMETERS
                                   MASTER-NAMES
                                   PLANNED-WO-NUM.
       START-PROGRAM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN VARYING S1 FROM 1 BY 1 UNTIL
            S1 > 15 OR MASTER-NAME (S1) = SPACES.
       2-EOJ.
           CLOSE FILE1 FILE2.
           GOBACK.
       1-HSK.
           OPEN INPUT FILE1.
           OPEN I-O   FILE2.
           MOVE SPACES TO PRTPLAN-KEY1 PRTPLAN-KEY2.
       6-MAIN.
           MOVE MASTER-NAME (S1) TO PRTPLAN-KEY1.
           MOVE PRTPLAN-KEY1 TO GPRTPNAME.
           START FILE1 KEY IS = GPRTPNAME.
           IF FILE-STATUS = "00"
             PERFORM 61-COPY-PRTPLAN THRU 61-CP-EXIT.

       61-COPY-PRTPLAN.
           READ FILE1 NEXT RECORD INTO PRTPLAN-FILE1.
           IF FILE-STATUS NOT = "00"
             GO TO 61-CP-EXIT.
           IF MPRTNAME NOT = MASTER-NAME (S1)
             GO TO 61-CP-EXIT.
           MOVE SPACES TO PRTPLAN-FILE2.
           MOVE PLANNED-WO-NUM TO PRT-WO-NU.
           MOVE PRT-STATUS OF PRTPLAN-FILE1
             TO PRT-STATUS OF PRTPLAN-FILE2.
           MOVE PRT-EST-QTY OF PRTPLAN-FILE1
             TO PRT-EST-QTY OF PRTPLAN-FILE2.
           MOVE PRT-NUM OF PRTPLAN-FILE1
             TO PRT-NUM OF PRTPLAN-FILE2.
           MOVE PRT-UNIT-MEAS OF PRTPLAN-FILE1
             TO PRT-UNIT-MEAS OF PRTPLAN-FILE2.
           MOVE PRT-UNIT-COST OF PRTPLAN-FILE1
             TO PRT-UNIT-COST OF PRTPLAN-FILE2.
           MOVE PRT-PRIME OF PRTPLAN-FILE1
             TO PRT-PRIME OF PRTPLAN-FILE2.
           MOVE PRT-SUB OF PRTPLAN-FILE1
             TO PRT-SUB OF PRTPLAN-FILE2.
           MOVE PRT-STAGE OF PRTPLAN-FILE1
             TO PRT-STAGE OF PRTPLAN-FILE2.
           MOVE PRT-ORIGINATOR OF PRTPLAN-FILE1
             TO PRT-ORIGINATOR OF PRTPLAN-FILE2.
           MOVE PRT-ADDL-INFO OF PRTPLAN-FILE1
             TO PRT-ADDL-INFO OF PRTPLAN-FILE2.
           MOVE PRT-SUGG-VENDOR OF PRTPLAN-FILE1
             TO PRT-SUGG-VENDOR OF PRTPLAN-FILE2.
           MOVE PRT-DESC OF PRTPLAN-FILE1
             TO PRT-DESC OF PRTPLAN-FILE2.
           MOVE PRT-DESC-2 OF PRTPLAN-FILE1
             TO PRT-DESC-2 OF PRTPLAN-FILE2.
           MOVE PRT-DESC-3 OF PRTPLAN-FILE1
             TO PRT-DESC-3 OF PRTPLAN-FILE2.
           MOVE PRT-DESC-4 OF PRTPLAN-FILE1
             TO PRT-DESC-4 OF PRTPLAN-FILE2.
           MOVE PRT-DESC-5 OF PRTPLAN-FILE1
             TO PRT-DESC-5 OF PRTPLAN-FILE2.
           MOVE PRT-REMARKS OF PRTPLAN-FILE1
             TO PRT-REMARKS OF PRTPLAN-FILE2.
           MOVE PRT-REMARKS-2 OF PRTPLAN-FILE1
             TO PRT-REMARKS-2 OF PRTPLAN-FILE2.
           MOVE PRT-EST-COST OF PRTPLAN-FILE1
             TO PRT-EST-COST OF PRTPLAN-FILE2.
           WRITE REC2 FROM PRTPLAN-FILE2.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                     FILE-STATUS
                     " ON WRITE TO FILE2"
             GO TO 2-EOJ.

           GO TO 61-COPY-PRTPLAN.

       61-CP-EXIT.
           EXIT.
