       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TST5MAIN.
       DATE-WRITTEN.        JUNE 2003.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *REMARKS.
      *C  06/12/2003  CA YODER   NAPANEE REQUEST
      *C     CREATED THIS MAIN PROGRAM TO CALL ST5 INSTEAD OF
      *C     CALLING THIS OPTION FROM THE STR MENU.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MEMPL
                  ASSIGN TO DATABASE-MCFLCS4202
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZUDCSTR-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DISPLAY-STATUS
               CONTROL-AREA IS WS-CONTROL.


       DATA DIVISION.
       FILE SECTION.
      *------ FD AREA FOR IBM ONLY ------*
       FD  MEMPL
           LABEL RECORDS ARE STANDARD.
       01  MEMPL-REC.
           COPY DDS-MCRPCS4200  OF MCFLCS4202.

       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(1500).
      *------ FD AREA FOR IBM ONLY ------*

       WORKING-STORAGE SECTION.

       77  ANY-KEY                       PIC X(1).
       77  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".
       77  HOLD-ST5-SW                   PIC X(1)  VALUE "Y".

      **************************************************************
      **                                                          **
      **     S U B P R O G R A M   A R E A S                      **
      **                                                          **
      **************************************************************

       COPY STCOM      IN COPYLIB.
       COPY TBLOWUP    IN COPYLIB.
       COPY TSPLPRT    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.
       COPY CSWITCHF   IN COPYLIB.
       COPY ESCNAM2    IN COPYLIB.
       COPY CATREAD    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY TISSCRWS   IN COPYLIB.

       01  DUMMY-CODE                    PIC X(8) VALUE SPACES.

       01  PASS-RPT-NUMBER               PIC S9(4) BINARY VALUE 3.

       01  SDSCINQ-PARMS.
           05 SDSCINQ-COMPANY            PIC X(3) VALUE SPACES.
           05 SDSCINQ-DDESC-LANG         PIC X(3) VALUE SPACES.
           05 SDSCINQ-DDESC2-LANG        PIC X(3) VALUE SPACES.

       COPY MULTSTR    IN COPYLIB.

       01  PASS-SPOOL                    PIC S9(2) VALUE ZERO COMP-4.
       01  REQ-PLANT.
           05  REQ-PLANT-CODE       PIC X(3)    VALUE SPACES.
           05  FILLER               PIC X       VALUE SPACES.

       COPY REQGLOBS IN COPYLIB.

       01  REQI-RET-CODE                 PIC S9(4) VALUE ZERO COMP-4.
       COPY SMREQINQ OF COPYLIB.

       01  WHO-PARMS.
           05  USERNAME                            PIC X(10).
           05  TERMNUM                             PIC X(10).
           05  CURRLIB                             PIC X(10).
           05  JOBLIBX                             PIC X.

      **************************************************************
      **                                                          **
      **                  V I E W   W O R K                       **
      **                                                          **
      **************************************************************
       COPY FUNCTDEF IN COPYLIB.

       01  FIELD-NUMBER                  PIC S9(4) COMP VALUE 1.

       COPY VCOMAREA IN COPYLIB.
       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FUDCSTR".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  TERMFILENAME                  PIC X(11) VALUE "TERM;".

       COPY HMSGBUF IN COPYLIB.
      **************************************************************
      **                                                          **
      **       D A T A   E N T R Y   B U F F E R S                **
      **                                                          **
      **************************************************************

      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01  MPLTINFO-STATUS               PIC X(2).
       01  BASE                          PIC X(24) VALUE "  STORES;".
       01  PASSWORD                      PIC X(5)  VALUE "JADE;".
       01  MMIS-BASE                     PIC X(8)  VALUE "  MMISA;".
       01  MMIS-PASSWORD                 PIC X(7)  VALUE "DO-ALL;".
       01  BUDGET-BASE                   PIC X(24) VALUE "  BUDGET:".
       01  BUDGET-PASSWORD               PIC X(7)  VALUE "DO-ALL;".
       COPY DBSTHIST OF COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  DSET-NAMES.
           05  DSET-DUMMY                PIC X(2)  VALUE SPACES.
           05  DSET-MPLTINFO             PIC X(16) VALUE "MPLTINFO;".

       01  MODE-AREA.
           05  MODE1                     PIC S9(4) BINARY VALUE 1.
           05  MODE7                     PIC S9(4) BINARY VALUE 7.

       01  ALL-ITEMS                     PIC X(2)  VALUE "@;".

       01  PLT-ARG                       PIC X(4)  VALUE SPACES.

       COPY MEMPL    IN COPYLIB.
       COPY MPLT0    IN COPYLIB.
       COPY MPLTPLAN IN COPYLIB.
       COPY MPLTST   IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.
       COPY MPLTRQGB IN COPYLIB.
       COPY MPLTOPT  IN COPYLIB.

      **************************************
      *                                    *
      *    NATIVE LANGUAGE SUPPORT AREA    *
      *                                    *
      **************************************

       COPY LANGUAGE IN COPYLIB.


       PROCEDURE DIVISION.
       0000-START.

           MOVE SPACES TO ISCR-DATA.
           PERFORM 1000-HOUSEKEEP.
           MOVE "N"         TO  SAVE-PRT-OPT.
           PERFORM 6000-MAIN.
           PERFORM 2000-EOJ.
           GOBACK.

       1000-HOUSEKEEP.
           PERFORM 9999-OPEN-STUFF.

           CALL "TSPLPRT" USING SP-RET-CODE, SP-AREA.
           IF SP-RET-CODE = "NF"
               MOVE "SPOOL KEY NOT FOUND * RCVEXEC" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP
           ELSE
           IF SP-RET-CODE NOT = "00"
               MOVE "TSPLPRT ERROR * RCVEXEC" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE SP-SPOOL-NO (1)          TO  PASS-SPOOL.
           MOVE SP-USERNAME              TO  SRF-USERNAME.

           MOVE "P 01"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE MPLTINFO-COMPANY         TO  SRF-MPLTINFO-COMPANY
                                             REQ-PLANT-CODE.

           MOVE "PLAN"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE PRIMARY-LANGUAGE         TO  SDSCINQ-DDESC-LANG
           MOVE SECONDARY-LANGUAGE       TO  SDSCINQ-DDESC2-LANG.

      *---------- THE STST KEY IN MPLTINFO TELLS IF THIS IS A MULTIPLE
      *---------- STOREROOM PLANT.  IF THE "ALWAYS-MULT-STR-CODE" FLAG IS
      *---------- SET TO "Y", ALL CODES ARE CONSIDERED "MULTIPLE STOREROOM
      *---------- CODES".  IF NOT, ONLY CODES WITH AN "A-", "B-", ETC PREFIX
      *---------- IN AT LEAST 1 LOCATION ARE CONSIDERED MULT-STR-CODES.
           MOVE SPACES                   TO  BUF-MPLTINFO
           MOVE "STST"                   TO  PLT-ARG
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
               MOVE "N"                  TO  MULT-STR-FLAG
               MOVE "N"                  TO  ALWAYS-MULT-STR-CODE-FLAG
               MOVE "Y"                  TO  WO-OVERRD-ENTRY
               MOVE "Y"                  TO  WO-OVERRD-EXP
               MOVE "N"                  TO  ENTRY-OVERRD-EXP
               MOVE "N"                  TO  WS-PW-SW
               MOVE "N"                  TO  VALID-EMPL-CRAFTWS
               MOVE "N"                  TO  VALID-EMPL-STORES
           ELSE
               MOVE MPLTINFO-ST          TO  MULTIPLE-STR-DATA.

      *---------- THE 7TH DIGIT OF THE USER TELLS WHICH STOREROOM WE ARE
      *---------- AT IN A MULT-STR SITUATION.  (IE. "STORESA" MEANS WE ARE
      *---------- AT STOREROOM A, ETC).
           IF MULT-STR-FLAG = "Y"
               MOVE SRF-USER-7           TO  MULT-STR-STR-1
               MOVE SRF-USER-8           TO  MULT-STR-STR-2.
           CALL "CLWHO" USING USERNAME TERMNUM CURRLIB JOBLIBX.
           MOVE "RQGB" TO PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
020100     IF COND-WORD NOT = 0
020200         MOVE "DBGET ERR MPLTINFO" TO BU-DISPLAY-MSG
020300         GO TO 2100-BLOWUP.
           MOVE MPLTINFO-RQGB TO REQ-GLOBALS.
           MOVE SPACES TO INQ-CC-INPUT.
           MOVE USERNAME TO USERID OF MEMPL-REC.
           READ MEMPL INTO BUF-MEMPL
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               IF MEMPL-INQUIRE-CAP = "Y"
                   MOVE SPACES TO INQ-CC-INPUT
                   MOVE "Y"    TO INQ-INQ-FLAG
               ELSE
               MOVE MEMPL-EMPL TO INQ-CC-INPUT
               MOVE "N"        TO INQ-INQ-FLAG
           ELSE
           MOVE SPACES         TO INQ-CC-INPUT
           MOVE "Y"            TO INQ-INQ-FLAG.

       2000-EOJ.
           PERFORM 9999-CLOSE-STUFF.

       2100-BLOWUP.
           MOVE "TST5MAIN"               TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       6000-MAIN.

           CALL "SRETWVLS" USING BASE, VIEW-COMAREA, LANGUAGE-PARMS,
               ESC-NAME, MULTIPLE-STR-DATA, SRF-MPLTINFO-COMPANY.

       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN INPUT MEMPL.
           OPEN INPUT MPLTINFO-PK-I.
           COPY OPDISPL IN COPYLIB.
       9999-CLOSE-STUFF.
           CLOSE DISPLAY-FILE.
           CLOSE MEMPL.
           CLOSE MPLTINFO-PK-I.
