001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TSTARTJB.
001300 AUTHOR.              C.I.HILLES.
001400 DATE-WRITTEN.        04/03/90.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*
001800*REMARKS.
001900*D   THIS PROGRAM IS USED TO SUBMIT A JOB OR START A DATABASE
002000*D   READER FOR A JOB FROM THE MENU SYSTEM.  THIS PROGRAM
002100*    READS THE LOCAL DATA AREA TO FIND OUT THE TRANSACTION
      *    PICKED FROM THE MENU SYSTEM.  IT THEN SEARCHES THE JOB
      *    DEFINITION FILE MCHEADERS.DJOBDEF TO FIND THE JOB TO
      *    STREAM, AND WHETHER IT IS A SBMJOB OR STRDBRDR.
      *C
      *C   01MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
015600 ENVIRONMENT DIVISION.
015700 CONFIGURATION SECTION.
015800 SOURCE-COMPUTER.  HP-3000.
015900 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. LOCAL-DATA IS LOCAL-DATA-AREA.
016000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
016200     SELECT JOBDEF-FILE ASSIGN TO DISK-DJOBDEF.
           SELECT PLANT-JOBD-FILE ASSIGN TO DATABASE-MCFPMMJOBD.
016400
016500 DATA DIVISION.
       FILE SECTION.
016700 FD  JOBDEF-FILE
016800     RECORD CONTAINS 92 CHARACTERS.
016900 01  JOBDEF-REC.
           05  FILLER                PIC X(12).
           05  TRANSACTION-CODE      PIC X(4).
           05  FILLER                PIC X(1).
           05  JOB-MEMBER-NAME       PIC X(10).
           05  FILLER                PIC X(1).
           05  SBMJOB-STRDBRDR-FLAG  PIC X(1).
           05  FILLER                PIC X(63).

       FD  PLANT-JOBD-FILE
           RECORD CONTAINS 10 CHARACTERS.
       01  PLANT-JOBD                PIC X(10).
017500
017600 WORKING-STORAGE SECTION.
       01  BUILD-READER-NAME.
           05  BUILD-READER-1-2          PIC X(2).
           05  BUILD-READER-TIME         PIC X(8).

       01  END-FILE                      PIC X(1).
       COPY UTC9001X IN U0PRD-QLBLSRC.
      ********************************************************
      ***                                                  ***
      ***       S U B P R O G R A M   A R E A S            ***
      ***                                                  ***
      ********************************************************
       01  MCXCBLERR-SCOPE          PIC X(1)  VALUE "C".

       COPY TBLOWUP    IN COPYLIB.
       COPY COMMAND    IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.

021600 01  DUMMY-BASE               PIC X(16) VALUE SPACES.

039000 PROCEDURE DIVISION.
039200 1000-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

      *------ WAIT! GET THE DATA AREA FIRST. IT SHOULD HAVE THE
      *------ TRANSACTION CODE
           ACCEPT SC-SYSTEMS-COMMON FROM LOCAL-DATA-AREA.

      *------ THIS IS TO ENSURE A UNIQUE READER NAME
           MOVE SC-CURRENT-TRAN-X TO BUILD-READER-1-2.
           ACCEPT BUILD-READER-TIME FROM TIME.

      *------ FIRST FIND THE REPORT IN THE REPORT DEF FILE.
           MOVE "OVRDBF FILE(DJOBDEF) TOFILE(MCHEADERS) MBR(DJOBDEF)"
             TO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           OPEN INPUT JOBDEF-FILE.
           MOVE "N" TO END-FILE.
           MOVE "X<>*" TO TRANSACTION-CODE.
           PERFORM UNTIL END-FILE = "Y"
           OR TRANSACTION-CODE = SC-CURRENT-TRAN-X
               READ JOBDEF-FILE AT END
                   MOVE "Y" TO END-FILE
               END-READ
           END-PERFORM.
           IF END-FILE = "Y"
               MOVE "NO JOB FOUND FOR THIS TRANSACTION IN DJOBDEF"
                 TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           IF SBMJOB-STRDBRDR-FLAG = "D"
               PERFORM 7000-START-DATABASE-READER
           ELSE
           IF SBMJOB-STRDBRDR-FLAG = "S"
               PERFORM 7200-FIND-JOBD
               PERFORM 7100-SUBMIT-JOB
           ELSE
               MOVE "INVALID STRDBRDR/SBMJOB FLAG"
                      TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

044600     GOBACK.
044700
044800 2100-BLOWUP.
           MOVE ZERO TO COND-WORD.
044900     MOVE SC-CURRENT-TRAN-X TO BU-DISPLAY-FLD (1).
           MOVE "TSTARTJB"      TO BU-PGM-NAME.
045100     CALL "TBLOWUP" USING DUMMY-BASE BU-PGM-NAME
045200       STATUS-AREA DUMMY-VIEW-AREA DUMMY-KSAM-STAT
045300       BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       7000-START-DATABASE-READER.
           MOVE SPACES TO COMMAND.
           STRING "STRDBRDR FILE(*CURLIB/QJOBSRC) MBR("
                    DELIMITED BY SIZE
                  JOB-MEMBER-NAME DELIMITED BY SPACES,
                  ") JOBQ(HBATCH) RDR(" DELIMITED BY SIZE,
                  BUILD-READER-NAME DELIMITED BY SPACES,
                  ")" DELIMITED BY SIZE
              INTO COMMAND.
           CALL "QCMDEXC" USING COMMAND, COMMAND-LEN.

       7100-SUBMIT-JOB.
           MOVE SPACES TO COMMAND.
           STRING "SBMJOB CMD(CALL PGM(" DELIMITED BY SIZE,
                  JOB-MEMBER-NAME DELIMITED BY SPACES,
                  ")) JOB(", DELIMITED BY SIZE,
                  JOB-MEMBER-NAME DELIMITED BY SPACES,
                  ") JOBD(*LIBL/" DELIMITED BY SIZE,
                  PLANT-JOBD DELIMITED BY SPACES,
                  ") " DELIMITED BY SIZE,
                  "PRTDEV(*JOBD) OUTQ(*JOBD) USER(*JOBD) "
                    DELIMITED BY SIZE,
                  "PRTTXT(*JOBD) CURLIB(*USRPRF)" DELIMITED BY SIZE,
                    INTO COMMAND.
           CALL "QCMDEXC" USING COMMAND, COMMAND-LEN.

       7200-FIND-JOBD.
           OPEN INPUT PLANT-JOBD-FILE.
           READ PLANT-JOBD-FILE NEXT.
