001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID. TSTAGMTL.
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.   AS400.
001600 OBJECT-COMPUTER.   AS400.
001900 INPUT-OUTPUT SECTION.
002000 FILE-CONTROL.
002100     SELECT OUTFILE
               ASSIGN TO PRINTER-QPRINT.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARGUM-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1202
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
002200 DATA DIVISION.
002300 FILE SECTION.
002400 FD  OUTFILE
002500     RECORD CONTAINS 132 CHARACTERS
002600     LABEL RECORD IS OMITTED
002700     DATA RECORD IS OUTFI.
002800 01  OUTFI.
002900     02  OUT-CC                  PIC X.
003000     02  OUT-RECORD              PIC X(131).
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1202.
003100 WORKING-STORAGE SECTION.
003200 77  JUL-DATE-DIFF               PIC 999.
003700 77  LINE-CTR                    PIC 99 VALUE 0.
       77  SUB                         PIC S9(4) COMP-4.
004100 01  ARGUM-NO                    PIC 9(9).
004200 01  CUR-DATE-BUFFER.
004300     02  CUR-DATE-MD             PIC 99.
004400     02  FILLER                  PIC X.
004500     02  CUR-DATE-DM             PIC 99.
004600     02  FILLER                  PIC X.
004700     02  CUR-DATE-YY             PIC 99.
004800 01  CUR-JUL-DAY                 PIC 9(7).
004900 COPY TDATESUB OF COPYLIB.
       01  DAY-DIGIT                   PIC X.
005000 01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.
       01  FILE-STATUSES.
           05  WLNU-STATUS             PIC XX.
           05  WPFD-STATUS             PIC XX.
       01  GREG-DATE.
           05  GREG-CC                 PIC XX.
           05  GREG-DATE-YMD.
               10  GREG-YY             PIC XX.
               10  GREG-MM             PIC XX.
               10  GREG-DD             PIC XX.
005100 01  HEADER0.
005200     02  FILLER  PIC X(22) VALUE SPACES.
005300     02  FILLER  PIC X(23) VALUE "DAILY LIST OF PARTS TO ".
005400     02  FILLER  PIC X(9)  VALUE "BE STAGED".
005500     02  FILLER  PIC X(78) VALUE SPACES.
005600 01  HEADER1.
005700     02  FILLER  PIC X(75) VALUE SPACES.
005800     02  FILLER  PIC X(5)  VALUE "STAGE".
005900     02  FILLER  PIC X(52) VALUE SPACES.
006000 01  HEADER2.
006100     02  FILLER  PIC X     VALUE SPACE.
006200     02  FILLER  PIC X(5)  VALUE "WKSHT".
006300     02  FILLER  PIC X(4)  VALUE SPACES.
006400     02  FILLER  PIC XXX   VALUE "QTY".
006500     02  FILLER  PIC X(4)  VALUE SPACES.
006600     02  FILLER  PIC XX    VALUE "UM".
006700     02  FILLER  PIC XXX   VALUE SPACES.
006800     02  FILLER  PIC X(4)  VALUE "CODE".
006900     02  FILLER  PIC X(12) VALUE SPACES.
007000     02  FILLER  PIC X(7)  VALUE "KEY/MOD".
007100     02  FILLER  PIC X(19) VALUE SPACES.
007200     02  FILLER  PIC X(7)  VALUE "W/O NUM".
007300     02  FILLER  PIC X(4)  VALUE SPACES.
007400     02  FILLER  PIC X(4)  VALUE "AREA".
007500     02  FILLER  PIC X(53) VALUE SPACES.
007600 01  HEADER3.
007700     02  FILLER  PIC X     VALUE SPACE.
007800     02  FILLER  PIC X(5)  VALUE "-----".
007900     02  FILLER  PIC X     VALUE SPACE.
008000     02  FILLER  PIC X(8)  VALUE "--------".
008100     02  FILLER  PIC XX    VALUE SPACES.
008200     02  FILLER  PIC XX    VALUE "--".
008300     02  FILLER  PIC XX    VALUE SPACES.
008400     02  FILLER  PIC X(8)  VALUE "--------".
008500     02  FILLER  PIC X     VALUE SPACE.
008600     02  FILLER  PIC X(30) VALUE ALL "-".
008700     02  FILLER  PIC XX    VALUE SPACES.
008800     02  FILLER  PIC X(11) VALUE "-----------".
008900     02  FILLER  PIC XX    VALUE SPACES.
009000     02  FILLER  PIC X(4)  VALUE "----".
009100     02  FILLER  PIC X(53) VALUE SPACES.
       01  JULIAN-DATE          PIC X(7).
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).
009800 01  LAST-WO-BUFF.       COPY MLASTWO OF COPYLIB.
       01  LEAP-YEAR-FLAG       PIC X.
009900 01  PRINT-LINE.
010000     02  FILLER  PIC X     VALUE SPACE.
010100     02  P-WKNO  PIC ZZZ9.
010200     02  FILLER  PIC XX    VALUE SPACES.
010300     02  P-QTY   PIC ZZZZZZZ9.
010400     02  FILLER  PIC XX    VALUE SPACES.
010500     02  P-UM    PIC XX    VALUE SPACES.
010600     02  FILLER  PIC XX    VALUE SPACES.
010700     02  P-CODE  PIC X(8)  VALUE SPACES.
010800     02  FILLER  PIC X     VALUE SPACE.
010900     02  P-DESC  PIC X(30) VALUE SPACES.
011000     02  FILLER  PIC XX    VALUE SPACES.
011100     02  P-WO7   PIC X(7)  VALUE SPACES.
011200     02  FILLER  PIC X     VALUE "-".
011300     02  P-WO3   PIC XXX   VALUE SPACES.
011400     02  FILLER  PIC XX    VALUE SPACES.
011500     02  P-AREA  PIC X(4)  VALUE SPACES.
011600     02  FILLER  PIC X(53) VALUE SPACES.
011700 COPY DBSTAT OF COPYLIB.
011800 01  STATUS-TABLE.
011900     05  ST-TAB.
012000         10  FILLER  PIC XX VALUE "R ".
012100         10  FILLER  PIC XX VALUE "S ".
012200         10  FILLER  PIC XX VALUE "SC".
012300     05  STAB REDEFINES ST-TAB.
012400         10  ST OCCURS 3 TIMES  PIC XX.
012500 01  WO-PARTS-DATA.      COPY DWOPARTS OF COPYLIB.
012600 01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
012700 PROCEDURE DIVISION.
012800 START-PROCESSING.
012900     PERFORM 1-HSK.
013000     PERFORM 6-MAIN THRU 6-MAIN-EXIT.
013100 2-EOJ.
013300     MOVE SPACES TO OUTFI.
013400     WRITE OUTFI AFTER ADVANCING 0 LINES.
014600     CLOSE OUTFILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
014700     GOBACK.
014800 1-HSK.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PARTS-FILE.
018800     OPEN OUTPUT OUTFILE.
014900     MOVE LOW-VALUES TO STATUS-AREA.
           MOVE 0 TO COND-WORD.
016200     MOVE 1 TO ARGUM-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
016500     MOVE DATE-FLAG-SW TO DATE-FLAG.
016600     MOVE 1 TO DATE-MODE.
016700     MOVE DATE-FLAG TO DATE-CODE.
016800     CALL "TDATECHK" USING DATE-CHECK-AREA.
016900     MOVE DATE-SLASH-OUT TO CUR-DATE-BUFFER.
017200     IF DATE-FLAG = 3
017300         MOVE CUR-DATE-MD TO GREG-DD
017400         MOVE CUR-DATE-DM TO GREG-MM
017500         MOVE CUR-DATE-YY TO GREG-YY
017600     ELSE
017700     MOVE CUR-DATE-MD TO GREG-MM
017800     MOVE CUR-DATE-DM TO GREG-DD
017900     MOVE CUR-DATE-YY TO GREG-YY.
           IF GREG-YY > "70"
               MOVE "19"    TO GREG-CC
           ELSE
           MOVE "20"        TO GREG-CC.
018100     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
018200     MOVE JULIAN-DATE-9 TO CUR-JUL-DAY.
018900     MOVE HEADER0 TO OUTFI.
019000     WRITE OUTFI AFTER ADVANCING 0 LINES.
019100     MOVE HEADER1 TO OUTFI.
019200     WRITE OUTFI AFTER ADVANCING 2 LINES.
019300     MOVE HEADER2 TO OUTFI.
019400     WRITE OUTFI AFTER ADVANCING 1 LINES.
019500     MOVE HEADER3 TO OUTFI.
019600     WRITE OUTFI AFTER ADVANCING 1 LINES.
019700     MOVE 5 TO LINE-CTR.
019800 6-MAIN.
019900     ADD 1 TO SUB.
020000     IF SUB > 3 GO TO 6-MAIN-EXIT.
           MOVE 0 TO COND-WORD.
020100     MOVE ST (SUB) TO PRTSTATUS OF WPFDREC.
           START WO-PARTS-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.
020400     IF COND-WORD = 17 GO TO 6-MAIN.
020500 6-MAIN-CONT.
020600     READ WO-PARTS-FILE NEXT INTO WO-PARTS-DATA
020700         AT END    MOVE 15 TO COND-WORD.
           IF PRTSTATUS OF WPFDREC NOT = ST (SUB) MOVE 15 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 15 TO COND-WORD.
020800     IF COND-WORD = 15 GO TO 6-MAIN-EXIT.
021200     IF PRT-DATE-USED-CN = "        " GO TO 6-MAIN-CONT.
021300     MOVE PRT-DATE-USED-MM TO GREG-MM.
021400     MOVE PRT-DATE-USED-DD TO GREG-DD.
021500     MOVE PRT-DATE-USED-YY TO GREG-YY.
           IF GREG-YY > "70"
               MOVE "19"         TO GREG-CC
           ELSE
           MOVE "20"             TO GREG-CC.
021700     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
021800     IF JULIAN-DATE-9 < CUR-JUL-DAY GO TO 6-MAIN-CONT.
021900     SUBTRACT CUR-JUL-DAY FROM JULIAN-DATE-9
               GIVING JUL-DATE-DIFF.
022000     IF JUL-DATE-DIFF > 1 GO TO 6-MAIN-CONT.
022100     MOVE 0 TO P-WKNO.
022200     MOVE PRT-EST-QTY-9 TO P-QTY.
022300     MOVE PRT-UNIT-MEAS TO P-UM.
022400     MOVE PRT-NUM TO P-CODE.
022500     MOVE PRT-DESC TO P-DESC.
022600     MOVE PRT-WO-NUM-PRIM TO P-WO7.
022700     MOVE PRT-WO-NUM-SUFFIX TO P-WO3.
022800     MOVE PRT-STAGE TO P-AREA.
022900     MOVE PRINT-LINE TO OUTFI.
023000     WRITE OUTFI AFTER ADVANCING 1 LINES.
023100     ADD 1 TO LINE-CTR.
023200     IF LINE-CTR > 59
023300         MOVE HEADER0 TO OUTFI
023400         WRITE OUTFI AFTER ADVANCING 0 LINES
023500         MOVE HEADER1 TO OUTFI
023600         WRITE OUTFI AFTER ADVANCING 2 LINES
023700         MOVE HEADER2 TO OUTFI
023800         WRITE OUTFI AFTER ADVANCING 1 LINES
023900         MOVE HEADER3 TO OUTFI
024000         WRITE OUTFI AFTER ADVANCING 1 LINES
024100         MOVE 5 TO LINE-CTR.
024200     GO TO 6-MAIN-CONT.
024300 6-MAIN-EXIT.    EXIT.
