001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TSTRMJOB.
001300 AUTHOR.              C HILLES.
001400 DATE-WRITTEN.        12/4/84.
001500 DATE-COMPILED.
002000*    THIS SUBPROGRAM IS DESGINED TO BE CALLED FROM AN OPTION
002100*    PROGRAM, OR FRONT END PROGRAM, TO A JOB STREAM.  THE
002200*    FRONT END PROGRAM DETERMINES USER OPTIONS FOR A BATCH
002300*    REPORT INTERACTIVELY (PROBABLY USING A VIEW SCREEN).
002400*    IT THEN PASSES THESE OPTIONS TO THIS SUBPROGRAM, ALONG
002500*    WITH OTHER PARAMETERS TELLING THIS SUBPROGRAM WHAT OBJECT
002600*    FILE TO RUN, ANY LIBRARYS TO USE, ETC.  THIS SUBPROGRAM
002700*    THEN CREATES A TEMPORARY FILE WHICH IS A JOB STREAM CONTAINING
002800*    ALL THE NEEDED JOB CARDS, RUN CARDS, ETC.  FOR THE JOB CARD
002900*    PASSWORD AND SIGNON, AND FOR REDEFINING PRINT FILE STATEMENTS,
003000*    IT READS FILES THAT MUST EXIST IN THE DB GROUP OF THE CME
003100*    ACCOUNT.  CIH.
003200
003300*   PARAMETERS
003400*   ----------
003500*
003600*    ALL THE FOLLOWING PARAMETERS ARE ACTUALLY PARTS OF A SINGLE
003700*    "COMMUNICATION AREA" PARAMETER PASSED TO THIS SUBPROGRAM:
003800*
003900*   STRM-RET-CODE   -  X(2)  -  A "00" IS RETURNED IF SUCCESSFUL
004000*                    EXECUTION.  THE COMMAND INTERPRETER ERROR IS
004100*                    RETURNED IF THE STREAM COMMAND FAILS.
004200*
004300*   STRM-MODE        -  S9(4) COMP - THIS WILL ALLOW FOR FUTURE
004400*                    EXPANSION OF PROGRAM. CURRENTLY IGNORED.
004500*
004600*   STRM CO CODE     -  X(3) - CONTAINS THE COMPANY CODE
004700*
004800*   STRM PRE RUN CARDS - CONSISTS OF UP TO 4 COMMAND CARDS THAT ARE
004900*                        PLACED BEFORE THE RUN COMMAND IN THE JOB.
005000*                        EACH ARE 80 CHARACTER IN LENGTH X(80).
005100*
005200*   STRM RUN COMMAND  - X(80) - CONTAINS THE ACTUAL RUN COMMAND
005300*                       FOR THE PROGRAM TO BE EXECUTED AND
005400*                       INCLUDES A LIB STATEMENT IF NEEDED.
005500*
005600*   STRM JOB NAME    -  X(8) - THE NAME USED FOR THE JOB NAME ON THE
005700*                    JOB CARD.
005800*                    CONVENTIONS.
005900*
006000*   ROUTE CARD       -  X(80) - PASS ROUTE INFORMATION, AS
006100*                    FOLLOWS:
006200*                       NAME OF USER TO ROUTE TO  X(15)
006300*                       USER DEPT                 X(4)
006400*                       PRINTER TO PRINT AT       X(3)
006500*                       USERNAME                  X(8)
006600*                       ACCOUNT                   X(8)
006700*                       GROUP                     X(8)
006800*                       TERMINAL                  X(8)
006900*
007000*   OPTION CARD      -  X(80) - PASS AN 80-BYTE CARD OF OPTIONS.
007100*                    THIS OPTION CARD WILL BE "ACCEPT"ed BY THE
007200*                    REPORT PROGRAM, AND PROVIDE THE REPORT
007300*                    PROGRAM WITH THE OPTIONS SPECIFIED IN THE FRONT-
007400*                    END PROGRAM.  AT THIS TIME, USER OPTIONS THAT
007500*                    EXCEED 80 BYTES CANNOT BE HANDLED BY THIS
007600*                    SUBPROGRAM.
007700
007800*   OPTION CARD2     -  X(80) -  FURTHER REPORT OPTIONS.  PASS
007900*                    SPACES IF NOT USED.
008000*
008100*   OPTION CARD3     -  X(80) -  FURTHER REPORT OPTIONS.  PASS
008200*                    SPACES IF NOT USED.
008300*
      *C
      *C   01MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09/08/1997   CA YODER
      *C     ADDED CALL TO CLSUBMIT3 IN ORDER TO SUBMIT JOB WITHOUT
      *C     SENDING A CONFIRMATION MESSAGE BACK TO THE USER.
      *C
011000 ENVIRONMENT DIVISION.
011100 CONFIGURATION SECTION.
011200 SOURCE-COMPUTER.  HP-3000.
011300 OBJECT-COMPUTER.  HP-3000.
011400 INPUT-OUTPUT SECTION.
011500 FILE-CONTROL.
011800
011900 DATA DIVISION.
012000 FILE SECTION.
013100
013200 WORKING-STORAGE SECTION.
       77  MCXCBLERR-SCOPE       PIC X(1)         VALUE "C".
013300 77  SUB                   PIC S9(4) COMP-4 VALUE ZEROS.
013400
015700**************************************************************
015800**                                                          **
015900**       J O B   S T E A M   W O R K                        **
016000**                                                          **
016100**************************************************************
016200
016300 01  JOBCARD-TITLE.
016500     05  JOBCARD-NAME.
016600         10  JOB-CARD-NAME-CHAR OCCURS 8 TIMES PIC X.
016900
017000 01  PRTNUM-JCW-LINE.
017100     05  FILLER            PIC X(15) VALUE ":SETJCW PRTNUM=".
017200     05  PRTNUM-JCW-VALUE  PIC X(3)  VALUE SPACES.
017300
017400 01  SPOOLTYP-JCW-LINE.
017500     05  FILLER            PIC X(18) VALUE ":SETJCW SPOOLTYPE=".
017600     05  SPOOLTYP-JCW-VALUE PIC X(3)  VALUE SPACES.
017700
017800 01  PRTRPT-FILE-STATEMENT.
017900     05  FILLER              PIC X(15) VALUE ":FILE REPORTFL=".
018000     05  PRTRPT-FILE-ST      PIC X(17).
018100
018200 01  PRTRPT-RUN-CARD.
018300     05  FILLER  PIC X(25) VALUE ":RUN XPRTRPT.OBJECT;LIB=P".
018400
      *------ WARNING: YOU CAN'T USE THE LAST 16 BYTES OF
      *------ CSUBJOB-PARM1-1. THE MAX SIZE OF THE COMMAND IS 256.
      *------ THE COMMAND LOOKS LIKE THIS IN THE JOB:
      *------   CALL PGM(XXXXXXXXXX) PARM('-A-' '-B-')
      *------ THE EXTRA BYTES ABOVE ADD UP TO 32 BYTES, LEAVING
      *------ 224 TOTAL FOR THE PARMS -A- AND -B-. TO BE COMPATIBLE
      *------ WITH OLD PROGRAMS WE ARE LEAVING 80 FOR HD-ROUTE-DATA
      *------ PLUS 2 80-BYTE ACCEPT LINES GIVING 240, SO DON'T USE
      *------ THE LAST 16 BYTES OF HD-ROUTE-DATA.  THE NORMAL HD-ROUTE
      *------ DATA HAS THE LAST 26 BYTES AS FILLER ANYWAY.
      *------ BY THE WAY THE SUBMIT JOB COMMAND STRIPS ANY TRAILING
      *------ BLANKS OFF THE PARAMTERS- THATS WHY IT WORKS AS LONG AS
      *------ THE LAST 16 BYTES OF HD-ROUTE-DATA (PARM1) ARE SPACES.
      *------ UH, ONE MORE THING. IN ORDER TO FORCE THE PASSING OF ANY
      *------ SPACES IN PARM2-1 AND PARM2-2 TO THE REPORT, WE HAVE TO
      *------ TACK ON A BYTE AT THE END WITH AN 'X', OTHERWISE THE
      *------ REPORT PGM WOULD GET GARBAGE IN THE END OF THE PARM.
       01  CSUBJOB-VARIABLES.
           05  CSUBJOB-PARM1.
               10 CSUBJOB-PARM1-1         PIC X(80).
           05  CSUBJOB-PARM2.
               10 CSUBJOB-PARM2-1         PIC X(80).
               10 CSUBJOB-PARM2-2.
                  15  FILLER              PIC X(31).
                  15  CSUBJOB-PARM2-2-LAST PIC X(1).
           05  CSUBJOB-PGM                PIC X(10).
           05  CSUBJOB-JOB                PIC X(10).
           05  CSUBJOB-JOBD               PIC X(10).
           05  CSUBJOB-OUTQ               PIC X(10).
           05  CSUBJOB-USER               PIC X(10).

018500**************************************************************
018600**                                                          **
018700**         L I N K A G E   S E C T I O N                    **
018800**                                                          **
018900**************************************************************
019000
019100 LINKAGE SECTION.
019200
019300 01  STRMRPT-COMAREA.
019400     05  STRM-RET-CODE             PIC X(2).
019500     05  STRM-MODE                 PIC S9(4) COMP-4.
019600     05  STRM-CO-CODE.
019700         10  CO-CODE-PREFIX        PIC X(2).
019800         10  CO-CODE-LAST-DIGIT    PIC X.
019900     05  STRM-PRE-RUN-CARDS.
020000         10  STRM-PRE-RUN-CARD1    PIC X(80).
020100         10  STRM-PRE-RUN-CARD2    PIC X(80).
020200         10  STRM-PRE-RUN-CARD3    PIC X(80).
020300         10  STRM-PRE-RUN-CARD4    PIC X(80).
020400     05  STRM-RUN-CARD             PIC X(80).
020500     05  STRM-JOB-NAME             PIC X(8).
      *-------- PARM1 FOR CALLING CLSUBMIT2
      *-------- THIS IS THE HD-ROUTE-DATA CARD, AND YOU CAN ONLY USE
      *-------- 64 BYTES OF IT! THE LAST 16 BYTES HAVE TO BE SPACES!
      *-------- TRUST ME, IT'S TRUE! NORMALLY ONLY THE 1ST 54 BYTES ARE
      *-------- USED.
020600     05  STRM-OPTION-CARD          PIC X(80).
      *-------- PARM2 FOR CALLING CLSUBMIT2
      *-------- YOU CAN ONLY PASS UP TO 160 BYTES IN PARM2 THEREFORE
      *-------- ONLY THE FIRST 160 BYTES OF STRM-OPTION-CARD2 CAN
      *-------- BE USED.  IN OTHER WORDS 2 80-BYTE LINES OF INPUT DATA.
020700     05  STRM-OPTION-CARD2         PIC X(720).
020800     05  STRM-OPTION-CARD2-RDF REDEFINES STRM-OPTION-CARD2
020900           OCCURS 9 TIMES          PIC X(80).
020910     05  STRM-OPTION-CARD2-CTR     PIC X(1).
021000     05  STRM-OPTION-CARD3         PIC X(80).
021100     05  STRM-PRTRPT-CARD.
021200         10  STRM-PRTRPT-FLAG      PIC X(1).
021300         10  STRM-PRTRPT-FILE      PIC X(17).
021400         10  STRM-PRTRPT-SPOOLTYP  PIC X(1).
021500         10  STRM-PRTRPT-PRINTER   PIC X(3).
021600
021700 PROCEDURE DIVISION USING STRMRPT-COMAREA.
021800 6-MAIN.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           MOVE SPACES                    TO CSUBJOB-PARM1,
                                             CSUBJOB-PARM2.
           MOVE STRM-RUN-CARD             TO CSUBJOB-PGM.
           MOVE STRM-JOB-NAME             TO JOBCARD-NAME.
           IF CO-CODE-PREFIX = "11"
               PERFORM 61-WRITE-AKRON-JOB-NAME  THRU 61-WAJN-X.
           MOVE JOBCARD-NAME              TO CSUBJOB-JOB.
           MOVE "*USRPRF"                 TO CSUBJOB-JOBD.
           MOVE "*JOBD"                   TO CSUBJOB-OUTQ.
           MOVE "*CURRENT"                TO CSUBJOB-USER.

026800*---------- WRITE ANY OF 9 POST-RUN CARDS (OPTION CARDS) WHICH
026900*---------- WERE PASSED BY THE MAIN PROGRAM.
           MOVE STRM-OPTION-CARD          TO CSUBJOB-PARM1-1.

027310*------------STRM-OPTION-CARD2 CAN BE USED FOR THE BUFFER
027320*------------DESCRIPTIONS OF PROGRAMS USING TRSCREEN.
027330*------------A BUFFER SIZE OF 220 BYTES CAN BE HANDLED.
027400     IF STRM-OPTION-CARD2-CTR > 0 OR
027410        STRM-OPTION-CARD2-RDF (1) > SPACES
027500         MOVE STRM-OPTION-CARD2-RDF(1) TO CSUBJOB-PARM2-1.
027700     IF STRM-OPTION-CARD2-CTR > 1 OR
027710        STRM-OPTION-CARD2-RDF (2) > SPACES
027800         MOVE STRM-OPTION-CARD2-RDF(2) TO CSUBJOB-PARM2-2.

      *----- THE SUBMIT JOB COMMAND WILL TRUNCATE ANY TRAILING
      *----- SPACES PASSED TO THE PROGRAM IN THE JOB. TO FORCE THE
      *----- SPACES TO BE PASSED WE PUT AN 'X' IN THE LAST BYTE.
           IF CSUBJOB-PARM2-2-LAST = SPACES
               MOVE "X" TO CSUBJOB-PARM2-2-LAST.

      *----- CALL CL PROGRAM TO DO A SBMJOB COMMAND
      *----- IF THE USER DOES NOT WANT A CONFIRMATION MESSAGE BACK
      *----- (AS IN SRELEASE), CALL CLSUBMIT3 INSTEAD.

           IF STRM-PRE-RUN-CARD1 = "NO CONFIRM"
               MOVE SPACES TO STRM-PRE-RUN-CARD1
               CALL "CLSUBMIT3" USING CSUBJOB-PGM
                                      CSUBJOB-PARM1
                                      CSUBJOB-PARM2
                                      CSUBJOB-JOB
                                      CSUBJOB-JOBD
                                      CSUBJOB-OUTQ
                                      CSUBJOB-USER
           ELSE
               CALL "CLSUBMIT2" USING CSUBJOB-PGM
                                      CSUBJOB-PARM1
                                      CSUBJOB-PARM2
                                      CSUBJOB-JOB
                                      CSUBJOB-JOBD
                                      CSUBJOB-OUTQ
                                      CSUBJOB-USER.
030400
030500*---------- IF CALLING PROGRAM WISHES TO USE THE "XPRTRPT"
030600*---------- PROGRAM TO PRINT A REPORT FROM A FILE, SET UP
030700*---------- SPECIAL JOB CARDS TO DO THIS.
030800*    IF STRM-PRTRPT-FLAG = "Y"
030900*        PERFORM 62-BUILD-PRTRPT THRU 629-BP-X.
031000
032300 6-MAIN-X.
032400     GOBACK.
032500
032600 61-WRITE-AKRON-JOB-NAME.
032700     ADD 1  TO  SUB.
032800     IF JOB-CARD-NAME-CHAR (SUB) = SPACES
032900         NEXT SENTENCE
033000     ELSE
033100     IF SUB > 7
033200         NEXT SENTENCE
033300     ELSE
033400         GO TO 61-WRITE-AKRON-JOB-NAME.
033500     MOVE CO-CODE-LAST-DIGIT  TO  JOB-CARD-NAME-CHAR (SUB).
033600
033700 61-WAJN-X.
033800     EXIT.
033900
034000*62-BUILD-PRTRPT.
034100*---------- DEFAUT FOR SPOOLTYP (1 = JSPOOLER SPOOLED, 0 =
034200*---------- MPE SPOOLED) IS 1.  DEFAULT FOR PRINTER IS DEVICE
034300*---------- 6 (LINE PRINTER) IF MPE SPOOLED, AND PRT-NUM 99
034400*---------- (ALSO THE LINE PRINTER) IF JSPOOLER SPOOLED.
034500
034600*    IF STRM-PRTRPT-SPOOLTYP = "1" OR "0"
034700*        NEXT SENTENCE
034800*    ELSE
034900*        MOVE "1"                  TO  STRM-PRTRPT-SPOOLTYP.
035000
035100*    IF STRM-PRTRPT-PRINTER NOT NUMERIC
035200*        IF STRM-PRTRPT-SPOOLTYP = 1
035300*            MOVE 6                TO  STRM-PRTRPT-PRINTER
035400*        ELSE
035500*            MOVE 99               TO  STRM-PRTRPT-PRINTER.
035600
035700*    MOVE STRM-PRTRPT-PRINTER      TO  PRTNUM-JCW-VALUE.
035800*    MOVE PRTNUM-JCW-LINE          TO  STREAM-REC.
035900*    WRITE STREAM-REC.
036000
036100*    MOVE STRM-PRTRPT-SPOOLTYP     TO  SPOOLTYP-JCW-VALUE.
036200*    MOVE SPOOLTYP-JCW-LINE        TO  STREAM-REC.
036300*    WRITE STREAM-REC.
036400
036500*    MOVE STRM-PRTRPT-FILE         TO  PRTRPT-FILE-ST.
036600*    MOVE PRTRPT-FILE-STATEMENT    TO  STREAM-REC.
036700*    WRITE STREAM-REC.
036800
036900*    MOVE PRTRPT-RUN-CARD          TO  STREAM-REC.
037000*    WRITE STREAM-REC.
037100
037200*629-BP-X.
037300*    EXIT.
