       IDENTIFICATION DIVISION.
       PROGRAM-ID. TSTRMAVG.
       AUTHOR. KURT MOVSESIAN.
       DATE-WRITTEN.    SEPTEMBER 4, 1987.
      *REMARKS.

      *D************************************************************
      *D*                                                          *
      *D* T S T R M A V G   THIS IS AN ONLINE PROGRAM THAT         *
      *D*  LAUNCHES THE JOB THAT CALCULATES A NEW AVERAGE COST     *
      *D*  FOR RAW MATERIALS.  THE JOB IS 'BXPRCAVG'.  THIS        *
      *D*  PROCEDURE IS PART OF THE MONTH-END CLOSING PROCEDURE    *
      *D*  FOR THE CORPORATE STORES ACCOUNTING SYSTEM (CSAS)       *
      *D*                                                          *
      *D************************************************************

      *C  CHANGES
      *C  JUNE 29, 1993       CR KALMAN           REQ #:
      *C  ADDED THE FREIGHT STATISTICS TO THE SCREEN. WILL ONLY
      *C  SHOW IF THE PLANT IS USING FREIGHT.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       SPECIAL-NAMES.  I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZSTRMAVG-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.
           SELECT MACTINFO-I
                  ASSIGN TO DATABASE-MCFLCA0101
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC           PIC X(2000).
       FD  MACTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MACTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCA0101.
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       WORKING-STORAGE SECTION.
       77  COMPANY-SAVE                 PIC X(3)   VALUE SPACES.
       77  FATAL-ERR-SW                 PIC X(1)   VALUE SPACES.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X      VALUE SPACES.
           05  FILE-STATUS-2            PIC X      VALUE SPACES.

       COPY CCHKOBJ IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
       COPY TDATECHK IN COPYLIB.

       01  TIME-WORKAREA.
           05  HH                       PIC X(2)  VALUE SPACES.
           05  MIN                      PIC X(2)  VALUE SPACES.
           05  SEC                      PIC X(2)  VALUE SPACES.

       01  DISPLAY-TIME.
           05  HH                       PIC X(2)  VALUE SPACES.
           05  FILLER                   PIC X(1)  VALUE ":".
           05  MIN                      PIC X(2)  VALUE SPACES.
           05  FILLER                   PIC X(1)  VALUE ":".
           05  SEC                      PIC X(2).

       COPY VCOMAREA IN COPYLIB.

       01  FORMFILE.
           05  FORM-FNAME                PIC X(8)  VALUE "FSTRMAVG".
           05  FILLER                    PIC X     VALUE ".".
           05  FORM-GNAME.
               10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
               10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
           05  FILLER                    PIC X(19) VALUE SPACES.

       01  MESSAGE-BUFFER.
           05  MSG-TEXT              PIC X(64)    VALUE SPACE.
           05  MSG-FLD               PIC X(12)    VALUE SPACE.
           05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.

       01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76   COMP-4.

       01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 76   COMP-4.

       01  FIELD-NUMBER              PIC S9(4)    VALUE 1    COMP-4.


       01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS COMP-4.

       01  SCREEN-PRINT-PARMS.
           05  PRINTCNTL             PIC S9(4)    VALUE ZERO  COMP-4.
           05  PAGECNTL              PIC S9(4)    VALUE 49    COMP-4.
           05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".

      *************************************************************
      **    PARAMETER AREA FOR 'TSHWRDFM'                        **
      *************************************************************
       COPY DISPDATA   IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.

      **************************************************************
      **************************************************************
      **                                                          **
      **             TERMINAL I/O DATA AREA                       **
      **                                                          **
      **************************************************************
      **************************************************************

       01  SCREEN-1.
           05  DE1-COMPANY              PIC X(3).
           05  DE1-DATE-LAST-TC         PIC X(8).
           05  DE1-TIME-LAST-TC         PIC X(8).
           05  DE1-LAST-MFST-CSAS       PIC X(3).
           05  DE1-CUTOFF-DATE          PIC X(8).
           05  DE1-LAST-MFST-CSIS       PIC X(3).
           05  DE1-LAST-MFST-STATUS     PIC X(4).
           05  DE1-FRT-MSG              PIC X(49).
           05  DE1-DATE-LAST-FRT        PIC X(8).
           05  DE1-TIME-LAST-FRT        PIC X(8).
           05  DE1-CMDLINE              PIC X(79).
           05  DE1-MSGLINE              PIC X(79).


      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY MACTINFO IN COPYLIB.

       COPY MPLT0    IN COPYLIB.

       COPY MPLTP01  IN COPYLIB.

       COPY MPLTPMAN IN COPYLIB.

      *********************
      *                   *
      *   DATA SET NAMES  *
      *                   *
      *********************

       01  DSET-NAMES.
           05  DSET-NAME                PIC X(16)  VALUE SPACES.
           05  DSET-MPLTINFO            PIC X(16)  VALUE "MPLTINFO;".
           05  DSET-MACCT           PIC X(16)  VALUE "MACCOUNT-INFO;".

       COPY DATAB  IN COPYLIB.

       COPY DBCSACCT IN COPYLIB.

       01 ITEMS-LISTING.
           05  ALL-ITEMS                PIC XX    VALUE "@;".

       01 ARG-VALUES.
           05  MACCT-KEY              PIC X(4)  VALUE SPACES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.

       01  COMMAND-AREA.
           05  QCMDEXC-BXPRCAVG.
               10  STRDBRDR-BXPRCAVG  PIC X(36) VALUE
               "STRDBRDR FILE(QJOBSRC) MBR(BXPRCAVG)".
               10  DBR-BXPRCAVG-PARM2 PIC S9(10)V9(5) COMP-3 VALUE 36.
           05  OVERRIDE-ZSTRMAVG      PIC X(34) VALUE
               "OVRDSPF FILE(ZSTRMAVG) SHARE(*YES)".
           05  OVERRIDE-PARM2         PIC S9(10)V9(5) COMP-3 VALUE 34.

       COPY TBLOWUP IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.
       COPY CATREAD  IN COPYLIB.


       PROCEDURE DIVISION.

       PROC-DIV SECTION 01.

       BEGIN-HERE.
           PERFORM 1-HSK THRU 1-H-X.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ  THRU 2-EOJ-X.

           GOBACK.

       1-HSK.
           CALL "QCMDEXC" USING OVERRIDE-ZSTRMAVG, OVERRIDE-PARM2.
           OPEN I-O DISPLAY-FILE.

           OPEN INPUT MPLTINFO-I, MACTINFO-I.

      **************************************************
      *                                                *
      *   GET CO. FROM MPLTINFO                        *
      *   USING 'P 01' AS THE ARGUMENT                 *
      *                                                *
      **************************************************

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                 TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY            TO  COMPANY-SAVE.

       1-H-X.
           EXIT.

       2-EOJ.
           CLOSE DISPLAY-FILE.

           CLOSE MPLTINFO-I, MACTINFO-I.

       2-EOJ-X.
            EXIT.

      ******************************************************
      **                                                  **
      **   BLOWUP ROUTINE                                 **
      **                                                  **
      ******************************************************

       2-BLOWUP.
           MOVE "TSTRMAVG"              TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       2-BLOWUP-X.
           EXIT.

       4-PGM-ERROR.
           MOVE B"1" TO IND(99), IND(FIELD-NUMBER).

       4-PGM-ERROR-X.
           EXIT.


      **************************************************
      *                                                *
      *     6 - M A I N                                *
      *                                                *
      **************************************************

       6-MAIN.
           MOVE "STRMAVG1"  TO  VIEW-NFNAME.

       6-PUT-BUFFER-1.
           MOVE SPACES                  TO  SCREEN-1.
           MOVE COMPANY-SAVE            TO  DE1-COMPANY.
           PERFORM 61-GET-SCREEN-INFO  THRU  61-GSI-X.

       6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1                TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC             TO  SCREEN-1.
           MOVE ZEROS                   TO  VIEW-SHOWCONTROL.

           IF VIEW-LASTKEY = 1
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 3
                   GO TO 6-M-X
           ELSE
           IF VIEW-LASTKEY = 2 OR
              VIEW-LASTKEY = 4 OR
              VIEW-LASTKEY = 5 OR
              VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
      *        "* INVALID FUNCTION KEY ENTERED *"
               MOVE   9 TO LANG-SETNUM
               MOVE  10 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
               MOVE B"1"            TO  IND(99)
               GO TO 6-SHOWFORM-SCREEN-1
           ELSE
      *        ***  SELECT THE APPROPRIATE  'FUNCTION KEY'  ***
               MOVE  19 TO LANG-SETNUM
               MOVE  13 TO LANG-MSGNUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER  TO  DE1-MSGLINE
               MOVE B"1"            TO  IND(99)
               GO TO  6-SHOWFORM-SCREEN-1.

           PERFORM 62-LAUNCH-BATCH-JOB  THRU  62-LBJ-X.

       6-M-X.
           EXIT.


       61-GET-SCREEN-INFO.
           MOVE "MTED"                  TO  MACCT-KEY.
           MOVE MACCT-KEY TO INFOKEY OF MACTINFO-REC-I.
           READ MACTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET MACCT-INFO * 61-GSI" TO BU-DISPLAY-MSG
               MOVE ACCTG-BASE          TO BASE
               MOVE MACCT-KEY           TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           MOVE 4                         TO  DATE-MODE.
           MOVE MACCT-LATEST-CUTOFF-DATE  TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT          TO  DE1-DATE-LAST-TC.

           MOVE MACCT-LATEST-CUTOFF-TIME  TO  TIME-WORKAREA.
           MOVE CORR TIME-WORKAREA      TO  DISPLAY-TIME.
           MOVE DISPLAY-TIME            TO  DE1-TIME-LAST-TC.

           MOVE MACCT-LAST-MANIFEST     TO  DE1-LAST-MFST-CSAS.

           MOVE MACCT-MONTH-END-DATE    TO  DATE-VALIDATE-IN.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-SLASH-OUT          TO  DE1-CUTOFF-DATE.

           MOVE "PMAN"                  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "GET PLTINFO 'PMAN' *61-GSI" TO BU-DISPLAY-MSG
               MOVE PLT-ARG             TO BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.

           MOVE MPLTINFO-MAN-NO         TO  DE1-LAST-MFST-CSIS.
           MOVE MPLTINFO-MAN-STATUS     TO  DE1-LAST-MFST-STATUS.

           MOVE "FRT" TO INFOKEY OF MACTINFO-REC-I.
           READ MACTINFO-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               INITIALIZE DE1-FRT-MSG, DE1-DATE-LAST-FRT,
                  DE1-TIME-LAST-FRT
           ELSE
               MOVE "DATE AND TIME OF LAST FREIGHT PROCESSED"
                  TO DE1-FRT-MSG
               MOVE 4 TO DATE-MODE
               MOVE MACCT-FRT-LAST-DATE-PROCESSED (3:6)
                    TO DATE-VALIDATE-IN
               CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS
               MOVE DATE-SLASH-OUT           TO DE1-DATE-LAST-FRT
               MOVE MACCT-FRT-LAST-TIME-PROCESSED TO TIME-WORKAREA
               MOVE CORR TIME-WORKAREA       TO DISPLAY-TIME
               MOVE DISPLAY-TIME             TO DE1-TIME-LAST-FRT.

       61-GSI-X.
           EXIT.


       62-LAUNCH-BATCH-JOB.

           CALL "QCMDEXC" USING STRDBRDR-BXPRCAVG, DBR-BXPRCAVG-PARM2.

       62-LBJ-X.
           EXIT.

       COPY DISPCALL IN COPYLIB.

       999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
       999-CATREAD-EXIT.
           EXIT.
