       IDENTIFICATION DIVISION.
       PROGRAM-ID.          TSTRRCV.
       AUTHOR.              J BUNGO.
       DATE-WRITTEN.        07/10/97.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *SECURITY.
      *REMARKS.
      *   COPIED FROM TUDCSTR AND MODIFIED TO USE AS A STAND
      *   ALONE TO MAKE STOREROOM RECEIPT (SR) A SEPARATE
      *   TRANSACTION FROM THE STOREROOM EXECUTIVE MENU.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  AS-400.
       OBJECT-COMPUTER.  AS-400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MPLTINFO-PK-I
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.


       DATA DIVISION.
       FILE SECTION.
      *------ FD AREA FOR IBM ONLY ------*
       FD  MPLTINFO-PK-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-PK-REC-I.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.


       WORKING-STORAGE SECTION.

       77  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

      **************************************************************
      **                                                          **
      **     S U B P R O G R A M   A R E A S                      **
      **                                                          **
      **************************************************************

       COPY TBLOWUP    IN COPYLIB.
       COPY TSPLPRT    IN COPYLIB.
       COPY TSHWRDFM   IN COPYLIB.

       COPY MULTSTR    IN COPYLIB.

      **************************************************************
      **                                                          **
      **                  V I E W   W O R K                       **
      **                                                          **
      **************************************************************

       COPY VCOMAREA IN COPYLIB.

      **************************************************************
      **                                                          **
      **            D A T A B A S E   W O R K                     **
      **                                                          **
      **************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1             PIC X  VALUE "0".
           05  FILE-STATUS-2             PIC X  VALUE "0".

       01  MPLTINFO-STATUS               PIC X(2).
       01  BASE                          PIC X(24) VALUE "  STORES;".

       COPY DBSTAT IN COPYLIB.

       01  PLT-ARG                       PIC X(4)  VALUE SPACES.

       COPY MPLT0    IN COPYLIB.
       COPY MPLTST   IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.

      **************************************
      *                                    *
      *    NATIVE LANGUAGE SUPPORT AREA    *
      *                                    *
      **************************************

       COPY LANGUAGE IN COPYLIB.


       PROCEDURE DIVISION.
       0000-START.

           PERFORM 1000-HOUSEKEEP THRU 1990-H-X.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 2000-EOJ.
           GOBACK.

       1000-HOUSEKEEP.
           PERFORM 9999-OPEN-STUFF.

           CALL "TSPLPRT" USING SP-RET-CODE, SP-AREA.
           IF SP-RET-CODE = "NF"
               MOVE "SPOOL KEY NOT FOUND * TSTRRCV" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP
           ELSE
           IF SP-RET-CODE NOT = "00"
               MOVE "TSPLPRT ERROR * TSTRRCV" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

           MOVE SP-USERNAME              TO  SRF-USERNAME.

           MOVE "P 01"                   TO  PLT-ARG.
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           MOVE MPLTINFO-COMPANY         TO  SRF-MPLTINFO-COMPANY.


      *---------- THE STST KEY IN MPLTINFO TELLS IF THIS IS A MULTIPLE
      *---------- STOREROOM PLANT.  IF THE "ALWAYS-MULT-STR-CODE" FLAG IS
      *---------- SET TO "Y", ALL CODES ARE CONSIDERED "MULTIPLE STOREROOM
      *---------- CODES".  IF NOT, ONLY CODES WITH AN "A-", "B-", ETC PREFIX
      *---------- IN AT LEAST 1 LOCATION ARE CONSIDERED MULT-STR-CODES.
           MOVE SPACES                   TO  BUF-MPLTINFO
           MOVE "STST"                   TO  PLT-ARG
           PERFORM 9999-GETKEY-MPLTINFO-PK-I.
           IF NO-ENTRY
               MOVE "N"                  TO  MULT-STR-FLAG
               MOVE "N"                  TO  ALWAYS-MULT-STR-CODE-FLAG
               MOVE "Y"                  TO  WO-OVERRD-ENTRY
               MOVE "Y"                  TO  WO-OVERRD-EXP
               MOVE "N"                  TO  ENTRY-OVERRD-EXP
               MOVE "N"                  TO  WS-PW-SW
               MOVE "N"                  TO  VALID-EMPL-CRAFTWS
               MOVE "N"                  TO  VALID-EMPL-STORES
           ELSE
               MOVE MPLTINFO-ST          TO  MULTIPLE-STR-DATA.

      *---------- THE 7TH DIGIT OF THE USER TELLS WHICH STOREROOM WE ARE
      *---------- AT IN A MULT-STR SITUATION.  (IE. "STORESA" MEANS WE ARE
      *---------- AT STOREROOM A, ETC).
           IF MULT-STR-FLAG = "Y"
               MOVE SRF-USER-7           TO  MULT-STR-STR-1
               MOVE SRF-USER-8           TO  MULT-STR-STR-2.
       1990-H-X.
           EXIT.

       2000-EOJ.
           PERFORM 9999-CLOSE-STUFF.

       2100-BLOWUP.
           MOVE "TUDCSTR"                TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
             VIEW-COMAREA, DUMMY-KSAM-STAT, BU-DISPLAY-MSG,
             BU-DISPLAY-FLDS.

       6000-MAIN.
       6010-GETNEXTFORM.
               CALL "SSTRRCV" USING BASE, VIEW-COMAREA, LANGUAGE-PARMS,
                 SRF-BUF-MPLTINFO, MULTIPLE-STR-DATA.
       6990-MAIN-X.
           EXIT.


       9999-GETKEY-MPLTINFO-PK-I.
           MOVE 0 TO COND-WORD.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-PK-REC-I.
           READ MPLTINFO-PK-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETKEY ERR 9999-GETKEY-MPLTINFO-PK-I"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN INPUT MPLTINFO-PK-I.
       9999-CLOSE-STUFF.
           CLOSE MPLTINFO-PK-I.
