000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID.    TSUBCRFT.
000800*REMARKS.       CRAFTSMAN SUMMARY REPORT.
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER.   AS400.
001300 OBJECT-COMPUTER.   AS400.
001400 COPY SPECIALN IN COPYLIB.
001600 INPUT-OUTPUT SECTION.
001700 FILE-CONTROL.
001800     SELECT OUT-FILE
001900         ASSIGN TO DATABASE-FILEOUT
               ORGANIZATION IS RELATIVE
002000         ACCESS MODE IS RANDOM
002100         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS OF-STATUS.
002200
002300     SELECT PRINT-FILE
002400         ASSIGN TO PRINTER-MCPRT.
002500
002600     SELECT SORT-FILE
002700         ASSIGN TO DISK-SORTFILE.
002800
           SELECT SUM-FILE
               ASSIGN TO DATABASE-MCFPSUMFIL
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS SUM-STATUS.

           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.

           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.

           SELECT WO-LAST-NUM-USED-FILE
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO-9
               FILE STATUS IS WLNU-STATUS.

           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WPF-STATUS.

002900 DATA DIVISION.
003000 FILE SECTION.
003200 FD  OUT-FILE RECORD CONTAINS 47 CHARACTERS
003300     LABEL RECORD IS OMITTED
003400     DATA RECORD IS OUT-REC.
003500 01  OUT-REC.
003600     05  OUT-REC-X.
003700         10  OUT-CRFT-NAME            PIC X(10).
003800         10  OUT-CC-NUM               PIC X(04).
003900         10  OUT-ZONE                 PIC X(04).
004000         10  OUT-SHIFT                PIC X.
004100     05  OUT-REC-9.
004200         10  OUT-P1-WOS               PIC 9(03).
004300         10  OUT-P1-RETM              PIC 9(04).
004400         10  OUT-P2-WOS               PIC 9(03).
004500         10  OUT-P2-RETM              PIC 9(04).
004600         10  OUT-P3-WOS               PIC 9(03).
004700         10  OUT-P3-RETM              PIC 9(04).
004800         10  OUT-PX-WOS               PIC 9(03).
004900         10  OUT-PX-RETM              PIC 9(04).
005000
005100 FD  PRINT-FILE RECORD CONTAINS 132 CHARACTERS
005200     LABEL RECORD IS OMITTED
005300     DATA RECORD IS PRT-REC.
005400 01  PRT-REC.
           05  PRT-TYPE                     PIC X(8).
           05  PRT-LINE                     PIC X(124).
005500
005600 SD  SORT-FILE RECORD CONTAINS 32 CHARACTERS
005700     DATA RECORD IS SORT-REC.
005800 01  SORT-REC.
005900     05  SORT-WO-NUM                  PIC X(07).
006000     05  SORT-NAME                    PIC X(10).
006100     05  SORT-NUM                     PIC X(04).
006200     05  SORT-HRS                     PIC 9(04).
006300     05  SORT-PRTY                    PIC X(02).
006400     05  SORT-ZONE                    PIC X(04).
006500     05  SORT-SHIFT                   PIC X.
006600
       FD  SUM-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS SUMREC.
       01  SUMREC                        PIC X(80).

       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  WO-LAST-NUM-USED-FILE
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

006800 WORKING-STORAGE SECTION.
       77  RECS-WRITTEN-CTR                 PIC 9(8).
006900 01  ACT-KEY         VALUE 0          PIC 9(9).
007000 01  ARG-NO-9                         PIC 9(9).
007100 01  ARG-NO.
007200     05  ARG-NO-WO   VALUE SPACES     PIC X(07).
007300     05  ARG-NO-FIL  VALUE SPACES     PIC X(03).
       01  BLOWUP-BASE                      PIC X(16).
       01  C-DATE.
           05  C-DATE-MM                    PIC XX.
           05  FILLER                       PIC X.
           05  C-DATE-DD                    PIC XX.
           05  FILLER                       PIC X.
           05  C-DATE-YY                    PIC XX.
       COPY CATREAD OF COPYLIB.
       01  COMPRESS-PRINT                   PIC X(8).
       COPY CPYIND  OF COPYLIB.
007500 01  CRAFT-BUFF.                      COPY MWOCRAFT OF COPYLIB.
       COPY CCRTFILE   IN COPYLIB.
007800 01  CURDATE-BUFFER.
007900     05  YY-BUFFER                    PIC XX.
008100     05  MM-BUFFER                    PIC XX.
008300     05  DD-BUFFER                    PIC XX.
008400 01  CRAFT-ARG       VALUE SPACES     PIC XX.
008500 COPY TDATESUB   IN COPYLIB.
008600 01  DATE-WA-ALL.
008700     05  DATE-WA.
008800         10  DATE-WA-YY               PIC XX.
008900         10  DATE-WA-MM               PIC XX.
009000         10  DATE-WA-DD               PIC XX.
009100     05  DATE-WA-9 REDEFINES DATE-WA.
009200         10  DATE-WA-YY-9             PIC 99.
009300         10  DATE-WA-MM-9             PIC 99.
009400         10  DATE-WA-DD-9             PIC 99.
009500 01  DATE-WA-SAV1                     PIC 999999.
009600 01  DATE-WA-SAV2                     PIC 999999.
009700 01  DATE-WA-2.
009800     05  DATE-WA-YY-2                 PIC 99.
009900     05  DATE-WA-MM-2                 PIC 99.
010000     05  DATE-WA-DD-2                 PIC 99.
       01  DAY-DIGIT                        PIC X.
010100 01  DBPARAMETERS.                    COPY DBPARMS OF COPYLIB.
       01  DELETE-FILE     VALUE "MCFPSUMFIL" PIC X(10).
010400 01  EOP-SW          VALUE ZERO       PIC 9     COMP.
010500     88  EOP-SW-ON   VALUE 1.
010600 01  EOS-SW          VALUE ZERO       PIC 9     COMP.
010700     88  EOS-SW-ON   VALUE 1.                                            F
010800 01  ERROR-BUFFER                     PIC X(80).
       COPY ESCNAM2 IN COPYLIB.
       01  FILE-STATUSES.
           05  LCSF-STATUS                  PIC XX.
           05  OF-STATUS                    PIC XX.
           05  PF-STATUS                    PIC XX.
           05  SUM-STATUS                   PIC XX.
           05  WBF-STATUS                   PIC XX.
           05  WLF-STATUS                   PIC XX.
           05  WLNU-STATUS                  PIC XX.
           05  WPF-STATUS                   PIC XX.
011900 01  FIRST-SW                         PIC 9     COMP.
012000     88  FIRST-SW-ON VALUE 1.
       01  GREG-DATE.
           05  GREG-CC                      PIC XX.
           05  GREG-DATE-YMD.
               10  GREG-YY                  PIC XX.
               10  GREG-MM                  PIC XX.
               10  GREG-DD                  PIC XX.
012100 01  HOLD-HRS        VALUE 0          PIC 9(6)  COMP.
012200 01  HEADER-ONE.
012300     05  FILLER  PIC X(08)  VALUE "TSUMCRFT".
012400     05  FILLER  PIC X(11)  VALUE SPACES.
012500     05  FILLER  PIC X(13)  VALUE "PRINT DATE:  ".
012600     05  CDATE-H PIC X(08).
012700     05  FILLER  PIC X(04)  VALUE SPACES.
012800     05  FILLER  PIC X(07)  VALUE "TIME:  ".
012900     05  TIME-H  PIC X(04).
013000     05  FILLER  PIC X(14)  VALUE "        PAGE: ".
013100     05  PAGE-H  PIC ZZZZ9  VALUE ZERO.
013200     05  FILLER  PIC X(06)   VALUE SPACES.
013300 01  HEADER-TWO.
013400     05  FILLER  PIC X(17)  VALUE "CRAFTSMAN SUMMARY".
013500     05  FILLER  PIC X(09)  VALUE "  ZONE:  ".
013600     05  ZONE-H  PIC X(04).
013700     05  FILLER  PIC X(09)  VALUE "  DEPT:  ".
013800     05  DEPT-H  PIC X(04).
013900     05  FILLER  PIC X(09)  VALUE "  DATE:  ".
014000     05  DATE-H  PIC X(06).
014100     05  FILLER  PIC X(10)  VALUE "  SHIFT:  ".
014200     05  SHIFT-H PIC X(01).
014300     05  FILLER  PIC X(09)  VALUE "  CRAFT: ".
014400     05  CRAFT-H PIC X(02).
014500 01  HEADER-THREE.
014600     05  FILLER  PIC X(19)  VALUE SPACES.
014700     05  FILLER  PIC X(11)  VALUE "PRIORITY 1 ".
014800     05  FILLER  PIC X(11)  VALUE "PRIORITY 2 ".
014900     05  FILLER  PIC X(11)  VALUE "PRIORITY 3 ".
015000     05  FILLER  PIC X(11)  VALUE "PRIORITY X ".
015100     05  FILLER  PIC X(17)  VALUE "TOT  TOT   AVTM  ".
015200 01  HEADER-FOUR.
015300     05  FILLER  PIC X(19)  VALUE "CRAFTSMAN    CC #  ".
015400     05  FILLER  PIC X(11)  VALUE "W/O  RETM  ".
015500     05  FILLER  PIC X(11)  VALUE "W/O  RETM  ".
015600     05  FILLER  PIC X(11)  VALUE "W/O  RETM  ".
015700     05  FILLER  PIC X(11)  VALUE "W/O  RETM  ".
015800     05  FILLER  PIC X(17)  VALUE "W/O  RETM  PERWO ".
015900 01  HEADER-DOTS.
016000     05  FILLER  PIC X(80)  VALUE ALL "-".
       COPY IOFEEDBACK IN COPYLIB.
       01  JULIAN-DATE.
           05  JULIAN-DATE-CC               PIC 99.
           05  JULIAN-DATE-YY               PIC 99.
           05  JULIAN-DATE-DDD              PIC 999.
       01  JULIAN-DATE-9 REDEFINES JULIAN-DATE  PIC 9(7).
       01  LEAP-YEAR-FLAG                   PIC X.
017100 01  LINE-C   VALUE 59                PIC 9(5)  COMP.
017200 01  LABOR-DAY-START                  PIC 9999.
017300 COPY LANGSUB   IN COPYLIB.
017400 01  LS                               PIC 9999.
017500 01  LM                               PIC 9999.
017600 01  LAST-WO-USED-BUF.       COPY MLASTWO  OF COPYLIB.
017700 01  LINK-DATA.
017800     05  ZONE-BUF-LINK                PIC X(04).
017900     05  TIME-IN.
018000         10  HRS-IN                   PIC 99.
018100         10  MIN-IN                   PIC 99.
018200     05  CODE-BUF                     PIC X.
018300     05  SHIFTS.
018400         10  S-1                      PIC 9999.
018500         10  E-1                      PIC 9999.
018600         10  S-2                      PIC 9999.
018700         10  E-2                      PIC 9999.
018800         10  S-3                      PIC 9999.
018900         10  E-3                      PIC 9999.
019000         10  S-4                      PIC 9999.
019100         10  E-4                      PIC 9999.
019200     05  CURR-SHIFT                   PIC 9.
019300 01  MESSAGE-V.
019400     05 M-1                           PIC X(79).
019500     05 M-2                           PIC X(79).
019600     05 M-3                           PIC X(79).
019700     05 M-4                           PIC X(79).
019800     05 M-5                           PIC +9999.
020100 01  NAME-SAVE       VALUE SPACES     PIC X(16).
       01  NORMAL-PRINT                     PIC X(8).
020200 01  NUM-COPIES      VALUE 1          PIC S99   COMP.
       COPY OVRPFDATA IN COPYLIB.
020400 01  PAGE-CNTR       VALUE ZERO       PIC 9(5)  COMP.
020500 01  PRINTER-NUM     VALUE 0          PIC S99   COMP.
020600 01  PRTY            VALUE 0          PIC S9    COMP.
020700 01  PRINT-BUFFER.
020800     05  FILLER         PIC X(01)  VALUE SPACES.
020900     05  PT-CRFT-NAME   PIC X(10).
021000     05  FILLER         PIC X(02)  VALUE SPACES.
021100     05  PT-CC-NUM      PIC X(04).
021200     05  FILLER         PIC X(02)  VALUE SPACES.
021300     05  PT-P1-WOS      PIC ZZ9    VALUE ZEROS.
021400     05  FILLER         PIC X(02)  VALUE SPACES.
021500     05  PT-P1-RETM.
021600         10  PTP1-HR    PIC Z9     VALUE ZEROS.
021700         10  FILLER     PIC X      VALUE ".".
021800         10  PTP1-4     PIC 9      VALUE ZERO.
021900     05  FILLER         PIC X(02)  VALUE SPACES.
022000     05  PT-P2-WOS      PIC ZZ9    VALUE ZEROS.
022100     05  FILLER         PIC X(02)  VALUE SPACES.
022200     05  PT-P2-RETM.
022300         10  PTP2-HR    PIC Z9     VALUE ZEROS.
022400         10  FILLER     PIC X      VALUE ".".
022500         10  PTP2-4     PIC 9      VALUE ZERO.
022600     05  FILLER         PIC X(02)  VALUE SPACES.
022700     05  PT-P3-WOS      PIC ZZ9    VALUE ZEROS.
022800     05  FILLER         PIC X(02)  VALUE SPACES.
022900     05  PT-P3-RETM.
023000         10  PTP3-HR    PIC Z9     VALUE ZEROS.
023100         10  FILLER     PIC X      VALUE ".".
023200         10  PTP3-4     PIC 9      VALUE ZERO.
023300     05  FILLER         PIC X(02)  VALUE SPACES.
023400     05  PT-PX-WOS      PIC ZZ9    VALUE ZEROS.
023500     05  FILLER         PIC X(02)  VALUE SPACES.
023600     05  PT-PX-RETM.
023700         10  PTPX-HR    PIC Z9     VALUE ZEROS.
023800         10  FILLER     PIC X      VALUE ".".
023900         10  PTPX-4     PIC 9      VALUE ZERO.
024000     05  FILLER         PIC X(02)  VALUE SPACES.
024100     05  PT-TOT-WOS     PIC ZZ9    VALUE ZEROS.
024200     05  FILLER         PIC X(02)  VALUE SPACES.
024300     05  PT-TOT-RETM.
024400         10  PTPT-HR    PIC Z9     VALUE ZEROS.
024500         10  FILLER     PIC X      VALUE ".".
024600         10  PTPT-4     PIC 9      VALUE ZERO.
024700     05  FILLER         PIC X(02)  VALUE SPACES.
024800     05  PT-AVE-TIME.
024900         10  PTPA-HR    PIC Z9     VALUE ZEROS.
025000         10  FILLER     PIC X      VALUE ".".
025100         10  PTPA-4     PIC 9      VALUE ZERO.
025200     05  FILLER         PIC X(02)  VALUE SPACES.
025300 01  PRINT-FILE-SWITCH  PIC X VALUE "N".
025400 01  PRINT-HOLD.
025500     05  WS-TOT-WOS     PIC 9(03) VALUE ZEROS.
025600     05  WS-TOT-RETM    PIC 9(04) VALUE ZEROS.
025700     05  WS-AVE-TIME    PIC 9(04) VALUE ZEROS.
027700 01  READ-DISPLAY.
027800     05  DATE-BUF.
027900         10  DATE-BUF-YY              PIC XX.
028000         10  DATE-BUF-MM              PIC XX.
028100         10  DATE-BUF-DD              PIC XX.
028200     05  SHIFT-BUF                    PIC X.
028300     05  ZONE-BUF.
               10  Z-BUF-1-2.
028400             15  Z-BUF-1              PIC X.
028500             15  Z-BUF-2              PIC X.
028600         10  Z-BUF-3                  PIC X.
028700         10  Z-BUF-4                  PIC X.
028800     05  DEPT-BUF                     PIC X(04).
028900     05  CRAFT-BUF                    PIC X(02).
           05  FILLER                       PIC XXX.
029200 01  SHIFT-SAVE      VALUE SPACES     PIC X.
030200 COPY DBSTAT   OF COPYLIB.
030300 01  STATUS-CHECK                     PIC X VALUE "O".
030600 01  SUB-TOT.
030700     05  FILLER         PIC X(16)  VALUE "TOTAL FOR SHIFT ".
030800     05  ST-SHIFT       PIC X(01)  VALUE SPACE.
030900     05  FILLER         PIC X(02)  VALUE SPACES.
031000     05  ST-P1-WOS      PIC ZZ9    VALUE ZEROS.
031100     05  FILLER         PIC X(02)  VALUE SPACES.
031200     05  ST-P1-RETM.
031300         10  STP1-HR    PIC Z9     VALUE ZEROS.
031400         10  FILLER     PIC X      VALUE ".".
031500         10  STP1-4     PIC 9      VALUE ZERO.
031600     05  FILLER         PIC X(02)  VALUE SPACES.
031700     05  ST-P2-WOS      PIC ZZ9    VALUE ZEROS.
031800     05  FILLER         PIC X(02)  VALUE SPACES.
031900     05  ST-P2-RETM.
032000         10  STP2-HR    PIC Z9     VALUE ZEROS.
032100         10  FILLER     PIC X      VALUE ".".
032200         10  STP2-4     PIC 9      VALUE ZERO.
032300     05  FILLER         PIC X(02)  VALUE SPACES.
032400     05  ST-P3-WOS      PIC ZZ9    VALUE ZEROS.
032500     05  FILLER         PIC X(02)  VALUE SPACES.
032600     05  ST-P3-RETM.
032700         10  STP3-HR    PIC Z9     VALUE ZEROS.
032800         10  FILLER     PIC X      VALUE ".".
032900         10  STP3-4     PIC 9      VALUE ZERO.
033000     05  FILLER         PIC X(02)  VALUE SPACES.
033100     05  ST-PX-WOS      PIC ZZ9    VALUE ZEROS.
033200     05  FILLER         PIC X(02)  VALUE SPACES.
033300     05  ST-PX-RETM.
033400         10  STPX-HR    PIC Z9     VALUE ZEROS.
033500         10  FILLER     PIC X      VALUE ".".
033600         10  STPX-4     PIC 9      VALUE ZERO.
033700     05  FILLER         PIC X      VALUE SPACES.
033800     05  ST-TOT-WOS     PIC ZZZ9   VALUE ZEROS.
033900     05  FILLER         PIC X      VALUE SPACES.
034000     05  ST-TOT-RETM.
034100         10  STPT-HR    PIC ZZ9    VALUE ZEROS.
034200         10  FILLER     PIC X      VALUE ".".
034300         10  STPT-4     PIC 9      VALUE ZERO.
034400     05  FILLER         PIC X      VALUE SPACES.
034500     05  ST-AVE-TIME.
034600         10  STPA-HR    PIC ZZ9    VALUE ZEROS.
034700         10  FILLER     PIC X      VALUE ".".
034800         10  STPA-4     PIC 9      VALUE ZERO.
034900     05  FILLER         PIC X(02)  VALUE SPACES.
035000 01  SUB-TOT-9.
035100     05  ST-P1-WOS-9         PIC 999.
035200     05  ST-P1-RETM-9        PIC 9999.
035300     05  ST-P2-WOS-9         PIC 999.
035400     05  ST-P2-RETM-9        PIC 9999.
035500     05  ST-P3-WOS-9         PIC 999.
035600     05  ST-P3-RETM-9        PIC 9999.
035700     05  ST-PX-WOS-9         PIC 999.
035800     05  ST-PX-RETM-9        PIC 9999.
035900     05  ST-TOT-WOS-9        PIC 999.
036000     05  ST-TOT-RETM-9       PIC 9999.
036100     05  ST-AVE-TIME-9       PIC 9999.
010900 COPY TBLOWUP IN COPYLIB.
       COPY THDPRT  IN COPYLIB.
036400 01  TIME-BUFFER.
036500     05  CUR-TIME.
036600         10  CUR-HRS         PIC XX.
036700         10  CUR-MIN         PIC XX.
036800     05  CUR-SEC             PIC XX.
036900 01  TIME-CONVERSION.
037000     05  MIN-HOLD            PIC 9999.
037100     05  TIME-HOLD           PIC 99V9.
037200     05  HOUR-HOLD REDEFINES TIME-HOLD.
037300         10  HR-1-2          PIC 99.
037400         10  HR-4            PIC 9.
037500     05  TOT-TIME-HOLD       PIC 999V9.
037600     05  TOT-HOUR-HOLD REDEFINES TOT-TIME-HOLD.
037700         10  HR-1-2-3        PIC 999.
037800         10  HR-5            PIC 9.
037900 01  TOT-LINE.
038000     05  FILLER  PIC X(15)  VALUE "TOTAL FOR ZONE ".
038100     05  T-ZONE         PIC X(04)  VALUE SPACES.
038200     05  T-P1-WOS       PIC ZZ9    VALUE ZEROS.
038300     05  FILLER         PIC X(02)  VALUE SPACES.
038400     05  T-P1-RETM.
038500         10  TP1-HR     PIC Z9     VALUE ZEROS.
038600         10  FILLER     PIC X      VALUE ".".
038700         10  TP1-4      PIC 9      VALUE ZERO.
038800     05  FILLER         PIC X(02)  VALUE SPACES.
038900     05  T-P2-WOS       PIC ZZ9    VALUE ZEROS.
039000     05  FILLER         PIC X(02)  VALUE SPACES.
039100     05  T-P2-RETM.
039200         10  TP2-HR     PIC Z9     VALUE ZEROS.
039300         10  FILLER     PIC X      VALUE ".".
039400         10  TP2-4      PIC 9      VALUE ZERO.
039500     05  FILLER         PIC X(02)  VALUE SPACES.
039600     05  T-P3-WOS       PIC ZZ9    VALUE ZEROS.
039700     05  FILLER         PIC X(02)  VALUE SPACES.
039800     05  T-P3-RETM.
039900         10  TP3-HR     PIC Z9     VALUE ZEROS.
040000         10  FILLER     PIC X      VALUE ".".
040100         10  TP3-4      PIC 9      VALUE ZERO.
040200     05  FILLER         PIC X(02)  VALUE SPACES.
040300     05  T-PX-WOS       PIC ZZ9    VALUE ZEROS.
040400     05  FILLER         PIC X(02)  VALUE SPACES.
040500     05  T-PX-RETM.
040600         10  TPX-HR     PIC Z9     VALUE ZEROS.
040700         10  FILLER     PIC X      VALUE ".".
040800         10  TPX-4      PIC 9      VALUE ZERO.
040900     05  FILLER         PIC X      VALUE SPACES.
041000     05  T-TOT-WOS      PIC ZZZ9   VALUE ZEROS.
041100     05  FILLER         PIC X      VALUE SPACES.
041200     05  T-TOT-RETM.
041300         10  TPT-HR     PIC ZZ9    VALUE ZEROS.
041400         10  FILLER     PIC X      VALUE ".".
041500         10  TPT-4      PIC 9      VALUE ZERO.
041600     05  FILLER         PIC X      VALUE SPACES.
041700     05  T-AVE-TIME.
041800         10  TPA-HR     PIC ZZ9    VALUE ZEROS.
041900         10  FILLER     PIC X      VALUE ".".
042000         10  TPA-4      PIC 9      VALUE ZERO.
042100     05  FILLER         PIC X(02)  VALUE SPACES.
042200 01  TOT-LINE-9.
042300     05  T-P1-WOS-9                   PIC 999.
042400     05  T-P1-RETM-9                  PIC 9999.
042500     05  T-P2-WOS-9                   PIC 999.
042600     05  T-P2-RETM-9                  PIC 9999.
042700     05  T-P3-WOS-9                   PIC 999.
042800     05  T-P3-RETM-9                  PIC 9999.
042900     05  T-PX-WOS-9                   PIC 999.
043000     05  T-PX-RETM-9                  PIC 9999.
043100     05  T-TOT-WOS-9                  PIC 999.
043200     05  T-TOT-RETM-9                 PIC 9999.
043300     05  T-AVE-TIME-9                 PIC 9999.
043500 01  WO-NUM-SAVE     VALUE SPACES     PIC X(07).
043600 01  WO-BASIC-DATA.                   COPY DWOBASIC OF COPYLIB.
043700 01  WO-LABOR-DATA.                   COPY DWOLABOR OF COPYLIB.
043800 01  WO-PLANNED-DATA.                 COPY DWOPLAN  OF COPYLIB.
043900 01  WORKING-MSG-1.
044000     05  FILLER  PIC X(15) VALUE "PROCESSING FILE".
044100     05  FILLER  PIC X(09) VALUE " ENTRIES.".
044200 01  WORKING-MSG-2.
044300     05  FILLER  PIC X(15) VALUE "WRITING PRINT F".
044400     05  FILLER  PIC X(09) VALUE "ILE.     ".
044500 01  WORKING-MSG-3.
044600     05  FILLER  PIC X(20) VALUE "  ****  THERE WERE N".
044700     05  FILLER  PIC X(20) VALUE "O RECORDS WHICH MET ".
044800     05  FILLER  PIC X(20) VALUE "THE DATA REQUIREMENT".
044900     05  FILLER  PIC X(20) VALUE "S REQUESTED  ****   ".
       COPY WSCONTROL OF COPYLIB.
045000 01  ZONE-SAVE          PIC X(4) VALUE SPACES.
045100 01  ZONE-ARGUMENT.
045200     05  Z-ARG-4        PIC X(4).
045300     05  Z-ARG-5        PIC X VALUE "1".
045400     05  FILLER         PIC X VALUE SPACE.
045500 01  ZONE-HOLD-1        PIC X(04).
045600 01  ZONE-HOLD-2        PIC X(04).
       01  ZONE-WORK.
           05  ZW-1-2.
               10  ZW-1       PIC X.
               10  ZW-2       PIC X.
           05  ZW-3           PIC X.
           05  ZW-4           PIC X.
045800 01  ZONE-PRTY-BUFF.    COPY MZONPRTY OF COPYLIB.
046000
046500 PROCEDURE DIVISION.
047000 BEGIN-PROC.
047100     PERFORM 1-HOUSKEEPING.
047200     PERFORM 6-MAIN THRU 6-MAIN-X.
105800     SORT SORT-FILE ASCENDING KEY
105900                    SORT-ZONE
106000                    SORT-SHIFT
106100                    SORT-NAME
106200                    SORT-WO-NUM
106300         INPUT  PROCEDURE 7-SORT-IN
106400         OUTPUT PROCEDURE 7-SORT-OUT.
           CLOSE OUT-FILE.
           OPEN INPUT OUT-FILE.
           IF ACT-KEY = 0
076900         PERFORM 5-HEADINGS
077000         MOVE HEADER-DOTS TO PRT-REC
077100         WRITE PRT-REC AFTER ADVANCING 3
077200         MOVE WORKING-MSG-3 TO PRT-REC
077300         WRITE PRT-REC
077400         MOVE SPACES TO PRT-REC
077500         WRITE PRT-REC
077600         MOVE HEADER-DOTS TO PRT-REC
077700         WRITE PRT-REC BEFORE ADVANCING NEW-PAGE
               GO TO 2-END-OF-JOB.
076100     MOVE ZEROS TO ACT-KEY SUB-TOT-9 TOT-LINE-9.
076200     MOVE ZONE-BUF   TO ZONE-H.
076300     MOVE DEPT-BUF   TO DEPT-H.
076400     MOVE DATE-BUF   TO DATE-H.
076500     MOVE SHIFT-BUF  TO SHIFT-H.
076600     MOVE CRAFT-BUF  TO CRAFT-H.
076700     PERFORM 5-READ-FILE THRU 5-RF-EXIT.
076800     IF FIRST-SW-ON
076900         PERFORM 5-HEADINGS
077000         MOVE HEADER-DOTS TO PRT-REC
077100         WRITE PRT-REC AFTER ADVANCING 3
077200         MOVE WORKING-MSG-3 TO PRT-REC
077300         WRITE PRT-REC
077400         MOVE SPACES TO PRT-REC
077500         WRITE PRT-REC
077600         MOVE HEADER-DOTS TO PRT-REC
077700         WRITE PRT-REC BEFORE ADVANCING NEW-PAGE
077800     ELSE
077900     MOVE SPACES TO PRT-REC
078000     WRITE PRT-REC BEFORE ADVANCING NEW-PAGE.

058100 2-END-OF-JOB.
076300     MOVE SPACES TO PRT-REC.
           MOVE NORMAL-PRINT TO PRT-TYPE.
076400     WRITE PRT-REC AFTER ADVANCING 1 LINES.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED-FILE.
           CLOSE WO-PLANNED-FILE.
058700     CLOSE OUT-FILE.
058900     CLOSE PRINT-FILE.
059700     IF ERROR-BUFFER = SPACES
059800         NEXT SENTENCE
059900     ELSE
060000     CALL "TERRORD" USING ERROR-BUFFER LANGUAGE-PARMS.
060200     GOBACK.
047700
047900 1-HOUSKEEPING.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY "HD-ROUTE-DATA = " HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISCSUM"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO PRT-REC
097800         WRITE PRT-REC AFTER ADVANCING 1
097900         GO TO 2-END-OF-JOB.
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
098600     IF NOT PAPER-IS-132-COLS
               MOVE COMPRESS-PRINT TO PRT-TYPE
098700         WRITE PRT-REC AFTER ADVANCING 0.
048200     MOVE LOW-VALUES TO STATUS-AREA.
048300     MOVE ZEROS TO SUB-TOT-9 TOT-LINE-9.
      *------ CALL CCRTFILE TO CREATE A TEMPORARY FILE 'FILEOUT'
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "FILEOUT"     TO CCRTFILE-FILE.
           MOVE "0047"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "01000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "03"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'FILEOUT' FAILED"
                  TO PRT-REC
               WRITE PRT-REC AFTER ADVANCING 1
               GO TO 2-END-OF-JOB.
           OPEN OUTPUT OUT-FILE.
           OPEN INPUT  SUM-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
           OPEN INPUT  WO-LAST-NUM-USED-FILE.
           ACCEPT TIME-BUFFER FROM TIME.
048700     MOVE CUR-TIME TO TIME-H.
054600     MOVE 1 TO ARG-NO-9, FIRST-SW.
           MOVE 0 TO COND-WORD.
023700     READ WO-LAST-NUM-USED-FILE INTO LAST-WO-USED-BUF
023800         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
055000     IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
056600     MOVE DATE-FLAG-SW TO DATE-CODE DATE-FLAG.
056700     ACCEPT CURDATE-BUFFER FROM DATE.
056800     MOVE 1 TO DATE-MODE.
056900     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
057000     MOVE DATE-SLASH-OUT TO CDATE-H.
           MOVE SPACES TO ERROR-BUFFER.

078300 5-READ-FILE.
078400     ADD 1 TO ACT-KEY.
           IF ACT-KEY > RECS-WRITTEN-CTR
               PERFORM 5-SUB-TOTAL THRU 5-ST-EXIT
               PERFORM 5-TOTAL     THRU 5-TOTAL-EXIT
               GO TO 5-RF-EXIT.
078500     READ OUT-FILE INVALID KEY
103900         PERFORM 5-SUB-TOTAL THRU 5-ST-EXIT
104000         PERFORM 5-TOTAL     THRU 5-TOTAL-EXIT
078700         GO TO 5-RF-EXIT.
078800     IF OUT-ZONE = T-ZONE
078900         NEXT SENTENCE
079000     ELSE
079100     IF ACT-KEY = 1
079200         MOVE OUT-ZONE TO T-ZONE ZONE-H
079300         MOVE 59 TO LINE-C
079400         MOVE OUT-SHIFT TO ST-SHIFT
079500     ELSE
079600     PERFORM 5-SUB-TOTAL THRU 5-ST-EXIT
079700     PERFORM 5-TOTAL     THRU 5-TOTAL-EXIT
079800     MOVE OUT-ZONE TO T-ZONE ZONE-H
079900     MOVE 59 TO LINE-C
080000     MOVE OUT-SHIFT TO ST-SHIFT.
080100     IF OUT-SHIFT = ST-SHIFT
080200         NEXT SENTENCE
080300     ELSE
080400     PERFORM 5-SUB-TOTAL THRU 5-ST-EXIT
080500     MOVE OUT-SHIFT TO ST-SHIFT.
080600
080800 5-RF-CONT.
080900     IF LINE-C IS LESS THAN 59
081000         NEXT SENTENCE
081100     ELSE
           PERFORM 5-HEADINGS.
081200     MOVE OUT-CRFT-NAME    TO PT-CRFT-NAME.
081300     MOVE OUT-CC-NUM       TO PT-CC-NUM.
081400     MOVE OUT-P1-WOS       TO PT-P1-WOS.
081500     ADD  OUT-P1-WOS       TO ST-P1-WOS-9 T-P1-WOS-9.
081600     MOVE OUT-P1-RETM      TO MIN-HOLD.
081700     COMPUTE TIME-HOLD = MIN-HOLD / 60.
081800     MOVE HR-1-2           TO PTP1-HR.
081900     MOVE HR-4             TO PTP1-4.
082000     ADD  OUT-P1-RETM      TO ST-P1-RETM-9 T-P1-RETM-9.
082100     MOVE OUT-P2-WOS       TO PT-P2-WOS.
082200     ADD  OUT-P2-WOS       TO ST-P2-WOS-9 T-P2-WOS-9.
082300     MOVE OUT-P2-RETM      TO MIN-HOLD.
082400     COMPUTE TIME-HOLD = MIN-HOLD / 60.
082500     MOVE HR-1-2           TO PTP2-HR.
082600     MOVE HR-4             TO PTP2-4.
082700     ADD  OUT-P2-RETM      TO ST-P2-RETM-9 T-P2-RETM-9.
082800     MOVE OUT-P3-WOS       TO PT-P3-WOS.
082900     ADD  OUT-P3-WOS       TO ST-P3-WOS-9 T-P3-WOS-9.
083000     MOVE OUT-P3-RETM      TO MIN-HOLD.
083100     COMPUTE TIME-HOLD = MIN-HOLD / 60.
083200     MOVE HR-1-2           TO PTP3-HR.
083300     MOVE HR-4             TO PTP3-4.
083400     ADD  OUT-P3-RETM      TO ST-P3-RETM-9 T-P3-RETM-9.
083500     MOVE OUT-PX-WOS       TO PT-PX-WOS.
083600     ADD  OUT-PX-WOS       TO ST-PX-WOS-9 T-PX-WOS-9.
083700     MOVE OUT-PX-RETM      TO MIN-HOLD.
083800     COMPUTE TIME-HOLD = MIN-HOLD / 60.
083900     MOVE HR-1-2           TO PTPX-HR.
084000     MOVE HR-4             TO PTPX-4.
084100     ADD  OUT-PX-RETM      TO ST-PX-RETM-9 T-PX-RETM-9.
084200     COMPUTE WS-TOT-WOS  = OUT-P1-WOS + OUT-P2-WOS +
084300                           OUT-P3-WOS + OUT-PX-WOS.
084400     COMPUTE WS-TOT-RETM = OUT-P1-RETM + OUT-P2-RETM +
084500                           OUT-P3-RETM + OUT-PX-RETM.
084600     COMPUTE WS-AVE-TIME = WS-TOT-RETM / WS-TOT-WOS.
084700     MOVE WS-TOT-WOS       TO PT-TOT-WOS.
084800     ADD  WS-TOT-WOS       TO ST-TOT-WOS-9 T-TOT-WOS-9.
084900     MOVE WS-TOT-RETM      TO MIN-HOLD.
085000     COMPUTE TIME-HOLD = MIN-HOLD / 60.
085100     MOVE HR-1-2           TO PTPT-HR.
085200     MOVE HR-4             TO PTPT-4.
085300     ADD  WS-TOT-RETM      TO ST-TOT-RETM-9 T-TOT-RETM-9.
085400     MOVE WS-AVE-TIME      TO MIN-HOLD.
085500     COMPUTE TIME-HOLD = MIN-HOLD / 60.
085600     MOVE HR-1-2           TO PTPA-HR.
085700     MOVE HR-4             TO PTPA-4.
085800     COMPUTE ST-AVE-TIME-9 = ST-TOT-RETM-9 / ST-TOT-WOS-9.
085900     COMPUTE  T-AVE-TIME-9 =  T-TOT-RETM-9 /  T-TOT-WOS-9.
086000     MOVE PRINT-BUFFER     TO PRT-REC.
086100     WRITE PRT-REC.
086200     ADD 1                 TO LINE-C.
           GO TO 5-READ-FILE.
086400
086500 5-RF-EXIT.    EXIT.
086700
086900 5-HEADINGS.
087000     ADD 1 TO PAGE-CNTR.
087100     MOVE PAGE-CNTR TO PAGE-H.
087200     MOVE HEADER-ONE TO PRT-REC.
087300     WRITE PRT-REC AFTER ADVANCING NEW-PAGE.
087400     MOVE SPACES TO PRT-REC.
087500     WRITE PRT-REC.
087600     MOVE HEADER-TWO TO PRT-REC.
087700     WRITE PRT-REC.
087800     MOVE SPACES TO PRT-REC.
087900     WRITE PRT-REC.
088000     MOVE HEADER-THREE TO PRT-REC.
088100     WRITE PRT-REC.
088200     MOVE HEADER-FOUR TO PRT-REC.
088300     WRITE PRT-REC.
088400     MOVE HEADER-DOTS TO PRT-REC.
088500     WRITE PRT-REC.
088600     MOVE 7 TO LINE-C.
088700
088900 5-SUB-TOTAL.
089000     MOVE ST-P1-WOS-9     TO ST-P1-WOS.
089100     MOVE ST-P1-RETM-9    TO MIN-HOLD.
089200     COMPUTE TIME-HOLD = MIN-HOLD / 60.
089300     MOVE HR-1-2          TO STP1-HR.
089400     MOVE HR-4            TO STP1-4.
089500     MOVE ST-P2-WOS-9     TO ST-P2-WOS.
089600     MOVE ST-P2-RETM-9    TO MIN-HOLD.
089700     COMPUTE TIME-HOLD = MIN-HOLD / 60.
089800     MOVE HR-1-2          TO STP2-HR.
089900     MOVE HR-4            TO STP2-4.
090000     MOVE ST-P3-WOS-9     TO ST-P3-WOS.
090100     MOVE ST-P3-RETM-9    TO MIN-HOLD.
090200     COMPUTE TIME-HOLD = MIN-HOLD / 60.
090300     MOVE HR-1-2          TO STP3-HR.
090400     MOVE HR-4            TO STP3-4.
090500     MOVE ST-PX-WOS-9     TO ST-PX-WOS.
090600     MOVE ST-PX-RETM-9    TO MIN-HOLD.
090700     COMPUTE TIME-HOLD = MIN-HOLD / 60.
090800     MOVE HR-1-2          TO STPX-HR.
090900     MOVE HR-4            TO STPX-4.
091000     MOVE ST-TOT-WOS-9    TO ST-TOT-WOS.
091100     MOVE ST-TOT-RETM-9   TO MIN-HOLD.
091200     COMPUTE TOT-TIME-HOLD = MIN-HOLD / 60.
091300     MOVE HR-1-2-3        TO STPT-HR.
091400     MOVE HR-5            TO STPT-4.
091500     MOVE ST-AVE-TIME-9   TO MIN-HOLD.
091600     COMPUTE TOT-TIME-HOLD = MIN-HOLD / 60.
091700     MOVE HR-1-2-3        TO STPA-HR.
091800     MOVE HR-5            TO STPA-4.
091900     MOVE SUB-TOT         TO PRT-REC.
092000     WRITE PRT-REC AFTER ADVANCING 2.
092100     MOVE HEADER-DOTS     TO PRT-REC.
092200     WRITE PRT-REC.
092300     MOVE SPACES          TO PRT-REC.
092400     WRITE PRT-REC.
092500     ADD 4                TO LINE-C.
092600     MOVE ZEROS           TO SUB-TOT-9.
092700
092900 5-ST-EXIT.    EXIT.
093100
093300 5-TOTAL.
093400     MOVE T-P1-WOS-9     TO T-P1-WOS.
093500     MOVE T-P1-RETM-9    TO MIN-HOLD.
093600     COMPUTE TIME-HOLD = MIN-HOLD / 60.
093700     MOVE HR-1-2         TO TP1-HR.
093800     MOVE HR-4           TO TP1-4.
093900     MOVE T-P2-WOS-9     TO T-P2-WOS.
094000     MOVE T-P2-RETM-9    TO MIN-HOLD.
094100     COMPUTE TIME-HOLD = MIN-HOLD / 60.
094200     MOVE HR-1-2         TO TP2-HR.
094300     MOVE HR-4           TO TP2-4.
094400     MOVE T-P3-WOS-9     TO T-P3-WOS.
094500     MOVE T-P3-RETM-9    TO MIN-HOLD.
094600     COMPUTE TIME-HOLD = MIN-HOLD / 60.
094700     MOVE HR-1-2         TO TP3-HR.
094800     MOVE HR-4           TO TP3-4.
094900     MOVE T-PX-WOS-9     TO T-PX-WOS.
095000     MOVE T-PX-RETM-9    TO MIN-HOLD.
095100     COMPUTE TOT-TIME-HOLD = MIN-HOLD / 60.
095200     MOVE HR-1-2-3       TO TPX-HR.
095300     MOVE HR-5           TO TPX-4.
095400     MOVE T-TOT-WOS-9    TO T-TOT-WOS.
095500     MOVE T-TOT-RETM-9   TO MIN-HOLD.
095600     COMPUTE TOT-TIME-HOLD = MIN-HOLD / 60.
095700     MOVE HR-1-2-3       TO TPT-HR.
095800     MOVE HR-5           TO TPT-4.
095900     MOVE T-AVE-TIME-9   TO MIN-HOLD.
096000     COMPUTE TIME-HOLD = MIN-HOLD / 60.
096100     MOVE HR-1-2         TO TPA-HR.
096200     MOVE HR-4           TO TPA-4.
096300     IF LINE-C > 58 PERFORM 5-HEADINGS.
096400     MOVE TOT-LINE       TO PRT-REC.
096500     WRITE PRT-REC.
096600     MOVE HEADER-DOTS    TO PRT-REC.
096700     WRITE PRT-REC.
096800     MOVE ZEROS          TO TOT-LINE-9.
096900
097100 5-TOTAL-EXIT.    EXIT.
097300
060500 6-MAIN.
           READ SUM-FILE INTO READ-DISPLAY AT END GO TO 6-MAIN-X.
           DISPLAY "READ DISPLAY = " READ-DISPLAY.
           MOVE DATE-BUF TO DATE-WA.
           CLOSE SUM-FILE.
           CALL "MCDLT" USING DELETE-FILE.
075600 6-MAIN-X.    EXIT.

       COPY OVRPFCALL IN COPYLIB.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
103300
       7-SORT-IN.
107600     PERFORM 7-SORT-DBGET THRU 7-SD-X.
107900
108100 7-SORT-DBGET.
108300     MOVE SPACES TO WO-LABOR-DATA.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 11 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 11 TO COND-WORD.
108700     IF COND-WORD = 11 GO TO 7-SD-X.
109200     IF CRAFT-BUF NOT = SPACES
109300         IF CRAFT-BUF NOT = LBR-CRAFT
109400           GO TO 7-SORT-DBGET.
109500     MOVE LBR-WO-NUM TO ARG-NO.
109600     MOVE SPACES TO WO-BASIC-DATA WO-PLANNED-DATA.
           PERFORM 79-START-WO-BASIC-FILE.
110300     IF COND-WORD = 17
111500         PERFORM 79-START-WO-PLANNED-FILE
111600         IF COND-WORD = 17
111800             GO TO 7-SORT-DBGET
111900         ELSE
               PERFORM 79-READ-WO-PLANNED-FILE
112000         IF COND-WORD = 15
111800             GO TO 7-SORT-DBGET
               ELSE
               MOVE SPACES           TO WO-BASIC-DATA
112700         MOVE WO-NUM-PLANNED   TO WO-NUM
112800         MOVE WO-STATUS-P      TO WO-STATUS
112900         MOVE DATE-RECD-P-CN   TO DATE-RECD-CN
113000         MOVE TIME-RECD-P      TO TIME-RECD
113100         MOVE APPROVAL-CODE-P  TO APPROVAL-CODE
113200         MOVE REQUESTER-P      TO REQUESTER-B
113300         MOVE EQUIP-NUM-P      TO EQUIP-NUM
113400         MOVE EQUIP-NAME-P     TO EQUIP-NAME
113500         MOVE TYPE-NUM-P       TO TYPE-NUM
113600         MOVE DEPT-P           TO DEPT
113700         MOVE ZONE-PRIORITY-P  TO ZONE-PRIORITY
113800         MOVE LOCATION-P       TO LOCATION
113900         MOVE EQUIP-DOWN-P     TO EQUIP-DOWN
114000         MOVE EXP-CLASS-P      TO EXP-CLASS
114100         MOVE DESCRIPTION-1-P  TO DESCRIPTION-1
114200         MOVE DATE-STRT-P-CN   TO DATE-STRT-CN
114300         MOVE TIME-STRT-P      TO TIME-STRT
114400         MOVE DATE-COMP-P-CN   TO DATE-COMP-CN
114500         MOVE TIME-COMP-P      TO TIME-COMP
           ELSE
           PERFORM 79-READ-WO-BASIC-FILE
111400     IF COND-WORD = 15
111800         GO TO 7-SORT-DBGET.
           MOVE ZONE TO ZONE-WORK.
           IF Z-BUF-2 = "*"
               IF Z-BUF-1 = ZW-1
                   NEXT SENTENCE
               ELSE
               GO TO 7-SORT-DBGET
           ELSE
           IF Z-BUF-3 = "*"
               IF Z-BUF-1-2 = ZW-1-2
                   NEXT SENTENCE
               ELSE
               GO TO 7-SORT-DBGET
           ELSE
115100     IF ZONE-BUF = SPACES
115200         NEXT SENTENCE
115300     ELSE
115400     IF ZONE-BUF = ZONE
115500         NEXT SENTENCE
115600     ELSE
115700     IF ZONE = ZONE-HOLD-1 OR ZONE-HOLD-2
115800         NEXT SENTENCE
115900     ELSE
116000     GO TO 7-SORT-DBGET.
116100     IF DEPT-BUF = SPACES
116200         NEXT SENTENCE
116300     ELSE
116400     IF DEPT-BUF = DEPT
116500         NEXT SENTENCE
116600     ELSE
116700     GO TO 7-SORT-DBGET.
116800     MOVE ZONE TO ZONE-BUF-LINK.
116900     MOVE 0 TO HRS-IN MIN-IN.
117000     CALL "TGETSHFT" USING LINK-DATA DBPARAMETERS.
117200     IF S-1 > E-1 MOVE S-1 TO LABOR-DAY-START
117300     ELSE
117400     IF S-2 > E-2 MOVE S-2 TO LABOR-DAY-START
117500     ELSE
117600     IF S-3 > E-3 MOVE S-3 TO LABOR-DAY-START
117700     ELSE
117800     IF S-4 > E-4 MOVE S-4 TO LABOR-DAY-START
117900     ELSE
11800      MOVE 0000 TO LABOR-DAY-START.
118100     MOVE LBR-COMPL-DATE-YY TO GREG-YY.
118200     MOVE LBR-COMPL-DATE-MM TO GREG-MM.
118300     MOVE LBR-COMPL-DATE-DD TO GREG-DD.
           IF GREG-YY > "70"
               MOVE "19"          TO GREG-CC
           ELSE
           MOVE "20"              TO GREG-CC.
118500     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
118600     ADD 1 TO JULIAN-DATE-DDD.
           IF JULIAN-DATE-DDD > 365
               MOVE 001 TO JULIAN-DATE-DDD
               ADD 1    TO JULIAN-DATE-YY.
           MOVE SPACES TO GREG-DATE.
118700     CALL "JULGREG" USING GREG-DATE, JULIAN-DATE,
                            DAY-DIGIT, LEAP-YEAR-FLAG.
119000     MOVE GREG-YY TO DATE-WA-YY-2.
119100     MOVE GREG-MM TO DATE-WA-MM-2.
119200     MOVE GREG-DD TO DATE-WA-DD-2.
119300     MOVE DATE-WA-2 TO DATE-WA-SAV2.
119400     IF LABOR-DAY-START = 0000
119500         NEXT SENTENCE
119600     ELSE
119700     IF LBR-COMPL-TIME < LABOR-DAY-START
119800         NEXT SENTENCE
119900     ELSE
120000     MOVE DATE-WA-SAV2 TO LBR-COMPL-DATE.
120100     IF DATE-WA-9 = LBR-COMPL-DATE
120200         IF SHIFT-BUF = "A" OR LBR-SHIFT-1
120300             NEXT SENTENCE
120400         ELSE
120500         GO TO 7-SORT-DBGET
120600     ELSE
120700     GO TO 7-SORT-DBGET.
120800     MOVE LBR-WO-NUM       TO SORT-WO-NUM.
120900     MOVE LBR-EMPL-NAME    TO SORT-NAME.
121000     MOVE LBR-EMPL-NUM     TO SORT-NUM.
121100     MOVE PRIORITY         TO SORT-PRTY.
121200     MOVE ZONE             TO SORT-ZONE.
121300     MOVE LBR-SHIFT-1      TO SORT-SHIFT.
121400     COMPUTE HOLD-HRS = (LBR-HRS1-99 * 60) +
121500                        (LBR-HRS2-9 * 6).
121600     MOVE HOLD-HRS         TO SORT-HRS.
121700     IF ZONE-BUF = SPACES AND CRAFT-BUF NOT = SPACES
121800       MOVE "ALL " TO SORT-ZONE.
121900     RELEASE SORT-REC.
           GO TO 7-SORT-DBGET.
122500
       79-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF ARG-NO NOT = WO-NUM MOVE 15 TO COND-WORD.

       79-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF ARG-NO NOT = WO-NUM-PLANNED MOVE 15 TO COND-WORD.

       79-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ARG-NO TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       79-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ARG-NO TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       7-SD-X.    EXIT.

       7-SORT-OUT.
123100     MOVE 0 TO ACT-KEY, RECS-WRITTEN-CTR.
123200     PERFORM 7-READ-SORT-FILE THRU 7-RSF-EXIT.
123400
123600 7-READ-SORT-FILE.
123700     RETURN SORT-FILE AT END
123800         MOVE 1 TO EOS-SW
123900         PERFORM 7-SORT-WRITE-REC THRU 7-SWR-EXIT
               MOVE ACT-KEY TO RECS-WRITTEN-CTR
124000         GO TO 7-RSF-EXIT.
124100     IF FIRST-SW-ON
124200         GO TO 7-FIRST-WRITE-PREP.
124300     IF SORT-ZONE = ZONE-SAVE
124400         IF SORT-SHIFT = SHIFT-SAVE
124500             IF SORT-NAME = NAME-SAVE
124600                 PERFORM 7-SORT-ADD-REC
124700             ELSE
124800             PERFORM 7-SORT-WRITE-REC THRU 7-SWR-EXIT
124900         ELSE
125000         PERFORM 7-SORT-WRITE-REC   THRU 7-SWR-EXIT
125100     ELSE
125200     PERFORM 7-SORT-WRITE-REC     THRU 7-SWR-EXIT.
125300     GO TO 7-READ-SORT-FILE.
125500
126000 7-FIRST-WRITE-PREP.
126100     MOVE 0 TO FIRST-SW.
126200     MOVE SORT-ZONE TO ZONE-SAVE.
126300     MOVE SORT-SHIFT TO SHIFT-SAVE.
126400     MOVE SORT-NAME TO NAME-SAVE.
126500     MOVE SORT-WO-NUM TO WO-NUM-SAVE.
126600     MOVE SPACES TO OUT-REC-X.
126700     MOVE ZEROS TO OUT-REC-9.
126800     MOVE SORT-NAME TO OUT-CRFT-NAME.
126900     MOVE SORT-NUM  TO OUT-CC-NUM.
127000     MOVE SORT-ZONE TO OUT-ZONE.
127100     MOVE SORT-SHIFT TO OUT-SHIFT.
127200     IF SORT-PRTY = 1
127300         ADD 1        TO OUT-P1-WOS
127400         ADD SORT-HRS TO OUT-P1-RETM
127500     ELSE
127600     IF SORT-PRTY = 2
127700         ADD 1        TO OUT-P2-WOS
127800         ADD SORT-HRS TO OUT-P2-RETM
127900     ELSE
128000     IF SORT-PRTY = 3
128100         ADD 1        TO OUT-P3-WOS
128200         ADD SORT-HRS TO OUT-P3-RETM
128300     ELSE
128400         ADD 1        TO OUT-PX-WOS
128500         ADD SORT-HRS TO OUT-PX-RETM.
128600     GO TO 7-READ-SORT-FILE.
128700
128900 7-SORT-ADD-REC.
129000     IF SORT-WO-NUM = WO-NUM-SAVE
129100         IF SORT-PRTY = 1
129200             ADD SORT-HRS TO OUT-P1-RETM
129300         ELSE
129400         IF SORT-PRTY = 2
129500             ADD SORT-HRS TO OUT-P2-RETM
129600         ELSE
129700         IF SORT-PRTY = 3
129800             ADD SORT-HRS TO OUT-P3-RETM
129900         ELSE
130000         ADD SORT-HRS TO OUT-PX-RETM
130100     ELSE
130200     MOVE SORT-WO-NUM TO WO-NUM-SAVE
130300     IF SORT-PRTY = 1
130400         ADD 1        TO OUT-P1-WOS
130500         ADD SORT-HRS TO OUT-P1-RETM
130600     ELSE
130700     IF SORT-PRTY = 2
130800         ADD 1        TO OUT-P2-WOS
130900         ADD SORT-HRS TO OUT-P2-RETM
131000     ELSE
131100     IF SORT-PRTY = 3
131200         ADD 1        TO OUT-P3-WOS
131300         ADD SORT-HRS TO OUT-P3-RETM
131400     ELSE
131500     ADD 1        TO OUT-PX-WOS
131600     ADD SORT-HRS TO OUT-PX-RETM.
131700
131900 7-SORT-WRITE-REC.
132000     IF FIRST-SW-ON GO TO 7-SWR-EXIT.
132100     ADD 1 TO ACT-KEY.
132200     WRITE OUT-REC INVALID KEY
132400         GO TO 2-END-OF-JOB.
132500     IF EOS-SW-ON GO TO 7-SWR-EXIT.
132600     MOVE SORT-ZONE TO ZONE-SAVE.
132700     MOVE SORT-SHIFT TO SHIFT-SAVE.
132800     MOVE SORT-NAME TO NAME-SAVE.
132900     MOVE SORT-WO-NUM TO WO-NUM-SAVE.
133000     MOVE SPACES TO OUT-REC-X.
133100     MOVE ZEROS TO OUT-REC-9.
133200     MOVE SORT-NAME TO OUT-CRFT-NAME.
133300     MOVE SORT-ZONE TO OUT-ZONE.
133400     MOVE SORT-SHIFT TO OUT-SHIFT.
133500     MOVE SORT-NUM  TO OUT-CC-NUM.
133600     IF SORT-PRTY = 1
133700         ADD 1        TO OUT-P1-WOS
133800         ADD SORT-HRS TO OUT-P1-RETM
133900     ELSE
134000     IF SORT-PRTY = 2
134100         ADD 1        TO OUT-P2-WOS
134200         ADD SORT-HRS TO OUT-P2-RETM
134300     ELSE
134400     IF SORT-PRTY = 3
134500         ADD 1        TO OUT-P3-WOS
134600         ADD SORT-HRS TO OUT-P3-RETM
134700     ELSE
134800     ADD 1        TO OUT-PX-WOS
134900     ADD SORT-HRS TO OUT-PX-RETM.
135000
135100 7-SWR-EXIT.    EXIT.
135300
125600 7-RSF-EXIT.    EXIT.
