000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUFFINQ.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001100 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
001300 WORKING-STORAGE SECTION.
       COPY CPYIND  OF COPYLIB.
       01  DSPLY-STATUS            PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
004300 COPY LANGSUB    OF COPYLIB.
001900 01  PASSWORD-INFORMATION.
002000     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TSUFFINQ".
002100     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002200     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002300     05  PROGRAM-DESCRIPTION.
002400         10  PROG-DESC-A     PIC X(60) VALUE
002500             " MAIN PROGRAM FOR SUFFIXING INQUIRIES  "           .
002600         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
002800         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
003000     05  PASSWORD-FLAG       PIC X.
003600 01  SCREEN-DATA.
003700     05 SCREEN-KEY           PIC X(3).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
003200 COPY DBSTAT    OF COPYLIB.
       COPY WSCONTROL OF COPYLIB.
       LINKAGE SECTION.
004100 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
004200 COPY VCOMLINK  OF COPYLIB.
004600 PROCEDURE DIVISION USING DBPARAMETERS VIEW-COMAREA.
004900
005000 START-PROGRAM.
           PERFORM 1-HSK.
005100     PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
005200
       2-EOJ.
           CLOSE DISPLAY-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O    DISPLAY-FILE.
           MOVE SPACES TO SCREEN-DATA DSPLY-REC.
           MOVE 0 TO VIEW-LASTKEY.
005400 6-MAIN.
006000     MOVE "FSUFFINQ" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
007800     PERFORM 98-SCREEN-READ.
008900     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE DSPLY-REC TO SCREEN-DATA.
010000     IF SCREEN-KEY = "I1 "
010100         CALL "TSUFFQ01" USING DBPARAMETERS
010200                               VIEW-COMAREA
010300                               LANGUAGE-PARMS
               IF VIEW-LASTKEY = 3
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               NEXT SENTENCE
010800     ELSE
010900     IF SCREEN-KEY = "I2 "
011000         CALL "TSUFFQ02" USING DBPARAMETERS
011100                               VIEW-COMAREA
011200                               LANGUAGE-PARMS
               IF VIEW-LASTKEY = 3
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               NEXT SENTENCE.
011700*    ELSE
011800*    IF SCREEN-KEY = "I3 "
011900*      CALL "TSUFFQ03" USING DBPARAMETERS
012000*                            VIEW-COMAREA
012100*                            LANGUAGE-PARMS

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

