       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TSUFFR03.
      *C
      *C  09/11/1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT EQUIPMENT-FILE
               ASSIGN TO DATABASE-MCFLMM0201
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS EF-STATUS.
           SELECT JOBD-FILE
               ASSIGN TO DATABASE-MCFPMMJOBD
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO-FILE
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MF-STATUS.
           SELECT MVALIDPLTDATA-FILE
               ASSIGN TO DATABASE-MCFLCS1701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MVPD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
           SELECT WO-STATUS-MSTR
               ASSIGN TO DATABASE-MCFLMM0401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WSM-STATUS.
           SELECT WO-ZONE-PRTY-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  EQUIPMENT-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS EFREC.
       01  EFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.
       FD  JOBD-FILE
           LABEL RECORDS ARE STANDARD.
       01  JOBDF.
           05  JOBD-USER           PIC X(10).
       FD  MPLTINFO-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MFREC.
       01  MFREC.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.
       FD  MVALIDPLTDATA-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MVPFREC.
       01  MVPFREC.
           COPY DDS-ALL-FORMATS OF MCFLCS1701.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       FD  WO-STATUS-MSTR
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WSMREC.
       01  WSMREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0401.
       FD  WO-ZONE-PRTY-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPFREC.
       01  WZPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
       WORKING-STORAGE SECTION.
       COPY CPYIND  IN COPYLIB.

       COPY CATREAD IN COPYLIB.

       01  EXPCLASS-1.
           05 EX1                  PIC X.
           05 EX2                  PIC X.
           05 FILLER               PIC X(8).

       01  EQPNUM-BUFFER.          COPY MEQPFILE OF COPYLIB.

       01  FILE-STATUSES.
           05  BM-STATUS           PIC XX.
           05  DSPLY-STATUS        PIC XX.
           05  EF-STATUS           PIC XX.
           05  FILE-STATUS         PIC XX.
           05  MF-STATUS           PIC XX.
           05  MVPD-STATUS         PIC XX.
           05  WPF-STATUS          PIC XX.
           05  WSM-STATUS          PIC XX.
           05  WZPF-STATUS         PIC XX.

       COPY IOFEEDBACK IN COPYLIB.

       01  ITEM-VALUE              PIC X(16).

       01  MISC-BUFFER             PIC X(80).

       01  PRTY                    PIC 9.

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TSUFFR03".
           05  PROGRAM-TYPE        PIC X(02) VALUE "RE".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
             " SUBMITS BATCH JOB TO PRINT THE SUFFIX SUMMARY REPORT "  .
               10  PROG-DESC-B     PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG       PIC X.

       01  STATUS-BUFFER           PIC X(14).

       COPY DBSTAT OF COPYLIB.

       01  SMPLTINFO.
           05 MPLTINFO-KEY         PIC X(4).
           05 MPLTINFO-DATA        PIC X(60).
           05 MPLTINFO-JS REDEFINES MPLTINFO-DATA.
              10 MPLTINFO-JSPOOLER PIC X(2).
              10 MPLTINFO-JS-TYPE  PIC X(2).
              10 FILLER            PIC X(56).

       01  SMVALIDPLTDATA          PIC X(20).

       01  SKEY.
           05 MPLTINFO-SPOOL-KEY   PIC X VALUE "*".
           05 MPLTINFO-PRT         PIC X(3).

       01  SUBMIT-SW               PIC X.

       01  SUBMIT-PGM              PIC X(10).
       01  SUBMIT-PARM             PIC X(220).
       01  SUBMIT-JOB              PIC X(10).
       01  SUBMIT-JOBD             PIC X(10).
       01  SUBMIT-OUTQ             PIC X(10).
       01  SUBMIT-USER             PIC X(10).

       01  SCREEN-DATA.
           05 MASTER-WONUM         PIC X(7).
           05 WO-STATUS            PIC X(2).
           05 A-C                  PIC X.
           05 EQUIPNUM             PIC X(6).
           05 DEPT                 PIC X(4).
           05 ZONE                 PIC X(4).
           05 CLSS                 PIC X(8).
           05 BUDGET.
              10 B1                PIC X(3).
              10 B2                PIC X(2).
              10 B3                PIC X(2).
              10 B4                PIC X(3).
              10 B5                PIC X(2).
           05 REQUEST              PIC X(12).
           05 SORT-BY              PIC X.
           05 PRNT-DEV             PIC X(3).
           05 PAPER-SZ             PIC X.
           05 LINE-PER             PIC X.
           05 CMD-LINE             PIC X(79).
           05 ERR-LINE             PIC X(79).

       01  TRUE-VAL                PIC 1 VALUE B"1".

       01  WO-PLANNED-DATA.        COPY DWOPLAN OF COPYLIB.

       COPY WSCONTROL OF COPYLIB.

       01  ZONE-BUFFER             PIC X(18).

       LINKAGE SECTION.
       01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
       01  SBASE                   PIC X(24).

       PROCEDURE DIVISION USING    DBPARAMETERS
                                   VIEW-COMAREA
                                   LANGUAGE-PARMS
                                   SBASE.
       START-PROGRAM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-X UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE EQUIPMENT-FILE.
           CLOSE JOBD-FILE.
           CLOSE MPLTINFO-FILE.
           CLOSE MVALIDPLTDATA-FILE.
           CLOSE WO-PLANNED-FILE.
           CLOSE WO-STATUS-MSTR.
           CLOSE WO-ZONE-PRTY-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT EQUIPMENT-FILE.
           OPEN INPUT JOBD-FILE.
           READ JOBD-FILE AT END GO TO 2-EOJ.
           OPEN INPUT MPLTINFO-FILE.
           OPEN INPUT MVALIDPLTDATA-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           OPEN INPUT WO-STATUS-MSTR.
           OPEN INPUT WO-ZONE-PRTY-FILE.
           MOVE SPACES TO SCREEN-DATA.
           MOVE "FSUFFR03" TO VIEW-CFNAME.
       6-MAIN.
           MOVE SCREEN-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-DATA.
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-X.
           IF VIEW-LASTKEY = 1
               PERFORM 60-SUBMIT-JOB
               MOVE SPACES TO SCREEN-DATA
               GO TO 6-MAIN.
           PERFORM 69-START-WO-PLANNED-FILE.
           IF COND-WORD NOT = 0
               MOVE 35040 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO ERR-LINE
               MOVE TRUE-VAL TO INDS (10) INDS (99)
               GO TO 6-MAIN.
           PERFORM 69-READ-WO-PLANNED-FILE.
           IF COND-WORD NOT = 0
               MOVE 35040 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO ERR-LINE
               MOVE TRUE-VAL TO INDS (10) INDS (99)
               GO TO 6-MAIN.
           IF WO-STATUS = SPACES
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-WO-STATUS-MSTR
           IF COND-WORD NOT = 0
               MOVE 35001 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO ERR-LINE
               MOVE TRUE-VAL TO INDS (11) INDS (99)
               GO TO 6-MAIN.
           IF A-C = SPACES
               NEXT SENTENCE
           ELSE
           IF A-C = "A" OR "U"
               NEXT SENTENCE
           ELSE
           MOVE 31054 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO ERR-LINE
           MOVE TRUE-VAL TO INDS (12) INDS (99)
           GO TO 6-MAIN.
           IF EQUIPNUM = SPACES
               NEXT SENTENCE
           ELSE
           MOVE EQUIPNUM           TO ITEM-VALUE
           PERFORM 69-READ-EQUIPMENT-FILE
           IF COND-WORD NOT = 0
               MOVE 35004 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO ERR-LINE
               MOVE TRUE-VAL TO INDS (13) INDS (99)
               GO TO 6-MAIN.
           MOVE 1 TO PRTY.
       6-CHECK-ZONE.
           IF ZONE = SPACES
               NEXT SENTENCE
           ELSE
           MOVE SPACES           TO ITEM-VALUE
           STRING ZONE PRTY DELIMITED BY SIZE INTO ITEM-VALUE
           PERFORM 69-START-WO-ZONE-PRTY-FILE
           IF COND-WORD NOT = 0
               IF PRTY = 5
                   MOVE 35044 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MISC-BUFFER TO ERR-LINE
                   MOVE TRUE-VAL TO INDS (15) INDS (99)
                   GO TO 6-MAIN
               ELSE
               ADD 1 TO PRTY
               GO TO 6-CHECK-ZONE.

           IF CLSS = SPACES
               NEXT SENTENCE
           ELSE
           MOVE CLSS TO EXPCLASS-1
           MOVE "E" TO EX1
           MOVE "C" TO EX2
           PERFORM 69-START-MVALIDPLTDATA-FILE
           IF COND-WORD NOT = 0
               MOVE "N" TO EX1
               MOVE "W" TO EX2
               PERFORM 69-START-MVALIDPLTDATA-FILE
               IF COND-WORD NOT = 0
                   MOVE 35009 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MISC-BUFFER TO ERR-LINE
                   MOVE TRUE-VAL TO INDS (16) INDS (99)
                   GO TO 6-MAIN.

           IF SORT-BY = "W" OR "Z" OR "S" OR "C" OR "R" OR "B"
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO MISC-BUFFER
           MOVE TRUE-VAL TO INDS(23) INDS (99)
           GO TO 6-MAIN.

           MOVE PRNT-DEV TO MPLTINFO-PRT.
           MOVE SKEY     TO PLTINFOKEY OF MFREC.
           PERFORM 69-READ-MPLTINFO-FILE.
           IF COND-WORD NOT = 0
               MOVE 35052 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO ERR-LINE
               MOVE TRUE-VAL TO INDS (5) INDS (99)
               GO TO 6-MAIN.

           IF PAPER-SZ = "W" OR "N"
               NEXT SENTENCE
           ELSE
           MOVE 31053 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO ERR-LINE
           MOVE TRUE-VAL TO INDS (24) INDS (99)
           GO TO 6-MAIN.

           IF LINE-PER = "6" OR "8"
               NEXT SENTENCE
           ELSE
           MOVE 38006 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO ERR-LINE
           MOVE TRUE-VAL TO INDS (25) INDS (99)
           GO TO 6-MAIN.
       6-MAIN-X.    EXIT.

       60-SUBMIT-JOB.
           MOVE "CLSUFFSUM"    TO  SUBMIT-PGM.
           MOVE SCREEN-DATA    TO  SUBMIT-PARM.
           MOVE "TSUFFR03"     TO  SUBMIT-JOB.
           MOVE JOBD-USER      TO  SUBMIT-JOBD.
           MOVE "*JOBD"        TO  SUBMIT-OUTQ.
           MOVE "*JOBD"        TO  SUBMIT-USER.
           CALL "CLSUBMIT" USING   SUBMIT-PGM
                                   SUBMIT-PARM
                                   SUBMIT-JOB
                                   SUBMIT-JOBD
                                   SUBMIT-OUTQ
                                   SUBMIT-USER.

       69-READ-EQUIPMENT-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ITEM-VALUE TO EQPNUM OF EFREC.
           READ EQUIPMENT-FILE INTO EQPNUM-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF EF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-MPLTINFO-FILE.
           MOVE 0 TO COND-WORD.
           READ MPLTINFO-FILE INTO SMPLTINFO
               AT END    MOVE 15 TO COND-WORD.
           IF MF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-MVALIDPLTDATA-FILE.
           MOVE 0 TO COND-WORD.
           MOVE EXPCLASS-1 TO VALDTAKEY OF MVPFREC.
           START MVALIDPLTDATA-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MVPD-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE SPACES        TO ITEM-VALUE.
           STRING MASTER-WONUM "000" DELIMITED BY SIZE INTO ITEM-VALUE.
           MOVE ITEM-VALUE TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM-PLANNED NOT = ITEM-VALUE MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-READ-WO-STATUS-MSTR.
           MOVE 0 TO COND-WORD.
           MOVE WO-STATUS TO WOSTATUS OF WSMREC.
           READ WO-STATUS-MSTR INTO STATUS-BUFFER
               AT END    MOVE 15 TO COND-WORD.
           IF WSM-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-ZONE-PRTY-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ITEM-VALUE TO ZONEPRTY OF WZPFREC.
           START WO-ZONE-PRTY-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WZPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO MISC-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
       999-CATREAD-EXIT.    EXIT.
