000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUFFR02.
      *C
      *C  SEPT 06, 1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.  AS400.
000900 OBJECT-COMPUTER.  AS400.
       COPY SPECIALN IN COPYLIB.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBD-FILE
               ASSIGN TO DATABASE-MCFPMMJOBD
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBD-FILE
           LABEL RECORDS ARE STANDARD.
       01  JOBDF.
           05  JOBD-USER           PIC X(10).
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
002600 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
       01  DSPLY-STATUS            PIC XX.
       01  FILE-STATUS             PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
007400 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
003100 01  PASSWORD-INFORMATION.
003200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TSUFFR02".
003300     05  PROGRAM-TYPE        PIC X(02) VALUE "RE".
003400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003500     05  PROGRAM-DESCRIPTION.
003600         10  PROG-DESC-A     PIC X(60) VALUE
003700      " SUBMITS BATCH JOB TO PRINT GENERIC JOB & PART PLAN NAMES".
003800         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
004000         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004200     05  PASSWORD-FLAG       PIC X.
004300
007200 01  PERSONNEL-DATA.         COPY MPERSONL OF COPYLIB.
007300
       01  PF-STATUS               PIC XX.

       01  PRNT-WA.
           05  P-WA OCCURS 3       PIC X.

006000 01  SKEY.
006100     05 MPLTINFO-SPOOL-KEY   PIC X VALUE "*".
006200     05 MPLTINFO-PRT         PIC X(3).
006300
006400 01  SMPLTINFO.
006500     05 MPLTINFO-KEY         PIC X(4).
006600     05 MPLTINFO-DATA        PIC X(60).
006700     05 MPLTINFO-JS REDEFINES MPLTINFO-DATA.
006800        10 MPLTINFO-JSPOOLER PIC X(2).
006900        10 MPLTINFO-JS-TYPE  PIC X(2).
007000        10 FILLER            PIC X(56).
007100
007800 01  SCREEN-BUFFER.
            05 SCREEN-DATA.
00790          10 J-OR-P           PIC X.
008000         10 ORIGINATOR       PIC X(4).
008100         10 PRNT-DEV         PIC X(3).
008200         10 LINE-PER         PIC X.
           05 SCREEN-CMD-LINE      PIC X(79).
           05 SCREEN-ERR-LINE      PIC X(79).
008300
       COPY DBSTAT OF COPYLIB.
005900
       01  SUBMIT-PGM              PIC X(10).
       01  SUBMIT-PARM             PIC X(200).
       01  SUBMIT-JOB              PIC X(10).
       01  SUBMIT-JOBD             PIC X(10).
       01  SUBMIT-OUTQ             PIC X(10).
       01  SUBMIT-USER             PIC X(10).
007600 01  SUBMIT-SW               PIC X.
007700
       01  TRUE-VAL                PIC 1 VALUE B"1".
       COPY WSCONTROL OF COPYLIB.
008600 LINKAGE SECTION.
008800 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
009400 PROCEDURE DIVISION USING    DBPARAMETERS
009500                             VIEW-COMAREA
009600                             LANGUAGE-PARMS.
009900 START-PROGRAM.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT JOBD-FILE.
           OPEN INPUT PERSONNEL-FILE.
           READ JOBD-FILE AT END GO TO 2-EOJ.
010000     PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
010200
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBD-FILE.
           CLOSE PERSONNEL-FILE.
           GOBACK.

010300 6-MAIN.
011300     MOVE "FSUFFR02" TO VIEW-CFNAME.
           IF TRUE-VAL = INDS (99)
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO SCREEN-DATA.
           MOVE 66356 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-DATA.
014200     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
014400     IF VIEW-LASTKEY = 1
014500         NEXT SENTENCE
014600     ELSE
           MOVE 35126 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO SCREEN-ERR-LINE
           MOVE TRUE-VAL TO INDS (1) INDS (99)
014800     GO TO 6-MAIN.
           MOVE SPACES TO SCREEN-ERR-LINE.
016100     IF J-OR-P = "J" OR "P"
016200         NEXT SENTENCE
016300     ELSE
016400     MOVE 31052 TO CATREAD-MSG-NUMBER
016600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
016700     MOVE TRUE-VAL TO INDS (7) INDS (99)
016800     MOVE MISC-BUFFER TO SCREEN-ERR-LINE
016900     GO TO 6-MAIN.
017000
017100     IF J-OR-P = "P" MOVE "M" TO J-OR-P.
017300
017400     IF ORIGINATOR = SPACES
017500         NEXT SENTENCE
017600     ELSE
           MOVE 0 TO COND-WORD
017700     MOVE ORIGINATOR TO PERCCNUM OF PFREC
017800     START PERSONNEL-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 GO TO 2-EOJ.
017900     READ PERSONNEL-FILE NEXT INTO PERSONNEL-DATA
018000         AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
018100     IF COND-WORD = 0
018200         NEXT SENTENCE
018300     ELSE
018400     MOVE 35047 TO CATREAD-MSG-NUMBER
018600     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
018700     MOVE TRUE-VAL TO INDS (8) INDS (99)
018800     MOVE MISC-BUFFER TO SCREEN-ERR-LINE
018900     GO TO 6-MAIN.
019000
           MOVE PRNT-DEV TO PRNT-WA.
           PERFORM 60-RIGHT-ADJUST-DEV THRU 60-RAD-EXIT.
           MOVE PRNT-WA TO PRNT-DEV.

020200     IF LINE-PER = "6" OR "8"
020300         NEXT SENTENCE
020400     ELSE
020500     MOVE 38006 TO CATREAD-MSG-NUMBER
020700     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
020800     MOVE TRUE-VAL TO INDS (6) INDS (99)
020900     MOVE MISC-BUFFER TO SCREEN-ERR-LINE
021000     GO TO 6-MAIN.
021100
010600     PERFORM SUBMIT-JOB-STREAM.

       60-RIGHT-ADJUST-DEV.
           IF P-WA (3) = " "
               IF P-WA (2) = " "
                   IF P-WA (1) = " "
                      MOVE "099" TO PRNT-DEV
                   ELSE
                   MOVE P-WA (1) TO P-WA (3)
                   MOVE "0" TO P-WA (1) P-WA (2)
               ELSE
               MOVE P-WA (2) TO P-WA (3)
               MOVE P-WA (1) TO P-WA (2)
               MOVE "0" TO P-WA (1)
           ELSE
           IF P-WA (2) = " "
               MOVE "0" TO P-WA (2) P-WA (1)
           ELSE
           IF P-WA (1) = " "
               MOVE "0" TO P-WA (1).
       60-RAD-EXIT.    EXIT.

021300 SUBMIT-JOB-STREAM.
           MOVE "CLSUFFR02" TO   SUBMIT-PGM.
           MOVE SCREEN-DATA TO   SUBMIT-PARM.
           MOVE "TSUFFR02"  TO   SUBMIT-JOB.
           MOVE JOBD-USER   TO   SUBMIT-JOBD.
           MOVE "*JOBD"     TO   SUBMIT-OUTQ.
           MOVE "*JOBD"     TO   SUBMIT-USER.
           CALL "CLSUBMIT" USING SUBMIT-PGM
                                 SUBMIT-PARM
                                 SUBMIT-JOB
                                 SUBMIT-JOBD
                                 SUBMIT-OUTQ
                                 SUBMIT-USER.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

025100 999-CATREAD.
025200     MOVE SPACES TO MISC-BUFFER.
025300     CALL "CCATREAD" USING CATREAD-PARMS.
026000     MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
026200 999-CATREAD-EXIT.    EXIT.
