       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TSUFFIXW.
      *REMARKS.       SUFFIXING SYSTEM EXECUTIVE PROGRAM ***.
      *C
      *C  SEPT 06, 1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.   AS400.
       OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBPLAN-BANK-FILE
               ASSIGN TO DATABASE-MCFLMM3601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS JBF-STATUS.
           SELECT MASTER-JOBPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM3501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MJF-STATUS.
           SELECT MASTER-PRTPLAN-FILE
               ASSIGN TO DATABASE-MCFLMM3701
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS MPF-STATUS.
           SELECT PERSONNEL-FILE
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS PF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPFD-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBPLAN-BANK-FILE
           LABEL RECORD ARE STANDARD
           DATA RECORD IS JBFREC.
       01  JBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3601.
       FD  MASTER-JOBPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MJFREC.
       01  MJFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3501.
       FD  MASTER-PRTPLAN-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MPFREC.
       01  MPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM3701.
       FD  PERSONNEL-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS PFREC.
       01  PFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFDREC.
       01  WPFDREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.
       WORKING-STORAGE SECTION.
       01  ARG-NO                   PIC 9(9).
       01  BLOWUP-BASE              PIC X(16).
       COPY CATREAD IN COPYLIB.
       01  COPY-PLAN                PIC X.
       COPY CPYIND  IN COPYLIB.
       01  CURDATE-BUFF.
           05 Y-BUFF.
              10 FILLER             PIC X.
              10 DATE-YEAR          PIC X.
           05 M-BUFF                PIC X(2).
           05 D-BUFF                PIC X(2).
       01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS         PIC XX.
           05  JBF-STATUS           PIC XX.
           05  MJF-STATUS           PIC XX.
           05  MPF-STATUS           PIC XX.
           05  MR-STATUS            PIC XX.
           05  PF-STATUS            PIC XX.
           05  WLNU-STATUS          PIC XX.
           05  WPF-STATUS           PIC XX.
           05  WPFD-STATUS          PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA    IN COPYLIB.
       COPY LANGSUB    IN COPYLIB.
       01  LAST-WO-USED-DATA.       COPY MLASTWO  OF COPYLIB.
       01  MISC-BUFFER.
           05  M-TYPE1.
               10  FILLER           PIC X(17).
               10  M-JOBPNAME       PIC X(10).
               10  FILLER           PIC X(53).
           05  M-TYPE2 REDEFINES M-TYPE1.
               10  FILLER           PIC X(17).
               10  M-PLAN2A         PIC X(10).
               10  FILLER           PIC X(26).
               10  M-PLAN2B         PIC X(10).
               10  FILLER           PIC X(17).
           05  M-TYPE3 REDEFINES M-TYPE1.
               10  FILLER           PIC X(20).
               10  M-PLAN3A         PIC X(10).
               10  FILLER           PIC X(26).
               10  M-PLAN3B         PIC X(10).
               10  FILLER           PIC X(14).
       01  MASTER-JOBPLAN-DATA.     COPY MMASTJOB OF COPYLIB.
       01  MASTER-PRTPLAN-DATA.     COPY MMSTPART OF COPYLIB.
       01  MPLAN-SCREEN.
           05  MPLAN-DISPLAY.
               10  MPLAN-NAME       PIC X(10).
               10  MPLAN-TITLE      PIC X(30).
               10  MPLAN-ORIG       PIC X(4).
           05  MPLAN-CMD-LINE       PIC X(79).
           05  MPLAN-ERR-LINE       PIC X(79).
       01  M-JOBPLAN1               PIC X(10).
       01  M-JOBPLAN2               PIC X(10).
       01  M-PRTPLAN1               PIC X(10).
       01  M-PRTPLAN2               PIC X(10).
       01  PERSONNEL-DATA.          COPY MPERSONL OF COPYLIB.
       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM      PIC X(08) VALUE "TSUFFIXW".
           05  PROGRAM-TYPE         PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE      PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A      PIC X(60) VALUE "SUFFIXING SYSTEM".
               10  PROG-DESC-B      PIC X(60) VALUE SPACES.
               10  PROG-FUNCTION    PIC X(60) VALUE SPACES.
           05  PASSWORD-FLAG        PIC X VALUE "Y".
       01  READ-BUFFER.
           05  READ-ITEM-1          PIC X(10).
           05  READ-ITEM-2          PIC X(10).
           05  READ-ITEM-3          PIC X(10).
           05  READ-ITEM-4          PIC X(10).
           05  READ-ITEM-5          PIC X(10).
           05  READ-ITEM-6          PIC X(10).
           05  READ-CMD-LINE        PIC X(79).
           05  READ-ERR-LINE        PIC X(79).
       01  SCREEN-DATA.
           05  MASTER-JOBPLAN       PIC X(10).
           05  MASTER-PRTPLAN       PIC X(10).
           05  MASTER-JOBPLAN1      PIC X(10).
           05  MASTER-PRTPLAN1      PIC X(10).
           05  MASTER-JOBPLAN2      PIC X(10).
           05  MASTER-PRTPLAN2      PIC X(10).
           05  MASTER-CMD-LINE      PIC X(79).
           05  MASTER-ERR-LINE      PIC X(79).
       COPY DBSTAT  IN COPYLIB.
       COPY TBLOWUP IN COPYLIB.
       01  TIME-BUFF.
           05 TIME-HHMM             PIC X(4).
           05 TIME-SECS             PIC XX.
       01  TRUE-VAL                 PIC 1 VALUE B"1".
       COPY VCOMLINK  IN COPYLIB.
       01  WO-PLANNED-DATA.         COPY DWOPLAN  OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
       PROCEDURE DIVISION.
       START-PAR.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBPLAN-BANK-FILE.
           CLOSE MASTER-JOBPLAN-FILE.
           CLOSE MASTER-PRTPLAN-FILE.
           CLOSE PERSONNEL-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
           CLOSE WO-PLANNED-FILE.
           GOBACK.

       1-HSK.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   JOBPLAN-BANK-FILE.
           OPEN I-O   MASTER-JOBPLAN-FILE.
           OPEN I-O   MASTER-PRTPLAN-FILE.
           OPEN INPUT PERSONNEL-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-PARTS-FILE.
           OPEN INPUT WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-USED-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO VIEW-LASTKEY.

       6-MAIN.
           ACCEPT CURDATE-BUFF FROM DATE.
           ACCEPT TIME-BUFF FROM TIME.
           IF MASTER-ERR-LINE = SPACES MOVE SPACES TO SCREEN-DATA.
           MOVE "FSUFFIXW" TO VIEW-CFNAME.
           MOVE 66355 TO CATREAD-MSG-NUMBER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MASTER-CMD-LINE.
           MOVE SCREEN-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-DATA.
           MOVE SPACES TO MASTER-ERR-LINE.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           IF VIEW-LASTKEY = 1
               CALL "TGENWORK"
               IF VIEW-LASTKEY = 3
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 2
               CALL "TSUFFINQ" USING  DBPARAMETERS
                                      VIEW-COMAREA
               IF VIEW-LASTKEY = 3
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 4
               CALL "TSUFFREP" USING  DBPARAMETERS
                                      VIEW-COMAREA
                                      LANGUAGE-PARMS
               IF VIEW-LASTKEY = 3
                   MOVE 0 TO VIEW-LASTKEY
               ELSE
               NEXT SENTENCE
           ELSE
           IF VIEW-LASTKEY = 5
               PERFORM MJOBPLAN THRU M-J-E
           ELSE
           IF VIEW-LASTKEY = 6
               PERFORM MPRTPLAN THRU M-P-E
           ELSE
           IF VIEW-LASTKEY = 7
               PERFORM DELETE-MPLAN THRU D-M-E
           ELSE
           IF VIEW-LASTKEY = 8
               PERFORM   COPY-MPLAN THRU C-M-E.
       6-MAIN-EXIT.    EXIT.

       MJOBPLAN.
           IF MASTER-JOBPLAN = SPACES GO TO M-J-E.
           MOVE SPACES TO MASTER-JOBPLAN-DATA.
           MOVE MASTER-JOBPLAN TO MJOBPLAN-NAME.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-MASTER-JOBPLAN
           IF COND-WORD = 0 OR 15
               NEXT SENTENCE
           ELSE
           PERFORM 998-BLOWUP.
           MOVE MASTER-JOBPLAN-DATA TO MPLAN-DISPLAY.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           MOVE "FJOBPLN9" TO VIEW-CFNAME.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO MPLAN-SCREEN.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO M-J-E.
           PERFORM 69-START-PERSONNEL-FILE.
           IF COND-WORD = 17
               MOVE 35047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO MPLAN-ERR-LINE
               MOVE TRUE-VAL TO INDS (3) INDS (99)
               GO TO M-J-E.
           PERFORM 69-READ-PERSONNEL-FILE.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           MOVE 35047 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO MPLAN-ERR-LINE
           MOVE TRUE-VAL TO INDS (3) INDS (99)
           GO TO M-J-E.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 17
               MOVE MPLAN-SCREEN TO MASTER-JOBPLAN-DATA
               MOVE 0 TO MJOBPLAN-LASTSEQ
               PERFORM 69-WRITE-MASTER-JOBPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP
           ELSE
           PERFORM 69-READ-MASTER-JOBPLAN
           IF COND-WORD = 0
               MOVE MPLAN-NAME   TO MJOBPLAN-NAME
               MOVE MPLAN-TITLE  TO MJOBPLAN-TITLE
               MOVE MPLAN-ORIG   TO MJOBPLAN-ORIG
               PERFORM 69-REWRITE-MASTER-JOBPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP
           ELSE
           IF COND-WORD = 15
               MOVE MPLAN-SCREEN TO MASTER-JOBPLAN-DATA
               MOVE 0 TO MJOBPLAN-LASTSEQ
               PERFORM 69-WRITE-MASTER-JOBPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP.
           MOVE SPACES TO READ-BUFFER.
           MOVE MJOBPLAN-NAME TO READ-ITEM-1.
           CALL "TMJOBPLN" USING DBPARAMETERS VIEW-COMAREA
                             READ-BUFFER.
           IF VIEW-LASTKEY = 3 MOVE 0 TO VIEW-LASTKEY.

       M-J-E.    EXIT.

       MPRTPLAN.
           IF MASTER-PRTPLAN = SPACES GO TO M-P-E.
           MOVE SPACES TO MASTER-PRTPLAN-DATA.
           MOVE MASTER-PRTPLAN TO MPRTPLAN-NAME.
           PERFORM 69-START-MASTER-PRTPLAN.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-MASTER-PRTPLAN
           IF COND-WORD = 0 OR 15
               NEXT SENTENCE
           ELSE
           PERFORM 998-BLOWUP.
           MOVE MASTER-PRTPLAN-DATA TO MPLAN-DISPLAY.
           MOVE "FPRTPLAN" TO VIEW-CFNAME.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO MPLAN-SCREEN.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO M-P-E.
           PERFORM 69-START-PERSONNEL-FILE.
           IF COND-WORD = 17
               MOVE 35047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO MPLAN-ERR-LINE
               MOVE TRUE-VAL TO INDS (3) INDS (99)
               GO TO M-P-E.
           PERFORM 69-READ-PERSONNEL-FILE.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           MOVE 35047 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO MPLAN-ERR-LINE
           MOVE TRUE-VAL TO INDS (3) INDS (99)
           GO TO M-P-E.
           PERFORM 69-START-MASTER-PRTPLAN.
           IF COND-WORD = 17
               MOVE MPLAN-SCREEN TO MASTER-PRTPLAN-DATA
               PERFORM 69-WRITE-MASTER-PRTPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP
           ELSE
           PERFORM 69-READ-MASTER-PRTPLAN
           IF COND-WORD = 0
               MOVE MPLAN-NAME   TO MPRTPLAN-NAME
               MOVE MPLAN-TITLE  TO MPRTPLAN-TITLE
               MOVE MPLAN-ORIG   TO MPRTPLAN-ORIG
               PERFORM 69-REWRITE-MASTER-PRTPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP
           ELSE
           IF COND-WORD = 15
               MOVE MPLAN-SCREEN TO MASTER-PRTPLAN-DATA
               PERFORM 69-WRITE-MASTER-PRTPLAN
               IF COND-WORD = 0
                   NEXT SENTENCE
               ELSE
               PERFORM 998-BLOWUP.

           CALL "TMMODMAT" USING DBPARAMETERS
                             VIEW-COMAREA LANGUAGE-PARMS
                             MASTER-PRTPLAN-DATA.
           IF VIEW-LASTKEY = 3 MOVE 0 TO VIEW-LASTKEY.

       M-P-E.    EXIT.

       DELETE-MPLAN.
           IF MASTER-JOBPLAN1 = SPACES AND MASTER-PRTPLAN1 = SPACES
               MOVE 31028 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO MASTER-ERR-LINE
               MOVE TRUE-VAL TO INDS (20) INDS (99)
               GO TO D-M-E.
           IF MASTER-JOBPLAN1 = SPACES GO TO DELETE-MPRTPLAN.
           MOVE MASTER-JOBPLAN1 TO MJOBPLAN-NAME.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 17 GO TO D-M-E.
           PERFORM 69-READ-MASTER-JOBPLAN.
           IF COND-WORD = 0
               MOVE MASTER-JOBPLAN-DATA TO MPLAN-DISPLAY
               PERFORM 69-REWRITE-MASTER-JOBPLAN
               IF COND-WORD = 17
                   GO TO D-M-E
               ELSE
               NEXT SENTENCE
           ELSE
           IF COND-WORD = 15
               GO TO D-M-E.

           MOVE "FJOBPL10" TO VIEW-CFNAME.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO D-M-E.
           MOVE DSPLY-REC TO MPLAN-SCREEN.

           CALL "TMJOBDEL" USING DBPARAMETERS    VIEW-COMAREA
                                 MASTER-JOBPLAN1 LANGUAGE-PARMS.

           MOVE 66363 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE TRUE-VAL TO INDS (98).
           MOVE MJOBPLAN-NAME TO M-JOBPNAME.
           MOVE MISC-BUFFER TO MPLAN-CMD-LINE.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.
           GO TO D-M-E.

       DELETE-MPRTPLAN.
           MOVE SPACES TO MASTER-PRTPLAN-DATA.
           MOVE MASTER-PRTPLAN1 TO MPRTPLAN-NAME.
           PERFORM 69-START-MASTER-PRTPLAN.
           IF COND-WORD = 17 GO TO D-M-E.
           PERFORM 69-READ-MASTER-PRTPLAN.
           IF COND-WORD = 0
               MOVE MASTER-PRTPLAN-DATA TO MPLAN-DISPLAY
               PERFORM 69-REWRITE-MASTER-PRTPLAN
               IF COND-WORD = 17
                   GO TO D-M-E
               ELSE
               NEXT SENTENCE
           ELSE
           IF COND-WORD = 15
               GO TO D-M-E.
           MOVE "FPRTPLN1" TO VIEW-CFNAME.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO D-M-E.
           MOVE DSPLY-REC TO MPLAN-SCREEN.

           CALL "TMPRTDEL" USING DBPARAMETERS VIEW-COMAREA
                             MASTER-PRTPLAN1 LANGUAGE-PARMS.

           MOVE 66364 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE TRUE-VAL TO INDS (98).
           MOVE MPRTPLAN-NAME TO M-JOBPNAME.
           MOVE MISC-BUFFER TO MPLAN-CMD-LINE.
           MOVE MPLAN-SCREEN TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98A-SCREEN-READ.
           CALL "CLPAUSE2".
           MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.

       D-M-E.    EXIT.

       COPY-MPLAN.
           IF MASTER-JOBPLAN2 = SPACES AND MASTER-PRTPLAN2 = SPACES
             MOVE 31028 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MISC-BUFFER TO MASTER-ERR-LINE
             MOVE TRUE-VAL TO INDS (22) INDS (99)
             GO TO C-M-E.
           IF MASTER-JOBPLAN2 = SPACES GO TO COPY-MPRTPLAN.
           MOVE "N" TO COPY-PLAN.
           MOVE SPACES TO MASTER-JOBPLAN-DATA.
           MOVE MASTER-JOBPLAN2 TO MJOBPLAN-NAME.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 0
               PERFORM 69-READ-MASTER-JOBPLAN
               IF COND-WORD = 15
                   NEXT SENTENCE
               ELSE
               MOVE "G" TO COPY-PLAN
           ELSE
           PERFORM 69-START-WO-PLANNED-FILE
           IF COND-WORD NOT = 0
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-WO-PLANNED-FILE
           IF COND-WORD = 0
               MOVE "W" TO COPY-PLAN.

           IF COPY-PLAN = "N"
             OR
              (COPY-PLAN = "W" AND LAST-JOBPLAN-SEQ = "    ")
             OR
              (COPY-PLAN = "W" AND LAST-JOBPLAN-SEQ = "000 ")

             MOVE 39034 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MISC-BUFFER TO MASTER-ERR-LINE
             MOVE TRUE-VAL TO INDS (22) INDS (99)
             GO TO C-M-E.

           MOVE "FJOBPL11" TO VIEW-CFNAME.
           MOVE SPACES TO MPLAN-SCREEN DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
       READ-MJOBPLAN.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO C-M-E.
           MOVE DSPLY-REC TO MPLAN-SCREEN.
           IF MPLAN-NAME = SPACES
               MOVE 39040 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO MPLAN-ERR-LINE
               MOVE TRUE-VAL TO INDS (1) INDS (99)
               MOVE MPLAN-SCREEN TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               GO TO READ-MJOBPLAN.
           MOVE MPLAN-NAME TO MJOBPLAN-NAME.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           MOVE 39027 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO MPLAN-ERR-LINE
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           MOVE MPLAN-SCREEN TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           GO TO READ-MJOBPLAN.
           PERFORM 69-START-PERSONNEL-FILE.
           IF COND-WORD = 17
               MOVE 35047 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MISC-BUFFER TO MPLAN-ERR-LINE
               MOVE TRUE-VAL TO INDS (3) INDS (99)
               MOVE MPLAN-SCREEN TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               GO TO READ-MJOBPLAN.
           MOVE MPLAN-NAME  TO MJOBPLAN-NAME.
           MOVE MPLAN-TITLE TO MJOBPLAN-TITLE.
           MOVE MPLAN-ORIG  TO MJOBPLAN-ORIG.
           PERFORM 69-WRITE-MASTER-JOBPLAN.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           PERFORM 998-BLOWUP.
           IF COPY-PLAN = "G"
             MOVE MASTER-JOBPLAN2 TO M-JOBPLAN1
             MOVE MPLAN-NAME      TO M-JOBPLAN2
             CALL "TMJOBCOP" USING DBPARAMETERS VIEW-COMAREA
                               M-JOBPLAN1 M-JOBPLAN2
                               LANGUAGE-PARMS
             MOVE 66365 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (98)
             MOVE MASTER-JOBPLAN2  TO M-PLAN2A
             MOVE MPLAN-NAME       TO M-PLAN2B
             MOVE MISC-BUFFER      TO MPLAN-CMD-LINE
             MOVE MPLAN-SCREEN     TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             PERFORM 98A-SCREEN-READ
             CALL "CLPAUSE2"
             MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.

           IF COPY-PLAN = "W"
             MOVE MASTER-JOBPLAN2 TO M-JOBPLAN1
             MOVE MPLAN-NAME      TO M-JOBPLAN2
             CALL "TMCOPJOB" USING DBPARAMETERS VIEW-COMAREA
                               M-JOBPLAN1 M-JOBPLAN2
                               LANGUAGE-PARMS
             MOVE 66367 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (98)
             MOVE MASTER-JOBPLAN2  TO M-PLAN3A
             MOVE MPLAN-NAME       TO M-PLAN3B
             MOVE MISC-BUFFER      TO MPLAN-CMD-LINE
             MOVE MPLAN-SCREEN     TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             PERFORM 98A-SCREEN-READ
             CALL "CLPAUSE2"
             MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.

           GO TO C-M-E.

       COPY-MPRTPLAN.
           MOVE "N" TO COPY-PLAN.
           MOVE SPACES TO MASTER-PRTPLAN-DATA.
           MOVE MASTER-PRTPLAN2 TO MPRTPLAN-NAME.
           PERFORM 69-START-MASTER-PRTPLAN.
           IF COND-WORD = 17 GO TO C-M-E.
           PERFORM 69-READ-MASTER-PRTPLAN.
           IF COND-WORD = 0
               MOVE "G" TO COPY-PLAN
           ELSE
           IF COND-WORD = 15
               MOVE "W" TO COPY-PLAN.

           IF COPY-PLAN = "N"
             MOVE 39037 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MISC-BUFFER TO MPLAN-ERR-LINE
             MOVE TRUE-VAL TO INDS (23) INDS (99)
             GO TO C-M-E.

           MOVE "FPRTPLN2" TO VIEW-CFNAME.
           MOVE SPACES TO MPLAN-SCREEN DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
       READ-MPRTPLAN.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3
               MOVE 0 TO VIEW-LASTKEY
               GO TO C-M-E.
           MOVE DSPLY-REC TO MPLAN-SCREEN.
           IF MPLAN-NAME = SPACES
             MOVE 39040 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE MISC-BUFFER TO MPLAN-ERR-LINE
             MOVE TRUE-VAL TO INDS (1) INDS (99)
             MOVE MPLAN-SCREEN TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             GO TO READ-MPRTPLAN.

           MOVE MPLAN-NAME TO MPRTPLAN-NAME.
           PERFORM 69-START-MASTER-PRTPLAN.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           MOVE 39027 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO MPLAN-ERR-LINE
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           MOVE MPLAN-SCREEN TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           GO TO READ-MPRTPLAN.

           PERFORM 69-START-PERSONNEL-FILE.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           MOVE 35047 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MISC-BUFFER TO MPLAN-ERR-LINE
           MOVE TRUE-VAL TO INDS (3) INDS (99)
           MOVE MPLAN-SCREEN TO DSPLY-REC
           PERFORM 99-SCREEN-WRITE
           GO TO READ-MPRTPLAN.
           MOVE MPLAN-NAME  TO MPRTPLAN-NAME.
           MOVE MPLAN-TITLE TO MPRTPLAN-TITLE.
           MOVE MPLAN-ORIG  TO MPRTPLAN-ORIG.
           PERFORM 69-WRITE-MASTER-PRTPLAN.
           IF COND-WORD = 0
               NEXT SENTENCE
           ELSE
           PERFORM 998-BLOWUP.
           IF COPY-PLAN = "G"
             MOVE MASTER-PRTPLAN2 TO M-PRTPLAN1
             MOVE MPLAN-NAME      TO M-PRTPLAN2
             CALL "TMPRTCOP" USING DBPARAMETERS VIEW-COMAREA
                               M-PRTPLAN1 M-PRTPLAN2
                               LANGUAGE-PARMS.
             MOVE 66366 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (98)
             MOVE MASTER-PRTPLAN2  TO M-PLAN2A
             MOVE MPLAN-NAME       TO M-PLAN2B
             MOVE MISC-BUFFER      TO MPLAN-CMD-LINE
             MOVE MPLAN-SCREEN     TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             PERFORM 98A-SCREEN-READ
             CALL "CLPAUSE2"
             MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.

           IF COPY-PLAN = "W"
             MOVE MASTER-PRTPLAN2 TO M-PRTPLAN1
             MOVE MPLAN-NAME      TO M-PRTPLAN2
             CALL "TMCOPPRT" USING DBPARAMETERS VIEW-COMAREA
                               M-PRTPLAN1 M-PRTPLAN2
                               LANGUAGE-PARMS
             MOVE 66368 TO CATREAD-MSG-NUMBER
             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
             MOVE TRUE-VAL TO INDS (98)
             MOVE MASTER-JOBPLAN2  TO M-PLAN3A
             MOVE MPLAN-NAME       TO M-PLAN3B
             MOVE MISC-BUFFER      TO MPLAN-CMD-LINE
             MOVE MPLAN-SCREEN     TO DSPLY-REC
             PERFORM 99-SCREEN-WRITE
             PERFORM 98A-SCREEN-READ
             CALL "CLPAUSE2"
             MOVE SPACES TO MPLAN-CMD-LINE MISC-BUFFER.

       C-M-E.    EXIT.

       DELETE-MASTER.
           PERFORM 69-START-MASTER-JOBPLAN.
           IF COND-WORD = 17 GO TO D-M-E.
           PERFORM 69-READ-MASTER-JOBPLAN.
           IF COND-WORD = 0
             PERFORM 69-DELETE-MASTER-JOBPLAN
             IF COND-WORD NOT = 0 PERFORM 998-BLOWUP.

       69-DELETE-MASTER-JOBPLAN.
           MOVE 0 TO COND-WORD.
           DELETE MASTER-JOBPLAN-FILE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-MASTER-JOBPLAN.
           MOVE 0 TO COND-WORD.
           MOVE MJOBPLAN-NAME TO GJOBPNAME OF MJFREC.
           START MASTER-JOBPLAN-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-MASTER-JOBPLAN.
           MOVE 0 TO COND-WORD.
           READ MASTER-JOBPLAN-FILE NEXT INTO MASTER-JOBPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-MASTER-JOBPLAN.
           MOVE 0 TO COND-WORD.
           REWRITE MJFREC FROM MASTER-JOBPLAN-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-MASTER-JOBPLAN.
           MOVE 0 TO COND-WORD.
           WRITE MJFREC FROM MASTER-JOBPLAN-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MJF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-MASTER-PRTPLAN.
           MOVE 0 TO COND-WORD.
           MOVE MPRTPLAN-NAME TO GPRTPNAME OF MPFREC.
           START MASTER-PRTPLAN-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-MASTER-PRTPLAN.
           MOVE 0 TO COND-WORD.
           READ MASTER-PRTPLAN-FILE NEXT INTO MASTER-PRTPLAN-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF MPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-MASTER-PRTPLAN.
           MOVE 0 TO COND-WORD.
           REWRITE MPFREC FROM MASTER-PRTPLAN-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-MASTER-PRTPLAN.
           MOVE 0 TO COND-WORD.
           WRITE MPFREC FROM MASTER-PRTPLAN-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF MPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-PERSONNEL-FILE.
           MOVE 0 TO COND-WORD.
           MOVE MPLAN-ORIG TO PERCCNUM OF PFREC.
           START PERSONNEL-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-PERSONNEL-FILE.
           MOVE 0 TO COND-WORD.
           READ PERSONNEL-FILE NEXT INTO PERSONNEL-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF PF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           MOVE MASTER-JOBPLAN2 TO WONUM OF WPFREC.
           START WO-PLANNED-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-PLANNED-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-PARTS-FILE.
           MOVE 0 TO COND-WORD.
           MOVE MASTER-PRTPLAN2 TO WONUM OF WPFDREC.
           START WO-PARTS-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPFD-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       998-BLOWUP.
           MOVE "TSUFFIXW" TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES TO MISC-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
       999-CATREAD-EXIT.    EXIT.
