000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUFHELP.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.   AS400.
000900 OBJECT-COMPUTER.   AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFHELP-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001100 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
001400 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
001800 01  CURRENT-PREFIX          PIC X(15) VALUE SPACES.
       01  DSPLY-STATUS            PIC XX.
       01  ERROR-BUFFER            PIC X(80).
       COPY IOFEEDBACK OF COPYLIB.
002000 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
002200 01  MAIN-SW                 PIC X VALUE "N".
002400 01  PREFIX-NUMBER           PIC 9.
       01  SCREEN-DATA.
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
       COPY WSCONTROL OF COPYLIB.
004600 LINKAGE SECTION.
004800 COPY VCOMLINK  OF COPYLIB.
005200 01  SCREEN-NAMES.
005300     05 MAIN                 PIC X(15).
005400     05 PREFIX0              PIC X(15).
005500     05 PREFIX1              PIC X(15).
005600     05 PREFIX2              PIC X(15).
005700     05 PREFIX3              PIC X(15).
005800     05 PREFIX4              PIC X(15).
005900     05 PREFIX5              PIC X(15).
006000     05 PREFIX6              PIC X(15).
006100     05 PREFIX7              PIC X(15).
006400 PROCEDURE DIVISION USING    VIEW-COMAREA
006600                             SCREEN-NAMES.
006700
006800 START-PROGRAM.
           OPEN I-O   DISPLAY-FILE.
006900     PERFORM 6-MAIN UNTIL VIEW-LASTKEY = 3.
007000 2-EOJ.
           CLOSE DISPLAY-FILE.
           GOBACK.
007100 6-MAIN.
007600     MOVE MAIN TO VIEW-CFNAME.
008600     MOVE "N" TO MAIN-SW.
           MOVE SPACES TO SCREEN-DATA.
           MOVE 66191 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA TO DSPLY-REC.
008700     PERFORM 99-SCREEN-WRITE.
009000     PERFORM 98-SCREEN-READ.
010100     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
010300     IF VIEW-LASTKEY = 0
010400         IF PREFIX0 NOT = SPACES
010500             MOVE PREFIX0 TO CURRENT-PREFIX
010600             MOVE 1 TO PREFIX-NUMBER
010700             MOVE SPACES TO VIEW-CFNAME
010800           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
010900             INTO VIEW-CFNAME
011000             PERFORM 99-SCREEN-WRITE
011400             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
011500         ELSE
011600         NEXT SENTENCE
011700     ELSE
011800     IF VIEW-LASTKEY = 1
011900         IF PREFIX1 NOT = SPACES
012000             MOVE PREFIX1 TO CURRENT-PREFIX
012100             MOVE 1 TO PREFIX-NUMBER
012200             MOVE SPACES TO VIEW-CFNAME
012300           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
012400             INTO VIEW-CFNAME
012500             PERFORM 99-SCREEN-WRITE
012900             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
013000         ELSE
013100         NEXT SENTENCE
013200     ELSE
013300     IF VIEW-LASTKEY = 2
013400         IF PREFIX2 NOT = SPACES
013500             MOVE PREFIX2 TO CURRENT-PREFIX
013600             MOVE 1 TO PREFIX-NUMBER
013700             MOVE SPACES TO VIEW-CFNAME
013800           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
013900             INTO VIEW-CFNAME
014400             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
014500         ELSE
014600         NEXT SENTENCE
014700     ELSE
014800     IF VIEW-LASTKEY = 4
014900         IF PREFIX3 NOT = SPACES
015000             MOVE PREFIX3 TO CURRENT-PREFIX
015100             MOVE 1 TO PREFIX-NUMBER
015200             MOVE SPACES TO VIEW-CFNAME
015300           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
015400             INTO VIEW-CFNAME
015900             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
016000         ELSE
016100         NEXT SENTENCE
016200     ELSE
016300     IF VIEW-LASTKEY = 5
016400         IF PREFIX4 NOT = SPACES
016500             MOVE PREFIX4 TO CURRENT-PREFIX
016600             MOVE 1 TO PREFIX-NUMBER
016700             MOVE SPACES TO VIEW-CFNAME
016800           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
016900             INTO VIEW-CFNAME
017400             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
017500         ELSE
017600         NEXT SENTENCE
017700     ELSE
017800     IF VIEW-LASTKEY = 6
017900         IF PREFIX5 NOT = SPACES
018000             MOVE PREFIX5 TO CURRENT-PREFIX
018100             MOVE 1 TO PREFIX-NUMBER
018200             MOVE SPACES TO VIEW-CFNAME
018300           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
018400             INTO VIEW-CFNAME
018900             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
019000         ELSE
019100         NEXT SENTENCE
019200     ELSE
019300     IF VIEW-LASTKEY = 7
019400         IF PREFIX6 NOT = SPACES
019500             MOVE PREFIX6 TO CURRENT-PREFIX
019600             MOVE 1 TO PREFIX-NUMBER
019700             MOVE SPACES TO VIEW-CFNAME
019800           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
019900             INTO VIEW-CFNAME
020400             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
020500         ELSE
020600         NEXT SENTENCE
020700     ELSE
020800     IF VIEW-LASTKEY = 8
020900         IF PREFIX7 NOT = SPACES
021000             MOVE PREFIX7 TO CURRENT-PREFIX
021100             MOVE 1 TO PREFIX-NUMBER
021200             MOVE SPACES TO VIEW-CFNAME
021300           STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
021400             INTO VIEW-CFNAME
021900             PERFORM SHOW-PREFIX THRU S-P-E UNTIL MAIN-SW = "Y"
022000         ELSE
022100         NEXT SENTENCE.
022200
       SHOW-PREFIX.
           IF VIEW-CFNAME = "FSUFMOD1"
               MOVE 66238 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
           ELSE
           IF VIEW-CFNAME = "FSUFMOD2" OR "FSUFGEN2"
               NEXT SENTENCE
           ELSE
           IF VIEW-CFNAME = "FSUFGEN1"
               MOVE 66369 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
           ELSE
           MOVE 66236 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE ERROR-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-DATA TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.

022800 READ-PREFIX.
022900     PERFORM 98-SCREEN-READ.
024000     IF VIEW-LASTKEY = 3
024300       MOVE "Y" TO MAIN-SW
024400       GO TO S-P-E.
           IF VIEW-CFNAME = "FSUFGEN1" OR "FSUFMOD1" OR "FSUFMOD2"
                   OR "FSUFGEN2"
               NEXT SENTENCE
           ELSE
           PERFORM 99-SCREEN-WRITE
           GO TO READ-PREFIX.
026500     IF VIEW-LASTKEY = 1
026600         SUBTRACT 1 FROM PREFIX-NUMBER
026700         MOVE SPACES TO VIEW-CFNAME
026800         STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
026900             INTO VIEW-CFNAME
               MOVE 66238 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-DATA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
028100     ELSE
028200     IF VIEW-LASTKEY = 2
028300         ADD 1 TO PREFIX-NUMBER
028400         MOVE SPACES TO VIEW-CFNAME
028500         STRING CURRENT-PREFIX PREFIX-NUMBER DELIMITED BY SPACE
028600             INTO VIEW-CFNAME
               MOVE 66237 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-DATA TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE.
029700 S-P-E.    EXIT.
076100
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.
