000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUFFR01.
000600 ENVIRONMENT DIVISION.
000700 CONFIGURATION SECTION.
000800 SOURCE-COMPUTER.   AS400.
000900 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZSUFFIX-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT JOBD-FILE
               ASSIGN TO DATABASE-MCFPMMJOBD
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  JOBD-FILE
           LABEL RECORDS ARE STANDARD.
       01  JOBDF.
           05  JOBD-USER           PIC X(10).
002600 WORKING-STORAGE SECTION.
       COPY CATREAD  OF COPYLIB.
       COPY CPYIND   OF COPYLIB.
       01  DSPLY-STATUS            PIC XX.
       01  FILE-STATUS             PIC XX.
       COPY IOFEEDBACK OF COPYLIB.
005800 01  MISC-BUFFER             PIC X(80) VALUE SPACES.
003100 01  PASSWORD-INFORMATION.
003200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TSUFFR01".
003300     05  PROGRAM-TYPE        PIC X(02) VALUE "RE".
003400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
003500     05  PROGRAM-DESCRIPTION.
003600         10  PROG-DESC-A     PIC X(60) VALUE
003700         " SUBMITS BATCH JOB TO PRINT GENERIC JOB & PART PLANS"  .
003800         10  PROG-DESC-B     PIC X(60) VALUE SPACES.
004000         10  PROG-FUNCTION   PIC X(60) VALUE SPACES.
004200     05  PASSWORD-FLAG       PIC X.

       01  PRNT-WA.
           05  P-WA OCCURS 3       PIC X.

007600 01  SCREEN-BUFFER.
           05  SCREEN-DATA.
007700         10 MSTR-JOB         PIC X(10).
007800         10 MSTR-SEQ         PIC X(3).
007900         10 MSTR-PRT         PIC X(10).
008000         10 PRNT-DEV         PIC X(3).
008100         10 LINE-PER         PIC X.
           05 SCREEN-CMD-LINE      PIC X(79).
           05 SCREEN-ERR-LINE      PIC X(79).
008200
006400 01  SKEY.
006500     05 MPLTINFO-SPOOL-KEY   PIC X VALUE "*".
006600     05 MPLTINFO-PRT         PIC X(3).
006700
006800 01  SMPLTINFO.
006900     05 MPLTINFO-KEY         PIC X(4).
007000     05 MPLTINFO-DATA        PIC X(60).
007100     05 MPLTINFO-JS REDEFINES MPLTINFO-DATA.
007200        10 MPLTINFO-JSPOOLER PIC X(2).
007300        10 MPLTINFO-JS-TYPE  PIC X(2).
007400        10 FILLER            PIC X(56).
007500
       COPY DBSTAT OF COPYLIB.

       01  SUBMIT-PGM              PIC X(10).
       01  SUBMIT-PARM             PIC X(200).
       01  SUBMIT-JOB              PIC X(10).
       01  SUBMIT-JOBD             PIC X(10).
       01  SUBMIT-OUTQ             PIC X(10).
       01  SUBMIT-USER             PIC X(10).
006000 01  SUBMIT-SW               PIC X.
006100
       01  TRUE-VAL                PIC 1 VALUE B"1".

       COPY WSCONTROL IN COPYLIB.
008300 LINKAGE SECTION.
008500 01  DBPARAMETERS.           COPY DBPARMS OF COPYLIB.
       COPY VCOMLINK OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
009100 PROCEDURE DIVISION USING    DBPARAMETERS
009200                             VIEW-COMAREA
009300                             LANGUAGE-PARMS.
009600 START-PROGRAM.
           OPEN I-O   DISPLAY-FILE.
           OPEN INPUT JOBD-FILE.
           READ JOBD-FILE AT END GO TO 2-EOJ.
009700     PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.

010500 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE JOBD-FILE.
010600     GOBACK.

010000 6-MAIN.
011000     MOVE "FSUFFR01" TO VIEW-CFNAME.
           IF TRUE-VAL = INDS (99)
               NEXT SENTENCE
           ELSE
           MOVE SPACES TO SCREEN-DATA.
           MOVE 66356 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MISC-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-DATA.
           IF VIEW-LASTKEY = 3 GO TO 6-MAIN-EXIT.
014100     IF VIEW-LASTKEY = 1
014200         NEXT SENTENCE
014300     ELSE
           MOVE 35126 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TRUE-VAL TO INDS (1) INDS (99)
           MOVE MISC-BUFFER TO SCREEN-ERR-LINE
014500     GO TO 6-MAIN.
           MOVE SPACES TO SCREEN-ERR-LINE.
015800     IF (MSTR-JOB = SPACES AND MSTR-PRT = SPACES)
015900        OR
016000        (MSTR-JOB NOT = SPACES AND MSTR-PRT NOT = SPACES)
016100       MOVE 51004 TO CATREAD-MSG-NUMBER
016300       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
016400       MOVE TRUE-VAL TO INDS (2) INDS (99)
             MOVE MISC-BUFFER TO SCREEN-ERR-LINE
016600       GO TO 6-MAIN.
016800     IF MSTR-JOB NOT = SPACES
016900       IF MSTR-SEQ NOT = SPACES
017000         IF MSTR-SEQ NUMERIC
017100           MOVE "J" TO SUBMIT-SW
017200         ELSE
017300         MOVE 45029 TO CATREAD-MSG-NUMBER
017500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
017600         MOVE TRUE-VAL TO INDS (3) INDS (99)
               MOVE MISC-BUFFER TO SCREEN-ERR-LINE
017800         GO TO 6-MAIN
017900       ELSE
018000       MOVE "000" TO MSTR-SEQ
018100       MOVE "J" TO SUBMIT-SW
018300     ELSE
018400     IF MSTR-PRT NOT = SPACES
018500       MOVE "P" TO SUBMIT-SW.
018600
           MOVE PRNT-DEV TO PRNT-WA.
018700     PERFORM 60-RIGHT-ADJUST-DEV THRU 60-RAD-EXIT.
           MOVE PRNT-WA TO PRNT-DEV.
019700
019800     IF LINE-PER = "6" OR "8"
019900         NEXT SENTENCE
020000     ELSE
020100     MOVE 38006 TO CATREAD-MSG-NUMBER
020300     PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
020400     MOVE TRUE-VAL TO INDS (6) INDS (99)
           MOVE MISC-BUFFER TO SCREEN-ERR-LINE
020600     GO TO 6-MAIN.

           IF SUBMIT-SW = "J"
010300         PERFORM SUBMIT-GENJOB-STREAM
           ELSE
           PERFORM SUBMIT-MATJOB-STREAM.

       6-MAIN-EXIT.    EXIT.
028100
       60-RIGHT-ADJUST-DEV.
           IF P-WA (3) = " "
               IF P-WA (2) = " "
                   IF P-WA (1) = " "
                      MOVE "099" TO PRNT-DEV
                   ELSE
                   MOVE P-WA (1) TO P-WA (3)
                   MOVE "0" TO P-WA (1) P-WA (2)
               ELSE
               MOVE P-WA (2) TO P-WA (3)
               MOVE P-WA (1) TO P-WA (2)
               MOVE "0" TO P-WA (1)
           ELSE
           IF P-WA (2) = " "
               MOVE "0" TO P-WA (2) P-WA (1)
           ELSE
           IF P-WA (1) = " "
               MOVE "0" TO P-WA (1).
       60-RAD-EXIT.    EXIT.

021300 SUBMIT-GENJOB-STREAM.
           MOVE "CLSUFFR01J" TO  SUBMIT-PGM.
           MOVE SCREEN-DATA  TO  SUBMIT-PARM.
           MOVE "TSUFFR01"   TO  SUBMIT-JOB.
           MOVE JOBD-USER    TO  SUBMIT-JOBD.
           MOVE "*JOBD"      TO  SUBMIT-OUTQ.
           MOVE "*JOBD"      TO  SUBMIT-USER.
           CALL "CLSUBMIT" USING SUBMIT-PGM
                                 SUBMIT-PARM
                                 SUBMIT-JOB
                                 SUBMIT-JOBD
                                 SUBMIT-OUTQ
                                 SUBMIT-USER.

021300 SUBMIT-MATJOB-STREAM.
           MOVE "CLSUFFR01M" TO  SUBMIT-PGM.
           MOVE SCREEN-DATA  TO  SUBMIT-PARM.
           MOVE "TSUFFR01"   TO  SUBMIT-JOB.
           MOVE JOBD-USER    TO  SUBMIT-JOBD.
           MOVE "*JOBD"      TO  SUBMIT-OUTQ.
           MOVE "*JOBD"      TO  SUBMIT-USER.
           CALL "CLSUBMIT" USING SUBMIT-PGM
                                 SUBMIT-PARM
                                 SUBMIT-JOB
                                 SUBMIT-JOBD
                                 SUBMIT-OUTQ
                                 SUBMIT-USER.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

028300 999-CATREAD.
028400     MOVE SPACES TO MISC-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
029400 999-CATREAD-EXIT.    EXIT.
