000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TSUMCHGS.
000400 AUTHOR.               MK MADDEN.
000500 DATE-WRITTEN.         JULY 1, 1985.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000700
000800*REMARKS.              THIS PROGRAM WILL READ THROUGH THE
000900*                      DETAIL TRANSACTION DATA SET
001000*                      AND FIND ALL ISS, ADJ, RET, AND
001100*                      DCHG TRANSACTIONS AND SORT AND PRINT TOTALS
001200*                      BY REPORT CODE, DIVISION CODE, LEDGER CODE
001300*                      CLASS AND DEPT/ACCOUNT ORDER.
      *C
      *C  04DEC1992       DAVE PLUM       REQUEST #6325
      *C  REVISED PARAGRAPH 500-GET-MMATL-ACCUM TO INCLUDE THE
      *C  IF STATEMENT 'IF TRANS-CODE = "INV" OR "FRT"', INSTEAD OF
      *C  'IF TRANS-CODE = "INV"'.  FRT CHARGES FOR CODED ITEMS HAVING
      *C  NEW-WORK NUMBERS WERE NOT BEING TREATED THE SAME AS INVOICE
      *C  CHARGES.
      *C
      *C  07MAR1994       DAVE PLUM
      *C  ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C  07JUL1994       CR KALMAN       REQUEST #6232
      *C  REVISED THIS PROGRAM TO MAKE USE OF THE STANDARDIZED
      *C  BLOWUP ROUTINE, TBLOWUP.
      *C
      *C  08JUL1994       CR KALMAN       REQUEST #6090
      *C  REVISED SUMMARY OF CHARGES REPORT TO HANDLE INVALID DEPTS.
      *C  IT NO LONGER BLOWS UP WHEN AN INVALID DEPT IS FOUND.  IT
      *C  NOW PRINTS AN "INVALID DEPT" MESSAGE NEAR THE INVALID DEPT
      *C  AND AN ERROR MESSAGE IS PRINTED CONSPICUOUSLY AT THE END
      *C  OF THE REPORT.  ALSO AT THE END OF THE PROGRAM, THE FILE
      *C  VOCHRFLE IS DELETED.
      *C
      *C  03SEP1996       CA YODER
      *C  MODIFIED PROGRAM FOR CENTURY DATABASE CHANGES.
      *C
      *C  06AUG1997       JE COFFMAN
      *C  ADDED LOGIC TO WRITE A SECOND FILE (VOCHRFL2) THAT REFLECTS
      *C  A SEPARATION OF TOTALS FOR "WITHDRAWAL" TRANSACTIONS (ISS,
      *C  RET, RETV,SADJ, AND AADJ). THIS FILE WILL THEN BE USED BY
      *C  THE UNION-CITY WRITTEN CHECKBOOK PROGRAM TO PRODUCE THE
      *C  DANVILLE REQUESTED TOTAL BREAKDOWNS.
      *C
DP9802*C  05FEB1998      DAVE PLUM
DP9802*C  ADDED LOGIC TO HANDLE Y2K FOR THE YEAR-H3A FIELD.
      *C
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.      HP-3000.
001800 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
002000
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-MC-I
               ASSIGN TO DATABASE-MCFLCA0601
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MREPORT-RC-I
               ASSIGN TO DATABASE-MCFLCA0401
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE ASSIGN TO DISK-SORT.

           SELECT VOUCHER-FILE ASSIGN TO DISK-VOCHRFLE.

           SELECT VOUCHER-FILE2 ASSIGN TO DISK-VOCHRFL2.

002800 DATA DIVISION.
003000 FILE SECTION.
003100
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MMATL-ACCUM-MC-I
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-MC-REC-I.
           COPY DDS-MCRPCA0600  OF MCFLCA0601.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  MREPORT-RC-I
           LABEL RECORDS ARE STANDARD.
       01  MREPORT-RC-REC-I.
           COPY DDS-MCRPCA0400  OF MCFLCA0401.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

003200 FD  ONLINE-PRT
003300     DATA RECORD IS PRT-REC
003400     RECORD CONTAINS 133 CHARACTERS
003500     LABEL RECORDS ARE OMITTED.
003600
003700 01  PRT-REC                       PIC X(133).

       SD  SORT-FILE
           DATA RECORD IS SORT-REC
9407CK     RECORD CONTAINS 81  CHARACTERS.

       01  SORT-REC.
           05  SORT-REPORT-CODE         PIC X(2).
           05  SORT-LEDG-CODE.
               10  SORT-LEDG            PIC XX.
               10  SORT-DIV             PIC XX.
           05  SORT-DEPT-ACCT.
               10  SORT-CLASS           PIC X(4).
               10  SORT-DEPT-CHGD       PIC X(6).
               10  SORT-ACCT-CHGD       PIC X(6).
           05  SORT-QTY-CHGD            PIC S9(10).
           05  SORT-VALUE               PIC S9(12)V99.
           05  SORT-STD-VALUE           PIC S9(12)V99.
           05  SORT-VAR                 PIC S9(12)V99.
           05  SORT-DEPT-TYPE.
               10  SORT-DEPT-TYPE1      PIC X.
               10  SORT-DEPT-TYPE2      PIC X.
9407CK     05  SORT-ERR                 PIC X.
           05  SORT-TRANS               PIC X(4).

006000 FD  VOUCHER-FILE
006100     DATA RECORD IS VOUCHER-REC
006200     RECORD CONTAINS 80  CHARACTERS
006300     LABEL RECORDS ARE STANDARD.
006400
006500 01  VOUCHER-REC                 PIC X(80).
006600
       FD  VOUCHER-FILE2
           RECORD CONTAINS 80 CHARACTERS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS VOUCHER-REC2.
       01  VOUCHER-REC2                PIC X(80).

006900 WORKING-STORAGE SECTION.
007000
       77  NO-MORE-SORT                  PIC XXX        VALUE SPACES.
       77  LINE-CNT                      PIC 99         VALUE 0.
       77  PAGE-CNT                      PIC 9(4)       VALUE 0.
      *********************************************************
       77  GRAND-ACTUAL                  PIC S9(12)V99  VALUE 0.
       77  GRAND-STANDARD                PIC S9(12)V99  VALUE 0.
       77  GRAND-VARIANCE                PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  VOUCHER-ACTUAL                PIC S9(12)V99  VALUE 0.
       77  VOUCHER-STANDARD              PIC S9(12)V99  VALUE 0.
       77  VOUCHER-VARIANCE              PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  LEDGER-ACTUAL                 PIC S9(12)V99  VALUE 0.
       77  LEDGER-STANDARD               PIC S9(12)V99  VALUE 0.
       77  LEDGER-VARIANCE               PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  DEPT-ACCT-ACTUAL              PIC S9(12)V99  VALUE 0.
       77  DEPT-ACCT-STANDARD            PIC S9(12)V99  VALUE 0.
       77  DEPT-ACCT-VARIANCE            PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  DIV-ACTUAL                    PIC S9(12)V99  VALUE 0.
       77  DIV-STANDARD                  PIC S9(12)V99  VALUE 0.
       77  DIV-VARIANCE                  PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  ACCOUNT-ACTUAL                PIC S9(12)V99  VALUE 0.
       77  ACCOUNT-STANDARD              PIC S9(12)V99  VALUE 0.
       77  ACCOUNT-VARIANCE              PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  WITHDRAWALS-ACTUAL            PIC S9(12)V99  VALUE 0.
       77  WITHDRAWALS-STANDARD          PIC S9(12)V99  VALUE 0.
       77  WITHDRAWALS-VARIANCE          PIC S9(12)V99  VALUE 0.
      *********************************************************
       77  PREV-REPORT-CODE              PIC XX         VALUE SPACES.
       77  PREV-LEDGER                   PIC X(2)       VALUE SPACES.
       77  PREV-DIV                      PIC XX         VALUE SPACES.
       77  HOLD-9009                     PIC S9(12)V99  VALUE 0.
       77  HOLD-9013                     PIC S9(12)V99  VALUE 0.
       77  COMB-VALUE                    PIC S9(12)V99  VALUE 0.
       77  SAVE-DEPT-TYPE                PIC XX         VALUE SPACES.
       77  CLASS-102-VARIANCE            PIC S9(12)V99  VALUE 0.
       77  CLASS-400-VARIANCE            PIC S9(12)V99  VALUE 0.
       77  CLASS-OTHER-VARIANCE          PIC S9(12)V99  VALUE 0.
       77  MCXCBLERR-SCOPE               PIC X(1)       VALUE "C".
9407CK 77  FOUND-ERROR                   PIC X          VALUE SPACES.
9407CK 77  MCDLT-FILENAME                PIC X(10)      VALUE SPACES.

011000 01  ACCT-SPLIT.
011100     05  SPLIT-NO-A.
011200         10  FILLER                PIC X(2).
011300         10  ACCT-4TH-POS          PIC X(1).
011400     05  ACCT-NO-SPLIT             PIC XXX.
011500
011600 01  DEPT-SPLIT.
011700     05  DEPT-FST                  PIC X     VALUE SPACES.
011800     05  DEPT-SCD                  PIC X     VALUE SPACES.
011900     05  DEPT-REM                  PIC XX    VALUE SPACES.
012000
012100 01  PLT-CHG.
012200     05  PLT-FST                   PIC X     VALUE SPACES.
012300     05  PLT-REM                   PIC XX    VALUE SPACES.
012400
012500 01  DEPT-CHG.
012600     05  DEPT-FIRST                PIC X     VALUE "0".
012700     05  DEPT-REMAIN               PIC XXX   VALUE SPACES.
012800
012900 01  PROG-PARAMETERS.
013000     05  MONTH-YEAR.
013100         10  MONTH-PARM            PIC 99   VALUE ZEROS.
013200         10  YEAR-PARM             PIC 99   VALUE ZEROS.
013300     05  SORT-SEQ                  PIC X    VALUE SPACES.
013400
013500 01  PREV-DEPT-ACCT.
013600     05  PREV-CLASS                PIC X(4)  VALUE SPACES.
013700     05  PREV-DEPT                 PIC X(6)  VALUE SPACES.
013800     05  PREV-ACCT                 PIC X(6)  VALUE SPACES.
013900
014000 01  MONTH-TABLE.
014100     05  FILLER                    PIC X(9) VALUE "JANUARY".
014200     05  FILLER                    PIC X(9) VALUE "FEBRUARY".
014300     05  FILLER                    PIC X(9) VALUE "MARCH".
014400     05  FILLER                    PIC X(9) VALUE "APRIL".
014500     05  FILLER                    PIC X(9) VALUE "MAY".
014600     05  FILLER                    PIC X(9) VALUE "JUNE".
014700     05  FILLER                    PIC X(9) VALUE "JULY".
014800     05  FILLER                    PIC X(9) VALUE "AUGUST".
014900     05  FILLER                    PIC X(9) VALUE "SEPTEMBER".
015000     05  FILLER                    PIC X(9) VALUE "OCTOBER".
015100     05  FILLER                    PIC X(9) VALUE "NOVEMBER".
015200     05  FILLER                    PIC X(9) VALUE "DECEMBER".
015300
015400 01  MONTH-TAB REDEFINES MONTH-TABLE.
015500     05  MONTH-T OCCURS 12 TIMES   PIC X(9).
015600
015900 01  TEMP-REC.
016000     05  VO                       PIC X(3).
016100     05  REF                      PIC 9(3).
016200     05  SCSE                     PIC X(4).
016300     05  CO                       PIC X(3).
016400     05  PR                       PIC X(3).
016500     05  EXP                      PIC X(3).
016600     05  DEPT-4.
016700         10  DEPT-3               PIC X(3).
016800         10  DEPT-1               PIC X.
016900     05  ADATA                    PIC X(9).
017000     05  AMTT                     PIC S9(11)V99.
017100     05  FILLER-1                 PIC X(26).
017200     05  TERR                     PIC X(4).
017300     05  FILLER-2                 PIC X(5).
017400
015900 01  TEMP-REC2.
016000     05  VO2                      PIC X(3).
016100     05  REF2                     PIC 9(3).
016200     05  SCSE2                    PIC X(4).
016300     05  CO2                      PIC X(3).
016400     05  PR2                      PIC X(3).
016500     05  EXP2                     PIC X(3).
016600     05  DEPT-4-2.
016700         10  DEPT-3-2             PIC X(3).
016800         10  DEPT-1-2             PIC X.
016900     05  ADATA-2                  PIC X(9).
017000     05  AMTT-2                   PIC S9(11)V99.
           05  WITHAMTT-2               PIC S9(11)V99.
           05  FILLER-1-2               PIC X(13).
017200     05  TERR2                    PIC X(4).
017300     05  FILLER-2-2               PIC X(5).
017400
017500 01  HOLD-DTRANS.
017600     05  HOLD-STORES-CODE         PIC X(8).
017700     05  HOLD-CLASS               PIC X(4).
017800     05  HOLD-DEPT                PIC X(6).
017900     05  HOLD-ACCT                PIC X(6).
018000     05  HOLD-PO-NUM.
018100         10  HOLD-ORDER-NUM       PIC X(7).
018200         10  HOLD-RELEASE         PIC X(3).
018300     05  HOLD-RCVR-NUM            PIC X(4).
018400     05  HOLD-ITEM-NUM            PIC X(4).
018500     05  HOLD-CODE                PIC X(4).
           05  HOLD-DATE-CN.
               10  HOLD-DATE-CC         PIC XX.
018600         10  HOLD-DATE.
018700             15  HOLD-YY          PIC XX.
018800             15  HOLD-MM          PIC XX.
018900             15  HOLD-DD          PIC XX.
019000     05  HOLD-QTY                 PIC S9(10).
019100     05  HOLD-VALUE               PIC S9(12)V99.
019200     05  HOLD-DOCUMENT-NUM        PIC X(12).
019300     05  HOLD-UNIT-MEASURE        PIC XX.
019400     05  HOLD-BALANCE-QTY         PIC S9(10).
019500
019600 01  TIME-DIV.
019700     05  HH-DIV                    PIC XX   VALUE SPACES.
019800     05  MM-DIV                    PIC XX   VALUE SPACES.
019900     05  SS-DIV                    PIC XX   VALUE SPACES.
020000
020100 01  TODAYS-DATE.
020200     05  TD-YY                     PIC XX   VALUE SPACES.
020300     05  TD-MM                     PIC XX   VALUE SPACES.
020400     05  TD-DD                     PIC XX   VALUE SPACES.
020500
020600 01  DATE-DIVIDED.
020700     05  MONTH-DIV                PIC XX   VALUE SPACES.
020800     05  FILLER                   PIC X    VALUE SPACES.
020900     05  DAY-DIV                  PIC XX   VALUE SPACES.
021000     05  FILLER                   PIC X    VALUE SPACES.
021100     05  YEAR-DIV                 PIC XX   VALUE SPACES.
021200
021400************************************************************
021500**     REPORT PRINT LINES                                 **
021600************************************************************
021700
021800 01  HEADER1.
021900     05  FILLER                     PIC X      VALUE SPACES.
022000     05  FILLER                     PIC X(49)
022100         VALUE "TSUMCHGS".
022200     05  FILLER                     PIC X(69)
022300         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
022400     05  FILLER                     PIC X(5)   VALUE "DATE ".
022500     05  DATE-H1                    PIC X(8)   VALUE SPACES.
022600
022700 01  HEADER2.
022800     05  FILLER                     PIC X      VALUE SPACES.
022900     05  FILLER                     PIC X(6)   VALUE "PAGE".
023000     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
023100     05  FILLER                     PIC X(42)  VALUE SPACES.
023200     05  FILLER                     PIC X(66)
023300         VALUE "STORES SUMMARY OF CHARGES".
023400     05  FILLER                     PIC X(5)   VALUE "TIME ".
023500     05  TIME-H2.
023600         10  HH-H2                  PIC XX     VALUE SPACES.
023700         10  FILLER                 PIC X      VALUE ":".
023800         10  MM-H2                  PIC XX     VALUE SPACES.
023900         10  FILLER                 PIC X      VALUE ":".
024000         10  SS-H2                  PIC XX     VALUE SPACES.
024100
024200 01  HEADER3.
024300     05  FILLER                     PIC X(57)  VALUE SPACES.
024400     05  MONTH-H3                   PIC X(9)   VALUE SPACES.
024500     05  FILLER                     PIC X(3)   VALUE SPACES.
DP9802*****05  YEAR-H3A                   PIC X(2)   VALUE "20".
DP9802     05  YEAR-H3A                   PIC X(2)   VALUE SPACES.
024700     05  YEAR-H3B                   PIC X(2)  VALUE SPACES.
024800
025000 01  HEADER4.
025100     05  FILLER                     PIC X      VALUE SPACES.
025200     05  FILLER                     PIC X(34)
025300              VALUE "LC DC   CLS  DEPT   ACCT".
025400     05  FILLER                     PIC X(13)
025500              VALUE "ACTUAL".
025600     05  FILLER                     PIC X(15)
025700              VALUE "STANDARD".
025800     05  FILLER                     PIC X(24)
025900              VALUE "VARIANCE".
026000
026100 01  HEADER4A.
026200     05  FILLER                     PIC X      VALUE SPACES.
026300     05  FILLER                     PIC X(31)
026400              VALUE "LC             ACCOUNT".
026500     05  FILLER                     PIC X(13)
026600              VALUE "ACTUAL".
026700     05  FILLER                     PIC X(15)
026800              VALUE "STANDARD".
026900     05  FILLER                     PIC X(24)
027000              VALUE "VARIANCE".
027100
027200 01  REPORT-HDG.
027300     05  FILLER                     PIC X(13)
027400          VALUE "REPORT CODE".
027500     05  REPORT-DESCR-HDG           PIC X(60).
027600
027800 01  BLANK-LINE                     PIC X(133)   VALUE SPACES.

       01  DETAIL-LINE.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-LEDGER                 PIC X(2)   VALUE SPACES.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-DIV                    PIC XX     VALUE SPACES.
           05  FILLER                     PIC X(3)   VALUE SPACES.
           05  PRT-CLASS                  PIC XXXX  VALUE SPACES.
           05  FILLER                     PIC X     VALUE SPACES.
           05  PRT-DEPT                   PIC X(6)   VALUE SPACES.
           05  PRT-HYPHEN                 PIC X      VALUE SPACES.
           05  PRT-ACCOUNT                PIC X(6)   VALUE SPACES.
           05  FILLER                     PIC X(2)   VALUE SPACES.
           05  PRT-ACTUAL                 PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-STD                    PIC Z(10).ZZ-.
           05  FILLER                     PIC X      VALUE SPACES.
           05  PRT-VAR                    PIC Z(10).ZZ-.
9407CK     05  FILLER                     PIC X(3)   VALUE SPACES.
9407CK     05  PRT-ERR                    PIC X(20).

029800 01  VOUCHER-LINE.
029900     05  FILLER                     PIC X(12) VALUE "VCHR TOTAL".
030000     05  REPORT-CODE-TRLR            PIC XX     VALUE SPACES.
030100     05  FILLER                     PIC X(15)  VALUE SPACES.
030200     05  VOUCHER-ACTUAL-PRT         PIC Z(10).ZZ-.
030300     05  FILLER                     PIC X      VALUE SPACES.
030400     05  VOUCHER-STANDARD-PRT       PIC Z(10).ZZ-.
030500     05  FILLER                     PIC X      VALUE SPACES.
030600     05  VOUCHER-VARIANCE-PRT       PIC Z(10).ZZ-.
030700
030800 01  LEDGER-LINE.
030900     05  FILLER                     PIC X(12)  VALUE "LEDG TOTAL".
031000     05  LEDG-CODE-TRLR             PIC XX     VALUE SPACES.
031100     05  FILLER                     PIC X(15)  VALUE SPACES.
031200     05  LEDGER-ACTUAL-PRT          PIC Z(10).ZZ-.
031300     05  FILLER                     PIC X      VALUE SPACES.
031400     05  LEDGER-STANDARD-PRT        PIC Z(10).ZZ-.
031500     05  FILLER                     PIC X      VALUE SPACES.
031600     05  LEDGER-VARIANCE-PRT        PIC Z(10).ZZ-.
031700
031800 01  DIV-LINE.
031900     05  FILLER                     PIC X(12)  VALUE "DIV  TOTAL".
032000     05  DIV-CODE-TRLR              PIC XX     VALUE SPACES.
032100     05  FILLER                     PIC X(15)  VALUE SPACES.
032200     05  DIV-ACT-PRT                PIC Z(10).ZZ-.
032300     05  FILLER                     PIC X      VALUE SPACES.
032400     05  DIV-STD-PRT                PIC Z(10).ZZ-.
032500     05  FILLER                     PIC X      VALUE SPACES.
032600     05  DIV-VAR-PRT                PIC Z(10).ZZ-.
032700
032800 01  GRAND-LINE.
032900     05  FILLER                     PIC X(29)
033000          VALUE "TOTAL STORES CHARGES".
033100     05  GRAND-ACTUAL-PRT           PIC Z(10).ZZ-.
033200     05  FILLER                     PIC X       VALUE SPACES.
033300     05  GRAND-STANDARD-PRT         PIC Z(10).ZZ-.
033400     05  FILLER                     PIC X       VALUE SPACES.
033500     05  GRAND-VARIANCE-PRT         PIC Z(10).ZZ-.
033600
033800************************************************************
033900**                                                        **
034000**           D A T A B A S E   B U F F E R S              **
034100**                                                        **
034200************************************************************
034400
034500*********************
034600**  MMATL-ACCUM    **
034700*********************
034800
034900 COPY MATLACUM IN COPYLIB.
035000
035200******************
035300**    DTRANS    **
035400******************
035500 COPY DTRANS IN COPYLIB.
035600
035700*****************
035800*  MCHT-ACCTS   *
035900*****************
036000
036100 COPY MCHTACCT IN COPYLIB.
036200
036300*****************
036400*   MREPORT     *
036500*****************
036600
036700 COPY MREPORT IN COPYLIB.
036800
036900*****************
037000*   MLEDGER     *
037100*****************
037200
037300 COPY MLEDGER IN COPYLIB.
037400
037500*****************
037600*   MSTORERM    *
037700*****************
037800
037900 COPY MSTORERM IN COPYLIB.
038000
038100*****************************
038200**    MACCOUNT-INFO        **
038300*****************************
038400
038500 COPY MACTINFO IN COPYLIB.

9407CK COPY DATAB IN COPYLIB.


9407CK*01  ACCTG-BASE           PIC X(10)   VALUE "  CSACCT;".
  .   *01  ACCTG-PASSWORD       PIC X(8)    VALUE "ACTION; ".
  .   *01  STORES-BASE          PIC X(10)   VALUE "  STORES;".
9407CK*01  STORES-PASSWORD      PIC X(8)    VALUE "JADE; ".

       01  FILE-STATUS.
           05  FILE-STATUS-1    PIC X(1)    VALUE "0".
           05  FILE-STATUS-2    PIC X(1)    VALUE "0".

       01  SAVE-GET-COND        PIC S9(4)            BINARY VALUE 0.
           88  SAVE-END-OF-CHAIN            VALUE 15.

       01  SAVE-PUT-COND        PIC S9(4)            BINARY VALUE 0.

       01  RECORD-LOCK.
           05  LOCK-LENGTH      PIC S9(4)  BINARY VALUE 25.
           05  LOCK-DSET        PIC X(16)  VALUE SPACES.
           05  LOCK-ITEM        PIC X(16)  VALUE "@;".
           05  LOCK-REL-OP      PIC XX     VALUE "= ".
           05  LOCK-VALUE       PIC X(14)  VALUE SPACES.

       01  DATASET-NAMES.
           05  DSET-MMATL-ACCUM PIC X(16)  VALUE "MMATL-ACCUM;".
           05  DSET-DTRANS      PIC X(16)  VALUE "DTRANS;".
           05  DSET-MSTORERM    PIC X(16)  VALUE "MSTORERM;".
           05  DSET-MREPORT     PIC X(16)  VALUE "MREPORT;".
           05  DSET-MCHT-ACCTS  PIC X(16)  VALUE "MCHT-ACCTS;".
           05  DSET-MLEDG       PIC X(16)  VALUE "MLEDGER;".
           05  DSET-MACCT       PIC X(16)  VALUE "MACCOUNT-INFO;".

       01  ITEMS-LISTING.
           05  ALL-ITEMS        PIC X(2)   VALUE "@;".
           05  MATL-KEY         PIC X(10)  VALUE "MATL-CODE;".
           05  PO-KEY           PIC X(10)  VALUE "PO-NUMBER;".
           05  CORP-KEY         PIC X(10)  VALUE "CORP-CODE;".

       01  IMAGE-ARGS.
           05  MMATL-CODE-ARG.
               10  MMATL-FST4    PIC X(4)   VALUE SPACES.
               10  MMATL-LST4    PIC X(4)   VALUE SPACES.
           05  REPORT-CODE-ARG   PIC XX   VALUE SPACES.
           05  LEDG-ARG          PIC X(4)  VALUE SPACES.
           05  DEPT-KEY         PIC X(6)   VALUE SPACES.
           05  STORES-PO-ARG     PIC X(10)   VALUE SPACES.
           05  MACCT-KEY         PIC X(4)  VALUE SPACES.

9407CK COPY TBLOWUP IN COPYLIB.

047500 01  VIEW-COMAREA.
047600     05  VIEW-STATUS                 PIC S9(4) BINARY.
047700     05  VIEW-LANGUAGE               PIC S9(4) BINARY.
047800     05  VIEW-COMAREALEN             PIC S9(4) BINARY.
047900     05  VIEW-USERBUFLEN             PIC S9(4) BINARY.
048000     05  VIEW-MODE                   PIC S9(4) BINARY.
048100     05  VIEW-LASTKEY                PIC S9(4) BINARY.
048200     05  VIEW-NUMERRS                PIC S9(4) BINARY.
048300     05  VIEW-WINDOWENH              PIC S9(4) BINARY.
048400     05  VIEW-MULTIUSAGE             PIC S9(4) BINARY.
048500     05  VIEW-LABELOPT               PIC S9(4) BINARY.
048600     05  VIEW-CFNAME                 PIC X(16).
048700     05  VIEW-NFNAME                 PIC X(16).
048800     05  VIEW-REPEATOPT              PIC S9(4) BINARY.
048900     05  VIEW-NFOPT                  PIC S9(4) BINARY.
049000     05  VIEW-CFNUMLINES             PIC S9(4) BINARY.
049100     05  VIEW-DBUFLEN                PIC S9(4) BINARY.
049200     05  FILLER                      PIC S9(4) BINARY.
049300     05  VIEW-LOOKAHEAD              PIC S9(4) BINARY.
049400     05  VIEW-DELETEFLAG             PIC S9(4) BINARY.
049500     05  VIEW-SHOWCONTROL            PIC S9(4) BINARY.
049600     05  FILLER                      PIC S9(4) BINARY.
049700     05  VIEW-PRINTFILNUM            PIC S9(4) BINARY.
049800     05  VIEW-FILERRNUM              PIC S9(4) BINARY.
049900     05  VIEW-ERRFILENUM             PIC S9(4) BINARY.
050000     05  VIEW-FORMSTORESIZE          PIC S9(4) BINARY.
050100     05  FILLER                      PIC S9(4) BINARY.
050200     05  FILLER                      PIC S9(4) BINARY.
050300     05  FILLER                      PIC S9(4) BINARY.
050400     05  VIEW-NUMRECS                PIC S9(8) BINARY.
050500     05  VIEW-RECNUM                 PIC S9(8) BINARY.
050600     05  FILLER                      PIC S9(4) BINARY.
050700     05  FILLER                      PIC S9(4) BINARY.
050800     05  VIEW-TERMFILENUM            PIC S9(4) BINARY.
050900     05  FILLER                      PIC S9(4) BINARY.
051000     05  FILLER                      PIC S9(4) BINARY.
051100     05  FILLER                      PIC S9(4) BINARY.
051200     05  FILLER                      PIC S9(4) BINARY.
051300     05  FILLER                      PIC S9(4) BINARY.
051400     05  VIEW-RETRIES                PIC S9(4) BINARY.
051500     05  VIEW-OPTIONS                PIC S9(4) BINARY.
051600     05  VIEW-TERMLDEV               PIC S9(4) BINARY.
051700     05  VIEW-USERTIME               PIC S9(4) BINARY.
051800     05  VIEW-IDENTIFIER             PIC S9(4) BINARY.
051900     05  VIEW-LABELINFO              PIC S9(4) BINARY.
052000
       COPY TDATECHK IN COPYLIB.
052100
052200 PROCEDURE DIVISION.
052300
052400 001-BEGIN SECTION.
052500
052600 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
052700
052800     DISPLAY "ENTER SORT SEQUENCE DESIRED".
052900     DISPLAY "1 - DEPT".
053000     DISPLAY "2 - ACCOUNT".
053100     ACCEPT SORT-SEQ.
053200     IF SORT-SEQ = 1
               DISPLAY "SORT SEQUENCE SELECTED = DEPT"
053300         SORT SORT-FILE ON ASCENDING KEY SORT-REPORT-CODE
053400                                         SORT-LEDG
053500                                         SORT-DIV
053600                                         SORT-DEPT-ACCT
053700         INPUT PROCEDURE IS 050-PROCESS-TRANS
053800         OUTPUT PROCEDURE IS 700-CREATE-REPORT
053900     ELSE
               DISPLAY "SORT SEQUENCE SELECTED = ACCOUNT"
054000         SORT SORT-FILE ON ASCENDING KEY SORT-REPORT-CODE
054100                                         SORT-LEDG
054200                                         SORT-ACCT-CHGD
054300         INPUT PROCEDURE IS 050-PROCESS-TRANS
054400         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
054500     PERFORM 1000-CLOSE-FILES.
054600     GOBACK.
054700
054800
054900 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
055000     PERFORM 100-BEGIN.
055100     PERFORM 200-PROCESS-DETAIL
055200         UNTIL END-OF-FILE.
055300
055400**********************************************************
055500*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
055600*  FOR SORTING OF RECORDS.                               *
055700**********************************************************
055800
055900     GO TO 699-PROCESS-EXIT.
056000
056100 100-BEGIN.
056200     MOVE SPACES TO BU-DISPLAY-AREA.
           PERFORM 9999-OPEN-STUFF.
058400     MOVE SPACES TO SORT-REC.
058500     MOVE 0 TO SORT-VALUE
058600               SORT-STD-VALUE
058700               SORT-VAR
058800               SORT-QTY-CHGD.
058900     PERFORM 650-GET-STR-DEPT.
           PERFORM 9999-INIT-DTRANS-MC-I.
059000     PERFORM 400-GET-DTRANS.
059100
059200
059300 200-PROCESS-DETAIL.
059400     IF TRANS-DOCUMENT-NUM = "PROC"
059500         NEXT SENTENCE
059600     ELSE
059700         IF TRANS-CODE-TRANS = "ISS"
059900             PERFORM 500-GET-MMATL-ACCUM
060000             PERFORM 510-GET-LEDGER
060100             PERFORM 550-GET-MSTORERM
060200             PERFORM 600-BUILD-SORT-REC
060300         ELSE
059700         IF TRANS-CODE = "RET " OR "SADJ" OR "AADJ" OR "RETV"
059900             PERFORM 500-GET-MMATL-ACCUM
060000             PERFORM 510-GET-LEDGER
060100             PERFORM 550-GET-MSTORERM
060200             PERFORM 600-BUILD-SORT-REC
060300         ELSE
060400             IF TRANS-CODE = "INV" OR "FRT"
060500                 IF TRANS-STORES-CODE = "NON-STR"
060600                     PERFORM 500-GET-MMATL-ACCUM
060700                     PERFORM 510-GET-LEDGER
060800                     PERFORM 550-GET-MSTORERM
060900                     PERFORM 600-BUILD-SORT-REC
061000                 ELSE
061100                 IF TRANS-DEPT NOT = MACCT-STR-DEPT
061200                     PERFORM 500-GET-MMATL-ACCUM
061300                     PERFORM 510-GET-LEDGER
061400                     PERFORM 550-GET-MSTORERM
061500                     PERFORM 600-BUILD-SORT-REC
061600                 ELSE
061700                     NEXT SENTENCE
061800             ELSE
061900                 NEXT SENTENCE.
062000     PERFORM 400-GET-DTRANS.
062100
062200
062300 400-GET-DTRANS.
           PERFORM 9999-DBGET2-DTRANS-MC-I.
063100     IF GOOD-CALL
063200         NEXT SENTENCE
063300     ELSE
063400         IF END-OF-FILE
063500             NEXT SENTENCE
063600         ELSE
063700             MOVE "DBGET DTRANS * 400-GET" TO BU-DISPLAY-MSG
064000             PERFORM 990-BLOWUP.
064100     MOVE TRANS-STORES-CODE TO MMATL-CODE-ARG.
064200
064300
064400
064500
064600 500-GET-MMATL-ACCUM.
064700     IF MMATL-CODE-ARG = "NON-STR"
064800         PERFORM 505-SET-REPORT-CODE
064900     ELSE
               PERFORM 9999-DBGET7-MMATL-ACCUM-MC-I
065700         IF GOOD-CALL
065800             IF TRANS-ACCT > "009999"
065900*****************IF TRANS-CODE = "INV" ***REPLACED 04DEC1992 DAP
                       IF TRANS-CODE = "INV" OR "FRT"
066000                     MOVE 06 TO SORT-REPORT-CODE
066100                 ELSE
066200                     MOVE 04 TO SORT-REPORT-CODE
066300             ELSE
066400                 MOVE MATL-REPORT-CODE TO SORT-REPORT-CODE
066500         ELSE
066600             MOVE "DBGET MMATL-ACCUM * 500-GET" TO BU-DISPLAY-MSG
066800             MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
066900             PERFORM 990-BLOWUP.
067000
067100**********************************************************
067200**  THIS SECTION SETS THE REPORT CODE FOR DIRECT        **
067300**  DELIVERIES THAT ARE NOT CODED.  ALL CODED ITEMS     **
067400**  HAVE A REPORT CODE ATTACHED.                        **
067500**********************************************************
067600
067700 505-SET-REPORT-CODE.
067800*    IF TRANS-CLASS < 200
067900*        MOVE 02 TO SORT-REPORT-CODE
068000*    ELSE
068100*        IF TRANS-CLASS < 344
068200*            MOVE 05 TO SORT-REPORT-CODE
068300*        ELSE
068400*            IF TRANS-CLASS < 400
068500*                MOVE 01 TO SORT-REPORT-CODE
068600*            ELSE
068700*                IF TRANS-CLASS < 500
068800*                    MOVE 02 TO SORT-REPORT-CODE
068900*                ELSE
069000*                    MOVE 01 TO SORT-REPORT-CODE.
      ******************************************************
      *    THE ABOVE LOGIC WAS CHANGED 7/30/97 DUE TO      *
      *    VALLEYFIELD USING CLASS 080 FOR MAJOR SPARE     *
      *    PARTS.....JIM C.                                *
      ******************************************************
068100     IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
068200        (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
068300         MOVE "02"                TO SORT-REPORT-CODE
068400     ELSE
068500     IF (TRANS-CLASS > 199 AND TRANS-CLASS < 344)
068600         MOVE "05"                TO SORT-REPORT-CODE
068700     ELSE
068800     IF (TRANS-CLASS > 343 AND TRANS-CLASS < 400)  OR
068900        (TRANS-CLASS > 499) OR (TRANS-CLASS < 100)
069000         MOVE "01"                TO SORT-REPORT-CODE.
069100     IF TRANS-ACCT = "000000" OR TRANS-ACCT = SPACES
069200         NEXT SENTENCE
069300     ELSE
069400*        IF TRANS-CLASS < 200 OR TRANS-CLASS > 399
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
                  (TRANS-CLASS > 399)
069500             NEXT SENTENCE
069600         ELSE
069700         IF TRANS-ACCT > "009999"
069800             MOVE 06 TO SORT-REPORT-CODE
069900         ELSE
070000             IF TRANS-ACCT = "000951"
070100                 MOVE 02 TO SORT-REPORT-CODE
070200             ELSE
070300                 IF TRANS-ACCT < "000100"
070400                     OR TRANS-ACCT = "000250" OR "000251"
070500                     OR "000252" OR "000253" OR "000254"
070600                     OR "000891" OR "000892" OR "000893"
                           OR "000894" OR "000895" OR "000896"
                           OR "000897" OR "000898" OR "000899"
070700                         MOVE 05 TO SORT-REPORT-CODE
070800                 ELSE
070900                     MOVE 01 TO SORT-REPORT-CODE.
071000

       510-GET-LEDGER.
           MOVE TRANS-DEPT TO DEPT-KEY.
           PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
           IF GOOD-CALL
               NEXT SENTENCE
           ELSE
9407CK     IF NO-ENTRY
  .            MOVE "1" TO SORT-ERR
  .            MOVE "Y" TO FOUND-ERROR
  .            INITIALIZE BUF-MCHTACCTS
9407CK     ELSE
               MOVE "DBGET MCHT-ACCTS * 510-GET" TO BU-DISPLAY-MSG
               MOVE DEPT-KEY TO BU-DISPLAY-FLD (1)
               PERFORM 990-BLOWUP.

           MOVE MCHT-LEDGERT TO SORT-LEDG-CODE.

073100 550-GET-MSTORERM.
073200     IF MMATL-CODE-ARG = "NON-STR" OR MMATL-FST4 = "ACCR"
073300         MOVE 0 TO STR-STD-COST
073400     ELSE
               PERFORM 9999-DBGET7-MSTORERM-CD-I
074200         IF GOOD-CALL
074300             NEXT SENTENCE
074400         ELSE
074500             IF NO-ENTRY
074600                 MOVE 0 TO STR-STD-COST
074700             ELSE
074800                 MOVE "DBGET MSTORE * 550-GET" TO BU-DISPLAY-MSG
075000                 MOVE MMATL-CODE-ARG TO BU-DISPLAY-FLD (1)
075100                 PERFORM 990-BLOWUP.

       600-BUILD-SORT-REC.
           MOVE TRANS-CODE       TO SORT-TRANS.
           MOVE TRANS-DEPT       TO SORT-DEPT-CHGD.
           MOVE TRANS-ACCT       TO SORT-ACCT-CHGD.
           MOVE TRANS-CLASS      TO SORT-CLASS.
           MOVE MCHT-DEPT-TYPE   TO SORT-DEPT-TYPE.
           IF TRANS-STORES-CODE = "2641544" AND
               TRANS-ACCT = "000042"
                 MOVE 05         TO SORT-REPORT-CODE.
           IF MCHT-DEPT-TYPE = "MS" OR "MU" OR "MW"
      *        IF TRANS-CLASS > 199 AND TRANS-CLASS < 400
               IF (TRANS-CLASS > 199 AND TRANS-CLASS < 400)
                   MOVE 01       TO SORT-REPORT-CODE
               ELSE
                   NEXT SENTENCE
           ELSE
               NEXT SENTENCE.
           IF TRANS-CODE = "AADJ" OR "SADJ" OR "RET" OR "RETV"
               COMPUTE SORT-QTY-CHGD = TRANS-QTY * -1
               COMPUTE SORT-VALUE = TRANS-VALUE * -1
           ELSE
               MOVE TRANS-QTY TO SORT-QTY-CHGD
               MOVE TRANS-VALUE TO SORT-VALUE.

      *----- 09OCT90 DAP - ADDED "AADJ" TO THE IF "INV" PORTION
      *----- OF THE FOLLOWING IF STMT.  THIS ALLOWS "AADJ"
      *----- TO REMAIN VALUED AT THE DOLLAR AMT THE USER INPUT.

           IF MCHT-DEPT-TYPE = "PR"
      *        IF (TRANS-CLASS < 200) OR (TRANS-CLASS > 399
      *             AND TRANS-CLASS < 500)
               IF (TRANS-CLASS > 099 AND TRANS-CLASS < 200) OR
                  (TRANS-CLASS > 399 AND TRANS-CLASS < 500)
                       IF TRANS-STORES-CODE = "NON-STR" OR
                          STR-STD-COST = 0 OR
                          TRANS-CODE = "FRT" OR
                          TRANS-CODE = "INV" AND
                          SORT-QTY-CHGD = ZEROS
                          MOVE 0 TO SORT-STD-VALUE
                       ELSE
                          IF TRANS-CODE = "INV" OR "AADJ"
                               COMPUTE SORT-STD-VALUE =
                                   SORT-QTY-CHGD * STR-STD-COST
                          ELSE
                               MOVE SORT-VALUE TO SORT-STD-VALUE
                               COMPUTE SORT-VALUE =
                                  SORT-QTY-CHGD * STR-AVG-COST
               ELSE
                   MOVE 0 TO SORT-STD-VALUE
           ELSE
               MOVE 0 TO SORT-STD-VALUE.

           IF TRANS-VALUE = 0
               MOVE 0 TO SORT-STD-VALUE.

      **************************************************
      **   IF THE DEPT TYPE = V THIS IS A VARIANCE DEPT
      **   CHARGE AND THE ENTIRE AMOUNT SHOULD GO TO
      **   VARIANCE OTHERWISE CALCULATE A VARIANCE
      **   IF A STANDARD VALUE EXISTS (NOT = 0)
      **************************************************

           IF MCHT-DEPT-TYPE1 = "V"
               MOVE SORT-VALUE          TO SORT-VAR
               MOVE 0                   TO SORT-STD-VALUE
           ELSE
               IF SORT-STD-VALUE NOT = 0
                   COMPUTE SORT-VAR = SORT-VALUE - SORT-STD-VALUE
               ELSE
                   MOVE 0               TO SORT-VAR.

      ***************************************************
      **   IF THE DEPT TYPE = "PR" PROCESS DEPT,
      **   VOUCHER 24 (REPORT CODE 02) AND THE TRANSACTION
      **   IS FOR A NON-CODED ITEM OR AND INVOICE WITH
      **   ZERO QTY OR A FREIGHT TRANSACTION THEN THE
      **   ENTIRE AMOUNT WILL GO TO VARIANCE.
      ***************************************************

           IF MCHT-DEPT-TYPE = "PR"
               IF SORT-REPORT-CODE = "02"
                   IF TRANS-STORES-CODE = "NON-STR" OR
                      TRANS-CODE = "FRT" OR
                      TRANS-CODE = "INV" AND
                      SORT-QTY-CHGD = ZEROS
                       MOVE SORT-VALUE      TO SORT-VAR.

           RELEASE SORT-REC.
           MOVE SPACES TO SORT-REC.
           MOVE 0 TO SORT-QTY-CHGD
                     SORT-VALUE
                     SORT-VAR
                     SORT-STD-VALUE.

083800 650-GET-STR-DEPT.
083900     MOVE "SDPT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
084700     IF GOOD-CALL
084800         NEXT SENTENCE
084900     ELSE
085000         MOVE "DBGET MACCOUNT-INFO * 650-GSD" TO BU-DISPLAY-MSG
085300         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
085400         PERFORM 990-BLOWUP.
085500
085600 699-PROCESS-EXIT.
085700     EXIT.
085800
085900 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
086000     DISPLAY "BEGIN REPORT".
           MOVE 0 TO WITHDRAWALS-ACTUAL,
                     WITHDRAWALS-STANDARD,
                     WITHDRAWALS-VARIANCE.
086100     PERFORM 710-BEGIN-REPORT.
086200     PERFORM 720-PROCESS-VOUCHER
086300        UNTIL NO-MORE-SORT = "YES".
086400     PERFORM 711-END-REPORT.
086500     IF SORT-SEQ = 1
086600         PERFORM 891-HOLD-DEPT.
086700
086800**************************************************
086900**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
087000**  TO COMPLETE PROCESSING OF REPORT            **
087100**************************************************
087200
087300     GO TO 899-CREATE-EXIT.
087400
087500 710-BEGIN-REPORT.
087600     OPEN OUTPUT ONLINE-PRT.
087700     IF SORT-SEQ = 1
087800         OPEN OUTPUT VOUCHER-FILE
               OPEN OUTPUT VOUCHER-FILE2
087900     ELSE
088000         NEXT SENTENCE.
088100     MOVE SPACES TO TEMP-REC, TEMP-REC2.
088200     RETURN SORT-FILE
088300        AT END
088400            MOVE "YES" TO NO-MORE-SORT.
088500
088600 711-END-REPORT.
088700     MOVE GRAND-ACTUAL TO GRAND-ACTUAL-PRT.
088800     MOVE GRAND-STANDARD TO GRAND-STANDARD-PRT.
088900     MOVE GRAND-VARIANCE TO GRAND-VARIANCE-PRT.
089000     WRITE PRT-REC FROM GRAND-LINE AFTER ADVANCING 2.
089100
089200
089300 720-PROCESS-VOUCHER.
089400     PERFORM 721-BEGIN-VOUCHER.
089500     PERFORM 722-PROCESS-LEDGER
089600         UNTIL SORT-REPORT-CODE NOT = PREV-REPORT-CODE
089700             OR NO-MORE-SORT = "YES".
089800     PERFORM 723-VOUCHER-END.
089900
090000 721-BEGIN-VOUCHER.
090100     MOVE 0 TO VOUCHER-ACTUAL
090200               VOUCHER-STANDARD
090300               VOUCHER-VARIANCE.
090400     MOVE SORT-REPORT-CODE TO PREV-REPORT-CODE.
090500     MOVE SORT-REPORT-CODE TO REPORT-CODE-ARG.
           PERFORM 9999-DBGET7-MREPORT-RC-I.
091300     IF GOOD-CALL
091400         MOVE MREPORT-DESC  TO REPORT-DESCR-HDG
091500     ELSE
091600         IF NO-ENTRY
091700             DISPLAY "NO ENTRY IN REPORT CODE MASTER FOR "
091800                          SORT-REPORT-CODE
091900         ELSE
092000             MOVE "DBGET MREPORT * 721-BEGIN" TO BU-DISPLAY-MSG
092200             PERFORM 990-BLOWUP.
092300     PERFORM 750-PRINT-HEADINGS.
092400
092500 722-PROCESS-LEDGER.
092600     PERFORM 724-LEDGER-BEGIN.
092700     PERFORM 725-PROCESS-DIV
092800         UNTIL SORT-LEDG NOT = PREV-LEDGER
092900             OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
093000                  OR NO-MORE-SORT = "YES".
093100     PERFORM 726-LEDGER-END.
093200
093300 723-VOUCHER-END.
093400     MOVE PREV-REPORT-CODE TO REPORT-CODE-TRLR.
093500     MOVE VOUCHER-ACTUAL TO VOUCHER-ACTUAL-PRT.
093600     MOVE VOUCHER-STANDARD TO VOUCHER-STANDARD-PRT.
093700     MOVE VOUCHER-VARIANCE TO VOUCHER-VARIANCE-PRT.
093800     ADD VOUCHER-ACTUAL TO GRAND-ACTUAL.
093900     ADD VOUCHER-STANDARD TO GRAND-STANDARD.
094000     ADD VOUCHER-VARIANCE TO GRAND-VARIANCE.
094100     WRITE PRT-REC FROM VOUCHER-LINE AFTER ADVANCING 2 LINES.
094200
094300 724-LEDGER-BEGIN.
094400     MOVE 0 TO LEDGER-ACTUAL
094500               LEDGER-STANDARD
094600               LEDGER-VARIANCE.
094700     MOVE SORT-LEDG TO PREV-LEDGER.
094800
094900 725-PROCESS-DIV.
095000     IF SORT-SEQ = 1
095100         PERFORM 727-DIV-BEGIN
095200         PERFORM 728-DEPT-ACCT-PROCESS
095300             UNTIL SORT-DIV NOT = PREV-DIV
095400                OR SORT-LEDG NOT = PREV-LEDGER
095500                  OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
095600                      OR NO-MORE-SORT = "YES"
095700         PERFORM 729-DIV-END
095800     ELSE
095900         PERFORM 728-ACCOUNT-PROCESS
096000             UNTIL SORT-LEDG NOT = PREV-LEDGER
096100                OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
096200                    OR NO-MORE-SORT = "YES".
096300
096400 726-LEDGER-END.
096500     MOVE PREV-LEDGER TO LEDG-CODE-TRLR.
096600     MOVE LEDGER-ACTUAL TO LEDGER-ACTUAL-PRT.
096700     MOVE LEDGER-STANDARD TO LEDGER-STANDARD-PRT.
096800     MOVE LEDGER-VARIANCE TO LEDGER-VARIANCE-PRT.
096900     ADD LEDGER-ACTUAL TO VOUCHER-ACTUAL.
097000     ADD LEDGER-STANDARD TO VOUCHER-STANDARD.
097100     ADD LEDGER-VARIANCE TO VOUCHER-VARIANCE.
097200     WRITE PRT-REC FROM LEDGER-LINE AFTER ADVANCING 2.
097300     IF SORT-REPORT-CODE = PREV-REPORT-CODE
097400         PERFORM 750-PRINT-HEADINGS
097500     ELSE
097600         ADD 2 TO LINE-CNT.
097700
097800 727-DIV-BEGIN.
097900     MOVE 0 TO DIV-ACTUAL
098000               DIV-STANDARD
098100               DIV-VARIANCE.
098200     MOVE SORT-DIV TO PREV-DIV.
098300
098400
098500 728-DEPT-ACCT-PROCESS.
098600     PERFORM 730-DEPT-ACCT-BEGIN.
098700     PERFORM 731-TRANS-PROCESS
098800        UNTIL PREV-DEPT-ACCT NOT = SORT-DEPT-ACCT
098900            OR SORT-DIV NOT = PREV-DIV
099000                OR SORT-LEDG NOT = PREV-LEDGER
099100                    OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
099200                       OR NO-MORE-SORT = "YES".
099300     PERFORM 732-DEPT-ACCT-END.
099400
099500 728-ACCOUNT-PROCESS.
099600     PERFORM 730-ACCOUNT-BEGIN.
099700     PERFORM 731-TRANS-PROCESS
099800        UNTIL PREV-ACCT NOT = SORT-ACCT-CHGD
099900                OR SORT-LEDG NOT = PREV-LEDGER
100000                    OR SORT-REPORT-CODE NOT = PREV-REPORT-CODE
100100                       OR NO-MORE-SORT = "YES".
100200     PERFORM 732-ACCOUNT-END.
100300
100400 729-DIV-END.
100500     MOVE PREV-DIV TO DIV-CODE-TRLR.
100600     MOVE DIV-ACTUAL TO DIV-ACT-PRT.
100700     MOVE DIV-STANDARD TO DIV-STD-PRT.
100800     MOVE DIV-VARIANCE TO DIV-VAR-PRT.
100900     ADD DIV-ACTUAL TO LEDGER-ACTUAL.
101000     ADD DIV-STANDARD TO LEDGER-STANDARD.
101100     ADD DIV-VARIANCE TO LEDGER-VARIANCE.
101200     WRITE PRT-REC FROM DIV-LINE AFTER ADVANCING 2.
101300     ADD 2 TO LINE-CNT.
101400     IF LINE-CNT > 55
101500         PERFORM 750-PRINT-HEADINGS.
101600
101700 730-DEPT-ACCT-BEGIN.
101800     MOVE 0 TO DEPT-ACCT-ACTUAL
101900               DEPT-ACCT-STANDARD
102000               DEPT-ACCT-VARIANCE
102100               CLASS-102-VARIANCE
102200               CLASS-400-VARIANCE
102300               CLASS-OTHER-VARIANCE.
102400     MOVE SORT-DEPT-ACCT TO PREV-DEPT-ACCT.
102500
102600 730-ACCOUNT-BEGIN.
102700     MOVE 0 TO ACCOUNT-ACTUAL
102800               ACCOUNT-STANDARD
102900               ACCOUNT-VARIANCE.
103000     MOVE SORT-ACCT-CHGD TO PREV-ACCT.


       731-TRANS-PROCESS.
           MOVE SORT-DEPT-TYPE TO SAVE-DEPT-TYPE.
9407CK     IF SORT-ERR = "1"
  .           MOVE "** INVALID DEPT **" TO PRT-ERR
  .        ELSE
9407CK        MOVE SPACES TO PRT-ERR.

           IF SORT-SEQ = 1
               IF SORT-REPORT-CODE = 02
                   IF SORT-CLASS = 101 OR 102 OR 104 OR 106
                       ADD SORT-VALUE TO DEPT-ACCT-ACTUAL
                       ADD SORT-STD-VALUE TO DEPT-ACCT-STANDARD
                       ADD SORT-VAR TO CLASS-102-VARIANCE
                       ADD SORT-VAR TO DEPT-ACCT-VARIANCE
                       IF SORT-TRANS = "ISS " OR "RET " OR "RETV"
                           OR "AADJ" OR "SADJ" OR "ISSI"
                           ADD SORT-VALUE TO WITHDRAWALS-ACTUAL
                       ELSE
                       NEXT SENTENCE
                   ELSE
                       IF SORT-CLASS > 399 AND SORT-CLASS < 500
                           ADD SORT-VALUE TO DEPT-ACCT-ACTUAL
                           ADD SORT-STD-VALUE TO DEPT-ACCT-STANDARD
                           ADD SORT-VAR TO CLASS-400-VARIANCE
                           ADD SORT-VAR TO DEPT-ACCT-VARIANCE
                           IF SORT-TRANS = "ISS " OR "RET " OR "RETV"
                               OR "AADJ" OR "SADJ" OR "ISSI"
                               ADD SORT-VALUE TO WITHDRAWALS-ACTUAL
                           ELSE
                           NEXT SENTENCE
                       ELSE
                           ADD SORT-VALUE TO DEPT-ACCT-ACTUAL
                           ADD SORT-STD-VALUE TO DEPT-ACCT-STANDARD
                           ADD SORT-VAR TO CLASS-OTHER-VARIANCE
                           ADD SORT-VAR TO DEPT-ACCT-VARIANCE
                           IF SORT-TRANS = "ISS " OR "RET " OR "RETV"
                               OR "AADJ" OR "SADJ" OR "ISSI"
                               ADD SORT-VALUE TO WITHDRAWALS-ACTUAL
                           ELSE
                           NEXT SENTENCE
               ELSE
               ADD SORT-VALUE TO DEPT-ACCT-ACTUAL
               ADD SORT-STD-VALUE TO DEPT-ACCT-STANDARD
               ADD SORT-VAR TO DEPT-ACCT-VARIANCE
               IF SORT-TRANS = "ISS " OR "RET " OR "RETV"
                   OR "AADJ" OR "SADJ" OR "ISSI"
                   ADD SORT-VALUE TO WITHDRAWALS-ACTUAL
               ELSE
               NEXT SENTENCE
           ELSE
               ADD SORT-VALUE TO ACCOUNT-ACTUAL
               ADD SORT-STD-VALUE TO ACCOUNT-STANDARD
               ADD SORT-VAR TO ACCOUNT-VARIANCE.
           RETURN SORT-FILE
              AT END
                  MOVE "YES" TO NO-MORE-SORT.

       732-DEPT-ACCT-END.
           MOVE PREV-LEDGER TO PRT-LEDGER.
           MOVE PREV-DIV TO PRT-DIV.
           MOVE PREV-CLASS TO PRT-CLASS.
           MOVE PREV-DEPT TO PRT-DEPT.
           MOVE PREV-ACCT TO PRT-ACCOUNT.
           MOVE DEPT-ACCT-ACTUAL TO PRT-ACTUAL.
           MOVE DEPT-ACCT-STANDARD TO PRT-STD.
           MOVE DEPT-ACCT-VARIANCE TO PRT-VAR.
           ADD DEPT-ACCT-ACTUAL TO DIV-ACTUAL.
           ADD DEPT-ACCT-STANDARD TO DIV-STANDARD.
           ADD DEPT-ACCT-VARIANCE TO DIV-VARIANCE.
           WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 2.
           ADD 2 TO LINE-CNT.
           IF LINE-CNT > 55
               PERFORM 750-PRINT-HEADINGS.
           IF SORT-SEQ = 1
               PERFORM 800-VOUCHER
           ELSE
               NEXT SENTENCE.

108700 732-ACCOUNT-END.
108800     MOVE PREV-LEDGER TO PRT-LEDGER.
108900     MOVE PREV-ACCT TO PRT-ACCOUNT.
109000     MOVE ACCOUNT-ACTUAL TO PRT-ACTUAL.
109100     MOVE ACCOUNT-STANDARD TO PRT-STD.
109200     MOVE ACCOUNT-VARIANCE TO PRT-VAR.
109300     ADD ACCOUNT-ACTUAL TO LEDGER-ACTUAL.
109400     ADD ACCOUNT-STANDARD TO LEDGER-STANDARD.
109500     ADD ACCOUNT-VARIANCE TO LEDGER-VARIANCE.
109600     WRITE PRT-REC FROM DETAIL-LINE AFTER ADVANCING 2.
109700     ADD 2 TO LINE-CNT.
109800     IF LINE-CNT > 55
109900         PERFORM 750-PRINT-HEADINGS.
110000
110100 750-PRINT-HEADINGS.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
110200*****MOVE CURRENT-DATE TO DATE-H1.
           MOVE DATE-SLASH-OUT TO DATE-H1.
110300*****MOVE TIME-OF-DAY TO TIME-DIV.
           MOVE DATE-UNFORMATTED-TIME-OUT TO TIME-DIV.
110400     MOVE HH-DIV TO HH-H2.
110500     MOVE MM-DIV TO MM-H2.
110600     MOVE SS-DIV TO SS-H2.
110700     MOVE "MY" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
111500     IF GOOD-CALL
111600         NEXT SENTENCE
111700     ELSE
111800         MOVE "DBGET MACCOUNT-INFO * 750-PH" TO BU-DISPLAY-MSG
112100         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
112200         PERFORM 990-BLOWUP.
112300     MOVE MACCT-MONTH TO MONTH-PARM.
112400     MOVE MACCT-YEAR TO YEAR-PARM.
112500     MOVE MONTH-T (MONTH-PARM) TO MONTH-H3.
DP9802     IF YEAR-PARM > 70
DP9802         MOVE "19" TO YEAR-H3A
DP9802     ELSE
DP9802         MOVE "20" TO YEAR-H3A.
112600     MOVE YEAR-PARM TO YEAR-H3B.
112700     ADD 1 TO PAGE-CNT.
112800     MOVE PAGE-CNT TO PAGE-H2.
112900     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
113000     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
113100     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
113200     WRITE PRT-REC FROM REPORT-HDG AFTER ADVANCING 2.
113300     IF SORT-SEQ = 1
113400         WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2
113500     ELSE
113600         WRITE PRT-REC FROM HEADER4A AFTER ADVANCING 2.
113700     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
113800     MOVE 7 TO LINE-CNT.
113900
114000
114100 800-VOUCHER.
114200     MOVE "PLT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
115000     IF GOOD-CALL
115100         NEXT SENTENCE
115200     ELSE
115300         MOVE "DBGET MACCOUNT INFO * 800-VOUCHER"
115400              TO BU-DISPLAY-MSG
115600         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
115700         PERFORM 990-BLOWUP.
115800     MOVE MACCT-TERR-CODE TO TERR.
115900     MOVE "00000000000000000000000000" TO FILLER-1.
116000     MOVE "00000" TO FILLER-2.
116100     MOVE MONTH-PARM TO VO.
116200     MOVE YEAR-PARM TO REF.
116300     MOVE PREV-ACCT TO ACCT-SPLIT.
116400     IF PREV-REPORT-CODE = 01 OR 05
116500         PERFORM 810-VOUCHER21
116600     ELSE
116700         IF PREV-REPORT-CODE = 02
116800             PERFORM 850-VOUCHER24
116900         ELSE
117000             PERFORM 890-VOUCHER21A.
117100
117200 810-VOUCHER21.
117300     MOVE MACCT-PLT-CODE TO CO.
117400     MOVE "120" TO PR.
117500     MOVE "0521" TO SCSE.
117600     MOVE DEPT-ACCT-ACTUAL TO AMTT
117700     MOVE PREV-DEPT TO DEPT-4
117800     IF SAVE-DEPT-TYPE = "MS"
117900         MOVE "117" TO PR
118000         MOVE "901" TO EXP
118100         MOVE "201" TO DEPT-4
118200         MOVE PREV-DEPT TO ADATA
118300         PERFORM 895-WRITE-VOUCHER
118400         PERFORM 815-WRITE-OFFSET
118500     ELSE
118600         IF SAVE-DEPT-TYPE = "MU"
118700             MOVE "216" TO PR
118800             MOVE "901" TO EXP
118900             MOVE "000" TO DEPT-4
119000             MOVE PREV-DEPT TO ADATA
119100             PERFORM 895-WRITE-VOUCHER
119200             PERFORM 815-WRITE-OFFSET
119300         ELSE
119400             IF ACCT-NO-SPLIT = "000"
119500                 MOVE "200" TO EXP
119600                 PERFORM 895-WRITE-VOUCHER
119700                 PERFORM 815-WRITE-OFFSET
119800             ELSE
119900*------------------- IF THE EXPENSE CLASS IS LESS THAN 100 OR IS IN THE
120000*-------------------  2000 OR 9000 (4TH POS = 2 OR 9)  THEN THE EXPENSE
120100*------------------- CODE IS 250- MAINTENANCE EXPENSE
120200                 IF ACCT-NO-SPLIT < "100"  OR
120300                    ACCT-4TH-POS = "2" OR "9"
120400                      MOVE "250" TO EXP
120500                      PERFORM 895-WRITE-VOUCHER
120600                      PERFORM 815-WRITE-OFFSET
120700                  ELSE
120800                      MOVE ACCT-NO-SPLIT TO EXP
120900                      PERFORM 895-WRITE-VOUCHER
121000                      PERFORM 815-WRITE-OFFSET.
121100
121200 815-WRITE-OFFSET.
121300     IF PREV-CLASS = 204 OR 222
121400         MOVE "171" TO PR
121500         MOVE "204" TO DEPT-3
121600     ELSE
121700         MOVE "116" TO PR
121800         MOVE PREV-CLASS TO DEPT-3.
121900     COMPUTE AMTT = DEPT-ACCT-ACTUAL * -1.
122000     MOVE "901" TO EXP
122100     PERFORM 895-WRITE-VOUCHER.
122200
122300
122400 850-VOUCHER24.
122500     MOVE MACCT-PLT-CODE TO CO.
122600     MOVE "120" TO PR.
122700     IF SAVE-DEPT-TYPE = "PR" OR "BL"
122800         PERFORM 851-VOUCH24
122900     ELSE
123000         PERFORM 852-VOUCH24.
123100
123200 851-VOUCH24.
123300     IF PREV-CLASS = 101 OR 102
123400         MOVE "0522" TO SCSE
123500     ELSE
123600         IF PREV-CLASS = 462
123700             MOVE "0523" TO SCSE
123800         ELSE
123900             IF PREV-CLASS > 399 AND PREV-CLASS < 500
124000                 MOVE "0530" TO SCSE
124100             ELSE
124200                 MOVE "0524" TO SCSE.
124300     COMPUTE AMTT = DEPT-ACCT-ACTUAL * -1.
124400     MOVE "116" TO PR.
124500     MOVE PREV-CLASS TO DEPT-3.
124600     MOVE "901" TO EXP.
124700     PERFORM 895-WRITE-VOUCHER.
124800
124900     MOVE "117" TO PR.
125000     MOVE DEPT-ACCT-STANDARD TO AMTT.
125100     MOVE PREV-DEPT TO ADATA.
125200     MOVE "100" TO DEPT-4.
125300     MOVE "901" TO EXP.
125400     PERFORM 895-WRITE-VOUCHER.
125500
125600     IF CLASS-102-VARIANCE NOT = 0
125700         MOVE CLASS-102-VARIANCE TO AMTT
125800         MOVE "117" TO PR
125900         MOVE "904" TO EXP
      ***      *USING START >= SPACES ON MCHT-ACCTS TO PERFORM THE
      ***      *SAME FUNCTION AS A DBCLOSE MODE3 ON MCHT-ACCTS
               PERFORM 9999-INIT-MCHT-ACCTS-DP-I
126000         PERFORM 851-GET-DEPT
126100            UNTIL MCHT-DEPT-TYPE = "VR"
126200              OR END-OF-FILE
126700         MOVE MCHT-DEPT TO DEPT-4
126800         PERFORM 895-WRITE-VOUCHER.

126900     IF CLASS-400-VARIANCE NOT = 0
127000         MOVE CLASS-400-VARIANCE TO AMTT
127100         MOVE "117" TO PR
127200         MOVE "904" TO EXP
      ***      *USING START >= SPACES ON MCHT-ACCTS TO PERFORM THE
      ***      *SAME FUNCTION AS A DBCLOSE MODE3 ON MCHT-ACCTS
               PERFORM 9999-INIT-MCHT-ACCTS-DP-I
127300         PERFORM 851-GET-DEPT
127400            UNTIL MCHT-DEPT-TYPE = "VF"
127500              OR END-OF-FILE
128000         MOVE MCHT-DEPT TO DEPT-4
128100         PERFORM 895-WRITE-VOUCHER.

128200     IF CLASS-OTHER-VARIANCE NOT = 0
128300         MOVE CLASS-OTHER-VARIANCE TO AMTT
128400         MOVE "117" TO PR
128500         MOVE "904" TO EXP
      ***      *USING START >= SPACES ON MCHT-ACCTS TO PERFORM THE
      ***      *SAME FUNCTION AS A DBCLOSE MODE3 ON MCHT-ACCTS
               PERFORM 9999-INIT-MCHT-ACCTS-DP-I
128600         PERFORM 851-GET-DEPT
128700            UNTIL MCHT-DEPT-TYPE = "VO"
128800              OR END-OF-FILE
129300         MOVE MCHT-DEPT TO DEPT-4
129400         PERFORM 895-WRITE-VOUCHER.
129500
129600 851-GET-DEPT.
           PERFORM 9999-DBGET2-MCHT-ACCTS-DP-I.
130400     IF GOOD-CALL
130500         NEXT SENTENCE
130600     ELSE
130700         IF END-OF-FILE
130800             NEXT SENTENCE
130900         ELSE
131000             MOVE "DBGET MCHT-ACCTS * 851-GET" TO BU-DISPLAY-MSG
131200             MOVE DEPT-KEY TO BU-DISPLAY-FLD (1)
131300             PERFORM 990-BLOWUP.
131400 852-VOUCH24.
131500     IF PREV-CLASS = 101 OR 102
131600         MOVE "0522" TO SCSE
131700     ELSE
131800         IF PREV-CLASS = 462
131900             MOVE "0523" TO SCSE
132000         ELSE
132100             IF PREV-CLASS > 399 AND PREV-CLASS < 500
132200                 MOVE "0530" TO SCSE
132300             ELSE
132400                 MOVE "0524" TO SCSE.
132500     IF DEPT-ACCT-VARIANCE NOT = 0
132600         MOVE "117" TO PR
132700         MOVE DEPT-ACCT-VARIANCE TO AMTT
132800         MOVE "904" TO EXP
132900         MOVE PREV-DEPT TO DEPT-4
133000         PERFORM 895-WRITE-VOUCHER
133100
133200         COMPUTE AMTT = DEPT-ACCT-VARIANCE * -1
133300         MOVE "901" TO EXP
133400         MOVE "116" TO PR
133500         MOVE PREV-CLASS TO DEPT-3
133600         PERFORM 895-WRITE-VOUCHER
133700     ELSE
133800         IF SAVE-DEPT-TYPE = "MS"
133900             MOVE DEPT-ACCT-ACTUAL TO AMTT
134000             MOVE "117" TO PR
134100             MOVE "901" TO EXP
134200             MOVE "201" TO DEPT-4
134300             MOVE PREV-DEPT TO ADATA
134400             PERFORM 895-WRITE-VOUCHER
134500             COMPUTE AMTT = DEPT-ACCT-ACTUAL * -1
134600             MOVE "116" TO PR
134700             MOVE PREV-CLASS TO DEPT-3
134800             MOVE "901" TO EXP
134900             PERFORM 895-WRITE-VOUCHER
135000         ELSE
135100             MOVE DEPT-ACCT-ACTUAL TO AMTT
135200             MOVE ACCT-NO-SPLIT TO EXP
135300             MOVE PREV-DEPT TO DEPT-4
135400             PERFORM 895-WRITE-VOUCHER
135500
135600             COMPUTE AMTT = DEPT-ACCT-ACTUAL * -1
135700             MOVE "901" TO EXP
135800             MOVE "116" TO PR
135900             MOVE PREV-CLASS TO DEPT-3
136000             PERFORM 895-WRITE-VOUCHER.
136100
136200 890-VOUCHER21A.
136300     MOVE "0521" TO SCSE.
136400     IF PREV-DEPT = "0000" AND
136500         PREV-ACCT > "009999"
136600           ADD DEPT-ACCT-ACTUAL TO HOLD-9013
136700           COMPUTE AMTT = DEPT-ACCT-ACTUAL * -1
136800           MOVE "901" TO EXP
136900           MOVE "116" TO PR
137000           MOVE PREV-CLASS TO DEPT-3
137100           PERFORM 895-WRITE-VOUCHER
137200     ELSE
137300           PERFORM 810-VOUCHER21.
137400
137500 891-HOLD-DEPT.
137600
137700     MOVE "PLT" TO MACCT-KEY.
           PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
138500     IF GOOD-CALL
138600         NEXT SENTENCE
138700     ELSE
138800         MOVE "DBGET MACCOUNT INFO * 891-HOLD" TO BU-DISPLAY-MSG
139100         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
139200         PERFORM 990-BLOWUP.
139300     MOVE HOLD-9013 TO AMTT.
139400     MOVE MACCT-PLT-CODE TO CO.
139500     MOVE "175" TO PR
139600     MOVE "901" TO EXP.
139700     MOVE "001" TO DEPT-4.
      ***  *USING START >= SPACES ON MCHT-ACCTS TO PERFORM THE
      ***  *SAME FUNCTION AS A DBCLOSE MODE3 ON MCHT-ACCTS
           PERFORM 9999-INIT-MCHT-ACCTS-DP-I.
139800     PERFORM 851-GET-DEPT
139900        UNTIL MCHT-DEPT-TYPE = "MW"
140000            OR END-OF-FILE.
140100     MOVE MCHT-DEPT TO ADATA.
140200     PERFORM 895-WRITE-VOUCHER.
140300
140400
140500
140600
140700 895-WRITE-VOUCHER.
           MOVE TEMP-REC TO TEMP-REC2.
140800     WRITE VOUCHER-REC FROM TEMP-REC.
           MOVE WITHDRAWALS-ACTUAL TO WITHAMTT-2.
           WRITE VOUCHER-REC2 FROM TEMP-REC2.
           MOVE 0 TO WITHDRAWALS-ACTUAL,
                     WITHDRAWALS-STANDARD,
                     WITHDRAWALS-VARIANCE.
140900     MOVE SPACES TO DEPT-4
141000                    ADATA.
141100
141200 899-CREATE-EXIT.
141300     EXIT.

       900-ERROR SECTION.

9407CK 990-BLOWUP.
  .        MOVE "  CSACCT;" TO BASE.
  .        MOVE "TSUMCHGS" TO BU-PGM-NAME.
  .        CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
  .           DUMMY-VIEW-AREA, FILE-STATUS, BU-DISPLAY-MSG,
  .           BU-DISPLAY-FLDS.
  .
  .   * * * * * * * * * * * OLD BLOWUP ROUTINE  * * * * * * * *
  .   *990-BLOWUP.                                            *
  .   *                                                       *
  .   *    DISPLAY "**********************************".      *
  .   *    DISPLAY "**          TSUMCHGS            **".      *
  .   *    DISPLAY "** WRITE DOWN THE FOLLOWING AND **".      *
  .   *    DISPLAY "**   CONTACT PROGRAMMING STAFF  **".      *
  .   *    DISPLAY "**********************************".      *
  .   *    DISPLAY BU-DISPLAY-AREA.                           *
  .   *    DISPLAY "FILE-STATUS = " FILE-STATUS.              *
  .   *                                                       *
  .   *    PERFORM 9999-CLOSE-STUFF.                          *
  .   *    GOBACK.                                            *
9407CK* * * * * * * * * * * * * * * * * * * * * * * * * * * * *

       1000-CLOSE-FILES.
           IF SORT-SEQ = 1
               CLOSE VOUCHER-FILE
9407CK         IF FOUND-ERROR = "Y"
  .               DISPLAY "ERRORS FOUND IN FILE.  "
  .                       "FILE VOCHRFLE WILL BE DELETED."
  .               MOVE "VOCHRFLE  " TO MCDLT-FILENAME
  .               CALL "MCDLT"   USING MCDLT-FILENAME
9407CK            PERFORM 1010-WRITE-ERROR-BOX.
           CLOSE ONLINE-PRT.
           PERFORM 9999-CLOSE-STUFF.

9407CK 1010-WRITE-ERROR-BOX.
  .        ADD 1 TO PAGE-CNT.
  .        MOVE PAGE-CNT TO PAGE-H2.
  .        WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
  .        WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
  .        WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
  .        WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 1.
  .        MOVE "* * * * * * * * * * * * * * * * * * * * * * * *"
  .              TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 8 LINES.
  .        MOVE "*                                             *"
  .              TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*     ERRORS EXIST ON THIS VOUCHER REPORT     *"
  .             TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*                                             *"
  .             TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*      DO NOT SEND VOUCHER DATA TO AKRON      *"
  .             TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "*                                             *"
  .             TO PRT-REC.
  .        WRITE PRT-REC  AFTER ADVANCING 1 LINES.
  .        MOVE "* * * * * * * * * * * * * * * * * * * * * * * *"
  .             TO PRT-REC.
9407CK     WRITE PRT-REC  AFTER ADVANCING 1 LINES.

       9999-ROUTINES SECTION.
       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-DTRANS-MC-I.
           MOVE SPACES TO MATLCODE OF DTRANS-MC-REC-I.
           START DTRANS-MC-I KEY >= MATLCODE OF DTRANS-MC-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBGET7-MMATL-ACCUM-MC-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO MATLCODE OF MMATL-ACCUM-MC-REC-I.
           READ MMATL-ACCUM-MC-I INTO BUF-MATLACUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-KEY TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           MOVE MMATL-CODE-ARG TO CORPCDE OF MSTORERM-CD-REC-I.
           READ MSTORERM-CD-I INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET7-MREPORT-RC-I.
           MOVE 0 TO COND-WORD.
           MOVE REPORT-CODE-ARG TO RPTCODE OF MREPORT-RC-REC-I.
           READ MREPORT-RC-I INTO BUF-MREPORT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-DBGET2-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           READ MCHT-ACCTS-DP-I NEXT INTO BUF-MCHTACCTS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.

       9999-INIT-MCHT-ACCTS-DP-I.
           MOVE SPACES TO DEPT OF MCHT-ACCTS-DP-REC-I.
           START MCHT-ACCTS-DP-I KEY >= DEPT OF MCHT-ACCTS-DP-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-OPEN-STUFF.
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MMATL-ACCUM-MC-I     .
           OPEN INPUT MCHT-ACCTS-DP-I      .
           OPEN INPUT MSTORERM-CD-I        .
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT MREPORT-RC-I         .

       9999-CLOSE-STUFF.
           CLOSE      DTRANS-MC-I          .
           CLOSE      MMATL-ACCUM-MC-I     .
           CLOSE      MCHT-ACCTS-DP-I      .
           CLOSE      MSTORERM-CD-I        .
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      MREPORT-RC-I         .
