000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TSUMCRFT.
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZREPORT-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
001000     SELECT SUM-FILE
001100         ASSIGN TO DATABASE-MCFPSUMFIL
               ORGANIZATION IS SEQUENTIAL
001200         ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS SUM-STATUS.
           SELECT WO-CRAFTS-REQD-FILE
               ASSIGN TO DATABASE-MCFLMM0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WCRF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-ZONE-PRTY-FILE
               ASSIGN TO DATABASE-MCFLMM0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WZPF-STATUS.
001500 DATA DIVISION.
001600 FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                 PIC X(2000).
001700 FD  SUM-FILE
001800     RECORD CONTAINS 80 CHARACTERS
001900     DATA RECORD IS SUMREC.
002000 01  SUMREC                    PIC X(80).
       FD  WO-CRAFTS-REQD-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WCRFREC.
       01  WCRFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0601.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD.
       01  LAST-NUM-USED-REC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-ZONE-PRTY-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WZPFREC.
       01  WZPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.
002300 WORKING-STORAGE SECTION.
       77  ERR-SW                    PIC X.
002500 01  ARG-NO                    PIC 9(9).
       01  BLOWUP-BASE               PIC X(16).
       01  C-DATE.
           05  C-DATE-MM             PIC XX.
           05  FILLER                PIC X.
           05  C-DATE-DD             PIC XX.
           05  FILLER                PIC X.
           05  C-DATE-YY             PIC XX.
       COPY CATREAD  IN COPYLIB.
       COPY CCHKOBJ  IN COPYLIB.
       COPY CPYIND   IN COPYLIB.
       COPY CCRTFILE IN COPYLIB.
008400 01  CRAFT-ARG                 PIC XX    VALUE SPACES.
       01  CRAFT-BUFF.               COPY MWOCRAFT OF COPYLIB.
007800 01  CURDATE-BUFFER.
007900     05  YY-BUFFER             PIC XX.
008100     05  MM-BUFFER             PIC XX.
008300     05  DD-BUFFER             PIC XX.
008600 01  DATE-WA-ALL.
008700     05  DATE-WA.
008800         10  DATE-WA-YY        PIC XX.
008900         10  DATE-WA-MM        PIC XX.
009000         10  DATE-WA-DD        PIC XX.
009100     05  DATE-WA-9 REDEFINES DATE-WA.
009200         10  DATE-WA-YY-9      PIC 99.
009300         10  DATE-WA-MM-9      PIC 99.
009400         10  DATE-WA-DD-9      PIC 99.
009500 01  DATE-WA-SAV1              PIC 999999.
009600 01  DATE-WA-SAV2              PIC 999999.
009700 01  DATE-WA-2.
009800     05  DATE-WA-YY-2          PIC 99.
009900     05  DATE-WA-MM-2          PIC 99.
010000     05  DATE-WA-DD-2          PIC 99.
002900 01  DBPARAMETERS.             COPY DBPARMS OF COPYLIB.
003000 COPY TDATESUB  IN COPYLIB.
       01  DELETE-FILE               PIC X(10) VALUE "MCFPSUMFIL".
002800 01  ERROR-BUFFER              PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  SUM-STATUS            PIC XX.
           05  WCRF-STATUS           PIC XX.
           05  WLNU-STATUS           PIC XX.
           05  WZPF-STATUS           PIC XX.
       COPY JCWAREA    IN COPYLIB.
       COPY IOFEEDBACK IN COPYLIB.
004200 01  LAST-WO-BUFF.             COPY MLASTWO  OF COPYLIB.
004300 COPY LANGSUB OF COPYLIB.
005400 01  SCREEN-BUFFER.
           05  SCREEN-DATA.
027800         10  DATE-BUF.
027900             15  DATE-BUF-MM   PIC XX.
028000             15  DATE-BUF-DD   PIC XX.
028100             15  DATE-BUF-YY   PIC XX.
028200         10  SHIFT-BUF         PIC X.
028300         10  ZONE-BUF.
028400             15  Z-BUF-1       PIC X.
028500             15  Z-BUF-2       PIC X.
028600             15  Z-BUF-3       PIC X.
028700             15  Z-BUF-4       PIC X.
028800         10  DEPT-BUF          PIC X(04).
028900         10  CRAFT-BUF         PIC X(02).
           05  SCREEN-CMD-LINE       PIC X(79).
           05  SCREEN-ERR-LINE       PIC X(79).
005300 COPY DBSTAT    IN COPYLIB.
006600 01  SUB1                      PIC S9(4) COMP-4.
006700 01  SUB2                      PIC S9(4) COMP-4.
       COPY TBLOWUP   IN COPYLIB.
       01  TRUE-VAL                  PIC 1 VALUE B"1".
007300 COPY VCOMLINK  IN COPYLIB.
007400 COPY WSCONTROL IN COPYLIB.
045100 01  ZONE-ARGUMENT.
045200     05  Z-ARG-4               PIC X(4).
045300     05  Z-ARG-5               PIC X VALUE "1".
045400     05  FILLER                PIC X VALUE SPACE.
045500 01  ZONE-HOLD-1               PIC X(04).
045600 01  ZONE-HOLD-2               PIC X(04).
045800 01  ZONE-PRTY-BUFF.           COPY MZONPRTY OF COPYLIB.
007600 PROCEDURE DIVISION.
007700 START-PAR.
007800     PERFORM 1-HSK.
007900     PERFORM 6-MAIN THRU 6-MAIN-X.
008200
008400 2-EOJ.
           CLOSE DISPLAY-FILE.
           IF ERR-SW = "N"
008800         CLOSE SUM-FILE
               CLOSE WO-LAST-NUM-USED
               CLOSE WO-CRAFTS-REQD-FILE
               CLOSE WO-ZONE-PRTY-FILE
               MOVE "090"       TO SETJCW-VALUE
               MOVE 278         TO SETJCW-STARTING-POS
               MOVE 3           TO SETJCW-LENGTH
               CALL "SETJCW" USING SETJCW-VALUE
                                   SETJCW-STARTING-POS
                                   SETJCW-LENGTH
                                   SETJCW-STATUS
               IF SETJCW-STATUS NOT = "00"
                   MOVE "SETJCW ERROR" TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               CALL "TRSCREN2".

009600     GOBACK.
009700
009900 1-HSK.
           MOVE "N"          TO ERR-SW.
           OPEN I-O   DISPLAY-FILE.
           MOVE "MCFPSUMFIL" TO CHKOBJ-FILE-NAME.
           CALL "CCHKOBJ" USING CHKOBJ-FILE-NAME,
                                CHKOBJ-RETURN-STATUS.
           IF CHKOBJ-RETURN-STATUS NOT = "00"
               NEXT SENTENCE
           ELSE
113600*M   "SUMMARY REPORT ACTIVE - TRY AGAIN IN A COUPLE MINUTES"
113700     MOVE "CRFTSCNM" TO VIEW-CFNAME
           MOVE TRUE-VAL TO INDS (98)
113800     PERFORM 99-SCREEN-WRITE
113900     PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
114000     MOVE "Y"  TO  ERR-SW
           GO TO 2-EOJ.
           MOVE "*CURLIB"     TO CCRTFILE-LIBRARY.
           MOVE "MCFPSUMFIL"  TO CCRTFILE-FILE.
           MOVE "0080"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "000010"      TO CCRTFILE-NO-RECORDS.
           MOVE "00001"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "03"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'MCFPSUMFIL' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
014200     OPEN OUTPUT SUM-FILE.
           OPEN INPUT WO-LAST-NUM-USED.
           OPEN INPUT WO-CRAFTS-REQD-FILE.
           OPEN INPUT WO-ZONE-PRTY-FILE.
013600     MOVE 1 TO ARG-NO.
           MOVE 0 TO COND-WORD VIEW-LASTKEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-CODE.
017100     MOVE SPACES TO SCREEN-BUFFER.

015600 6-MAIN.
           IF TRUE-VAL = INDS (99)
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE.
016000     MOVE "CRFTSCN1"  TO VIEW-CFNAME.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           IF VIEW-LASTKEY = 3
               CALL "MCDLT" USING DELETE-FILE.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
067100     IF DATE-BUF = SPACES
               MOVE MM-BUFFER TO C-DATE-MM
               MOVE DD-BUFFER TO C-DATE-DD
               MOVE YY-BUFFER TO C-DATE-YY
067200         MOVE C-DATE TO DATE-VALIDATE-IN
067300         MOVE 2 TO DATE-MODE
067400         CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS
067500         MOVE DATE-OUT TO DATE-BUF.
067600     IF SHIFT-BUF = " " MOVE "A" TO SHIFT-BUF.
067800     MOVE DATE-BUF TO DATE-VALIDATE-IN.
067900     MOVE 3 TO DATE-MODE.
068000     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
068100     IF DATE-RET-CODE = 1
068200         MOVE DATE-MSG TO SCREEN-ERR-LINE, ERROR-BUFFER
068300         MOVE TRUE-VAL TO INDS (1) INDS (99)
068500         GO TO 6-MAIN.
068600     MOVE DATE-DB TO DATE-WA.
068700     IF SHIFT-BUF NOT NUMERIC
068800         IF SHIFT-BUF NOT = "A"
068900             MOVE  35034 TO CATREAD-MSG-NUMBER
069100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
068300             MOVE TRUE-VAL TO INDS (2) INDS (99)
069400             GO TO 6-MAIN.
069500     IF SHIFT-BUF NUMERIC
069600         IF SHIFT-BUF < "1" OR > "4"
069700             MOVE  35034 TO CATREAD-MSG-NUMBER
069900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
070000             MOVE TRUE-VAL TO INDS (2) INDS (99)
070200             GO TO 6-MAIN.
070300
070700     IF ZONE-BUF NOT = SPACES
070800         IF Z-BUF-1 = "C" AND Z-BUF-2 = SPACE
070900             MOVE "C1  " TO ZONE-HOLD-1
071000             MOVE "C2  " TO ZONE-HOLD-2
071100             GO TO 6-EDIT-CRAFT
071200         ELSE
               NEXT SENTENCE
071300     ELSE
071400     GO TO 6-EDIT-CRAFT.

           MOVE 0 TO COND-WORD.
           IF Z-BUF-2 = "*" OR Z-BUF-3 = "*"
               NEXT SENTENCE
           ELSE
071600     MOVE ZONE-BUF TO Z-ARG-4
           MOVE ZONE-ARGUMENT TO ZONEPRTY OF WZPFREC
071700     START WO-ZONE-PRTY-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
072000     IF COND-WORD = 17
072100         MOVE  35044 TO CATREAD-MSG-NUMBER
072300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
072400         MOVE TRUE-VAL TO INDS (3) INDS (99)
072600         GO TO 6-MAIN.
073100
073300 6-EDIT-CRAFT.
073500     IF CRAFT-BUF NOT = SPACES
073600         NEXT SENTENCE
073700     ELSE
073800     GO TO 6-MAIN-CONT.
           MOVE 0 TO COND-WORD.
074000     MOVE CRAFT-BUF TO CRAFT-ARG.
           READ WO-CRAFTS-REQD-FILE INTO CRAFT-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
074400     IF COND-WORD = 17
074500         MOVE  35037 TO CATREAD-MSG-NUMBER
074700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO SCREEN-ERR-LINE
074800         MOVE TRUE-VAL TO INDS (5) INDS (99)
075000         GO TO 6-MAIN.
026100
       6-MAIN-CONT.
           MOVE DATE-WA TO DATE-BUF.
           MOVE SCREEN-DATA TO SUMREC.
028400     WRITE SUMREC.
029100
029200 6-MAIN-X.    EXIT.
029400
       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

045400 998-BLOWUP.
045500     MOVE "TSUMCRFT" TO BU-PGM-NAME.
045600     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
045700                      VIEW-COMAREA DUMMY-KSAM-STAT
045800                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

031300 999-CATREAD.
031400     MOVE SPACES TO ERROR-BUFFER.
031500     CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
032100 999-CATREAD-EXIT.    EXIT.
