       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TSUPDT.
       AUTHOR.                 W.D. ROXBURY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-BASIC
                  ASSIGN       TO DATABASE-MCFLMM1001
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT EQP-EQUIPMENT
                  ASSIGN       TO DATABASE-MCFLMM0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-LABOR
                  ASSIGN       TO DATABASE-MCFLMM1302
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT CUR-LABOR-CC
                  ASSIGN       TO DATABASE-MCFLMM1601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT CUR-LABOR-WO
                  ASSIGN       TO DATABASE-MCFLMM1602
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN       TO WORKSTATION-ZCORLESS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS MODE  IS SEQUENTIAL
                  FILE STATUS  IS SCREEN-STATUS
                               MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-BASIC
           LABEL RECORDS ARE STANDARD.
       01  VWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.

       FD  EQP-EQUIPMENT
           LABEL RECORDS ARE STANDARD.
       01  EQP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0201.

       FD  WO-LABOR
           LABEL RECORDS ARE STANDARD.
       01  LBR-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1302.

       FD  CUR-LABOR-CC
           LABEL RECORDS ARE STANDARD.
       01  CLCC-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1601.

       FD  CUR-LABOR-WO
           LABEL RECORDS ARE STANDARD.
       01  CLWO-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM1602.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  EMP-FLAG            PIC 9      VALUE 0.
       77  MIDNITE-FLAG        PIC 9      VALUE 0.
       77  DATE-ERROR          PIC 9      VALUE 0.
       77  START-FLAG          PIC 9999   VALUE ZEROS.
       77  END-FLAG            PIC 9999   VALUE ZEROS.
       77  ZONE-LINK           PIC X(04).
       77  WO-BASIC-HOLD       PIC X(500) VALUE SPACES.
       77  LABOR-HRS-WA        PIC S99V9  VALUE ZEROS.
       77  QUEUE-PRTY          PIC 9      VALUE ZEROS.
       77  QUEUE-SW            PIC X.
       77  QUEUE-ERROR         PIC X(76).
       77  JUL-DAY-RECD        PIC S9(8)  VALUE ZEROS.
       77  JUL-DAY-STRT        PIC S9(8)  VALUE ZEROS.
       77  JUL-DAY-COMP        PIC S9(8)  VALUE ZEROS.
       77  JUL-DAY-SAVE        PIC S9(8)  VALUE ZEROS.
       77  TCOMP-MIN           PIC S9(6)  VALUE ZEROS.
       77  TRECD-MIN           PIC S9(6)  VALUE ZEROS.
       77  TSAVE-MIN           PIC S9(6)  VALUE ZEROS.
       77  TSTRT-MIN           PIC S9(6)  VALUE ZEROS.
       77  TRUE-VAL            PIC 1      VALUE B"1".
       77  FALS-VAL            PIC 1      VALUE B"0".
       77  D-PARM              PIC X.
       77  L-PARM              PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  CUR-TIME-COMPARE.
           05  COMPARE-TIME.
               10  COMPARE-HRS PIC 99 VALUE ZEROS.
               10  COMPARE-MIN PIC 99 VALUE ZEROS.
           05  COMPARE-SEC     PIC 99 VALUE ZEROS.
           05  COMPARE-100THS  PIC 99 VALUE ZEROS.

       01  USER-IP-COMPARE.
           05  IP-COMP-DATE.
               10  IP-COMP-CC  PIC 99   VALUE ZEROS.
               10  IP-COMP-YY  PIC 99   VALUE ZEROS.
               10  IP-COMP-MM  PIC 99   VALUE ZEROS.
               10  IP-COMP-DD  PIC 99   VALUE ZEROS.
           05  IP-COMP-TIME    PIC 9999 VALUE ZEROS.

       01  TEMP-TIME-DATE.
           05  TEMP-IP-DATE.
               10  TEMP-MM     PIC XX.
               10  TEMP-DD     PIC XX.
               10  TEMP-YY     PIC XX.
           05  TEMP-IP-TIME.
               10  TEMP-IP-HH  PIC XX.
               10  TEMP-IP-MM  PIC XX.

       01  SHIFT-DATA.
           05  ZONE-BUF        PIC X(04).
           05  TIME-IN.
               10  HRS-IN      PIC 99 VALUE ZEROS.
               10  MIN-IN      PIC 99 VALUE ZEROS.
           05  CODE-BUF        PIC X.
           05  SHIFTS.
               10  S-1         PIC 9999 VALUE ZEROS.
               10  E-1         PIC 9999 VALUE ZEROS.
               10  S-2         PIC 9999 VALUE ZEROS.
               10  E-2         PIC 9999 VALUE ZEROS.
               10  S-3         PIC 9999 VALUE ZEROS.
               10  E-3         PIC 9999 VALUE ZEROS.
               10  S-4         PIC 9999 VALUE ZEROS.
               10  E-4         PIC 9999 VALUE ZEROS.
           05  CURR-SHIFT      PIC 9    VALUE ZEROS.

       01  TODAYS-DATE.
           05  CUR-DATE-CC     PIC 99.
           05  CUR-DATE-WA.
               10  CUR-DATE-YY PIC 99.
               10  CUR-DATE-MM PIC 99.
               10  CUR-DATE-DD PIC 99.

       01  LABOR-CURR-DATA-2.
           05  EMP-NO-2                  PIC X(4).
           05  WO-NO-CLS-2.
               10  WO-NO-CLS-7-2         PIC X(7).
               10  WO-NO-CLS-SUFF-2      PIC X(3).
           05  C-START-DATE-2.
               10  C-START-CC-2          PIC 99 VALUE ZEROS.
               10  C-START-YY-2          PIC 99 VALUE ZEROS.
               10  C-START-MM-2          PIC 99 VALUE ZEROS.
               10  C-START-DD-2          PIC 99 VALUE ZEROS.
           05  C-START-TIME-2.
               10  C-START-HH-2          PIC 99 VALUE ZEROS.
               10  C-START-MI-2          PIC 99 VALUE ZEROS.
           05  C-COMPL-DATE-2.
               10  C-COMPL-CC-2          PIC 99 VALUE ZEROS.
               10  C-COMPL-YY-2          PIC 99 VALUE ZEROS.
               10  C-COMPL-MM-2          PIC 99 VALUE ZEROS.
               10  C-COMPL-DD-2          PIC 99 VALUE ZEROS.
           05  C-COMPL-TIME-2.
               10  C-COMPL-HH-2          PIC 99 VALUE ZEROS.
               10  C-COMPL-MI-2          PIC 99 VALUE ZEROS.
           05  LCS-PAD-2                 PIC X(6).

       01  WO-CC-IP-MSG.
           05  FILLER  PIC X(20) VALUE "CRAFTSMAN WAS MOVED ".
           05  FILLER  PIC X(20) VALUE "`LV' FROM WORKORDER ".
           05  WO-MSG  PIC X(10) VALUE SPACES.

       01  CW-NO-IP-ERROR-1.
           05  FILLER  PIC X(19) VALUE "THERE IS NO RECORD ".
           05  FILLER  PIC X(19) VALUE "IN THE DATABASE FOR".
           05  FILLER  PIC X(05) VALUE " CC# ".
           05  CLK-CD  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(17) VALUE " STARTING ON W/O#".
           05  WRK-NO  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.

       01  CW-NO-IP-ERROR-2.
           05  FILLER  PIC X(10) VALUE "INPUT DATE".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(08) VALUE "AND TIME".
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.
           05  FILLER  PIC X(21) VALUE "CC STARTED WORK ORDER".
           05  FILLER  PIC X(17) VALUE "AND PRESS ENTER  ".

       01  CW-NO-IP-ERROR-3.
           05  FILLER  PIC X(25) VALUE "THERE IS A RECORD IN THE ".
           05  FILLER  PIC X(17) VALUE "DATABASE FOR CC# ".
           05  CLK-3   PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(18) VALUE " STARTING ON W/O# ".
           05  WRK-3   PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(02) VALUE SPACES.

       01  CW-NO-IP-ERROR-4.
           05  FILLER  PIC X(23) VALUE "THE W/O WAS STARTED AT ".
           05  IP-TM   PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE " AND LEFT AT ".
           05  CO-TM   PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(32) VALUE SPACES.

       01  CW-NO-IP-ERROR-5.
           05  FILLER  PIC X(10) VALUE "INPUT DATE".
           05  FILLER  PIC X(06) VALUE SPACES.
           05  FILLER  PIC X(08) VALUE "AND TIME".
           05  FILLER  PIC X(04) VALUE SPACES.
           05  FILLER  PIC X(23) VALUE "CC RESTARTED WORK ORDER".
           05  FILLER  PIC X(16) VALUE " AND PRESS ENTER".

       01  GREG-DATE.
           05  G-YEAR          PIC XXXX.
           05  G-MONTH         PIC XX.
           05  G-DAY           PIC XX.

       01  JUL-SIGN            PIC S9(06).
       01  JUL-DATE            PIC  X(07).
       01  JULIAN-DATE         REDEFINES JUL-DATE
                               PIC  9(07).
       01  FILLER              REDEFINES JUL-DATE.
           05  J-YEAR          PIC 9999.
           05  J-DAY           PIC 999.

       01  DATE-HOLD.
           05  DH-MM           PIC XX.
           05  DH-DD           PIC XX.
           05  DH-YY           PIC XX.

       01  TIME-BUFF.
           05  TIME-HM.
               10  TIME-HRS    PIC 99 VALUE ZEROS.
               10  TIME-MINS   PIC 99 VALUE ZEROS.
           05  FILLER          PIC XXXX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  EQP-EQUIP-DATA.
           COPY MEQPFILE       IN COPYLIB.

       01  WO-LABOR-DATA.
           COPY DWOLABOR       IN COPYLIB.

       01  WO-QUEUE-DATA.
           COPY DWOOPENQ       IN COPYLIB.

       01  LABOR-CURR-DATA.
           COPY DCURRLBR       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       01  WO-TRACK-DATA.
           COPY DWOTRACK       IN COPYLIB.

       01  WO-NUMBER-WORK.
           05  WO-NUM-WORK-1-6         PIC X(6).
           05  WO-NUM-WORK-7           PIC X.
           05  WO-NUM-WORK-8-10        PIC XXX.

       01  SCREEN-DATA.
           05  CRAFT-BUF               PIC X(04).
           05  STAT-BUF                PIC XX.
           05  WO-NUM-BUF.
               10  WO-BUF-6            PIC X(06).
               10  WO-YR-BUF           PIC X.
               10  WO-SUF-BUF          PIC XXX.
           05  FAIL-BUF.
               10  FAIL-BUF-1-2.
                   15  FAIL-BUF-1      PIC X.
                   15  FAIL-BUF-2      PIC X.
               10  FAIL-BUF-3-6.
                   15  FAIL-BUF-3      PIC X.
                   15  FAIL-BUF-4      PIC X.
                   15  FAIL-BUF-5      PIC X.
                   15  FAIL-BUF-6      PIC X.
           05  TIME-BUF.
               10  HRS-BUF             PIC XX.
               10  MIN-BUF             PIC XX.
           05  DATE-BUF.
               10  MM-BUF              PIC XX.
               10  DD-BUF              PIC XX.
               10  YY-BUF              PIC XX.
           05  COMM-BUF                PIC X(60).
           05  ERR-MSG-A.
               10  MSGA-1-38           PIC X(38).
               10  MSGA-39-76          PIC X(38).
           05  ERR-MSG-B.
               10  MSGB-1-38           PIC X(38).
               10  MSGB-39-76          PIC X(38).
           05  ERR-MSG-C.
               10  MSGC1               PIC X(10).
               10  I-DATE.
                   15  I-MM            PIC XX.
                   15  I-DD            PIC XX.
                   15  I-YY            PIC XX.
               10  MSG5                PIC X(08).
               10  I-TIME.
                   15  I-HRS           PIC XX.
                   15  I-MIN           PIC XX.
               10  MSG8                PIC X(38).
           05  SCREEN-MSGS.
               10  CMDMSG              PIC X(79).
               10  ERRMSG              PIC X(79).

       01  USER-INPUT.
           05  USER-IP-DATE-TIME.
               10  USER-IP-DATE.
                   15  UID-MM  PIC XX.
                   15  UID-DD  PIC XX.
                   15  UID-YY  PIC XX.
               10  USER-IP-TIME.
                   15  UID-HRS PIC XX.
                   15  UID-MIN PIC XX.
           05  DATE-BUF-CYMD.
               10  DATE-BUF-C  PIC 99.
               10  DATE-BUF-Y  PIC 99.
               10  DATE-BUF-M  PIC 99.
               10  DATE-BUF-D  PIC 99.
           05  FILLER          PIC XXXX.
           05  OO-CW-SW        PIC X.

       01  WO-BASIC-DATA.
           COPY DWOBASIC       IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS
                                WO-TRACK-DATA
                                WO-NUMBER-WORK
                                SCREEN-DATA
                                USER-INPUT
                                WO-BASIC-DATA.

       START-PROCESSING.
           OPEN INPUT          EQP-EQUIPMENT.
           OPEN INPUT          WO-BASIC.
           OPEN INPUT          WO-LABOR.
           OPEN I-O            CUR-LABOR-CC.
           OPEN I-O            CUR-LABOR-WO.
           OPEN I-O            DISPLAY-FILE.

           ACCEPT CUR-DATE-WA  FROM DATE.
           MOVE 20             TO CUR-DATE-CC.
           IF CUR-DATE-YY > 70
               MOVE 19         TO CUR-DATE-CC.

           MOVE SPACES         TO LABOR-CURR-DATA DATE-BUF-CYMD
                                  TEMP-TIME-DATE RETURN-BYTE.
           MOVE DATE-BUF       TO DATE-HOLD.
           IF DATE-FLAG = 3
               MOVE MM-BUF     TO DH-DD
               MOVE DD-BUF     TO DH-MM.

           MOVE ZONE           TO ZONE-BUF.
           MOVE WO-BASIC-DATA  TO WO-BASIC-HOLD.
           MOVE "UPDATE"       TO SCREEN-NAME.
           PERFORM 614-UPDATE-CURR-LABOR THRU 614-UCL-EXIT.

       END-OF-JOB.
           MOVE WO-BASIC-HOLD  TO WO-BASIC-DATA.
           CLOSE               EQP-EQUIPMENT.
           CLOSE               WO-BASIC.
           CLOSE               CUR-LABOR-CC.
           CLOSE               CUR-LABOR-WO.
           CLOSE               WO-LABOR.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       614-UPDATE-CURR-LABOR.
           IF STAT-BUF = "IP"
               GO TO 614-ADD-NEW-REC.

           MOVE "Y"            TO OO-CW-SW.
           MOVE WO-NUMBER-WORK TO WONUM OF CUR-LABOR-WO.
           START CUR-LABOR-WO  KEY = WONUM OF CUR-LABOR-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 614-ADD-NEW-REC-CONT.

       614-LOOP-CHECK-WO.
           READ CUR-LABOR-WO   NEXT INTO LABOR-CURR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT = "00"
               NEXT SENTENCE
           ELSE
           IF FILE-STAT = "10" OR "14" OR "46"
               IF STAT-BUF = "CW" OR "LV"
                   IF EMP-FLAG = 1
                       GO TO 614-ADD-NEW-REC-CONT
                   ELSE
                       MOVE SPACES TO USER-IP-DATE USER-IP-TIME
                       MOVE "Y"    TO OO-CW-SW
                       GO TO 614-ADD-NEW-REC-CONT
               ELSE
                   GO TO 614-UCL-EXIT
           ELSE
               GO TO 614-ADD-NEW-REC-CONT.

           IF WO-NUMBER-WORK NOT = LCS-WO-NUM
               IF STAT-BUF = "CW" OR "LV"
                   IF EMP-FLAG = 1
                       GO TO 614-ADD-NEW-REC-CONT
                   ELSE
                       MOVE SPACES TO USER-IP-DATE USER-IP-TIME
                       MOVE "Y"    TO OO-CW-SW
                       GO TO 614-ADD-NEW-REC-CONT
               ELSE
                   GO TO 614-UCL-EXIT.

           IF CRAFT-BUF = EMP-NO
               MOVE 1          TO EMP-FLAG
               MOVE "N"        TO OO-CW-SW
           ELSE
           IF STAT-BUF = "CW"
               MOVE "N"        TO OO-CW-SW
           ELSE
           GO TO 614-LOOP-CHECK-WO.

           MOVE DH-MM          TO C-COMPL-MM.
           MOVE DH-DD          TO C-COMPL-DD.
           MOVE DH-YY          TO C-COMPL-YY.
           MOVE 20             TO C-COMPL-CC.
           IF DH-YY > 70
               MOVE 19         TO C-COMPL-CC.
           MOVE TIME-BUF       TO C-COMPL-TIME.

           PERFORM 6140-WRITE-LABOR-RECORDS THRU 6140-SLR-EXIT.

           DELETE              CUR-LABOR-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               STRING
               "  DELETE FAILED ON CUR-LABOR-WO  FILE-STAT = "
               FILE-STAT
               DELIMITED BY SIZE INTO ERRMSG.

           GO TO 614-LOOP-CHECK-WO.

      **************************************************************
      *    THE PARAGRAPHS 614-ADD-NEW-REC THRU 614-UCL-EXIT       **
      *    MAKE SURE THAT A CRAFTSMAN CAN ONLY BE SIGNED ONTO     **
      *    ONE WORK ORDER AT A TIME.                              **
      **************************************************************

       614-ADD-NEW-REC.
           MOVE CRAFT-BUF      TO PERCCNUM OF CUR-LABOR-CC.
           START CUR-LABOR-CC  KEY = PERCCNUM OF CUR-LABOR-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 614-ADD-NEW-REC-CONT.

       614-LOOP-CHECK-CC.
           READ CUR-LABOR-CC   NEXT INTO LABOR-CURR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 614-ADD-NEW-REC-CONT.

           IF CRAFT-BUF NOT = LCS-EMPL-NUM
               GO TO 614-ADD-NEW-REC-CONT.

           MOVE SPACES         TO ERR-MSG-A ERR-MSG-B ERR-MSG-C.
           MOVE DH-MM          TO C-COMPL-MM.
           MOVE DH-DD          TO C-COMPL-DD.
           MOVE DH-YY          TO C-COMPL-YY.
           MOVE 20             TO C-COMPL-CC.
           IF DH-YY > 70
               MOVE 19         TO C-COMPL-CC.
           MOVE TIME-BUF       TO C-COMPL-TIME.
           MOVE WO-NO-CLS      TO WO-MSG.
           MOVE WO-CC-IP-MSG   TO ERR-MSG-C.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           PERFORM 6140-WRITE-LABOR-RECORDS THRU 6140-SLR-EXIT.

           DELETE CUR-LABOR-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               STRING
               "  DELETE FAILED ON CUR-LABOR-CC  FILE-STAT = "
               FILE-STAT
               DELIMITED BY SIZE INTO ERRMSG.

           MOVE SPACES         TO T-WO-DATA T-STATUS-DATA.
           MOVE "TSUPDT  "     TO PROGRAM-NAME.
           MOVE "SUPV"         TO USER-ID.
           MOVE CRAFT-BUF      TO CLOCK-CARD.
           MOVE "LV"           TO TRANS-STATUS.
           MOVE TODAYS-DATE    TO DATE-STAMP-CN.
           ACCEPT TIME-BUFF    FROM TIME.
           MOVE TIME-HM        TO TIME-STAMP.
           MOVE WO-NO-CLS      TO WO-NUM-TRACK
           MOVE "  "           TO WO-TYPE-STATUS
           MOVE "IP"           TO WO-STATUS-TRACK.
           CALL "TWOTRACK" USING WO-TRACK-DATA.

           MOVE WO-NO-CLS      TO WONUM OF WO-BASIC.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 614-LOOP-CHECK-CC.

           READ WO-BASIC NEXT INTO WO-BASIC-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 614-LOOP-CHECK-CC.

           IF WO-NO-CLS NOT = WO-NUM
               GO TO 614-LOOP-CHECK-CC.

           MOVE SPACES         TO EQP-EQUIP-DATA.
           MOVE EQUIP-NUM      TO EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT  INTO EQP-EQUIP-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE 5          TO RIME-NO.

           MOVE SPACES         TO WO-QUEUE-DATA.
           MOVE ZONE           TO Q-ZONE.
           MOVE "1 "           TO Q-PRTY.
           MOVE WO-NUM         TO Q-WO-NUM.
           MOVE EQUIP-DOWN     TO Q-EQP-DOWN.
           MOVE "9999"         TO Q-CC-NUM.
           MOVE EQUIP-NUM      TO Q-EQUIP-NUM.
           MOVE DESCRIPTION-1  TO Q-DESCRIPTION.
           MOVE CRAFTS-REQD-1  TO Q-SKILL-1.
           MOVE CRAFTS-REQD-2  TO Q-SKILL-2.
           MOVE CRAFTS-REQD-3  TO Q-SKILL-3.
           IF PRIORITY = "1 " MOVE 9 TO QUEUE-PRTY.
           IF PRIORITY = "2 " MOVE 6 TO QUEUE-PRTY.
           IF PRIORITY = "3 " MOVE 4 TO QUEUE-PRTY.
           IF PRIORITY = "4 " MOVE 2 TO QUEUE-PRTY.
           IF PRIORITY = "5 " MOVE 1 TO QUEUE-PRTY.
           COMPUTE QUEUE-FACTOR = RIME-NO * QUEUE-PRTY.
           MOVE "A"            TO QUEUE-SW.
           CALL "TQUPDATE" USING DBPARAMETERS
                                 WO-QUEUE-DATA
                                 QUEUE-SW
                                 QUEUE-ERROR.

           GO TO 614-LOOP-CHECK-CC.

       614-ADD-NEW-REC-CONT.
           MOVE WO-NUMBER-WORK TO WO-NO-CLS.
           MOVE CRAFT-BUF      TO EMP-NO.

           IF STAT-BUF = "IP"
               MOVE DH-MM      TO C-START-MM
               MOVE DH-DD      TO C-START-DD
               MOVE DH-YY      TO C-START-YY
               MOVE 20         TO C-START-CC
               IF DH-YY > 70
                   MOVE 19     TO C-START-CC
               END-IF
               MOVE TIME-BUF   TO C-START-TIME
               MOVE SPACES     TO C-COMPL-DATE-CN C-COMPL-TIME
               WRITE CLCC-REC  FROM LABOR-CURR-DATA
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
               END-WRITE
               GO TO 614-UCL-EXIT.

           IF STAT-BUF = "LV" OR "CW"
               IF OO-CW-SW = "N"
                   GO TO 614-UCL-EXIT
               ELSE
               IF USER-IP-DATE = "      "
                   PERFORM 61400-CHECK-LAST-ENTRY THRU 61400-CLE-EXIT
                   IF WO-LABOR-DATA NOT = SPACES
                       MOVE CRAFT-BUF        TO CLK-3
                       MOVE WO-NUMBER-WORK   TO WRK-3
                       MOVE CW-NO-IP-ERROR-3 TO ERR-MSG-A
                       MOVE LBR-START-TIME   TO IP-TM
                       MOVE LBR-COMPL-TIME   TO CO-TM
                       MOVE CW-NO-IP-ERROR-4 TO ERR-MSG-B
                       MOVE CW-NO-IP-ERROR-5 TO ERR-MSG-C
                       MOVE TEMP-MM          TO I-MM
                       MOVE TEMP-DD          TO I-DD
                       MOVE TEMP-YY          TO I-YY
                       MOVE TEMP-IP-HH       TO I-HRS
                       MOVE TEMP-IP-MM       TO I-MIN
                       PERFORM 65-GET-DATA
                       IF KEY-HIT = 1 OR 8
                           GO TO 614-UCL-EXIT
                       ELSE
                       PERFORM 6141-CHECK-DATE-INPUT THRU
                               6141-CDI-EXIT
                       IF DATE-ERROR = 1
                           MOVE 0            TO DATE-ERROR
                           MOVE SPACES       TO USER-IP-DATE
                           GO TO 614-ADD-NEW-REC-CONT
                       ELSE
                       MOVE UID-MM       TO C-START-MM
                       MOVE UID-DD       TO C-START-DD
                       MOVE UID-YY       TO C-START-YY
                       MOVE 20           TO C-START-CC
                       IF UID-YY > 70
                           MOVE 19       TO C-START-CC
                       END-IF
                       MOVE USER-IP-TIME TO C-START-TIME
                       MOVE DH-MM        TO C-COMPL-MM
                       MOVE DH-DD        TO C-COMPL-DD
                       MOVE DH-YY        TO C-COMPL-YY
                       MOVE 20           TO C-COMPL-CC
                       IF DH-YY > 70
                           MOVE 19       TO C-COMPL-CC
                       END-IF
                       MOVE TIME-BUF     TO C-COMPL-TIME
                       PERFORM 6140-SAVE-LABOR-RECORDS
                           THRU 6140-SLR-EXIT
                       PERFORM 6142-CHECK-TEMPFILE-4-CC
                           THRU 6142-CT4C-EXIT
                   ELSE
                   MOVE CRAFT-BUF        TO CLK-CD
                   MOVE WO-NUMBER-WORK   TO WRK-NO
                   MOVE CW-NO-IP-ERROR-1 TO ERR-MSG-B
                   MOVE CW-NO-IP-ERROR-2 TO ERR-MSG-C
                   MOVE TEMP-MM          TO I-MM
                   MOVE TEMP-DD          TO I-DD
                   MOVE TEMP-YY          TO I-YY
                   MOVE TEMP-IP-HH       TO I-HRS
                   MOVE TEMP-IP-MM       TO I-MIN
                   PERFORM 65-GET-DATA
                   IF KEY-HIT = 1 OR 8
                       GO TO 614-UCL-EXIT
                   ELSE
                   PERFORM 6141-CHECK-DATE-INPUT THRU
                           6141-CDI-EXIT
                   IF DATE-ERROR = 1
                       MOVE 0      TO DATE-ERROR
                       MOVE SPACES TO USER-IP-DATE
                       GO TO 614-ADD-NEW-REC-CONT
                   ELSE
                   MOVE UID-MM     TO C-START-MM
                   MOVE UID-DD     TO C-START-DD
                   MOVE UID-YY     TO C-START-YY
                   MOVE 20         TO C-START-CC
                   IF UID-YY > 70
                       MOVE 19     TO C-START-CC
                   END-IF
                   MOVE USER-IP-TIME TO C-START-TIME
                   MOVE DH-MM      TO C-COMPL-MM
                   MOVE DH-DD      TO C-COMPL-DD
                   MOVE DH-YY      TO C-COMPL-YY
                   MOVE 20         TO C-COMPL-CC
                   IF DH-YY > 70
                       MOVE 19     TO C-COMPL-CC
                   END-IF
                   MOVE TIME-BUF   TO C-COMPL-TIME
                   PERFORM 6140-SAVE-LABOR-RECORDS THRU 6140-SLR-EXIT
                   PERFORM 6142-CHECK-TEMPFILE-4-CC THRU 6142-CT4C-EXIT
               ELSE
               MOVE UID-MM         TO C-START-MM
               MOVE UID-DD         TO C-START-DD
               MOVE UID-YY         TO C-START-YY
               MOVE 20             TO C-START-CC
               IF UID-YY > 70
                   MOVE 19         TO C-START-CC
               END-IF
               MOVE USER-IP-TIME   TO C-START-TIME
               MOVE DH-MM          TO C-COMPL-MM
               MOVE DH-DD          TO C-COMPL-DD
               MOVE DH-YY          TO C-COMPL-YY
               MOVE 20             TO C-COMPL-CC
               IF DH-YY > 70
                   MOVE 19         TO C-COMPL-CC
               END-IF
               MOVE TIME-BUF       TO C-COMPL-TIME
               PERFORM 6140-SAVE-LABOR-RECORDS THRU 6140-SLR-EXIT
               PERFORM 6142-CHECK-TEMPFILE-4-CC THRU 6142-CT4C-EXIT.

       614-UCL-EXIT.    EXIT.

       6141-CHECK-DATE-INPUT.
           MOVE SPACES         TO MESSAGE-BUFFER.
           IF SPACES = UID-MM OR UID-DD OR UID-YY OR USER-IP-TIME
      **********************************************************************
      **    MESSAGE 030/031:
      **  DATE STARTED REQUIRED
      **********************************************************************
               MOVE  30        TO CATREAD-MSG-SET
               MOVE  31        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 18         TO FIELD-NUMBER
               PERFORM 65-ERROR
               MOVE 1          TO DATE-ERROR
               GO TO 6141-CDI-EXIT.

           IF USER-IP-DATE IS NOT NUMERIC OR USER-IP-TIME IS NOT NUMERIC
      **********************************************************************
      **    MESSAGE 035/013:
      **  INVALID START DATE OR TIME
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  13        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 18         TO FIELD-NUMBER
               PERFORM 65-ERROR
               MOVE 1          TO DATE-ERROR
               GO TO 6141-CDI-EXIT.

           MOVE UID-YY         TO IP-COMP-YY.
           MOVE UID-MM         TO IP-COMP-MM.
           MOVE UID-DD         TO IP-COMP-DD.
           MOVE 20             TO IP-COMP-CC.
           IF UID-YY > 70
               MOVE 19         TO IP-COMP-CC.
           MOVE USER-IP-TIME   TO IP-COMP-TIME.
           ACCEPT CUR-TIME-COMPARE FROM TIME.

           IF UID-MM > "00" AND < "13"
               IF UID-DD > "00" AND < "32"
                   IF UID-YY IS NUMERIC
                       IF USER-IP-TIME > "    " AND < "2400"
                           IF USER-IP-COMPARE < DATE-TIME-RECD
      **********************************************************************
      **    MESSAGE 030/005:
      **  DATE OR TIME ENTERED LESS THAN DATE OR TIME W/O RECEIVED
      **********************************************************************
                               MOVE  30 TO CATREAD-MSG-SET
                               MOVE   5 TO CATREAD-MSG-NUM
                               PERFORM 999-CATREAD
                                          THRU 999-CATREAD-EXIT
                               MOVE 18  TO FIELD-NUMBER
                               PERFORM 65-ERROR
                               MOVE 1   TO DATE-ERROR
                               GO TO 6141-CDI-EXIT
                           ELSE
                           IF IP-COMP-DATE > TODAYS-DATE
      **********************************************************************
      **    MESSAGE 030/023:
      **  DATE IS GREATER THAN CURRENT DATE
      **********************************************************************
                               MOVE  30 TO CATREAD-MSG-SET
                               MOVE  23 TO CATREAD-MSG-NUM
                               PERFORM 999-CATREAD
                                          THRU 999-CATREAD-EXIT
                               MOVE 18  TO FIELD-NUMBER
                               PERFORM 65-ERROR
                               MOVE 1   TO DATE-ERROR
                               GO TO 6141-CDI-EXIT
                           ELSE
                           IF IP-COMP-DATE = TODAYS-DATE AND
                              IP-COMP-TIME > COMPARE-TIME
      **********************************************************************
      **    MESSAGE 046/015:
      **  TIME ENTERED GREATER THAN CURRENT TIME
      **********************************************************************
                              MOVE  46 TO CATREAD-MSG-SET
                              MOVE  21 TO CATREAD-MSG-NUM
                              PERFORM 999-CATREAD
                                          THRU 999-CATREAD-EXIT
                               MOVE 23 TO FIELD-NUMBER
                               PERFORM 65-ERROR
                               MOVE 1  TO DATE-ERROR
                               GO TO 6141-CDI-EXIT
                           ELSE
                               NEXT SENTENCE
                       ELSE
      **********************************************************************
      **    MESSAGE 035/029:
      **  INVALID TIME
      **********************************************************************
                       MOVE  35 TO CATREAD-MSG-SET
                       MOVE  29 TO CATREAD-MSG-NUM
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE 21  TO FIELD-NUMBER
                       PERFORM 65-ERROR
                       MOVE 1   TO DATE-ERROR
                       GO TO 6141-CDI-EXIT
                   ELSE
      **********************************************************************
      **    MESSAGE 035/032:
      **  INVALID YEAR
      **********************************************************************
                   MOVE  35    TO CATREAD-MSG-SET
                   MOVE  32    TO CATREAD-MSG-NUM
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE 20     TO FIELD-NUMBER
                   PERFORM 65-ERROR
                   MOVE 1      TO DATE-ERROR
                   GO TO 6141-CDI-EXIT
               ELSE
      **********************************************************************
      **    MESSAGE 035/030:
      **  INVALID DAY
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  30        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 65-ERROR
               MOVE 1          TO DATE-ERROR
               IF DATE-FLAG = 1
                   MOVE 19     TO FIELD-NUMBER
                   GO TO 6141-CDI-EXIT
               ELSE
                   MOVE 18     TO FIELD-NUMBER
                   GO TO 6141-CDI-EXIT
           ELSE
      **********************************************************************
      **    MESSAGE 035/031:
      **  INVALID MONTH
      **********************************************************************
           MOVE  35            TO CATREAD-MSG-SET
           MOVE  31            TO CATREAD-MSG-NUM
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           PERFORM 65-ERROR
           MOVE 1              TO DATE-ERROR
           IF DATE-FLAG = 1
               MOVE 18         TO FIELD-NUMBER
           ELSE
               MOVE 19         TO FIELD-NUMBER.

       6141-CDI-EXIT.    EXIT.

       6140-SAVE-LABOR-RECORDS.
           MOVE 0              TO JUL-DAY-SAVE.
           MOVE C-COMPL-DATE-CN TO GREG-DATE.
           MOVE SPACES         TO JUL-DATE D-PARM L-PARM.
           CALL "JULGREG"      USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM.
           MOVE JUL-DATE       TO JUL-DAY-COMP.
           ACCEPT TIME-BUFF    FROM TIME.

           IF C-START-TIME = SPACES
               MOVE TIME-HM    TO TIME-IN
               CALL "TGETSHFT" USING SHIFT-DATA
                                     DBPARAMETERS

               IF CURR-SHIFT = "1"
                   MOVE S-1    TO C-START-TIME
               ELSE
               IF CURR-SHIFT = "2"
                   MOVE S-2    TO C-START-TIME
               ELSE
               IF CURR-SHIFT = "3"
                   MOVE S-3    TO C-START-TIME
               ELSE
                   MOVE S-4    TO C-START-TIME.

           IF C-START-DATE-CN = SPACES OR ZEROES
               MOVE TODAYS-DATE TO GREG-DATE
               MOVE SPACES     TO JUL-DATE D-PARM L-PARM
               CALL "JULGREG"  USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM
               MOVE JUL-DATE   TO JUL-DAY-STRT
               PERFORM 6140-MIDNITE-SHIFT
               IF MIDNITE-FLAG > 0
                   MOVE J-DAY      TO JUL-SIGN
                   SUBTRACT 1      FROM JUL-SIGN
                   PERFORM UNTIL   JUL-SIGN > 0
                       ADD 365     TO JUL-SIGN
                       SUBTRACT 1  FROM J-YEAR
                   END-PERFORM
                   MOVE JUL-SIGN   TO J-DAY
                   MOVE JUL-DATE   TO JUL-DAY-STRT
                   MOVE SPACES     TO GREG-DATE
                   CALL "JULGREG"  USING
                                   GREG-DATE
                                   JUL-DATE
                                   D-PARM
                                   L-PARM
                   MOVE GREG-DATE  TO C-START-DATE-CN
               ELSE
                   MOVE TODAYS-DATE TO C-START-DATE-CN
           ELSE
               MOVE C-START-DATE-CN TO GREG-DATE
               MOVE SPACES     TO JUL-DATE D-PARM L-PARM
               CALL "JULGREG"  USING
                               GREG-DATE
                               JUL-DATE
                               D-PARM
                               L-PARM
               MOVE JUL-DATE   TO JUL-DAY-STRT.

           IF JUL-DAY-COMP < JUL-DAY-STRT
               MOVE JUL-DAY-STRT TO JUL-DAY-COMP
               MOVE C-START-DATE-CN TO C-COMPL-DATE-CN
               IF C-COMPL-TIME < C-START-TIME
                   IF CURR-SHIFT = MIDNITE-FLAG
                       IF C-COMPL-TIME > "0000" AND < END-FLAG
                           IF C-START-TIME > START-FLAG AND < "2360"
                               MOVE JUL-DAY-COMP TO JUL-DATE
                               MOVE J-DAY        TO JUL-SIGN
                               ADD 1             TO JUL-SIGN
                               PERFORM UNTIL     JUL-SIGN < 366
                                   SUBTRACT 365  FROM JUL-SIGN
                                   ADD 1         TO   J-YEAR
                               END-PERFORM
                               MOVE JUL-SIGN     TO J-DAY
                               MOVE JUL-DATE     TO JUL-DAY-COMP
                               MOVE SPACES       TO GREG-DATE
                               CALL "JULGREG"    USING
                                                 GREG-DATE
                                                 JUL-DATE
                                                 D-PARM
                                                 L-PARM
                               MOVE GREG-DATE    TO C-COMPL-DATE-CN
                           ELSE
                           MOVE TIME-HM TO C-COMPL-TIME
                       ELSE
                       NEXT SENTENCE
                   ELSE
                   NEXT SENTENCE
               ELSE
               NEXT SENTENCE
           ELSE
           NEXT SENTENCE.

           IF C-COMPL-HH NOT LESS THAN 24
               SUBTRACT 24 FROM C-COMPL-HH.
           IF C-COMPL-MI GREATER THAN 59
               SUBTRACT 60 FROM C-COMPL-MI.

       6140-WRITE-LABOR-RECORDS.
           MOVE ZONE-BUF       TO ZONE-LINK.
           CALL "TLABUPDT" USING DBPARAMETERS
                                 LABOR-CURR-DATA
                                 ZONE-LINK.

       6140-SLR-EXIT.    EXIT.

       6140-MIDNITE-SHIFT.
           MOVE 0              TO MIDNITE-FLAG.
           IF CURR-SHIFT = 1
               IF S-1 > E-1
                   MOVE 1      TO MIDNITE-FLAG
                   MOVE S-1    TO START-FLAG
                   MOVE E-1    TO END-FLAG
               ELSE NEXT SENTENCE
           ELSE
           IF CURR-SHIFT = 2
               IF S-2 > E-2
                   MOVE 2      TO MIDNITE-FLAG
                   MOVE S-2    TO START-FLAG
                   MOVE E-2    TO END-FLAG
               ELSE NEXT SENTENCE
           ELSE
           IF CURR-SHIFT = 3
               IF S-3 > E-3
                   MOVE 3      TO MIDNITE-FLAG
                   MOVE S-3    TO START-FLAG
                   MOVE E-3    TO END-FLAG
               ELSE NEXT SENTENCE
           ELSE
               IF S-4 > E-4
                   MOVE S-4    TO START-FLAG
                   MOVE E-4    TO END-FLAG
                   MOVE 4      TO MIDNITE-FLAG.

       61400-CHECK-LAST-ENTRY.
           MOVE DH-YY          TO DATE-BUF-Y.
           MOVE DH-MM          TO DATE-BUF-M.
           MOVE DH-DD          TO DATE-BUF-D.
           MOVE 20             TO DATE-BUF-C.
           IF DH-YY > 70
               MOVE 19         TO DATE-BUF-C.

           MOVE CRAFT-BUF      TO LBRCCNUM OF WO-LABOR.
           START WO-LABOR      KEY = LBRCCNUM OF WO-LABOR
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO WO-LABOR-DATA
               GO TO 61400-CLE-EXIT.

       61400-CLE-CONT.
           READ WO-LABOR NEXT INTO WO-LABOR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               MOVE SPACES     TO WO-LABOR-DATA
               GO TO 61400-CLE-EXIT.

           IF CRAFT-BUF NOT = LBR-EMPL-NUM
               GO TO 61400-CLE-EXIT.

           IF LBR-WO-NUM NOT = WO-NUM-BUF
               GO TO 61400-CLE-CONT.

           IF LBR-COMPL-DATE-CN NOT = DATE-BUF-CYMD
               GO TO 61400-CLE-CONT.

       61400-CLE-EXIT.    EXIT.

       6142-CHECK-TEMPFILE-4-CC.
           MOVE LABOR-CURR-DATA TO LABOR-CURR-DATA-2.
           MOVE CRAFT-BUF      TO PERCCNUM OF CUR-LABOR-CC.
           START CUR-LABOR-CC  KEY = PERCCNUM OF CUR-LABOR-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 6142-CT4C-EXIT.

       6142-CT4C-CONT.
           READ CUR-LABOR-CC NEXT INTO LABOR-CURR-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 6142-CT4C-EXIT.

           IF CRAFT-BUF NOT = LCS-EMPL-NUM
               GO TO 6142-CT4C-EXIT.

           MOVE C-START-DATE-2 TO C-COMPL-DATE-CN.
           MOVE C-START-TIME-2 TO C-COMPL-TIME.
           MOVE WO-NO-CLS      TO WO-MSG.
           MOVE WO-CC-IP-MSG   TO MESSAGE-BUFFER.

           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           PERFORM 6140-SAVE-LABOR-RECORDS THRU 6140-SLR-EXIT.
           DELETE CUR-LABOR-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               STRING
               "  DELETE FAILED ON CUR-LABOR-CC  FILE-STAT = "
               FILE-STAT
               DELIMITED BY SIZE INTO ERRMSG.

           MOVE WO-NO-CLS      TO WONUM OF WO-BASIC.
           START WO-BASIC      KEY = WONUM OF WO-BASIC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 6142-CT4C-EXIT.

           READ WO-BASIC NEXT INTO WO-BASIC-DATA
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = "00"
               GO TO 6142-CT4C-EXIT.

           IF WO-NO-CLS NOT = WO-NUM
               GO TO 6142-CT4C-EXIT.

           MOVE EQUIP-NUM      TO EQPNUM OF EQP-EQUIPMENT.
           READ EQP-EQUIPMENT INTO EQP-EQUIP-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.

           MOVE SPACES         TO WO-QUEUE-DATA.
           MOVE ZONE           TO Q-ZONE.
           MOVE "1 "           TO Q-PRTY.
           MOVE WO-NUM         TO Q-WO-NUM.
           MOVE EQUIP-DOWN     TO Q-EQP-DOWN.
           MOVE "9999"         TO Q-CC-NUM.
           MOVE EQUIP-NUM      TO Q-EQUIP-NUM.
           MOVE DESCRIPTION-1  TO Q-DESCRIPTION.
           MOVE CRAFTS-REQD-1  TO Q-SKILL-1.
           MOVE CRAFTS-REQD-2  TO Q-SKILL-2.
           MOVE CRAFTS-REQD-3  TO Q-SKILL-3.
           IF PRIORITY = "1 " MOVE 9 TO QUEUE-PRTY.
           IF PRIORITY = "2 " MOVE 6 TO QUEUE-PRTY.
           IF PRIORITY = "3 " MOVE 4 TO QUEUE-PRTY.
           IF PRIORITY = "4 " MOVE 2 TO QUEUE-PRTY.
           IF PRIORITY = "5 " MOVE 1 TO QUEUE-PRTY.
           COMPUTE QUEUE-FACTOR = RIME-NO * QUEUE-PRTY.
           MOVE "A"            TO QUEUE-SW.
           CALL "TQUPDATE" USING DBPARAMETERS
                                 WO-QUEUE-DATA
                                 QUEUE-SW
                                 QUEUE-ERROR.

       6142-CT4C-EXIT.    EXIT.

       65-GET-DATA.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE TRUE-VAL       TO IND(30).
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO END-OF-JOB.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           MOVE I-MM           TO UID-MM TEMP-MM.
           MOVE I-DD           TO UID-DD TEMP-DD.
           MOVE I-YY           TO UID-YY TEMP-YY.
           IF DATE-FLAG = 3
               MOVE I-MM       TO UID-DD TEMP-DD
               MOVE I-DD       TO UID-MM TEMP-MM.

           MOVE I-HRS          TO UID-HRS TEMP-IP-HH.
           MOVE I-MIN          TO UID-MIN TEMP-IP-MM.

       65-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

