       IDENTIFICATION DIVISION.
       PROGRAM-ID.     TTAXFILE.
       AUTHOR.         CA YODER.
       DATE-WRITTEN.   JANUARY 2001.
      *REMARKS.
      *
      **************************************************************
      *                                                            *
      *   TTAXFILE   THIS PROGRAM CREATES A FILE CONTAINING        *
      *   --------   INVOICE INFORMATION FOR PURCHASE ORDERS IN    *
      *              A SPECIFIED DATE RANGE.                       *
      *                                                            *
      **************************************************************
      *C
      *C   07/24/2001   CA YODER    UNC REQUEST
      *C     ADDED MANIFEST NUMBER, MANIFEST YEAR, PO NUM, AND
      *C     CHECK DATE TO TAXFILE.
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INV-PAY-REPORT    ASSIGN TO  DISK-TAXRPT.
           SELECT TAXFILE-FILE      ASSIGN TO DISK-TAXFILE.
           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVRCD-I
                  ASSIGN TO DATABASE-MCFLCS2501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DPOFREIGHT-I
                  ASSIGN TO DATABASE-MCFLCS2404
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVITM-I
                  ASSIGN TO DATABASE-MCFLCS2601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DINVACCT-I
                  ASSIGN TO DATABASE-MCFLCS2701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.
           SELECT DVENDOR-I
                  ASSIGN TO DATABASE-MCFLCS0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVRCDH-I
                  ASSIGN TO DATABASE-MCFLST0805
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVITMH-I
                  ASSIGN TO DATABASE-MCFLST0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT DINVACCTH-I
                  ASSIGN TO DATABASE-MCFLST1001
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  INV-PAY-REPORT
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS INV-PAY-REPORT-RCD.
       01  INV-PAY-REPORT-RCD.
           05  INV-PAY-CTL           PIC 9.
           05  INV-PAY-REPORT-LINE   PIC X(132).

       FD  TAXFILE-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 342 CHARACTERS.
       01  TAXFILE-RCD               PIC X(342).

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-MCRPCS0500   OF MCFLCS0501.

       FD  DINVRCD-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCD-REC-I.
           COPY DDS-MCRPCS2500   OF MCFLCS2501.

       FD  DPOFREIGHT-I
           LABEL RECORDS ARE STANDARD.
       01  DPOFREIGHT-REC-I.
           COPY DDS-MCRPCS2400   OF MCFLCS2404.

       FD  DINVITM-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITM-REC-I.
           COPY DDS-MCRPCS2600   OF MCFLCS2601.

       FD  DINVACCT-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCT-REC-I.
           COPY DDS-MCRPCS2700   OF MCFLCS2701.

       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700   OF MCFLCS0701.

       FD  DINVRCDH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVRCDH-REC-I.
           COPY DDS-MCRPST0800   OF MCFLST0805.

       FD  DINVITMH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVITMH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST0901.

       FD  DINVACCTH-I
           LABEL RECORDS ARE STANDARD.
       01  DINVACCTH-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLST1001.

       WORKING-STORAGE SECTION.
       77  PAGE-CTR                 PIC S9(4) COMP-4 VALUE ZEROS.
       77  LINE-CTR                 PIC S9(4) COMP-4 VALUE ZEROS.
       77  FRT-CTR                  PIC S9(4) COMP-4 VALUE ZEROS.
       77  SUB                      PIC 99  COMP-4 VALUE ZEROS.
       77  CALC-INV-AMT             PIC S9(11)V99 COMP-4 VALUE ZEROS.
       77  CALC-PO-EXT              PIC S9(11)V99 COMP-4 VALUE ZEROS.
       77  CALC-INV-EXT             PIC S9(11)V99 COMP-4 VALUE ZEROS.
       77  TOTAL-ACCRUED-TAX        PIC S9(11)V99 COMP-4 VALUE ZEROS.
       77  INV-ENTRY-CTR            PIC S9(4)  COMP-4 VALUE ZEROS.
       77  SKIP-INVOICE-SW          PIC X(1)   VALUE "N".
       77  HOLD-PLT                 PIC X(3).
9406CK 01  SCOPE   PIC X.

       01  TOTAL-ACCUMULATORS.
           05  TOT-INV-TAX-I        PIC S9(10)V99.
           05  TOT-ACCRUED-TAX-I    PIC S9(10)V99.
           05  TOT-INV-FRT-I        PIC S9(10)V99.
           05  TOT-INV-CONT-I       PIC S9(10)V99.
           05  TOT-INV-INS-I        PIC S9(10)V99.
           05  TOT-COL-FRT-I        PIC S9(10)V99.

       01  FORMAT-DATE.
           05  FORMAT-CC            PIC 9(2).
           05  FORMAT-YY            PIC 9(2).
           05  FILLER               PIC 9(4).
       01  FORMAT-DATE-9    REDEFINES   FORMAT-DATE
                                    PIC 9(8).
       01  DISPLAY-DATE             PIC 9(6).

      **************************************
      *   SWITCHES                         *
      **************************************

       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X        VALUE SPACES.
           05  FILE-STATUS-2           PIC X        VALUE SPACES.

       01  SWITCH-AREA.
           05  EOF-SW                  PIC X        VALUE SPACES.
           05  EOF-DINVRCD             PIC X        VALUE "N".
           05  EOF-DINVRCDH            PIC X        VALUE "N".

       01  REPORT-TYPE                      PIC X   VALUE SPACES.
           88  INV-PAY-REPORT-TYPE                  VALUE "1".


      **************************************************************
      *   DATABASE I/O BUFFER AREA                                 *
      **************************************************************

       COPY DFREIGHT   IN COPYLIB.

       COPY DINVRCD    IN COPYLIB.

       COPY MPLT0      IN COPYLIB.
       COPY MPLTP01    IN COPYLIB.

       COPY DINVITM    IN COPYLIB.

       COPY DINVACCT   IN COPYLIB.

       COPY DINVRCDH   IN COPYLIB.

       COPY DINVITMH   IN COPYLIB.

       COPY DINVACTH   IN COPYLIB.

       COPY DVENDOR    IN COPYLIB.

       COPY DATAB      IN COPYLIB.

       COPY TAXFILE    IN COPYLIB.

       01  ARG-VALUES.
           05  PLT-ARG                PIC X(4)  VALUE SPACES.
           05  REGISTER-ARG           PIC X(6)  VALUE SPACES.
           05  VEN-ARG                PIC X(10) VALUE SPACES.


      *****************************************************
      *   R E P O R T    H E A D E R S  &  D E T A I L S  *
      *****************************************************


       01  PAGE-HDR-1.
           05  FILLER            PIC X(6)  VALUE " PAGE ".
           05  PAGE-NO-OUT       PIC ZZZ9  VALUE ZEROS.
           05  FILLER            PIC X(15) VALUE SPACES.
           05  RPT-HEADER        PIC X(44) VALUE SPACES.
           05  FILLER            PIC X     VALUE SPACES.
           05  PRT-CO            PIC X(3)  VALUE SPACES.
           05  FILLER            PIC X(10) VALUE SPACES.
           05  PRT-DATE          PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(5)  VALUE SPACES.
           05  PRT-TIME          PIC X(8)  VALUE SPACES.
           05  FILLER            PIC X(15) VALUE SPACES.
           05  FILLER            PIC X(8)  VALUE "TTAXFILE".
           05  FILLER            PIC X(2)  VALUE SPACES.


       01  PAGE-HDR-2.
           05  FILLER  PIC X(14)  VALUE SPACES.
           05  FILLER  PIC X(12)  VALUE "DATE RANGE: ".
           05  FROM-MM-OUT        PIC X(2).
           05  FILLER             PIC X     VALUE "/".
           05  FROM-DD-OUT        PIC X(2).
           05  FILLER             PIC X     VALUE "/".
           05  FROM-YYYY-OUT      PIC X(4).
           05  FILLER             PIC X(5)  VALUE " TO: ".
           05  TO-MM-OUT          PIC X(2).
           05  FILLER             PIC X     VALUE "/".
           05  TO-DD-OUT          PIC X(2).
           05  FILLER             PIC X     VALUE "/".
           05  TO-YYYY-OUT        PIC X(4).

       01  INV-HEADER-1.
           05  FILLER  PIC X(11) VALUE "REGISTER   ".
           05  FILLER  PIC X(17) VALUE "INVOICE NUMBER   ".
           05  FILLER  PIC X(15) VALUE "INVOICE DATE   ".
           05  FILLER  PIC X(13) VALUE "ENTRY DATE   ".
           05  FILLER  PIC X(19) VALUE "DUE DATE   TERMS   ".
           05  FILLER  PIC X(13)  VALUE "PO NUMBER    ".
           05  FILLER  PIC X(19)  VALUE "EMPLOYEE ADD/CHANGE".

       01  INV-DETAIL-1.
           05  FILLER  PIC X(1)  VALUE SPACES.
           05  REG-NO-OUT  PIC X(5)  VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  INV-NO-OUT  PIC X(14)  VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  INV-DATE-OUT  PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE SPACES.
           05  ENTRY-DATE-OUT  PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  DUE-DATE-OUT  PIC X(8)  VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  INV-TERMS-OUT  PIC XX  VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  PO-NO-OUT  PIC X(10)  VALUE SPACES.
           05  FILLER  PIC X(9)  VALUE SPACES.
           05  ADD-EMP-OUT  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X     VALUE "/".
           05  MOD-EMP-OUT  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(14) VALUE SPACES.

       01  INV-HEADER-1B.
           05  FILLER  PIC X(11) VALUE "VENDOR     ".
           05  FILLER  PIC X(11) VALUE "VENDOR NAME".
           05  FILLER  PIC X(34)  VALUE SPACES.
           05  FILLER  PIC X(19)  VALUE "NO CHECK INDIC (IT)".
           05  FILLER  PIC X(54) VALUE SPACES.

       01  INV-DETAIL-1B.
           05  VEN-CODE-OUT  PIC X(7)  VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  VEN-NAME-OUT  PIC X(44) VALUE SPACES.
           05  FILLER  PIC X(7)  VALUE SPACES.
           05  NO-CHECK-INDIC-OUT  PIC X  VALUE SPACES.
           05  FILLER  PIC X(66) VALUE SPACES.

       01  INV-DETAIL-2.
           05  FILLER  PIC X(12) VALUE "PO MATL EXT ".
           05  PO-EXT-OUT PIC Z(10)9.9999CR  VALUE ZEROS.
           05  FILLER  PIC X(15) VALUE " INV FREIGHT   ".
           05  FRT-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(4)  VALUE " CE ".
           05  CE-OUT  PIC X  VALUE SPACES.
           05  FILLER  PIC X   VALUE SPACES.
           05  CE-ACCTG-OUT  PIC X(9)  VALUE SPACES.
           05  FILLER  PIC X(6) VALUE SPACES.
           05  CE-AMT-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(18) VALUE " NET DUE VENDOR   ".
           05  NET-DUE-VEN-OUT  PIC Z(10)9.99CR.

       01  INV-DETAIL-3.
           05  FILLER  PIC X(12) VALUE "INV MATL EXT".
           05  INV-EXT-OUT PIC Z(10)9.9999CR  VALUE ZEROS.
           05  FILLER  PIC X(15) VALUE " INV TAX       ".
           05  TAX-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(21) VALUE " CE 3 (FREIGHT)      ".
           05  CE3-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(18)  VALUE " COLLECT FREIGHT  ".
           05  COLLECT-FRT-OUT  PIC Z(10)9.99CR VALUE ZEROS.

       01  INV-DETAIL-4.
           05  FILLER  PIC X(31)  VALUE SPACES.
           05  FILLER  PIC X(14)  VALUE "INV CONTAINERS".
           05  CONT-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(21)  VALUE " CE 4 (INSURANCE)    ".
           05  CE4-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(18)  VALUE " ACCRUED TAX     ".
           05  ACCRUED-TAX-OUT  PIC Z(10)9.99CR  VALUE ZEROS.

       01  INV-DETAIL-5.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(18) VALUE "PAYMENT INDICATOR ".
           05  PAY-IND-OUT  PIC X  VALUE SPACES.
           05  FILLER  PIC X(8) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "INV INSURANCE ".
           05  INSURANCE-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(21) VALUE " CE 5 (TAX)          ".
           05  CE5-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(18) VALUE " OTHER ADJUST     ".
           05  OTHER-ADJ-OUT PIC Z(10)9.99CR VALUE ZEROS.

       01  INV-DETAIL-6.
           05  FILLER  PIC X(31) VALUE SPACES.
           05  FILLER  PIC X(14)  VALUE "INV OTHER     ".
           05  OTHER-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(21) VALUE " CE 6 (EXTEN. ERROR) ".
           05  CE6-OUT  PIC Z(10)9.99CR  VALUE ZEROS.
           05  FILLER  PIC X(34) VALUE SPACES.

       01  INV-DETAIL-7.
           05  FILLER  PIC X(31) VALUE SPACES.
           05  FILLER  PIC X(14) VALUE "CALC. INV AMT.".
           05  CALC-AMT-OUT PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(21) VALUE " CE 7 (PRICE ERROR)  ".
           05  CE7-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(18) VALUE " COST DISTRIBUTED".
           05  COST-DIST-OUT  PIC Z(10)9.99CR VALUE ZEROS.

       01  INV-DETAIL-8.
           05  FILLER  PIC X(62) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE "CE 8 (OTHER)        ".
           05  CE8-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(34) VALUE SPACES.

       01  INV-DETAIL-9.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  FILLER  PIC X(9)  VALUE "TAX CODE ".
           05  TAX-CODE-OUT PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X(47) VALUE SPACES.
           05  FILLER  PIC X(20) VALUE "CE 9 (CASH DISCOUNT)".
           05  CE9-OUT PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(34) VALUE SPACES.

       01  INV-DETAIL-9B.
           05  FILLER  PIC X(62) VALUE SPACES.
           05  FILLER  PIC X(3)  VALUE "CE ".
           05  EXTRA-CE-OUT  PIC X VALUE SPACES.
           05  FILLER  PIC X     VALUE SPACES.
           05  EXTRA-CE-ACCTG  PIC X(9) VALUE SPACES.
           05  FILLER  PIC X(6)  VALUE SPACES.
           05  EXTRA-CE-AMT-OUT  PIC Z(10)9.99CR VALUE ZEROS.
           05  FILLER  PIC X(34) VALUE SPACES.

       01  INV-DETAIL-10.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(19) VALUE "COLLECT FREIGHT    ".
           05  FILLER  PIC X(20) VALUE "PRO NUMBER          ".
           05  FILLER  PIC X(11) VALUE "CARRIER    ".
           05  FILLER  PIC X(14) VALUE "FREIGHT CHARGE".
           05  FILLER  PIC X(48) VALUE SPACES.

       01  INV-DETAIL-11.
           05  FILLER  PIC X(39) VALUE SPACES.
           05  PRO-NO-OUT  PIC X(16) VALUE SPACES.
           05  FILLER  PIC X(6) VALUE SPACES.
           05  CARRIER-OUT PIC X(4) VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE SPACES.
           05  FRT-CHRG-OUT PIC Z(10)9.99 VALUE ZEROS.
           05  FILLER  PIC X(48) VALUE SPACES.

       01  INV-DETAIL-12.
           05  FILLER  PIC X(10) VALUE SPACES.
           05  FILLER  PIC X(15) VALUE "ITEM  CORP CODE".
           05  FILLER  PIC X(18) VALUE SPACES.
           05  FILLER  PIC X(13) VALUE "QUANTITY PAID".
           05  FILLER  PIC X(11)  VALUE SPACES.
           05  FILLER  PIC X(21) VALUE "PRICE    UM     ITEM ".
           05  FILLER  PIC X(13) VALUE "EXTENSION    ".
           05  FILLER  PIC X(15) VALUE "ACCOUNTING DATA".
           05  FILLER  PIC X(14)  VALUE "      TAX CODE".
           05  FILLER  PIC X(8)  VALUE SPACES.

       01  INV-DETAIL-13.
           05  FILLER  PIC X(10) VALUE SPACES.
           05  ITEM-OUT PIC ZZZ9 VALUE ZEROS.
           05  FILLER  PIC X(3) VALUE SPACES.
           05  CORP-CODE-OUT PIC X(7) VALUE SPACES.
           05  FILLER  PIC X(19) VALUE "   PO              ".
           05  PO-QTY-PAID-OUT PIC Z(7)9.9999 VALUE ZEROS.
           05  FILLER  PIC X(2) VALUE SPACES.
           05  PO-PRICE-OUT PIC -(11)9.9999 VALUE ZEROS.
           05  FILLER  PIC X  VALUE SPACES.
           05  PO-UM-OUT PIC X(2) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE SPACES.
           05  PO-ITEM-EXT-OUT PIC Z(10)9.9999CR VALUE ZEROS.
           05  FILLER  PIC X(3) VALUE SPACES.
           05  ACCT-DATA1-OUT.
               10  PRIME1-OUT PIC X(3) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  SUB1-OUT PIC X(3) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  SUBD1-OUT PIC X(4) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  ADDL1-OUT PIC X(6) VALUE SPACES.
           05  FILLER  PIC X(4)  VALUE SPACES.
           05  ITM-TAX-CODE-OUT  PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X(6) VALUE SPACES.

       01  INV-DETAIL-14.
           05  FILLER  PIC X(27) VALUE SPACES.
           05  FILLER  PIC X(5)  VALUE "INV  ".
           05  MEMO-IND-OUT PIC X(9) VALUE SPACES.
           05  FILLER  PIC X(2)  VALUE SPACES.
           05  INV-QTY-PAID-OUT PIC Z(7)9.9999 VALUE ZEROS.
           05  FILLER  PIC X(2) VALUE SPACES.
           05  INV-PRICE-OUT PIC -(11)9.9999 VALUE ZEROS.
           05  FILLER  PIC X    VALUE SPACES.
           05  INV-UM-OUT PIC X(2)  VALUE SPACES.
           05  FILLER  PIC X(2) VALUE SPACES.
           05  INV-ITEM-EXT-OUT PIC Z(10)9.9999CR VALUE ZEROS.
           05  FILLER PIC X(3) VALUE SPACES.
           05  ACCT-DATA2-OUT.
               10  PRIME2-OUT PIC X(3) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  SUB2-OUT PIC X(3) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  SUBD2-OUT PIC X(4) VALUE SPACES.
               10  FILLER  PIC X  VALUE SPACES.
               10  ADDL2-OUT PIC X(6) VALUE SPACES.
           05  FILLER  PIC X(12) VALUE SPACES.

       01  INV-DETAIL-15.
           05  FILLER  PIC X(95) VALUE SPACES.
           05  PRIME3-OUT PIC X(3) VALUE SPACES.
           05  FILLER  PIC X  VALUE SPACES.
           05  SUB3-OUT PIC X(3) VALUE SPACES.
           05  FILLER  PIC X  VALUE SPACES.
           05  SUBD3-OUT PIC X(4) VALUE SPACES.
           05  FILLER  PIC X  VALUE SPACES.
           05  ADDL3-OUT PIC X(6) VALUE SPACES.
           05  FILLER  PIC X(18) VALUE SPACES.


       01  INV-PAID-HEADER.
           05  FILLER  PIC X(18)  VALUE " INVOICES WRITTEN ".
           05  FILLER  PIC X(18)  VALUE "TO TAX AUDIT FILE".

       01  DASH-LINE.
           05  FILLER  PIC X(132) VALUE ALL "-".

       01  ASTERISK-LINE.
           05  FILLER  PIC X(132) VALUE ALL "*".

       01  SAVE-REPORT-LINE  PIC X(132)  VALUE SPACES.

       01  NO-ITEMS-MSG.
           05  FILLER  PIC X(14) VALUE SPACES.
           05  FILLER  PIC X(16) VALUE "** NO ITEMS WERE".
           05  FILLER  PIC X(15) VALUE " FOUND ON THIS ".
           05  FILLER  PIC X(10) VALUE "INVOICE **".
           05  FILLER  PIC X(77) VALUE SPACES.

       01  NO-INVOICE-MSG.
           05  FILLER  PIC X(20) VALUE SPACES.
           05  FILLER  PIC X(10) VALUE ALL "*".
           05  FILLER  PIC X(22) VALUE "  NO INVOICES IN THIS ".
           05  FILLER  PIC X(19) VALUE "MANIFEST QUALIFIED ".
           05  FILLER  PIC X(17) VALUE "FOR THIS REPORT  ".
           05  FILLER  PIC X(10) VALUE ALL "*".

       01  TOTAL-HEADING.
           05  FILLER  PIC X(53) VALUE SPACES.
           05  FILLER  PIC X(25) VALUE
               "***** REPORT TOTALS *****".
           05  FILLER  PIC X(54) VALUE SPACES.

       01  TOTAL-LINE.
           05  FILLER                PIC X(48) VALUE SPACES.
           05  TOT-LITERAL           PIC X(15).
           05  FILLER                PIC X(6)  VALUE SPACES.
           05  TOT-AMT-OUT           PIC Z(9)9.99.
           05  FILLER                PIC X(50) VALUE SPACES.

      **************************************************
      **                DATE AREAS                    **
      **************************************************

       COPY TDATECHK IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

       COPY VIEWDUM  IN COPYLIB.

       COPY CCHKOBJ  IN COPYLIB.

       COPY CCRTFILE IN COPYLIB.

       COPY CDESC    IN COPYLIB.

       LINKAGE SECTION.
       01  DATA-LINE.
           05  FROM-DATE.
               10  FROM-YYYY   PIC X(4).
               10  FROM-MM     PIC X(2).
               10  FROM-DD     PIC X(2).
           05  FROM-DATE-9    REDEFINES   FROM-DATE
                               PIC 9(8).
           05  TO-DATE.
               10  TO-YYYY     PIC X(4).
               10  TO-MM       PIC X(2).
               10  TO-DD       PIC X(2).
           05  TO-DATE-9      REDEFINES   TO-DATE
                               PIC 9(8).

       PROCEDURE DIVISION   USING DATA-LINE.

       1-BEGIN.
           PERFORM 1-HSK.

           PERFORM 6-MAIN THRU 6-M-X.

           PERFORM 2-EOJ.

           GOBACK.

       1-HSK.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

           OPEN INPUT MPLTINFO-I, DPOFREIGHT-I, DINVRCD-I,
                      DINVITM-I, DINVACCT-I, DVENDOR-I,
                      DINVRCDH-I, DINVITMH-I, DINVACCTH-I
                OUTPUT  TAXFILE-FILE.

           INITIALIZE BUF-TTAXFILE.

           DISPLAY "**** INVOICE INFORMATION FROM:".
           DISPLAY "          " FROM-DATE.
           DISPLAY "**** TO:"
           DISPLAY "          " TO-DATE.
           DISPLAY "******************************".
           MOVE FROM-MM   TO FROM-MM-OUT.
           MOVE FROM-YYYY TO FROM-YYYY-OUT.
           MOVE FROM-DD   TO FROM-DD-OUT.
           MOVE TO-MM     TO TO-MM-OUT.
           MOVE TO-YYYY   TO TO-YYYY-OUT.
           MOVE TO-DD     TO TO-DD-OUT.

      **************************************************
      *                                                *
      *   GET CO. AND PRIME FROM MPLTINFO              *
      *   USING 'P 01' AS THE ARGUMENT                 *
      *                                                *
      **************************************************

           MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO  PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = ZERO
               MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
               MOVE PLT-ARG                   TO  BU-DISPLAY-FLD (1)
               GO TO 2-BLOWUP.
           MOVE MPLTINFO-COMPANY     TO  PRT-CO
                                         HOLD-PLT.
           MOVE 1                    TO  DATE-MODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT       TO  PRT-DATE.
           MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TIME.

           INITIALIZE TOTAL-ACCUMULATORS.


       2-EOJ.
           CLOSE MPLTINFO-I, DPOFREIGHT-I, DINVRCD-I,
                 DINVITM-I, DINVACCT-I, DVENDOR-I,
                 DINVRCDH-I, DINVITMH-I, DINVACCTH-I,
                 TAXFILE-FILE.

       2-BLOWUP.
           MOVE "TTAXFILE"              TO  BU-PGM-NAME.
           MOVE REGISTER-ARG            TO  BU-DISPLAY-FLD (1).
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                       BU-DISPLAY-FLDS.

       5-WRITE-INVPAY-REPORT-LINE.
           IF LINE-CTR > 54
               PERFORM 5-WRITE-INVPAY-REPORT-HEADER.
           ADD INV-PAY-CTL  TO  LINE-CTR.
           WRITE INV-PAY-REPORT-RCD.

       5-WRITE-TAXFILE-RCD.
           MOVE HOLD-PLT TO TAX-PLT.
           WRITE TAXFILE-RCD FROM BUF-TTAXFILE.

       5-WRITE-INVPAY-TOTALS.
           PERFORM 5-WRITE-INVPAY-REPORT-HEADER.
           MOVE 2                        TO  INV-PAY-CTL.
           MOVE TOTAL-HEADING            TO  INV-PAY-REPORT-LINE.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "INV FREIGHT    "        TO  TOT-LITERAL.
           MOVE TOT-INV-FRT-I            TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "INV TAX        "        TO  TOT-LITERAL.
           MOVE TOT-INV-TAX-I            TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "INV CONTAINERS "        TO  TOT-LITERAL.
           MOVE TOT-INV-CONT-I           TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "INV INSURANCE  "        TO  TOT-LITERAL.
           MOVE TOT-INV-INS-I            TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "COLLECT FREIGHT"        TO  TOT-LITERAL.
           MOVE TOT-COL-FRT-I            TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE "ACCRUED TAX    "        TO  TOT-LITERAL.
           MOVE TOT-ACCRUED-TAX-I        TO  TOT-AMT-OUT.
           MOVE TOTAL-LINE               TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.

       5-WRITE-INVPAY-REPORT-HEADER.
           MOVE INV-PAY-REPORT-LINE       TO  SAVE-REPORT-LINE.
           MOVE ZERO                     TO  INV-PAY-CTL,
                                             LINE-CTR.
           ADD 1                         TO  PAGE-CTR.
           MOVE PAGE-CTR                 TO  PAGE-NO-OUT.
           MOVE PAGE-HDR-1               TO  INV-PAY-REPORT-LINE.
           WRITE INV-PAY-REPORT-RCD.
           MOVE PAGE-HDR-2                TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE DASH-LINE                TO  INV-PAY-REPORT-LINE.
           MOVE 1                        TO  INV-PAY-CTL.
           WRITE INV-PAY-REPORT-RCD.
           MOVE SAVE-REPORT-LINE         TO  INV-PAY-REPORT-LINE.
           MOVE 2                        TO  INV-PAY-CTL.

      **************************************************
      *     6 - M A I N                                *
      **************************************************

       6-MAIN.
           OPEN OUTPUT INV-PAY-REPORT.
           PERFORM 61-GET-LIVE-INVOICES  THRU  61-GLI-X.
           PERFORM 62-GET-HIST-INVOICES  THRU  62-GHI-X.
           CLOSE INV-PAY-REPORT.

       6-M-X.
           EXIT.

       61-GET-LIVE-INVOICES.
           MOVE 1                   TO  REPORT-TYPE.
           MOVE INV-PAID-HEADER     TO  RPT-HEADER.
           PERFORM 5-WRITE-INVPAY-REPORT-HEADER.
           MOVE ZEROS               TO  INV-ENTRY-CTR.
           PERFORM 9999-START-DINVRCD-I.

       61-READ-INVOICES.
      **** READ REG-FILE
      ****     AT END  GO TO 61-REPORT-FINISH.
           PERFORM 9999-READ-NEXT-DINVRCD-I.
           IF EOF-DINVRCD = "Y"
               GO TO 61-REPORT-FINISH.
           MOVE INV-REG-NO          TO  REGISTER-ARG.
      **** MOVE REGISTER-NO         TO  REGISTER-ARG.
      **** PERFORM 65-GET-DINVRCD  THRU  65-GD-X.
      *-------- ONLY GET INVOICES THAT HAVE BEEN PAID.
           IF INV-STATUS NOT = "2"
               GO TO 61-READ-INVOICES.

      *-------- MAKE SURE INVOICE WITHIN DATE RANGE.
           IF INV-DATE-CN < FROM-DATE OR INV-DATE-CN > TO-DATE
               GO TO 61-READ-INVOICES.

      **** IF INV-PAYMENT-IND  =  "I"
      ****     NEXT SENTENCE
      **** ELSE
      ****     GO TO 61-READ-INVOICES.

           ADD 1  TO  INV-ENTRY-CTR.
           PERFORM 66-PRINT-DINVRCD-DATA  THRU  66-PDD-X.

           PERFORM 66-PRINT-COLLECT-FREIGHT  THRU  66-PCF-X.

           PERFORM 66-PRINT-ITEM-INFO  THRU  66-PII-X.

           MOVE 2             TO  INV-PAY-CTL.
           MOVE ASTERISK-LINE TO  INV-PAY-REPORT-LINE.
           PERFORM 5-WRITE-INVPAY-REPORT-LINE.

           INITIALIZE BUF-TTAXFILE.

           GO TO 61-READ-INVOICES.

       61-REPORT-FINISH.
           IF INV-ENTRY-CTR = ZEROS
               MOVE 2              TO  INV-PAY-CTL
               MOVE NO-INVOICE-MSG TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2              TO  INV-PAY-CTL
               MOVE NO-INVOICE-MSG TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
           ELSE
               PERFORM 5-WRITE-INVPAY-TOTALS.

       61-GLI-X.
           EXIT.

      **********************************************************
      *   H I S T O R Y   D A T A B A S E                      *
      **********************************************************

       62-GET-HIST-INVOICES.
           MOVE 1                   TO  REPORT-TYPE.
           MOVE INV-PAID-HEADER     TO  RPT-HEADER.
           PERFORM 5-WRITE-INVPAY-REPORT-HEADER.
           MOVE ZEROS               TO  INV-ENTRY-CTR.
           PERFORM 9999-START-DINVRCDH-I.
           INITIALIZE BUF-TTAXFILE.

       62-READ-INVOICES.
           PERFORM 9999-READ-NEXT-DINVRCDH-I.
           MOVE INVH-DATE TO FORMAT-DATE-9.
           IF EOF-DINVRCDH = "Y" OR FORMAT-DATE > TO-DATE-9
               GO TO 62-REPORT-FINISH.
           MOVE INVH-REG-NO         TO  REGISTER-ARG.
      *-------- ONLY GET INVOICES THAT HAVE BEEN PAID.
           IF INVH-STATUS NOT = "2"
               GO TO 62-READ-INVOICES.

           ADD 1  TO  INV-ENTRY-CTR.
           PERFORM 67-PRINT-DINVRCDH-DATA  THRU  67-PDD-X.

      ***  PERFORM 66-PRINT-COLLECT-FREIGHT  THRU  66-PCF-X.

           PERFORM 67-PRINT-ITEM-INFO  THRU  67-PII-X.

           MOVE 2             TO  INV-PAY-CTL.
           MOVE ASTERISK-LINE TO  INV-PAY-REPORT-LINE.
           PERFORM 5-WRITE-INVPAY-REPORT-LINE.

           INITIALIZE BUF-TTAXFILE.

           GO TO 62-READ-INVOICES.

       62-REPORT-FINISH.
           IF INV-ENTRY-CTR = ZEROS
               MOVE 2              TO  INV-PAY-CTL
               MOVE NO-INVOICE-MSG TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2              TO  INV-PAY-CTL
               MOVE NO-INVOICE-MSG TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
           ELSE
               PERFORM 5-WRITE-INVPAY-TOTALS.

       62-GHI-X.
           EXIT.

       66-PRINT-DINVRCD-DATA.
           MOVE INV-REG-NO          TO  REG-NO-OUT
                                        TAX-REG-NO.
           MOVE INV-NO              TO  INV-NO-OUT
                                        TAX-INV-NO.
           MOVE 4                   TO  DATE-MODE.
           MOVE INV-DATE            TO  DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  INV-DATE-OUT.
           MOVE INV-DATE-CN         TO  TAX-INV-DATE.
           MOVE INV-ENTRY-DATE      TO  DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  ENTRY-DATE-OUT.
           MOVE INV-DUE-DATE        TO  DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  DUE-DATE-OUT.
           MOVE INV-TERMS           TO  INV-TERMS-OUT.
           MOVE INV-PO-RLSE         TO  PO-NO-OUT
                                        TAX-PO-RLSE.
           MOVE INV-VEN-CODE        TO  VEN-CODE-OUT
                                        TAX-VEN-CODE.
           MOVE INV-VEN-CODE  TO  VEN-ARG.
           PERFORM 661-GET-VENDOR-NAME  THRU  661-GVN-X.
           MOVE INV-ADD-CLERK       TO  ADD-EMP-OUT.
           MOVE INV-MOD-CLERK       TO  MOD-EMP-OUT.
           MOVE INV-NO-CHECK-INDIC  TO  NO-CHECK-INDIC-OUT.
           MOVE INV-P-MATL-EXT      TO  PO-EXT-OUT.
           MOVE INV-ADD-VFRT        TO  FRT-OUT
                                        TAX-FRT-AMT.
           MOVE CE1-CODE            TO  CE-OUT.
           MOVE CE1-ACCTG-DATA      TO  CE-ACCTG-OUT.
           MOVE CE1-TOTAL           TO  CE-AMT-OUT.
           MOVE INV-NET-DUE-VENDOR  TO  NET-DUE-VEN-OUT
                                        TAX-NET-DUE-VEND.
           MOVE INV-I-MATL-EXT      TO  INV-EXT-OUT.
           MOVE INV-ADD-TAX         TO  TAX-OUT
                                        TAX-SALES-TAX.
           MOVE CE3-FRT             TO  CE3-OUT.
           MOVE INV-TOTAL-CFRT      TO  COLLECT-FRT-OUT.
           MOVE INV-ADD-CTNRS       TO  CONT-OUT.
           MOVE CE4-INS             TO  CE4-OUT.
           MOVE ZEROS               TO  TOTAL-ACCRUED-TAX.
           PERFORM 661-ADD-ACCRUED-TAX  THRU  661-AAT-X
               VARYING  SUB FROM 1 BY 1
                 UNTIL SUB > 4.
           MOVE TOTAL-ACCRUED-TAX   TO  ACCRUED-TAX-OUT
                                        TAX-ACCR-TAX.
           MOVE INV-MFEST-NO        TO  TAX-MFEST-NO.
           MOVE INV-MFEST-YY        TO  TAX-MFEST-YY.
           MOVE INV-CHECK-CN        TO  TAX-CHECK-CN.
           MOVE INV-PAYMENT-IND     TO  PAY-IND-OUT.
           MOVE INV-ADD-INS         TO  INSURANCE-OUT.
           MOVE CE5-TAX             TO  CE5-OUT.
           MOVE INV-ADJ-OTHER       TO  OTHER-ADJ-OUT.
           MOVE INV-ADD-OTHER       TO  OTHER-OUT.
           MOVE CE6-EXT-ERR         TO  CE6-OUT.
           MOVE ZEROS               TO  CALC-INV-AMT.
           IF INV-PAYMENT-IND = "P"
               ADD  INV-P-MATL-EXT  TO  CALC-INV-AMT ROUNDED
           ELSE
           IF INV-PAYMENT-IND = "I"
               ADD  INV-I-MATL-EXT  TO  CALC-INV-AMT ROUNDED.
           ADD INV-ADD-VFRT, INV-ADD-TAX, INV-ADD-CTNRS,
               INV-ADD-INS, INV-ADD-OTHER
                TO CALC-INV-AMT.
           MOVE CALC-INV-AMT        TO  CALC-AMT-OUT.
           MOVE CE7-UPRC-ERR        TO  CE7-OUT.
           MOVE INV-DIST-COST       TO  COST-DIST-OUT.
           MOVE INV-TAX-CODE        TO  TAX-CODE-OUT.
           MOVE CE8-OTHER           TO  CE8-OUT.
           MOVE CE9-CASH-DSCNT      TO  CE9-OUT.
           IF CE-EXT-VALUE-1 NOT = ZEROS
               MOVE CE-EXT-CODE-1           TO  EXTRA-CE-OUT
               MOVE CE-EXT-VALUE-1          TO  EXTRA-CE-AMT-OUT
               MOVE CE-EXT-ACCTG-DATA-1     TO  EXTRA-CE-ACCTG.
      *****IF INV-PAY-REPORT-TYPE
               ADD INV-ADD-TAX      TO  TOT-INV-TAX-I
               ADD TOTAL-ACCRUED-TAX  TO  TOT-ACCRUED-TAX-I
               ADD INV-ADD-CTNRS    TO  TOT-INV-CONT-I
               ADD INV-ADD-VFRT     TO  TOT-INV-FRT-I
               ADD INV-ADD-INS      TO  TOT-INV-INS-I
               ADD INV-TOTAL-CFRT   TO  TOT-COL-FRT-I
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-HEADER-1    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-1    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-HEADER-1B   TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-1B   TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-DETAIL-2    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-3    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-4    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-5    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-6    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-7    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-8    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-9    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  IF CE-EXT-VALUE-1 NOT = ZEROS
      *******      MOVE INV-DETAIL-9B  TO  INV-PAY-REPORT-LINE
      *******      PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  ELSE
      *******      NEXT SENTENCE.

       66-PDD-X.
           EXIT.

       66-PRINT-COLLECT-FREIGHT.
           MOVE REGISTER-ARG TO REGISTERNO OF DPOFREIGHT-REC-I.
           START DPOFREIGHT-I KEY = REGISTERNO OF DPOFREIGHT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 66-PCF-X
               ELSE
               MOVE "FIND DPOFREIGHT 66-PCF"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE ZEROS                 TO  FRT-CTR.

       66-GET-DPOFREIGHT-LOOP.
           READ DPOFREIGHT-I NEXT INTO BUF-DPOFREIGHT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 66-PCF-X
               ELSE
                   MOVE "GET DPOFREIGHT 66-GDL" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DPOFREIGHT-REC-I NOT = REGISTER-ARG
                    OR FILE-STATUS = "23"
               GO TO 66-PCF-X.

           ADD 1                      TO  FRT-CTR.
           MOVE FRT-BILL-NO           TO  PRO-NO-OUT.
           MOVE FRT-CARRIER           TO  CARRIER-OUT.
           MOVE FRT-CHARGES-9         TO  FRT-CHRG-OUT.
           IF FRT-CTR = 1
      ******   IF INV-PAY-REPORT-TYPE
                   MOVE 2             TO  INV-PAY-CTL.
                   MOVE INV-DETAIL-10 TO  INV-PAY-REPORT-LINE.
                   PERFORM 5-WRITE-INVPAY-REPORT-LINE.

      **** IF INV-PAY-REPORT-TYPE
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-11     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.

           GO TO 66-GET-DPOFREIGHT-LOOP.

       66-PCF-X.
           EXIT.

       66-PRINT-ITEM-INFO.
      **** IF INV-PAY-REPORT-TYPE
               MOVE 2                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-12     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.

           MOVE REGISTER-ARG TO REGISTERNO OF DINVITM-REC-I.
           START DINVITM-I KEY = REGISTERNO OF DINVITM-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               MOVE "FIND DINVITM-66-PII"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           IF FILE-STATUS-1 = "2"
      *******  IF INV-PAY-REPORT-TYPE
                   MOVE 2            TO  INV-PAY-CTL
                   MOVE NO-ITEMS-MSG TO  INV-PAY-REPORT-LINE
                   PERFORM 5-WRITE-INVPAY-REPORT-LINE
                   GO TO 66-PII-X.

           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCT-REC-I.
           START DINVACCT-I KEY = REGISTERNO OF DINVACCT-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "9999" TO INVACCT-ITEM
               ELSE
               MOVE "FIND DINVACCT-66-PII"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           PERFORM 661-GET-DINVACCT  THRU  661-GD-X.

       66-GET-DINVITM-LOOP.
           READ DINVITM-I NEXT INTO BUF-DINVITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 66-PII-X
               ELSE
                   MOVE "GET DINVRCD 66-GDL" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITM-REC-I NOT = REGISTER-ARG
                    OR FILE-STATUS = "23"
               GO TO 66-PII-X.

           MOVE INVITM-ITEM-NO        TO  ITEM-OUT.
           MOVE INVITM-CORPCODE       TO  CORP-CODE-OUT.
           MOVE INVITM-PO-QTY-PD      TO  PO-QTY-PAID-OUT.
           MOVE INVITM-PO-UPRICE      TO  PO-PRICE-OUT.
           MOVE INVITM-PO-UM          TO  PO-UM-OUT,
                                          INV-UM-OUT.
           IF INVITM-PO-QTY-PD = ZEROS
               MOVE INVITM-PO-UPRICE  TO  PO-ITEM-EXT-OUT
           ELSE
               MULTIPLY INVITM-PO-QTY-PD  BY  INVITM-PO-UPRICE
                   GIVING CALC-PO-EXT  ROUNDED
               MOVE CALC-PO-EXT       TO  PO-ITEM-EXT-OUT.
           MOVE INVITM-INV-QTY-PD     TO  INV-QTY-PAID-OUT
                                          TAX-QTY-PD.
           MOVE INVITM-INV-UPRICE     TO  INV-PRICE-OUT.
           IF INVITM-INV-QTY-PD = ZEROS
               MOVE INVITM-INV-UPRICE TO  INV-ITEM-EXT-OUT
                                          TAX-ITEM-AMT
           ELSE
               MULTIPLY INVITM-INV-QTY-PD  BY  INVITM-INV-UPRICE
                   GIVING CALC-INV-EXT  ROUNDED
               MOVE CALC-INV-EXT      TO  INV-ITEM-EXT-OUT
                                          TAX-ITEM-AMT.
           MOVE INVITM-TAX-CODE       TO  ITM-TAX-CODE-OUT.
           IF INVITM-MEMO-INDIC = "X"
               MOVE "MEMO QTY."       TO  MEMO-IND-OUT
           ELSE
               MOVE SPACES            TO  MEMO-IND-OUT.
           MOVE SPACES                TO  ACCT-DATA1-OUT,
                                          ACCT-DATA2-OUT.
           IF INVACCT-ITEM = INVITM-ITEM-NO
               MOVE INVACCT-PRIME     TO  PRIME1-OUT
                                          TAX-PRIME
               MOVE INVACCT-SUB       TO  SUB1-OUT
                                          TAX-SUB
               MOVE INVACCT-SUBD      TO  SUBD1-OUT
                                          TAX-SUBD
               MOVE INVACCT-ADDL-DATA TO  ADDL1-OUT
                                          TAX-ADDL-DATA
               PERFORM 661-GET-DINVACCT  THRU  661-GD-X
               IF INVACCT-ITEM = INVITM-ITEM-NO
                   MOVE INVACCT-PRIME     TO  PRIME2-OUT
                   MOVE INVACCT-SUB       TO  SUB2-OUT
                   MOVE INVACCT-SUBD      TO  SUBD2-OUT
                   MOVE INVACCT-ADDL-DATA TO  ADDL2-OUT.

      **** IF INV-PAY-REPORT-TYPE
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-13     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-14     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.

       66-CHECK-FOR-MORE-ACCTG.
           IF INVACCT-ITEM = INVITM-ITEM-NO
               PERFORM 661-GET-DINVACCT  THRU  661-GD-X
               IF INVACCT-ITEM  =  INVITM-ITEM-NO
                   MOVE INVACCT-PRIME     TO  PRIME3-OUT
                   MOVE INVACCT-SUB       TO  SUB3-OUT
                   MOVE INVACCT-SUBD      TO  SUBD3-OUT
                   MOVE INVACCT-ADDL-DATA TO  ADDL3-OUT
      ************ IF INV-PAY-REPORT-TYPE
                       MOVE 1             TO  INV-PAY-CTL
                       MOVE INV-DETAIL-15 TO  INV-PAY-REPORT-LINE
                       PERFORM 5-WRITE-INVPAY-REPORT-LINE
                       GO TO 66-CHECK-FOR-MORE-ACCTG.

      **** IF INV-PAY-REPORT-TYPE
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE SPACES            TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
               PERFORM 661-GET-KWM.
               PERFORM 5-WRITE-TAXFILE-RCD.

           GO TO 66-GET-DINVITM-LOOP.

       66-PII-X.
           EXIT.

       661-GET-DINVACCT.
           READ DINVACCT-I NEXT INTO BUF-DINVACCT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *********IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "9999" TO INVACCT-ITEM
                   GO TO 661-GD-X.
      *********ELSE
      *************MOVE "GET DINVACCT 661-GD" TO BU-DISPLAY-MSG
      *************GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVACCT-REC-I NOT = REGISTER-ARG
               MOVE "9999" TO INVACCT-ITEM.

       661-GD-X.
           EXIT.


       661-GET-VENDOR-NAME.
           MOVE VEN-ARG       TO  VENCDE OF DVENDOR-REC-I.
           MOVE "00"          TO  VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "* VENDOR NOT ON FILE *" TO VEN-NAME-OUT
               ELSE
                   MOVE "READ DVENDOR 661-GVN"  TO  BU-DISPLAY-MSG
                   GO TO 2-BLOWUP
           ELSE
               MOVE VEN-NAME           TO  VEN-NAME-OUT.
           MOVE VEN-NAME-OUT           TO  TAX-VEN-NAME.

           MOVE "01"          TO  VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES           TO  TAX-VEN-ADDR
           ELSE
               MOVE VENDOR-ADDRESS   TO  TAX-VEN-ADDR.

           MOVE "07"          TO  VENITMNO OF DVENDOR-REC-I.
           READ DVENDOR-I INTO BUF-DVENDOR
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES           TO  TAX-VEN-CITY
                                         TAX-VEN-STATE
                                         TAX-VEN-ZIP
           ELSE
               MOVE VEN-CITY         TO  TAX-VEN-CITY
               MOVE VEN-STATE-CODE   TO  TAX-VEN-STATE
               MOVE VEN-ZIP          TO  TAX-VEN-ZIP.

       661-GVN-X.
           EXIT.

       661-ADD-ACCRUED-TAX.
           ADD INV-ATAX-AMT (SUB)  TO  TOTAL-ACCRUED-TAX.

       661-AAT-X.
           EXIT.

       661-GET-KWM.
           MOVE 2                     TO  CDESC-LINES-TO-GET.
           MOVE "D"                   TO  CDESC-DESC-OPTION.
           MOVE "N"                   TO  CDESC-LOCAL-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, INVITM-CORPCODE, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE "*NOT ON FILE*"   TO  TAX-DESC
           ELSE
               MOVE CDESC (1)         TO  TAX-DESC.
           MOVE INVITM-CORPCODE       TO  TAX-CORP-CODE.

      ***************************************************************
      *     H I S T O R Y   D A T A B A S E                         *
      ***************************************************************

       67-PRINT-DINVRCDH-DATA.
           MOVE INVH-REG-NO         TO  REG-NO-OUT
                                        TAX-REG-NO.
           MOVE INVH-NO             TO  INV-NO-OUT
                                        TAX-INV-NO.
           MOVE 4                   TO  DATE-MODE.
           MOVE INVH-DATE           TO  FORMAT-DATE-9
           IF FORMAT-YY > 70
               COMPUTE DISPLAY-DATE = INVH-DATE - 19000000
           ELSE
               COMPUTE DISPLAY-DATE = INVH-DATE - 20000000.
           MOVE DISPLAY-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  INV-DATE-OUT.
           MOVE FORMAT-DATE         TO  TAX-INV-DATE.
           MOVE INVH-ENTRY-DATE     TO  FORMAT-DATE-9.
           IF FORMAT-YY > 70
               COMPUTE DISPLAY-DATE = INVH-ENTRY-DATE - 19000000
           ELSE
               COMPUTE DISPLAY-DATE = INVH-ENTRY-DATE - 20000000.
           MOVE DISPLAY-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  ENTRY-DATE-OUT.
           MOVE INVH-DUE-DATE       TO  FORMAT-DATE-9.
           IF FORMAT-YY > 70
               COMPUTE DISPLAY-DATE = INVH-DUE-DATE - 19000000
           ELSE
               COMPUTE DISPLAY-DATE = INVH-DUE-DATE - 20000000.
           MOVE DISPLAY-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-SLASH-OUT      TO  DUE-DATE-OUT.
           MOVE INVH-TERMS          TO  INV-TERMS-OUT.
           MOVE INVH-PO-RLSE        TO  PO-NO-OUT
                                        TAX-PO-RLSE.
           MOVE INVH-VEN-CODE       TO  VEN-CODE-OUT
                                        TAX-VEN-CODE.
           MOVE INVH-VEN-CODE  TO  VEN-ARG.
           PERFORM 661-GET-VENDOR-NAME  THRU  661-GVN-X.
           MOVE INVH-ADD-CLERK      TO  ADD-EMP-OUT.
           MOVE INVH-MOD-CLERK      TO  MOD-EMP-OUT.
           MOVE INVH-NO-CHECK-INDIC TO  NO-CHECK-INDIC-OUT.
           MOVE INVH-P-MATL-EXT     TO  PO-EXT-OUT.
           MOVE INVH-ADD-VFRT       TO  FRT-OUT
                                        TAX-FRT-AMT.
           MOVE CEH1-CODE           TO  CE-OUT.
           MOVE CEH1-ACCTG-DATA     TO  CE-ACCTG-OUT.
           MOVE CEH1-TOTAL          TO  CE-AMT-OUT.
           MOVE INVH-NET-DUE-VENDOR TO  NET-DUE-VEN-OUT
                                        TAX-NET-DUE-VEND.
           MOVE INVH-I-MATL-EXT     TO  INV-EXT-OUT.
           MOVE INVH-ADD-TAX        TO  TAX-OUT
                                        TAX-SALES-TAX.
           MOVE CEH3-FRT            TO  CE3-OUT.
           MOVE INVH-TOTAL-CFRT     TO  COLLECT-FRT-OUT.
           MOVE INVH-ADD-CTNRS      TO  CONT-OUT.
           MOVE CEH4-INS            TO  CE4-OUT.
           MOVE ZEROS               TO  TOTAL-ACCRUED-TAX.
           PERFORM 671-ADD-ACCRUED-TAX
               VARYING  SUB FROM 1 BY 1
                 UNTIL SUB > 4.
           MOVE TOTAL-ACCRUED-TAX   TO  ACCRUED-TAX-OUT
                                        TAX-ACCR-TAX.
           MOVE INVH-MFEST-NO       TO  TAX-MFEST-NO.
           MOVE INVH-MFEST-YY       TO  TAX-MFEST-YY.
           MOVE 4                   TO  DATE-MODE.
           MOVE INVH-CHECK-DATE     TO  FORMAT-DATE-9
           IF FORMAT-YY > 70
               COMPUTE DISPLAY-DATE = INVH-CHECK-DATE - 19000000
           ELSE
               COMPUTE DISPLAY-DATE = INVH-CHECK-DATE - 20000000.
           MOVE DISPLAY-DATE TO DATE-VALIDATE-IN.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE FORMAT-DATE         TO  TAX-CHECK-CN.
           MOVE INVH-PAYMENT-IND    TO  PAY-IND-OUT.
           MOVE INVH-ADD-INS        TO  INSURANCE-OUT.
           MOVE CEH5-TAX            TO  CE5-OUT.
           MOVE INVH-ADJ-OTHER      TO  OTHER-ADJ-OUT.
           MOVE INVH-ADD-OTHER      TO  OTHER-OUT.
           MOVE CEH6-EXT-ERR        TO  CE6-OUT.
           MOVE ZEROS               TO  CALC-INV-AMT.
           IF INVH-PAYMENT-IND = "P"
               ADD  INVH-P-MATL-EXT  TO  CALC-INV-AMT ROUNDED
           ELSE
           IF INVH-PAYMENT-IND = "I"
               ADD  INVH-I-MATL-EXT  TO  CALC-INV-AMT ROUNDED.
           ADD INVH-ADD-VFRT, INVH-ADD-TAX, INVH-ADD-CTNRS,
               INVH-ADD-INS, INVH-ADD-OTHER
                TO CALC-INV-AMT.
           MOVE CALC-INV-AMT        TO  CALC-AMT-OUT.
           MOVE CEH7-UPRC-ERR       TO  CE7-OUT.
           MOVE INVH-DIST-COST      TO  COST-DIST-OUT.
           MOVE INVH-TAX-CODE       TO  TAX-CODE-OUT.
           MOVE CEH8-OTHER          TO  CE8-OUT.
           MOVE CEH9-CASH-DSCNT     TO  CE9-OUT.
           IF CEH-EXT-VALUE-1 NOT = ZEROS
               MOVE CEH-EXT-CODE-1           TO  EXTRA-CE-OUT
               MOVE CEH-EXT-VALUE-1          TO  EXTRA-CE-AMT-OUT
               MOVE CEH-EXT-ACCTG-DATA-1     TO  EXTRA-CE-ACCTG.
      *****IF INV-PAY-REPORT-TYPE
               ADD INVH-ADD-TAX      TO  TOT-INV-TAX-I
               ADD TOTAL-ACCRUED-TAX  TO  TOT-ACCRUED-TAX-I
               ADD INVH-ADD-CTNRS     TO  TOT-INV-CONT-I
               ADD INVH-ADD-VFRT      TO  TOT-INV-FRT-I
               ADD INVH-ADD-INS       TO  TOT-INV-INS-I
               ADD INVH-TOTAL-CFRT    TO  TOT-COL-FRT-I
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-HEADER-1    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-1    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-HEADER-1B   TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-1B   TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 2               TO  INV-PAY-CTL
               MOVE INV-DETAIL-2    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-3    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE
               MOVE 1               TO  INV-PAY-CTL
               MOVE INV-DETAIL-4    TO  INV-PAY-REPORT-LINE
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-5    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-6    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-7    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-8    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  MOVE INV-DETAIL-9    TO  INV-PAY-REPORT-LINE
      *******  PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  MOVE 1               TO  INV-PAY-CTL
      *******  IF CEH-EXT-VALUE-1 NOT = ZEROS
      *******      MOVE INV-DETAIL-9B  TO  INV-PAY-REPORT-LINE
      *******      PERFORM 5-WRITE-INVPAY-REPORT-LINE
      *******  ELSE
      *******      NEXT SENTENCE.

       67-PDD-X.
           EXIT.

      *67-PRINT-COLLECT-FREIGHT.
      *    MOVE REGISTER-ARG TO REGISTERNO OF DPOFREIGHT-REC-I.
      *    START DPOFREIGHT-I KEY = REGISTERNO OF DPOFREIGHT-REC-I
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS-1 = "2"
      *            GO TO 67-PCF-X
      *        ELSE
      *        MOVE "FIND DPOFREIGHT 67-PCF"  TO  BU-DISPLAY-MSG
      *        GO TO 2-BLOWUP.
      *
      *    MOVE ZEROS                 TO  FRT-CTR.
      *
      *67-GET-DPOFREIGHT-LOOP.
      *    READ DPOFREIGHT-I NEXT INTO BUF-DPOFREIGHT
      *        AT END MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        IF FILE-STATUS = "10" OR "14" OR "46"
      *            GO TO 67-PCF-X
      *        ELSE
      *            MOVE "GET DPOFREIGHT 67-GDL" TO BU-DISPLAY-MSG
      *            GO TO 2-BLOWUP.
      *    IF REGISTERNO OF DPOFREIGHT-REC-I NOT = REGISTER-ARG
      *        GO TO 67-PCF-X.
      *
      *    ADD 1                      TO  FRT-CTR.
      *    MOVE FRT-BILL-NO           TO  PRO-NO-OUT.
      *    MOVE FRT-CARRIER           TO  CARRIER-OUT.
      *    MOVE FRT-CHARGES-9         TO  FRT-CHRG-OUT.
      *    IF FRT-CTR = 1
      ******   IF INV-PAY-REPORT-TYPE
      *            MOVE 2             TO  INV-PAY-CTL.
      *            MOVE INV-DETAIL-10 TO  INV-PAY-REPORT-LINE.
      *            PERFORM 5-WRITE-INVPAY-REPORT-LINE.
      *
      **** IF INV-PAY-REPORT-TYPE
      *        MOVE 1                 TO  INV-PAY-CTL.
      *        MOVE INV-DETAIL-11     TO  INV-PAY-REPORT-LINE.
      *        PERFORM 5-WRITE-INVPAY-REPORT-LINE.
      *
      *    GO TO 67-GET-DPOFREIGHT-LOOP.
      *
      *67-PCF-X.
      *    EXIT.

       67-PRINT-ITEM-INFO.
      **** IF INV-PAY-REPORT-TYPE
               MOVE 2                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-12     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.

           MOVE REGISTER-ARG TO REGISTERNO OF DINVITMH-I-REC.
           START DINVITMH-I KEY = REGISTERNO OF DINVITMH-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   NEXT SENTENCE
               ELSE
               MOVE "FIND DINVITM-67-PII"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           IF FILE-STATUS-1 = "2"
      *******  IF INV-PAY-REPORT-TYPE
                   MOVE 2            TO  INV-PAY-CTL
                   MOVE NO-ITEMS-MSG TO  INV-PAY-REPORT-LINE
                   PERFORM 5-WRITE-INVPAY-REPORT-LINE
                   GO TO 67-PII-X.

           MOVE REGISTER-ARG TO REGISTERNO OF DINVACCTH-I-REC.
           START DINVACCTH-I KEY = REGISTERNO OF DINVACCTH-I-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE "9999" TO INVACCTH-ITEM
               ELSE
               MOVE "FIND DINVACCT-67-PII"  TO  BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           PERFORM 671-GET-DINVACCTH THRU  671-GD-X.

       67-GET-DINVITMH-LOOP.
           READ DINVITMH-I NEXT INTO BUF-DINVITM-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   GO TO 67-PII-X
               ELSE
                   MOVE "GET DINVRCD 67-GDL" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVITMH-I-REC NOT = REGISTER-ARG
                    OR FILE-STATUS = "23"
               GO TO 67-PII-X.

           IF INVITMH-PO-NUM = INVH-PO-RLSE
               NEXT SENTENCE
           ELSE
               GO TO 67-GET-DINVITMH-LOOP.

           MOVE INVITMH-ITEM-NO        TO  ITEM-OUT.
           MOVE INVITMH-CORPCODE       TO  CORP-CODE-OUT.
           MOVE INVITMH-PO-QTY-PD      TO  PO-QTY-PAID-OUT.
           MOVE INVITMH-PO-UPRICE      TO  PO-PRICE-OUT.
           MOVE INVITMH-PO-UM          TO  PO-UM-OUT,
                                          INV-UM-OUT.
           IF INVITMH-PO-QTY-PD = ZEROS
               MOVE INVITMH-PO-UPRICE  TO  PO-ITEM-EXT-OUT
           ELSE
               MULTIPLY INVITMH-PO-QTY-PD  BY  INVITMH-PO-UPRICE
                   GIVING CALC-PO-EXT  ROUNDED
               MOVE CALC-PO-EXT        TO  PO-ITEM-EXT-OUT.
           MOVE INVITMH-INV-QTY-PD     TO  INV-QTY-PAID-OUT
                                           TAX-QTY-PD.
           MOVE INVITMH-INV-UPRICE     TO  INV-PRICE-OUT.
           IF INVITMH-INV-QTY-PD = ZEROS
               MOVE INVITMH-INV-UPRICE TO  INV-ITEM-EXT-OUT
                                           TAX-ITEM-AMT
           ELSE
               MULTIPLY INVITMH-INV-QTY-PD  BY  INVITMH-INV-UPRICE
                   GIVING CALC-INV-EXT  ROUNDED
               MOVE CALC-INV-EXT       TO  INV-ITEM-EXT-OUT
                                           TAX-ITEM-AMT.
           MOVE INVITMH-TAX-CODE       TO  ITM-TAX-CODE-OUT.
           IF INVITMH-MEMO-INDIC = "X"
               MOVE "MEMO QTY."        TO  MEMO-IND-OUT
           ELSE
               MOVE SPACES             TO  MEMO-IND-OUT.
           MOVE SPACES                 TO  ACCT-DATA1-OUT,
                                           ACCT-DATA2-OUT.
           IF INVACCTH-ITEM = INVITMH-ITEM-NO
               MOVE INVACCTH-PRIME     TO  PRIME1-OUT
                                           TAX-PRIME
               MOVE INVACCTH-SUB       TO  SUB1-OUT
                                           TAX-SUB
               MOVE INVACCTH-SUBD      TO  SUBD1-OUT
                                           TAX-SUBD
               MOVE INVACCTH-ADDL-DATA TO  ADDL1-OUT
                                           TAX-ADDL-DATA
               PERFORM 671-GET-DINVACCTH THRU  671-GD-X
               IF INVACCTH-ITEM = INVITMH-ITEM-NO
                   MOVE INVACCTH-PRIME     TO  PRIME2-OUT
                   MOVE INVACCTH-SUB       TO  SUB2-OUT
                   MOVE INVACCTH-SUBD      TO  SUBD2-OUT
                   MOVE INVACCTH-ADDL-DATA TO  ADDL2-OUT.

      **** IF INV-PAY-REPORT-TYPE
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-13     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE INV-DETAIL-14     TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.

       67-CHECK-FOR-MORE-ACCTG.
           IF INVACCTH-ITEM = INVITMH-ITEM-NO
               PERFORM 671-GET-DINVACCTH THRU  671-GD-X
               IF INVACCTH-ITEM  =  INVITMH-ITEM-NO
                   MOVE INVACCTH-PRIME     TO  PRIME3-OUT
                   MOVE INVACCTH-SUB       TO  SUB3-OUT
                   MOVE INVACCTH-SUBD      TO  SUBD3-OUT
                   MOVE INVACCTH-ADDL-DATA TO  ADDL3-OUT
      ************ IF INV-PAY-REPORT-TYPE
                       MOVE 1             TO  INV-PAY-CTL
                       MOVE INV-DETAIL-15 TO  INV-PAY-REPORT-LINE
                       PERFORM 5-WRITE-INVPAY-REPORT-LINE
                       GO TO 67-CHECK-FOR-MORE-ACCTG.

      **** IF INV-PAY-REPORT-TYPE
               MOVE 1                 TO  INV-PAY-CTL.
               MOVE SPACES            TO  INV-PAY-REPORT-LINE.
               PERFORM 5-WRITE-INVPAY-REPORT-LINE.
               PERFORM 671-GET-KWM.
               PERFORM 5-WRITE-TAXFILE-RCD.

           GO TO 67-GET-DINVITMH-LOOP.

       67-PII-X.
           EXIT.

       671-GET-DINVACCTH.
           READ DINVACCTH-I NEXT INTO BUF-DINVACCT-H
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *********IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE "9999" TO INVACCTH-ITEM
                   GO TO 671-GD-X.
      *********ELSE
      *********    MOVE "GET DINVACCTH 671-GD" TO BU-DISPLAY-MSG
      *********    GO TO 2-BLOWUP.
           IF REGISTERNO OF DINVACCTH-I-REC NOT = REGISTER-ARG
               MOVE "9999" TO INVACCTH-ITEM.

           IF REGISTERNO OF DINVACCTH-I-REC = REGISTER-ARG
               IF INVACCTH-PO-NUM NOT = INVH-PO-RLSE
                   GO TO 671-GET-DINVACCTH.

       671-GD-X.
           EXIT.

       671-GET-KWM.
           MOVE 2                     TO  CDESC-LINES-TO-GET.
           MOVE "D"                   TO  CDESC-DESC-OPTION.
           MOVE "N"                   TO  CDESC-LOCAL-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, INVITMH-CORPCODE, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE "*NOT ON FILE*"   TO  TAX-DESC
           ELSE
               MOVE CDESC (1)         TO  TAX-DESC.
           MOVE INVITMH-CORPCODE      TO  TAX-CORP-CODE.

       671-ADD-ACCRUED-TAX.
           ADD INVH-ATAX-AMT (SUB)  TO  TOTAL-ACCRUED-TAX.

       9999-START-DINVRCD-I.
           MOVE LOW-VALUES TO REGISTERNO OF DINVRCD-REC-I.
           START DINVRCD-I KEY > REGISTERNO OF DINVRCD-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-DINVRCD-I.
           READ DINVRCD-I NEXT INTO BUF-DINVRCD
              AT END MOVE "Y" TO EOF-DINVRCD.

       9999-START-DINVRCDH-I.
           MOVE FROM-DATE-9 TO INVDTE OF DINVRCDH-REC-I.
           START DINVRCDH-I KEY >= INVDTE OF DINVRCDH-REC-I
              INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-READ-NEXT-DINVRCDH-I.
           READ DINVRCDH-I NEXT INTO BUF-DINVRCD-H
              AT END MOVE "Y" TO EOF-DINVRCDH.

