000300 IDENTIFICATION DIVISION.
000400 PROGRAM-ID.          TTAXENTY.
000500 AUTHOR.              KURT MOVSESIAN.
000600 DATE-WRITTEN.        MAY 8, 1985.
000900
001000
001100******************************************************
001200*                                                    *
001300*   PU6   MODIFY TAX CODES - THIS PROGRAM ADDS,      *
001400*         MODIFIES AND DELETES TAX CODES USED IN     *
001500*         PURCHASING AND ACCOUNTS PAYABLE            *
001600*                                                    *
001700******************************************************
      *
      *C  06/02/99   CA YODER   (DECATUR REQUEST)
      *C    EXPANDED TAX RATE PERCENTAGE FROM 2 DECIMAL
      *C    PLACES TO 4.
      *
004300
004400
004500 ENVIRONMENT DIVISION.
004600 CONFIGURATION SECTION.
004700 SOURCE-COMPUTER.  HP-3000.
004800 OBJECT-COMPUTER.  HP-3000.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZTAXENTY-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT MPLTINFO-I
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MTAX-O
                  ASSIGN TO DATABASE-MCFLCS3701
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MCOMMENT-O
                  ASSIGN TO DATABASE-MCFLCS1801
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DCOMMENT-O
                  ASSIGN TO DATABASE-MCFLCS1901
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.


004900
005000 DATA DIVISION.
       FILE SECTION.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-ALL-FORMATS OF ZTAXENTY.
005100
       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS OF MCFLCS0501.

       FD  MTAX-O
           LABEL RECORDS ARE STANDARD.
       01  MTAX-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS3701.

       FD  MCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  MCOMMENT-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1801.

       FD  DCOMMENT-O
           LABEL RECORDS ARE STANDARD.
       01  DCOMMENT-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS1901.

005200 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

005300 77  COMPANY-SAVE                 PIC X(3)    VALUE SPACES.
005500
005600
005700**********************
005800*                    *
005900*  S W I T C H E S   *
006000*                    *
006100**********************
006200
006300 01  SWITCH-AREA.
006400     05  FATAL-ERR-SW            PIC X       VALUE "N".
006500     05  ERR-SW                  PIC X       VALUE "N".
006600
006700 01  SUB-AREA  COMP-4.
006800     05  SUB                     PIC S9(4)   VALUE ZEROS.
006900     05  TAX-LINE-SUB            PIC S9(4)   VALUE ZEROS.
007000
007100
007200**************************************************************
007300**************************************************************
007400**                                                          **
007500**                DATABASE I/O BUFFER AREA                  **
007600**                                                          **
007700**************************************************************
007800**************************************************************
008000
008100 COPY MPLTINFO IN COPYLIB.
008200
008300 COPY MCOMMENT IN COPYLIB.
008400
008500 COPY DCOMMENT IN COPYLIB.
008600
008700 COPY MTAX IN COPYLIB.
009200
009300
009400*********************
009500*                   *
009600*   DATA SET NAMES  *
009700*                   *
009800*********************
009900
010000 01  DSET-NAMES.
010100     05  DSET-NAME           PIC X(16)  VALUE SPACES.
010200     05  DSET-MPLTINFO       PIC X(16)  VALUE "MPLTINFO;".
010300     05  DSET-MTAX           PIC X(16)  VALUE "MTAX;".
010400     05  DSET-MCOMMENT       PIC X(16)  VALUE "MCOMMENT;".
010500     05  DSET-DCOMMENT       PIC X(16)  VALUE "DCOMMENT;".
010600
010700 COPY DATAB IN COPYLIB.
010800
010900 01 ITEMS-LISTING.
011000     05  COMMENT-SEARCH         PIC X(16)
011100                                 VALUE "MCOM-COMMENT-NO;".
011200     05  ALL-ITEMS              PIC XX    VALUE "@;".
011300
011400 01 ARG-VALUES.
011500     05  PLT-ARG                PIC X(4)  VALUE SPACES.
011600     05  TAX-ARG                PIC X(2)  VALUE SPACES.
011700     05  COMMENT-ARG            PIC X(4)  VALUE SPACES.
011800
012100 01  BUILD-TAX-CODE-KEY.
012200     05  FILLER                 PIC X(2)  VALUE "T ".
012300     05  BUILD-TAX-CODE         PIC X(2)  VALUE SPACES.
012400
012500 01  BEGIN-EXP-PRINT            PIC X(5) VALUE "*EXP*".
012600
012700 01  END-EXP-PRINT              PIC X(5) VALUE SPACES.
012800
012900
013000 COPY VCOMAREA IN COPYLIB.
013100
014200 01  MESSAGE-BUFFER.
014300     05  MSG-TEXT              PIC X(64)    VALUE SPACE.
014400     05  MSG-FLD               PIC X(12)    VALUE SPACE.
014500     05  MSG-FLD-9  REDEFINES  MSG-FLD      PIC Z(11)9.
014600
015100 01  FIELD-NUMBER              PIC S9(4)    VALUE 1   COMP-4.
015200
015300
015400 01  PASSED-SPOOL-PRT          PIC S9(2)    VALUE ZEROS COMP-4.
015500
015600 01  SCREEN-PRINT-PARMS.
015700     05  PRINTCNTL             PIC S9(4)    VALUE ZERO  COMP-4.
015800     05  PAGECNTL              PIC S9(4)    VALUE 49      COMP-4.
015900     05  SPOOLFIL-OPEN-SW      PIC X        VALUE "N".
016000
016100
016200
016300**************************************************************
016400**************************************************************
016500**                                                          **
016600**             TERMINAL I/O DATA AREA                       **
016700**                                                          **
016800**************************************************************
016900**************************************************************
017000
017100 01  SCREEN-1.
017200     05  DISP-COMPANY-1          PIC X(3)  VALUE SPACES.
           05  DISP-COMMAND-LINE       PIC X(79) VALUE SPACES.
           05  DISP-MESSAGE-LINE       PIC X(79) VALUE SPACES.
017300
017400 01  SCREEN-2.
017500     05  DISP-COMPANY-2          PIC X(3)  VALUE SPACES.
017600     05  DISP-TAX-DISTRICT-LIST.
017700         10  DISP-TAX-DIST       PIC X(15) OCCURS 4 TIMES.
017800     05  DE-TAX-CODE             PIC X(2)  VALUE SPACES.
017900     05  DE-TAX-PERCENT-LIST  OCCURS 4 TIMES.
018000****     10  DE-TAX-PERCENT      PIC 99V99.
018000         10  DE-TAX-PERCENT      PIC 99V9999.
018100         10  DE-TAX-PAY-INDIC    PIC X.
018200     05  DE-TAX-DESC.
018300         10  DE-TAX-DESC-LINE    PIC X(36) OCCURS 6 TIMES.
           05  DE-COMMAND-LINE         PIC X(79).
           05  DE-MESSAGE-LINE         PIC X(79).
018400
       COPY DISPDATA IN COPYLIB.

       COPY IOFEEDBACK IN COPYLIB.

       COPY CATREAD IN COPYLIB.
018500
018600 01  SAVE-TAX-DISTRICTS.
018700     05  TAX-DISTRICT           PIC X(15)  OCCURS 4 TIMES.
018800
018900 01  SAVE-OLD-TAX-DESC.
019000     05  TAX-DESC-LINE          PIC X(36)  OCCURS 6 TIMES.
019100
019200 COPY TBLOWUP IN COPYLIB.
019300
019400 COPY LANGUAGE IN COPYLIB.
019500
019600
019700 PROCEDURE DIVISION.
019800
019900 PROC-DIV SECTION 01.
020000
020100 BEGIN-HERE.
020200
020300     PERFORM 1-HSK THRU 1-H-X.
020400
020500     PERFORM 6-MAIN  THRU  6-M-X.
020600
020700     PERFORM 2-EOJ  THRU 2-EOJ-X.
020800
020900     GOBACK.
021000
021100 1-HSK.
           OPEN I-O DISPLAY-FILE, MTAX-O, MCOMMENT-O, DCOMMENT-O.
           OPEN INPUT MPLTINFO-I.

025600**************************************************
025700*                                                *
025800*   GET CO. AND PRIME FROM MPLTINFO              *
025900*   USING 'P 01' AS THE ARGUMENT                 *
026000*                                                *
026100**************************************************
026200
026300     MOVE "P 01"  TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
026700         MOVE "DBGET MPLTINFO 1-HSK P 01"  TO  BU-DISPLAY-MSG
026800         MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (2)
026900         GO TO 2-BLOWUP.
027000     MOVE MPLTINFO-COMPANY    TO  COMPANY-SAVE.
027100
027200     MOVE "PTX1"              TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
027600         MOVE "DBGET MPLTINFO 1-HSK PTX1"  TO  BU-DISPLAY-MSG
027700         MOVE PLT-ARG                  TO  BU-DISPLAY-FLD (2)
027800         GO TO 2-BLOWUP.
027900
028000     MOVE MPLTINFO-TAX-DISTRICT (1)   TO  TAX-DISTRICT (1).
028100     MOVE MPLTINFO-TAX-DISTRICT (2)   TO  TAX-DISTRICT (2).
028200
028300     MOVE "PTX2"                TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
028700         IF FILE-STATUS-1 = "2"
028800             MOVE SPACES        TO  TAX-DISTRICT (3),
028900                                    TAX-DISTRICT (4)
029000         ELSE
029100             MOVE "GET MPLTINFO 1-HSK PTX2" TO BU-DISPLAY-MSG
029200             MOVE PLT-ARG  TO  BU-DISPLAY-FLD (2)
029300             GO TO 2-BLOWUP
029400     ELSE
029500         MOVE MPLTINFO-TAX-DISTRICT (1)  TO  TAX-DISTRICT (3)
029600         MOVE MPLTINFO-TAX-DISTRICT (2)  TO  TAX-DISTRICT (4).
029700
029800*************************************************
029900*                                               *
030000*  LOAD MTAX WITH MTAX-CODE = "NO".  FOR USE    *
030100*  IN COUNTRIES THAT DO NOT HAVE A TAX CODE.    *
030200*                                               *
030300*************************************************
030400
031300
031400     MOVE SPACES  TO BUF-MTAX.
031500     MOVE "NO"    TO MTAX-CODE.
031600     MOVE ZEROES  TO MTAX-PERCENT (1),
031700                     MTAX-PERCENT (2),
031800                     MTAX-PERCENT (3),
031900                     MTAX-PERCENT (4).
032000     MOVE SPACES  TO MTAX-PAY-INDIC-LIST (1),
032100                     MTAX-PAY-INDIC-LIST (2),
032200                     MTAX-PAY-INDIC-LIST (3),
032300                     MTAX-PAY-INDIC-LIST (4).
032400
           WRITE MTAX-REC-O FROM BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00" OR FILE-STATUS = "22"
032800         NEXT SENTENCE
032900     ELSE
033000         MOVE "PUT MTAX ERROR IN 1-HSK" TO BU-DISPLAY-MSG
033100         GO TO 2-BLOWUP.
033200
033300     MOVE "T NO"              TO MCOM-COMMENT-NO.
           WRITE MCOMMENT-REC-O FROM BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00" OR FILE-STATUS = "22"
033700         NEXT SENTENCE
033800     ELSE
033900         MOVE "PUT MCOMMENT 1-HSK" TO BU-DISPLAY-MSG
034000         MOVE "T NO"               TO BU-DISPLAY-FLD (2)
034100         GO TO 2-BLOWUP.
034200
035000 1-H-X.
035100     EXIT.
035200
035300
035400 2-EOJ.
           CLOSE    DISPLAY-FILE, MTAX-O, MCOMMENT-O, DCOMMENT-O,
                    MPLTINFO-I.
037400
037500 2-EOJ-X.
037600      EXIT.
037700
037800******************************************************
037900**                                                  **
038000**   BLOWUP ROUTINE                                 **
038100**                                                  **
038200******************************************************
038300
038400 2-BLOWUP.
038500     MOVE "TTAXENTY"              TO  BU-PGM-NAME.
038600     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
038700         VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
038800                 BU-DISPLAY-FLDS.
038900
039000 2-BLOWUP-X.
039100     EXIT.
039200
042000
042100 4-PGM-ERROR.
           MOVE B"1" TO IND (FIELD-NUMBER) IND (99).
           MOVE MESSAGE-BUFFER TO DISP-MESSAGE-LINE,
                                  DE-MESSAGE-LINE.
042900
043000 4-PGM-ERROR-X.
043100     EXIT.
043200
045200
045300**************************************************
045400*                                                *
045500*     6 - M A I N                                *
045600*                                                *
045700**************************************************
045800
045900 6-MAIN.
046000     MOVE "TAXENTY1"  TO  VIEW-NFNAME.
047400
047600     MOVE SPACES        TO  SCREEN-1.
047700     MOVE COMPANY-SAVE  TO  DISP-COMPANY-1.
048400
048500 6-SHOWFORM-SCREEN-1.
           MOVE SCREEN-1       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-1.
050300
050400     IF VIEW-LASTKEY = 3
050500         GO TO 6-M-X.
051900
052100     IF VIEW-LASTKEY = 1
052200         PERFORM 61-ADD-TAX-CODE  THRU  61-ATC-X
052300     ELSE
052400     IF VIEW-LASTKEY = 2
052500         PERFORM 62-MODIFY-TAX-CODE  THRU  62-MTC-X
052600     ELSE
052700     IF VIEW-LASTKEY = 8
052800         PERFORM 63-DELETE-TAX-CODE  THRU  63-DTC-X
052900     ELSE
053000*        *** PRESS DESIRED FUNCTION KEY ***
053100         MOVE  16 TO LANG-SETNUM
053200         MOVE  43 TO LANG-MSGNUM
053300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
053400         MOVE 99  TO  FIELD-NUMBER
053500         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
053600         GO TO 6-SHOWFORM-SCREEN-1.
053700
053800     GO TO 6-MAIN.
053900
054000 6-M-X.
054100     EXIT.
054200
054300*********************************************************
054400*                                                       *
054500*   A D D   T A X   C O D E S                           *
054600*                                                       *
054700*********************************************************
054800
054900 61-ADD-TAX-CODE.
055000     MOVE "TAXENTY2"  TO  VIEW-NFNAME.
056600     MOVE SPACES        TO  SCREEN-2.
056700     MOVE COMPANY-SAVE TO  DISP-COMPANY-2.
056800     MOVE SAVE-TAX-DISTRICTS  TO  DISP-TAX-DISTRICT-LIST.
           PERFORM 66-ZERO-OUT-PERCENT
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 4.
057500
057600 61-SHOWFORM-SCREEN-2.
           MOVE SCREEN-2       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
060200
060300     IF VIEW-LASTKEY = 3
060400         GO TO 61-ATC-X
           ELSE
061900     IF VIEW-LASTKEY = 1 OR
062000        VIEW-LASTKEY = 2 OR
062100        VIEW-LASTKEY = 4 OR
062200        VIEW-LASTKEY = 5 OR
062300        VIEW-LASTKEY = 6 OR
062400        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
062600*        *** INVALID FUNCTION KEY ENTERED ***
062700         MOVE   9 TO LANG-SETNUM
062800         MOVE  10 TO LANG-MSGNUM
062900         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
063000         MOVE 5  TO  FIELD-NUMBER
063100         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
063200         GO TO 61-SHOWFORM-SCREEN-2.
065600
065700 61-EDIT-TAX-CODE.
           IF DE-TAX-CODE = SPACES
      *         YOU MUST ENTER A TAX CODE
               MOVE 66164 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 5  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 61-SHOWFORM-SCREEN-2.

065800     MOVE DE-TAX-CODE            TO  TAX-ARG.
           MOVE TAX-ARG TO TAXCDE OF MTAX-REC-O.
           READ MTAX-O INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
066200         IF FILE-STATUS-1 = "2"
066300             NEXT SENTENCE
066400         ELSE
066500             MOVE "GET MTAX * 61-ET" TO BU-DISPLAY-MSG
066600             MOVE TAX-ARG               TO BU-DISPLAY-FLD (1)
066700             GO TO 2-BLOWUP
066800     ELSE
066900*        *** TAX CODE ALREADY EXISTS ***
067000         MOVE  20 TO LANG-SETNUM
067100         MOVE  44 TO LANG-MSGNUM
067200         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
067300         MOVE DE-TAX-CODE  TO  MSG-FLD
067400         MOVE 5        TO  FIELD-NUMBER
067500         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
      *------- DO A START > HIGH-VALUES TO UNLOCK
               MOVE HIGH-VALUES TO TAXCDE OF MTAX-REC-O
               START MTAX-O KEY > TAXCDE OF MTAX-REC-O
                   INVALID KEY MOVE "00" TO FILE-STATUS END-START
067600         GO TO 61-SHOWFORM-SCREEN-2.
067700
067800     PERFORM 66-EDIT-TAX-PCT  THRU  66-ETP-X.
067900     IF ERR-SW = "Y"
068000         GO TO 61-SHOWFORM-SCREEN-2.
068100
068200 61-BUILD-TAX-CODE-DSETS.
070000     MOVE SPACES              TO  BUF-MTAX.
070100     MOVE DE-TAX-CODE         TO  BUILD-TAX-CODE,
070200                                  MTAX-CODE.
070300     MOVE ZEROS               TO  SUB.
070400
070500 61-MOVE-TAX-PERCENT.
070600     ADD 1  TO  SUB.
070700     IF SUB > 4
070800         NEXT SENTENCE
070900     ELSE
071000         MOVE DE-TAX-PERCENT (SUB)     TO  MTAX-PERCENT (SUB)
071100         MOVE DE-TAX-PAY-INDIC (SUB)   TO  MTAX-PAY-INDIC (SUB)
071200         GO TO 61-MOVE-TAX-PERCENT.
071300
           WRITE MTAX-REC-O FROM BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
071700         MOVE "PUT MTAX 61-PTC" TO BU-DISPLAY-MSG
071800         MOVE TAX-ARG           TO BU-DISPLAY-FLD (1)
071900         GO TO 2-BLOWUP.
072000
072100 61-BUILD-MCOMMENT.
072200     MOVE BUILD-TAX-CODE-KEY  TO  MCOM-COMMENT-NO.
           WRITE MCOMMENT-REC-O FROM BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
072600         MOVE "PUT MCOMMENT 61-BM" TO BU-DISPLAY-MSG
072700         MOVE BUILD-TAX-CODE-KEY  TO BU-DISPLAY-FLD (1)
072800         GO TO 2-BLOWUP.
072900
073000     PERFORM 661-ADD-DESC  THRU  661-AD-X.
073100
074000     GO TO 61-ADD-TAX-CODE.
074100
074200 61-ATC-X.
074300     EXIT.
074400
074500*********************************************************
074600*                                                       *
074700*   M O D I F Y   T A X   C O D E S                     *
074800*                                                       *
074900*********************************************************
075000
075100 62-MODIFY-TAX-CODE.
075200     MOVE "TAXENTY3"    TO  VIEW-NFNAME.
076800     MOVE SPACES        TO  SCREEN-2.
076900     MOVE COMPANY-SAVE  TO  DISP-COMPANY-2.
077000     MOVE SAVE-TAX-DISTRICTS  TO  DISP-TAX-DISTRICT-LIST.
           PERFORM 66-ZERO-OUT-PERCENT
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 4.
077700
077800 62-SHOWFORM-SCREEN-3.
           MOVE SCREEN-2       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
079600
079700     IF VIEW-LASTKEY = 3
079800         GO TO 62-MTC-X
079900     ELSE
081300     IF VIEW-LASTKEY = 1 OR
081400        VIEW-LASTKEY = 2 OR
081500        VIEW-LASTKEY = 4 OR
081600        VIEW-LASTKEY = 5 OR
081700        VIEW-LASTKEY = 6 OR
081800        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
082000*        *** INVALID FUNCTION KEY ENTERED ***
082100         MOVE   9 TO LANG-SETNUM
082200         MOVE  10 TO LANG-MSGNUM
082300         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
082400         MOVE 5  TO  FIELD-NUMBER
082500         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
082600         GO TO 62-SHOWFORM-SCREEN-3.
084600
084700 62-EDIT-TAX.
           IF DE-TAX-CODE = SPACES
      *         YOU MUST ENTER A TAX CODE
               MOVE 66164 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 5  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 62-SHOWFORM-SCREEN-3.

084800     MOVE DE-TAX-CODE            TO  TAX-ARG.
           MOVE TAX-ARG TO TAXCDE OF MTAX-REC-O.
           READ MTAX-O INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
085200         IF FILE-STATUS-1 = "2"
085300*            *** TAX CODE DOESN'T EXIST ***
085400             MOVE  20 TO LANG-SETNUM
085500             MOVE   7 TO LANG-MSGNUM
085600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
085700             MOVE DE-TAX-CODE  TO  MSG-FLD
085800             MOVE 5        TO  FIELD-NUMBER
085900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
086000             GO TO 62-SHOWFORM-SCREEN-3
086100         ELSE
086200             MOVE "GET MTAX * 62-ET" TO BU-DISPLAY-MSG
086300             MOVE TAX-ARG          TO BU-DISPLAY-FLD (1)
086400             GO TO 2-BLOWUP.
086500
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO TAXCDE OF MTAX-REC-O.
           START MTAX-O KEY > TAXCDE OF MTAX-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

086600 62-GET-SCREEN-3B.
086700     MOVE "TAXENTY3B"  TO  VIEW-NFNAME.
088200     PERFORM 66-GET-TAX-INFO  THRU  66-GTI-X.
088900
089000 62-SHOWFORM-SCREEN-3B.
           MOVE SCREEN-2       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
091600
091700     IF VIEW-LASTKEY = 3
091800         GO TO 62-MTC-X
091900     ELSE
092000     IF VIEW-LASTKEY = 7
092100         GO TO 62-MODIFY-TAX-CODE
092200     ELSE
093600     IF VIEW-LASTKEY = 1 OR
093700        VIEW-LASTKEY = 2 OR
093800        VIEW-LASTKEY = 4 OR
093900        VIEW-LASTKEY = 5 OR
094000        VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 8
094200*        *** INVALID FUNCTION KEY ENTERED ***
094300         MOVE   9 TO LANG-SETNUM
094400         MOVE  10 TO LANG-MSGNUM
094500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
094600         MOVE 6  TO  FIELD-NUMBER
094700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
094800         GO TO 62-SHOWFORM-SCREEN-3B.
097200
097300     PERFORM 66-EDIT-TAX-PCT  THRU  66-ETP-X.
097400     IF ERR-SW = "Y"
097500         GO TO 62-SHOWFORM-SCREEN-3B.
097600
097700     PERFORM 621-UPDATE-TAX-PERCENT  THRU  621-UTP-X.
097800     IF DE-TAX-DESC  =  SAVE-OLD-TAX-DESC
097900         NEXT SENTENCE
098000     ELSE
098100         PERFORM 66-UPDATE-DESC  THRU  66-UD-X.
098200
098300     GO TO 62-MODIFY-TAX-CODE.
098400
098500 62-MTC-X.
098600     EXIT.
098700
098800 621-UPDATE-TAX-PERCENT.
           MOVE DE-TAX-CODE TO TAXCDE OF MTAX-REC-O.
           READ MTAX-O INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
085200         IF FILE-STATUS-1 = "2"
                   GO TO 621-UTP-X
086100         ELSE
086200             MOVE "GET MTAX * 621-UTP" TO BU-DISPLAY-MSG
086300             MOVE TAX-ARG          TO BU-DISPLAY-FLD (1)
086400             GO TO 2-BLOWUP.
100000     MOVE ZEROS               TO  SUB.
100100
100200 621-MOVE-TAX-PERCENT.
100300     ADD 1  TO  SUB.
100400     IF SUB > 4
100500         NEXT SENTENCE
100600     ELSE
100700         MOVE DE-TAX-PERCENT (SUB)     TO  MTAX-PERCENT (SUB)
100800         MOVE DE-TAX-PAY-INDIC (SUB)   TO  MTAX-PAY-INDIC (SUB)
100900         GO TO 621-MOVE-TAX-PERCENT.
101000
           REWRITE MTAX-REC-O FROM BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
101400         MOVE "UPDATE 621-UPD-TAX-PCT" TO BU-DISPLAY-MSG
101500         MOVE TAX-ARG  TO  BU-DISPLAY-FLD (1)
101600         GO TO 2-BLOWUP.
101700
102500 621-UTP-X.
102600     EXIT.
102700
102800
102900*********************************************************
103000*                                                       *
103100*   D E L E T E   T A X   C O D E                       *
103200*                                                       *
103300*********************************************************
103400
103500 63-DELETE-TAX-CODE.
103600     MOVE "TAXENTY4"  TO  VIEW-NFNAME.
105200     MOVE SPACES        TO  SCREEN-2.
105300     MOVE COMPANY-SAVE TO  DISP-COMPANY-2.
105400     MOVE SAVE-TAX-DISTRICTS  TO  DISP-TAX-DISTRICT-LIST.
           PERFORM 66-ZERO-OUT-PERCENT
               VARYING SUB FROM 1 BY 1 UNTIL SUB > 4.
106100
106200 63-SHOWFORM-SCREEN-4.
           MOVE SCREEN-2       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
108000
108100     IF VIEW-LASTKEY = 3
108200         GO TO 63-DTC-X
108300     ELSE
109700     IF VIEW-LASTKEY = 1 OR
109800        VIEW-LASTKEY = 2 OR
109900        VIEW-LASTKEY = 4 OR
110000        VIEW-LASTKEY = 5 OR
110100        VIEW-LASTKEY = 6 OR
110200        VIEW-LASTKEY = 7 OR
              VIEW-LASTKEY = 8
110400*        *** INVALID FUNCTION KEY ENTERED ***
110500         MOVE   9 TO LANG-SETNUM
110600         MOVE  10 TO LANG-MSGNUM
110700         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
110800         MOVE 5  TO  FIELD-NUMBER
110900         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
111000         GO TO 63-SHOWFORM-SCREEN-4.
111100
113100 63-EDIT-TAX.
           IF DE-TAX-CODE = SPACES
      *         YOU MUST ENTER A TAX CODE
               MOVE 66164 TO CATREAD-MSG-NUMBER
069800         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
069900         MOVE 5  TO FIELD-NUMBER
070000         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
070100         GO TO 63-SHOWFORM-SCREEN-4.

084800     MOVE DE-TAX-CODE            TO  TAX-ARG.
           MOVE TAX-ARG TO TAXCDE OF MTAX-REC-O.
           READ MTAX-O INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
085200         IF FILE-STATUS-1 = "2"
085300*            *** TAX CODE DOESN'T EXIST ***
085400             MOVE  20 TO LANG-SETNUM
085500             MOVE   7 TO LANG-MSGNUM
085600             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
085700             MOVE DE-TAX-CODE  TO  MSG-FLD
085800             MOVE 5        TO  FIELD-NUMBER
085900             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
086000             GO TO 63-SHOWFORM-SCREEN-4
086100         ELSE
086200             MOVE "GET MTAX * 63-ET" TO BU-DISPLAY-MSG
086300             MOVE TAX-ARG          TO BU-DISPLAY-FLD (1)
086400             GO TO 2-BLOWUP.
086500
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO TAXCDE OF MTAX-REC-O.
           START MTAX-O KEY > TAXCDE OF MTAX-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
114900
115000 63-GET-SCREEN-4B.
115100     MOVE "TAXENTY4B"  TO  VIEW-NFNAME.
116600     PERFORM 66-GET-TAX-INFO  THRU  66-GTI-X.
117300
117400 63-SHOWFORM-SCREEN-4B.
           MOVE SCREEN-2       TO DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN THRU 998-READ-SCREEN.
           MOVE DISPLAY-REC    TO SCREEN-2.
119600
119700     IF VIEW-LASTKEY = 3
119800         GO TO 63-DTC-X
119900     ELSE
120000     IF VIEW-LASTKEY = 7
120100         GO TO 63-DELETE-TAX-CODE
120200     ELSE
121600     IF VIEW-LASTKEY = 1 OR
121700        VIEW-LASTKEY = 2 OR
121800        VIEW-LASTKEY = 4 OR
121900        VIEW-LASTKEY = 5 OR
122000        VIEW-LASTKEY = 6 OR
              VIEW-LASTKEY = 8
122200*        *** INVALID FUNCTION KEY ENTERED ***
122300         MOVE   9 TO LANG-SETNUM
122400         MOVE  10 TO LANG-MSGNUM
122500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
122600         MOVE 99  TO FIELD-NUMBER
122700         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
122800         GO TO 63-SHOWFORM-SCREEN-4B.
125200
125300 63-DELETE-TAX-DSETS.
127100     PERFORM 661-DELETE-OLD-DESC  THRU  661-DOD-X.
127200
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O KEY > MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.

           MOVE COMMENT-ARG TO MCOMCOMMNT OF MCOMMENT-REC-O.
           READ MCOMMENT-O INTO BUF-MCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
127600         MOVE "GET MCOMMENT 63-DTD" TO BU-DISPLAY-MSG
127700         MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
127800         GO TO 2-BLOWUP.
127900
           DELETE MCOMMENT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
128300         MOVE "DELETE MCOMMENT 63-DTD" TO BU-DISPLAY-MSG
128400         MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
128500         GO TO 2-BLOWUP.
128600
           MOVE TAX-ARG TO TAXCDE OF MTAX-REC-O.
           READ MTAX-O INTO BUF-MTAX
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
129000         MOVE "GET MTAX 63-DTD" TO BU-DISPLAY-MSG
129100         MOVE TAX-ARG  TO  BU-DISPLAY-FLD (1)
129200         GO TO 2-BLOWUP.
129300
           DELETE MTAX-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
129700         MOVE "DELETE MTAX 63-DTD" TO BU-DISPLAY-MSG
129800         MOVE TAX-ARG  TO  BU-DISPLAY-FLD (1)
129900         GO TO 2-BLOWUP.
130000
130800     GO TO 63-DELETE-TAX-CODE.
131000
131100 63-DTC-X.
131200     EXIT.
131300
       66-ZERO-OUT-PERCENT.
           MOVE ZEROS TO DE-TAX-PERCENT (SUB).

       66-ZOP-X.
           EXIT.
131400
131500 66-EDIT-TAX-PCT.
131600     MOVE ZEROS         TO  SUB.
131700     MOVE "N"           TO  ERR-SW.
131800
131900 66-EDIT-TAX-PCT-LOOP.
132000     ADD 1              TO  SUB.
132100     IF SUB > 4
132200         GO TO 66-EDIT-TAX-DESC.
132300
132400     IF DE-TAX-PERCENT (SUB)  >  ZEROS
132500         IF DISP-TAX-DIST (SUB)  =  SPACES
132600*            *** TAX PERCENT MUST BE SPACES; NO TAX DISTRICT EXISTS***
132700             MOVE  20 TO LANG-SETNUM
132800             MOVE  43 TO LANG-MSGNUM
132900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
133000             MULTIPLY  SUB  BY 2  GIVING FIELD-NUMBER
133100             ADD 4   TO  FIELD-NUMBER
133200             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
133300             MOVE "Y"  TO  ERR-SW
133400             GO TO 66-ETP-X.
133500
133600     IF DE-TAX-PERCENT (SUB) > ZEROS
133700         IF DE-TAX-PAY-INDIC (SUB) = SPACES
133800*            *** YOU MUST ENTER A PAYMENT INDICATOR OF 'P' OR 'A'***
133900             MOVE  25 TO LANG-SETNUM
134000             MOVE  19 TO LANG-MSGNUM
134100             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
134200             ADD 19, SUB  GIVING FIELD-NUMBER
134300             PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
134400             MOVE "Y"  TO  ERR-SW
134500             GO TO 66-ETP-X.
134600
134700     GO TO 66-EDIT-TAX-PCT-LOOP.
134800
134900 66-EDIT-TAX-DESC.
135000     IF DE-TAX-DESC = SPACES
135100*        *** YOU MUST ENTER A LEAST ONE LINE OF TAX DESCRIPTION ***
135200         MOVE  25 TO LANG-SETNUM
135300         MOVE  20 TO LANG-MSGNUM
135400         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
135500         MOVE 14  TO  FIELD-NUMBER
135600         PERFORM 4-PGM-ERROR  THRU  4-PGM-ERROR-X
135700         MOVE "Y"  TO  ERR-SW.
135800
135900 66-ETP-X.
136000     EXIT.
136100
136200 66-GET-TAX-INFO.
136300     MOVE ZEROS                 TO  SUB.
136400
136500 66-MOVE-TAX-PERCENT-LOOP.
136600     ADD 1  TO  SUB.
136700     IF SUB > 4
136800         NEXT SENTENCE
136900     ELSE
137000         MOVE MTAX-PERCENT (SUB)    TO  DE-TAX-PERCENT (SUB)
137100         MOVE MTAX-PAY-INDIC (SUB)  TO  DE-TAX-PAY-INDIC (SUB)
137200         GO TO 66-MOVE-TAX-PERCENT-LOOP.
137300
137400     MOVE ZEROS                 TO  SUB.
137500     MOVE SPACES                TO  SAVE-OLD-TAX-DESC.
137600     MOVE TAX-ARG               TO  BUILD-TAX-CODE.
137700     MOVE BUILD-TAX-CODE-KEY    TO  COMMENT-ARG.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 66-MOVE-DESC-TO-SCREEN
               ELSE
138100             MOVE "DBFIND 66-GTI" TO BU-DISPLAY-MSG
138200             MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
138300             GO TO 2-BLOWUP.
138400
138500 66-GET-TAX-DESC-LOOP.
           READ DCOMMENT-O NEXT INTO BUF-DCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   GO TO 66-MOVE-DESC-TO-SCREEN
               ELSE
139200             MOVE "GET DCOMMENT 66-GTDL" TO BU-DISPLAY-MSG
139300             MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
139400             GO TO 2-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-REC-O NOT = COMMENT-ARG
               GO TO 66-MOVE-DESC-TO-SCREEN.
139500
139600     ADD 1  TO  SUB.
139700     IF SUB > 6
139800         GO TO 66-MOVE-DESC-TO-SCREEN.
139900     MOVE EXP-DATA-COMMENT  TO  TAX-DESC-LINE (SUB).
140000     GO TO 66-GET-TAX-DESC-LOOP.
140100
140200 66-MOVE-DESC-TO-SCREEN.
140300     MOVE SAVE-OLD-TAX-DESC  TO  DE-TAX-DESC.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O KEY > MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
140400
140500 66-GTI-X.
140600     EXIT.
140700
140800 66-UPDATE-DESC.
142000     PERFORM 661-DELETE-OLD-DESC  THRU  661-DOD-X.

           MOVE HIGH-VALUES TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O KEY > MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE "00" TO FILE-STATUS.
142100
142200     PERFORM 661-ADD-DESC  THRU  661-AD-X.
143000
143100 66-UD-X.
143200     EXIT.
143300
143400 661-DELETE-OLD-DESC.
143500     MOVE BUILD-TAX-CODE-KEY    TO  COMMENT-ARG.
           MOVE COMMENT-ARG TO MCOMCOMMNT OF DCOMMENT-REC-O.
           START DCOMMENT-O KEY = MCOMCOMMNT OF DCOMMENT-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   GO TO 661-DOD-X
               ELSE
138100             MOVE "DBFIND DCOMMENT 661-DOD" TO BU-DISPLAY-MSG
138200             MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
138300             GO TO 2-BLOWUP.
144200
144300 661-GET-TAX-DESC-LOOP.
           READ DCOMMENT-O NEXT INTO BUF-DCOMMENT
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14"
                   GO TO 661-DOD-X
               ELSE
145000             MOVE "GET DCOMMENT 661-GTDL" TO BU-DISPLAY-MSG
139300             MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
139400             GO TO 2-BLOWUP.
           IF MCOMCOMMNT OF DCOMMENT-REC-O NOT = COMMENT-ARG
               GO TO 661-DOD-X.
145300
           DELETE DCOMMENT-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
145700         MOVE "DELETE DCOMMENT 661-GTDL" TO BU-DISPLAY-MSG
145800         MOVE COMMENT-ARG  TO  BU-DISPLAY-FLD (1)
145900         GO TO 2-BLOWUP.
146000
146100     GO TO 661-GET-TAX-DESC-LOOP.
146200
146300 661-DOD-X.
146400     EXIT.
146500
146600 661-ADD-DESC.
146700     MOVE SPACES                TO  BUF-DCOMMENT.
146800     MOVE BUILD-TAX-CODE-KEY    TO  DCOM-COMMENT-NO.
146900     MOVE BEGIN-EXP-PRINT       TO  EXP-PRT-START.
147000     MOVE END-EXP-PRINT         TO  EXP-PRT-STOP.
147100     MOVE ZEROS                 TO  SUB,
147200                                    TAX-LINE-SUB.
147300
147400 661-PUT-DCOMMENT.
147500     ADD 1  TO  SUB.
147600     IF SUB > 6
147700         GO TO 661-AD-X.
147800     IF DE-TAX-DESC-LINE (SUB) = SPACES
147900         GO TO 661-PUT-DCOMMENT.
148000     MOVE DE-TAX-DESC-LINE (SUB)  TO  EXP-DATA-COMMENT.
148100     ADD 1  TO  TAX-LINE-SUB.
148200     MOVE TAX-LINE-SUB            TO  DCOM-LINE-NO.
           WRITE DCOMMENT-REC-O FROM BUF-DCOMMENT
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
148600         MOVE "PUT DCOMMENT 661-PD" TO BU-DISPLAY-MSG
148700         MOVE BUILD-TAX-CODE-KEY   TO BU-DISPLAY-FLD (1)
148800         GO TO 2-BLOWUP.
148900
149000     GO TO 661-PUT-DCOMMENT.
149100
149200 661-AD-X.
149300     EXIT.
149400
       COPY DISPCALL IN COPYLIB.
149500
149600 999-CATREAD.
           IF CATREAD-MSG-NUMBER = ZEROS
               MOVE LANG-SETNUM TO CATREAD-MSG-SET
               MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
151200 999-CATREAD-EXIT.
151300     EXIT.
