       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TTRANSFM.
       AUTHOR.                 R L ENSMINGER.
       INSTALLATION.           GTR.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FILE1
               ASSIGN TO DATABASE-MCFLMM0101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT FILE2
               ASSIGN TO DATABASE-MCFLMM1101
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE3
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE4
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE5
               ASSIGN TO DATABASE-MCFLMM4404
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE6
               ASSIGN TO DATABASE-MCFLMM2302
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE7
               ASSIGN TO DATABASE-MCFLMM2403
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE8
               ASSIGN TO DATABASE-MCFLMM2601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE9
               ASSIGN TO DATABASE-MCFLMM1801
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT FILE11
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS PFKEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  FILE1
           LABEL RECORDS ARE STANDARD.
       01  REC1.
           COPY DDS-ALL-FORMATS OF MCFLMM0101.

       FD  FILE2
           LABEL RECORDS ARE STANDARD.
       01  REC2.
           COPY DDS-ALL-FORMATS OF MCFLMM1101.

       FD  FILE3
           LABEL RECORDS ARE STANDARD.
       01  REC3.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.

       FD  FILE4
           LABEL RECORDS ARE STANDARD.
       01  REC4.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.

       FD  FILE5
           LABEL RECORDS ARE STANDARD.
       01  REC5.
           COPY DDS-ALL-FORMATS OF MCFLMM4404.

       FD  FILE6
           LABEL RECORDS ARE STANDARD.
       01  REC6.
           COPY DDS-ALL-FORMATS OF MCFLMM2302.

       FD  FILE7
           LABEL RECORDS ARE STANDARD.
       01  REC7.
           COPY DDS-ALL-FORMATS OF MCFLMM2403.

       FD  FILE8
           LABEL RECORDS ARE STANDARD.
       01  REC8.
           COPY DDS-ALL-FORMATS OF MCFLMM2601.

       FD  FILE9
           LABEL RECORDS ARE STANDARD.
       01  REC9.
           COPY DDS-ALL-FORMATS OF MCFLMM1801.

       FD  FILE11
           LABEL RECORDS ARE STANDARD.
       01  REC11.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.

       WORKING-STORAGE SECTION.
       01  COND-CODE             PIC X.

       01  CDATE-CN.
           05 CC                 PIC 99.
           05  CDATE.
               10 YY             PIC 99.
               10 MM             PIC 99.
               10 DD             PIC 99.

       01  CTIME.
           05 HH                 PIC 99.
           05 MN                 PIC 99.
           05 FILLER             PIC X(4).

       01  CHG-LABOR-SW          PIC X VALUE "N".
       01  CHG-PARTS-SW          PIC X VALUE "N".
       01  CHG-TRACK-SW          PIC X VALUE "N".
       01  CHG-PMS-SW            PIC X VALUE "N".
       01  CHG-MESS-SW           PIC X VALUE "N".
       01  CHG-SCHED-SW          PIC X VALUE "N".
       01  CHG-JOB-SW            PIC X VALUE "N".
       01  CHG-PWO-SW            PIC X VALUE "N".
       01  DEL-PLNND-SW          PIC X VALUE "N".

       01  DBPARAMETERS.
           COPY DBPARMS OF COPYLIB.

       01  ERROR-SWITCH          PIC S9(4) COMP-4.
       01  FILE-STATUS           PIC XX.
       01  JOB-CMP-SEQ           PIC 9999.

       01  JOBPLAN-KEY.
           05 JOBP-WO-NO         PIC X(10).
           05 JOBP-SEQ-NO        PIC 999.
           05 FILLER             PIC X.

       01  JOBPLAN-DATA.
           COPY DJOBPLAN OF COPYLIB.

       01  PFKEY                 PIC 9(9).

       01  PLANT-DATA.
           COPY MLASTWO  OF COPYLIB.

       COPY DBSTAT   OF COPYLIB.

       01  WHO-VARIABLES.
           05 CURLIB             PIC X(10).
           05 TERMID             PIC X(10).
           05 USRNAME            PIC X(10).
           05 JOBLIBX            PIC X.

       01  WO-PARTS-DATA.
           COPY DWOPARTS OF COPYLIB.

       01  WO-LABOR-DATA.
           COPY DWOLABOR OF COPYLIB.

       01  WO-SCHEDULE-DATA.
           COPY DWOSCHED OF COPYLIB.

       01  WO-MESSAGE-DATA.
           COPY DWOMSG   OF COPYLIB.

       01  WO-TRACKING-DATA.
           COPY DWOTRACK OF COPYLIB.

       01  WONUM-SAVE.
           05 WONUM7             PIC X(7).
           05 WONUM3             PIC X(3).

       LINKAGE SECTION.
       01  WO-PLANNED-DATA.
           COPY DWOPLAN OF COPYLIB.

       PROCEDURE DIVISION USING  WO-PLANNED-DATA.
       BEGIN-CHANGE.
           PERFORM 0-INIT.
           PERFORM 1-ADD.
           PERFORM 6-MAIN.

       2-EOJ.
           CLOSE FILE1 FILE2 FILE3 FILE4 FILE5
                 FILE6 FILE7 FILE8 FILE9 FILE11.
           GOBACK.

       EJECT
       0-INIT.
           OPEN I-O FILE1 FILE2 FILE3 FILE4 FILE5
                    FILE6 FILE7 FILE8 FILE9.
           OPEN INPUT FILE11.

           MOVE "N" TO CHG-LABOR-SW CHG-PARTS-SW CHG-TRACK-SW
                       CHG-PMS-SW   CHG-MESS-SW  CHG-SCHED-SW
                       CHG-JOB-SW   CHG-PWO-SW   DEL-PLNND-SW.

           CALL "CLWHO" USING USRNAME TERMID CURLIB JOBLIBX.

           MOVE SPACES         TO WO-TRACKING-DATA.
           MOVE "TTRANSFM"     TO PROGRAM-NAME.
           MOVE "OO"           TO WO-STATUS-TRACK.
           MOVE "MM"           TO WO-TYPE-STATUS.
           MOVE USRNAME        TO USER-NAME.
           MOVE TERMID         TO USER-TERM.

           MOVE WO-NUM-PLANNED TO WONUM-SAVE.

           MOVE 1              TO PFKEY DATE-FLAG.
           READ FILE11         INTO PLANT-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               MOVE DATE-FLAG-SW TO DATE-FLAG.

       1-ADD.
           MOVE "001"          TO WO-NUM-SUFF-P.

           CALL "TADDWOII" USING DBPARAMETERS
                                 STATUS-AREA
                                 WO-PLANNED-DATA
                                 COND-CODE
                                 ERROR-SWITCH.

           MOVE SPACES         TO WO-PLANNED-DATA.

           MOVE WONUM-SAVE     TO WO-NUM-PLANNED.
           MOVE "000"          TO WO-NUM-SUFF-P.
           MOVE "OO"           TO WO-STATUS-P.

           ACCEPT CDATE        FROM DATE.
           MOVE 20             TO CC.
           IF YY > 70
               MOVE 19         TO CC.
           ACCEPT CTIME        FROM TIME.

           MOVE CDATE-CN       TO DATE-RECD-P-CN.
           MOVE CTIME          TO TIME-RECD-P.
           MOVE "U"            TO APPROVAL-CODE-P.
           MOVE "MM"           TO WO-START-STATUS.
           MOVE "001"          TO LAST-SUFFIX-INIT.

           CALL "TADDWOII" USING DBPARAMETERS
                                 STATUS-AREA
                                 WO-PLANNED-DATA
                                 COND-CODE
                                 ERROR-SWITCH.

           MOVE WO-NUM-PLANNED TO WO-NUM-TRACK.
           MOVE CDATE-CN       TO DATE-STAMP-CN.
           MOVE CTIME          TO TIME-STAMP.
           CALL "TWOTRACK"     USING WO-TRACKING-DATA.

       6-MAIN.
           MOVE WONUM-SAVE     TO WONUM OF REC3.

           START FILE3         KEY IS = WONUM OF REC3
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 61-CHANGE-PARTS THRU 61-CP-EXIT
                               UNTIL CHG-PARTS-SW = "Y".

      ************************************************************

           MOVE WONUM-SAVE     TO WONUM OF REC4.

           START FILE4         KEY IS = WONUM OF REC4
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 62-CHANGE-LABOR THRU 62-CL-EXIT
                               UNTIL CHG-LABOR-SW = "Y".

      ************************************************************

           MOVE WONUM-SAVE     TO WONUM OF REC5.

           START FILE5         KEY IS = WONUM OF REC5
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 63-CHANGE-PMS THRU 63-CP-EXIT
                               UNTIL CHG-PMS-SW = "Y".

      ************************************************************

           MOVE WONUM-SAVE     TO WONUM OF REC6.

           START FILE6         KEY IS = WONUM OF REC6
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 64-CHANGE-SCHED THRU 64-CS-EXIT
                               UNTIL CHG-SCHED-SW = "Y".

      ************************************************************

           MOVE WONUM-SAVE     TO TOWO OF REC7.

           START FILE7         KEY IS = TOWO OF REC7
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 65-CHANGE-MESS THRU 65-CM-EXIT
                               UNTIL CHG-MESS-SW = "Y".

      ************************************************************

           MOVE WONUM-SAVE     TO WONUM OF REC8.

           START FILE8         KEY IS = WONUM OF REC8
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM 66-CHANGE-TRACKING THRU 66-CT-EXIT
                               UNTIL CHG-TRACK-SW = "Y".

      ************************************************************

           MOVE SPACES         TO JOBPLAN-KEY.
           MOVE WONUM-SAVE     TO JOBP-WO-NO.
           MOVE 0              TO JOBP-SEQ-NO.
           MOVE JOBPLAN-KEY    TO JOBPWOSEQ.

           START FILE9         KEY IS GREATER THAN JOBPWOSEQ
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
             PERFORM CHANGE-JOBPLAN THRU CJ-EXIT
                               UNTIL CHG-JOB-SW = "Y".

      ************************************************************

           PERFORM DELETE-NUMBER THRU DN-EXIT.

       61-CHANGE-PARTS.
           READ FILE3          NEXT INTO WO-PARTS-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-PARTS-SW
             GO TO 61-CP-EXIT.

           IF PRT-WO-NU NOT = WONUM-SAVE
             REWRITE           REC3
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-PARTS-SW
             GO TO 61-CP-EXIT.

           MOVE "001"          TO PRT-WO-NUM-SUFFIX.

           REWRITE REC3        FROM WO-PARTS-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE3"
             GO TO 2-EOJ.

       61-CP-EXIT.             EXIT.

       62-CHANGE-LABOR.
           READ FILE4          NEXT INTO WO-LABOR-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-LABOR-SW
             GO TO 62-CL-EXIT.

           IF LBR-WO-NUM NOT = WONUM-SAVE
             REWRITE           REC4
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-LABOR-SW
             GO TO 62-CL-EXIT.

           MOVE "001"          TO LBR-WO-NUM-SUFFIX.

           REWRITE REC4        FROM WO-LABOR-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE4"
             GO TO 2-EOJ.

       62-CL-EXIT.             EXIT.

       63-CHANGE-PMS.
           READ FILE5          NEXT RECORD
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-PMS-SW
             GO TO 63-CP-EXIT.

           IF WONUM OF REC5 NOT = WONUM-SAVE
             REWRITE           REC5
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-PMS-SW
             GO TO 63-CP-EXIT.

           STRING WONUM7 "001" DELIMITED BY SIZE INTO WONUM OF REC5.

           REWRITE             REC5
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE5"
             GO TO 2-EOJ.

       63-CP-EXIT.             EXIT.

       64-CHANGE-SCHED.
           READ FILE6          NEXT INTO WO-SCHEDULE-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-SCHED-SW
             GO TO 64-CS-EXIT.

           IF SCHED-WO NOT = WONUM-SAVE
             REWRITE           REC6
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-SCHED-SW
             GO TO 64-CS-EXIT.

           STRING WONUM7 "001" DELIMITED BY SIZE INTO SCHED-WO.

           REWRITE REC6        FROM WO-SCHEDULE-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE6"
             GO TO 2-EOJ.

       64-CS-EXIT.             EXIT.

       65-CHANGE-MESS.
           READ FILE7          NEXT INTO WO-MESSAGE-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-MESS-SW
             GO TO 65-CM-EXIT.

           IF TO-WO NOT = WONUM-SAVE
             REWRITE           REC7
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-MESS-SW
             GO TO 65-CM-EXIT.

           MOVE "001"          TO TO-WO-SUF.

           REWRITE REC7        FROM WO-MESSAGE-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE7"
             GO TO 2-EOJ.

       65-CM-EXIT.             EXIT.

       66-CHANGE-TRACKING.
           READ FILE8          NEXT INTO WO-TRACKING-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-TRACK-SW
             GO TO 66-CT-EXIT.

           IF WO-NUM-TRACK NOT = WONUM-SAVE
             REWRITE           REC8
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-TRACK-SW
             GO TO 66-CT-EXIT.

           MOVE "001"          TO WO-NUM-SUFF-TRACK.

           REWRITE REC8        FROM WO-TRACKING-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE8"
             GO TO 2-EOJ.

       66-CT-EXIT.             EXIT.

       CHANGE-JOBPLAN.
           READ FILE9          NEXT INTO JOBPLAN-DATA
               AT END          MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             MOVE "Y"          TO CHG-JOB-SW
             GO TO CJ-EXIT.

           IF JOBPLAN-WO-NO NOT = WONUM-SAVE
             REWRITE           REC9
                 INVALID KEY   MOVE FILE-STATUS TO FILE-STATUS
             END-REWRITE
             MOVE "Y"          TO CHG-JOB-SW
             GO TO CJ-EXIT.

           STRING WONUM7 "001" DELIMITED BY SIZE INTO JOBPLAN-WO-NO.

           REWRITE REC9        FROM JOBPLAN-DATA
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON MODIFY TO FILE9"
             GO TO 2-EOJ.

       CJ-EXIT.                EXIT.

       DELETE-NUMBER.
           MOVE WONUM-SAVE     TO WONUM OF REC1 WONUM OF REC2.

           DELETE              FILE1
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON DELETE TO FILE1"
             GO TO 2-EOJ.

           DELETE              FILE2
               INVALID KEY     MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
             DISPLAY "ERROR: FILE STATUS = "
                               FILE-STATUS " ON DELETE TO FILE2"
             GO TO 2-EOJ.

           MOVE "OK"           TO WO-STATUS-P.

       DN-EXIT.                EXIT.

