000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.           TTRANCHK.
000400 AUTHOR.               K MOVSESIAN.
000500 DATE-WRITTEN.         MAR 17, 1988.
000600*INSTALLATION.         GOODYEAR TIRE AND RUBBER CO.
000800*REMARKS.
001000**************************************************************
001100*                                                            *
001200*   T T R A N C H K    THIS PROGRAM CHECKS THE DETAIL        *
001300*    TRANSACTIONS (DTRANS) IN CSAS FOR THE FOLLOWING INVALID *
001400*    ACCOUNTING INFORMATION:                                 *
001500*        CLASS - SHOULD NEVER BE '000' OR BLANK              *
001600*        DEPT  - SHOULD NEVER BE BLANK                       *
001700*                SHOULD NEVER BE '0000' IF ADDITIONAL DATA   *
001800*                    IS LESS THAN '010000'                   *
001900*                SHOULD BE '0000' IF ADDITIONAL DATA IS      *
002000*                    GREATER THAN '009999'                   *
002100*        ACCOUNT - SHOULD NEVER BE BLANK                     *
002200*                  SHOULD NEVER BE '000000' UNLESS THE DEPT  *
002300*                      TYPE IS 'PR' (PROCESS) OR             *
002400*                              'MU' (UTILITY)                *
002500*                              'MS' (MISC)                   *
002600*    THE TRANSACTIONS CHECKED ARE 'ISS', 'RET', 'RETV',      *
002700*        'SADJ', 'AADJ', 'INV' (NON-STORES), 'DCHG'          *
002800*    ONLY MONTH TO DATE TRANSACTIONS ARE CHECKED (NO 'PROC'  *
002900*        TCs IN DOCUMENT NUM)                                *
003000*                                                            *
003100**************************************************************
      *C
      *C   07MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   05SEP1996    DAVE PLUM
      *C     REVISED PROGRAM FOR CENTURY DATABASE CHANGES.

003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.      HP-3000.
003700 OBJECT-COMPUTER.      HP-3000.
       COPY SPECIALN IN COPYLIB.
003900
004000 INPUT-OUTPUT SECTION.
004100 FILE-CONTROL.
           SELECT MACCOUNT-INFO-IK-I
               ASSIGN TO DATABASE-MCFLCA0101
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DTRANS-MC-I
               ASSIGN TO DATABASE-MCFLCA0701
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.

           SELECT MCHT-ACCTS-DP-I
               ASSIGN TO DATABASE-MCFLCA0301
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

           SELECT SORT-FILE  ASSIGN TO DISK-SORT.

004600 DATA DIVISION.
004800 FILE SECTION.
004900
005000 FD  ONLINE-PRT
005100     DATA RECORD IS PRT-REC
005200     RECORD CONTAINS 133 CHARACTERS
005300     LABEL RECORDS ARE OMITTED.
005400
005500 01  PRT-REC                       PIC X(133).
005600
005700 SD  SORT-FILE
005800     DATA RECORD IS SORT-REC
005900     RECORD CONTAINS 91  CHARACTERS.
006000
006100 01  SORT-REC.
006200     05  SORT-CLASS               PIC X(4).
006300     05  SORT-DEPT                PIC X(6).
006400     05  SORT-ACCT                PIC X(6).
006500     05  SORT-MATL-CODE           PIC X(8).
006600     05  SORT-TRANS-CODE          PIC X(4).
006700     05  SORT-DOCUMENT-NUM        PIC X(12).
006800     05  SORT-PO-NUM              PIC X(10).
006900     05  SORT-ITEM-NUM            PIC X(4).
007000     05  SORT-QTY                 PIC S9(10).
007100     05  SORT-UNIT-MEASURE        PIC XX.
007200     05  SORT-VALUE               PIC S9(12)V99.
007300     05  SORT-DATE.
               10 SORT-DATE-CC          PIC X(2).
               10 SORT-DATE-YYMMDD      PIC X(6).
007400     05  SORT-CLASS-ERR-SW        PIC X.
007500     05  SORT-DEPT-ERR-SW         PIC X.
007600     05  SORT-ACCT-ERR-SW         PIC X.
007700
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MACCOUNT-INFO-IK-I
           LABEL RECORDS ARE STANDARD.
       01  MACCOUNT-INFO-IK-REC-I.
           COPY DDS-MCRPCA0100  OF MCFLCA0101.

       FD  DTRANS-MC-I
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-MC-REC-I.
           COPY DDS-MCRPCA0700  OF MCFLCA0701.

       FD  MCHT-ACCTS-DP-I
           LABEL RECORDS ARE STANDARD.
       01  MCHT-ACCTS-DP-REC-I.
           COPY DDS-MCRPCA0300  OF MCFLCA0301.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*

007800 WORKING-STORAGE SECTION.
007900
008000 77  NO-MORE-SORT                 PIC XXX    VALUE SPACES.
008100 77  LINE-CNT                     PIC 99     VALUE 0.
008200 77  PAGE-CNT                     PIC 9(4)   VALUE 0.
008300 77  PREV-CLASS                   PIC X(4)   VALUE SPACES.
008400 77  SAVE-STR-DEPT                PIC X(6)   VALUE SPACES.
008500 77  AT-LEAST-ONE-FOUND           PIC X(1)   VALUE SPACES.
008600 77  ERR-SW                       PIC X(1)   VALUE SPACES.
       77  MCXCBLERR-SCOPE              PIC X(1)   VALUE "C".
008700
008800 COPY TDATECHK IN COPYLIB.
008900
009000 01  MONTH-YEAR.
009100     05  MONTH-PARM               PIC 99    VALUE ZEROS.
009200     05  YEAR-PARM                PIC 99    VALUE ZEROS.
009300
009400 01  MONTH-TABLE.
009500     05  FILLER                   PIC X(9)  VALUE "JANUARY".
009600     05  FILLER                   PIC X(9)  VALUE "FEBRUARY".
009700     05  FILLER                   PIC X(9)  VALUE "MARCH".
009800     05  FILLER                   PIC X(9)  VALUE "APRIL".
009900     05  FILLER                   PIC X(9)  VALUE "MAY".
010000     05  FILLER                   PIC X(9)  VALUE "JUNE".
010100     05  FILLER                   PIC X(9)  VALUE "JULY".
010200     05  FILLER                   PIC X(9)  VALUE "AUGUST".
010300     05  FILLER                   PIC X(9)  VALUE "SEPTEMBER".
010400     05  FILLER                   PIC X(9)  VALUE "OCTOBER".
010500     05  FILLER                   PIC X(9)  VALUE "NOVEMBER".
010600     05  FILLER                   PIC X(9)  VALUE "DECEMBER".
010700
010800 01  MONTH-TAB REDEFINES MONTH-TABLE.
010900     05  MONTH-T OCCURS 12 TIMES    PIC X(9).
011000
011100************************************************************
011200**     REPORT PRINT LINES                                 **
011300************************************************************
011400
011500 01  HEADER1.
011600     05  FILLER                     PIC X(5)   VALUE SPACES.
011700     05  FILLER                     PIC X(40)
011800         VALUE "TTRANCHK".
011900     05  FILLER                     PIC X(69)
012000         VALUE "CORPORATE STORES ACCOUNTING SYSTEM".
012100     05  FILLER                     PIC X(5)   VALUE "DATE ".
012200     05  DATE-H1                    PIC X(8)   VALUE SPACES.
012300
012400 01  HEADER2.
012500     05  FILLER                     PIC X(5)   VALUE SPACES.
012600     05  FILLER                     PIC X(6)   VALUE "PAGE".
012700     05  PAGE-H2                    PIC ZZZ9   VALUE ZERO.
012800     05  FILLER                     PIC X(29)  VALUE SPACES.
012900     05  FILLER                     PIC X(70)
013000         VALUE "TRANSACTION ACCOUNTING CHECK".
013100     05  FILLER                     PIC X(5)   VALUE "TIME ".
013200     05  TIME-H2                    PIC X(8)   VALUE SPACES.
013300
013400 01  HEADER3.
013500     05  FILLER                    PIC X(53)   VALUE SPACES.
013600     05  MONTH-H3                  PIC X(9)    VALUE SPACES.
013700     05  FILLER                    PIC X(3)    VALUE SPACES.
013800     05  YEAR-H3A                  PIC X(2)    VALUE "20".
013900     05  YEAR-H3B                  PIC X(2)    VALUE SPACES.
014000
014100 01  HEADER4.
014200     05  FILLER                    PIC X(24)
014300         VALUE "CLASS  MATL CODE   DEPT ".
014400     05  FILLER                    PIC X(25)
014500         VALUE "ACCOUNT  TRANS   DOCUMENT".
014600     05  FILLER                    PIC X(26)
014700         VALUE "       P.O. NUMBER  ITEM  ".
014800     05  FILLER                    PIC X(26)
014900         VALUE "TRANS DATE    QUANTITY  UM".
015000     05  FILLER  PIC X(12) VALUE SPACES.
015100     05  FILLER                    PIC X(5)
015200         VALUE "VALUE".
015300
015400 01  BLANK-LINE                     PIC X(133)  VALUE SPACES.
015500
015600 01  DETAIL-LINE.
015700     05  FILLER                   PIC X(2)  VALUE SPACES.
015800     05  PRT-CLASS                PIC X(4)  VALUE SPACES.
015900     05  FILLER                   PIC X(1)  VALUE SPACES.
016000     05  PRT-MATL-CODE            PIC X(8)  VALUE SPACES.
016100     05  FILLER                   PIC X(4)  VALUE SPACES.
016200     05  PRT-DEPT                 PIC X(4)  VALUE SPACES.
016300     05  FILLER                   PIC X(2)  VALUE SPACES.
016400     05  PRT-ACCT                 PIC X(6)  VALUE SPACES.
016500     05  FILLER                   PIC X(3)  VALUE SPACES.
016600     05  PRT-TRANS                PIC X(4)  VALUE SPACES.
016700     05  FILLER                   PIC X(3)  VALUE SPACES.
016800     05  PRT-DOCUMENT             PIC X(12) VALUE SPACES.
016900     05  FILLER                   PIC X(3)  VALUE SPACES.
017000     05  PRT-PO-NUM               PIC X(10) VALUE SPACES.
017100     05  FILLER                   PIC X(3)  VALUE SPACES.
017200     05  PRT-ITEM-NUM             PIC X(4)  VALUE SPACES.
017300     05  FILLER                   PIC X(3)  VALUE SPACES.
017400     05  PRT-TRANS-DATE           PIC X(8)  VALUE SPACES.
017500     05  FILLER                   PIC X(2)  VALUE SPACES.
017600     05  PRT-QTY                  PIC Z(10)- VALUE ZEROS.
017700     05  FILLER                   PIC X(2)  VALUE SPACES.
017800     05  PRT-UNIT-MEASURE         PIC XX    VALUE SPACES.
017900     05  FILLER                   PIC X(2)  VALUE SPACES.
018000     05  PRT-VALUE                PIC Z(12).99- VALUE ZEROS.
018100
018200 01  ACCTG-CLASS-ERR-MSG.
018300     05  FILLER  PIC X(8)  VALUE SPACES.
018400     05  FILLER  PIC X(5)  VALUE ALL "*".
018500     05  FILLER  PIC X(26) VALUE "  ACCOUNTING CLASS CANNOT ".
018600     05  FILLER  PIC X(17) VALUE "BE BLANK OR '000'".
018700
018800 01  DEPT-ERR-MSG1.
018900     05  FILLER  PIC X(8)  VALUE SPACES.
019000     05  FILLER  PIC X(5)  VALUE ALL "*".
019100     05  FILLER  PIC X(25) VALUE "  DEPT CANNOT BE BLANK;  ".
019200     05  FILLER  PIC X(22) VALUE "DEPT CANNOT BE '0000' ".
019300     05  FILLER  PIC X(28) VALUE "IF THE ACCOUNT IS LESS THAN ".
019400     05  FILLER  PIC X(8)  VALUE "'10000';".
019500
019600 01  DEPT-ERR-MSG2.
019700     05  FILLER  PIC X(8)  VALUE SPACES.
019800     05  FILLER  PIC X(5)  VALUE ALL "*".
019900     05  FILLER  PIC X(25) VALUE "  DEPT MUST BE '0000' IF ".
020000     05  FILLER  PIC X(23) VALUE "ACCOUNT IS GREATER THAN".
020100     05  FILLER  PIC X(7)  VALUE " '9999'".
020200
020300 01  ACCT-ERR-MSG.
020400     05  FILLER  PIC X(8)  VALUE SPACES.
020500     05  FILLER  PIC X(5)  VALUE ALL "*".
020600     05  FILLER  PIC X(26) VALUE "  ACCOUNT CANNOT BE BLANK ".
020700     05  FILLER  PIC X(23) VALUE "OR '000000' UNLESS THE ".
020800     05  FILLER  PIC X(24) VALUE "DEPT. IS A PROCESS DEPT.".
020900
021000 01  NO-TRANSACTIONS-FOUND.
021100     05  FILLER  PIC X(5)  VALUE SPACES.
021200     05  FILLER  PIC X(5)  VALUE "***  ".
021300     05  FILLER  PIC X(24) VALUE "NO INVALID TRANSACTIONS ".
021400     05  FILLER  PIC X(15) VALUE "WERE FOUND  ***".
021500
021600************************************************************
021700**                                                        **
021800**           D A T A B A S E   B U F F E R S              **
021900**                                                        **
022000************************************************************
022100
022200 COPY DTRANS IN COPYLIB.
022300
022400 COPY MACTINFO IN COPYLIB.
022500
022600 COPY MCHTACCT IN COPYLIB.
022700
022800**********************************************************
022900*              D A T A    B A S E                        *
023000**********************************************************
023100
       01  FILE-STATUS.
           05  FILE-STATUS-1     PIC X(1) VALUE "0".
           05  FILE-STATUS-2     PIC X(1) VALUE "0".

023200 COPY DBCSACCT IN COPYLIB.
023300
023400 COPY DBMODES IN COPYLIB.
023500
023600 COPY DBSTAT IN COPYLIB.
023700
023800 01  DATASET-NAMES.
023900     05  DSET-DTRANS       PIC X(16)  VALUE "DTRANS;".
024000     05  DSET-MACCT        PIC X(16)  VALUE "MACCOUNT-INFO;".
024100     05  DSET-MCHT-ACCTS   PIC X(16)  VALUE "MCHT-ACCTS;".
024200
024300 01  ITEMS-LISTING.
024400     05  ALL-ITEMS         PIC X(2)   VALUE "@;".
024500
024600 01  IMAGE-ARGS.
024700     05  MMATL-CODE-ARG    PIC X(8)   VALUE SPACES.
024800     05  MACCT-KEY         PIC X(4)   VALUE SPACES.
024900     05  DEPT-ARG          PIC X(6)   VALUE SPACES.
025000
025100******************************************
025200**   PARAMETERS FOR CALLING 'CBLOWSRT'
025300******************************************
025400
025500 COPY CBLOWSRT IN COPYLIB.
025600
025700 COPY TBLOWUP IN COPYLIB.
025800
026100 PROCEDURE DIVISION.
026200
026300 001-BEGIN SECTION.
026400
026500 010-MAINLINE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

026600*******************************************************
026700**   CALL 'CBLOWSRT' FIRST BEFORE GOING INTO THE
026800**   SORT VERB.  THE FIRST CALL TO 'CBLOWSRT' OPENS
026900**   UP A NEW TEMPORARY FILE 'BLUPDATA' THAT IS USED
027000**   TO WRITE THE BLOWUP INFORMATION IF A BLOWUP
027100**   OCCURS
027200*******************************************************
027300
027400     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
027500                           ACCTG-BASE,
027600                           BU-PGM-NAME,
027700                           STATUS-AREA,
027800                           DUMMY-VIEW-AREA,
027900                           FILE-STATUS,
028000                           BU-DISPLAY-MSG,
028100                           BU-DISPLAY-FLDS.
028200
028300     SORT SORT-FILE ON ASCENDING KEY SORT-CLASS
028400                                     SORT-MATL-CODE
028500         INPUT PROCEDURE IS 050-PROCESS-TRANS
028600         OUTPUT PROCEDURE IS 700-CREATE-REPORT.
028700     PERFORM 1000-CLOSE-FILES.
028800     GOBACK.
028900
029100 050-PROCESS-TRANS SECTION.
       050-PROCESS-TRANS-PARA.
029200     PERFORM 100-BEGIN.
029300     PERFORM 200-PROCESS-DETAIL
029400         UNTIL END-OF-FILE.
029500
029600**********************************************************
029700*  TRANSFER CONTROL TO LAST STATEMENT IN INPUT PROCEDURE *
029800*  FOR SORTING OF RECORDS.                               *
029900**********************************************************
030000
030100     GO TO 699-PROCESS-EXIT.
030200
030300 100-BEGIN.
030400     PERFORM 9999-OPEN-STUFF.
031300
031400     MOVE "SDPT"                  TO MACCT-KEY.
031500     PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
032200     IF GOOD-CALL
032300         MOVE MACCT-STR-DEPT      TO SAVE-STR-DEPT
032400     ELSE
032500         MOVE "GET MACCOUNT INFO SDPT* 100-B" TO BU-DISPLAY-MSG
032600         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
032700         PERFORM 990-BLOWUP.
032800
032900     MOVE "MY"                    TO MACCT-KEY.
031500     PERFORM 9999-DBGET7-MACCOUNT-INFO-IK-I.
033700     IF GOOD-CALL
033800         MOVE MACCT-MONTH         TO MONTH-PARM
033900         MOVE MACCT-YEAR          TO YEAR-PARM
034000     ELSE
034100         MOVE "GET MACCOUNT-INFO MY* 100-B" TO BU-DISPLAY-MSG
034200         MOVE MACCT-KEY TO BU-DISPLAY-FLD (1)
034300         PERFORM 990-BLOWUP.
034400
034500     PERFORM 400-GET-DTRANS.
034600
034800 200-PROCESS-DETAIL.
034900     IF TRANS-DOCUMENT-NUM = "PROC"
035000         NEXT SENTENCE
035100     ELSE
035200     IF TRANS-CODE = "RET " OR "RETV" OR "SADJ" OR
035300                     "AADJ" OR "DCHG"
035400         PERFORM 500-CHECK-ACCTG-DATA
035500     ELSE
035200     IF TRANS-CODE-TRANS = "ISS"
035400         PERFORM 500-CHECK-ACCTG-DATA
035500     ELSE
035600     IF TRANS-CODE = "INV"
035700         IF TRANS-STORES-CODE = "NON-STR"
035800             PERFORM 500-CHECK-ACCTG-DATA
035900         ELSE
036000         IF TRANS-DEPT NOT = SAVE-STR-DEPT
036100             PERFORM 500-CHECK-ACCTG-DATA.
036200
036300     PERFORM 400-GET-DTRANS.
036400
036500 400-GET-DTRANS.
036600     PERFORM 9999-DBGET2-DTRANS-MC-I.
037300     IF GOOD-CALL
037400         NEXT SENTENCE
037500     ELSE
037600         IF END-OF-FILE
037700             NEXT SENTENCE
037800         ELSE
037900             MOVE "DBGET DTRANS * 400-GD" TO BU-DISPLAY-MSG
038000             PERFORM 990-BLOWUP.
038100
038300 500-CHECK-ACCTG-DATA.
038400     MOVE SPACES                  TO SORT-REC.
038500     MOVE "N"                     TO ERR-SW.
038600     IF TRANS-CLASS = "000" OR SPACES
038700         MOVE "Y"                 TO SORT-CLASS-ERR-SW
038800         MOVE "Y"                 TO ERR-SW.
038900
039000     IF TRANS-DEPT = SPACES
039100         MOVE "Y"                 TO SORT-DEPT-ERR-SW
039200         MOVE "Y"                 TO ERR-SW
039300     ELSE
039400     IF TRANS-DEPT = "0000"
039500         IF TRANS-ACCT < "010000"
039600             MOVE "Y"             TO SORT-DEPT-ERR-SW
039700             MOVE "Y"             TO ERR-SW
039800         ELSE
039900             NEXT SENTENCE
040000     ELSE
040100         IF TRANS-ACCT > "009999"
040200             MOVE "Y"             TO SORT-DEPT-ERR-SW
040300             MOVE "Y"             TO ERR-SW.
040400
040500     IF TRANS-ACCT = SPACES
040600         MOVE "Y"                 TO SORT-ACCT-ERR-SW
040700         MOVE "Y"                 TO ERR-SW
040800     ELSE
040900     IF TRANS-ACCT = "000000"
041000         MOVE TRANS-DEPT          TO DEPT-ARG
041100         PERFORM 525-GET-DEPT
041200         IF MCHT-DEPT-TYPE = "PR" OR "MU" OR "MS"
041300             NEXT SENTENCE
041400         ELSE
041500             MOVE "Y"             TO SORT-ACCT-ERR-SW
041600             MOVE "Y"             TO ERR-SW.
041700
041800     IF ERR-SW = "Y"
041900         PERFORM 600-BUILD-SORT-REC.
042000
042200 525-GET-DEPT.
042300     MOVE SPACES                  TO BUF-MCHTACCTS.
042400     PERFORM 9999-DBGET7-MCHT-ACCTS-DP-I.
043100     IF GOOD-CALL
043200         NEXT SENTENCE
043300     ELSE
043400         IF NO-ENTRY
043500             NEXT SENTENCE
043600         ELSE
043700             MOVE "DBGET MMATL-ACCUM * 525-GD" TO BU-DISPLAY-MSG
043800             MOVE DEPT-ARG                  TO BU-DISPLAY-FLD (1)
043900             PERFORM 990-BLOWUP.
044000
044100 600-BUILD-SORT-REC.
044200     MOVE TRANS-DOCUMENT-NUM      TO SORT-DOCUMENT-NUM.
044300     MOVE TRANS-PO-NUM            TO SORT-PO-NUM.
044400     MOVE TRANS-CODE              TO SORT-TRANS-CODE.
044500     MOVE TRANS-ITEM-NUM          TO SORT-ITEM-NUM.
044600     MOVE TRANS-CLASS             TO SORT-CLASS.
044700     MOVE TRANS-DEPT              TO SORT-DEPT.
044800     MOVE TRANS-ACCT              TO SORT-ACCT.
044900     MOVE TRANS-STORES-CODE       TO SORT-MATL-CODE.
045000     MOVE TRANS-QTY               TO SORT-QTY.
045100     MOVE TRANS-UNIT-MEASURE      TO SORT-UNIT-MEASURE.
045200     MOVE TRANS-VALUE             TO SORT-VALUE.
045300     MOVE TRANS-DATE-CN           TO SORT-DATE.
045400     RELEASE SORT-REC.
045500
045800 699-PROCESS-EXIT.
045900     EXIT.
046000
046100 700-CREATE-REPORT SECTION.
       700-CREATE-REPORT-PARA.
046200     PERFORM 710-BEGIN-REPORT.
046300     PERFORM 720-PROCESS-CLASS
046400        UNTIL NO-MORE-SORT = "YES".
046500     IF AT-LEAST-ONE-FOUND = "Y"
046600         NEXT SENTENCE
046700     ELSE
046800         WRITE PRT-REC FROM NO-TRANSACTIONS-FOUND
046900             AFTER ADVANCING 3 LINES.
047000
047100**************************************************
047200**  BRANCH TO LAST STATEMENT OF OUTPUT SECTION  **
047300**  TO COMPLETE PROCESSING OF REPORT            **
047400**************************************************
047500
047600     GO TO 799-CREATE-EXIT.
047700
047800 710-BEGIN-REPORT.
047900     OPEN OUTPUT ONLINE-PRT.
048000     RETURN SORT-FILE
048100        AT END
048200            MOVE "YES" TO NO-MORE-SORT.
048300     PERFORM 750-PRINT-HEADINGS.
048400
048600 720-PROCESS-CLASS.
048700     MOVE SORT-CLASS              TO PREV-CLASS.
048800     PERFORM 722-PROCESS-TRANS
048900         UNTIL SORT-CLASS NOT = PREV-CLASS
049000             OR  NO-MORE-SORT = "YES".
049100     PERFORM 730-END-CLASS.
049200
049400 722-PROCESS-TRANS.
049500     MOVE "Y"                     TO AT-LEAST-ONE-FOUND.
049600     MOVE SORT-TRANS-CODE         TO PRT-TRANS.
049700     MOVE SORT-DOCUMENT-NUM       TO PRT-DOCUMENT.
049800     MOVE SORT-PO-NUM             TO PRT-PO-NUM.
049900     MOVE SORT-ITEM-NUM           TO PRT-ITEM-NUM.
050000     MOVE SORT-CLASS              TO PRT-CLASS.
050100     MOVE SORT-DEPT               TO PRT-DEPT.
050200     MOVE SORT-ACCT               TO PRT-ACCT.
050300     MOVE 4                       TO DATE-MODE.
050400     MOVE SORT-DATE-YYMMDD        TO DATE-VALIDATE-IN.
050500     CALL "TDATECHK" USING DATE-CHECK-AREA.
050600     MOVE DATE-SLASH-OUT          TO PRT-TRANS-DATE.
050700     MOVE SORT-MATL-CODE          TO PRT-MATL-CODE.
050800     MOVE SORT-QTY                TO PRT-QTY.
050900     MOVE SORT-UNIT-MEASURE       TO PRT-UNIT-MEASURE.
051000     MOVE SORT-VALUE              TO PRT-VALUE.
051100     WRITE PRT-REC FROM DETAIL-LINE AFTER 1.
051200     ADD 1                        TO LINE-CNT.
051300
051400     IF SORT-CLASS-ERR-SW NOT = SPACES
051500         WRITE PRT-REC FROM ACCTG-CLASS-ERR-MSG
051600             AFTER ADVANCING 1
051700         ADD 1                    TO LINE-CNT.
051800
051900     IF SORT-DEPT-ERR-SW NOT = SPACES
052000         WRITE PRT-REC FROM DEPT-ERR-MSG1
052100             AFTER ADVANCING 1
052200         WRITE PRT-REC FROM DEPT-ERR-MSG2
052300             AFTER ADVANCING 1
052400         ADD 2                    TO LINE-CNT.
052500
052600     IF SORT-ACCT-ERR-SW NOT = SPACES
052700         WRITE PRT-REC FROM ACCT-ERR-MSG
052800             AFTER ADVANCING 1
052900         ADD 1                    TO LINE-CNT.
053000
053100     IF LINE-CNT > 55
053200         PERFORM 750-PRINT-HEADINGS.
053300     MOVE SPACES                  TO DETAIL-LINE.
053400
053500     RETURN SORT-FILE
053600        AT END
053700             MOVE "YES" TO NO-MORE-SORT.
053800
054000 730-END-CLASS.
054100     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2 LINES.
054200     ADD 2                        TO LINE-CNT.
054300     IF NO-MORE-SORT = "YES"
054400         NEXT SENTENCE
054500     ELSE
054600         IF LINE-CNT > 55
054700             PERFORM 750-PRINT-HEADINGS.
054800
055000 750-PRINT-HEADINGS.
055100     MOVE 1                       TO DATE-MODE.
055200     CALL "TDATECHK" USING DATE-CHECK-AREA.
055300     MOVE DATE-SLASH-OUT          TO DATE-H1.
055400     MOVE DATE-FORMATTED-TIME-OUT TO TIME-H2.
055500     ADD 1                        TO PAGE-CNT.
055600     MOVE PAGE-CNT                TO PAGE-H2.
055700     MOVE MONTH-T (MONTH-PARM)    TO MONTH-H3.
055800     MOVE YEAR-PARM               TO YEAR-H3B.
055900     WRITE PRT-REC FROM HEADER1 AFTER ADVANCING NEW-PAGE.
056000     WRITE PRT-REC FROM HEADER2 AFTER ADVANCING 1.
056100     WRITE PRT-REC FROM HEADER3 AFTER ADVANCING 1.
056200     WRITE PRT-REC FROM HEADER4 AFTER ADVANCING 2.
056300     WRITE PRT-REC FROM BLANK-LINE AFTER ADVANCING 2.
056400     MOVE 7                       TO LINE-CNT.
056500
056900 799-CREATE-EXIT.
057000     EXIT.
057100
057200 900-ERROR SECTION.
057300
057400 990-BLOWUP.
057500
057600***************************************************************
057700**   CALL 'CBLOWSRT' INSTEAD OF 'TBLOWUP' WHEN A BLOWUP      **
057800**   SITUATION OCCURS SINCE THIS PROGRAM USES THE 'SORT'     **
057900**   VERB.  'CBLOWSRT' WRITES ALL THE BLOWUP INFORMATION     **
058000**   TO A TEMPORARY FILE 'BLUPDATA' (WHICH WAS OPENED AT     **
058100**   THE BEGINNING OF THE PROGRAM) THE CLOSES IT. THEN IT    **
058200**   CREATESA A SON PROCESS 'XBLOWSRT' THAT READS THE        **
058300**   BLOWUP INFORMATION OUT OF 'BLUPDATA' AND CALLS          **
058400**   'TBLOWUP' USING THIS INFO.  SINCE THE NEW PROCESS       **
058500**   'XBLOWSRT' HAS ITS OWN STACK THE STACK OVERFLOW         **
058600**   PROBLEM IS AVOIDED.                                     **
058700***************************************************************
058800
058900     MOVE "TTRANCHK"              TO  BU-PGM-NAME.
059000     CALL "CBLOWSRT" USING CBLOWSRT-PARMS,
059100                           ACCTG-BASE,
059200                           BU-PGM-NAME,
059300                           STATUS-AREA,
059400                           DUMMY-VIEW-AREA,
059500                           FILE-STATUS,
059600                           BU-DISPLAY-MSG,
059700                           BU-DISPLAY-FLDS.
060000
060100 1000-CLOSE-FILES.
060200     CLOSE ONLINE-PRT.
060300     PERFORM 9999-CLOSE-STUFF.

       9999-DBGET7-MACCOUNT-INFO-IK-I.
           MOVE 0 TO COND-WORD.
           MOVE MACCT-KEY TO INFOKEY OF MACCOUNT-INFO-IK-REC-I.
           READ MACCOUNT-INFO-IK-I INTO BUF-MACCT-INFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-DBGET2-DTRANS-MC-I.
           MOVE 0 TO COND-WORD.
           READ DTRANS-MC-I NEXT INTO BUF-DTRANS
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-DBGET7-MCHT-ACCTS-DP-I.
           MOVE 0 TO COND-WORD.
           MOVE DEPT-ARG TO DEPT OF MCHT-ACCTS-DP-REC-I.
           READ MCHT-ACCTS-DP-I INTO BUF-MCHTACCTS
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "23"
               MOVE 17 TO COND-WORD
           ELSE
               IF FILE-STATUS NOT = "00"
                   MOVE 99 TO COND-WORD.

       9999-OPEN-STUFF.
           OPEN INPUT MACCOUNT-INFO-IK-I   .
           OPEN INPUT DTRANS-MC-I          .
           OPEN INPUT MCHT-ACCTS-DP-I      .

       9999-CLOSE-STUFF.
           CLOSE      MACCOUNT-INFO-IK-I   .
           CLOSE      DTRANS-MC-I          .
           CLOSE      MCHT-ACCTS-DP-I      .
