       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TTYPOPSC.
      *REMARKS.  ***  THIS PROGRAM MODIFIES THE
      *               GENERIC OPERATIONS DATASET OF THE
      *               EQUIPMENT REFERENCE FILE
      *                   ****.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZIEQPREF-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT TYPE-OPERATIONS
                  ASSIGN TO DATABASE-MCFLER0601
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
                  FILE STATUS IS TO-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).

       FD  TYPE-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TOREC.
       01  TOREC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.

       WORKING-STORAGE SECTION.
       77  ADD-SW                  PIC X(01).
       77  DEL-SW                  PIC X(01).
       77  BLOWUP-BASE             PIC X(16).
       77  TRUE-VAL                PIC 1 VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPOPSC".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "CHANGES THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(15) VALUE "OPERATIONS AND ".
                   15  FILLER      PIC X(16) VALUE "SETTINGS RECORDS".
                   15  FILLER      PIC X(09) VALUE " FOR THE ".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(09) VALUE "SELECTED ".
                   15  FILLER      PIC X(15) VALUE "EQUIPMENT TYPE ".
                   15  FILLER      PIC X(15) VALUE "FOR THE EQUIP. ".
                   15  FILLER      PIC X(21) VALUE "REFER. FILE ".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F5 ".
                   15  FILLER      PIC X(11) VALUE "KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(24) VALUE "MAINTENANCE MENU ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  TO-STATUS           PIC XX.

       01  SCREEN-BUFFER.
           05  ACD-DISP            PIC X(06).
           05  TYPE-SUB-BUF.
               10  TYPE-KEY-BUF.
                   15  TYPE-NUM-BUFFER   PIC X(08).
                   15  SUB-SYS-BUFFER    PIC X(04).
           05  REM-VALUES.
               10  REM-1           PIC X(66).
               10  REM-2           PIC X(66).
               10  REM-3           PIC X(66).
               10  REM-4           PIC X(66).
               10  REM-5           PIC X(66).
               10  REM-6           PIC X(66).
               10  REM-7           PIC X(66).
               10  REM-8           PIC X(66).
               10  REM-9           PIC X(66).
               10  REM-10          PIC X(66).
               10  REM-11          PIC X(66).
               10  REM-12          PIC X(66).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).

       01  TYPE-OPERS-DATA.
           05  TYPE-SUB-KEY.
               10  TYPE-SUB-NUMBER PIC X(08).
               10  SUB-SYS-NUMBER  PIC X(04).
           05  OPERS-12.
               10  EQP-REM-1       PIC X(66).
               10  EQP-REM-2       PIC X(66).
               10  EQP-REM-3       PIC X(66).
               10  EQP-REM-4       PIC X(66).
               10  EQP-REM-5       PIC X(66).
               10  EQP-REM-6       PIC X(66).
               10  EQP-REM-7       PIC X(66).
               10  EQP-REM-8       PIC X(66).
               10  EQP-REM-9       PIC X(66).
               10  EQP-REM-10      PIC X(66).
               10  EQP-REM-11      PIC X(66).
               10  EQP-REM-12      PIC X(66).

       01  MESSAGE-BUFFER.
           05  MESSAGE-LIT1        PIC X(38).
           05  MESSAGE-TYPNUM      PIC X(8).
           05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC X(4).
           05  MESSAGE-LIT3        PIC X(17).

       COPY IOFEEDBACK         IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY CPYIND             IN COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       COPY WSCONTROL          IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       LINKAGE SECTION.
       COPY VCOMLINK IN COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS IN COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF         PIC X(06).
           05  SUB-SYS-BUF         PIC X(04).
           05  EQP-SUB-DESC-BUF    PIC X(40).
           05  EQP-TYPE-BUF        PIC X(08).
           05  ACD-FUNCTION        PIC X(06).
           05  ACD-SW              PIC X(01).

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                EQP-SUB-BUFFER.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.

       2-EOJ.
           CLOSE               DISPLAY-FILE.
           CLOSE               TYPE-OPERATIONS.
           GOBACK.

       1-HSK.
           OPEN I-O            DISPLAY-FILE.
           OPEN I-O            TYPE-OPERATIONS.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0              TO VIEW-LASTKEY.
           MOVE SPACES         TO DSPLY-REC.

       6-MAIN.
           MOVE "FTYPOPSC"     TO VIEW-CFNAME.
           MOVE SPACES         TO SCREEN-BUFFER.
           MOVE " "            TO ADD-SW DEL-SW.
           MOVE EQP-TYPE-BUF   TO TYPE-NUM-BUFFER.
           MOVE SUB-SYS-BUF    TO SUB-SYS-BUFFER.
           MOVE ACD-FUNCTION   TO ACD-DISP.

           PERFORM 69-START-TYPE-OPERATIONS.
           IF COND-WORD = 17
               MOVE SPACES     TO REM-VALUES
      ***************************
      *   NO RECORD EXISTS IN   *
      *   REFERENCE FILE FOR    *
      *   EQUIPMENT/SUBSYSTEM   *
      *RETURN TO REFERENCE PAGE *
      ***************************
               MOVE 66312      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-TYPE-BUF TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUF  TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE 2          TO VIEW-LASTKEY
               GO TO 6-MAIN-LOOP.

       6-MAIN-READ.
           PERFORM 69-READ-TYPE-OPERATIONS
           IF COND-WORD = 0
               IF TYPE-SUB-KEY = TYPE-SUB-BUF
                   MOVE OPERS-12   TO REM-VALUES
                   MOVE 66308      TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE SCREEN-BUFFER  TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98-SCREEN-READ
               ELSE
                   GO TO 6-MAIN
           ELSE
      ***********************
      *   NO RECORD FOUND   *
      *       FOR THIS      *
      * EQUIPMENT/SUBSYSTEM *
      *     COMBINATION     *
      ***********************
           MOVE SPACES         TO REM-VALUES
           MOVE 66312          TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
           MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
           MOVE SCREEN-BUFFER  TO DSPLY-REC
           MOVE TRUE-VAL       TO INDS (98)
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE 2              TO VIEW-LASTKEY.

       6-MAIN-LOOP.
           IF VIEW-LASTKEY = 1 OR 2 OR 3 OR 4 GO TO 6-MAIN-EXIT.

           IF VIEW-LASTKEY = 5
               MOVE 0          TO VIEW-LASTKEY
               GO TO 6-MAIN-READ.

           IF VIEW-LASTKEY = 6
               MOVE "X"        TO ADD-SW.

           IF VIEW-LASTKEY = 7
               MOVE "X"        TO DEL-SW.

           MOVE DSPLY-REC      TO SCREEN-BUFFER.
           MOVE TYPE-KEY-BUF   TO TYPE-SUB-KEY.
           MOVE REM-VALUES     TO OPERS-12.

           IF DEL-SW NOT = " " MOVE SPACES TO OPERS-12.

           IF ADD-SW NOT = " " AND OPERS-12 NOT = SPACES
               PERFORM 69-WRITE-TYPE-OPERATIONS
               MOVE SPACES     TO REM-VALUES
               IF COND-WORD = 0
      ***************************
      *  *** RECORD ADDED ***   *
      ***************************
                   MOVE 66314  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
                   MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
                   MOVE MESSAGE-BUFFER  TO SCREEN-CMD-LINE
                   MOVE TRUE-VAL        TO INDS (98)
                   MOVE SCREEN-BUFFER   TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO REM-VALUES
                   GO TO 6-MAIN
               ELSE
               MOVE 66317      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER  TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER   TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               GO TO 6-MAIN.

           IF OPERS-12 NOT = SPACES
               PERFORM 69-REWRITE-TYPE-OPERATIONS
               IF COND-WORD = 17
                   MOVE "ERROR TRYING TO REWRITE OP-SETS * TTYPOPSC *"
                               TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
      ***************************
      * *** RECORD CHANGED ***  *
      ***************************
               MOVE SPACES     TO REM-VALUES
               MOVE 66323      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER  TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER   TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES     TO REM-VALUES
               GO TO 6-MAIN
           ELSE
           MOVE "X"            TO DEL-SW
           PERFORM 69-DELETE-TYPE-OPERATIONS
           IF COND-WORD = 17
               MOVE "ERROR DELETING TYPE OPERATIONS * TTYPOPSC *"
                               TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.

       69-DELETE-TYPE-OPERATIONS.
           MOVE 0              TO COND-WORD.
           DELETE TYPE-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-OPERATIONS.
           MOVE 0              TO COND-WORD.
           MOVE TYPE-SUB-BUF   TO EQRTYSUBK OF TOREC.
           START TYPE-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-OPERATIONS.
           MOVE 0              TO COND-WORD.
           READ TYPE-OPERATIONS NEXT INTO TYPE-OPERS-DATA
               AT END          MOVE "00" TO TO-STATUS
                               MOVE SPACES TO TYPE-SUB-KEY.
           IF TO-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-TYPE-OPERATIONS.
           MOVE 0              TO COND-WORD.
           REWRITE TOREC       FROM TYPE-OPERS-DATA
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF TO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

        69-WRITE-TYPE-OPERATIONS.
            MOVE 0             TO COND-WORD.
            WRITE TOREC        FROM TYPE-OPERS-DATA
                INVALID KEY    MOVE 17 TO COND-WORD.
            IF TO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"       TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM   TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0"       TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0"       TO INDICS.

       998-BLOWUP.
           MOVE "TTYPOPSC"     TO BU-PGM-NAME.
           CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
                            VIEW-COMAREA DUMMY-KSAM-STAT
                            BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

