000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TTYPREFC.
000600*REMARKS.  ***  THIS PROGRAM MODIFIES THE
000700*               GENERIC REFERENCE DATASET OF THE
000800*               EQUIPMENT REFERENCE FILE
000900*          ***  SUBROUTINES CALLED:
001000*               TTYPREMC
001100*               TTYPOPSC
001300*                   ****.
001400 ENVIRONMENT DIVISION.
001500 CONFIGURATION SECTION.
001600 SOURCE-COMPUTER.    AS400.
001700 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZIEQPREF-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT TYPE-REFERENCE
               ASSIGN TO DATABASE-MCFLER0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS TR-STATUS.
001900 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  TYPE-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TRREC.
       01  TRREC.
           COPY DDS-ALL-FORMATS OF MCFLER0201.
002000 WORKING-STORAGE SECTION.
       77  RECORD-SW               PIC X(01).
002200 77  TIT-SW                  PIC X(01).
002300
       COPY CATREAD IN COPYLIB.

       COPY CPYIND  IN COPYLIB.

010000 01  EQP-TITLE-DATA.
010100     05  EQP-TITLE-1         PIC X(16).
010200     05  EQP-TITLE-2         PIC X(16).
010300     05  EQP-TITLE-3         PIC X(16).
010400     05  EQP-TITLE-4         PIC X(16).
010500     05  EQP-TITLE-5         PIC X(16).
010600     05  EQP-TITLE-6         PIC X(16).
010700     05  EQP-TITLE-7         PIC X(16).
010800     05  EQP-TITLE-8         PIC X(16).
010900
       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  TR-STATUS           PIC XX.

       COPY IOFEEDBACK IN COPYLIB.

011000 01  MESSAGE-BUFFER.
011400     05  MESSAGE-LIT1        PIC X(38).
011500     05  MESSAGE-TYPNUM      PIC X(8).
011600     05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC X(4).
           05  MESSAGE-LIT3        PIC X(17).

002400 01  PASSWORD-INFORMATION.
002500     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPREFC".
002600     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002700     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002800     05  PROGRAM-DESCRIPTION.
002900         10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "CHANGES THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(17) VALUE "REFERENCE RECORDS".
                   15  FILLER      PIC X(09) VALUE " FOR THE ".
                   15  FILLER      PIC X(14) VALUE "SELECTED ".
003100         10  PROG-DESC-B.
                   15  FILLER      PIC X(15) VALUE "EQUIPMENT TYPE ".
                   15  FILLER      PIC X(15) VALUE "NUMBER FOR THE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(20) VALUE "REFERENCE FILE ".
003300         10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F4 ".
                   15  FILLER      PIC X(11) VALUE "KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(24) VALUE "MAINTENANCE MENU ".
003500     05  PASSWORD-FLAG       PIC X.
003600
       01  SAVE-CFNAME             PIC X(16).

004200 01  SCREEN-BUFFER.
004300     05  ACD-DISP            PIC X(06).
004400     05  TYPE-SUB-BUF.
004500         10  TYPE-KEY-BUF.
004600             15  TYPE-BUF    PIC X(08).
004700             15  SUB-SYS-BUFFER.
004800                 20  SS-BUF-1     PIC X.
004900                 20  SS-BUF-2     PIC X.
005000                 20  SS-BUF-3     PIC X.
005100                 20  SS-BUF-4     PIC X.
005200     05  REF-VALUES.
005300         10  MFG-BUF         PIC X(16).
005400         10  MOD-BUF         PIC X(16).
005500         10  SER-BUF         PIC X(16).
005600         10  PNUM-BUF        PIC X(08).
005700         10  HDR1-BUF        PIC X(16).
005800         10  DES1-BUF        PIC X(16).
005900         10  HDR2-BUF        PIC X(16).
006000         10  DES2-BUF        PIC X(16).
006100         10  HDR3-BUF        PIC X(16).
006200         10  DES3-BUF        PIC X(16).
006300         10  HDR4-BUF        PIC X(16).
006400         10  DES4-BUF        PIC X(16).
006500         10  HDR5-BUF        PIC X(16).
006600         10  DES5-BUF        PIC X(16).
006700         10  HDR6-BUF        PIC X(16).
006800         10  DES6-BUF        PIC X(16).
006900         10  HDR7-BUF        PIC X(16).
007000         10  DES7-BUF        PIC X(16).
007100         10  HDR8-BUF        PIC X(16).
007200         10  DES8-BUF        PIC X(16).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
007300
       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP IN COPYLIB.

       01  TRUE-VAL                PIC 1 VALUE B"1".

007400 01  TYPE-REF-DATA.
007500     05  TYPE-SUB-KEY.
007600         10  TYPE-NUMBER     PIC X(08).
007700         10  SUB-SYS-NUMBER  PIC X(04).
007800     05  TYPE-SCREEN-VALUES.
007900         10  EQP-MFG         PIC X(16).
008000         10  EQP-MOD         PIC X(16).
008100         10  EQP-SER         PIC X(16).
008200         10  EQP-PROP-NUM    PIC X(08).
008300         10  EQP-NAME-1      PIC X(16).
008400         10  EQP-FIELD-1     PIC X(16).
008500         10  EQP-NAME-2      PIC X(16).
008600         10  EQP-FIELD-2     PIC X(16).
008700         10  EQP-NAME-3      PIC X(16).
008800         10  EQP-FIELD-3     PIC X(16).
008900         10  EQP-NAME-4      PIC X(16).
009000         10  EQP-FIELD-4     PIC X(16).
009100         10  EQP-NAME-5      PIC X(16).
009200         10  EQP-FIELD-5     PIC X(16).
009300         10  EQP-NAME-6      PIC X(16).
009400         10  EQP-FIELD-6     PIC X(16).
009500         10  EQP-NAME-7      PIC X(16).
009600         10  EQP-FIELD-7     PIC X(16).
009700         10  EQP-NAME-8      PIC X(16).
009800         10  EQP-FIELD-8     PIC X(16).
009900
       COPY WSCONTROL IN COPYLIB.
013700 LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.
013900 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
014200 01  EQP-SUB-BUFFER.
014300     05  EQP-NUM-BUF         PIC X(06).
014400     05  SUB-SYS-BUF         PIC X(04).
014500     05  EQP-SUB-DESC-BUF    PIC X(40).
014600     05  EQP-TYPE-BUF        PIC X(08).
014700     05  ACD-FUNCTION        PIC X(06).
014800     05  ACD-SW              PIC X(01).
014900
015000 PROCEDURE DIVISION USING VIEW-COMAREA
015100                          DBPARAMETERS
015400                          EQP-SUB-BUFFER.
015500 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE TYPE-REFERENCE.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   TYPE-REFERENCE.
015700     CALL "TPWORD" USING PASSWORD-INFORMATION.
016100     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
016200     MOVE 0 TO VIEW-LASTKEY.
016800     MOVE "FTYPREFC" TO VIEW-CFNAME.
020200     MOVE SPACES TO SCREEN-BUFFER DSPLY-REC.
           MOVE " " TO RECORD-SW TIT-SW.
016600
016700 6-MAIN.
           IF TRUE-VAL = INDS (99)
               MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE
           ELSE
           MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE.
020300     MOVE EQP-TYPE-BUF TO TYPE-BUF.
020400     MOVE SPACES TO SUB-SYS-BUFFER.
020500     MOVE ACD-FUNCTION TO ACD-DISP.
           MOVE 66299 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
020600     MOVE SCREEN-BUFFER TO DSPLY-REC.
020700     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
           IF VIEW-LASTKEY NOT = 0 GO TO 6-MAIN-LOOP.
024400     MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF.
024300     PERFORM 62-SS-ADJUST.
019900     PERFORM 69-START-TYPE-REFERENCE.
           IF COND-WORD = 17
               MOVE 66320 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE EQP-TYPE-BUF TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE "FTYPREFC" TO VIEW-CFNAME
               GO TO 6-MAIN.
024500     PERFORM 69-READ-TYPE-REFERENCE.
024700     IF COND-WORD = 0
024800         NEXT SENTENCE
           ELSE
028100****************
028200*    RECORD    *
028300*DOES NOT EXIST*
028400*   FOR THIS   *
028500*  EQUIPMENT/  *
028600*  SUBSYSTEM   *
028700* COMBINATION  *
028800****************
           MOVE 66320 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE EQP-TYPE-BUF TO MESSAGE-TYPNUM
           MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
           MOVE SCREEN-BUFFER TO DSPLY-REC
           MOVE TRUE-VAL TO INDS (98)
           PERFORM 99-SCREEN-WRITE
           PERFORM 98A-SCREEN-READ
           CALL "CLPAUSE2"
           MOVE "FTYPREFC" TO VIEW-CFNAME
           GO TO 6-MAIN.
029500     IF TIT-SW = " "
029600         MOVE "FTYPREFC2" TO VIEW-CFNAME
029700     ELSE
029800     MOVE "FTYPREFCT" TO VIEW-CFNAME.
       6-MAIN-CONT.
           MOVE SPACES TO SCREEN-BUFFER.
           MOVE 66302 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE TYPE-NUMBER TO TYPE-BUF.
           MOVE SUB-SYS-NUMBER TO SUB-SYS-BUFFER.
           MOVE ACD-FUNCTION TO ACD-DISP.
           MOVE TYPE-SCREEN-VALUES TO REF-VALUES.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.

       6-MAIN-LOOP.
023400     IF VIEW-LASTKEY = 1 OR 3 GO TO 6-MAIN-EXIT.
036200     IF VIEW-LASTKEY = 2
               MOVE "FTYPREFC" TO VIEW-CFNAME
               MOVE SPACES TO REF-VALUES
037900         MOVE 0 TO VIEW-LASTKEY
               GO TO 6-MAIN.
036400     IF VIEW-LASTKEY = 4
037000         IF SUB-SYS-BUFFER NOT = SPACES
037100             PERFORM 62-SS-ADJUST
037200             MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
                   MOVE VIEW-CFNAME TO SAVE-CFNAME
037300             CALL "TTYPREMC" USING VIEW-COMAREA
037400                                  DBPARAMETERS
037700                                  EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
037800             MOVE SAVE-CFNAME TO VIEW-CFNAME
038100             GO TO 6-MAIN-LOOP
038200         ELSE
038300         IF SUB-SYS-BUF = SPACES
038400             MOVE 45037 TO CATREAD-MSG-NUMBER
038600**MESSAGE******************************************************
038700** SUBSYSTEM NUMBER REQUIRED                                 **
038800***************************************************************
038900             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE TRUE-VAL TO INDS (99)
039200             GO TO 6-MAIN
039300         ELSE
039400         CALL "TTYPREMC" USING VIEW-COMAREA
039500                               DBPARAMETERS
039800                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
037800         MOVE SAVE-CFNAME TO VIEW-CFNAME
038100         GO TO 6-MAIN-LOOP.
040300     IF VIEW-LASTKEY = 5
040900         IF SUB-SYS-BUFFER NOT = SPACES
041000             PERFORM 62-SS-ADJUST
041100             MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
041200             CALL "TTYPOPSC" USING VIEW-COMAREA
041300                                  DBPARAMETERS
041600                                  EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
037800             MOVE SAVE-CFNAME TO VIEW-CFNAME
038100             GO TO 6-MAIN-LOOP
042100         ELSE
042200         IF SUB-SYS-BUF = SPACES
042300             MOVE 45037 TO CATREAD-MSG-NUMBER
042500**MESSAGE******************************************************
042600** SUBSYSTEM NUMBER REQUIRED                                 **
042700***************************************************************
042800             PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
043000             MOVE TRUE-VAL TO INDS (99)
043100             GO TO 6-MAIN
043200         ELSE
043300         CALL "TTYPOPSC" USING VIEW-COMAREA
043400                               DBPARAMETERS
043700                               EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
037800         MOVE SAVE-CFNAME TO VIEW-CFNAME
038100         GO TO 6-MAIN-LOOP.
044200     IF VIEW-LASTKEY = 7
044300         IF TIT-SW = " "
044400             MOVE "X" TO TIT-SW
044800             MOVE "FTYPREFC2" TO VIEW-CFNAME
045100             GO TO 6-MAIN-CONT
045200         ELSE
045600         MOVE " "  TO TIT-SW
045700         MOVE "FTYPREFC" TO VIEW-CFNAME
046000         GO TO 6-MAIN-CONT.
047500     MOVE TYPE-KEY-BUF TO TYPE-SUB-KEY.
047600     MOVE REF-VALUES TO TYPE-SCREEN-VALUES.
           PERFORM 69-REWRITE-TYPE-REFERENCE.
050100     MOVE SPACES TO REF-VALUES.
050200     IF COND-WORD = 0
053400****************
053500*RECORD CHANGED*
053600*PRESS FUNCTION*
053700* KEY OR ENTER *
053800*NEW  SUBSYSTEM*
053900* TO CONTINUE  *
054000****************
               MOVE 66321 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUMBER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-NUMBER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-BUFFER TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE "FTYPREFC" TO VIEW-CFNAME
050600         GO TO 6-MAIN.
054500
       6-MAIN-EXIT.    EXIT.

054600 62-SS-ADJUST.
054700     IF SS-BUF-1 = SPACE MOVE "0" TO SS-BUF-1.
054800     IF SS-BUF-2 = SPACE MOVE "0" TO SS-BUF-2.
054900     IF SS-BUF-3 = SPACE MOVE "0" TO SS-BUF-3.
055000     IF SS-BUF-4 = SPACE MOVE "0" TO SS-BUF-4.
055100
       69-START-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-KEY-BUF TO EQRTYSUBK OF TRREC.
           START TYPE-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           READ TYPE-REFERENCE NEXT INTO TYPE-REF-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-REWRITE-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           REWRITE TRREC FROM TYPE-REF-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-WRITE-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           WRITE TRREC FROM TYPE-REF-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

059100 999-CATREAD.
059200     MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
060200 999-CATREAD-EXIT.    EXIT.
