       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TTYPREFA.
      *REMARKS.                THIS PROGRAM ADDS RECORDS TO
      *                        THE GENERIC REFERENCE DATASET
      *                        OF THE EQUIPMENT REFERENCE FILE
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                               LOCAL-DATA IS LOCAL-DATA-AREA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZIEQPREF-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DSPLY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT FIELD-NAMES
                  ASSIGN TO DATABASE-MCFLER0701
                  ORGANIZATION IS RELATIVE
                  ACCESS MODE IS RANDOM
                  RELATIVE KEY IS REL-KEY
                  FILE STATUS IS FN-STATUS.

           SELECT TYPE-REFERENCE
                  ASSIGN TO DATABASE-MCFLER0201
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS TR-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).

       FD  FIELD-NAMES
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS FNREC.
       01  FNREC.
           COPY DDS-ALL-FORMATS OF MCFLER0701.

       FD  TYPE-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TRREC.
       01  TRREC.
           COPY DDS-ALL-FORMATS OF MCFLER0201.

       WORKING-STORAGE SECTION.
       77  RECORD-SW           PIC X(01).
       77  RPT-SW              PIC X(01).
       77  TIT-SW              PIC X(01).
       77  RETURN-SW           PIC X(01).
       77  REL-KEY             PIC 9(9).
       77  TRUE-VAL            PIC 1     VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPREFA".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A.
                   15  FILLER      PIC X(14) VALUE "INITIATES THE ".
                   15  FILLER      PIC X(17) VALUE "GENERIC REFERENCE".
                   15  FILLER      PIC X(17) VALUE " RECORDS FOR THE ".
                   15  FILLER      PIC X(12) VALUE "SELECTED ".
               10  PROG-DESC-B.
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(16) VALUE "TYPE NUMBER FOR ".
                   15  FILLER      PIC X(14) VALUE "THE EQUIPMENT ".
                   15  FILLER      PIC X(20) VALUE "REFERENCE FILE ".
               10  PROG-FUNCTION.
                   15  FILLER      PIC X(17) VALUE "RUNS FROM THE F2 ".
                   15  FILLER      PIC X(11) VALUE "KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(24) VALUE "MAINTENANCE MENU".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STATUSES.
           05  DSPLY-STATUS    PIC XX.
           05  FN-STATUS       PIC XX.
           05  TR-STATUS       PIC XX.

       01  SCREEN-BUFFER.
           05  ACD-DISP            PIC X(06).
           05  TYPE-SUB-BUF.
               10  TYPE-KEY-BUF.
                   15  TYPE-NUM-BUFFER  PIC X(08).
                   15  SUB-SYS-BUFFER.
                       20  SS-BUF-1     PIC X.
                       20  SS-BUF-2     PIC X.
                       20  SS-BUF-3     PIC X.
                       20  SS-BUF-4     PIC X.
           05  REF-VALUES.
               10  MFG-BUF         PIC X(16).
               10  MOD-BUF         PIC X(16).
               10  SER-BUF         PIC X(16).
               10  PNUM-BUF        PIC X(08).
               10  HDR1-BUF        PIC X(16).
               10  DES1-BUF        PIC X(16).
               10  HDR2-BUF        PIC X(16).
               10  DES2-BUF        PIC X(16).
               10  HDR3-BUF        PIC X(16).
               10  DES3-BUF        PIC X(16).
               10  HDR4-BUF        PIC X(16).
               10  DES4-BUF        PIC X(16).
               10  HDR5-BUF        PIC X(16).
               10  DES5-BUF        PIC X(16).
               10  HDR6-BUF        PIC X(16).
               10  DES6-BUF        PIC X(16).
               10  HDR7-BUF        PIC X(16).
               10  DES7-BUF        PIC X(16).
               10  HDR8-BUF        PIC X(16).
               10  DES8-BUF        PIC X(16).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).

       01  EQP-TITLE-DATA.
           05  EQP-TITLE-1         PIC X(16).
           05  EQP-TITLE-2         PIC X(16).
           05  EQP-TITLE-3         PIC X(16).
           05  EQP-TITLE-4         PIC X(16).
           05  EQP-TITLE-5         PIC X(16).
           05  EQP-TITLE-6         PIC X(16).
           05  EQP-TITLE-7         PIC X(16).
           05  EQP-TITLE-8         PIC X(16).

       01  TYPE-REF-DATA.
           05  TYPE-SUB-KEY.
               10  TYPE-NUMBER     PIC X(08).
               10  SUB-SYS-NUMBER  PIC X(04).
           05  TYPE-SCREEN-VALUES.
               10  EQP-MFG         PIC X(16).
               10  EQP-MOD         PIC X(16).
               10  EQP-SER         PIC X(16).
               10  EQP-PROP-NUM    PIC X(08).
               10  EQP-NAME-1      PIC X(16).
               10  EQP-FIELD-1     PIC X(16).
               10  EQP-NAME-2      PIC X(16).
               10  EQP-FIELD-2     PIC X(16).
               10  EQP-NAME-3      PIC X(16).
               10  EQP-FIELD-3     PIC X(16).
               10  EQP-NAME-4      PIC X(16).
               10  EQP-FIELD-4     PIC X(16).
               10  EQP-NAME-5      PIC X(16).
               10  EQP-FIELD-5     PIC X(16).
               10  EQP-NAME-6      PIC X(16).
               10  EQP-FIELD-6     PIC X(16).
               10  EQP-NAME-7      PIC X(16).
               10  EQP-FIELD-7     PIC X(16).
               10  EQP-NAME-8      PIC X(16).
               10  EQP-FIELD-8     PIC X(16).

       01  MESSAGE-BUFFER.
           05  MESSAGE-LIT1        PIC X(38).
           05  MESSAGE-TYPNUM      PIC X(8).
           05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC X(4).
           05  MESSAGE-LIT3        PIC X(17).

       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP            IN COPYLIB.

       COPY IOFEEDBACK         IN COPYLIB.

       COPY CATREAD            IN COPYLIB.

       COPY CPYIND             IN COPYLIB.

       COPY WSCONTROL          IN COPYLIB.

       LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.

       01  DBPARAMETERS.       COPY DBPARMS OF COPYLIB.

       01  EQP-SUB-BUFFER.
           05  EQP-NUM-BUF         PIC X(06).
           05  SUB-SYS-BUF         PIC X(04).
           05  EQP-SUB-DESC-BUF    PIC X(40).
           05  EQP-TYPE-BUF        PIC X(08).
           05  ACD-FUNCTION        PIC X(06).
           05  ACD-SW              PIC X(01).

       PROCEDURE DIVISION USING VIEW-COMAREA
                                DBPARAMETERS
                                EQP-SUB-BUFFER.
       BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT
               UNTIL VIEW-LASTKEY = 1 OR 3.

       2-EOJ.
           CLOSE               DISPLAY-FILE.
           CLOSE               FIELD-NAMES.
           CLOSE               TYPE-REFERENCE.
           GOBACK.

       1-HSK.
           MOVE LOW-VALUES     TO STATUS-AREA.
           OPEN I-O            DISPLAY-FILE.
           OPEN INPUT          FIELD-NAMES.
           OPEN I-O            TYPE-REFERENCE.

           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG = "N" GO TO 2-EOJ.

           MOVE 0              TO VIEW-LASTKEY.
           MOVE "FTYPREFA"     TO VIEW-CFNAME.
           MOVE SPACES         TO SCREEN-BUFFER EQP-TITLE-DATA.
           MOVE EQP-TYPE-BUF   TO TYPE-NUM-BUFFER.
           MOVE SUB-SYS-BUF    TO SUB-SYS-BUFFER.
           MOVE ACD-FUNCTION   TO ACD-DISP.

           PERFORM 69-READ-FIELD-NAMES.
           MOVE EQP-TITLE-1    TO HDR1-BUF.
           MOVE EQP-TITLE-2    TO HDR2-BUF.
           MOVE EQP-TITLE-3    TO HDR3-BUF.
           MOVE EQP-TITLE-4    TO HDR4-BUF.
           MOVE EQP-TITLE-5    TO HDR5-BUF.
           MOVE EQP-TITLE-6    TO HDR6-BUF.
           MOVE EQP-TITLE-7    TO HDR7-BUF.
           MOVE EQP-TITLE-8    TO HDR8-BUF.
           MOVE SPACES         TO DSPLY-REC.
           MOVE " "            TO RECORD-SW RETURN-SW RPT-SW TIT-SW.

       6-MAIN.
           IF RECORD-SW = "X"
               MOVE " "        TO RECORD-SW
               IF RPT-SW = " "
                   NEXT SENTENCE
               ELSE
               MOVE TYPE-SCREEN-VALUES TO REF-VALUES.

           MOVE 66311          TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER  TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC      TO SCREEN-BUFFER.
           MOVE REF-VALUES     TO TYPE-SCREEN-VALUES.

       6-MAIN-LOOP.
           IF VIEW-LASTKEY = 1 OR 3 GO TO 6-MAIN-EXIT.
           IF VIEW-LASTKEY = 2
               MOVE 0          TO VIEW-LASTKEY
               MOVE "FTYPREFA" TO VIEW-CFNAME
               MOVE SPACES     TO REF-VALUES SUB-SYS-BUFFER
               MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
               MOVE EQP-TITLE-1 TO HDR1-BUF
               MOVE EQP-TITLE-2 TO HDR2-BUF
               MOVE EQP-TITLE-3 TO HDR3-BUF
               MOVE EQP-TITLE-4 TO HDR4-BUF
               MOVE EQP-TITLE-5 TO HDR5-BUF
               MOVE EQP-TITLE-6 TO HDR6-BUF
               MOVE EQP-TITLE-7 TO HDR7-BUF
               MOVE EQP-TITLE-8 TO HDR8-BUF
               GO TO 6-MAIN.

           IF VIEW-LASTKEY = 4
               MOVE DSPLY-REC  TO SCREEN-BUFFER
               IF SUB-SYS-BUFFER NOT = SPACES
                   PERFORM 62-SS-ADJUST
                   MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
                   PERFORM 69-START-TYPE-REFERENCE
                   IF COND-WORD = 17
                       MOVE 44120 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                       MOVE TRUE-VAL TO INDS (98)
                       MOVE SCREEN-BUFFER TO DSPLY-REC
                       PERFORM 99-SCREEN-WRITE
                       PERFORM 98A-SCREEN-READ
                       CALL "CLPAUSE2"
                       GO TO 6-MAIN
                   ELSE
                   CALL "TTYPREMA" USING VIEW-COMAREA
                                        DBPARAMETERS
                                        EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
                   IF VIEW-LASTKEY = 2
                       MOVE 0  TO VIEW-LASTKEY
                       MOVE "FTYPREFA" TO VIEW-CFNAME
                       MOVE SPACES TO REF-VALUES
                       MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
                       MOVE EQP-TITLE-1 TO HDR1-BUF
                       MOVE EQP-TITLE-2 TO HDR2-BUF
                       MOVE EQP-TITLE-3 TO HDR3-BUF
                       MOVE EQP-TITLE-4 TO HDR4-BUF
                       MOVE EQP-TITLE-5 TO HDR5-BUF
                       MOVE EQP-TITLE-6 TO HDR6-BUF
                       MOVE EQP-TITLE-7 TO HDR7-BUF
                       MOVE EQP-TITLE-8 TO HDR8-BUF
                       GO TO 6-MAIN
                   ELSE
                   GO TO 6-MAIN-LOOP
               ELSE
               IF SUB-SYS-BUF = SPACES
                   MOVE 45037  TO CATREAD-MSG-NUMBER
      **MESSAGE******************************************************
      ** SUBSYSTEM NUMBER REQUIRED                                 **
      ***************************************************************
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE
                   MOVE TRUE-VAL TO INDS (2) INDS (99)
                   GO TO 6-MAIN
               ELSE
               PERFORM 69-START-TYPE-REFERENCE
               IF COND-WORD = 17
                   MOVE 44120 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE TRUE-VAL TO INDS (98)
                   MOVE SCREEN-BUFFER TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   GO TO 6-MAIN
               ELSE
               CALL "TTYPREMA" USING VIEW-COMAREA
                                     DBPARAMETERS
                                     EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
               IF VIEW-LASTKEY = 2
                   MOVE 0      TO VIEW-LASTKEY
                   MOVE "FTYPREFA" TO VIEW-CFNAME
                   MOVE SPACES TO REF-VALUES
                   MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
                   MOVE EQP-TITLE-1 TO HDR1-BUF
                   MOVE EQP-TITLE-2 TO HDR2-BUF
                   MOVE EQP-TITLE-3 TO HDR3-BUF
                   MOVE EQP-TITLE-4 TO HDR4-BUF
                   MOVE EQP-TITLE-5 TO HDR5-BUF
                   MOVE EQP-TITLE-6 TO HDR6-BUF
                   MOVE EQP-TITLE-7 TO HDR7-BUF
                   MOVE EQP-TITLE-8 TO HDR8-BUF
                   GO TO 6-MAIN
               ELSE
               GO TO 6-MAIN-LOOP.

           IF VIEW-LASTKEY = 5
               IF SUB-SYS-BUFFER NOT = SPACES
                   PERFORM 62-SS-ADJUST
                   MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF
                   PERFORM 69-START-TYPE-REFERENCE
                   IF COND-WORD = 17
                       MOVE 44120 TO CATREAD-MSG-NUMBER
                       PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                       MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                       MOVE TRUE-VAL TO INDS (98)
                       MOVE SCREEN-BUFFER TO DSPLY-REC
                       PERFORM 99-SCREEN-WRITE
                       PERFORM 98A-SCREEN-READ
                       CALL "CLPAUSE2"
                       GO TO 6-MAIN
                   ELSE
                   CALL "TTYPOPSA" USING VIEW-COMAREA
                                        DBPARAMETERS
                                        EQP-SUB-BUFFER
                   IF VIEW-LASTKEY = 1 OR 3
                       GO TO 6-MAIN-EXIT
                   ELSE
                   IF VIEW-LASTKEY = 2
                       MOVE 0  TO VIEW-LASTKEY
                       MOVE "FTYPREFA" TO VIEW-CFNAME
                       MOVE SPACES TO REF-VALUES
                       MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
                       MOVE EQP-TITLE-1 TO HDR1-BUF
                       MOVE EQP-TITLE-2 TO HDR2-BUF
                       MOVE EQP-TITLE-3 TO HDR3-BUF
                       MOVE EQP-TITLE-4 TO HDR4-BUF
                       MOVE EQP-TITLE-5 TO HDR5-BUF
                       MOVE EQP-TITLE-6 TO HDR6-BUF
                       MOVE EQP-TITLE-7 TO HDR7-BUF
                       MOVE EQP-TITLE-8 TO HDR8-BUF
                       GO TO 6-MAIN
                   ELSE
                   GO TO 6-MAIN-LOOP
               ELSE
               IF SUB-SYS-BUF = SPACES
                   MOVE 45037  TO CATREAD-MSG-NUMBER
      **MESSAGE******************************************************
      ** SUBSYSTEM NUMBER REQUIRED                                 **
      ***************************************************************
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE
                   MOVE TRUE-VAL TO INDS (2) INDS (99)
                   GO TO 6-MAIN
               ELSE
               PERFORM 69-START-TYPE-REFERENCE
               IF COND-WORD = 17
                   MOVE 44120 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE TRUE-VAL TO INDS (98)
                   MOVE SCREEN-BUFFER TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   GO TO 6-MAIN
               ELSE
               CALL "TTYPOPSA" USING VIEW-COMAREA
                                     DBPARAMETERS
                                     EQP-SUB-BUFFER
               IF VIEW-LASTKEY = 1 OR 3
                   GO TO 6-MAIN-EXIT
               ELSE
               IF VIEW-LASTKEY = 2
                   MOVE 0      TO VIEW-LASTKEY
                   MOVE "FTYPREFA" TO VIEW-CFNAME
                   MOVE SPACES TO REF-VALUES
                   MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
                   MOVE EQP-TITLE-1 TO HDR1-BUF
                   MOVE EQP-TITLE-2 TO HDR2-BUF
                   MOVE EQP-TITLE-3 TO HDR3-BUF
                   MOVE EQP-TITLE-4 TO HDR4-BUF
                   MOVE EQP-TITLE-5 TO HDR5-BUF
                   MOVE EQP-TITLE-6 TO HDR6-BUF
                   MOVE EQP-TITLE-7 TO HDR7-BUF
                   MOVE EQP-TITLE-8 TO HDR8-BUF
                   GO TO 6-MAIN
               ELSE
               GO TO 6-MAIN-LOOP.

           IF VIEW-LASTKEY = 6
               IF RPT-SW = SPACE
                   MOVE "X"    TO RPT-SW
                   MOVE 44045  TO CATREAD-MSG-NUMBER
      **MESSAGE******************************************************
      ** REPEAT                                                    **
      ***************************************************************
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
                   MOVE MESSAGE-BUFFER TO ACD-DISP
                   GO TO 6-MAIN
               ELSE
               MOVE SPACE      TO RPT-SW
               MOVE 27048      TO CATREAD-MSG-NUMBER
      **MESSAGE******************************************************
      ** ADD                                                       **
      ***************************************************************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE MESSAGE-BUFFER TO ACD-DISP
               GO TO 6-MAIN.

           IF VIEW-LASTKEY = 7
               IF TIT-SW = SPACE
                   MOVE "X"    TO TIT-SW
                   MOVE "FTYPREFAT" TO VIEW-CFNAME
                   GO TO 6-MAIN
               ELSE
               MOVE SPACE      TO TIT-SW
               MOVE "FTYPREFA" TO VIEW-CFNAME
               GO TO 6-MAIN.

           MOVE SUB-SYS-BUFFER TO SUB-SYS-BUF.
           PERFORM 62-SS-ADJUST.
           PERFORM 69-START-TYPE-REFERENCE.
           IF COND-WORD = 17
               MOVE TYPE-KEY-BUF TO TYPE-SUB-KEY
               MOVE REF-VALUES   TO TYPE-SCREEN-VALUES
               PERFORM 69-WRITE-TYPE-REFERENCE
               IF COND-WORD = 17
                   MOVE 66319  TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
      ****************
      *   RECORD     *
      *ALREADY EXISTS*
      *   FOR THIS   *
      *  EQUIPMENT/  *
      *  SUBSYSTEM   *
      * COMBINATION  *
      ****************
                   MOVE TYPE-SUB-KEY TO MESSAGE-TYPNUM
                   MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
                   MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
                   MOVE TRUE-VAL TO INDS (98)
                   MOVE SCREEN-BUFFER TO DSPLY-REC
                   PERFORM 99-SCREEN-WRITE
                   PERFORM 98A-SCREEN-READ
                   CALL "CLPAUSE2"
                   MOVE SPACES TO REF-VALUES SUB-SYS-BUFFER
                   MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
                   MOVE EQP-TITLE-1 TO HDR1-BUF
                   MOVE EQP-TITLE-2 TO HDR2-BUF
                   MOVE EQP-TITLE-3 TO HDR3-BUF
                   MOVE EQP-TITLE-4 TO HDR4-BUF
                   MOVE EQP-TITLE-5 TO HDR5-BUF
                   MOVE EQP-TITLE-6 TO HDR6-BUF
                   MOVE EQP-TITLE-7 TO HDR7-BUF
                   MOVE EQP-TITLE-8 TO HDR8-BUF
                   MOVE "X"    TO RECORD-SW
                   GO TO 6-MAIN
               ELSE
               MOVE 66318      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER  TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES       TO REF-VALUES SUB-SYS-BUFFER
               MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
               MOVE EQP-TITLE-1  TO HDR1-BUF
               MOVE EQP-TITLE-2  TO HDR2-BUF
               MOVE EQP-TITLE-3  TO HDR3-BUF
               MOVE EQP-TITLE-4  TO HDR4-BUF
               MOVE EQP-TITLE-5  TO HDR5-BUF
               MOVE EQP-TITLE-6  TO HDR6-BUF
               MOVE EQP-TITLE-7  TO HDR7-BUF
               MOVE EQP-TITLE-8  TO HDR8-BUF
               MOVE "X"          TO RECORD-SW
               GO TO 6-MAIN.

           PERFORM 69-READ-TYPE-REFERENCE.
           IF COND-WORD = 0
               MOVE 66319      TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-SUB-KEY TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE "X"        TO RECORD-SW
               GO TO 6-MAIN.

           MOVE TYPE-KEY-BUF   TO TYPE-SUB-KEY.
           MOVE REF-VALUES     TO TYPE-SCREEN-VALUES.
           PERFORM 69-WRITE-TYPE-REFERENCE.
           IF COND-WORD = 0
               MOVE 66318      TO CATREAD-MSG-NUMBER
      ****************
      * RECORD ADDED *
      *PRESS  DESIRED*
      * FUNCTION KEY *
      * OR  CONTINUE *
      *ADDING RECORDS*
      ****************
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
               MOVE MESSAGE-BUFFER  TO SCREEN-CMD-LINE
               MOVE TRUE-VAL   TO INDS (98)
               MOVE SCREEN-BUFFER TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
               MOVE SPACES     TO REF-VALUES SUB-SYS-BUFFER
               MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER
               MOVE EQP-TITLE-1 TO HDR1-BUF
               MOVE EQP-TITLE-2 TO HDR2-BUF
               MOVE EQP-TITLE-3 TO HDR3-BUF
               MOVE EQP-TITLE-4 TO HDR4-BUF
               MOVE EQP-TITLE-5 TO HDR5-BUF
               MOVE EQP-TITLE-6 TO HDR6-BUF
               MOVE EQP-TITLE-7 TO HDR7-BUF
               MOVE EQP-TITLE-8 TO HDR8-BUF
               MOVE "X" TO RECORD-SW
               GO TO 6-MAIN
           ELSE
           GO TO 6-MAIN-LOOP.

       6-MAIN-EXIT.    EXIT.

       62-SS-ADJUST.
           IF SS-BUF-1 = SPACE MOVE "0" TO SS-BUF-1.
           IF SS-BUF-2 = SPACE MOVE "0" TO SS-BUF-2.
           IF SS-BUF-3 = SPACE MOVE "0" TO SS-BUF-3.
           IF SS-BUF-4 = SPACE MOVE "0" TO SS-BUF-4.

       69-READ-FIELD-NAMES.
           MOVE 0              TO COND-WORD.
           MOVE 1              TO REL-KEY.
           READ FIELD-NAMES    INTO EQP-TITLE-DATA
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF FN-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REFERENCE.
           MOVE 0              TO COND-WORD.
           MOVE TYPE-KEY-BUF   TO EQRTYSUBK OF TRREC.
           START TYPE-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-REFERENCE.
           MOVE 0              TO COND-WORD.
           READ TYPE-REFERENCE NEXT INTO TYPE-REF-DATA
               AT END          MOVE 15 TO COND-WORD.
           IF TYPE-KEY-BUF NOT = EQRTYSUBK OF TRREC
               MOVE 15         TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-WRITE-TYPE-REFERENCE.
           MOVE 0              TO COND-WORD.
           WRITE TRREC         FROM TYPE-REF-DATA
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF TR-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE   FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK   FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0"       TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3          TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM   TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0"         TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

       999-CATREAD.
           MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

