000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TTYPDEL2.
000600*REMARKS.  ***  THIS PROGRAM DELETES ALL RECORDS
000700*               OF A GIVEN GENERIC TYPE NUMBER FROM
000800*               THE EQUIPMENT REFERENCE FILE
001100*                   ****.
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TYPE-OPERATIONS
               ASSIGN TO DATABASE-MCFLER0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS TOPE-STATUS.
           SELECT TYPE-REFERENCE
               ASSIGN TO DATABASE-MCFLER0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS TREF-STATUS.
           SELECT TYPE-REMARKS
               ASSIGN TO DATABASE-MCFLER0401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS TREM-STATUS.
002200 DATA DIVISION.
       FILE SECTION.
       FD  TYPE-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TOPEREC.
       01  TOPEREC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.
       FD  TYPE-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TREFREC.
       01  TREFREC.
           COPY DDS-ALL-FORMATS OF MCFLER0201.
       FD  TYPE-REMARKS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TREMREC.
       01  TREMREC.
           COPY DDS-ALL-FORMATS OF MCFLER0401.
001800 WORKING-STORAGE SECTION.
001900 77  DEL-SW                  PIC S9(4) COMP-4.
002000
       01  BLOWUP-BASE             PIC X(16).

       COPY CATREAD OF COPYLIB.

       COPY CPYIND  OF COPYLIB.

       01  FILE-STATUSES.
           05  TOPE-STATUS         PIC XX.
           05  TREF-STATUS         PIC XX.
           05  TREM-STATUS         PIC XX.

       COPY IOFEEDBACK OF COPYLIB.

002100 01  PASSWORD-INFORMATION.
002200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPDEL2".
002300     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002500     05  PROGRAM-DESCRIPTION.
002600         10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "DELETES ALL ".
                   15  FILLER      PIC X(16) VALUE "GENERIC RECORDS ".
                   15  FILLER      PIC X(16) VALUE "OF THE SELECTED ".
                   15  FILLER      PIC X(16) VALUE "EQUIPMENT TYPE  ".
002800         10  PROG-DESC-B.
                   15  FILLER      PIC X(16) VALUE "NUMBER FROM THE ".
                   15  FILLER      PIC X(10) VALUE "EQUIPMENT ".
                   15  FILLER      PIC X(34) VALUE "REFERENCE FILE ".
003000         10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F2".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(24) VALUE "DELETION MENU ".
003200     05  PASSWORD-FLAG       PIC X.

       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP IN COPYLIB.

008700 01  TYPE-OPER-DATA.
008800     05  TYPE-SUB-KEY-OPS.
008900         10  TYPE-SUB-OPS    PIC X(08).
009000         10  SUB-SYS-OPS     PIC X(04).
009100     05  OPS-COR-12.
009200         10  EQP-OPS-1       PIC X(66).
009300         10  EQP-OPS-2       PIC X(66).
009400         10  EQP-OPS-3       PIC X(66).
009500         10  EQP-OPS-4       PIC X(66).
009600         10  EQP-OPS-5       PIC X(66).
009700         10  EQP-OPS-6       PIC X(66).
009800         10  EQP-COR-1       PIC X(66).
009900         10  EQP-COR-2       PIC X(66).
010000         10  EQP-COR-3       PIC X(66).
010100         10  EQP-COR-4       PIC X(66).
010200         10  EQP-COR-5       PIC X(66).
010300         10  EQP-COR-6       PIC X(66).
010400
004300 01  TYPE-REF-DATA.
004400     05  TYPE-SUB-KEY-REF.
004500         10  TYPE-NUM-REF    PIC X(08).
004600         10  SUB-SYS-REF     PIC X(04).
004700     05  TYPE-REF-VALUES.
004800         10  EQP-MFG         PIC X(16).
004900         10  EQP-MOD         PIC X(16).
005000         10  EQP-SER         PIC X(16).
005100         10  EQP-PROP-NUM    PIC X(08).
005200         10  EQP-NAME-1      PIC X(16).
005300         10  EQP-FIELD-1     PIC X(16).
005400         10  EQP-NAME-2      PIC X(16).
005500         10  EQP-FIELD-2     PIC X(16).
005600         10  EQP-NAME-3      PIC X(16).
005700         10  EQP-FIELD-3     PIC X(16).
005800         10  EQP-NAME-4      PIC X(16).
005900         10  EQP-FIELD-4     PIC X(16).
006000         10  EQP-NAME-5      PIC X(16).
006100         10  EQP-FIELD-5     PIC X(16).
006200         10  EQP-NAME-6      PIC X(16).
006300         10  EQP-FIELD-6     PIC X(16).
006400         10  EQP-NAME-7      PIC X(16).
006500         10  EQP-FIELD-7     PIC X(16).
006600         10  EQP-NAME-8      PIC X(16).
006700         10  EQP-FIELD-8     PIC X(16).
006800
006900 01  TYPE-REMARKS-DATA.
007000     05  TYPE-SUB-KEY-REM.
007100         10  TYPE-SUB-REM    PIC X(08).
007200         10  SUB-SYS-REM     PIC X(04).
007300     05  REMARKS-12.
007400         10  EQP-REM-1       PIC X(66).
007500         10  EQP-REM-2       PIC X(66).
007600         10  EQP-REM-3       PIC X(66).
007700         10  EQP-REM-4       PIC X(66).
007800         10  EQP-REM-5       PIC X(66).
007900         10  EQP-REM-6       PIC X(66).
008000         10  EQP-REM-7       PIC X(66).
008100         10  EQP-REM-8       PIC X(66).
008200         10  EQP-REM-9       PIC X(66).
008300         10  EQP-REM-10      PIC X(66).
008400         10  EQP-REM-11      PIC X(66).
008500         10  EQP-REM-12      PIC X(66).
008600
003900 01  TYPE-SUB-KEY.
004000     05  TYPE-EQUIP-NUM      PIC X(08).
004100     05  SUB-SYS-NUM         PIC X(04).
004200
003900 01  TYPE-SUB-KEY-0.
004000     05  TYPE-EQUIP-NUM-0    PIC X(08).
004100     05  SUB-SYS-NUM-0       PIC X(04).
004200
       COPY WSCONTROL OF COPYLIB.
012500 LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.
012700 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
013000 01  EQP-SUB-BUFFER.
013100     05  EQP-NUM-BUF         PIC X(06).
013200     05  SUB-SYS-BUF         PIC X(04).
013300     05  EQP-SUB-DESC-BUF    PIC X(40).
013400     05  EQP-TYPE-BUF        PIC X(08).
013500     05  ACD-FUNCTION        PIC X(06).
013600     05  ACD-SW              PIC X(01).
013700
013800 PROCEDURE DIVISION USING VIEW-COMAREA
013900                          DBPARAMETERS
014200                          EQP-SUB-BUFFER.
014300 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.
       2-EOJ.
           CLOSE TYPE-OPERATIONS.
           CLOSE TYPE-REFERENCE.
           CLOSE TYPE-REMARKS.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   TYPE-OPERATIONS.
           OPEN I-O   TYPE-REFERENCE.
           OPEN I-O   TYPE-REMARKS.
014500     CALL "TPWORD" USING PASSWORD-INFORMATION.
014900     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
015500     MOVE EQP-TYPE-BUF TO TYPE-EQUIP-NUM TYPE-EQUIP-NUM-0.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE 0 TO DEL-SW.
015600     MOVE "0000" TO SUB-SYS-NUM SUB-SYS-NUM-0.
           PERFORM 69-START-TYPE-REFERENCE.
           IF COND-WORD = 17
               NEXT SENTENCE
           ELSE
           PERFORM 69-READ-TYPE-REFERENCE
           IF COND-WORD = 15
               NEXT SENTENCE
           ELSE
           PERFORM 61-DEL-REM THRU 61-DR-EXIT
                            UNTIL DEL-SW = 1
           PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                            UNTIL DEL-SW = 2.
           MOVE 0 TO DEL-SW.
015900
016000 6-MAIN.
016100     PERFORM 69-START-TYPE-REFERENCE-2.
           IF COND-WORD = 17
               MOVE 3 TO VIEW-LASTKEY
               GO TO 6-MAIN-EXIT.
           PERFORM 69-READ-TYPE-REFERENCE.
           IF COND-WORD = 0
016500         MOVE SUB-SYS-REF TO SUB-SYS-NUM
016600         PERFORM 61-DEL-REM THRU 61-DR-EXIT
016700                          UNTIL DEL-SW = 1
016800         PERFORM 61-DEL-OPS THRU 61-DO-EXIT
016900                          UNTIL DEL-SW = 2
017000         PERFORM 69-DELETE-TYPE-REFERENCE
               MOVE 0 TO DEL-SW
               GO TO 6-MAIN
           ELSE
016500     MOVE SUB-SYS-REF TO SUB-SYS-NUM
016600     PERFORM 61-DEL-REM THRU 61-DR-EXIT
016700                      UNTIL DEL-SW = 1
016800     PERFORM 61-DEL-OPS THRU 61-DO-EXIT
016900                      UNTIL DEL-SW = 2.
017100     MOVE 3 TO VIEW-LASTKEY.

       6-MAIN-EXIT.    EXIT.

020700 61-DEL-REM.
020800     PERFORM 69-START-TYPE-REMARKS.
021200     IF COND-WORD = 0
021300         PERFORM 61-GET-REM UNTIL COND-WORD = 15
021400         MOVE 1 TO DEL-SW
021500         GO TO 61-DR-EXIT
021600     ELSE
021700     MOVE 1 TO DEL-SW
021800     GO TO 61-DR-EXIT.
021900
022000 61-GET-REM.
022100     PERFORM 69-READ-TYPE-REMARKS.
022300     IF COND-WORD = 0
023200         PERFORM 69-DELETE-TYPE-REMARKS
023300         IF COND-WORD = 17
                   MOVE "ERROR DETECTED DELETING REMARKS * TTYPDEL2 *"
                       TO BU-DISPLAY-MSG
024000             PERFORM 998-BLOWUP.
025800
025900 61-DR-EXIT.    EXIT.
026000
026100 61-DEL-OPS.
026200     PERFORM 69-START-TYPE-OPERATIONS.
026600     IF COND-WORD = 0
026700         PERFORM 61-GET-OPS UNTIL COND-WORD = 15
026800         MOVE 2 TO DEL-SW
026900         GO TO 61-DO-EXIT
027000     ELSE
027100     MOVE 2 TO DEL-SW
027200     GO TO 61-DO-EXIT.
027300
027400 61-GET-OPS.
027500     PERFORM 69-READ-TYPE-OPERATIONS.
027700     IF COND-WORD = 0
028600         PERFORM 69-DELETE-TYPE-OPERATIONS
               IF COND-WORD = 17
                   MOVE "ERROR DETECTED DELETING OP-SETS * TTYPDEL2 *"
                       TO BU-DISPLAY-MSG
029400             PERFORM 998-BLOWUP.
031300
031400 61-DO-EXIT.    EXIT.
031500
       69-DELETE-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY TO EQRTYSUBK OF TOPEREC.
           START TYPE-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           READ TYPE-OPERATIONS NEXT INTO TYPE-OPER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TYPE-SUB-KEY NOT = EQRTYSUBK OF TOPEREC
               MOVE 15 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-DELETE-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-REFERENCE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE "ERROR DETECTED DELETING TYPE RECORD * TTYPDEL2 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.

       69-READ-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           READ TYPE-REFERENCE NEXT INTO TYPE-REF-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TYPE-NUM-REF NOT = TYPE-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY-0 TO EQRTYSUBK OF TREFREC.
           START TYPE-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REFERENCE-2.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY-0 TO EQRTYSUBK OF TREFREC.
           START TYPE-REFERENCE KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-REMARKS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY TO EQRTYSUBK OF TREMREC.
           START TYPE-REMARKS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           READ TYPE-REMARKS NEXT INTO TYPE-REMARKS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TYPE-SUB-KEY NOT = EQRTYSUBK OF TREMREC
               MOVE 15 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 15 TO COND-WORD.

076200 998-BLOWUP.
076300     MOVE "TTYPDEL2" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
