000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TTYPDEL4.
000600*REMARKS.  ***  THIS PROGRAM ALLOWS MASS CHANGES OF
000700*               ALL GENERIC RECORDS OF SOME TYPE NUMBER
000800*               TO A NEW TYPE NUMBER IN THE
000900*               EQUIPMENT REFERENCE FILE
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.    AS400.
001600 OBJECT-COMPUTER.    AS400.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TYPE-OPERATIONS
               ASSIGN TO DATABASE-MCFLER0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS TOPE-STATUS.
           SELECT TYPE-REFERENCE
               ASSIGN TO DATABASE-MCFLER0201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS TREF-STATUS.
           SELECT TYPE-REMARKS
               ASSIGN TO DATABASE-MCFLER0401
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS TREM-STATUS.
001800 DATA DIVISION.
       FILE SECTION.
       FD  TYPE-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TOPEREC.
       01  TOPEREC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.
       FD  TYPE-REFERENCE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TREFREC.
       01  TREFREC.
           COPY DDS-ALL-FORMATS OF MCFLER0201.
       FD  TYPE-REMARKS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TREMREC.
       01  TREMREC.
           COPY DDS-ALL-FORMATS OF MCFLER0401.
001900 WORKING-STORAGE SECTION.
002000 77  DEL-SW                  PIC S9(4) COMP-4.

       01  BLOWUP-BASE             PIC X(16).

       01  FILE-STATUSES.
           05  TOPE-STATUS         PIC XX.
           05  TREF-STATUS         PIC XX.
           05  TREM-STATUS         PIC XX.

002200 01  PASSWORD-INFORMATION.
002300     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPDEL4".
002400     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002500     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002600     05  PROGRAM-DESCRIPTION.
002700         10  PROG-DESC-A.
                   15  FILLER      PIC X(12) VALUE "ALLOWS MASS ".
                   15  FILLER      PIC X(15) VALUE "CHANGES OF ALL ".
                   15  FILLER      PIC X(15) VALUE "RECORDS OF ONE ".
                   15  FILLER      PIC X(15) VALUE "EQUIPMENT TYPE ".
                   15  FILLER      PIC X(03) VALUE "NUM".
002900         10  PROG-DESC-B.
                   15  FILLER      PIC X(12) VALUE " TO ANOTHER ".
                   15  FILLER      PIC X(15) VALUE "EQUIPMENT TYPE ".
                   15  FILLER      PIC X(14) VALUE "NUMBER IN THE ".
                   15  FILLER      PIC X(14) VALUE "EQUIP. REFER. ".
                   15  FILLER      PIC X(05) VALUE "FILE ".
003100         10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F5".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(15) VALUE "GENERIC RECORD ".
                   15  FILLER      PIC X(17) VALUE "DELETE SCREEN ".
003300     05  PASSWORD-FLAG       PIC X.
003400
       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP IN COPYLIB.

009300 01  TYPE-OPER-DATA.
009400     05  TYPE-SUB-KEY-OPS.
009500         10  TYPE-SUB-OPS    PIC X(08).
009600         10  SUB-SYS-OPS     PIC X(04).
009700     05  OPS-COR-12.
009800         10  EQP-OPS-1       PIC X(66).
009900         10  EQP-OPS-2       PIC X(66).
010000         10  EQP-OPS-3       PIC X(66).
010100         10  EQP-OPS-4       PIC X(66).
010200         10  EQP-OPS-5       PIC X(66).
010300         10  EQP-OPS-6       PIC X(66).
010400         10  EQP-COR-1       PIC X(66).
010500         10  EQP-COR-2       PIC X(66).
010600         10  EQP-COR-3       PIC X(66).
010700         10  EQP-COR-4       PIC X(66).
010800         10  EQP-COR-5       PIC X(66).
010900         10  EQP-COR-6       PIC X(66).
011000
004900 01  TYPE-REF-DATA.
005000     05  TYPE-SUB-KEY-REF.
005100         10  TYPE-NUM-REF    PIC X(08).
005200         10  SUB-SYS-REF     PIC X(04).
005300     05  TYPE-REF-VALUES.
005400         10  EQP-MFG         PIC X(16).
005500         10  EQP-MOD         PIC X(16).
005600         10  EQP-SER         PIC X(16).
005700         10  EQP-PROP-NUM    PIC X(08).
005800         10  EQP-NAME-1      PIC X(16).
005900         10  EQP-FIELD-1     PIC X(16).
006000         10  EQP-NAME-2      PIC X(16).
006100         10  EQP-FIELD-2     PIC X(16).
006200         10  EQP-NAME-3      PIC X(16).
006300         10  EQP-FIELD-3     PIC X(16).
006400         10  EQP-NAME-4      PIC X(16).
006500         10  EQP-FIELD-4     PIC X(16).
006600         10  EQP-NAME-5      PIC X(16).
006700         10  EQP-FIELD-5     PIC X(16).
006800         10  EQP-NAME-6      PIC X(16).
006900         10  EQP-FIELD-6     PIC X(16).
007000         10  EQP-NAME-7      PIC X(16).
007100         10  EQP-FIELD-7     PIC X(16).
007200         10  EQP-NAME-8      PIC X(16).
007300         10  EQP-FIELD-8     PIC X(16).
007400
007500 01  TYPE-REMARKS-DATA.
007600     05  TYPE-SUB-KEY-REM.
007700         10  TYPE-SUB-REM    PIC X(08).
007800         10  SUB-SYS-REM     PIC X(04).
007900     05  REMARKS-12.
008000         10  EQP-REM-1       PIC X(66).
008100         10  EQP-REM-2       PIC X(66).
008200         10  EQP-REM-3       PIC X(66).
008300         10  EQP-REM-4       PIC X(66).
008400         10  EQP-REM-5       PIC X(66).
008500         10  EQP-REM-6       PIC X(66).
008600         10  EQP-REM-7       PIC X(66).
008700         10  EQP-REM-8       PIC X(66).
008800         10  EQP-REM-9       PIC X(66).
008900         10  EQP-REM-10      PIC X(66).
009000         10  EQP-REM-11      PIC X(66).
009100         10  EQP-REM-12      PIC X(66).
009200
004500 01  TYPE-SUB-KEY-0.
004600     05  TYPE-EQUIP-NUM-0    PIC X(08).
004700     05  SUB-SYS-NUM-0       PIC X(04).
004800
004500 01  TYPE-SUB-KEY.
004600     05  TYPE-EQUIP-NUM      PIC X(08).
004700     05  SUB-SYS-NUM         PIC X(04).
004800
013900 LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.
014100 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
014400 01  EQP-SUB-BUFFER.
014500     05  EQP-NUM-BUF         PIC X(06).
014600     05  SUB-SYS-BUF         PIC X(04).
014700     05  EQP-SUB-DESC-BUF    PIC X(40).
014800     05  EQP-TYPE-BUF        PIC X(08).
014900     05  ACD-FUNCTION        PIC X(06).
015000     05  ACD-SW              PIC X(01).
015100 01  TYPE-BUFFER.
015200     05  TYPE-NUMBER         PIC X(08).
015300 PROCEDURE DIVISION USING VIEW-COMAREA
015400                          DBPARAMETERS
015700                          EQP-SUB-BUFFER
015800                          TYPE-BUFFER.
015900 BEGIN-PGM.
016000     PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY = 3.
       2-EOJ.
           CLOSE TYPE-OPERATIONS.
           CLOSE TYPE-REFERENCE.
           CLOSE TYPE-REMARKS.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   TYPE-OPERATIONS.
           OPEN I-O   TYPE-REFERENCE.
           OPEN I-O   TYPE-REMARKS.
016100     CALL "TPWORD" USING PASSWORD-INFORMATION.
016500     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
017100     MOVE EQP-TYPE-BUF TO TYPE-EQUIP-NUM TYPE-EQUIP-NUM-0.
017200     MOVE "0000" TO SUB-SYS-NUM SUB-SYS-NUM-0.
           MOVE 0 TO VIEW-LASTKEY.
017500     MOVE 0 TO DEL-SW.
           PERFORM 69-START-TYPE-REFERENCE-0.
           IF COND-WORD = 17
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
           ELSE
           PERFORM 69-READ-TYPE-REFERENCE
           IF COND-WORD = 15
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
           ELSE
           PERFORM 69-DELETE-TYPE-REFERENCE
           IF COND-WORD = 17
               MOVE "DELETE OF TYPE RECORD FAILED * TTYPDEL4 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP
           ELSE
           MOVE TYPE-NUMBER TO TYPE-NUM-REF
           PERFORM 69-WRITE-TYPE-REFERENCE
           IF COND-WORD = 17
               MOVE "ERROR TRYING TO WRITE TYPE RECORD * TTYPDEL4 *"
                   TO BU-DISPLAY-MSG
               PERFORM 998-BLOWUP.
           MOVE 0 TO DEL-SW.

017600 6-MAIN.
           PERFORM 69-START-TYPE-REFERENCE.
018000     IF COND-WORD = 17
                MOVE 3 TO VIEW-LASTKEY
                GO TO 6-MAIN-EXIT.
           PERFORM 69-READ-TYPE-REFERENCE.
           IF COND-WORD = 0
               MOVE SUB-SYS-REF TO SUB-SYS-NUM
               PERFORM 61-DEL-REM THRU 61-DR-EXIT
                                UNTIL DEL-SW = 1
               PERFORM 61-DEL-OPS THRU 61-DO-EXIT
                                UNTIL DEL-SW = 2
               PERFORM 69-DELETE-TYPE-REFERENCE
               IF COND-WORD = 17
                   MOVE "TRYING TO DELETE TYPE RECORD * TTYPDEL4 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               MOVE TYPE-NUMBER TO TYPE-NUM-REF
               PERFORM 69-WRITE-TYPE-REFERENCE
               IF COND-WORD = 17
                   MOVE "TRYING TO WRITE TYPE RECORD * TIERDEL4 *"
                       TO BU-DISPLAY-MSG
                   PERFORM 998-BLOWUP
               ELSE
               MOVE 0 TO DEL-SW
               GO TO 6-MAIN
           ELSE
           MOVE SUB-SYS-REF TO SUB-SYS-NUM
022800     PERFORM 61-DEL-REM THRU 61-DR-EXIT
022900                      UNTIL DEL-SW = 1
023800     PERFORM 61-DEL-OPS THRU 61-DO-EXIT
023900                      UNTIL DEL-SW = 2
           MOVE 3 TO VIEW-LASTKEY.

       6-MAIN-EXIT.    EXIT.
028300
028500 61-DEL-REM.
028600     PERFORM 69-START-TYPE-REMARKS.
028800     IF COND-WORD = 17
               MOVE 1 TO DEL-SW
029300         GO TO 61-DR-EXIT.
029500     PERFORM 69-READ-TYPE-REMARKS.
029700     IF COND-WORD = 0
030600         PERFORM 69-DELETE-TYPE-REMARKS
030700         IF COND-WORD = 17
                   MOVE "TRYING TO DELETE REMARKS" TO BU-DISPLAY-MSG
031400             PERFORM 998-BLOWUP
031500         ELSE
031600         MOVE TYPE-NUMBER TO TYPE-SUB-REM
031700         PERFORM 69-WRITE-TYPE-REMARKS
031900         IF COND-WORD = 17
                   MOVE "TRYING TO WRITE REMARKS" TO BU-DISPLAY-MSG
032600             PERFORM 998-BLOWUP.
034500     MOVE 1 TO DEL-SW.
034600
034700 61-DR-EXIT.    EXIT.
034800
034900 61-DEL-OPS.
035000     PERFORM 69-START-TYPE-OPERATIONS.
035300     IF COND-WORD = 17
035800         MOVE 2 TO DEL-SW
               GO TO 61-DO-EXIT.
035900     PERFORM 69-READ-TYPE-OPERATIONS.
036100     IF COND-WORD = 0
037000         PERFORM 69-DELETE-TYPE-OPERATIONS
037100         IF COND-WORD = 17
                   MOVE "TRYING TO DELETE OP-SETS" TO BU-DISPLAY-MSG
037800             PERFORM 998-BLOWUP
037900         ELSE
038000         MOVE TYPE-NUMBER TO TYPE-SUB-OPS
038100         PERFORM 69-WRITE-TYPE-OPERATIONS
038300         IF COND-WORD = 17
                   MOVE "TRYING TO WRITE OP-SETS" TO BU-DISPLAY-MSG
039000             PERFORM 998-BLOWUP.
040900     MOVE 2 TO DEL-SW.
041100
041200 61-DO-EXIT.    EXIT.
045700
       69-DELETE-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-OPERATIONS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY TO EQRTYSUBK OF TOPEREC.
           START TYPE-OPERATIONS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           READ TYPE-OPERATIONS NEXT INTO TYPE-OPER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TYPE-SUB-KEY NOT = EQRTYSUBK OF TOPEREC
               MOVE 15 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-WRITE-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           WRITE TOPEREC FROM TYPE-OPER-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TOPE-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-REFERENCE RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REFERENCE-0.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY-0 TO EQRTYSUBK OF TREFREC.
           START TYPE-REFERENCE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY TO EQRTYSUBK OF TREFREC.
           START TYPE-REFERENCE KEY > EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           READ TYPE-REFERENCE NEXT INTO TYPE-REF-DATA
               AT END   MOVE 15 TO COND-WORD.
           IF TYPE-NUM-REF NOT = TYPE-EQUIP-NUM
               MOVE 15 TO COND-WORD.
           IF TREF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-WRITE-TYPE-REFERENCE.
           MOVE 0 TO COND-WORD.
           WRITE TREFREC FROM TYPE-REF-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-DELETE-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           DELETE TYPE-REMARKS RECORD
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-START-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           MOVE TYPE-SUB-KEY TO EQRTYSUBK OF TREMREC.
           START TYPE-REMARKS KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           READ TYPE-REMARKS NEXT INTO TYPE-REMARKS-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF TYPE-SUB-KEY NOT = EQRTYSUBK OF TREMREC
               MOVE 15 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-WRITE-TYPE-REMARKS.
           MOVE 0 TO COND-WORD.
           WRITE TREMREC FROM TYPE-REMARKS-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TREM-STATUS NOT = "00" MOVE 17 TO COND-WORD.

076200 998-BLOWUP.
076300     MOVE "TIERDEL4" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
