000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TTYPOPSA.
000600*REMARKS.  ***  THIS PROGRAM ADDS RECORDS TO
000700*               THE OPERATIONS DATASET OF THE
000800*               EQUIPMENT REFERENCE FILE
001100*                   ****.
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.    AS400.
001500 OBJECT-COMPUTER.    AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA
                      LOCAL-DATA IS LOCAL-DATA-AREA.
001000 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZIEQPREF-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT TYPE-OPERATIONS
               ASSIGN TO DATABASE-MCFLER0601
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS TO-STATUS.
001700 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  TYPE-OPERATIONS
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS TOREC.
       01  TOREC.
           COPY DDS-ALL-FORMATS OF MCFLER0601.
001800 WORKING-STORAGE SECTION.
       COPY CATREAD OF COPYLIB.

       COPY CPYIND  OF COPYLIB.

       01  FILE-STATUSES.
           05  DSPLY-STATUS        PIC XX.
           05  TO-STATUS           PIC XX.

       COPY IOFEEDBACK OF COPYLIB.
002000
007800 01  MESSAGE-BUFFER.
007900     05  MESSAGE-LIT         PIC X(38).
           05  MESSAGE-TYPNUM      PIC X(8).
           05  MESSAGE-LIT2        PIC X(13).
           05  MESSAGE-SUBSYS      PIC XXXX.
           05  MESSAGE-LIST3       PIC X(17).

002100 01  PASSWORD-INFORMATION.
002200     05  NAME-OF-PROGRAM     PIC X(08) VALUE "TTYPOPSA".
002300     05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
002400     05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
002500     05  PROGRAM-DESCRIPTION.
002600         10  PROG-DESC-A.
                   15  FILLER      PIC X(14) VALUE "INITIATES THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(15) VALUE "OPERATIONS AND ".
                   15  FILLER      PIC X(16) VALUE "SETTINGS RECORDS".
                   15  FILLER      PIC X(07) VALUE " FOR ".
002800         10  PROG-DESC-B.
                   15  FILLER      PIC X(09) VALUE "SELECTED ".
                   15  FILLER      PIC X(15) VALUE "EQUIPMENT TYPE ".
                   15  FILLER      PIC X(15) VALUE "FOR THE EQUIP. ".
                   15  FILLER      PIC X(21) VALUE "REFER. FILE ".
003000         10  PROG-FUNCTION.
                   15  FILLER      PIC X(16) VALUE "RUNS FROM THE F5".
                   15  FILLER      PIC X(12) VALUE " KEY OF THE ".
                   15  FILLER      PIC X(08) VALUE "GENERIC ".
                   15  FILLER      PIC X(24) VALUE "MAINTENANCE MENU".
003200     05  PASSWORD-FLAG       PIC X.
003300
003900 01  SCREEN-BUFFER.
004000     05  ACD-DISP            PIC X(06).
004100     05  TYPE-SUB-BUF.
004200         10  TYPE-KEY-BUF.
004300             15  TYPE-NUM-BUFFER   PIC X(08).
004400             15  SUB-SYS-BUFFER    PIC X(04).
004500     05  REM-VALUES.
004600         10  REM-1           PIC X(66).
004700         10  REM-VALUES-2-12.
004800             15  REM-2       PIC X(66).
004900             15  REM-3       PIC X(66).
005000             15  REM-4       PIC X(66).
005100             15  REM-5       PIC X(66).
005200             15  REM-6       PIC X(66).
005300             15  REM-7       PIC X(66).
005400             15  REM-8       PIC X(66).
005500             15  REM-9       PIC X(66).
005600             15  REM-10      PIC X(66).
005700             15  REM-11      PIC X(66).
005800             15  REM-12      PIC X(66).
           05  SCREEN-CMD-LINE     PIC X(79).
           05  SCREEN-ERR-LINE     PIC X(79).
005900
       COPY DBSTAT OF COPYLIB.

       COPY TBLOWUP  OF COPYLIB.

       01  TRUE-VAL                PIC 1 VALUE B"1".

006000 01  TYPE-OPER-DATA.
006100     05  TYPE-SUB-KEY.
006200         10  TYPE-SUB-NUMBER PIC X(08).
006300         10  SUB-SYS-NUMBER  PIC X(04).
006400     05  OPS-COR-12.
006500         10  EQP-OPS-1       PIC X(66).
006600         10  EQP-OPS-2       PIC X(66).
006700         10  EQP-OPS-3       PIC X(66).
006800         10  EQP-OPS-4       PIC X(66).
006900         10  EQP-OPS-5       PIC X(66).
007000         10  EQP-OPS-6       PIC X(66).
007100         10  EQP-COR-1       PIC X(66).
007200         10  EQP-COR-2       PIC X(66).
007300         10  EQP-COR-3       PIC X(66).
007400         10  EQP-COR-4       PIC X(66).
007500         10  EQP-COR-5       PIC X(66).
007600         10  EQP-COR-6       PIC X(66).
007700
       COPY WSCONTROL OF COPYLIB.
010500 LINKAGE SECTION.
       COPY VCOMLINK OF COPYLIB.
010700 01  DBPARAMETERS.        COPY DBPARMS OF COPYLIB.
011000 01  EQP-SUB-BUFFER.
011100     05  EQP-NUM-BUF         PIC X(06).
011200     05  SUB-SYS-BUF         PIC X(04).
011300     05  EQP-SUB-DESC-BUF    PIC X(40).
011400     05  EQP-TYPE-BUF        PIC X(08).
011500     05  ACD-FUNCTION        PIC X(06).
011600     05  ACD-SW              PIC X(01).
011700
011800 PROCEDURE DIVISION USING VIEW-COMAREA
011900                          DBPARAMETERS
012200                          EQP-SUB-BUFFER.
012300 BEGIN-PGM.
           PERFORM 1-HSK.
           PERFORM 6-MAIN THRU 6-MAIN-EXIT UNTIL VIEW-LASTKEY > 0.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE TYPE-OPERATIONS.
           GOBACK.
       1-HSK.
           MOVE LOW-VALUES TO STATUS-AREA.
           OPEN I-O   DISPLAY-FILE.
           OPEN I-O   TYPE-OPERATIONS.
012500     CALL "TPWORD" USING PASSWORD-INFORMATION.
012900     IF PASSWORD-FLAG = "N" GO TO 2-EOJ.
           MOVE 0 TO VIEW-LASTKEY.
           MOVE SPACES TO DSPLY-REC.
013500     MOVE "FTYPOPSA" TO VIEW-CFNAME.
013600
013700 6-MAIN.
013800     MOVE SPACES TO SCREEN-BUFFER.
013900     MOVE EQP-TYPE-BUF TO TYPE-NUM-BUFFER.
014000     MOVE SUB-SYS-BUF TO SUB-SYS-BUFFER.
014100     MOVE ACD-FUNCTION TO ACD-DISP.
           MOVE 66297 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE.
           MOVE SCREEN-BUFFER TO DSPLY-REC.
014200     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO SCREEN-BUFFER.
024900     IF VIEW-LASTKEY = 1 OR 2 OR 4
025000         GO TO 6-MAIN-EXIT.
026500     IF REM-VALUES = SPACES
026600         MOVE 2 TO VIEW-LASTKEY
026700         GO TO 6-MAIN-EXIT.
026900     MOVE TYPE-KEY-BUF TO TYPE-SUB-KEY.
027000     MOVE REM-VALUES TO OPS-COR-12.
           PERFORM 69-WRITE-TYPE-OPERATIONS.
029600     IF COND-WORD = 0
032400***************************
032500*  *** RECORD ADDED ***   *
032600* PRESS DESIRED FUNCTION  *
032700*     KEY OR CONTINUE     *
032800*     ADDING RECORDS      *
032900***************************
029700         MOVE 66314 TO CATREAD-MSG-NUMBER
033000         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE TYPE-NUM-BUFFER TO MESSAGE-TYPNUM
               MOVE SUB-SYS-BUFFER  TO MESSAGE-SUBSYS
033100         MOVE MESSAGE-BUFFER TO SCREEN-CMD-LINE
               MOVE SCREEN-BUFFER  TO DSPLY-REC
               MOVE TRUE-VAL TO INDS (98)
               PERFORM 99-SCREEN-WRITE
               PERFORM 98A-SCREEN-READ
               CALL "CLPAUSE2"
033300         GO TO 6-MAIN
029800     ELSE
029900     MOVE 66317 TO CATREAD-MSG-NUMBER
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
           MOVE MESSAGE-BUFFER TO SCREEN-ERR-LINE
           MOVE TRUE-VAL TO INDS (99)
           GO TO 6-MAIN.

       6-MAIN-EXIT.    EXIT.
033400
       69-WRITE-TYPE-OPERATIONS.
           MOVE 0 TO COND-WORD.
           WRITE TOREC FROM TYPE-OPER-DATA
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF TO-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       98A-SCREEN-READ.
           READ DISPLAY-FILE TERMINAL IS TERMINAL-ID
               INDIC IS INDICS
                  NO DATA MOVE DSPLY-STATUS TO DSPLY-STATUS.
           MOVE ALL B"0" TO INDICS.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

034000 999-CATREAD.
034100     MOVE SPACES TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
035100 999-CATREAD-EXIT.    EXIT.
