001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    TUDCACCT.
001300 AUTHOR.        BARBARA WINTER.
001400 INSTALLATION.  GOODYEAR.
001500 DATE-WRITTEN.  MAY 1986.
001600 DATE-COMPILED.
001700*REMARKS.
001800
001900*D   MENU PROGRAM FOR ACCOUNTING USERS.
002000*************************************************************
002100*************************************************************
002200***                     T U D C A C C T                   ***
002300***                                                       ***
002400***        THIS PROGRAM DISPLAYS THE MENU FOR ACCT USERS  ***
002500***      AT SIGN ON TIME.  ANY PROGRAM THE USER CAN       ***
002600***      EXECUTE IS CALLED FROM THIS PROGRAM.  ALL OTHER  ***
002700***      PROGRAMS HAVE BEEN CONVERTED INTO SUBROUTINES    ***
002800***      SO THAT THIS PROGRAM CAN CALL ALL OF THEM        ***
002900***      WITHOUT HAVING THE USER GET OUT OF THIS PROGRAM. ***
003000***      THIS SHOULD SPEED PROCESSING TIME BY ELIMINATING ***
003100***      DATABASE AND TERMINAL OPENS IN EACH PROGRAM.     ***
003200*************************************************************
003300*************************************************************
      *C  JUNE 23, 1994   CR KALMAN
      *C   ADDED CALL TO COBOL ERROR HANDLER -MCXCBLERR.
003301
003400 ENVIRONMENT DIVISION.
003500 CONFIGURATION SECTION.
003600 SOURCE-COMPUTER.    HP-3000.
003700 OBJECT-COMPUTER.    HP-3000.
003800
005100*SPECIAL-NAMES.
005200*    CONDITION-CODE IS C-C.
005300
005400 INPUT-OUTPUT SECTION.
005500 FILE-CONTROL.
005600     SELECT USER-FILE    ASSIGN TO DATABASE-VALIDRCV
                               FILE STATUS IS FILE-STATUS.
           SELECT MPLTINFO
                  ASSIGN TO DATABASE-MCFLCS0501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

005800 DATA DIVISION.
       FILE SECTION.
       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

006000
006100 FD  USER-FILE
006200     RECORD CONTAINS 12 CHARACTERS.
006300 01  USER-RCD                   PIC X(12).
006400
004800 WORKING-STORAGE SECTION.
004900************************************************************
005000*            W O R K I N G   S T O R A G E                 *
005100************************************************************
005800
       01  FILE-STATUS.
           05  FILE-STAT1            PIC X.
           05  FILE-STAT2            PIC X.
005810 01  PASS-RPT-NUMBER           PIC S9(4)    VALUE 0 COMP-4.
005900 01  PLANT-TYPE                PIC 9        VALUE ZERO.
006000     88  AKRON                              VALUE 1.
006100
9406CK 01  SCOPE   PIC X.

006200 01  DUMMY-CODE                PIC X(8)     VALUE SPACES.
006300*----------  THE FOLLOWING VARIABLES ARE PASSED TO PO REPRINT PGM
006400 01  PO-PASS            PIC X(14)    VALUE "P             ".
006500 01  SWITCH-PARAMETERS.
006600     05  FILLER                PIC X        VALUE SPACE.
006700     05  COMPANY-SAVE          PIC X(3)     VALUE SPACES.
006800*----------  END OF PO REPRINT VARIABLES
006900***********************************************************
007000*                    T A B L E S                          *
007100***********************************************************
007200
007300*----------  VALID RECEIVING DEPARTMENTS AND SPOOLER NUMBERS
007400 01  USER-AREA                 PIC X(2400).
007500 01  USER-AREA-RD  REDEFINES USER-AREA.
007600     02  USER-DATA    OCCURS 200 TIMES
007700                      INDEXED BY U-X.
007800         05  USER-NAME-UA      PIC X(8).
007900         05  RCV-DPT-UA        PIC X(4).
008500*----------  WHO CALL RETURNS USER INFORMATION
008600 COPY TSPLPRT OF COPYLIB.
008700
       COPY TSHWRDFM OF COPYLIB.
008800*---------- VSETERROR AND VPUTWINDOW
008900 01  MESSAGE-BUFFER            PIC X(76)    VALUE SPACES.
009000 01  MESSAGE-BUFFER-RD REDEFINES MESSAGE-BUFFER.
009100     05  MSG-BUFFER            PIC X(68).
009200     05  MSG-VALUE             PIC X(8).
009300 01  MESSAGE-BUFLEN            PIC S9(4)    VALUE 76    COMP-4.
009400 01  MESSAGE-ACTLEN            PIC S9(4)    VALUE 0     COMP-4.
009500 01  FIELD-NUMBER              PIC S9(4)    VALUE 1     COMP-4.
009600
009700*---------- VPRINTFORM
009800 01  SCREEN-PRINT-PARMS.
009900     05  PRINT-CTL             PIC S9(4)    VALUE 1     COMP-4.
010000     05  PAGE-CTL              PIC S9(4)    VALUE 49    COMP-4.
010100     05  SPOOL-FIL-OPEN-SW     PIC X        VALUE "Y".
010200 01  RETURN-STATUS             PIC X        VALUE SPACE.
010300
010400*--------- TBLOWUP (PRINTS ERRORS TO AN ERROR FILE "BLOWUP.PUB" +)
010500*--------- (ABORTS PROGRAM.  RUN XBLPRT.OBJECT TO READ ERRORS.)
010600 01  BU-DISPLAY-MSG            PIC X(60)    VALUE SPACES.
010700 01  BU-PGM-NAME               PIC X(8)     VALUE "TUDCACCT".
010800 01  BU-DISPLAY-AREA           PIC X(110)   VALUE ALL "0".
010900 01  BU-DISPLAY-FLDS REDEFINES BU-DISPLAY-AREA.
011000     05  BU-DISPLAY-LINE OCCURS 5 TIMES.
011100         10  BU-DISPLAY-FLD    PIC X(14).
011200         10  BU-DISPLAY-FLD9   PIC S9(8).
011300 01  KSAM-STATUS-AREA          PIC X(2)  VALUE "00".

      *------ WS CONTROL AREA
       01  MAJOR-MINOR                 PIC XXXX.
       01  WS-CONTROL.
           02  FUNCTION-NUM            PIC XX.
                   88  EXIT-KEY-F8-USED                     VALUE "08". LVW000LS
                   88  REFRESH-KEY-F4-USED                  VALUE "04". LVW000LS
                   88  ENTER-KEY-USED                       VALUE "00". LVW000LS
                   88  F1-KEY-USED                          VALUE "01". LVW000LS
                   88  F2-KEY-USED                          VALUE "02". LVW000LS
                   88  F3-KEY-USED                          VALUE "03". LVW000LS
                   88  F4-KEY-USED                          VALUE "04". LVW000LS
                   88  F5-KEY-USED                          VALUE "05". LVW000LS
                   88  F6-KEY-USED                          VALUE "06". LVW000LS
                   88  F7-KEY-USED                          VALUE "07". LVW000LS
                   88  F8-KEY-USED                          VALUE "08". LVW000LS
           02 FUN-KEY REDEFINES FUNCTION-NUM PIC XX.
           02 TERMINAL-ID PIC X(10).
           02 FORMAT-NAME PIC X(10).

       01  DISPLAY-STATUS              PIC X(2).

       COPY IOFEEDBACK OF COPYLIB.
012300**************************************************************
012400*                    D A T A  B A S E                        *
012500**************************************************************
013500 01  MPLTINFO-ARG              PIC X(4)     VALUE "P 01".
013600
013700 01  STATUS-AREA.
013800     03  COND-WORD             PIC S9(4)                COMP-4.
013900         88  GOOD-CALL                      VALUE 0.
014000         88  END-OF-FILE                    VALUE 11.
014100         88  START-OF-CHAIN                 VALUE 14.
014200         88  END-OF-CHAIN                   VALUE 15.
014300         88  NO-ENTRY                       VALUE 17.
014400     03  DATA-LENG             PIC S9(4)                COMP-4.
014500     03  REC-NO                PIC S9(9)                COMP-4.
014600     03  CHAIN-LENG            PIC S9(9)                COMP-4.
014700     03  BKWD-ADDR             PIC S9(9)                COMP-4.
014800     03  FRWD-ADDR             PIC S9(9)                COMP-4.
014900
015000 COPY DBSTHIST OF COPYLIB.
015100 COPY MPLTINFO OF COPYLIB.
015300 COPY VCOMAREA OF COPYLIB.
015500
015600 01  FORMFILE.
015700     05  FORM-FNAME                PIC X(8)  VALUE "FUDCDOCK".
015800     05  FILLER                    PIC X     VALUE ".".
015900     05  FORM-GNAME.
016000         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
016100         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
016200     05  FILLER                    PIC X(19) VALUE SPACES.
018690
018700 01  FORM-NAMES.
018800     05  UDCACCT               PIC X(7)     VALUE "UDCACCT".
018900
019000**********************************************************
019100*               S C R E E N   B U F F E R                *
019200**********************************************************
019300 01  SCREEN-KEY-AREA.
           05  SCREEN-KEY           PIC X(3).
           05  DE-COMMAND-LINE      PIC X(79).
           05  DE-MESSAGE-LINE      PIC X(79).
       01  SCREEN-BUFFER                 PIC X(2000).
019500******************************************************
019600*   MISCELLANEOUS DATA TO PASS TO SUBPROGRAMS        *
019700******************************************************
019800 COPY DOCKMISC OF COPYLIB.
021300
       COPY CATREAD OF COPYLIB.
021400 COPY LANGUAGE OF COPYLIB.
021410 COPY ESCNAM2 OF COPYLIB.
021500
022400 PROCEDURE DIVISION.
022600 00-UDCACCT-MAIN.
022700     PERFORM 100-OPEN-ALL THRU 109-EXIT.
022800
022900     PERFORM 130-INITIALIZATION THRU 139-EXIT.
023000
023100     PERFORM 200-ACCT-MENU-SCREEN THRU 299-EXIT.
023200
023300     PERFORM 110-CLOSE-ALL THRU 119-EXIT.
023400
023500     GOBACK.
023700*************************************************************
023800*              O P E N   A L L   F I L E S                  *
023900*************************************************************
024000 100-OPEN-ALL.
9406CK     MOVE "C" TO SCOPE.
9406CK     CALL "MCXCBLERR" USING SCOPE.

024010
024020     CALL "TESCSEQ" USING ESC-NAME.
024100
           OPEN INPUT MPLTINFO.
           MOVE SPACES TO MISCELLANEOUS-DATA.
           MOVE "MGR     " TO MISC-USER-NAME.
028200     CALL "TSPLPRT" USING SP-RET-CODE, SP-AREA.
028300     IF SP-RET-CODE = "NF"
028400         MOVE "SPOOL KEY NOT FOUND * UDCACCT" TO BU-DISPLAY-MSG
028500         PERFORM 990-BLOWUP THRU 999-EXIT
028600     ELSE
028700     IF SP-RET-CODE NOT = "00"
028800         MOVE "TSPLPRT ERROR * UDCACCT" TO BU-DISPLAY-MSG
028900         PERFORM 990-BLOWUP THRU 999-EXIT.
029000
029100     MOVE SP-SPOOL-NO (1)          TO  SPOOL-PRT-NO.
029200     MOVE SP-SPOOL-NO (2)          TO  ACCTG-PRT-NO.
029300     MOVE SP-SPOOL-NO (3)          TO  PRINT-PRT-NO.
029400
029500 109-EXIT.  EXIT.
029700***********************************************************
029800***********************************************************
029900*         CLOSE ALL FILES AND INITIALIZE USER KEYS        *
030000***********************************************************
030100***********************************************************
030200 110-CLOSE-ALL.
030500     CLOSE MPLTINFO.
030900 119-EXIT.  EXIT.
031000
031100***********************************************************
031200***********************************************************
031300**    AKRON NEEDS TO VERIFY USERS.  READ IN THE FILE     **
031400**    CONTAING VALID USERS, DEPARTMENTS, AND SPOOLERS.   **
031500***********************************************************
031600***********************************************************
031700 130-INITIALIZATION.
031800*----------  FIND THE PLANT NUMBER AND PASS IT TO SUBROUTINES
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY  OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
033300     IF COND-WORD NOT = 0
033400           MOVE "DBGET MPLTINFO - TDOCKUDC " TO BU-DISPLAY-MSG
033500           PERFORM 990-BLOWUP THRU 999-EXIT.
032400     MOVE MPLTINFO-COMPANY TO PLT-NUMBER-PASS, COMPANY-SAVE.
032500     IF TELLS-WHICH-PLANT = "11"
032600        MOVE 1 TO PLANT-TYPE
032700     ELSE
032800        MOVE 0 TO PLANT-TYPE.
032900     MOVE SPACES TO USER-AREA.
033000
034500*----------  FIND THE STOREROOM DEPARTMENTS FOR DIRECT DELIVERY
034600     MOVE "DSTR" TO MPLTINFO-ARG.
           MOVE 0 TO COND-WORD.
           MOVE MPLTINFO-ARG TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO INVALID KEY
                MOVE 17 TO COND-WORD.
034900     IF COND-WORD NOT = 0
035000           MOVE "DBGET MPLTINFO2 - TDOCKUDC " TO BU-DISPLAY-MSG
035100           PERFORM 990-BLOWUP THRU 999-EXIT.
033010     SET U-X TO 1.
033100     IF AKRON
033200        OPEN INPUT USER-FILE
033300        GO TO 135-READ-USER-FILE
033400     ELSE
033500        GO TO 139-EXIT.
033600
033700 135-READ-USER-FILE.
033800     READ USER-FILE INTO USER-DATA (U-X)
033900          AT END CLOSE USER-FILE
034000          GO TO 139-EXIT.
034100     SET U-X UP BY 1.
034200     GO TO 135-READ-USER-FILE.
034300 139-EXIT.  EXIT.
034500**********************************************************
034600**********************************************************
034700*              ACCT MENU EXECUTIVE PROGRAM               *
034800
034900*     OPEN DATABASE, TERMINAL, FILES, ETC.  DISPLAY      *
035000*     THE ACCT MENU AND ALLOW USER TO ENTER PROGRAM      *
035100*     SELECTION.   CALL EACH SUBROUTINE THAT IS          *
035200*     REQUESTED AND RETURN CONTROL BACK TO THIS MENU     *
035300*     AFTERWARDS.  WHEN USER EXITS THIS PROGRAM, SIGN    *
035400*     HIM OFF THE TERMINAL THROUGH THE UDC.              *
035500**********************************************************
035600**********************************************************
035700  200-ACCT-MENU-SCREEN.
035800     MOVE UDCACCT TO VIEW-NFNAME.
037400 205-DISPLAY-SCREEN.
           MOVE SCREEN-KEY-AREA TO SCREEN-BUFFER.
027900     MOVE 7                        TO   SRF-KEYSET.
           MOVE "ZUDCACCT" TO VIEW-CFNAME.
040200     CALL "TSHWRDFM" USING SRF-COMAREA, BU-DISPLAY-MSG,
040300           VIEW-COMAREA, BASE, STATUS-AREA, SRF-SPOOLER-REC,
040400           LANGUAGE-PARMS, SCREEN-BUFFER.
           MOVE SCREEN-BUFFER TO SCREEN-KEY-AREA.
040500     IF SRF-RET-CODE NOT = 0
040600        MOVE "TSHWRDFM ERROR 205 TUDCDOCK" TO BU-DISPLAY-MSG
040700        PERFORM 990-BLOWUP THRU 999-EXIT.
040800
040900     IF VIEW-LASTKEY EQUAL 8
041000        GO TO 299-EXIT.
043200*************************************************************
043300*      POSSIBLE SELECTIONS FROM MENU:                       *
043400*           1.  VQ1 - MASTER VENDOR MENU                    *
043500*           2.  AD1 - UPDATE ACCTING DATA                   *
043600*           3.  AD2 - VALID ACCOUNTING DATA LISTING         *
043700*           4.  RC3 - CORRECT FREIGHT                       *
043800*           5.  Q1  - MATERIAL STATUS BY CORP-CODE          *
043900*           6.  Q2  - PO INQUIRY BY PO                      *
044000*           7.  Q3  - RECEIVING SLIP INQUIRY                *
044100*           8.  Q4  - PO-RCV SLIP INQUIRY BY CODE           *
044200*           9.  Q5  - PO INQUIRY BY VENDOR CODE             *
044300*          10.  Q6  - VENDOR INQUIRY                        *
044400*************************************************************
044410     IF SCREEN-KEY = "VQ1"
044420        MOVE "ZVENEXEC" TO VIEW-CFNAME
044430        CALL "SVENEXES" USING BASE,
044440                              VIEW-COMAREA,
044450                              SPOOL-PRT-NO,
044460                              PLT-NUMBER-PASS,
044470                              LANGUAGE-PARMS
044471                              FORMFILE
044480        MOVE "ZUDCACCT" TO VIEW-CFNAME
044490        GO TO 200-ACCT-MENU-SCREEN.
044491
044500     IF SCREEN-KEY = "AD1"
044600        CALL "SDEACCS" USING BASE, VIEW-COMAREA, LANGUAGE-PARMS
044700        GO TO 200-ACCT-MENU-SCREEN.
044800
044900     IF SCREEN-KEY = "AD2"
045000        MOVE "ZRSCREEN" TO VIEW-CFNAME
045200        MOVE 25 TO PASS-RPT-NUMBER
045300        CALL "SRSCRNS" USING BASE, VIEW-COMAREA, LANGUAGE-PARMS,
045400                             PASS-RPT-NUMBER
046100           MOVE "ZUDCACCT" TO VIEW-CFNAME
047400           GO TO 200-ACCT-MENU-SCREEN.
047500     IF SCREEN-KEY = "RC3"
047600        MOVE "ZUDCDOCK" TO VIEW-CFNAME
047700        CALL "SMODFRTS" USING VIEW-COMAREA,
047800                              MISCELLANEOUS-DATA,
047900                              USER-AREA,
048100                              LANGUAGE-PARMS,
048110                              ESC-NAME
048200        MOVE "ZUDCACCT" TO VIEW-CFNAME
048300        GO TO 200-ACCT-MENU-SCREEN.
048400
048500     IF SCREEN-KEY = "Q1 "
048600        MOVE "ZCSISINQ" TO VIEW-CFNAME
048700        CALL "TMTLSTAT" USING BASE,
048800                              VIEW-COMAREA,
048900                              PLT-NUMBER-PASS,
049000                              SPOOL-PRT-NO,
049100                              DUMMY-CODE,
049200                              LANGUAGE-PARMS
049300        MOVE "ZUDCACCT" TO VIEW-CFNAME
049400        GO TO 200-ACCT-MENU-SCREEN.
049500
049600     IF SCREEN-KEY = "Q3 "
049700        MOVE "ZCSISINQ" TO VIEW-CFNAME
049800        CALL "SRSINQS"  USING BASE,
049900                              VIEW-COMAREA,
050000                              LANGUAGE-PARMS
050100        MOVE "ZUDCACCT" TO VIEW-CFNAME
050200        GO TO 200-ACCT-MENU-SCREEN.
050300
050400     IF SCREEN-KEY = "Q2 "
050500        MOVE "ZCSISINQ" TO VIEW-CFNAME
050600        CALL "SPOINQ"   USING BASE,
050700                              BASE-STHIST,
050800                              VIEW-COMAREA,
050900                              PLT-NUMBER-PASS,
051000                              LANGUAGE-PARMS
051100        MOVE "ZUDCACCT" TO VIEW-CFNAME
051200        GO TO 200-ACCT-MENU-SCREEN.
051300
051400     IF SCREEN-KEY = "Q4 "
050500        MOVE "ZCSISINQ" TO VIEW-CFNAME
051600        CALL "TPOINQCS" USING BASE,
051700                              VIEW-COMAREA,
051800                              LANGUAGE-PARMS
051100        MOVE "ZUDCACCT" TO VIEW-CFNAME
052000        GO TO 200-ACCT-MENU-SCREEN.
052100
052200     IF SCREEN-KEY = "Q5 "
050500        MOVE "ZCSISINQ" TO VIEW-CFNAME
052400        CALL "SPOBYVEN" USING BASE,
052500                              VIEW-COMAREA,
052600                              LANGUAGE-PARMS,
052700                              FORMFILE
051100        MOVE "ZUDCACCT" TO VIEW-CFNAME
052900        GO TO 200-ACCT-MENU-SCREEN.
053000
053100     IF SCREEN-KEY = "Q6 "
050500        MOVE "ZCSISINQ" TO VIEW-CFNAME
053300        CALL "SVENINQS" USING BASE,
053400                              SPOOL-PRT-NO
053410                              FORMFILE,
053500                              VIEW-COMAREA,
053600                              LANGUAGE-PARMS,
051100        MOVE "ZUDCACCT" TO VIEW-CFNAME
053800        GO TO 200-ACCT-MENU-SCREEN.
053900
054000
054100     GO TO 200-ACCT-MENU-SCREEN.
054200
057700 299-EXIT.  EXIT.
059100******************************************************************
059200******************************************************************
059300*   DISPLAY ERROR MESSAGE FOR SPECIFIC FIELD ON INVENTORY SCREEN *
059400******************************************************************
059500******************************************************************
059600 940-VSETERROR.
           MOVE "Y" TO SRF-ERROR-SW.
           MOVE B"1" TO IND (FIELD-NUMBER).
           MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
051300
061000 949-EXIT.  EXIT.
062600************************************************************
062700************************************************************
062800*                    B L O W U P                           *
062900*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
063000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
063100*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
063200*                                                          *
063300*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
063400*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
063500*                                                          *
063600*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *
063700************************************************************
063800************************************************************
063900 990-BLOWUP.
064000     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
064100     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
064200           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
064300           BU-DISPLAY-FLDS.
064400 999-EXIT.  EXIT.
064500
064600 999-CATREAD.
           MOVE LANG-SETNUM TO CATREAD-MSG-SET.
           MOVE LANG-MSGNUM TO CATREAD-MSG-NUM.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.
066200 999-CATREAD-EXIT.
066300     EXIT.
066400
