       IDENTIFICATION DIVISION.
       PROGRAM-ID.      TUPDPRCB.
       AUTHOR.          CA YODER.
       DATE-WRITTEN.    FEB 2001.

      ************************************************************
      *                                                          *
      *   T U P D P R C B      THIS PROGRAM WILL UPDATE THE      *
      *     MARKET COST OF MSTORERM AND THE PO PRICE OF DPOITEM  *
      *     WITH THE PARAMETERS PASSED FROM "TUPDPRC."           *
      *                                                          *
      ************************************************************
      *C
      *C

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  IBM-AS400.
       OBJECT-COMPUTER.  IBM-AS400.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT MSTORERM-CD
               ASSIGN           TO DATABASE-MCFLCS0201
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS      IS FILE-STATUS.

           SELECT MPLTINFO-I
               ASSIGN           TO DATABASE-MCFLCS0501
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS      IS FILE-STATUS.

           SELECT DPORECD-PO-O
               ASSIGN           TO DATABASE-MCFLCS0901
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT DPOITEM-CD
               ASSIGN           TO DATABASE-MCFLCS1001
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT MVALIDUM-I
               ASSIGN           TO DATABASE-MCFLCS0401
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS      IS FILE-STATUS.

           SELECT DDAILYTC-O
               ASSIGN           TO DATABASE-MCFLCS1601
               ORGANIZATION     IS INDEXED
               ACCESS MODE      IS DYNAMIC
               RECORD KEY       IS EXTERNALLY-DESCRIBED-KEY
                 WITH DUPLICATES
               FILE STATUS      IS FILE-STATUS.

           SELECT PRC-RPT-O
               ASSIGN           TO DISK-PRCRPTF
               FILE STATUS      IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  MSTORERM-CD
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MPLTINFO-I
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC-I.
           COPY DDS-ALL-FORMATS  OF MCFLCS0501.

       FD  DPORECD-PO-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-PO-REC-O.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  DPOITEM-CD
           LABEL RECORDS ARE STANDARD.
       01  DPOITEM-CD-REC.
           COPY DDS-MCRPCS1000  OF MCFLCS1001.

       FD  MVALIDUM-I
           LABEL RECORDS ARE STANDARD.
       01  MVALIDUM-I-REC.
           COPY DDS-ALL-FORMATS OF MCFLCS0401.

       FD  DDAILYTC-O
           LABEL RECORDS ARE STANDARD.
       01  DDAILYTC-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS1601.

       FD  PRC-RPT-O
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 133 CHARACTERS
           DATA RECORD IS PRC-RPT-REC.
       01  PRC-RPT-REC.
           05  RPT-CTL                   PIC X(1).
           05  RPT-LINE.
               10  CONTROL-DATE          PIC X(6).
               10  FILLER                PIC X(126).

       WORKING-STORAGE SECTION.
       77  SAVE-VENDOR-ID               PIC X  VALUE SPACE.
       77  PAGE-COUNT                   PIC 999.
       77  LINE-COUNT                   PIC 99.
       77  REC-PROCESSED                PIC X  VALUE "N".
       77  CODE-ERR-SW                  PIC X  VALUE "N".
       77  NUM-ERRORS                   PIC 9(5).
       77  NUM-UPDATES                  PIC 9(5)  VALUE 0.
       77  HOLD-COMPANY-CODE            PIC X(3).
       77  SAVE-HOME-CUR-CODE           PIC X(2)  VALUE SPACES.
       77  SAVE-CF-MKT-COST             PIC 9(11)V9(4).

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  CURRENT-DATE-CN.
           05  CURR-CC            PIC X(2).
           05  CURR-YMD.
               10  CURR-YY        PIC X(2).
               10  CURR-MM        PIC X(2).
               10  CURR-DD        PIC X(2).

       01  CURRENT-TIME                        VALUE SPACES.
           05  CURR-HR            PIC X(2).
           05  CURR-MIN           PIC X(2).
           05  CURR-SEC           PIC X(2).

       01  PLT-ARG                PIC X(4).
       01  CODE-ARG               PIC X(8).

       01  BUILD-CC-KEY.
           05  BUILD-CC-VALUE        PIC X(2)     VALUE SPACES.

       01  BUILD-CUR-KEY.
           05  CUR-KEY-LIT               PIC X(2).
           05  CUR-KEY                   PIC X(2).

       01  DATA-LINE.
           05  CF-CODE              PIC X(7).
           05  CF-MKT-COST          PIC 9(11)V9(4).
           05  CF-UM                PIC X(2).
           05  CF-USER-NAME         PIC X(8).

      *-------------------------------------------------------------*
      *           S W I T C H E S   &   T A B L E S                 *
      *-------------------------------------------------------------*

       01  INPUT-PO-EOF-SW             PIC X       VALUE "N".
       01  DPOITEM-EOF-SW              PIC X       VALUE "N".

      *-------------------------------------------------------------*
      *               D A T A B A S E   B U F F E R S               *
      *-------------------------------------------------------------*

       COPY MSTORERM IN COPYLIB.

       COPY DPORECD  IN COPYLIB.

       COPY DPOITEM  IN COPYLIB.

       COPY MVALIDUM IN COPYLIB.

       COPY MPLT0    IN COPYLIB.
       COPY MPLTP01  IN COPYLIB.
       COPY MPLTCUR  IN COPYLIB.

       COPY DDAILYTC IN COPYLIB.
       COPY TC311    IN COPYLIB.
       COPY TC411    IN COPYLIB.

      *-------------------------------------------------------------*
      *              U T I L I T Y   B U F F E R S                  *
      *-------------------------------------------------------------*

       COPY TBLOWUP  IN COPYLIB.

       COPY LANGUAGE IN COPYLIB.

       COPY DATAB    IN COPYLIB.

       COPY VCOMAREA IN COPYLIB.

       COPY TUMCF    IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

       01  PO-TRACK-DATA.
           COPY DPOTRACK      OF COPYLIB.

       COPY CATREAD  IN COPYLIB.

       COPY CDESC    IN COPYLIB.

      *-------------------------------------------------------------*
      *                  R E P O R T   L I N E S                    *
      *-------------------------------------------------------------*

       01  PRT-RPT-HDG-1.
           05  PRT-ERR-HDG-1-MM  PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-ERR-HDG-1-DD  PIC X(2).
           05                    PIC X(1) VALUE "/".
           05  PRT-ERR-HDG-1-YY  PIC X(2).
           05                    PIC X(12).
           05                    PIC X(39)
               VALUE "OPEN PURCHASE ORDER PRICE UPDATE REPORT".
      *****05                    PIC X(13).
      *-------------- TESTING ONLY --------------
           05                    PIC X(13)
               VALUE "  *TESTING*  ".
      *------------------------------------------

           05                    PIC X(8) VALUE "TUPDPRCB".

       01  PRT-RPT-HDG-2.
           05  PRT-ERR-HDG-2-HR  PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-ERR-HDG-2-MIN PIC X(2).
           05                    PIC X(1) VALUE ":".
           05  PRT-ERR-HDG-2-SEC PIC X(2).
           05                    PIC X(22).
           05                    PIC X(12) VALUE ALL "UPDATED BY: ".
           05  PRT-HDG-USER      PIC X(8).
           05                    PIC X(22).
           05                    PIC X(5) VALUE "PAGE ".
           05  PRT-ERR-HDG-2-PG  PIC ZZ9.

       01  PRT-RPT-HDG-3.
           05                    PIC X.
           05                    PIC X(11) VALUE " PO NUMBER ".
           05                    PIC X(2).
           05                    PIC X(4)  VALUE "ITEM".
           05                    PIC X(2).
           05                    PIC X(4)  VALUE "CURR".
           05                    PIC X(2).
           05                    PIC X(13) VALUE "  PREV PRICE ".
           05                    PIC X(2).
           05                    PIC X(13) VALUE "  NEW PRICE  ".
           05                    PIC X(2).
           05                    PIC X(2)  VALUE "UM".
           05                    PIC X(2).
           05                    PIC X(7)  VALUE "MESSAGE".

       01  PRT-RPT-HDG-4.
           05                    PIC X.
           05                    PIC X(11) VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(4)  VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(4)  VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(13) VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(13) VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(2)  VALUE ALL "-".
           05                    PIC X(2).
           05                    PIC X(20) VALUE ALL "-".

       01  PRT-RPT-HDG-5.
           05                    PIC X(6) VALUE "CODE: ".
           05  PRT-RPT-CODE      PIC X(7).
           05                    PIC X(2).
           05  PRT-KM            PIC X(46).

       01  PRT-RPT-HDG-6.
           05                    PIC X(17) VALUE "NEW MARKET COST: ".
           05  PRT-RPT-MKT-COST  PIC Z(10)9.9999.
           05                    PIC X.
           05  PRT-RPT-UM        PIC X(2).
           05                    PIC X(2).
           05  PRT-CURRENCY      PIC X(14).

       01  PRT-RPT-DETAIL.
           05                    PIC X.
           05  PRT-DET-PO-NUM    PIC X(7).
           05                    PIC X     VALUE "-".
           05  PRT-DET-RLSE      PIC X(3).
           05                    PIC X(2).
           05  PRT-DET-ITEM      PIC X(4).
           05                    PIC X(3).
           05  PRT-CURR-CODE     PIC X(2).
           05                    PIC X(3).
           05  PRT-DET-PREV      PIC Z(7)9.9999.
           05                    PIC X(2).
           05  PRT-DET-PRICE     PIC Z(7)9.9999.
           05                    PIC X(2).
           05  PRT-DET-UM        PIC X(2).
           05                    PIC X(2).
           05  PRT-DET-MSG       PIC X(20).

      *-------------------------------------------------------------*
      *            P R O C E D U R E   D I V I S I O N              *
      *-------------------------------------------------------------*

       PROCEDURE DIVISION.

       BEGIN-HERE.

           PERFORM 1-HSK.

           PERFORM 6-MAIN.

           PERFORM 2-EOJ.

           GOBACK.

       1-HSK.
           OPEN I-O     DPOITEM-CD     MSTORERM-CD     DDAILYTC-O
                INPUT   MPLTINFO-I     DPORECD-PO-O    MVALIDUM-I
                EXTEND  PRC-RPT-O.

           ACCEPT DATA-LINE.
           DISPLAY "DATA-LINE:  " DATA-LINE.
           ACCEPT CURR-YMD FROM DATE.
           IF CURR-YY > "70"
               MOVE "19"       TO  CURR-CC
           ELSE
               MOVE "20"       TO  CURR-CC.
           ACCEPT CURRENT-TIME FROM TIME.
           MOVE CF-MKT-COST    TO  SAVE-CF-MKT-COST.

           MOVE "P 01"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "1-HSK"    TO  BU-DISPLAY-MSG
               MOVE PLT-ARG    TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-COMPANY  TO  HOLD-COMPANY-CODE.

           MOVE "CCHM"         TO  PLT-ARG.
           MOVE PLT-ARG TO PLTINFOKEY  OF MPLTINFO-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO INVALID KEY
                MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "1-HSK"    TO  BU-DISPLAY-MSG
               MOVE PLT-ARG    TO  BU-DISPLAY-FLD (1)
               PERFORM 2-BLOWUP.
           MOVE MPLTINFO-HOME-CUR-CODE   TO  SAVE-HOME-CUR-CODE.

           MOVE SAVE-HOME-CUR-CODE  TO  BUILD-CC-VALUE.
           MOVE BUILD-CC-KEY TO VALIDUM OF MVALIDUM-I-REC.
           READ MVALIDUM-I INTO BUF-MVALIDUM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           STRING "("
                  VALID-CURRENCY-DESC
                  ")"                  DELIMITED BY SIZE
               INTO PRT-CURRENCY.

           PERFORM 10-MOVE-RPT-HDG-DATA.

           MOVE 0                       TO  PRT-ERR-HDG-2-PG
                                            PAGE-COUNT
                                            LINE-COUNT
                                            OLD-ITEM-PRICE
                                            OLD-ITEM-QTY
                                            NEW-ITEM-QTY
                                            NEW-ITEM-PRICE
                                            NUM-ERRORS.
           MOVE "N"                     TO  REC-PROCESSED
                                            CODE-ERR-SW.


           PERFORM 999-WRITE-RPT-HDGS.

      *------- MOVE HEADING DATA TO REPORT.
       10-MOVE-RPT-HDG-DATA.
           MOVE CURR-MM            TO  PRT-ERR-HDG-1-MM.
           MOVE CURR-DD            TO  PRT-ERR-HDG-1-DD.
           MOVE CURR-YY            TO  PRT-ERR-HDG-1-YY.
           MOVE CURR-HR            TO  PRT-ERR-HDG-2-HR.
           MOVE CURR-MIN           TO  PRT-ERR-HDG-2-MIN.
           MOVE CURR-SEC           TO  PRT-ERR-HDG-2-SEC.
           MOVE CF-CODE            TO  PRT-RPT-CODE
                                       CODE-ARG.
           MOVE 1                  TO  CDESC-LINES-TO-GET.
           MOVE "K"                TO  CDESC-DESC-OPTION.
           CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
             BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
           IF BU-DISPLAY-MSG-1 NOT = SPACES
               MOVE "* NO DESCRIPTION AVAILABLE *" TO PRT-KM
           ELSE
               MOVE CDESC (1)      TO  PRT-KM.
           MOVE CF-MKT-COST        TO  PRT-RPT-MKT-COST.
           MOVE CF-UM              TO  PRT-RPT-UM.
           MOVE CF-USER-NAME       TO  PRT-HDG-USER.
           MOVE "*"                TO  RPT-CTL.
           MOVE CURR-YMD           TO  CONTROL-DATE.
           WRITE PRC-RPT-REC.
           MOVE SPACES             TO  PRC-RPT-REC.

       2-EOJ.
           DISPLAY "NUM POS UPDATED:  " NUM-UPDATES.

           IF NUM-UPDATES = 0
               MOVE "   **** NO PURCHASE ORDERS UPDATED ****"
                                   TO  RPT-LINE
               MOVE "2"            TO  RPT-CTL
               WRITE PRC-RPT-REC.

           CLOSE        DPOITEM-CD     MSTORERM-CD     DDAILYTC-O
                        MPLTINFO-I     DPORECD-PO-O    PRC-RPT-O
                        MVALIDUM-I.

      *-------------------------------------------------------------*
      *               B L O W U P   R O U T I N E                   *
      *-------------------------------------------------------------*

       2-BLOWUP.
           MOVE "TUPDPRCB"                 TO  BU-PGM-NAME.
           IF FILE-STATUS NUMERIC
               MOVE FILE-STATUS            TO  COND-WORD.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
               BU-DISPLAY-FLDS.

      *-------------------------------------------------------------*
      *                        6 - M A I N                          *
      *-------------------------------------------------------------*

       6-MAIN.
           PERFORM 60-UPDATE-STOREROOM.
           IF CODE-ERR-SW = "N"
               PERFORM 61-UPDATE-PO.

       60-UPDATE-STOREROOM.
           MOVE CF-CODE      TO  CORPCDE OF MSTORERM-CD-REC.
           READ MSTORERM-CD INTO BUF-MSTORERM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
      *       ***  CODE NOT IN DATABASE ***
               MOVE 03631 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD
               MOVE CATREAD-MSG-TEXT        TO  PRT-DET-MSG
               MOVE "Y"                     TO  CODE-ERR-SW
               PERFORM 999-WRITE-DETAIL-LINE
               MOVE SPACES                  TO  PRT-DET-MSG
           ELSE
               PERFORM 600-UPDATE-PRICE.

       600-UPDATE-PRICE.
           IF STR-UM = CF-UM
               MOVE CF-MKT-COST      TO  STR-MKT-COST
      *        REWRITE MSTORERM-CD-REC FROM BUF-MSTORERM
      *            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
      *        END-REWRITE
               PERFORM 999-WRITE-TC311
           ELSE
               MOVE CF-MKT-COST      TO  UMCF-SOURCE-QTY
               MOVE CF-UM            TO  UMCF-SOURCE-UM
               MOVE "PR"             TO  UMCF-RET-CODE
               CALL "TUMCF" USING UMCF-RET-CODE
                                  STR-UM-AREA
                                  UMCF-QUANTITY-AREA
               IF UMCF-RET-CODE NOT = "00"
      *        ***  INVALID UNIT OF MEASURE  ***
                   MOVE 35011 TO CATREAD-MSG-NUMBER
                   PERFORM 999-CATREAD
                   MOVE CATREAD-MSG-TEXT    TO  PRT-DET-MSG
                   MOVE "Y"                 TO  CODE-ERR-SW
                   PERFORM 999-WRITE-DETAIL-LINE
                   MOVE SPACES              TO  PRT-DET-MSG
               ELSE
                   MOVE UMCF-QTY-STR-UM-DEC
                                     TO  STR-MKT-COST
      *            REWRITE MSTORERM-CD-REC FROM BUF-MSTORERM
      *                INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
      *            END-REWRITE
               PERFORM 999-WRITE-TC311.

       61-UPDATE-PO.
           MOVE CF-CODE  TO  CORPCDE  OF DPOITEM-CD-REC.
           START DPOITEM-CD KEY = CORPCDE OF DPOITEM-CD-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               PERFORM 999-READ-NEXT-DPOITEM
               IF FILE-STATUS = "00"
                   PERFORM 610-UPDATE-DPOITEM UNTIL
                       ITM-CORP-CODE NOT = CF-CODE OR
                         FILE-STATUS NOT = "00".

       610-UPDATE-DPOITEM.
           MOVE ITM-PO-RCV-NO  TO  PORCVNO  OF DPORECD-PO-REC-O.
           READ DPORECD-PO-O INTO BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

      *-------- IF REQMT ORDER IS NOT EXPIRED, UPDATE.
           IF FILE-STATUS = "00"
               IF ITM-PO-REL = "999"
                   IF PO-EXPECT-DATE-CN > CURRENT-DATE-CN
                       PERFORM 620-CHANGE-PO-PRICE.

      *-------- IF PO IS NOT COMPLETE, UPDATE.
           IF FILE-STATUS = "00"
               IF ITM-PO-REL < "999"
                   IF ITM-QTY-ORD > 0
                       IF (ITM-QTY-ORD = ITM-QTY-DLVR) AND
                           (ITM-QTY-DLVR = ITM-QTY-PAID)
                           NEXT SENTENCE
                       ELSE
                           PERFORM 620-CHANGE-PO-PRICE
                   ELSE
                       PERFORM 620-CHANGE-PO-PRICE.

           PERFORM 999-READ-NEXT-DPOITEM.

       620-CHANGE-PO-PRICE.
           MOVE SPACES               TO  PRT-DET-MSG.
           MOVE SAVE-CF-MKT-COST     TO  CF-MKT-COST.
      *--------- IF PO CURRENCY DIFFERENT THAN HOME CURRENCY, FIND
      *--------- CORRECT EXCHANGE RATE MULTIPLIER.
           IF PO-CURRENCY-CODE > SPACES
             IF PO-CURRENCY-CODE NOT = SAVE-HOME-CUR-CODE
               PERFORM 999-FIND-EXCHG-RATE
               IF MPLTINFO-CC-EXCHANGE-RATE > 0
                   COMPUTE CF-MKT-COST ROUNDED =
                              CF-MKT-COST * MPLTINFO-CC-EXCHANGE-RATE
               ELSE
                   STRING "NO EXCH RATE: "
                          PO-CURRENCY-CODE   DELIMITED BY SIZE
                                             INTO PRT-DET-MSG
                   MOVE ITM-UNIT-PRICE    TO  OLD-ITEM-PRICE.

           IF PRT-DET-MSG = SPACES
             IF CF-UM = ITM-PRICE-UM
               MOVE ITM-UNIT-PRICE   TO  OLD-ITEM-PRICE
               MOVE CF-MKT-COST      TO  NEW-ITEM-PRICE
               MOVE CF-MKT-COST      TO  ITM-UNIT-PRICE
               PERFORM 999-REWRITE-DPOITEM
      *        PERFORM 999-CALL-SPOTRACK
             ELSE
               MOVE CF-MKT-COST      TO  UMCF-SOURCE-QTY
               MOVE CF-UM            TO  UMCF-SOURCE-UM
               MOVE "PR"             TO  UMCF-RET-CODE
               CALL "TUMCF" USING UMCF-RET-CODE
                                  STR-UM-AREA
                                  UMCF-QUANTITY-AREA
               IF UMCF-RET-CODE NOT = "00"
                   MOVE "UM NOT VALID        " TO PRT-DET-MSG
               ELSE
                   PERFORM 630-UPDATE-DPOITEM.

           PERFORM 999-MOVE-PO-FIELDS.
           PERFORM 999-WRITE-DETAIL-LINE.

       630-UPDATE-DPOITEM.
           MOVE SPACES                   TO  PRT-DET-MSG.
           MOVE ITM-UNIT-PRICE           TO  OLD-ITEM-PRICE.
           IF ITM-PRICE-UM = STR-UM
               MOVE UMCF-QTY-STR-UM-DEC  TO  NEW-ITEM-PRICE
                                             ITM-UNIT-PRICE
           ELSE
           IF ITM-PRICE-UM = STR-UM1
               MOVE UMCF-QTY-STR-UM1     TO  NEW-ITEM-PRICE
                                             ITM-UNIT-PRICE
           ELSE
           IF ITM-PRICE-UM = STR-UM2
               MOVE UMCF-QTY-STR-UM2     TO  NEW-ITEM-PRICE
                                             ITM-UNIT-PRICE
           ELSE
               MOVE "PO UM NOT VALID     "
                                         TO  PRT-DET-MSG.

           IF PRT-DET-MSG = SPACES
               PERFORM 999-REWRITE-DPOITEM.
      *    PERFORM 999-CALL-SPOTRACK.

      *-------------------------------------------------------------*
      *           U T I L I T Y   P A R A G R A P H S               *
      *-------------------------------------------------------------*

       999-READ-NEXT-DPOITEM.
           READ DPOITEM-CD NEXT INTO BUF-DPOITEM
               AT END MOVE "Y" TO DPOITEM-EOF-SW.

       999-REWRITE-DPOITEM.
      *    REWRITE DPOITEM-CD-REC FROM BUF-DPOITEM
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           ADD 1                    TO  NUM-UPDATES.
           MOVE "PRICE UPDATED"     TO  PRT-DET-MSG.

      *999-CALL-SPOTRACK.
      *    MOVE ITM-PO-RCV-NO       TO PO-NUM-TRACK.
      *    MOVE ITM-NUMBER          TO PO-ITEM-NUM.
      *    CALL "SPOTRACK" USING PO-TRACK-DATA.
      *    MOVE 0   TO OLD-ITEM-PRICE    OLD-ITEM-QTY
      *                NEW-ITEM-PRICE    NEW-ITEM-QTY.
      *
      *
       999-WRITE-DETAIL-LINE.
           MOVE PRT-RPT-DETAIL      TO  RPT-LINE.
           MOVE "2"                 TO  RPT-CTL.
           WRITE PRC-RPT-REC.
           ADD 2                    TO  LINE-COUNT.
           IF LINE-COUNT > 55
               PERFORM 999-WRITE-RPT-HDGS.

       999-MOVE-PO-FIELDS.
           MOVE PO-CURRENCY-CODE    TO  PRT-CURR-CODE.
           MOVE ITM-PO-NO           TO  PRT-DET-PO-NUM.
           MOVE ITM-PO-REL          TO  PRT-DET-RLSE.
           MOVE OLD-ITEM-PRICE      TO  PRT-DET-PREV.
           MOVE ITM-NUMBER          TO  PRT-DET-ITEM.
           MOVE ITM-UNIT-PRICE      TO  PRT-DET-PRICE.
           MOVE ITM-PRICE-UM        TO  PRT-DET-UM.

       999-FIND-EXCHG-RATE.
           MOVE "CC"             TO CUR-KEY-LIT.
           MOVE PO-CURRENCY-CODE TO CUR-KEY.
           MOVE BUILD-CUR-KEY    TO PLTINFOKEY OF MPLTINFO-REC-I.
           READ MPLTINFO-I INTO BUF-MPLTINFO.
           IF FILE-STATUS NOT = "00"
               MOVE ZEROES TO MPLTINFO-CC-EXCHANGE-RATE.

       999-WRITE-RPT-HDGS.
           ADD 1                TO  PAGE-COUNT.
           MOVE PAGE-COUNT      TO  PRT-ERR-HDG-2-PG.

           MOVE "0"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-1   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE "1"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-2   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE "2"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-5   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE "1"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-6   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE "2"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-3   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE "1"             TO  RPT-CTL.
           MOVE PRT-RPT-HDG-4   TO  RPT-LINE.
           WRITE PRC-RPT-REC.

           MOVE 8               TO  LINE-COUNT.

       999-WRITE-TC311.
           MOVE 1                    TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA, LANGUAGE-PARMS.
           MOVE DATE-YMD-OUT         TO DDAILYTC-DATE.
           ACCEPT DDAILYTC-TIME FROM TIME.
           MOVE "311"                TO DDAILYTC-TC.
           MOVE HOLD-COMPANY-CODE    TO DDAILYTC-PLT.
           MOVE CORP-CODE            TO TC311-CORP-CODE.
           MOVE SPACES TO DDAILYTC-DATA.

           MOVE "1"                  TO TC311-ID-1.
           MOVE CORP-CODE            TO TC311-CORP-CODE.
           MOVE STR-PREV-CODE        TO TC311-PREV-CODE.
           MOVE STR-AUTHOR           TO TC311-AUTHOR.
           MOVE STR-CLASS            TO TC311-CLASS.
           MOVE STR-DIR-CHRG-DEPT    TO TC311-DIR-CHRG.
           MOVE STR-DFLT-DEPT        TO TC311-DEPT-CHG.
           MOVE STR-WR-DOWN          TO TC311-WR-DOWN.
           MOVE STR-STOCK-OT         TO TC311-STOCK-OT.
           MOVE STR-IMPORT-IND       TO TC311-IMPORT.
           MOVE STR-INS-ITM          TO TC311-INS-ITM.
           MOVE STR-ORD-ENG          TO TC311-ORD-ENG.
           MOVE STR-OUT-REP          TO TC311-OUT-REP.
           MOVE STR-MAINT            TO TC311-MAINT.
           MOVE STR-LOC (1)          TO TC311-STOCK-LOC.
      *---------- COMMENT OUT FOR TESTING.
      *    WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "PUT DDAILYTC TC331-1" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.

           MOVE SPACES TO DDAILYTC-DATA.

           IF   (STR-AVG-COST IS GREATER THAN 99999.9999)
             OR (STR-MKT-COST IS GREATER THAN 99999.9999)
             OR (STR-STD-COST IS GREATER THAN 99999.9999)
               MOVE "411"            TO DDAILYTC-TC
               MOVE CORP-CODE        TO TC411-CORP-CODE
               MOVE STR-AVG-COST     TO TC411-AVG-COST
               MOVE STR-STD-COST     TO TC411-STD-COST
               MOVE STR-MKT-COST     TO TC411-MKT-COST
               MOVE STR-UM           TO TC411-UM
               MOVE STR-ONHAND       TO TC411-ONHAND
               MOVE STR-CLASS        TO TC411-CLASS
               MOVE STR-UM           TO TC411-OLD-UM
               MOVE STR-ONHAND       TO TC411-OLD-ONHAND
           ELSE
               MOVE "311"            TO DDAILYTC-TC
               MOVE CORP-CODE        TO TC311-CORP-CODE
               MOVE "5"              TO TC311-ID-5
               MOVE STR-AVG-COST     TO TC311-AVG-COST
               MOVE STR-STD-COST     TO TC311-STD-COST
               MOVE STR-MKT-COST     TO TC311-MKT-COST
               MOVE STR-UM           TO TC311-UM
               MOVE STR-ONHAND       TO TC311-ONHAND
               MOVE STR-CLASS        TO TC311-CLASS-ID5
               MOVE STR-UM           TO TC311-OLD-UM
               MOVE STR-ONHAND       TO TC311-OLD-ONHAND.
      *---------- COMMENT OUT FOR TESTING.
      *    WRITE DDAILYTC-REC-O FROM BUF-DDAILYTC
      *        INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
      *    IF FILE-STATUS NOT = "00"
      *        MOVE "PUT DDAILYTC TC331-5" TO BU-DISPLAY-MSG
      *        PERFORM 2-BLOWUP.

       999-CATREAD.
           CALL "CCATREAD" USING CATREAD-PARMS.

