       IDENTIFICATION DIVISION.
       PROGRAM-ID.             TUPDATEM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT WO-MESSAGE-CC
                  ASSIGN       TO DATABASE-MCFLMM2402
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

           SELECT WO-MESSAGE-WO
                  ASSIGN       TO DATABASE-MCFLMM2403
                  ORGANIZATION IS INDEXED
                  ACCESS MODE  IS DYNAMIC
                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
                               WITH DUPLICATES
                  FILE STATUS  IS FILE-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD  WO-MESSAGE-CC
           LABEL RECORDS ARE STANDARD.
       01  MCC-REC.
           COPY DD-ALL-FORMATS OF MCFLMM2402.

       FD  WO-MESSAGE-WO
           LABEL RECORDS ARE STANDARD.
       01  MWO-REC.
           COPY DD-ALL-FORMATS OF MCFLMM2403.

       WORKING-STORAGE SECTION.
       77  FILE-STAT           PIC XX.
       77  MSG-COMPARE         PIC X(350).

       LINKAGE SECTION.
       01  MESSAGE-DATA.
           COPY DWOMSG         IN COPYLIB.

       01  ACD-SW              PIC X.

       01  ERROR-MESSAGE.
           05  ERROR-TEXT      PIC X(70).
           05  ERROR-FILL      PIC X(06).
           05  ERROR-CODE      REDEFINES ERROR-FILL PIC 9(06).

       PROCEDURE DIVISION      USING MESSAGE-DATA
                               ACD-SW
                               ERROR-MESSAGE.

       START-PROCESSING.
           MOVE SPACES         TO ERROR-MESSAGE.

           IF ACD-SW = "A"
               OPEN I-O        WO-MESSAGE-CC
               GO TO ADD-FUNCTION
           ELSE
           IF ACD-SW = "U"
               OPEN I-O        WO-MESSAGE-CC
               GO TO UPDATE-FUNCTION
           ELSE
           IF ACD-SW = "D"
               GO TO DEL-FUNCTION
           ELSE
               MOVE "ADD/DELETE SWITCH NOT SET - FILE NOT UPDATED"
                               TO ERROR-TEXT
               GO TO END-OF-JOB.

       ADD-FUNCTION.
           WRITE MCC-REC       FROM MESSAGE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "WRITE ERROR - RECORD NOT ADDED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT.
           CLOSE               WO-MESSAGE-CC.
           GO TO END-OF-JOB.

       UPDATE-FUNCTION.
           MOVE MESSAGE-DATA   TO MCC-REC.
           START WO-MESSAGE-CC KEY NOT < TOCC-MM OF WO-MESSAGE-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "START ERROR - RECORD NOT CHANGED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
               CLOSE           WO-MESSAGE-CC
               GO TO END-OF-JOB.

       UPDATE-READ-LOOP.
           READ WO-MESSAGE-CC  NEXT
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "READ ERROR - RECORD NOT CHANGED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
               CLOSE           WO-MESSAGE-CC
               GO TO END-OF-JOB.

           IF TO-CC NOT = TOCC-MM OF WO-MESSAGE-CC
               MOVE
               "READ ERROR - RECORD NOT CHANGED:  RECORD NOT FOUND"
                               TO ERROR-TEXT
               CLOSE           WO-MESSAGE-CC
               GO TO END-OF-JOB.

           MOVE SPACES         TO MSG-COMPARE.
           STRING
               MESSAGE1-MM     OF WO-MESSAGE-CC
               MESSAGE2-MM     OF WO-MESSAGE-CC
               MESSAGE3-MM     OF WO-MESSAGE-CC
               MESSAGE4-MM     OF WO-MESSAGE-CC
               MESSAGE5-MM     OF WO-MESSAGE-CC
             DELIMITED BY SIZE INTO MSG-COMPARE.

           IF MESSAGES-1-5 NOT = MSG-COMPARE GO TO UPDATE-READ-LOOP.

           REWRITE MCC-REC     FROM MESSAGE-DATA
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "REWRITE ERROR - RECORD NOT CHANGED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT.

           CLOSE               WO-MESSAGE-CC.
           GO TO END-OF-JOB.

       DEL-FUNCTION.
           IF TO-CC NOT = "9999"
               OPEN I-O        WO-MESSAGE-CC
               MOVE MESSAGE-DATA TO MCC-REC
               START WO-MESSAGE-CC KEY NOT < TOCC-MM OF WO-MESSAGE-CC
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
                   END-START
               IF FILE-STAT NOT = ZEROS
                   STRING
                   "START ERROR - RECORD NOT DELETED - FILE STATUS = "
                   FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
                   CLOSE       WO-MESSAGE-CC
                   GO TO END-OF-JOB
               ELSE
                   GO TO DELETE-CC-READ-LOOP
           ELSE
               OPEN I-O        WO-MESSAGE-WO
               MOVE MESSAGE-DATA TO MWO-REC
               START WO-MESSAGE-WO KEY NOT < TOWO-MM OF WO-MESSAGE-WO
                   INVALID KEY MOVE FILE-STAT TO FILE-STAT
                   END-START
               IF FILE-STAT NOT = ZEROS
                   STRING
                   "START ERROR - RECORD NOT DELETED - FILE STATUS = "
                   FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
                   CLOSE       WO-MESSAGE-WO
                   GO TO END-OF-JOB.

       DELETE-WO-READ-LOOP.
           READ WO-MESSAGE-WO  NEXT
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "READ ERROR - RECORD NOT DELETED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
               CLOSE           WO-MESSAGE-WO
               GO TO END-OF-JOB.

           IF TO-WO NOT = TOWO-MM OF WO-MESSAGE-WO
               MOVE
               "READ ERROR - RECORD NOT DELETED:  RECORD NOT FOUND"
                               TO ERROR-TEXT
               CLOSE           WO-MESSAGE-WO
               GO TO END-OF-JOB.

           MOVE SPACES         TO MSG-COMPARE.
           STRING
               MESSAGE1-MM     OF WO-MESSAGE-WO
               MESSAGE2-MM     OF WO-MESSAGE-WO
               MESSAGE3-MM     OF WO-MESSAGE-WO
               MESSAGE4-MM     OF WO-MESSAGE-WO
               MESSAGE5-MM     OF WO-MESSAGE-WO
             DELIMITED BY SIZE INTO MSG-COMPARE.

           IF MESSAGES-1-5 NOT = MSG-COMPARE GO TO DELETE-WO-READ-LOOP.

           DELETE              WO-MESSAGE-WO
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
              "DELETE FILE ERROR - RECORD NOT DELETED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
               CLOSE           WO-MESSAGE-WO.

           GO TO END-OF-JOB.

       DELETE-CC-READ-LOOP.
           READ WO-MESSAGE-CC  NEXT
               AT END          MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
               "READ ERROR - RECORD NOT DELETED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT
               CLOSE           WO-MESSAGE-CC
               GO TO END-OF-JOB.

           IF TO-CC NOT = TOCC-MM OF WO-MESSAGE-CC
               MOVE
               "READ ERROR - RECORD NOT DELETED:  RECORD NOT FOUND"
                               TO ERROR-TEXT
               CLOSE           WO-MESSAGE-CC
               GO TO END-OF-JOB.

           MOVE SPACES         TO MSG-COMPARE.
           STRING
               MESSAGE1-MM     OF WO-MESSAGE-CC
               MESSAGE2-MM     OF WO-MESSAGE-CC
               MESSAGE3-MM     OF WO-MESSAGE-CC
               MESSAGE4-MM     OF WO-MESSAGE-CC
               MESSAGE5-MM     OF WO-MESSAGE-CC
               DELIMITED BY SIZE INTO MSG-COMPARE.

           IF MESSAGES-1-5 NOT = MSG-COMPARE GO TO DELETE-CC-READ-LOOP.

           DELETE              WO-MESSAGE-CC
               INVALID KEY     MOVE FILE-STAT TO FILE-STAT.
           IF FILE-STAT NOT = ZEROS
               STRING
              "DELETE FILE ERROR - RECORD NOT DELETED - FILE STATUS = "
               FILE-STAT DELIMITED BY SIZE INTO ERROR-TEXT.

           CLOSE               WO-MESSAGE-CC.

       END-OF-JOB.
           GOBACK.

