000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TUSBUILD.
000400 AUTHOR.  C HILLES.
000500
000600**************************************************************
000700**    THIS IS THE BUILD STATEMENT FOR THE KSAM FILE         **
000800**   USAGEFIL:                                              **
000900**                                                          **
001000**  BUILD USAGEFIL;REC=33,31,F,BINARY;DISC=25000;           **
001100**        KEYFILE=USAGEKEY;KEY=BYTE,3,8                     **
001200**                                                          **
001300**************************************************************
      *C
      *C   07MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09/12/96  JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C     RECOMPILE TO PICK UP COPYLIB CHANGES.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.   HP-3000.
001800 OBJECT-COMPUTER.   HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-CD-I
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-CD-O
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

002000 DATA DIVISION.
       FILE SECTION.
      *------ FD STATEMENT AREA FOR IBM ONLY ------*
       FD  MSTORERM-CD-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-CD-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  USAGEFIL-CD-O
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-CD-REC-O.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

      *------ FD STATEMENT AREA FOR IBM ONLY ------*
002100 WORKING-STORAGE SECTION.
002200
002300 77  RESULT                      PIC 9(4)   VALUE ZEROS.
002400 77  RECSIZE                     PIC S9(4)  COMP VALUE 66.
002500 77  KEYVAL                      PIC X(10)  VALUE SPACES.
002600 77  KEYLOC                      PIC S9(4)  COMP VALUE 3.
002700 77  BASE                        PIC X(10)   VALUE "  STORES;".
002800 77  PASSWORD                    PIC X(8)    VALUE "LOOKER; ".
002900 77  MODE5                       PIC S9(4)  COMP VALUE +5.
003000 77  MODE2                       PIC S9(4)  COMP VALUE +2.
003100 77  MODE1                       PIC S9(4)  COMP VALUE +1.
003200 77  ALL-ITEM-LIST               PIC XX     VALUE "@;".
003300 77  SUB                         PIC 99    VALUE ZERO.
003400 77  DUMMY-ARG                   PIC X     VALUE SPACES.
       77  MCXCBLERR-SCOPE             PIC X(1)  VALUE "C".
003500
       COPY TBLOWUP IN COPYLIB.
       COPY TDATECHK IN COPYLIB.
003600**************************************************************
003700**                                                          **
003800**            D A T E / T I M E   A R E A S                 **
003900**                                                          **
004000**************************************************************
004100
004200 01  DATE-WORK.
004300     05  DATE-MM                PIC 9(2).
004400     05  FILLER                 PIC X(6).
004500
004600********************************************
004700*                                          *
004800*  BUFFER AREAS FOR THE KSAM FILE          *
004900*                                          *
005000********************************************
005100
005200 01  BUF-USAGEFIL.
005300     05  FILLER                   PIC XX.
005400     05  K-CORP-CODE              PIC X(8).
005500     05  K-BUCKETS                OCCURS 14 TIMES.
005600         10  K-BUCKET             PIC S9(9) COMP.
005500     05  K-BUCKETS-DD             OCCURS 14 TIMES.
005600         10  K-BUCKET-DD         PIC S9(9) COMP.
005700
005800 01  FILETABLE.
005900     05  FILENUMBER               PIC S9(4) COMP VALUE 0.
006000     05  FILENAME                 PIC X(8)  VALUE "USAGEFIL".
006100     05  I-O-TYPE                 PIC S9(4) COMP VALUE 1.
006200     05  A-MODE                   PIC S9(4) COMP VALUE 1.
006300     05  PREV-OP                  PIC S9(4) COMP VALUE 0.
006400
006500 01  FILE-STATUS.
006600     05  FILE-STATUS-1             PIC X.
006700     05  FILE-STATUS-2             PIC X.
006800
006900**************************************************************
007000**                                                          **
007100**            D A T A B A S E   W O R K                     **
007200**                                                          **
007300**************************************************************
007400
007500 COPY DBSTAT     IN COPYLIB.
007600 01  DSET-NAMES.
007700     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
007800
007900**************************************************************
008000**                                                          **
008100**             D A T A B A S E   B U F F E R S              **
008200**                                                          **
008300**************************************************************
008400
008500 COPY MSTORERM   IN COPYLIB.
008600
008700 PROCEDURE DIVISION.
008800
008900 60-HOUSEKEEPING.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
009000
           PERFORM 9999-OPEN-STUFF.

010600**************************************************************
010700**   WRITE THE "00000000" KEY RECORD IN THE KSAM FILE.      **
010800**************************************************************
010900
011000     MOVE "00000000" TO K-CORP-CODE.
           CALL "TDATECHK" USING DATE-CHECK-AREA.
011100     MOVE DATE-YMD-OUT  TO  DATE-WORK.
011200     MOVE DATE-MM       TO  K-BUCKET (1).
011300     MOVE 0  TO K-BUCKET (2) K-BUCKET (3) K-BUCKET (4)
011400                K-BUCKET (5) K-BUCKET (6) K-BUCKET (7)
011500                K-BUCKET (8) K-BUCKET (9) K-BUCKET (10)
011600                K-BUCKET (11) K-BUCKET (12)
011700                K-BUCKET (13) K-BUCKET (14).
011300     MOVE 0  TO K-BUCKET-DD(2) K-BUCKET-DD(3) K-BUCKET-DD(4)
011400                K-BUCKET-DD(5) K-BUCKET-DD(6) K-BUCKET-DD(7)
011500                K-BUCKET-DD(8) K-BUCKET-DD(9) K-BUCKET-DD(10)
011600                K-BUCKET-DD(11) K-BUCKET-DD(12)
011700                K-BUCKET-DD(13) K-BUCKET-DD(14) K-BUCKET-DD(1).
011800
           PERFORM 9999-DBPUT-USAGEFIL-CD-O.
012000     IF FILE-STATUS-1 NOT = "0"
012100       IF FILE-STATUS = "22"
012200         DISPLAY "1.DUPLICATE KEY - CODE=", K-CORP-CODE
012400       ELSE
012500       IF FILE-STATUS = "24"
012600         DISPLAY "1.FILE FULL - RECORD NOT ADDED"
012700         DISPLAY "CODE=", K-CORP-CODE
012800         GO TO 60-EOJ
012900       ELSE
013000         DISPLAY "1.WRITE ERROR, STAT-KEY=", FILE-STATUS
013100         GO TO 60-EOJ.
013200
013300 INITIALIZE-FIELDS.
013400     ADD 1 TO SUB.
013500     IF SUB > 14
               PERFORM 9999-INIT-MSTORERM-CD-I
013600         GO TO SERIAL-READ.
013700     MOVE 0 TO K-BUCKET (SUB)
013700               K-BUCKET-DD(SUB).
013800     GO TO INITIALIZE-FIELDS.
013900
014000 SERIAL-READ.
           PERFORM 9999-DBGET2-MSTORERM-CD-I.
014300     IF END-OF-FILE
014400         DISPLAY "PROCESSING COMPLETE"
014500         GO TO 60-EOJ.
015000
015100     MOVE CORP-CODE TO K-CORP-CODE.
015200
           PERFORM 9999-DBPUT-USAGEFIL-CD-O.
           IF FILE-STATUS NOT = "00"
015500     IF FILE-STATUS = "22"
015600         DISPLAY "DUPLICATE KEY - CODE=", K-CORP-CODE
015800      ELSE
015900      IF FILE-STATUS = "24"
016000         DISPLAY "FILE FULL - RECORD NOT ADDED"
016100         DISPLAY "CODE=", K-CORP-CODE
016200         GO TO 60-EOJ
016300       ELSE
016400         DISPLAY "WRITE ERROR, STAT-KEY=", FILE-STATUS
016500         GO TO 60-EOJ.
016600
016700     GO TO SERIAL-READ.
016800
016900 60-EOJ.
017000     GOBACK.
017100
017200 2100-BLOWUP.
017300     DISPLAY "DATABASE ERROR, FILE-STATUS = ", FILE-STATUS.
           DISPLAY "COND-WORD = ", COND-WORD.

       9930-LOCK.

       9940-UNLOCK.

       9999-DBGET2-MSTORERM-CD-I.
           MOVE 0 TO COND-WORD.
           READ MSTORERM-CD-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1" OR FILE-STATUS = "46"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE "DBGET2 ERR 9999-DBGET2-MSTORERM-CD-I"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-INIT-MSTORERM-CD-I.
           MOVE SPACES TO CORPCDE OF MSTORERM-CD-REC-I.
           START MSTORERM-CD-I KEY >= CORPCDE OF MSTORERM-CD-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

       9999-DBPUT-USAGEFIL-CD-O.
           MOVE 0 TO COND-WORD.
           WRITE USAGEFIL-CD-REC-O FROM BUF-USAGEFIL
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "DBPUT ERR 9999-DBPUT-USAGEFIL-CD-O"
                   TO BU-MSG-AREA
               MOVE 99 TO COND-WORD
               PERFORM 2100-BLOWUP.

       9999-OPEN-STUFF.
           OPEN INPUT MSTORERM-CD-I                              .
           OPEN I-O   USAGEFIL-CD-O                              .

       9999-CLOSE-STUFF.
           CLOSE      MSTORERM-CD-I         USAGEFIL-CD-O        .
