000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. TUSCHECK.
000400 AUTHOR.  C HILLES.
000500
000600**************************************************************
000700**    THIS IS THE BUILD STATEMENT FOR THE KSAM FILE         **
000800**   USAGEFIL:                                              **
000900**                                                          **
001000**  BUILD USAGEFIL;REC=33,31,F,BINARY;DISC=25000;           **
001100**        KEYFILE=USAGEKEY;KEY=BYTE,3,8                     **
001200**                                                          **
001300**************************************************************
001500*
001600*  THIS PROGRAM TELLS US WHETHER AND HOW THE USAGE FILE IS OUT
001700*  OF SYNC WITH THE DATA BASE - WHAT CORP CODES ARE ON THE DATA
001800*  BASE BUT NOT IN THE USAGE FILE, AND WHAT CORP CODES ARE IN
001900*  THE USAGE FILE BUT NOT ON THE DATA BASE.
002000*
002100*REMARKS.
002200*
002300*    ON DECEMBER 6, 1983, CHANGED THIS PROGRAM TO DISPLAY THE
002400*    OUT OF SYNC CODES RATHER THAN PRINT THEM.  CIH.
002500*
002600*    ON DECEMBER 7, 1983, CHANGE PROGRAM TO GIVE THE OPTION
002700*    OF EITHER UPDATING OR DISPLAYING THE OUT-OF-SYNC CODES.
002800*    IF "D" IS PICKED, ANY CODES IN DATABASE BUT NOT IN USAGE
002900*    FILE OR ANY CODES IN USAGE FILE BUT NOT IN DATABASE WILL
003000*    SIMPLY BE DISPLAYED.  IF "U" IS PICKED, ANY CODES IN DATA
003100*    BASE BUT NOT IN USAGE FILE WILL BE ADDED, AND ANY CODES
003200*    IN USAGE FILE BUT NOT IN DATA BASE WILL BE DELETE FROM
003300*    USAGE FILE.  CIH.
      *C
      *C   07MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   SEPT 11, 1996    CA YODER
      *C     RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
      *C  11/25/97    JEFF BUNGO   REQ #97-017
      *C     ADD USAGE FIELDS FOR DIRECT DELIVERY.  DD USAGE
      *C     TO BE STORED IN ADDITIONAL FIELD AND TOTAL USAGE.
      *C     STORE ISSUE USAGE CALCULATED BY TOTAL USAGE - DD USAGE.
      *C
003500 ENVIRONMENT DIVISION.
003600 CONFIGURATION SECTION.
003700 SOURCE-COMPUTER.   HP-3000.
003800 OBJECT-COMPUTER.   HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MSTORERM-I
                  ASSIGN TO DATABASE-MCFLCS0201
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-I
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT USAGEFIL-O
                  ASSIGN TO DATABASE-MCFLCSUSAG
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

004200 DATA DIVISION.
       FILE SECTION.
       FD  MSTORERM-I
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC-I.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  USAGEFIL-I
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-I.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       FD  USAGEFIL-O
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC-O.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

004300 WORKING-STORAGE SECTION.
004400
004500 77  BASE                        PIC X(10)   VALUE "  STORES;".
004600 77  PASSWORD                    PIC X(8)    VALUE "LOOKER; ".
004700 77  MODE2                       PIC S9(4)  COMP-4 VALUE +2.
004800 77  ALL-ITEMS               PIC XX     VALUE "@;".
004900 77  SUB                         PIC 99    VALUE ZERO.
005000 77  DUMMY-ARG                   PIC X     VALUE SPACES.
005100 77  STEP2-SW                    PIC X     VALUE "Y".
005200 77  NO-DB-COUNT                 PIC 9(5)  VALUE ZERO.
005300 77  NO-USAGE-COUNT              PIC 9(5)  VALUE ZERO.
005400 77  DISPLAY-OR-UPDATE           PIC X(1)  VALUE SPACES.
       77  MCXCBLERR-SCOPE             PIC X(1)  VALUE "C".
005500
005600**************************************************************
005700**                                                          **
005800**               K S A M   W O R K                          **
005900**                                                          **
006000**************************************************************
006100
007000 01  USAGE-REC.
007100     05  FILLER                   PIC XX.
007200     05  K-CORP-CODE              PIC X(8).
007300     05  K-MONTHS                 OCCURS 14 TIMES.
007400         10  K-MTH-USAGE          PIC S9(9) COMP-4.
007300     05  K-MONTHS-DD              OCCURS 14 TIMES.
007400         10  K-MTH-USAGE-DD       PIC S9(9) COMP-4.
007500
009800**************************************************************
009900**                                                          **
010000**            D A T A B A S E   W O R K                     **
010100**                                                          **
010200**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
010300
010400 01  CODE-ARG                   PIC X(8)  VALUE SPACES.
010500
010600 COPY DBSTAT     IN COPYLIB.
010700
010800 01  DSET-NAMES.
010900     05  DSET-MSTORERM          PIC X(16)  VALUE "MSTORERM;".
011000
011100 01  MODE-AREA.
011200     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
011300     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
011400     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
011500     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
011600
011700**************************************************************
011800**                                                          **
011900**             D A T A B A S E   B U F F E R S              **
012000**                                                          **
012100**************************************************************
012200
012300 COPY MSTORERM   IN COPYLIB.
012400
012500 PROCEDURE DIVISION.
012600
012700 60-HOUSEKEEPING.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           OPEN INPUT MSTORERM-I, USAGEFIL-I.
           OPEN I-O USAGEFIL-O.
012800
012900     DISPLAY "ENTER 'D' FOR DISPLAY OR 'U' FOR UPDATE".
013000     ACCEPT DISPLAY-OR-UPDATE.
013100     IF DISPLAY-OR-UPDATE = "D" OR "U"
013200         NEXT SENTENCE
013300     ELSE
013400         DISPLAY "INVALID DISPLAY-OR-UPDATE FLAG"
013500         GO TO 60-EOJ.
013600
013700     DISPLAY "**  USAGE FILE SYNCHRONIZATION PROGRAM **".
013800     DISPLAY "CORP CODES WITH NO USAGE RECORD".
013900
           MOVE SPACES TO CORPCDE OF MSTORERM-REC-I.
           START MSTORERM-I KEY >= CORPCDE OF MSTORERM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               DISPLAY "START ERROR ON MSTORERM-I"
               PERFORM 99-CALL-DBEXPLAIN.
015400
015500 SERIAL-READ.
015600*    CALL "DBGET" USING BASE DSET-MSTORERM MODE2 STATUS-AREA
015700*       ALL-ITEMS BUF-MSTORERM DUMMY-ARG.
           READ MSTORERM-I NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
015800     IF FILE-STATUS-1 = "1"
015900         DISPLAY "STEP 1 COMPLETE"
016000         IF STEP2-SW = "Y"
016100             GO TO 61-CHECK-DB
016200         ELSE
016300             GO TO 60-EOJ.
016400     IF FILE-STATUS NOT = "00"
016500         DISPLAY "DBGET ERR MODE2 CODE=", CORP-CODE
016600         PERFORM 99-CALL-DBEXPLAIN
016700         GO TO 60-EOJ.
016800
016900     MOVE CORP-CODE TO CODE-ARG.
      *    CALL "CKREADBYKEY" USING FILE-TABLE, KSAM-STATUS, USAGE-REC,
017100*      KEY-VALUE KEY-LOC RECSIZE.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
           READ USAGEFIL-I INTO USAGE-REC
               INVALID KEY MOVE 17 TO COND-WORD.
017200     IF FILE-STATUS = "23"
017300         DISPLAY CODE-ARG
017400         PERFORM 7-PUT-CODE THRU 73-PC-X
017500         ADD 1 TO NO-USAGE-COUNT
017600     ELSE
017700     IF FILE-STATUS NOT = "00"
017800         DISPLAY "CKREADBYKEY ERROR"
017900         GO TO 60-EOJ.
018000
018100     GO TO SERIAL-READ.
018200
018300 61-CHECK-DB.
018400     DISPLAY "USAGE CODES NOT IN DB".
019100     MOVE "00000000" TO CODE-ARG.
019200*    CALL "CKSTART" USING FILE-TABLE KSAM-STATUS RELOP
019300*      KEY-VALUE KEY-LOC KEY-LENGTH.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-I.
           START USAGEFIL-I KEY = CORPCDE OF USAGEFIL-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
019500         DISPLAY "* CKSTART ERR *"
019600         GO TO 60-EOJ.
019700
019800 61-READ-USAGE-FILE.
019900*    CALL "CKREAD" USING FILE-TABLE KSAM-STATUS USAGE-REC
020000*      RECSIZE.
           READ USAGEFIL-O NEXT INTO USAGE-REC
               AT END MOVE FILE-STATUS TO FILE-STATUS.
020100     IF FILE-STATUS-1 = "1"
020200         DISPLAY "STEP 2 COMPLETE"
020300         GO TO 60-EOJ
020400     ELSE
020500     IF FILE-STATUS NOT = "00"
020600         DISPLAY "* CKREAD ERR *"
020700         GO TO 60-EOJ.
020800
020900     MOVE K-CORP-CODE TO CODE-ARG.
021000*    CALL "DBGET" USING BASE DSET-MSTORERM MODE7 STATUS-AREA
021100*      ALL-ITEMS BUF-MSTORERM CODE-ARG.
           MOVE CODE-ARG TO CORPCDE OF MSTORERM-REC-I.
           READ MSTORERM-I INTO BUF-MSTORERM
               INVALID KEY MOVE 17 TO COND-WORD.
021200     IF FILE-STATUS = "23"
021300         DISPLAY CODE-ARG
021400         PERFORM 8-DELETE-CODE THRU 81-DC-X
021500         ADD 1 TO NO-DB-COUNT
021600     ELSE
021700     IF FILE-STATUS NOT = "00"
021800         DISPLAY "* DBGET ERR MODE7 *"
021900         GO TO 60-EOJ.
022000
022100     GO TO 61-READ-USAGE-FILE.
022200
022300 60-EOJ.
022400     DISPLAY "PROCESSING COMPLETE".
022700     GOBACK.
022800
022900 7-PUT-CODE.
023000     IF DISPLAY-OR-UPDATE = "D"
023100         GO TO 73-PC-X.
023200     MOVE CODE-ARG  TO  K-CORP-CODE.
023300     MOVE 0 TO SUB.
023400 71-INITIALIZE-FIELDS.
023500     ADD 1 TO SUB.
023600     IF SUB > 14
023700         GO TO 72-CKWRITE.
023800     MOVE 0  TO  K-MTH-USAGE (SUB).
023800     MOVE 0  TO  K-MTH-USAGE-DD (SUB).
023900     GO TO 71-INITIALIZE-FIELDS.
024000
024100 72-CKWRITE.
024900*    CALL "CKWRITE" USING FILE-TABLE KSAM-STATUS USAGE-REC
025000*      RECSIZE.
           WRITE USAGEFIL-REC-O FROM USAGE-REC
               INVALID KEY MOVE 99 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
025200         DISPLAY "CKWRITE ERROR FOR CODE ", K-CORP-CODE
025300         PERFORM 99-KSAM-ERROR
025400     ELSE
025500         DISPLAY "CODE ", K-CORP-CODE, " ADDED TO THE USAGE FILE".
025600
026300 73-PC-X.
026400     EXIT.
026500
026600 8-DELETE-CODE.
026700     IF DISPLAY-OR-UPDATE = "D"
026800         GO TO 81-DC-X.
026900     IF K-CORP-CODE = "00000000"
027000         GO TO 81-DC-X.
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC-O.
           READ USAGEFIL-O INTO USAGE-REC
               INVALID KEY MOVE 17 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               DISPLAY "READ USAGEFIL ERR 8-DC"
               PERFORM 99-CALL-DBEXPLAIN.
027100*    CALL "CKDELETE" USING FILE-TABLE KSAM-STATUS.
           DELETE USAGEFIL-O
             INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
027300         DISPLAY "CKDELETE ERR FOR CODE ", K-CORP-CODE
027400         PERFORM 99-KSAM-ERROR
027500     ELSE
027600         DISPLAY "CODE ", K-CORP-CODE,
027700           " DELETED FROM USAGE FILE".
027800
027900 81-DC-X.
028000     EXIT.
028100
       99-CALL-DBEXPLAIN.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.

028500 99-KSAM-ERROR.
           DISPLAY "FATAL ERROR, FILE-STATUS = ", FILE-STATUS.
