001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.          TUSRCVR2.
001300 AUTHOR.              C.I.HILLES.
001400 DATE-WRITTEN.        2/28/85.
001500 DATE-COMPILED.
001600*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
001700*SECURITY.
001800*
001900*REMARKS.  THIS PROGRAM CREATES A FILE IN THE FORMAT OF "USYESFIL"
002000*          (USED YESTERDAY FILE), BY READING ANY OF THE
002100*          "ABSTFILE"S - DAILY TRANSACTION FILES FROM CUTOFF.
002200*          THIS IS USED TO RECOVER USAGE DATA FROM AN ABSTFILE,
002300*          WHERE THE CUTOFF PROGRAM "XCDLYABS" ABORTED BEFORE
002400*          USAGE WAS UPDATED.  THIS PROGRAM CREATES THE FILE
002500*          IN THE "USYESFIL" FORMAT, AND THE "XUSRCVR" CAN BE
002600*          RUN TO RECOVER THE USAGE FROM THE RESULTING FILE.
002700*
      *C   07MAR1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
002800 ENVIRONMENT DIVISION.
002900 CONFIGURATION SECTION.
003000 SOURCE-COMPUTER.  HP-3000.
003100 OBJECT-COMPUTER.  HP-3000.
003500 INPUT-OUTPUT SECTION.
003600 FILE-CONTROL.
           SELECT ABST-FILE ASSIGN TO DISK-MCFPABST.
           SELECT USED-YEST-FILE ASSIGN TO DISK-MCFPUSYST2.
003700
004100 DATA DIVISION.
004200 FILE SECTION.
004300
004400 FD  ABST-FILE
004500     LABEL RECORDS ARE STANDARD
004600     RECORD CONTAINS 80 CHARACTERS
004700     DATA RECORD IS ABST-RCD.
004800 01  ABST-RCD                 PIC X(80).
004900
005000 FD  USED-YEST-FILE
005100     LABEL RECORDS ARE STANDARD
005200     RECORD CONTAINS 18 CHARACTERS
005300     DATA RECORD IS USED-YEST-RCD.
005400 01  USED-YEST-RCD.
005500     05  USED-YEST-CODE       PIC X(8).
005600     05  USED-YEST-QTY        PIC S9(8).
005700     05  USED-YEST-MONTH      PIC 9(2).
005800
005900**********************************************************
006000*                                                        *
006100*                                                        *
006200*         W O R K I N G         S T O R A G E            *
006300*                                                        *
006400*                                                        *
006500**********************************************************
006600
006700 WORKING-STORAGE SECTION.
006800
007200 77  ABST-CNTR         PIC S9(6) VALUE ZEROS.
007300 77  ABST-CNTR-2       PIC 9(4)  VALUE 0.
008200 77  ISS-DEPT-SAVE     PIC X(4)  VALUE SPACES.
008300 77  DLY-TC-SAVE       PIC X(3)  VALUE SPACES.
008400 77  CUTOFF-SEQ-SAVE   PIC 9(5)  VALUE ZEROS.
008500 77  CUTOFF-SEQ-SAVE2  PIC 9(5)  VALUE ZEROS.
       77  MCXCBLERR-SCOPE   PIC X(1)  VALUE "C".
008600
       COPY TDATECHK IN COPYLIB.

009800 01  DLY-RCD-COUNT-TC.
009900     05  DAILY-R-C-DATE         PIC X(6)  VALUE SPACES.
010000     05  DAILY-R-C-TIME         PIC X(6)  VALUE SPACES.
010100     05  DAILY-R-C-TC           PIC X(3)  VALUE SPACES.
010200     05  DAILY-R-C-PLT          PIC X(3)  VALUE SPACES.
010300     05  DAILY-R-C-900.
010400         10  DAILY-R-C-CNTR     PIC 9(6)  VALUE ZEROS.
010500         10  DAILY-R-C-CUTOFF-SEQ  PIC 9(5)  VALUE ZEROS.
010600
010700**************************************************************
010800**   THIS IS TO REFORMAT RETURN TRANSACTION LIKE AN ISSUE   **
010900**   TRANSACTION FOR OUTPUT ON REPORT.                      **
011000**************************************************************
011100
011200 01  RTN-REC-REFORMAT.
011300     05  FILLER  PIC X(31).
011400     05  R-RTN-WO        PIC X(12).
011500     05  R-RTN-EMP       PIC X(4).
011600     05  R-RTN-QTY       PIC S9(8).
011700     05  R-RTN-AVG-CST   PIC S9(5)V9(4).
011800     05  R-RTN-UM        PIC XX.
011900     05  FILLER          PIC X(14).
012000
012100**************************************************************
012200**   THIS IS TO REFORMAT RETURN WITH VALUE TRANSACTIONS.    **
012300**************************************************************
012400
012500 01  RTNVAL-REC-REFORMAT.
012600     05  FILLER          PIC X(25).
012700     05  R-RTNVAL-CHRG   PIC X(6).
012800     05  R-RTNVAL-WO     PIC X(12).
012900     05  R-RTNVAL-EMP    PIC X(4).
013000     05  R-RTNVAL-QTY    PIC S9(8).
013100     05  R-RTNVAL-AVG-CST PIC S9(5)V9(4).
013200     05  R-RTNVAL-UM     PIC XX.
013300     05  FILLER          PIC X(14).
013400
014400**************************************************************
014500**                                                          **
014600**            D A T E / T I M E   A R E A S                 **
014700**                                                          **
014800**************************************************************
014900
016300 01  YMD-SHORT.
016400     05  YY-SHORT      PIC XX.
016500     05  MM-SHORT      PIC XX.
016600     05  DD-SHORT      PIC XX.
017100 01  CURRENT-MONTH-9   PIC 9(2)  VALUE 0.
017200 01  DLY-DATE-WORK.
017300     05  FILLER        PIC X(2).
017400     05  DLY-MONTH-9   PIC 9(2).
017500     05  FILLER        PIC X(2).
018000
023700**************************************************************
023800**                                                          **
023900**           D A T A B A S E   B U F F E R S                **
024000**                                                          **
024100**************************************************************
024200
024300 01  BUF-DDAILYTC.
024400     05  DAILY-TC.
024500         10  DLY-TC-DATE         PIC X(6).
024600         10  DLY-TC-TIME         PIC X(6).
024700         10  DLY-TC-TC           PIC X(3).
024800         10  DLY-TC-PLT          PIC X(3).
024900         10  DLY-TC-CODE.
025000             15  DLY-TC-CODE-1-2 PIC X(2).
025100             15  FILLER          PIC X(5).
025200         10  DAILY-TC-DATA       PIC X(55).
025300
025400         10  DLY-ISS-RCD REDEFINES DAILY-TC-DATA.
025500             15  DLY-ISS-CHRG.
025600                 20  DLY-ISS-CHRG-SHORT  PIC X(4).
025700                 20  FILLER              PIC XX.
025800             15  DLY-ISS-WO.
025900                 20  PROD-IS-MM      PIC X(2).
026000                 20  PROD-IS-DASH-1  PIC X(1).
026100                 20  PROD-IS-DD      PIC X(2).
026200                 20  PROD-IS-DASH-2  PIC X(1).
026300                 20  PROD-IS-YY      PIC X(2).
026400                 20  FILLER          PIC X(4).
026500             15  DLY-ISS-EMP         PIC X(4).
026600             15  DLY-ISS-QTY         PIC S9(8).
026700             15  DLY-ISS-AVG-CST     PIC S9(5)V9(4).
026800             15  DLY-ISS-UM          PIC XX.
026900             15  DLY-ISS-EXP-CLS     PIC X(6).
027000             15  DLY-ISS-REQ-DPT     PIC X(4).
027100             15  FILLER              PIC X(4).
027200
027300         10  DLY-ADJ-RCD REDEFINES DAILY-TC-DATA.
027400             15  DLY-ADJ-CHRG        PIC X(6).
027500             15  DLY-ADJ-QTY         PIC S9(8).
027600             15  DLY-ADJ-AVG-CST     PIC S9(5)V9(4).
027700             15  DLY-ADJ-UM          PIC XX.
027800             15  FILLER              PIC X(30).
027900
028000         10  DLY-RTN-RCD REDEFINES DAILY-TC-DATA.
028100             15  DLY-RTN-CHRG        PIC X(6).
028200             15  DLY-RTN-EMP         PIC X(4).
028300             15  DLY-RTN-QTY         PIC S9(8).
028400             15  DLY-RTN-AVG-CST     PIC S9(5)V9(4).
028500             15  DLY-RTN-UM          PIC XX.
028600             15  DLY-RTN-WO.
028700                 20  PROD-RT-MM      PIC X(2).
028800                 20  PROD-RT-DASH-1  PIC X(1).
028900                 20  PROD-RT-DD      PIC X(2).
029000                 20  PROD-RT-DASH-2  PIC X(1).
029100                 20  PROD-RT-YY      PIC X(2).
029200                 20  FILLER          PIC X(4).
029300             15  DLY-RTN-EXP-CLASS   PIC X(6).
029400             15  DLY-RTN-REQ-DEPT    PIC X(4).
029500             15  FILLER              PIC X(4).
029600
029700         10  DLY-RTNVAL-RCD REDEFINES DAILY-TC-DATA.
029800             15  DLY-RTNVAL-QTY      PIC S9(8).
029900             15  DLY-RTNVAL-UM       PIC XX.
030000             15  DLY-RTNVAL-TOT-COST PIC S9(6)V9(4).
030100             15  DLY-RTNVAL-DOC      PIC X(10).
030200             15  FILLER              PIC X(25).
030300
031000 PROCEDURE DIVISION.
031100
031200 1000-HOUSEKEEP.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.
031300
           CALL "TDATECHK" USING DATE-CHECK-AREA.
           MOVE DATE-YMD-OUT TO YMD-SHORT.
031800     MOVE MM-SHORT  TO  CURRENT-MONTH-9.
032000
032500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
032700
033600 2200-STOP-RUN.
033700     GOBACK.
033800
034000**************************************************************
034100**                                                          **
034200**             M A I N   P R O G R A M                      **
034300**                                                          **
034400**************************************************************
034500
034600 6000-MAIN.
034700     OPEN INPUT ABST-FILE.
034800     OPEN OUTPUT USED-YEST-FILE.
034900
035100 6100-GET-TC-RCD.
035200     READ ABST-FILE AT END
035300         GO TO 6210-CLOSE-ABSTFILE.
035400
035500     MOVE ABST-RCD  TO  BUF-DDAILYTC.
035600
035800**************************************************************
035900**   IF AN ISSUE, RETURN, RETURN WITH VALUE, OR ADJUSTMENT  **
036000**   (TC 333, 330, 331, OR 332), USAGE IS AFFECTED, SO WE   **
036100**   UPDATE USAGEFIL FOR THESE TRANSACTIONS.  HERE WE WRITE **
036200**   THE CODE AND USAGE QTY TO A FILE, WHICH WILL BE USED   **
036300**   IN THE USAGE UPDATE PROCEDURE AFTER ABSTFILE HAS BEEN  **
036400**   CLOSED.  THE REASON WE CANT UPDATE HERE IS THAT WE     **
036500**   CANT DO A "CKLOCK" WITH A "DBLOCK" IN PLACE. (DDAILYTC)**
036600**   IN ADDITION, THIS PERMANENT FILE TELLS "XUSEUPDT"      **
036700**   WHICH CODES HAVE HAD USAGE ON THE PREVIOUS DAY, AND    **
036800**   THEREFORE WHICH CODES MUST HAVE A 0 MOVED INTO THEIR   **
036900**   "USED YESTERDAY" FIELD.                                **
037000**************************************************************
037100
037200*----------FOR RAW MATERIAL CODES WHICH WERE ISSUED BY THE
037300*          BANBURY EXPLOSION, THE PRODUCTION DATE OF THE
037400*          BANBURY EXPLOSION IS USED TO UPDATE USAGE, RATHER
037500*          THAN THE ACTUAL TRANSACTION DATE.
037600*          IF THERE IS A PRODUCTION DATE IN THE WORKORDER FIELD
037700*          (IN THE FORMAT 12-02-84, FOR EXAMPLE), THIS SIGNIFIES
037800*          A BANBURY ISSUE.
037900
038000     IF PROD-IS-DASH-1 = "-" AND PROD-IS-DASH-2 = "-"
038100       AND DLY-TC-TC = "333"
038200         MOVE PROD-IS-MM     TO DLY-MONTH-9
038300     ELSE
038400     IF PROD-RT-DASH-1 = "-" AND PROD-RT-DASH-2 = "-"
038500       AND DLY-TC-TC = "330"
038600         MOVE PROD-RT-MM     TO DLY-MONTH-9
038700     ELSE
038800         MOVE DLY-TC-DATE    TO DLY-DATE-WORK.
038900
039000     IF DLY-TC-TC = "330"
039100         MOVE DLY-TC-CODE    TO USED-YEST-CODE
039200         MOVE DLY-MONTH-9    TO USED-YEST-MONTH
039300         MULTIPLY DLY-RTN-QTY BY -1 GIVING USED-YEST-QTY
039400         WRITE USED-YEST-RCD
039500     ELSE
039600     IF DLY-TC-TC = "331"
039700         MOVE DLY-MONTH-9    TO USED-YEST-MONTH
039800         MOVE DLY-TC-CODE    TO USED-YEST-CODE
039900         MULTIPLY DLY-RTNVAL-QTY BY -1 GIVING USED-YEST-QTY
040000         WRITE USED-YEST-RCD
040100     ELSE
040200     IF DLY-TC-TC = "332"
040300         MOVE DLY-MONTH-9    TO USED-YEST-MONTH
040400         MOVE DLY-TC-CODE    TO USED-YEST-CODE
040500         MULTIPLY DLY-ADJ-QTY BY -1 GIVING USED-YEST-QTY
040600         WRITE USED-YEST-RCD
040700     ELSE
040800     IF DLY-TC-TC = "333"
040900         MOVE DLY-MONTH-9     TO USED-YEST-MONTH
041000         MOVE DLY-TC-CODE     TO USED-YEST-CODE
041100         MOVE DLY-ISS-QTY     TO USED-YEST-QTY
041200         WRITE USED-YEST-RCD.
041300
041400     GO TO 6100-GET-TC-RCD.
041500
041510 6210-CLOSE-ABSTFILE.
041520     CLOSE ABST-FILE.
041530     CLOSE USED-YEST-FILE.
041540
041600 6990-MAIN-X.
041700     EXIT.
