000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TVCSTREV.
000400 INSTALLATION.  GOODYEAR TIRE & RUBBER COMPANY.
000600*REMARKS.       THIS PROGRAM SHOWS ALL WORK ORDERS THAT  HAVE
000700*               BEEN COMPLETED IN THE LAST 24 HOURS SORTED BY
000800*               ZONE AND EXPENSE CLASS. ACTUAL COSTS OF LABOR
000900*               AND MATERIAL ARE REPORTED.
001000*
001100*               WHEN SUBMITTED THRU 'XRSCREEN' , THE USER CAN
001200*               RESTRICT THE REPORT TO CERTAIN ZONES. ALSO  ,
001300*               THE USER DETERMINES THE TIME FRAME.
      *C
      *C  09/16/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR STOP AND START DATES AND
      *C   COMPARISONS OF COMPLETION DATE.  ALSO USE THE
      *C   JULGREG ROUTINE FOR GREG/JULIAN DATE CONVERSION.
      *C
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.   AS400.
001800 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
002300     SELECT IL-FILE
002400         ASSIGN TO DATABASE-MR6IL
               ORGANIZATION IS RELATIVE
002500         ACCESS MODE IS RANDOM
002600         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS IL-STATUS.
003100     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
002700     SELECT R6FILE
002800         ASSIGN TO DATABASE-MCFPMR6FIL
               ORGANIZATION IS SEQUENTIAL
002900         ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS R6-STATUS.
003200     SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-PARTS-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
003400 DATA DIVISION.
003500 FILE SECTION.
003600 FD  IL-FILE
003700     RECORD CONTAINS 136 CHARACTERS
003800     LABEL RECORDS ARE OMITTED
003900     DATA RECORD IS ILF.
004000 01  ILF.
004100     05  ZONE-IL                   PIC X(4).
004200     05  DETAIL-IL                 PIC X(132).
004300 FD  R6FILE
004400     RECORD CONTAINS 44 CHARACTERS
004500     LABEL RECORDS ARE OMITTED
004600     DATA RECORD IS R6REC.
004700 01  R6REC                         PIC X(44).
004800 FD  PRINT-FILE
004900     RECORD CONTAINS 132 CHARACTERS
005000     LABEL RECORD IS OMITTED
005100     DATA RECORD IS PRT-REC.
005200 01  PRT-REC.
           05  PRT-TYPE                  PIC X(8).
           05  PRT-LINE                  PIC X(124).
005300 SD  SORT-FILE
005400     RECORD CONTAINS 109 CHARACTERS
005500     DATA RECORD IS SORT-REC.
005600 01  SORT-REC.
005700     05  WONUM-SORT.
005800         10  WONO-SORT             PIC X(7).
005900         10  WOSU-SORT             PIC X(3).
006000     05  EQPNUM-SORT               PIC X(6).
006100     05  ZONE-SORT.
006200         10  Z-SORT                PIC X(4).
006300         10  P-SORT                PIC X.
006400         10  FILLER                PIC X.
006500     05  EXPCLASS-SORT             PIC X(8).
006600     05  WODESC-SORT               PIC X(30).
006700     05  CRAFT1-SORT               PIC XX.
006800     05  CRAFT2-SORT               PIC XX.
006900     05  CRAFT3-SORT               PIC XX.
007000     05  FCODE-SORT.
007100         10  FCODE2-SORT           PIC XX.
007200         10  FCODE4-SORT           PIC X(4).
007300     05  DCOMP-SORT.
007400         10  YY-SORT               PIC XX.
007500         10  MM-SORT               PIC XX.
007600         10  DD-SORT               PIC XX.
007700     05  TCOMP-SORT                PIC X(4).
007800     05  LABORCST-SORT.
007900         10  LCST-SORT             PIC 9(12).
008000     05  MATLCST-SORT.
008100         10  MCST-SORT             PIC 9(15).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.
       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-PARTS-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
008400 WORKING-STORAGE SECTION.
       77  EOF-SW                        PIC 9.
008500 01  ACT-KEY                       PIC 9(9).
008800 01  ASTERISK-LINE.
008900     05 FILLER                     PIC X(16) VALUE ALL "*".
009000     05 FILLER                     PIC X(116) VALUE SPACES.
009100 01  ARGUMENT-DEFN                 PIC XX.
009200 01  ARG-NO                        PIC 9(9).
       01  BLOWUP-BASE                   PIC X(16).
009300 01  COMPRESS-PRINT                PIC X(8).
009600 01  COMP-DATE                     PIC X(12).
009700 01  DATE-BUFF.
010200     05 YR-BUFF-9                  PIC 99.
009800     05 MTH-BUFF-9                 PIC 99.
010000     05 DAY-BUFF-9                 PIC 99.
       COPY TDATESUB OF COPYLIB.
010400 01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
       01  DELETE-FILE                   PIC X(10) VALUE "MCFPMR6FIL".
010500 01  DETAIL-REC.
010600     05  WONUM-REC.
010700         10  WONO-REC              PIC X(7).
010800         10  FILLER                PIC X VALUE "-".
010900         10  WOSU-REC              PIC X(3).
011000     05  FILLER                    PIC X VALUE SPACES.
011100     05  WODESC-REC                PIC X(30).
011200     05  FILLER                    PIC X VALUE SPACES.
011300     05  PRTY-REC                  PIC X.
011400     05  FILLER                    PIC XX VALUE SPACES.
011500     05  EQPNUM-REC                PIC X(6).
011600     05  FILLER                    PIC X VALUE SPACES.
011700     05  FCODE-REC.
011800         10  FCODE2-REC            PIC XX.
011900         10  FILLER                PIC X VALUE "-".
012000         10  FCODE4-REC            PIC X(4).
012100     05  FILLER                    PIC X VALUE SPACES.
012200     05  CRAFT1-REC                PIC XX.
012300     05  FILLER                    PIC X VALUE SPACES.
012400     05  CRAFT2-REC                PIC XX.
012500     05  FILLER                    PIC X VALUE SPACES.
012600     05  CRAFT3-REC                PIC XX.
012700     05  FILLER                    PIC X VALUE SPACES.
012800     05  DCOMP-REC.
012900         10  MD-REC                PIC XX.
013000         10  FILLER                PIC X VALUE "/".
013100         10  DM-REC                PIC XX.
013200     05  FILLER                    PIC X VALUE SPACES.
013300     05  TCOMP-REC                 PIC X(4).
013400     05  FILLER                    PIC X VALUE SPACES.
013500     05  LABORCST-REC              PIC *(10)99.
013600     05  FILLER                    PIC XX VALUE SPACES.
013700     05  MATLCST-REC               PIC *(13)99.
013800     05  FILLER                    PIC XX VALUE SPACES.
013900     05  TOTCST-REC                PIC *(14)99.
014000     05  FILLER                    PIC X(4) VALUE SPACES.
       COPY ESCNAM2 IN COPYLIB.
014100 01  EXPCLASS-TAG                  PIC X(8).
       01  FILE-STATUSES.
           05  IL-STATUS                 PIC XX.
           05  R6-STATUS                 PIC XX.
           05  WBF-STATUS                PIC XX.
           05  WLF-STATUS                PIC XX.
           05  WLNU-STATUS               PIC XX.
           05  WPF-STATUS                PIC XX.
       COPY JCWAREA IN COPYLIB.
016300 01  HEADING-1-H.
016400     05  FILLER        PIC X(11) VALUE "R6         ".
016500     05  FILLER        PIC X(36) VALUE SPACES.
016600     05  FILLER        PIC X(20) VALUE "COST REVIEW REPORT--".
016700     05  FILLER        PIC X(18) VALUE "VERBAL WORK ORDERS".
016800     05  FILLER        PIC X(21) VALUE SPACES.
016900     05  FILLER        PIC X(6) VALUE "DATE  ".
017000     05  DATE-1-H      PIC X(8).
017100     05  FILLER        PIC X(8) VALUE "  TIME  ".
017200     05  TIME-1-H      PIC X(4).
017300     05  FILLER        PIC X(10) VALUE SPACES.
017400 01  HEADING-2-H.
017500     05  FILLER        PIC X(70) VALUE SPACES.
017600     05  FILLER        PIC X(10) VALUE "DATE  TIME".
017700     05  FILLER        PIC X(12) VALUE SPACES.
017800     05  FILLER        PIC X(13) VALUE "ACTUAL  COSTS".
017900     05  FILLER        PIC X(13) VALUE SPACES.
018000 01  HEADING-3-H.
018100     05  FILLER        PIC X(10) VALUE "W/O NUMBER".
018200     05  FILLER        PIC X(2) VALUE SPACES.
018300     05  FILLER        PIC X(15) VALUE "W/O DESCRIPTION".
018400     05  FILLER        PIC X(16) VALUE SPACES.
018500     05  FILLER        PIC X(2) VALUE "PR".
018600     05  FILLER        PIC X    VALUE SPACE.
018700     05  FILLER        PIC X(6) VALUE "EQPNUM".
018800     05  FILLER        PIC X    VALUE SPACE.
018900     05  FILLER        PIC X(7) VALUE "FAILURE".
019000     05  FILLER        PIC X(1) VALUE SPACES.
019100     05  FILLER        PIC X(6) VALUE "CRAFTS".
019200     05  FILLER        PIC X(3) VALUE SPACES.
019300     05  FILLER        PIC X(4) VALUE "COMP".
019400     05  FILLER        PIC XX   VALUE SPACES.
019500     05  FILLER        PIC X(4) VALUE "COMP".
019600     05  FILLER        PIC X    VALUE SPACE.
019700     05  FILLER        PIC X(14) VALUE "LABOR".
019800     05  FILLER        PIC X(17) VALUE "MATERIAL".
019900     05  FILLER        PIC X(20) VALUE "TOTAL".
       01  INDATE.
           05  IN-YMD.
               10  IN-YY                 PIC 99.
               10  IN-MM                 PIC 99.
               10  IN-DD                 PIC 99.
               10  FILLER                PIC X.
           05  IN-JULDAY REDEFINES IN-YMD.
               10  IN-JUL                PIC 9(5).
               10  FILLER                PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       COPY LANGSUB OF COPYLIB.
021000 01  LAST-WO-BUFF.                 COPY MLASTWO OF COPYLIB.
021100 01  LITERAL-1-L.
021200     05  FILLER       PIC X(12) VALUE "MAINT ZONE: ".
021300     05  MZ-1-L       PIC X(4).
021400     05  FILLER       PIC X(116) VALUE SPACES.
021500 01  LITERAL-2-L.
021600     05  FILLER       PIC X(15) VALUE "EXPENSE CLASS: ".
021700     05  EXP-2-L      PIC X(8).
021800     05  FILLER       PIC X VALUE SPACE.
021900     05  FILLER       PIC X(108) VALUE ALL "-".
022000 01  LITERAL-3-L.
022100     05  FILLER       PIC X(23) VALUE "TOTAL COST MAINT ZONE: ".
022200     05  MZ-3-L       PIC X(4).
022300     05  FILLER       PIC X(16) VALUE SPACES.
022400     05  FILLER       PIC X(6) VALUE "LABOR".
022500     05  LABR-3-L     PIC *(12)99.
022600     05  FILLER       PIC XX VALUE "  ".
022700     05  FILLER       PIC X(5) VALUE SPACES.
022800     05  FILLER       PIC X(9) VALUE "MATERIAL".
022900     05  MATL-3-L     PIC *(15)99.
023000     05  FILLER       PIC XX VALUE "  ".
023100     05  FILLER       PIC X(6) VALUE SPACES.
023200     05  FILLER       PIC X(6) VALUE "TOTAL".
023300     05  TOTL-3-L     PIC *(16)99.
023400     05  FILLER       PIC XX VALUE "  ".
023600 01  NORMAL-PRINT                  PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
       01  OUTDATE.
           05  OUT-JULDAY.
               10  OUT-JUL               PIC 9(5).
               10  FILLER                PIC XX.
           05  OUTDATE-YMD REDEFINES OUT-JULDAY.
               10  OUT-YY                PIC XX.
               10  OUT-MM                PIC XX.
               10  OUT-DD                PIC XX.
               10  FILLER                PIC X.
024800 01  S1                            PIC 9(4) COMP-4.
       01  START-DATE-CN.
           05  STRT-CC                   PIC 99.
024900     05  START-DATE.
025000         10 STRT-YY                PIC 99.
025100         10 STRT-MM                PIC 99.
025200         10 STRT-DD                PIC 99.
025300         10 STRT-TIME              PIC 9999.
       01  STOP-DATE-CN.
           05  STOP-CC                   PIC 99.
025400     05  STOP-DATE.
025500         10 STOP-YY                PIC 99.
025600         10 STOP-MM                PIC 99.
025700         10 STOP-DD                PIC 99.
025800         10 STOP-TIME              PIC 9999.
      *---PARMS FOR JULGREG
       01  GREGDATE.
           05  GREGDATE-CC               PIC X(2).
           05  GREGDATE-YMD.
               10  GREGDATE-YY           PIC X(2).
               10  GREGDATE-MM           PIC X(2).
               10  GREGDATE-DD           PIC X(2).
       01  JULDATE.
           05  JULYEAR                   PIC 9(4).
           05  JULDAY                    PIC 9(3).
       01  DAYDIGIT                      PIC X.
       01  LEAPYEAR                      PIC X.

       COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP IN COPYLIB.
       COPY THDPRT  IN COPYLIB.
026900 01  TIME-BUFF.
027000     02  TIME-HHMM                 PIC XXXX.
027100     02  FILLER                    PIC XX.
027200 01  TABLE-NUM                     PIC S9(4) COMP-4.
027300 01  TABLE-NUM1                    PIC S9(4) COMP-4.
027400 01  TOT-MZ-LCST                   PIC 9(14).
027500 01  TOT-MZ-MCST                   PIC 9(17).
027600 01  TOT-WO-COST                   PIC 9(16).
027700 01  TOT-ZO-COST                   PIC 9(18).
       COPY VCOMLINK OF COPYLIB.
027800 01  WO-LABOR-DATA.                COPY DWOLABOR OF COPYLIB.
027900 01  WO-MATER-DATA.                COPY DWOPARTS OF COPYLIB.
028000 01  WO-BASIC-DATA.                COPY DWOBASIC OF COPYLIB.
028100 01  WRITE-K                       PIC 9(4) VALUE 0.
028200 01  ZONE-TAG                      PIC X(4).
028300 01  ZONE-TABLE.
028400     05 ZT OCCURS 100 TIMES.
028500        10 TZONE                   PIC X(4).
028600        10 EQPNUMS.
028700           15 TEQPNUM OCCURS 5 TIMES
028800                                   PIC X(6).
028900        10 CRAFTS.
029000           15 TCRAFT  OCCURS 5 TIMES
029100                                   PIC X(2).
029400 PROCEDURE DIVISION.
029600 BEGIN-PROC.
           PERFORM 1-HSK.
030200     SORT SORT-FILE ASCENDING KEY
030300        Z-SORT EXPCLASS-SORT EQPNUM-SORT WONUM-SORT
030400        INPUT  PROCEDURE 8-INPUT-RECORDS
030500        OUTPUT PROCEDURE 9-WRITE-RECORDS.
030700
030900 2-EOJ.
           CLOSE IL-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-PARTS-FILE.
031500     GOBACK.
031600
031800 1-HSK.
           OPEN INPUT  R6FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-PARTS-FILE.
031900     ACCEPT DATE-BUFF FROM DATE.
032000     ACCEPT TIME-BUFF FROM TIME.
032100     STRING YR-BUFF-9 MTH-BUFF-9 DAY-BUFF-9 TIME-HHMM
032200      DELIMITED BY SIZE INTO STOP-DATE.
           IF STOP-YY > 70
               MOVE 19 TO STOP-CC
           ELSE
               MOVE 20 TO STOP-CC.
032300     MOVE MTH-BUFF-9 TO GREGDATE-MM.
032400     MOVE DAY-BUFF-9 TO GREGDATE-DD.
032500     MOVE YR-BUFF-9 TO GREGDATE-YY.
           IF GREGDATE-YY > "70"
               MOVE "19" TO GREGDATE-CC
           ELSE
               MOVE "20" TO GREGDATE-CC.
           MOVE SPACES TO JULDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
032800     SUBTRACT 1 FROM JULDAY.
032900     IF JULDAY < 1
               MOVE 365 TO JULDAY
               SUBTRACT 1 FROM JULYEAR
           END-IF.
           MOVE SPACES TO GREGDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
           MOVE GREGDATE TO START-DATE-CN.
034100     MOVE TIME-HHMM TO STRT-TIME.
           PERFORM 1-LOAD-OPTIONS THRU 1-LO-EXIT.
           CLOSE R6FILE.
           CALL "MCDLT" USING DELETE-FILE.
035200
035400 1-LOAD-OPTIONS.
035800     READ R6FILE AT END GO TO 1-LO-EXIT.
036200     MOVE R6REC TO START-DATE.
           IF STRT-YY > 70
               MOVE 19 TO STRT-CC
           ELSE
               MOVE 20 TO STRT-CC.
036400     READ R6FILE AT END GO TO 1-LO-EXIT.
036800     MOVE R6REC TO STOP-DATE.
           IF STOP-YY > 70
               MOVE 19 TO STOP-CC
           ELSE
               MOVE 20 TO STOP-CC.
037000     READ R6FILE AT END GO TO 1-LO-EXIT.
037400     MOVE 1 TO S1.
037500     PERFORM 11-READ-OPTIONS THRU 11-R-O-E.
       1-LO-EXIT.    EXIT.
037800
038000 11-READ-OPTIONS.
           DISPLAY "R6REC = " R6REC.
038100     MOVE R6REC TO ZT (S1).
038200     READ R6FILE AT END GO TO 11-R-O-E.
038600     ADD 1 TO S1.
           GO TO 11-READ-OPTIONS.
038700 11-R-O-E.    EXIT.
038900
039100 8-INPUT-RECORDS.
039200     PERFORM 81-HOUSEKEEPING THRU 81-HOUSEKEEPING-EXIT.
039300     PERFORM 86-MAIN THRU 86-MAIN-EXIT.
039500 8-END-INPUT.    EXIT.
039600
039800 81-HOUSEKEEPING.
041500     MOVE 1 TO ARG-NO.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
041800     MOVE DATE-FLAG-SW TO DATE-FLAG.
041900     MOVE 1 TO DATE-MODE.
042000     MOVE DATE-FLAG TO DATE-CODE.
042100     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
042200     MOVE DATE-SLASH-OUT TO DATE-1-H.
042300     MOVE TIME-HHMM      TO TIME-1-H.

042400 81-HOUSEKEEPING-EXIT.    EXIT.
042600
042800 86-MAIN.
           MOVE 0 TO COND-WORD.
042900     MOVE "CW" TO WOSTATUS OF WBFREC ARGUMENT-DEFN.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
043400*    IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
           IF COND-WORD = 17
               DISPLAY "NO 'CW' STATUS WORK ORDERS"
               GO TO 86-MAIN-EXIT.
044000     PERFORM 861-DBGET THRU 861-DBGET-EXIT
044100         UNTIL COND-WORD = 15.
           MOVE 0 TO COND-WORD.
044200     MOVE "DW" TO WOSTATUS OF WBFREC ARGUMENT-DEFN.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
043400*    IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
           IF COND-WORD = 17
               DISPLAY "NO 'DW' STATUS WORK ORDERS"
               GO TO 86-MAIN-EXIT.
045300     PERFORM 861-DBGET THRU 861-DBGET-EXIT
045400         UNTIL COND-WORD = 15.
045500     MOVE "FF" TO WOSTATUS OF WBFREC ARGUMENT-DEFN.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY     MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
043400*    IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
           IF COND-WORD = 17
               DISPLAY "NO 'FF' STATUS WORK ORDERS"
               GO TO 86-MAIN-EXIT.
046600     PERFORM 861-DBGET THRU 861-DBGET-EXIT
046700         UNTIL COND-WORD = 15.

046800 86-MAIN-EXIT.    EXIT.
047000
047200 861-DBGET.
047300     MOVE 0 TO COND-WORD.
047400     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
047500         AT END    MOVE 15 TO COND-WORD.
           IF WOSTATUS OF WBFREC NOT = ARGUMENT-DEFN
               MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
047600     IF COND-WORD = 15 GO TO 861-DBGET-EXIT.
048200     STRING DATE-COMP-CN TIME-COMP DELIMITED BY SIZE
              INTO COMP-DATE.
048400     IF (COMP-DATE > START-DATE-CN
                 OR COMP-DATE = START-DATE-CN)
048500       AND
048600        (COMP-DATE < STOP-DATE-CN
                 OR COMP-DATE = STOP-DATE-CN)
048700       NEXT SENTENCE
048800     ELSE
048900     GO TO 861-DBGET-EXIT.
049100     IF TZONE (1) = SPACES GO TO 861-DBGET-CONT.
049600     PERFORM 8610-LOCATE-ZONE VARYING TABLE-NUM FROM 1 BY 1
               UNTIL TABLE-NUM > 100 OR
049700         ZONE = TZONE (TABLE-NUM) OR TZONE (TABLE-NUM) = SPACES.
049900     IF TZONE (TABLE-NUM) = SPACES OR TABLE-NUM > 100
050000         GO TO 861-DBGET-EXIT.
050100
050200     IF TEQPNUM (TABLE-NUM, 1) = SPACES
050300         NEXT SENTENCE
050400     ELSE
050500     PERFORM 8610-LOCATE-EQPNUM VARYING TABLE-NUM1 FROM 1 BY 1
              UNTIL TABLE-NUM1 > 5 OR
050600            EQUIP-NUM = TEQPNUM (TABLE-NUM, TABLE-NUM1)
050800            IF TABLE-NUM1 > 5
050900               GO TO 861-DBGET-EXIT.
051100     IF TCRAFT (TABLE-NUM, 1) = SPACES
051200       NEXT SENTENCE
051300     ELSE
051400     PERFORM 8610-LOCATE-CRAFT  VARYING TABLE-NUM1 FROM 1 BY 1
               UNTIL TABLE-NUM1 > 5 OR
051500             CRAFTS-REQD-1 = TCRAFT (TABLE-NUM, TABLE-NUM1)
051700             IF TABLE-NUM1 > 5
051800                 GO TO 861-DBGET-EXIT.
051900
052000 861-DBGET-CONT.
052200     MOVE ZONE TO Z-SORT.
052300     MOVE PRIORITY TO P-SORT.
052400     MOVE WO-NUM TO WONUM-SORT.
052500     MOVE EXP-CLASS TO EXPCLASS-SORT.
052600     MOVE DESCRIPTION-1 TO WODESC-SORT.
052700     MOVE EQUIP-NUM TO EQPNUM-SORT.
052800     MOVE FAILURE-CODE TO FCODE-SORT.
052900     MOVE CRAFTS-REQD-1 TO CRAFT1-SORT.
053000     MOVE CRAFTS-REQD-2 TO CRAFT2-SORT.
053100     MOVE CRAFTS-REQD-3 TO CRAFT3-SORT.
053200     MOVE DATE-COMP TO DCOMP-SORT.
053300     MOVE TIME-COMP TO TCOMP-SORT.
053500     PERFORM 8611-CALC-COSTS.
053700     RELEASE SORT-REC.
053800 861-DBGET-EXIT.    EXIT.
054000
054200 8610-LOCATE-ZONE.
054300
054400 8610-LOCATE-EQPNUM.
054500
054600 8610-LOCATE-CRAFT.
054700
054900 8611-CALC-COSTS.
055000     PERFORM 86110-RSGL THRU 86110-RSGLE.
055100     PERFORM 86111-RSGM THRU 86111-RSGME.
055200
055400 86110-RSGL.
055500     MOVE 0 TO LCST-SORT.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM TO WONUM OF WLFREC.
           START WO-LABOR-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
056100     IF COND-WORD = 17 GO TO 86110-RSGLE.
056700     READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
056800         AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = WONUM OF WLFREC MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
056900     IF COND-WORD = 15 GO TO 86110-RSGLE.
057500     PERFORM 861100-READ-LABOR-CHAIN THRU 861100-RLCE
               UNTIL COND-WORD = 15.

057600 86110-RSGLE.    EXIT.
057800
060600 861100-READ-LABOR-CHAIN.
060700     IF LABOR-COST NUMERIC
060800         ADD LABOR-COST TO LCST-SORT.
           MOVE 0 TO COND-WORD.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = WONUM OF WLFREC MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
061100     IF COND-WORD = 15 GO TO 861100-RLCE.

061700 861100-RLCE.    EXIT.
061900
058000 86111-RSGM.
058100     MOVE 0 TO MCST-SORT.
           MOVE 0 TO COND-WORD.
           MOVE WO-NUM TO WONUM OF WPFREC.
           START WO-PARTS-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
058700     IF COND-WORD = 17 GO TO 86111-RSGME.
           READ WO-PARTS-FILE NEXT INTO WO-MATER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = WONUM OF WPFREC MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
059500     IF COND-WORD = 15 GO TO 86111-RSGME.
060100     PERFORM 861110-READ-MATER-CHAIN THRU 861110-RMCE
               UNTIL COND-WORD = 15.

060200 86111-RSGME.    EXIT.
060400
062100 861110-READ-MATER-CHAIN.
062200     IF P-ACT-COST NUMERIC
062300         ADD P-ACT-COST TO MCST-SORT.
           MOVE 0 TO COND-WORD.
           READ WO-PARTS-FILE NEXT INTO WO-MATER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WO-NUM NOT = WONUM OF WPFREC MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
062600     IF COND-WORD = 15 GO TO 861110-RMCE.

063200 861110-RMCE.    EXIT.
063400
063600 9-WRITE-RECORDS.
063700     PERFORM 91-HOUSEKEEPING THRU 91-HOUSEKEEPING-EXIT.
063900     PERFORM 96-MAIN THRU 96-MAIN-EXIT UNTIL
064000             EOF-SW = 1.
064100     PERFORM 97-END-OF-JOB-PROC.
064200 END-OUTPUT.    EXIT.
064300
064500 91-HOUSEKEEPING.
           ACCEPT HD-ROUTE-DATA.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISR6.PUB"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
097800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
097900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
098000         PERFORM 998-BLOWUP.
098100
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
098500
098600     IF NOT PAPER-IS-132-COLS
               MOVE COMPRESS-PRINT TO PRT-TYPE
098700         WRITE PRT-REC AFTER ADVANCING 0.
           CALL "CLMR6IL".
065800     OPEN OUTPUT IL-FILE.
065900     RETURN SORT-FILE
066000      AT END
066100      DISPLAY
066200       "NO VERBAL WORK ORDERS WERE COMPLETED IN LAST 24 HRS"
066300       GO TO 2-EOJ.
066400     MOVE Z-SORT TO ZONE-TAG.
066500     MOVE EXPCLASS-SORT TO EXPCLASS-TAG.
066600     PERFORM 96-HEADINGS.
066700     PERFORM 96-ZONE-LITERAL.
066800     PERFORM 96-EXPCLASS-LITERAL.
066900     MOVE 0 TO ACT-KEY.
067000     MOVE 0 TO TOT-MZ-LCST.
067100     MOVE 0 TO TOT-MZ-MCST.
           MOVE 0 TO EOF-SW.

067200 91-HOUSEKEEPING-EXIT.    EXIT.
067400
067600 96-MAIN.
067700     MOVE WONO-SORT TO WONO-REC.
067800     MOVE WOSU-SORT TO WOSU-REC.
067900     MOVE EQPNUM-SORT TO EQPNUM-REC.
068000     MOVE WODESC-SORT TO WODESC-REC.
068100     MOVE P-SORT TO PRTY-REC.
068200     MOVE FCODE2-SORT TO FCODE2-REC.
068300     MOVE FCODE4-SORT TO FCODE4-REC.
068400     MOVE CRAFT1-SORT TO CRAFT1-REC.
068500     MOVE CRAFT2-SORT TO CRAFT2-REC.
068600     MOVE CRAFT3-SORT TO CRAFT3-REC.
068700     IF DATE-FLAG = 3
068800         MOVE MM-SORT TO DM-REC
068900         MOVE DD-SORT TO MD-REC
069000     ELSE
069100     MOVE MM-SORT TO MD-REC
069200     MOVE DD-SORT TO DM-REC.
069300     MOVE TCOMP-SORT TO TCOMP-REC.
069400     MOVE LCST-SORT TO LABORCST-REC.
069500     MOVE MCST-SORT TO  MATLCST-REC.
069600     ADD LCST-SORT TO TOT-MZ-LCST.
069700     ADD MCST-SORT TO TOT-MZ-MCST.
069800     ADD LCST-SORT MCST-SORT GIVING TOT-WO-COST.
069900     MOVE TOT-WO-COST TO TOTCST-REC.
070000     MOVE DETAIL-REC TO PRT-LINE.
070100     WRITE PRT-REC AFTER ADVANCING 1 LINES.
070200     IF CRAFT1-REC = "IL" OR CRAFT2-REC = "IL"
070300                          OR CRAFT3-REC = "IL"
070400         MOVE Z-SORT TO ZONE-IL
070500         MOVE DETAIL-REC TO DETAIL-IL
070600         ADD 1 TO ACT-KEY
070700         WRITE ILF
070800            INVALID KEY
070900            DISPLAY "UNABLE TO WRITE IL FILE"
071000            GO TO 2-EOJ.
071100     ADD 1 TO WRITE-K.
071200     RETURN SORT-FILE
071300      AT END
071400         MOVE ZONE-TAG TO MZ-3-L
071500         MOVE TOT-MZ-LCST TO LABR-3-L
071600         MOVE TOT-MZ-MCST TO MATL-3-L
071700         ADD TOT-MZ-LCST TOT-MZ-MCST GIVING TOT-ZO-COST
071800         MOVE TOT-ZO-COST TO TOTL-3-L
071900         MOVE LITERAL-3-L TO PRT-LINE
072000         WRITE PRT-REC AFTER ADVANCING 2 LINES
072100         MOVE SPACES TO ZONE-TAG
072200         MOVE 0 TO ACT-KEY
               CLOSE IL-FILE
               OPEN INPUT IL-FILE
072300         PERFORM 961-WRITE-IL-DATA THRU 961-WRITE-ID-EXIT
072400         MOVE 1 TO EOF-SW
072500         GO TO 96-MAIN-EXIT.
072600     IF Z-SORT NOT = ZONE-TAG
072700         MOVE ZONE-TAG TO MZ-3-L
072800         MOVE TOT-MZ-LCST TO LABR-3-L
072900         MOVE TOT-MZ-MCST TO MATL-3-L
073000         ADD TOT-MZ-LCST, TOT-MZ-MCST GIVING TOT-ZO-COST
073100         MOVE TOT-ZO-COST TO TOTL-3-L
073200         MOVE 0 TO TOT-MZ-LCST TOT-MZ-MCST
073300         MOVE LITERAL-3-L TO PRT-LINE
073400         WRITE PRT-REC AFTER ADVANCING 2 LINES
073500         MOVE Z-SORT TO ZONE-TAG
073600         MOVE EXPCLASS-SORT TO EXPCLASS-TAG
073700         PERFORM 96-HEADINGS
073800         PERFORM 96-ZONE-LITERAL
073900         PERFORM 96-EXPCLASS-LITERAL.
074000     IF EXPCLASS-SORT NOT = EXPCLASS-TAG
074100         MOVE EXPCLASS-SORT TO EXPCLASS-TAG
074200         IF WRITE-K > 55
074300           PERFORM 96-HEADINGS
074400           PERFORM 96-EXPCLASS-LITERAL
074500         ELSE
074600           PERFORM 96-EXPCLASS-LITERAL.
074700     IF WRITE-K > 60
074800         PERFORM 96-HEADINGS
074900         MOVE SPACES TO PRT-LINE
075000         WRITE PRT-REC AFTER ADVANCING 1 LINES
075100         ADD 1 TO WRITE-K.
075200
075300 96-MAIN-EXIT.    EXIT.
075500
075700 961-WRITE-IL-DATA.
075800     ADD 1 TO ACT-KEY.
075900     READ IL-FILE
076000      INVALID KEY
076100       GO TO 961-WRITE-ID-EXIT.
076200     IF ZONE-IL NOT = ZONE-TAG
076300       PERFORM 96-HEADINGS
076400       MOVE ZONE-IL TO ZONE-TAG
076500       PERFORM 96-ZONE-LITERAL.
076600     MOVE DETAIL-IL TO PRT-LINE.
076700     WRITE PRT-REC AFTER ADVANCING 1 LINES.
076800     ADD 1 TO WRITE-K.
076900     IF WRITE-K > 60
077000       PERFORM 96-HEADINGS
077100       MOVE SPACES TO PRT-LINE
077200       WRITE PRT-REC AFTER ADVANCING 1 LINES.
077300     GO TO 961-WRITE-IL-DATA.

077400 961-WRITE-ID-EXIT.    EXIT.
077600
077900 96-HEADINGS.
078000     MOVE ZERO TO WRITE-K.
078100     MOVE HEADING-1-H TO PRT-LINE.
078200     WRITE PRT-REC AFTER ADVANCING NEW-PAGE.
078300     MOVE SPACES TO PRT-LINE.
078400     STRING "START DATE " START-DATE " STOP DATE " STOP-DATE
078500      DELIMITED BY SIZE INTO PRT-LINE.
078600     WRITE PRT-REC AFTER ADVANCING 1 LINES.
078700     MOVE HEADING-2-H TO PRT-LINE.
078800     WRITE PRT-REC AFTER ADVANCING 3 LINES.
078900     MOVE HEADING-3-H TO PRT-LINE.
079000     WRITE PRT-REC AFTER ADVANCING 1 LINES.
079100     ADD 5 TO WRITE-K.
079200
079300 96-ZONE-LITERAL.
079400     MOVE ASTERISK-LINE TO PRT-REC.
079500     WRITE PRT-REC AFTER ADVANCING 3 LINES.
079600     MOVE ZONE-TAG TO MZ-1-L.
079700     MOVE LITERAL-1-L TO PRT-LINE.
079800     WRITE PRT-REC AFTER ADVANCING 1 LINES.
079900     MOVE ASTERISK-LINE TO PRT-LINE.
080000     WRITE PRT-REC AFTER ADVANCING 1 LINES.
080100     ADD 5 TO WRITE-K.
080200
080300 96-EXPCLASS-LITERAL.
080400     MOVE EXPCLASS-TAG TO EXP-2-L.
080500     MOVE LITERAL-2-L TO PRT-LINE.
080600     WRITE PRT-REC AFTER ADVANCING 2 LINES.
080700     ADD 2 TO WRITE-K.
080800
081000 97-END-OF-JOB-PROC.
081100     IF PAPER-IS-132-COLS
081200         NEXT SENTENCE
081300     ELSE
           MOVE SPACES TO PRT-REC
           MOVE NORMAL-PRINT TO PRT-TYPE
081400     WRITE PRT-REC AFTER ADVANCING 1 LINES.
082200     CLOSE PRINT-FILE.

       COPY OVRPFCALL IN COPYLIB.

177600 998-BLOWUP.
177700     MOVE "TVCSTREV" TO BU-PGM-NAME.
177800     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
177900                      VIEW-COMAREA DUMMY-KSAM-STAT
178000                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.
