000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.     TVENINQD.
000400*AUTHOR.         BARBARA WINTER.
000500*REMARKS.
000600*
000700********************************************************
000800*    THIS PROGRAM IS STREAMED FROM THE VENDOR INQUIRY  *
000900*  PROGRAM (Q6).  IT WILL DELETE ANY NON-QUOTE CODE    *
001000*  TIED TO A SPECIFIC VENDOR, OR DELETE ALL VENDORS    *
001100*  TIED TO A SPECIFIC NON-QUOTE CODE.  THESE ENTRIES   *
001200*  GET CREATED IN DVENDITM WHENEVER A PURCHASE ORDER   *
001300*  IS CUT AND THERE IS NOT QUOTE INFORMATION ON THAT   *
001400*  ITEM-VENDOR COMBINATION.                            *
001500********************************************************
001600*INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001700 DATE-WRITTEN.   FEBUARY 1988.
001800
001900 ENVIRONMENT DIVISION.
002000 CONFIGURATION SECTION.
002100 SOURCE-COMPUTER.    HP-3000.
002200 OBJECT-COMPUTER.    HP-3000.
002300
002400 INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT DVENDITM
              ASSIGN TO DATABASE-MCFLCS0801
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
            SELECT DVENDITM2
              ASSIGN TO DATABASE-MCFLCS0802
              ORGANIZATION IS INDEXED
                 ACCESS MODE IS DYNAMIC
              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
              FILE STATUS IS FILE-STATUS.
002500 DATA DIVISION.
002600 FILE SECTION.
       FD  DVENDITM
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC.
           COPY DDS-MCRPCS0800  OF MCFLCS0801.

       FD  DVENDITM2
           LABEL RECORDS ARE STANDARD.
       01  DVENDITM-REC2.
           COPY DDS-MCRPCS0800  OF MCFLCS0802.

002700
002800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1      PIC X.
           05  FILE-STATUS-2      PIC X.
003600
003700 COPY DATAB OF COPYLIB.
004000 01  VEN-ARG                    PIC X(10)  VALUE SPACES.
004100 01  CODE-ARG                   PIC X(8)   VALUE SPACES.
004400
004500 COPY DVENDITM OF COPYLIB.
004600 COPY TBLOWUP OF COPYLIB.
004700
       LINKAGE SECTION.
002900 01  ACCEPT-DATA.
003000     05  ACCEPT-TYPE            PIC X.
003100     05  ACCEPT-VENDOR          PIC X(10).
003200     05  ACCEPT-CORP-CODE REDEFINES ACCEPT-VENDOR.
003300         07  ACCEPT-CODE        PIC X(7).
003400         07  FILLER             PIC X(3).
003500     05  FILLER                 PIC X(69).
004800 PROCEDURE DIVISION USING ACCEPT-DATA.
004900 6-MAIN.
005200
           OPEN I-O DVENDITM DVENDITM2.
005300     IF ACCEPT-TYPE = "V"
005400        PERFORM 100-DELETE-BY-VENDOR THRU 199-EXIT
005500     ELSE
005600        PERFORM 200-DELETE-BY-CODE THRU 299-EXIT.
005700
005710     CLOSE DVENDITM DVENDITM2.
005720
005800     GOBACK.
005900
006000 100-DELETE-BY-VENDOR.
006100     MOVE ACCEPT-VENDOR TO VEN-ARG.
006300
           MOVE 0 TO COND-WORD.
           MOVE VEN-ARG TO VENCDE OF DVENDITM-REC.
           START DVENDITM KEY = VENCDE OF DVENDITM-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
006600     IF COND-WORD = 17
006700        GO TO 120-UNLOCK-DVENDITM
006800     ELSE
006900        IF COND-WORD NOT = 0
007000           MOVE "DBFIND DVENDITM- TVENINQD " TO BU-DISPLAY-MSG
007100           PERFORM 990-BLOWUP THRU 999-EXIT.
007200
007300 110-GET-AND-DELETE.
           MOVE 0 TO COND-WORD.
           READ DVENDITM NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF VENCDE OF DVENDITM-REC NOT = VEN-ARG
               MOVE 15 TO COND-WORD.
007600     IF COND-WORD = 15
007700       GO TO 120-UNLOCK-DVENDITM
007800     ELSE
007900       IF COND-WORD NOT = 0
008000          MOVE "DBFIND DVENDITM- TVENINQD " TO BU-DISPLAY-MSG
008100          PERFORM 990-BLOWUP THRU 999-EXIT.
008200
008300     IF VEN-QUOTE-FLAG = "Q"
008400        GO TO 110-GET-AND-DELETE.
008500
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
008700     IF COND-WORD NOT = 0
008800        MOVE "DBDELETE DVENDITM 110 TVENINQD" TO BU-DISPLAY-MSG
008900        PERFORM 990-BLOWUP THRU 999-EXIT.
009000
009100     GO TO 110-GET-AND-DELETE.
009200
009300 120-UNLOCK-DVENDITM.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO VENCDE OF DVENDITM-REC.
           START DVENDITM KEY > VENCDE OF DVENDITM-REC
               INVALID KEY MOVE "00" TO FILE-STATUS.
009500 199-EXIT.  EXIT.
009600
009700 200-DELETE-BY-CODE.
009800     MOVE ACCEPT-CODE TO CODE-ARG.
010000
           MOVE 0 TO COND-WORD.
           MOVE CODE-ARG TO CORPCDE OF DVENDITM-REC2.
           START DVENDITM2 KEY = CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
010300     IF COND-WORD = 17
010400        GO TO 220-UNLOCK-DVENDITM
010500     ELSE
010600        IF COND-WORD NOT = 0
010700           MOVE "DBFIND DVENDITM 200 TVENINQD " TO BU-DISPLAY-MSG
010800           PERFORM 990-BLOWUP THRU 999-EXIT.
010900
011000 210-GET-AND-DELETE.
           MOVE 0 TO COND-WORD.
           READ DVENDITM2 NEXT INTO BUF-DVENDITM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF CORPCDE OF DVENDITM-REC2  NOT = CODE-ARG
               MOVE 15 TO COND-WORD.
011300     IF COND-WORD = 15
011400       GO TO 220-UNLOCK-DVENDITM
011500     ELSE
011600       IF COND-WORD NOT = 0
011700          MOVE "DBFIND DVENDITM 210 TVENINQD " TO BU-DISPLAY-MSG
011800          PERFORM 990-BLOWUP THRU 999-EXIT.
011900
012000     IF VEN-QUOTE-FLAG = "Q"
012100        GO TO 210-GET-AND-DELETE.
012200
           MOVE 0 TO COND-WORD.
           DELETE DVENDITM
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD.
008700     IF COND-WORD NOT = 0
008800        MOVE "DBDELETE DVENDITM 210 TVENINQD" TO BU-DISPLAY-MSG
008900        PERFORM 990-BLOWUP THRU 999-EXIT.
009000
009100     GO TO 210-GET-AND-DELETE.
009200
013000 220-UNLOCK-DVENDITM.
      *------- DO A START > HIGH-VALUES TO UNLOCK
           MOVE HIGH-VALUES TO CORPCDE OF DVENDITM-REC2.
           START DVENDITM2 KEY > CORPCDE OF DVENDITM-REC2
               INVALID KEY MOVE "00" TO FILE-STATUS.
012800     GO TO 210-GET-AND-DELETE.
012900
013200 299-EXIT.  EXIT.
014700
014800 990-BLOWUP.
014900     MOVE "TVENINQD" TO BU-PGM-NAME.
015000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
015100                    DUMMY-VIEW-AREA, FILE-STATUS,
015200                    BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
015300 999-EXIT.     EXIT.
