000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TVERBALP.
000500 INSTALLATION.  GOODYEAR.
000700*REMARKS.       THIS PROGRAM WRITES A REPORT LISTING ALL VERBAL
000800*               WORK ORDERS THAT HAVE REACHED A CERTAIN PERCENT
000900*               OF THEIR MAXIMUM COST.
      *C--------------------------------------------------------------
      *C 02/25/93  JSB REQ #6306
      *C      ADDED "PR" AS A NEW WO STATUS FOR PRE-RELEASE.
      *C--------------------------------------------------------------
      *C
      *C 09/11/1996   CA YODER
      *C   RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
001300 ENVIRONMENT DIVISION.
001400 CONFIGURATION SECTION.
001500 SOURCE-COMPUTER.   AS400.
001600 OBJECT-COMPUTER.   AS400.
001700 COPY SPECIALN IN COPYLIB.
001900 INPUT-OUTPUT SECTION.
002000 FILE-CONTROL.
           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
002800     SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-MATER-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WMF-STATUS.
002400 DATA DIVISION.
002500 FILE SECTION.
002600 SD  SORT-FILE
002700     RECORD CONTAINS 124 CHARACTERS
002800     DATA RECORD IS SORTF.
002900 01  SORTF.
003000     05  S-ZONE               PIC X(4).
003100     05  S-WONUM              PIC X(10).
003200     05  S-STATUS             PIC X(2).
003300     05  S-EQPNUM             PIC X(6).
003400     05  S-DESCRIPTION        PIC X(30).
003500     05  S-LABOR-CST          PIC 9(12).
003600     05  S-MATER-CST          PIC 9(15).
003700     05  S-PURCH-CST          PIC 9(15).
003800     05  S-TOTAL-CST          PIC 9(16).
003900     05  S-PERCENT            PIC 999V999.
004000     05  S-CLASS              PIC X(8).
004200 FD  PRINT-FILE
004300     RECORD CONTAINS 132 CHARACTERS
004400     LABEL RECORD IS OMITTED
004500     DATA RECORD IS PRINTF.
004600 01  PRINTF                    PIC X(132).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.
       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-MATER-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WMFREC.
       01  WMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
004900 WORKING-STORAGE SECTION.
005000 01  AMOUNT                   PIC 9(16).
005100 01  ARG-NO                   PIC 9(9).
005700 01  DBPARAMETERS.            COPY DBPARMS OF COPYLIB.
       COPY TDATESUB OF COPYLIB.
006500 01  END-OF-FILE-SW           PIC X VALUE "N".
006600     88  END-OF-SORT-FILE           VALUE "Y".
       01  FILE-STATUSES.
           05  WBF-STATUS           PIC XX.
           05  WLF-STATUS           PIC XX.
           05  WLNU-STATUS          PIC XX.
           05  WMF-STATUS           PIC XX.
006900 01  HEADER-LINE.
007000     05  WONUM-H              PIC X(12) VALUE "WONUM".
007100     05  STATUS-H             PIC X(4)  VALUE "ST".
007200     05  EQPNUM-H             PIC X(8)  VALUE "EQPNUM".
007300     05  DESCRIPTION-H        PIC X(29) VALUE "DESCRIPTION".
007400     05  LABOR-H              PIC X(17) VALUE "LABOR_COST".
007500     05  MATER-H              PIC X(16) VALUE "MATER_COST".
007600     05  PURCH-H              PIC X(18) VALUE "PURCH_COST".
007700     05  TOTAL-H              PIC X(12) VALUE "TOTAL_COST".
007800     05  PERCENT-H            PIC X(5)  VALUE "P %".
007900     05  CLASS-H              PIC X(10) VALUE "EXP_CLASS".
008000 01  HD-RET-CODE              PIC S9(4) COMP VALUE 0.
008100 01  HD-FILE-NAME             PIC X(17) VALUE "HMMISR12.PUB".
008200 01  H-ZONE.
008300     05  FILLER               PIC X(7) VALUE "ZONE = ".
008400     05  P-ZONE               PIC X(4).
       01  INPUT-PERCENT.
           05  INPUT-PCT            PIC 99.
009800 01  LINE-KOUNTER             PIC 9999 VALUE 60.
009900 01  LAST-WO-BUFF.            COPY MLASTWO OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
010200 01  MESSAGE-BUFFER.
010300     05  M1                   PIC X(80).
010400     05  M2.
010500         10  M3               PIC X(13) VALUE "COND WORD IS ".
010600         10  M4               PIC +9999.
011500 01  RESTRICTION-LINE.
011600     05  FILLER               PIC X(15) VALUE "RESTRICTIONS : ".
011700     05  FILLER               PIC X(07) VALUE "EQPNUM ".
011800     05  EQPNUM-R             PIC X(06) VALUE SPACES.
011900     05  FILLER               PIC X(06) VALUE " DEPT ".
012000     05  DEPT-R               PIC X(04) VALUE SPACES.
012100     05  FILLER               PIC X(06) VALUE " ZONE ".
012200     05  ZONE-R               PIC X(04) VALUE SPACES.
012300     05  FILLER               PIC X(11) VALUE " EXP_CLASS ".
012400     05  CLASS-R              PIC X(08) VALUE SPACES.
012500 01  SAVE-ZONE                PIC X(4).
012900 01  ST-INDEX                 PIC S9(4) COMP.
013000 01  STATUS-VALUES.
013100     05  FILLER               PIC X(2) VALUE "OO".
013200     05  FILLER               PIC X(2) VALUE "IP".
013300     05  FILLER               PIC X(2) VALUE "HM".
013400     05  FILLER               PIC X(2) VALUE "CW".
013500     05  FILLER               PIC X(2) VALUE "DW".
013600     05  FILLER               PIC X(2) VALUE "HA".
013700     05  FILLER               PIC X(2) VALUE "HS".
013800     05  FILLER               PIC X(2) VALUE "SD".
013900     05  FILLER               PIC X(2) VALUE "SD".
014000     05  FILLER               PIC X(2) VALUE SPACES.
014100 01  STATUS-TABLE REDEFINES STATUS-VALUES.
014200     05  ST OCCURS 10 TIMES
014300                              PIC X(2).
       COPY DBSTAT OF COPYLIB.
014500 01  STATUS-CHECK             PIC X VALUE "O".
014600 01  TITLE-LINE.
014700     05  FILLER               PIC X(47) VALUE
014800        "VERBAL WORK ORDERS THAT HAVE REACHED AT LEAST '".
014900     05  T-P                  PIC XX.
015000     05  FILLER               PIC X(13) VALUE "' PERCENT OF ".
015100     05  T-D                  PIC X(16).
015200     05  FILLER               PIC X(37) VALUE SPACES.
015300     05  T-DATE               PIC X(8).
015400     05  FILLER               PIC X(5) VALUE SPACES.
015500     05  T-N                  PIC 9999 VALUE 0.
015600 01  VERBAL-TOTALS.
015700     05  LABOR-TOTAL          PIC 9(12).
015800     05  MATER-TOTAL          PIC 9(15).
015900     05  PURCH-TOTAL          PIC 9(15).
016000     05  WONUM-TOTAL          PIC 9(16).
016100 01  VALUE-LINE.
016200     05  WONUM-V              PIC X(12).
016300     05  STATUS-V             PIC X(4).
016400     05  EQPNUM-V             PIC X(8).
016500     05  DESCRIPTION-V        PIC X(25).
016600     05  FILLER               PIC X(2) VALUE SPACES.
016700     05  LABOR-V              PIC Z(12).
016800     05  FILLER               PIC X(2) VALUE SPACES.
016900     05  MATER-V              PIC Z(15).
017000     05  FILLER               PIC X(2) VALUE SPACES.
017100     05  PURCH-V              PIC Z(15).
017200     05  FILLER               PIC X VALUE SPACE.
017300     05  TOTAL-V              PIC Z(16).
017400     05  FILLER               PIC X(2) VALUE SPACES.
017500     05  PERCENT-V            PIC Z99.
017600     05  FILLER               PIC X(2) VALUE SPACES.
017700     05  CLASS-V              PIC X(10).
017800 01  WO-BASIC-DATA.          COPY DWOBASIC OF COPYLIB.
017900 01  WO-MATER-DATA.          COPY DWOPARTS OF COPYLIB.
018000 01  WO-LABOR-DATA.          COPY DWOLABOR OF COPYLIB.
       LINKAGE SECTION.
       01  LINK-DATA.
010400     05  TERMINAL-INPUT.
010500         10  PERCENT-INPUT    PIC X(2).
010600         10  MAXIMUM-INPUT    PIC X(16).
010700         10  EQPNUM-INPUT     PIC X(6).
010800         10  DEPT-INPUT       PIC X(4).
010900         10  ZONE-INPUT       PIC X(4).
011000         10  CLASS-INPUT      PIC X(8).
011100         10  WONUM-INPUT      PIC X(10).
008500     05  HD-ROUTE-DATA.
008600         10  HD-NAME          PIC X(15).
008700         10  HD-DEPT          PIC X(4).
008800         10  HD-SPOOLER-NUMBER
008900                              PIC 9(3).
009000         10  HD-USER          PIC X(8).
009100         10  HD-ACCOUNT       PIC X(8).
009200         10  HD-GROUP         PIC X(8).
009300         10  HD-TERM          PIC X(4).
009400         10  HD-PAPER-FLAG    PIC X.
009600         10  HD-PRTRPT-FLAG   PIC X.
009700         10  FILLER           PIC X(28).
           05  FILLER               PIC X(70).
018400 PROCEDURE DIVISION USING LINK-DATA.
018700 BEGIN-PROG.
018900     PERFORM 1-HSK.
019000     PERFORM 6-MAIN.
       2-EOJ.
066000     MOVE SPACES TO PRINTF.
066100     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
066800     CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-MATER-FILE.
066900     GOBACK.
021200 1-HSK.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-MATER-FILE.
021600     OPEN OUTPUT PRINT-FILE.
022700     MOVE 0 TO COND-WORD.
025000     MOVE 1 TO ARG-NO.
025100     READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
025200         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD NOT = 0 MOVE 1 TO DATE-FLAG-SW.
026500     MOVE DATE-FLAG-SW TO DATE-CODE.
026600     MOVE 1 TO DATE-MODE.
026700     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
026900     MOVE DATE-SLASH-OUT TO T-DATE.
027000     MOVE PERCENT-INPUT TO INPUT-PERCENT T-P.
           IF MAXIMUM-INPUT = SPACES
               MOVE 0 TO T-D AMOUNT MAXIMUM-INPUT
           ELSE
027100     MOVE MAXIMUM-INPUT TO T-D AMOUNT.
027200     MOVE EQPNUM-INPUT TO EQPNUM-R.
027300     MOVE DEPT-INPUT TO DEPT-R.
027400     MOVE ZONE-INPUT TO ZONE-R.
027500     MOVE CLASS-INPUT TO CLASS-R.
027600
027800 6-MAIN.
027900     SORT SORT-FILE ON ASCENDING KEY S-ZONE S-WONUM
028000         INPUT PROCEDURE  7-INPUT-RECORDS
028100         OUTPUT PROCEDURE 8-OUTPUT-RECORDS.
028200
028400 7-INPUT-RECORDS.
028500     PERFORM 7-INPUT-RECS THRU 7-IRE VARYING ST-INDEX
028600         FROM 1 BY 1 UNTIL ST (ST-INDEX) = SPACES.
028700
029100 7-INPUT-RECS.
029200     MOVE 0 TO COND-WORD.
029400     MOVE ST (ST-INDEX) TO WOSTATUS OF WBFREC.
029500     START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
029600         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
029700     IF COND-WORD = 17 GO TO 7-IRE.
031000     READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
031100         AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
031200     IF COND-WORD = 15 GO TO 7-IRE.
032500     PERFORM 70-READ-STATUS-CHAIN THRU 70-RSCE
               UNTIL COND-WORD = 15.
032600 7-IRE.    EXIT.
032800
033000 70-READ-STATUS-CHAIN.
033100     IF EQPNUM-INPUT = SPACES
033200         NEXT SENTENCE
033300     ELSE
033400     IF EQUIP-NUM = EQPNUM-INPUT
033500         NEXT SENTENCE
033600     ELSE
033700     PERFORM 700-READ-WO-BASIC-FILE
033900     IF COND-WORD = 0 OR 15
034000         GO TO 70-RSCE
034100     ELSE
034200     MOVE SPACES TO PRINTF
034300     WRITE PRINTF AFTER ADVANCING NEW-PAGE
034400     MOVE "ERROR IN PROGRAM TVERBALP" TO M1
034500     WRITE PRINTF FROM M1
034600     MOVE "DBGET ERROR IN PAR READ-STATUS-CHAIN" TO M1
034700     WRITE PRINTF FROM M1
034800     MOVE COND-WORD TO M4
034900     WRITE PRINTF FROM M2
035000     MOVE "E" TO STATUS-CHECK
035100     GO TO 2-EOJ.
035200     IF DEPT-INPUT = SPACES
035300         NEXT SENTENCE
035400     ELSE
035500     IF DEPT = DEPT-INPUT
035600         NEXT SENTENCE
035700     ELSE
035800     PERFORM 700-READ-WO-BASIC-FILE
036000     IF COND-WORD = 0 OR 15
036100         GO TO 70-RSCE
036200     ELSE
036300     MOVE SPACES TO PRINTF
036400     WRITE PRINTF AFTER ADVANCING NEW-PAGE
036500     MOVE "ERROR IN PROGRAM TVERBALP" TO M1
036600     WRITE PRINTF FROM M1
036700     MOVE "DBGET ERROR IN PAR READ-STATUS-CHAIN" TO M1
036800     WRITE PRINTF FROM M1
036900     MOVE COND-WORD TO M4
037000     WRITE PRINTF FROM M2
037100     MOVE "E" TO STATUS-CHECK
037200     GO TO 2-EOJ.
037300     IF ZONE-INPUT = SPACES
037400         NEXT SENTENCE
037500     ELSE
037600     IF ZONE = ZONE-INPUT
037700         NEXT SENTENCE
037800     ELSE
037900     PERFORM 700-READ-WO-BASIC-FILE
038100     IF COND-WORD = 0 OR 15
038200         GO TO 70-RSCE
038300     ELSE
038400     MOVE SPACES TO PRINTF
038500     WRITE PRINTF AFTER ADVANCING NEW-PAGE
038600     MOVE "ERROR IN PROGRAM TVERBALP" TO M1
038700     WRITE PRINTF FROM M1
038800     MOVE "DBGET ERROR IN PAR READ-STATUS-CHAIN" TO M1
038900     WRITE PRINTF FROM M1
039000     MOVE COND-WORD TO M4
039100     WRITE PRINTF FROM M2
039200     MOVE "E" TO STATUS-CHECK
039300     GO TO 2-EOJ.
039400     IF CLASS-INPUT = SPACES
039500         NEXT SENTENCE
039600     ELSE
039700     IF EXP-CLASS = CLASS-INPUT
039800         NEXT SENTENCE
039900     ELSE
040000     PERFORM 700-READ-WO-BASIC-FILE
040200     IF COND-WORD = 0 OR 15
040300        GO TO 70-RSCE
040400     ELSE
040500     MOVE SPACES TO PRINTF
040600     WRITE PRINTF AFTER ADVANCING NEW-PAGE
040700     MOVE "ERROR IN PROGRAM TVERBALP" TO M1
040800     WRITE PRINTF FROM M1
040900     MOVE "DBGET ERROR IN PAR READ-STATUS-CHAIN" TO M1
041000     WRITE PRINTF FROM M1
041100     MOVE COND-WORD TO M4
041200     WRITE PRINTF FROM M2
041300     MOVE "E" TO STATUS-CHECK
041400     GO TO 2-EOJ.
041500     MOVE ZONE TO S-ZONE.
041600     MOVE WO-NUM TO S-WONUM.
041700     MOVE WO-STATUS TO S-STATUS.
041800     MOVE EQUIP-NUM TO S-EQPNUM.
041900     MOVE DESCRIPTION-1 TO S-DESCRIPTION.
042000     MOVE EXP-CLASS TO S-CLASS.
042100
042300 70-RSGL.
042400     MOVE 0 TO LABOR-TOTAL.
042500     MOVE 0 TO COND-WORD.
042700     MOVE WO-NUM TO WONUM OF WLFREC.
042800     START WO-LABOR-FILE KEY = EXTERNALLY-DESCRIBED-KEY
042900         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
043000     IF COND-WORD = 17 GO TO 70-RSGM.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
044300         AT END    MOVE 15 TO COND-WORD.
044400     IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
044500     IF COND-WORD = 15 GO TO 70-RSGM.
045800     PERFORM 701-READ-LABOR-CHAIN THRU 701-RLCE
               UNTIL COND-WORD = 15.
045900
046100 70-RSGM.
046200     MOVE 0 TO MATER-TOTAL.
046300     MOVE 0 TO COND-WORD.
046500     MOVE WO-NUM TO WONUM OF WMFREC.
046600     START WO-MATER-FILE KEY = EXTERNALLY-DESCRIBED-KEY
046700         INVALID KEY    MOVE 17 TO COND-WORD.
           IF WMF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
046800     IF COND-WORD = 17 GO TO 70-RSCC.
           READ WO-MATER-FILE NEXT INTO WO-MATER-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WMF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
048300     IF COND-WORD = 15 GO TO 70-RSCC.
049600     PERFORM 702-READ-MATER-CHAIN THRU 702-RMCE
               UNTIL COND-WORD = 15.
049700
049900 70-RSCC.
050000     MOVE 0 TO S-PURCH-CST.
050100     MOVE LABOR-TOTAL TO S-LABOR-CST.
050200     MOVE MATER-TOTAL TO S-MATER-CST.
050300     COMPUTE WONUM-TOTAL = LABOR-TOTAL + MATER-TOTAL.
050400     MOVE WONUM-TOTAL TO S-TOTAL-CST.
050500     COMPUTE S-PERCENT = WONUM-TOTAL / AMOUNT * 100.
050600     IF S-PERCENT > INPUT-PCT OR S-PERCENT = INPUT-PCT
050700         RELEASE SORTF.
050800     PERFORM 700-READ-WO-BASIC-FILE.
052500
052600 70-RSCE.    EXIT.
052800
       700-READ-WO-BASIC-FILE.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

053000 701-READ-LABOR-CHAIN.
053100     IF LABOR-COST NUMERIC ADD LABOR-COST TO LABOR-TOTAL.
053300     READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
054800 701-RLCE.    EXIT.
055000
055200 702-READ-MATER-CHAIN.
055300     IF P-ACT-COST NUMERIC ADD P-ACT-COST TO MATER-TOTAL.
055500     READ WO-MATER-FILE NEXT INTO WO-MATER-DATA
055600         AT END    MOVE 15 TO COND-WORD.
           IF WMF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
057000 702-RMCE.    EXIT.
057200
057400 8-OUTPUT-RECORDS.
057500     RETURN SORT-FILE AT END PERFORM NO-RECORDS.
057600     MOVE S-ZONE TO SAVE-ZONE.
057700     PERFORM WRITE-PRINT-FILE UNTIL END-OF-SORT-FILE.
057800     MOVE SPACES TO PRINTF.
057900     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
058000
058400 WRITE-PRINT-FILE.
058500     IF LINE-KOUNTER > 55
058600         ADD 1 TO T-N
058700         WRITE PRINTF FROM TITLE-LINE AFTER ADVANCING NEW-PAGE
058800         MOVE RESTRICTION-LINE TO PRINTF
058900         WRITE PRINTF
059000         MOVE S-ZONE TO P-ZONE
059100         WRITE PRINTF FROM H-ZONE
059200         MOVE ALL "-" TO PRINTF
059300         WRITE PRINTF
059400         MOVE HEADER-LINE TO PRINTF
059500         WRITE PRINTF
059600         MOVE 0 TO LINE-KOUNTER.
059700     MOVE S-WONUM TO WONUM-V.
059800     MOVE S-STATUS TO STATUS-V.
059900     MOVE S-EQPNUM TO EQPNUM-V.
060000     MOVE S-DESCRIPTION TO DESCRIPTION-V.
060100     MOVE S-LABOR-CST TO LABOR-V.
060200     MOVE S-MATER-CST TO MATER-V.
060300     MOVE S-PURCH-CST TO PURCH-V.
060400     MOVE S-TOTAL-CST TO TOTAL-V.
060500     MOVE S-PERCENT TO PERCENT-V.
060600     MOVE S-CLASS TO CLASS-V.
060700     IF S-ZONE = SAVE-ZONE
060800         MOVE S-ZONE TO SAVE-ZONE
060900     ELSE
061000     MOVE S-ZONE TO SAVE-ZONE
061100     IF LINE-KOUNTER = 0
061200         NEXT SENTENCE
061300     ELSE
061400     ADD 1 TO T-N
061500     WRITE PRINTF FROM TITLE-LINE AFTER ADVANCING NEW-PAGE
061600     MOVE RESTRICTION-LINE TO PRINTF
061700     WRITE PRINTF
061800     MOVE S-ZONE TO P-ZONE
061900     WRITE PRINTF FROM H-ZONE
062000     MOVE ALL "-" TO PRINTF
062100     WRITE PRINTF
062200     MOVE HEADER-LINE TO PRINTF
062300     WRITE PRINTF
062400     MOVE 0 TO LINE-KOUNTER.
062500     WRITE PRINTF FROM VALUE-LINE.
062600     ADD 1 TO LINE-KOUNTER.
062700     RETURN SORT-FILE AT END MOVE "Y" TO END-OF-FILE-SW.
062800
063000 NO-RECORDS.
063100     MOVE SPACES TO PRINTF.
063200     WRITE PRINTF AFTER ADVANCING NEW-PAGE.
063300     MOVE "NO RECORDS WERE FOUND THAT MATCHED THE RESTRICTIONS"
063400         TO M1.
063500     WRITE PRINTF FROM M1.
063600     MOVE "PROGRAM TVERBALP" TO M1.
063700     WRITE PRINTF FROM M1.
063800     GO TO 2-EOJ.
