000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.
000400     TVERBALD.
000500 INSTALLATION.  GOODYEAR.
000700*REMARKS.       THIS PROGRAM DISPLAYS WHAT PERCENT OF IT'S
000800*               MAXIMUM COST A VERBAL WORK ORDER HAS REACHED.
      *C
      *C  09/11/1996   CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
001200 ENVIRONMENT DIVISION.
001300 CONFIGURATION SECTION.
001400 SOURCE-COMPUTER.   AS400.
001500 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZREPORT-SI
               ORGANIZATION IS TRANSACTION
               ACCESS IS SEQUENTIAL
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1001
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LABOR-FILE
               ASSIGN TO DATABASE-MCFLMM1301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WLF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
           SELECT WO-MATER-FILE
               ASSIGN TO DATABASE-MCFLMM1201
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   WITH DUPLICATES
               FILE STATUS IS WMF-STATUS.
001800 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC               PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1001.
       FD  WO-LABOR-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLFREC.
       01  WLFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1301.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
       FD  WO-MATER-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WMFREC.
       01  WMFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1201.
001900 WORKING-STORAGE SECTION.
002000 01  AMOUNT.
           05  AMT-9             PIC 9(16).
002100 01  ARG-NO                PIC 9(9).
       COPY CATREAD OF COPYLIB.
       COPY CPYIND  OF COPYLIB.
       01  FILE-STATUSES.
           05  DSPLY-STATUS      PIC XX.
           05  WBF-STATUS        PIC XX.
           05  WLF-STATUS        PIC XX.
           05  WLNU-STATUS       PIC XX.
           05  WMF-STATUS        PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
003200 01  LAST-WO-BUFF.         COPY MLASTWO OF COPYLIB.
       COPY DBSTAT OF COPYLIB.
004100 01  VALUE-LINE.
004200     05  WONUM-V           PIC X(10).
004300     05  STATUS-V          PIC X(2).
004400     05  EQPNUM-V          PIC X(6).
004500     05  DESCRIPTION-V     PIC X(30).
004600     05  CLASS-V           PIC X(8).
004700     05  LABOR-V           PIC Z(12).
004800     05  MATER-V           PIC Z(15).
004900     05  PURCH-V           PIC Z(15).
005000     05  TOTAL-V           PIC Z(16).
005100     05  PERCENT-V         PIC Z99.
005200     05  AMOUNT-V          PIC Z(16).
005300     05  ZONE-V            PIC X(4).
005400 01  VERBAL-TOTALS.
005500     05  LABOR-TOTAL       PIC 9(12).
005600     05  MATER-TOTAL       PIC 9(15).
005700     05  PURCH-TOTAL       PIC 9(15).
005800     05  WONUM-TOTAL       PIC 9(16).
005900     05  W-PERCENT         PIC 999V999.
006000 01  WO-BASIC-DATA.        COPY DWOBASIC OF COPYLIB.
006100 01  WO-MATER-DATA.        COPY DWOPARTS OF COPYLIB.
006200 01  WO-LABOR-DATA.        COPY DWOLABOR OF COPYLIB.
006300 COPY WSCONTROL OF COPYLIB.
006400 LINKAGE SECTION.
006500 01  WONUM-PASS            PIC X(10).
006600 01  STATUS-CHECK          PIC X.
006700 01  MISC-BUFFER           PIC X(80).
       COPY VCOMLINK OF COPYLIB.
006900 01  DBPARAMETERS.         COPY DBPARMS OF COPYLIB.
       COPY LANGSUB OF COPYLIB.
007100 01  MAXIMUM-B             PIC X(16).
007400 PROCEDURE DIVISION USING WONUM-PASS STATUS-CHECK MISC-BUFFER
007500                          VIEW-COMAREA  DBPARAMETERS
007600                          LANGUAGE-PARMS MAXIMUM-B.
007800 BEGIN-PAR.
007900     PERFORM 1-HSK.
           PERFORM 6-MAIN.
       2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LABOR-FILE.
           CLOSE WO-LAST-NUM-USED.
           CLOSE WO-MATER-FILE.
           GOBACK.
       1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LABOR-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
           OPEN INPUT  WO-MATER-FILE.
           MOVE 0 TO COND-WORD.
010400     MOVE 1 TO ARG-NO.
010500     READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
010600         INVALID KEY     MOVE 17 TO COND-WORD.
010700     IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
010800     IF COND-WORD = 17 MOVE 1 TO DATE-FLAG-SW.
           MOVE DATE-FLAG-SW TO DATE-FLAG.
           IF MAXIMUM-B = SPACES
               MOVE 0 TO AMT-9
           ELSE
011100     MOVE MAXIMUM-B TO AMOUNT.
           MOVE AMT-9     TO AMOUNT-V.
011200
       6-MAIN.
008000     PERFORM 60-GET-WONUM.
008100     PERFORM 61-GET-LABOR THRU 61-GET-LABOR-EXIT.
008200     PERFORM 62-GET-MATER THRU 62-GET-MATER-EXIT.
008300     PERFORM 63-CALCULATE.
008400     PERFORM 64-DISPLAY-INFO.
008500
011400 60-GET-WONUM.
011600     PERFORM 69-START-WO-BASIC-FILE.
012200     IF COND-WORD = 17
012300         MOVE 49002 TO CATREAD-MSG-NUMBER
012500         PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
012600         MOVE "D" TO STATUS-CHECK
012700         GO TO 2-EOJ.
012900     PERFORM 69-READ-WO-BASIC-FILE.
013200     IF COND-WORD = 15
013300        MOVE 49002 TO CATREAD-MSG-NUMBER
013500        PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
013600        MOVE "D" TO STATUS-CHECK
013700        GO TO 2-EOJ.
014000     MOVE WO-NUM TO WONUM-V.
014100     MOVE WO-STATUS TO STATUS-V.
014200     MOVE EQUIP-NUM TO EQPNUM-V.
014300     MOVE DESCRIPTION-1 TO DESCRIPTION-V.
014400     MOVE EXP-CLASS TO CLASS-V.
014500     MOVE ZONE TO ZONE-V.
014600
014800 61-GET-LABOR.
015000     MOVE 0 TO LABOR-TOTAL.
           PERFORM 69-START-WO-LABOR-FILE.
015700     IF COND-WORD = 17 GO TO 61-GET-LABOR-EXIT.
015900     PERFORM 69-READ-WO-LABOR-FILE.
016300     IF COND-WORD = 15 GO TO 61-GET-LABOR-EXIT.
016700     PERFORM 610-READ-LABOR-CHAIN THRU 610-RLCE
               UNTIL COND-WORD = 15.
016800 61-GET-LABOR-EXIT.    EXIT.
017000
017200 62-GET-MATER.
017400     MOVE 0 TO MATER-TOTAL.
017500     PERFORM 69-START-WO-MATER-FILE.
018100     IF COND-WORD = 17 GO TO 62-GET-MATER-EXIT.
018400     PERFORM 69-READ-WO-MATER-FILE.
018700     IF COND-WORD = 15 GO TO 62-GET-MATER-EXIT.
019100     PERFORM 620-READ-MATER-CHAIN THRU 620-RMCE
               UNTIL COND-WORD = 15.
019200 62-GET-MATER-EXIT.    EXIT.
019400
019600 63-CALCULATE.
019700     MOVE 0 TO PURCH-V.
019800     MOVE LABOR-TOTAL TO LABOR-V.
019900     MOVE MATER-TOTAL TO MATER-V.
020000     COMPUTE WONUM-TOTAL = LABOR-TOTAL + MATER-TOTAL.
020100     MOVE WONUM-TOTAL TO TOTAL-V.
020200     COMPUTE W-PERCENT = WONUM-TOTAL / AMT-9 * 100.
020300     MOVE W-PERCENT TO PERCENT-V.
020400
020600 610-READ-LABOR-CHAIN.
020800     IF LABOR-COST NUMERIC
020900       ADD LABOR-COST TO LABOR-TOTAL.
021000     PERFORM 69-READ-WO-LABOR-FILE.
021600 610-RLCE.    EXIT.
021800
022000 620-READ-MATER-CHAIN.
022200     IF P-ACT-COST NUMERIC
022300       ADD P-ACT-COST TO MATER-TOTAL.
022400     PERFORM 69-READ-WO-MATER-FILE.
023000 620-RMCE.    EXIT.
023200
023400 64-DISPLAY-INFO.
023600     MOVE "DWONUM" TO VIEW-CFNAME.
           MOVE VALUE-LINE TO DSPLY-REC.
025500     PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
026800     IF VIEW-LASTKEY = 1
026900       MOVE "O" TO STATUS-CHECK
027000     ELSE
028300     IF VIEW-LASTKEY = 3
028400       MOVE "X" TO STATUS-CHECK.
028700
       69-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WONUM-PASS TO WONUM OF WBFREC.
           START WO-BASIC-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WONUM-PASS NOT = WONUM OF WBFREC MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-LABOR-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WONUM-PASS TO WONUM OF WLFREC.
           START WO-LABOR-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-LABOR-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-LABOR-FILE NEXT INTO WO-LABOR-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WONUM-PASS NOT = WONUM OF WLFREC
               MOVE 15 TO COND-WORD.
           IF WLF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       69-START-WO-MATER-FILE.
           MOVE 0 TO COND-WORD.
           MOVE WONUM-PASS TO WONUM OF WMFREC.
           START WO-MATER-FILE KEY = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WMF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

       69-READ-WO-MATER-FILE.
            MOVE 0 TO COND-WORD.
            READ WO-MATER-FILE NEXT INTO WO-MATER-DATA
                AT END    MOVE 15 TO COND-WORD.
            IF WONUM-PASS NOT = WONUM OF WMFREC
                MOVE 15 TO COND-WORD.
            IF WMF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       98-SCREEN-READ.
           READ DISPLAY-FILE FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO INDICS.
           IF DSPLY-STATUS NOT = "00"
               MOVE 3 TO VIEW-LASTKEY
           ELSE
           MOVE FUNCTION-NUM TO VIEW-LASTKEY.

       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.
           MOVE ALL B"0" TO INDICS.

029300 999-CATREAD.
029400     MOVE SPACES TO MISC-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MISC-BUFFER.
030800 999-CATREAD-EXIT.    EXIT.
