001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.     TVNRCRPT.
001300 AUTHOR.         BARBARA WINTER.
001400 INSTALLATION.   GOODYEAR TIRE & RUBBER COMPANY.
001500 DATE-WRITTEN.   NOVEMBER 1985.
001600 DATE-COMPILED.
001700*SECURITY.
001800*REMARKS.
001900*       PRINTS A REPORT OF VENDORS TO BE PAID AT TIME OF RECEIPT.
002500***************************************************************
002600***************************************************************
002700***                    V N R C R P T                        ***
002800***                                                         ***
002900***      THIS PROGRAM PRINTS A REPORT OF VENDORS TO BE      ***
003000***      PAID AT TIME OF RECEIPT AT THE DOCK WITHOUT        ***
003100***      WAITING FOR AN INVOICE.  THE CALLING PROGRAM       ***
003200***      CAN CHOSE A RANGE OF VENDOR CODES TO REPORT ON     ***
003300***      OR ALL CODES MAY BE REPORTED.  THE REPORT MAY      ***
003400***      BE SORTED BY VENDOR CODE OR BY VENDOR NAME.        ***
005800***                                                         ***
005900***************************************************************
006000*   CALLING PROGRAM:    TVENRCV (VIA SRSCRNS)                 *
006100*   PASSED PARAMETERS:  1.  LOW RANGE OF VENDOR CODE          *
006110*                           (OR THE WORD "ALL" )            *
006200*                       2.  HIGH RANGE OF VENDOR CODE         *
006300*                           (SPACES OF LOW RANGE = ALL)       *
006400*                       3.  SORT OPTION (CODE OR NAME)        *
006600***************************************************************
008500 ENVIRONMENT DIVISION.
008600 CONFIGURATION SECTION.
008700 SOURCE-COMPUTER.    HP-3000.
008800 OBJECT-COMPUTER.    HP-3000.
       SPECIAL-NAMES.  C01 IS NEW-PAGE.
008900 INPUT-OUTPUT SECTION.
009000 FILE-CONTROL.
009100      SELECT DISC-PRT        ASSIGN TO PRINTER-MCPRT.
009200      SELECT CODES-FILE      ASSIGN TO DISK-CODES.
009300      SELECT SORT-CODES-FILE ASSIGN TO DISK-SORT.
             SELECT DVENDOR-I
               ASSIGN TO DATABASE-MCFLCS0701
               ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS FILE-STATUS.
009400
009500 DATA DIVISION.
009600 FILE SECTION.
009700
009800 FD  DISC-PRT
009900     RECORD CONTAINS 133 CHARACTERS.
010000 01  PRT-REC.
010200     05  PRT-LINE                PIC X(133).
010300
010400 FD  CODES-FILE
010500     RECORD CONTAINS 60 CHARACTERS.
010600 01  CODES-RECORD.
010700     05  CODE-NUMBER             PIC X(10).
010710     05  CODE-DATE               PIC X(6).
010720     05  CODE-NAME               PIC X(44).
010800
010900 SD  SORT-CODES-FILE
011000     RECORD CONTAINS 60 CHARACTERS.
011100 01  SORT-RECORD.
011200     05  SORT-NUMBER             PIC X(10).
011210     05  SORT-DATE               PIC X(6).
011220     05  SORT-NAME               PIC X(44).
011300
       FD  DVENDOR-I
           LABEL RECORDS ARE STANDARD.
       01  DVENDOR-REC-I.
           COPY DDS-MCRPCS0700  OF MCFLCS0701.
011500**************************************************************
011600*           W O R K I N G         S T O R A G E              *
011700**************************************************************
011800 WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1           PIC X.
           05  FILE-STATUS-2           PIC X.
011900 01  PAGE-NUM                    PIC 9(3)   VALUE 0.
012000 01  LINE-CTR                    PIC 9(3)   VALUE 100.
       01  SAVE-DATE                   PIC X(8).
       01  SAVE-TIME                   PIC X(8).
012500
       COPY CCHKOBJ OF COPYLIB.
       COPY OVRPFDATA OF COPYLIB.
       COPY CCRTFILE  OF COPYLIB.
       COPY THDPRTA   OF COPYLIB.
013200 COPY ESCNAM2 OF COPYLIB.
016700
016800**************************************************************
016900*                 C A L L E D  R O U T I N E S               *
017000**************************************************************
017010 COPY TDATECHK OF COPYLIB.
017100 COPY TBLOWUP OF COPYLIB.
017200 01  VIEW-COMAREA.
017300     05  FILLER                  PIC X(118)  VALUE ALL "0".
017400     05  FILLER                  PIC S9(4)   COMP VALUE 9999.
017500
019700 01  KSAM-STATUS.
019800     05  K-STAT-1                PIC X.
019900     05  FILLER                  PIC X.
020200*************************************************************
020300*              P R I N T   A R E A S                        *
020400*************************************************************
020500 01  PRINT-LINE                  PIC X(80)     VALUE SPACES.
020600 01  HEAD1 REDEFINES PRINT-LINE.
020700     05  FILLER                  PIC X(25).
020800     05  HEAD1-TITLE             PIC X(29).
020900     05  FILLER                  PIC X(26).
021000 01  HEAD2 REDEFINES PRINT-LINE.
021200     05  HEAD2-DATE              PIC X(8).
021300     05  FILLER                  PIC X(2).
021400     05  HEAD2-TIME              PIC X(8).
021500     05  FILLER                  PIC X(6).
021600     05  HEAD2-TITLE             PIC X(8).
021700     05  HEAD2-OPTION1           PIC X(10).
021710     05  HEAD2-TO                PIC X(4).
021720     05  HEAD2-OPTION2           PIC X(10).
021800     05  FILLER                  PIC X(14).
021900     05  HEAD2-PAGE              PIC X(5).
022000     05  HEAD2-PAGE-NO           PIC ZZ9.
022100     05  FILLER                  PIC X(2).
022200
022300 01  HEAD3 REDEFINES PRINT-LINE.
022400     05  FILLER                  PIC X(4).
022500     05  HEAD3-VEN-CODE          PIC X(11).
022600     05  FILLER                  PIC X(4).
022700     05  HEAD3-VEN-NAME          PIC X(11).
022800     05  FILLER                  PIC X(37).
022900     05  HEAD3-VEN-DATE          PIC X(10).
023000     05  FILLER                  PIC X(3).
023200
023210 01  LINE1 REDEFINES PRINT-LINE.
023220     05  FILLER                  PIC X(4).
023230     05  LINE1-VEN-CODE          PIC X(10).
023240     05  FILLER                  PIC X(5).
023250     05  LINE1-VEN-NAME          PIC X(44).
023260     05  FILLER                  PIC X(5).
023270     05  LINE1-VEN-DATE          PIC X(8).
023280     05  FILLER                  PIC X(4).
023600
044300 COPY DATAB OF COPYLIB.
044400
045700 01  DATABASE-ARGS.
045900     03  VEN-ARG                 PIC X(10)   VALUE SPACES.
048000 COPY DVENDOR  OF COPYLIB.
       LINKAGE SECTION.
       COPY THDPRTB OF COPYLIB.
012010 01  ACCEPT-DATA.
012100     05  RPT-LOW-RANGE           PIC X(7).
012200     05  RPT-HIGH-RANGE          PIC X(7).
012300     05  SORT-OPTION             PIC X.
012400     05  FILLER                  PIC X(65).
           05  FILLER                  PIC X(81).
049000**************************************************************
049100**************************************************************
049200*        P R O C E D U R E        D I V I S I O N            *
049300*                                                            *
049400*    THE MAIN PROGRAM PASSES PARAMETERS OF VENDOR CODE      *
049500*    RANGE AND SORT OPTION.  FIND THE VENDORS IN THIS       *
049600*    RANGE, SORT THEM, AND PRINT A REPORT TO THE PRINTER    *
049700*    ASSIGNED TO THE USER AND TERMINAL THROUGH THE          *
049710*    SECURITY SYSTEM.                                       *
049800**************************************************************
049900**************************************************************
050000 PROCEDURE DIVISION USING HD-ROUTE-DATA, ACCEPT-DATA.
050100 00-MAIN.
050200     MOVE "TVNRCRPT"                    TO BU-PGM-NAME.
050300*----------  OPEN DATABASE
           OPEN INPUT DVENDOR-I.
050800
      *----- CALL CCRTFILE TO CREATE A TEMPORARY FILE FOR SORTING
      *----- LIBRARY 'QTEMP' IS USED FOR TEMPORARY FILES
           MOVE SPACES        TO CCRTFILE-PARMS.
           MOVE "QTEMP"       TO CCRTFILE-LIBRARY.
           MOVE "CODES"       TO CCRTFILE-FILE.
           MOVE "0060"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "90000"       TO CCRTFILE-NO-RECORDS.
           MOVE "02000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "10"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               MOVE "CCRTFILE CREATE OF 'SORTED' FAILED"
                  TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.
078400*----------  OPEN OUTPUT FILE
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"       TO OVRPRTF-SHARED.
028100     MOVE HD-NO-OF-COPIES TO OVRPRTF-COPIES.
           MOVE "MCPRT"      TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
051000     OPEN OUTPUT DISC-PRT, OUTPUT CODES-FILE.
027500     MOVE "DHDR70.PUB"   TO HD-FILE-NAME.
027600     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
027700        HD-ROUTE-DATA, ESC-NAME.
027800     IF HD-RET-CODE NOT = 0
027900         MOVE "THDPRT2 ERROR * VNRCRPT" TO BU-DISPLAY-MSG
028000         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
028100         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
028200         PERFORM 990-BLOWUP THRU 999-EXIT.
028300
051100     MOVE 1                        TO DATE-MODE.
051110     CALL "TDATECHK" USING DATE-CHECK-AREA.
051120     MOVE DATE-SLASH-OUT           TO SAVE-DATE.
051200     MOVE DATE-FORMATTED-TIME-OUT  TO SAVE-TIME.
053300
053310     MOVE SPACES TO CODES-RECORD.
053400     PERFORM 200-PRINT-REPORT THRU 299-EXIT.
053500
055100     CLOSE DISC-PRT.
055200     CLOSE DVENDOR-I.
055300
055900     GOBACK.
056100*************************************************************
056200*************************************************************
056300*      FIND ALL VENDOR DATA FOR THE REPORT.                 *
056500*************************************************************
056600*************************************************************
056700 200-PRINT-REPORT.
           MOVE 60 TO LINE-CTR.
061600 202-FIND-VENDOR.
064500*----------  FIND DVENDOR TO GET VENDOR NAME AND ADDRESS
           MOVE 0 TO COND-WORD.
           MOVE SPACES  TO VENCDE OF DVENDOR-REC-I.
           START DVENDOR-I KEY > VENCDE OF DVENDOR-REC-I
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
064800     IF NOT GOOD-CALL
064900         PERFORM 990-BLOWUP THRU 999-EXIT.
064910
064911     MOVE SPACES TO CODES-RECORD.
065000
065100*----------  GET VENDOR NAME AND ADDRESS
065200 205-GET-VENDOR-DATA.
           MOVE 0 TO COND-WORD.
           READ DVENDOR-I NEXT INTO BUF-DVENDOR
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

           IF NOT GOOD-CALL
              GO TO 250-SORT-BY-OPTION.
065500
060900     IF RPT-LOW-RANGE = "ALL"
061000        NEXT SENTENCE
061100     ELSE
061200     IF VEN-VEN-CODE < RPT-LOW-RANGE
061300        OR  VEN-VEN-CODE > RPT-HIGH-RANGE
061400           GO TO 205-GET-VENDOR-DATA.
061500
065600     IF COND-WORD = 0
065700         IF VEN-ITM-NO = 00
065800             MOVE VEN-ITM-DATA          TO CODE-NAME
065900             GO TO 205-GET-VENDOR-DATA
066000         ELSE
066500         IF VEN-ITM-NO = 99
066900             MOVE VEN-DATE-ADDED        TO CODE-DATE
066910             MOVE VEN-VEN-CODE          TO CODE-NUMBER
066920             WRITE CODES-RECORD
066930             MOVE SPACES                TO CODES-RECORD
067000             GO TO 205-GET-VENDOR-DATA
067100         ELSE
067200             GO TO 205-GET-VENDOR-DATA.
067700
068100 250-SORT-BY-OPTION.
068101     CLOSE CODES-FILE.
068110     IF SORT-OPTION = "C"
068120        SORT SORT-CODES-FILE ON ASCENDING KEY SORT-NUMBER
068130             USING CODES-FILE
068140             GIVING CODES-FILE
068150     ELSE
068160        SORT SORT-CODES-FILE ON ASCENDING KEY SORT-NAME
068170             USING CODES-FILE
068180             GIVING CODES-FILE.
068300     OPEN INPUT CODES-FILE.
068400
068500 255-READ-SORTED-FILE.
068600     READ CODES-FILE    AT END
068800          GO TO 299-EXIT.
068900
069000     IF LINE-CTR > 58
086100        PERFORM 810-NEW-PAGE THRU 819-EXIT
086300        MOVE 7 TO LINE-CTR.
086400     MOVE SPACES                     TO PRINT-LINE.
086500     MOVE CODE-NUMBER                TO LINE1-VEN-CODE.
086510
086520     MOVE CODE-DATE TO DATE-VALIDATE-IN.
086530     MOVE 4 TO DATE-MODE.
086540     CALL "TDATECHK" USING DATE-CHECK-AREA.
086550     MOVE DATE-SLASH-OUT           TO LINE1-VEN-DATE.
086560
086700     MOVE CODE-NAME                  TO LINE1-VEN-NAME.
086800     MOVE PRINT-LINE                 TO PRT-LINE.
086900     WRITE PRT-REC.
087000     ADD 1 TO LINE-CTR.
087100     GO TO 255-READ-SORTED-FILE.
087200
087300 299-EXIT.  EXIT.
099700*************************************************************
099800*    PAGE BREAK HAS OCCURED SO PRINT TOP OF FORM.           *
099900*************************************************************
100000 810-NEW-PAGE.
100010     MOVE SPACES                        TO PRINT-LINE.
100200     MOVE ZERO                          TO LINE-CTR.
100300     ADD  1                             TO PAGE-NUM.
100310     MOVE "VENDOR PAY FILE for RECEIVING" TO HEAD1-TITLE.
100500     MOVE PRINT-LINE                    TO PRT-LINE.
100600     WRITE PRT-REC AFTER ADVANCING NEW-PAGE.
100610     MOVE SPACES                        TO PRINT-LINE.
100710     MOVE SAVE-DATE                     TO HEAD2-DATE.
100720     MOVE SAVE-TIME                     TO HEAD2-TIME.
100730     MOVE "RANGE:  "                    TO HEAD2-TITLE.
100740     MOVE RPT-LOW-RANGE                 TO HEAD2-OPTION1.
100750     MOVE RPT-HIGH-RANGE                TO HEAD2-OPTION2.
100760     MOVE " TO "                        TO HEAD2-TO.
100770     MOVE "PAGE "                       TO HEAD2-PAGE.
100780     MOVE PAGE-NUM                      TO HEAD2-PAGE-NO.
100790     MOVE PRINT-LINE                    TO PRT-LINE.
100800     WRITE PRT-REC AFTER ADVANCING 2 LINES.
100810     MOVE SPACES                        TO PRINT-LINE.
100820
100830     MOVE "VENDOR CODE"                 TO HEAD3-VEN-CODE.
100840     MOVE "VENDOR NAME"                 TO HEAD3-VEN-NAME.
100850     MOVE "DATE ADDED"                  TO HEAD3-VEN-DATE.
100860     MOVE PRINT-LINE                    TO PRT-LINE.
100870     WRITE PRT-REC AFTER ADVANCING 3 LINES.
100880     MOVE SPACES                        TO PRINT-LINE.
100890
100891     MOVE "-----------"                 TO HEAD3-VEN-CODE.
100892     MOVE "-----------"                 TO HEAD3-VEN-NAME.
100893     MOVE "----------"                  TO HEAD3-VEN-DATE.
100894     MOVE PRINT-LINE                    TO PRT-LINE.
101210     WRITE PRT-REC AFTER ADVANCING 1 LINE.
101220     MOVE SPACES                        TO PRINT-LINE.
101230     MOVE SPACES                        TO PRT-LINE.
101240     WRITE PRT-REC AFTER ADVANCING 1 LINE.
101250 819-EXIT.  EXIT.
       COPY OVRPFCALL OF COPYLIB.
114000
001000************************************************************      XBLOWUP
002000************************************************************      XBLOWUP
003000*                    B L O W U P                           *      XBLOWUP
004000*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *      XBLOWUP
005000*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *      XBLOWUP
006000*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *      XBLOWUP
007000*                                                          *      XBLOWUP
008000*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *      XBLOWUP
009000*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *      XBLOWUP
010000*                                                          *      XBLOWUP
011000*         |||  PROGRAM IS ABORTED IN TBLOWUP  |||          *      XBLOWUP
012000************************************************************      XBLOWUP
013000************************************************************      XBLOWUP
014000 990-BLOWUP.                                                      XBLOWUP
015000     CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,         XBLOWUP
016000           VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,             XBLOWUP
017000           BU-DISPLAY-FLDS.                                       XBLOWUP
018000 999-EXIT.  EXIT.                                                 XBLOWUP
