000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.    TVWOREV.
000700*REMARKS.       THIS PROGRAM SHOWS ALL WORK ORDERS THAT  HAVE
000800*               BEEN COMPLETED IN THE LAST 24 HOURS SORTED BY
000900*               ZONE AND LOCAL NUMBER.
001000*
001100*               WHEN SUBMITTED THRU 'XRSCREEN' , THE USER CAN
001200*               RESTRICT THE REPORT TO CERTAIN ZONES. ALSO  ,
001300*               THE USER DETERMINES THE TIME FRAME.
001400*
      *C
      *C 09/16/96  JEFF BUNGO
      *C   EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C   INCLUDE CENTURY FOR START AND STOP DATES AND
      *C   FOR COMPARISONS OF COMPLETIONS DATE.  ALSO
      *C   USE JULGREG FOR GREG/JULIAN DATE CONVERSIONS.
      *C
      *C 04/02/97  JIM COFFMAN
      *C   UPDATED THE FORM FMR3OPT AND THE PROGRAM TO
      *C   ALLOW THE USER TO SORT THE REPORT OUTPUT
      *C   BY WORK ORDER NUMBER.
      *C
001500 ENVIRONMENT DIVISION.
001600 CONFIGURATION SECTION.
001700 SOURCE-COMPUTER.   AS400.
001800 OBJECT-COMPUTER.   AS400.
       COPY SPECIALN IN COPYLIB.
002100 INPUT-OUTPUT SECTION.
002200 FILE-CONTROL.
002300     SELECT IL-FILE
002400         ASSIGN TO DATABASE-MR3IL
               ORGANIZATION IS RELATIVE
002500         ACCESS MODE IS RANDOM
002600         RELATIVE KEY IS ACT-KEY
               FILE STATUS IS IL-STATUS.
003100     SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.
003200     SELECT SORT-FILE  ASSIGN TO DISK-SORTFILE.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1002
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-LAST-NUM-USED
               ASSIGN TO DATABASE-MCFPMM0800
               ORGANIZATION IS RELATIVE
               ACCESS MODE IS RANDOM
               RELATIVE KEY IS ARG-NO
               FILE STATUS IS WLNU-STATUS.
003400 DATA DIVISION.
003500 FILE SECTION.
003600 FD  IL-FILE
003700     RECORD CONTAINS 136 CHARACTERS
003800     LABEL RECORDS ARE OMITTED
003900     DATA RECORD IS ILF.
004000 01  ILF.
004100     05  ZONE-IL                   PIC X(4).
004200     05  DETAIL-IL                 PIC X(132).
004800 FD  PRINT-FILE
004900     RECORD CONTAINS 132 CHARACTERS
005000     LABEL RECORD IS OMITTED
005100     DATA RECORD IS PRT-REC.
005200 01  PRT-REC.
           05  PRT-TYPE                  PIC X(8).
           05  PRT-LINE                  PIC X(124).
005300 SD  SORT-FILE
005400     RECORD CONTAINS 118 CHARACTERS
005500     DATA RECORD IS SORT-REC.
005600 01  SORT-REC.
005700     05  DEPT-SORT                 PIC X(4).
005800     05  ZONE-SORT.
005900         10  Z-SORT                PIC X(4).
006000         10  P-SORT                PIC X.
006100         10  FILLER                PIC X.
006200     05  LOC-SORT                  PIC X(8).
006300     05  EQDOWN-SORT               PIC XX.
006400     05  WOSTAT-SORT               PIC XX.
006500     05  WONUM-SORT.
006600         10  WONO-SORT             PIC X(7).
006700         10  WOSU-SORT             PIC X(3).
006800     05  WODESC-SORT               PIC X(30).
006900     05  TRECD-SORT                PIC X(4).
007000     05  TSTRT-SORT                PIC X(4).
007100     05  TCOMP-SORT                PIC X(4).
007200     05  EQPNUM-SORT               PIC X(6).
007300     05  FCODE-SORT.
007400         10  FCODE1                PIC XX.
007500         10  FCODE2                PIC X(4).
007600     05  CRAFTSREQ-SORT.
007700         10  C1-SORT               PIC XX.
007800         10  C2-SORT               PIC XX.
007900         10  C3-SORT               PIC XX.
008000     05  DATERECD-SORT.
008100         10  YRECD-SORT            PIC XX.
008200         10  MRECD-SORT            PIC XX.
008300         10  DRECD-SORT            PIC XX.
008400     05  DATESTRT-SORT.
008500         10  YSTRT-SORT            PIC XX.
008600         10  MSTRT-SORT            PIC XX.
008700         10  DSTRT-SORT            PIC XX.
008800     05  DATECOMP-SORT.
008900         10  YCOMP-SORT            PIC XX.
009000         10  MCOMP-SORT            PIC XX.
009100         10  DCOMP-SORT            PIC XX.
009200     05  TIME-RECD-COMP-SORT       PIC X(4).
009300     05  TIME-STRT-COMP-SORT       PIC X(4).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1002.
       FD  WO-LAST-NUM-USED
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WLNUREC.
       01  WLNUREC.
           COPY DDS-ALL-FORMATS OF MCFPMM0800.
009600 WORKING-STORAGE SECTION.
009700 01  ACT-KEY                       PIC 9(9).
009800 01  ALL-RECORDS-WRITTEN-SW        PIC X.
009900 01  ARGUMENT-DEFN                 PIC XX.
010000 01  ARG-NO                        PIC 9(9).
       01  BLOWUP-BASE                   PIC X(16).
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
010400 01  COMP-DATE                     PIC X(12).
       01  COMPRESS-PRINT                PIC X(8).
010600 01  DATE-BUFF.
011100     05 YR-BUFF-9                  PIC 99.
010700     05 MTH-BUFF-9                 PIC 99.
010900     05 DAY-BUFF-9                 PIC 99.
010500 01  DAYS-LAST-YEAR                PIC S9(4).
       COPY TDATESUB OF COPYLIB.
011300 01  DBPARAMETERS.                COPY DBPARMS OF COPYLIB.
       01  DELETE-FILE                   PIC X(10) VALUE "MCFPMR3FIL".
011400 01  DETAIL-REC.
011500     05  FILLER                    PIC XX VALUE SPACES.
011600     05  EQNUM-BUF                 PIC X(6).
011700     05  FILLER                    PIC XX VALUE SPACES.
011800     05  WONUM-BUF.
011900         10  WONO-BUF              PIC X(7).
012000         10  FILLER                PIC X VALUE "-".
012100         10  WOSU-BUF              PIC X(3).
012200     05  FILLER                    PIC XX VALUE SPACES.
012300     05  WODESC-BUF                PIC X(30).
012400     05  FILLER                    PIC XX VALUE SPACES.
012500     05  CRAFTS-BUF.
012600         10  C1-BUF                PIC XX.
012700         10  FILLER                PIC X VALUE SPACES.
012800         10  C2-BUF                PIC XX.
012900         10  FILLER                PIC X VALUE SPACES.
013000         10  C3-BUF                PIC XX.
013100     05  FILLER                    PIC XX VALUE SPACES.
013200     05  PRTY-BUF                  PIC X.
013300     05  FILLER                    PIC XX VALUE SPACES.
013400     05  FAILCODE-BUF.
013500         10  FCODE-2               PIC XX.
013600         10  FILLER                PIC X VALUE "-".
013700         10  FCODE-3               PIC XXXX.
013800     05  FILLER                    PIC X VALUE SPACE.
013900     05  TRECD-BUF                 PIC X(4).
014000     05  FILLER                    PIC X VALUE SPACES.
014100     05  DRECD-BUF.
014200         10  MTH-RECD              PIC XX.
014300         10  FILLER                PIC X VALUE "/".
014400         10  DY-RECD               PIC XX.
014500     05  FILLER                    PIC X VALUE SPACES.
014600     05  TSTRT-BUF                 PIC X(4).
014700     05  FILLER                    PIC X VALUE SPACE.
014800     05  DSTRT-BUF.
014900         10  MTH-STRT              PIC XX.
015000         10  FILLER                PIC X VALUE "/".
015100         10  DY-STRT               PIC XX.
015200     05  FILLER                    PIC X VALUE SPACES.
015300     05  TCOMP-BUF                 PIC X(4).
015400     05  FILLER                    PIC X VALUE SPACES.
015500     05  DCOMP-BUF.
015600         10  MTH-COMP              PIC XX.
015700         10  FILLER                PIC X VALUE "/".
015800         10  DY-COMP               PIC XX.
015900     05  FILLER                    PIC X(3) VALUE SPACES.
016000     05  EQDOWN-BUF                PIC XX   VALUE SPACES.
016100     05  FILLER                    PIC X(5) VALUE SPACES.
016200     05  TRECD-COMP-BUF            PIC X(4) VALUE SPACES.
016300     05  FILLER                    PIC X(5) VALUE SPACES.
016400     05  TSTRT-COMP-BUF            PIC X(4) VALUE SPACES.
016500     05  FILLER                    PIC X VALUE SPACE.
       01  FILE-STATUSES.
           05  WBF-STATUS                PIC XX.
           05  WLNU-STATUS               PIC XX.
       01  ERROR-BUFFER                  PIC X(80).
       COPY ESCNAM2 IN COPYLIB.
018700 01  HEADING-1-H.
018800     05  FILLER      PIC X(10) VALUE "R3        ".
018900     05  FILLER      PIC X(43) VALUE SPACES.
019000     05  FILLER      PIC X(19) VALUE " VERBAL WORK ORDER ".
019100     05  FILLER      PIC X(6) VALUE "REVIEW".
019200     05  FILLER      PIC X(19) VALUE SPACES.
019300     05  FILLER      PIC X(5) VALUE "DATE ".
019400     05  DATE-1-H    PIC X(8).
019500     05  FILLER      PIC X(22) VALUE SPACES.
019600 01  HEADING-1A-H.
019700     05  FILLER      PIC X(115) VALUE SPACES.
019800     05  FILLER      PIC X(17) VALUE "TIME IN MINUTES  ".
019900 01  HEADING-2-H.
020000     05  FILLER      PIC X(76) VALUE SPACES.
020100     05  FILLER      PIC X(9) VALUE "RECEIVED ".
020200     05  FILLER      PIC X(22) VALUE "  STARTED    COMPLETED".
020300     05  FILLER      PIC X(6) VALUE "   EQP".
020400     05  FILLER      PIC X(9) VALUE "  RECD TO".
020500     05  FILLER      PIC X(10) VALUE "  STRT TO ".
020600 01  HEADING-3-H.
020700     05  FILLER      PIC X(20) VALUE "  EQP NUM W/O NUM   ".
020800     05  FILLER      PIC X(11) VALUE "   W/O DESC".
020900     05  FILLER      PIC X(24) VALUE SPACES.
021000     05  FILLER      PIC X(21) VALUE "CRAFT REQ PR FAIL    ".
021100     05  FILLER      PIC X(20) VALUE "TIME DATE  TIME DATE".
021200     05  FILLER      PIC X(14) VALUE "  TIME DATE   ".
021300     05  FILLER      PIC X(12) VALUE " DN     COMP".
021400     05  FILLER      PIC X(10) VALUE "     COMP ".
       01  IL-STATUS                     PIC XX.
       COPY IOFEEDBACK IN COPYLIB.
       COPY JCWAREA    IN COPYLIB.
022400 01  JUL-DAY-COMP                  PIC S9(4).
022500 01  JUL-DAY-RECD                  PIC S9(4).
022700 01  JUL-DAY-SAVE                  PIC S9(4).
022700 01  JUL-DAY-STRT                  PIC S9(4).
022800 01  LAST-WO-BUFF.                COPY MLASTWO OF COPYLIB.
022900 01  LITERAL-1-L.
023000     05  FILLER      PIC X(19) VALUE "  MAINTENANCE ZONE ".
023100     05  MZ-1-L      PIC X(4).
023200     05  FILLER      PIC X(109) VALUE SPACES.
       COPY LANGSUB OF COPYLIB.
       01  NORMAL-PRINT                  PIC X(8).
       COPY OVRPFDATA IN COPYLIB.
024700 01  S1                            PIC S9(4) COMP-4.
025800 01  SPOOLER-NUM                   PIC S99 COMP.
025900 01  S-ERR-MSG                     PIC X(75) VALUE SPACES.
       01  START-DATE-CN.
           05  STRT-CC                   PIC 99.
           05  START-DATE.
               10 STRT-YY                PIC 99.
               10 STRT-MM                PIC 99.
               10 STRT-DD                PIC 99.
               10 STRT-TIME              PIC 9999.
       01  STOP-DATE-CN.
           05  STOP-CC                   PIC 99.
           05  STOP-DATE.
               10 STOP-YY                PIC 99.
               10 STOP-MM                PIC 99.
               10 STOP-DD                PIC 99.
               10 STOP-TIME              PIC 9999.
      *---PARMS FOR JULGREG ROUTINE
       01  GREGDATE.
           05  GREGDATE-CC               PIC XX.
           05  GREGDATE-YY               PIC XX.
           05  GREGDATE-MM               PIC XX.
           05  GREGDATE-DD               PIC XX.
       01  JULDATE.
           05  JULYEAR                   PIC 9(4).
           05  JULDAY                    PIC 9(3).
       01  DAYDIGIT                      PIC X.
       01  LEAPYEAR                      PIC X.

       COPY DBSTAT OF COPYLIB.
       COPY TBLOWUP IN COPYLIB.
026100 01  TCOMP-MIN                     PIC S9(4).
026200 01  TIME-BUFF.
026300     02  TIME-HHMM                 PIC XXXX.
026400     02  FILLER                    PIC XX.
026500 01  TRECD-MIN                     PIC S9(4).
       01  TRUE-VAL                      PIC 1 VALUE B"1".
026600 01  TSAVE-MIN                     PIC S9(4).
026700 01  TSTRT-MIN                     PIC S9(4).
026800 01  TABLE-NUM                     PIC S9(4) COMP-4.
026900 01  TABLE-NUM1                    PIC S9(4) COMP-4.

022000 COPY THDPRTA IN COPYLIB.
022100
       COPY VCOMLINK OF COPYLIB.
027000 01  WO-BASIC-DATA.               COPY DWOBASIC OF COPYLIB.
027100 01  WRITE-K                       PIC 9(4) VALUE 0.
       COPY WSCONTROL IN COPYLIB.
027200 01  ZONE-TAG                      PIC X(4).
027300 01  ZONE-TABLE.
           05  ZONE-REQUESTS OCCURS 5 TIMES.
027500        10 TZONE                   PIC X(4).
027600        10 EQPNUMS.
027700           15 TEQPNUM OCCURS 5 TIMES
027800                                   PIC X(6).
027900        10 CRAFTS.
028000           15 TCRAFT  OCCURS 5 TIMES
028100                                   PIC X(2).
028200
      *LINKAGE SECTION.
       COPY THDPRTB   IN COPYLIB.
005400 01  R3-OPTIONS.
           05  R3-DATE-TIME-S.
005500         10 BEG-DATE           PIC X(6).
005600         10 BEG-TIME           PIC X(4).
           05  R3-DATE-TIME-E.
005700         10 END-DATE           PIC X(6).
005800         10 END-TIME           PIC X(4).
           05  R3-DATA-1.
005900         10 R3-OPTS OCCURS 5 TIMES.
006000            15  ZONE-R  OCCURS 1 TIMES
006100                                   PIC X(4).
006200            15  EQPNUMS OCCURS 5 TIMES.
006300                20  EQPNUM-R       PIC X(6).
006400            15  CRAFTS  OCCURS 5 TIMES.
006500                20  CRAFT-R        PIC X(2).
           05  R3-SORT-IND           PIC X.
028400*PROCEDURE DIVISION USING HD-ROUTE-DATA R3-OPTIONS.
       PROCEDURE DIVISION.
028600 BEGIN-PROC.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-LAST-NUM-USED.
030900     ACCEPT DATE-BUFF FROM DATE.
031000     ACCEPT TIME-BUFF FROM TIME.
           MOVE YR-BUFF-9 TO STOP-YY.
           MOVE MTH-BUFF-9 TO STOP-MM.
           MOVE DAY-BUFF-9 TO STOP-DD.
           IF STOP-YY > 70
               MOVE 19 TO STOP-CC
           ELSE
               MOVE 20 TO STOP-CC.
           MOVE TIME-HHMM TO STOP-TIME.
031300     MOVE MTH-BUFF-9 TO GREGDATE-MM.
031400     MOVE DAY-BUFF-9 TO GREGDATE-DD.
031500     MOVE YR-BUFF-9  TO GREGDATE-YY.
           IF GREGDATE-YY > "70"
               MOVE "19" TO GREGDATE-CC
           ELSE
               MOVE "20" TO GREGDATE-CC.
           MOVE SPACES TO JULDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
031800     SUBTRACT 1 FROM JULDAY.
031900     IF JULDAY < 1
032000         MOVE 365 TO JULDAY
032100         SUBTRACT 1 FROM JULYEAR
               CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR
               IF LEAPYEAR = "Y"
                   ADD 1 TO JULDAY
               END-IF.
           MOVE SPACES TO GREGDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
           MOVE GREGDATE TO START-DATE-CN.
033100     MOVE TIME-HHMM TO STRT-TIME.
033300     MOVE MTH-BUFF-9 TO GREGDATE-MM.
033400     MOVE DAY-BUFF-9 TO GREGDATE-DD.
033500     MOVE YR-BUFF-9  TO GREGDATE-YY.
           IF GREGDATE-YY > "70"
               MOVE "19" TO GREGDATE-CC
           ELSE
               MOVE "20" TO GREGDATE-CC.
           MOVE SPACES TO JULDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
           SUBTRACT 1 FROM JULYEAR.
           MOVE SPACES TO GREGDATE.
           CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR.
           IF LEAPYEAR = "Y"
               MOVE 366 TO DAYS-LAST-YEAR
           ELSE
               MOVE 365 TO DAYS-LAST-YEAR.
028900     MOVE SPACES TO ZONE-TABLE.
           MOVE 1 TO ARG-NO.
           MOVE 0 TO COND-WORD VIEW-LASTKEY.
           READ WO-LAST-NUM-USED INTO LAST-WO-BUFF
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WLNU-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17 MOVE 1 TO DATE-CODE.
           MOVE DATE-FLAG-SW TO DATE-CODE DATE-FLAG.

           ACCEPT HD-ROUTE-DATA.
           DISPLAY "HD-ROUTE-DATA = " HD-ROUTE-DATA.
           ACCEPT R3-OPTIONS.
           DISPLAY "R3-OPTIONS    = " R3-OPTIONS.

           MOVE 0 TO ACT-KEY.
           MOVE BEG-DATE TO DATE-VALIDATE-IN.
           MOVE 3 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-DB TO BEG-DATE.
           MOVE R3-DATE-TIME-S TO START-DATE.
           IF STRT-YY > 70
               MOVE 19 TO STRT-CC
           ELSE
               MOVE 20 TO STRT-CC.
           MOVE END-DATE TO DATE-VALIDATE-IN.
           MOVE 3 TO DATE-MODE.
           CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
           MOVE DATE-DB TO END-DATE.
           MOVE R3-DATE-TIME-E TO STOP-DATE.
           IF STOP-YY > 70
               MOVE 19 TO STOP-CC
           ELSE
               MOVE 20 TO STOP-CC.
           MOVE R3-DATA-1      TO ZONE-TABLE.
           IF R3-SORT-IND = "X"
               SORT SORT-FILE
                   ASCENDING KEY Z-SORT WONUM-SORT EQPNUM-SORT
                       INPUT PROCEDURE 8-INPUT-RECORDS
                       OUTPUT PROCEDURE 9-WRITE-RECORDS
           ELSE
029200     SORT SORT-FILE
029300         ASCENDING KEY Z-SORT EQPNUM-SORT WONUM-SORT
029400             INPUT  PROCEDURE 8-INPUT-RECORDS
029500             OUTPUT PROCEDURE 9-WRITE-RECORDS.
029700
029900 2-EOJ.
076300     MOVE SPACES TO PRT-REC.
           MOVE NORMAL-PRINT TO PRT-TYPE.
076400     WRITE PRT-REC AFTER ADVANCING 1 LINES.
077200     CLOSE IL-FILE.
077100     CLOSE PRINT-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-LAST-NUM-USED.
030500     GOBACK.
030600
039000
039200 8-INPUT-RECORDS.
039300     PERFORM 81-HOUSEKEEPING THRU 81-HOUSEKEEPING-EXIT.
039400     PERFORM 86-MAIN THRU 86-MAIN-EXIT.
039700
039900 81-HOUSEKEEPING.
042200     CALL "TDATECK2" USING DATE-CHECK-AREA LANGUAGE-PARMS.
042300     MOVE DATE-SLASH-OUT TO DATE-1-H.
042400 81-HOUSEKEEPING-EXIT.    EXIT.
042600
042800 86-MAIN.
042900     MOVE "CW" TO ARGUMENT-DEFN.
043000     PERFORM 89-START-WO-BASIC-FILE.
043300     IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
043800     PERFORM 861-DBGET THRU 861-DBGET-EXIT UNTIL COND-WORD = 15.
043900     MOVE "DW" TO ARGUMENT-DEFN.
           PERFORM 89-START-WO-BASIC-FILE.
044200     IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
044700     PERFORM 861-DBGET THRU 861-DBGET-EXIT UNTIL COND-WORD = 15.
044800     MOVE "FF" TO ARGUMENT-DEFN.
           PERFORM 89-START-WO-BASIC-FILE.
045100     IF COND-WORD = 17 GO TO 86-MAIN-EXIT.
045600     PERFORM 861-DBGET THRU 861-DBGET-EXIT UNTIL COND-WORD = 15.
045700 86-MAIN-EXIT.    EXIT.
045900
046100 861-DBGET.
           PERFORM 89-READ-WO-BASIC-FILE.
046400     IF COND-WORD = 15 GO TO 861-DBGET-EXIT.
046900     STRING DATE-COMP-CN TIME-COMP DELIMITED BY SIZE
              INTO COMP-DATE.
047100     IF (COMP-DATE > START-DATE-CN OR COMP-DATE = START-DATE-CN)
047200        AND
047300        (COMP-DATE < STOP-DATE-CN  OR COMP-DATE = STOP-DATE-CN )
047400            NEXT SENTENCE
047500     ELSE
047600     GO TO 861-DBGET-EXIT.
       861-DBGET-CK-ZONE.
047800     IF TZONE (1) = SPACES GO TO 861-DBGET-CONT.
048300     PERFORM 8610-LOCATE-ZONE VARYING TABLE-NUM FROM 1 BY 1
               UNTIL TABLE-NUM > 5 OR
048400         ZONE = TZONE (TABLE-NUM) OR TZONE (TABLE-NUM) = SPACES.
048600     IF TABLE-NUM > 5 OR TZONE (TABLE-NUM) = SPACES
048700         GO TO 861-DBGET-EXIT.
048800
       861-DBGET-CHECK-EQPNUM.
048900     IF TEQPNUM (TABLE-NUM, 1) = SPACES
049000         NEXT SENTENCE
049100     ELSE
049200     PERFORM 8610-LOCATE-EQPNUM VARYING TABLE-NUM1 FROM 1 BY 1
              UNTIL TABLE-NUM1 > 5 OR
049300              EQUIP-NUM = TEQPNUM (TABLE-NUM, TABLE-NUM1)
049500        IF TABLE-NUM1 > 5
                  GO TO 861-DBGET-EXIT.
049700
       861-DBGET-CHECK-CRAFT.
049800     IF TCRAFT (TABLE-NUM, 1) = SPACES
049900         NEXT SENTENCE
050000     ELSE
050100     PERFORM 8610-LOCATE-CRAFT  VARYING TABLE-NUM1 FROM 1 BY 1
              UNTIL TABLE-NUM1 > 5 OR
050200            CRAFTS-REQD-1 = TCRAFT (TABLE-NUM, TABLE-NUM1)
050400        IF TABLE-NUM1 > 5
050500            GO TO 861-DBGET-EXIT.
050700 861-DBGET-CONT.
050900     MOVE DEPT TO DEPT-SORT.
051000     MOVE ZONE TO Z-SORT.
051100     MOVE PRIORITY TO P-SORT.
051200     MOVE LOCATION TO LOC-SORT.
051300     MOVE WO-STATUS TO WOSTAT-SORT.
051400     MOVE WO-NUM TO WONUM-SORT.
051500     MOVE EQUIP-DOWN TO EQDOWN-SORT.
051600     MOVE DESCRIPTION-1 TO WODESC-SORT.
051700     MOVE TIME-RECD TO TRECD-SORT.
051800     MOVE TIME-STRT TO TSTRT-SORT.
051900     MOVE TIME-COMP TO TCOMP-SORT.
052000     MOVE EQUIP-NUM TO EQPNUM-SORT.
052100     MOVE FAILURE-CODE TO FCODE-SORT.
052200     MOVE CRAFTS-REQD-1 TO C1-SORT.
052300     MOVE CRAFTS-REQD-2 TO C2-SORT.
052400     MOVE CRAFTS-REQD-3 TO C3-SORT.
052500     MOVE DATE-RECD TO DATERECD-SORT.
052600     MOVE DATE-STRT TO DATESTRT-SORT.
052700     MOVE DATE-COMP TO DATECOMP-SORT.
052900     PERFORM 8611-CALC-COMP-TIMES THRU 8611-CCT-EXIT.
053100     RELEASE SORT-REC.
053000
053200 861-DBGET-EXIT.    EXIT.
053400
053600 8610-LOCATE-ZONE.
053700
053800 8610-LOCATE-EQPNUM.
053900
054000 8610-LOCATE-CRAFT.
054100
054300 8611-CALC-COMP-TIMES.
054400     IF DATE-RECD NUMERIC AND TIME-RECD NUMERIC
               MOVE DATE-RECD-CN      TO GREGDATE
               MOVE SPACES TO JULDATE
               CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR
055000         MOVE JULDAY            TO JUL-DAY-RECD.
055100
055200     IF DATE-STRT NUMERIC AND TIME-STRT NUMERIC
               MOVE DATE-STRT-CN      TO GREGDATE
               MOVE SPACES TO JULDATE
               CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR
055800         MOVE JULDAY            TO JUL-DAY-STRT.
055900
056000     IF DATE-COMP NUMERIC AND TIME-COMP NUMERIC
               MOVE DATE-COMP-CN      TO GREGDATE
               MOVE SPACES TO JULDATE
               CALL "JULGREG" USING GREGDATE JULDATE DAYDIGIT LEAPYEAR
056600         MOVE JULDAY            TO JUL-DAY-COMP.
056700
056800     IF DATE-RECD NUMERIC AND TIME-RECD NUMERIC
056900        AND
057000        DATE-COMP NUMERIC AND TIME-COMP NUMERIC
057100            NEXT SENTENCE
057200     ELSE
057300     MOVE "****" TO TIME-RECD-COMP-SORT
057400     GO TO 8611-TIME-CONT.
057500     IF JUL-DAY-RECD > JUL-DAY-COMP
057600         MOVE DAYS-LAST-YEAR TO JUL-DAY-SAVE
057700     ELSE
057800     MOVE 0 TO JUL-DAY-SAVE.
057900     IF JUL-DAY-RECD NOT = JUL-DAY-COMP
058000         ADD JUL-DAY-COMP TO JUL-DAY-SAVE
058100         SUBTRACT JUL-DAY-RECD FROM JUL-DAY-SAVE
058200         MULTIPLY 1440 BY JUL-DAY-SAVE.
058300     MULTIPLY 60 BY TIME-RECD-HH GIVING TRECD-MIN.
058400     ADD TIME-RECD-MM TO TRECD-MIN.
058500     MULTIPLY 60 BY TIME-COMP-HH GIVING TCOMP-MIN.
058600     ADD TIME-COMP-MM TO TCOMP-MIN.
058700     SUBTRACT TRECD-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
058800     ADD JUL-DAY-SAVE TO TSAVE-MIN.
058900     MOVE TSAVE-MIN TO TIME-RECD-COMP-SORT.
059000 8611-TIME-CONT.
059100     IF DATE-STRT NUMERIC AND TIME-STRT NUMERIC
059200        AND
059300        DATE-COMP NUMERIC AND TIME-COMP NUMERIC
059400            NEXT SENTENCE
059500     ELSE
059600     MOVE "****" TO TIME-STRT-COMP-SORT
059700     GO TO 8611-CCT-EXIT.
059800     IF JUL-DAY-STRT > JUL-DAY-COMP
059900         MOVE DAYS-LAST-YEAR TO JUL-DAY-SAVE
060000     ELSE
060100     MOVE 0 TO JUL-DAY-SAVE.
060200     IF JUL-DAY-STRT NOT = JUL-DAY-COMP
060300         ADD JUL-DAY-COMP TO JUL-DAY-SAVE
060400         SUBTRACT JUL-DAY-STRT FROM JUL-DAY-SAVE
060500         MULTIPLY 1440 BY JUL-DAY-SAVE.
060600     MULTIPLY 60 BY TIME-STRT-HH GIVING TSTRT-MIN.
060700     ADD TIME-STRT-MM TO TSTRT-MIN.
060800     SUBTRACT TSTRT-MIN FROM TCOMP-MIN GIVING TSAVE-MIN.
060900     ADD JUL-DAY-SAVE TO TSAVE-MIN.
061000     MOVE TSAVE-MIN TO TIME-STRT-COMP-SORT.
061100 8611-CCT-EXIT.    EXIT.
061300
       89-READ-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WOSTATUS OF WBFREC NOT = ARGUMENT-DEFN
               MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.

       89-START-WO-BASIC-FILE.
           MOVE 0 TO COND-WORD.
           MOVE ARGUMENT-DEFN TO WOSTATUS OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.

061500 9-WRITE-RECORDS.
061600     PERFORM 91-HOUSEKEEPING THRU 91-HOUSEKEEPING-EXIT.
061700     MOVE "N" TO ALL-RECORDS-WRITTEN-SW.
061800     PERFORM 96-MAIN THRU 96-MAIN-EXIT UNTIL
061900             ALL-RECORDS-WRITTEN-SW = "Y".
062200
062400 91-HOUSEKEEPING.
           DISPLAY HD-ROUTE-DATA.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
097300     MOVE "HMMISR3.PUB"   TO HD-FILE-NAME.
097400     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
097500         HD-ROUTE-DATA, ESC-NAME.
097600     IF HD-RET-CODE NOT = 0
097700         MOVE "THDPRT2 ERROR * TRPTOR" TO BU-DISPLAY-MSG
097800         MOVE "HD-RET-CODE = "        TO BU-DISPLAY-FLD (1)
097900         MOVE HD-RET-CODE             TO BU-DISPLAY-FLD9 (1)
098000         PERFORM 998-BLOWUP.
098100
098200     CALL "TESCSEQ" USING ESC-NAME.
098300     MOVE CHAR-1636PI     TO COMPRESS-PRINT.
098400     MOVE CHAR-10PI       TO NORMAL-PRINT.
098500
098600     IF NOT PAPER-IS-132-COLS
               MOVE COMPRESS-PRINT TO PRT-TYPE
098700         WRITE PRT-REC AFTER ADVANCING 0.
           CALL "CLMR3IL".
063700     OPEN OUTPUT IL-FILE.
063800     RETURN SORT-FILE
063900         AT END
064000         DISPLAY
064100         "NO VERBAL WORK ORDERS WERE COMPLETED IN LAST 24 HRS"
064200         GO TO 2-EOJ.
064300     MOVE Z-SORT TO ZONE-TAG.
064400     PERFORM 96-HEADINGS.
064500     PERFORM 96-MZ-LITERAL.
064600     MOVE 0 TO ACT-KEY.
064700 91-HOUSEKEEPING-EXIT.    EXIT.
064900
065100 96-MAIN.
065200     MOVE WONO-SORT TO WONO-BUF.
065300     MOVE WOSU-SORT TO WOSU-BUF.
065400     MOVE WODESC-SORT TO WODESC-BUF.
065500     MOVE TRECD-SORT TO TRECD-BUF.
065600     MOVE TSTRT-SORT TO TSTRT-BUF.
065700     MOVE TCOMP-SORT TO TCOMP-BUF.
065800     MOVE P-SORT TO PRTY-BUF.
065900     MOVE EQPNUM-SORT TO EQNUM-BUF.
066000     MOVE FCODE1 TO FCODE-2.
066100     MOVE FCODE2 TO FCODE-3.
066200     MOVE C1-SORT TO C1-BUF.
066300     MOVE C2-SORT TO C2-BUF.
066400     MOVE C3-SORT TO C3-BUF.
066500     IF DATE-FLAG = 3
066600         MOVE MRECD-SORT TO DY-RECD
066700         MOVE DRECD-SORT TO MTH-RECD
066800         MOVE MSTRT-SORT TO DY-STRT
066900         MOVE DSTRT-SORT TO MTH-STRT
067000         MOVE MCOMP-SORT TO DY-COMP
067100         MOVE DCOMP-SORT TO MTH-COMP
067200     ELSE
067300     MOVE MRECD-SORT TO MTH-RECD
067400     MOVE DRECD-SORT TO DY-RECD
067500     MOVE MSTRT-SORT TO MTH-STRT
067600     MOVE DSTRT-SORT TO DY-STRT
067700     MOVE MCOMP-SORT TO MTH-COMP
067800     MOVE DCOMP-SORT TO DY-COMP.
067900     MOVE TIME-RECD-COMP-SORT TO TRECD-COMP-BUF.
068000     MOVE TIME-STRT-COMP-SORT TO TSTRT-COMP-BUF.
068100     MOVE EQDOWN-SORT TO EQDOWN-BUF.
068200     MOVE DETAIL-REC TO PRT-LINE.
068300     WRITE PRT-REC AFTER ADVANCING 1 LINES.
068400     IF C1-BUF = "IL" OR C2-BUF = "IL" OR C3-BUF = "IL"
068500         MOVE Z-SORT TO ZONE-IL
068600         MOVE DETAIL-REC TO DETAIL-IL
068700         ADD 1 TO ACT-KEY
068800         WRITE ILF
068900            INVALID KEY
069000            DISPLAY "UNABLE TO WRITE IL FILE " ACT-KEY
069100          GO TO 2-EOJ.
069200     ADD 1 TO WRITE-K.
069300     IF WRITE-K > 60
069400         PERFORM 96-HEADINGS
069500         MOVE SPACES TO PRT-LINE
069600         WRITE PRT-REC AFTER ADVANCING 1 LINES.
069700     RETURN SORT-FILE
069800       AT END
069900         MOVE SPACES TO ZONE-TAG
070000         MOVE 0 TO ACT-KEY
               CLOSE IL-FILE
               OPEN INPUT IL-FILE
070100         PERFORM 961-WRITE-IL-DATA THRU 961-WRITE-ID-EXIT
070200         MOVE "Y" TO ALL-RECORDS-WRITTEN-SW
070300         GO TO 96-MAIN-EXIT.
070400     IF Z-SORT NOT = ZONE-TAG
070500         PERFORM 96-HEADINGS
070600         MOVE Z-SORT TO ZONE-TAG
070700         PERFORM 96-MZ-LITERAL.
070800 96-MAIN-EXIT.    EXIT.
071000
073300 96-HEADINGS.
073400     MOVE ZERO TO WRITE-K.
073500     MOVE HEADING-1-H TO PRT-LINE.
073600     WRITE PRT-REC AFTER ADVANCING NEW-PAGE.
073700     MOVE SPACES TO PRT-LINE.
073800     STRING "START DATE " START-DATE " STOP DATE " STOP-DATE
073900      DELIMITED BY SIZE INTO PRT-LINE.
074000     WRITE PRT-REC AFTER ADVANCING 1 LINES.
           MOVE HEADING-1A-H TO PRT-LINE.
074100     WRITE PRT-REC AFTER ADVANCING 3 LINES.
074200     MOVE HEADING-2-H TO PRT-LINE.
074300     WRITE PRT-REC AFTER ADVANCING 1 LINES.
074400     MOVE HEADING-3-H TO PRT-LINE.
074500     WRITE PRT-REC AFTER ADVANCING 1 LINES.
074600     ADD 6 TO WRITE-K.
074700
074800 96-MZ-LITERAL.
074900     MOVE ZONE-TAG TO MZ-1-L.
075000     MOVE LITERAL-1-L TO PRT-LINE.
075100     WRITE PRT-REC AFTER ADVANCING 3 LINES.
075200     MOVE SPACES TO PRT-LINE.
075300     WRITE PRT-REC AFTER ADVANCING 1 LINES.
075400     ADD 4 TO WRITE-K.

071200 961-WRITE-IL-DATA.
071300     ADD 1 TO ACT-KEY.
071400     READ IL-FILE    INVALID KEY
071600         GO TO 961-WRITE-ID-EXIT.
071700     IF ZONE-IL NOT = ZONE-TAG
071800         PERFORM 96-HEADINGS
071900         MOVE ZONE-IL TO ZONE-TAG
072000         PERFORM 96-MZ-LITERAL.
072100     MOVE DETAIL-IL TO PRT-LINE.
072200     WRITE PRT-REC AFTER ADVANCING 1 LINES.
072300     ADD 1 TO WRITE-K.
072400     IF WRITE-K > 60
072500         PERFORM 96-HEADINGS
072600         MOVE SPACES TO PRT-LINE
072700         WRITE PRT-REC AFTER ADVANCING 1 LINES.
072800     GO TO 961-WRITE-IL-DATA.
072900 961-WRITE-ID-EXIT.    EXIT.
073100
       COPY OVRPFCALL IN COPYLIB.

177600 998-BLOWUP.
177700     MOVE "TVWOREV" TO BU-PGM-NAME.
177800     CALL "TBLOWUP" USING BLOWUP-BASE BU-PGM-NAME STATUS-AREA
177900                      VIEW-COMAREA DUMMY-KSAM-STAT
178000                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

050000 999-CATREAD.
050100     MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
051000 999-CATREAD-EXIT.    EXIT.
