       IDENTIFICATION DIVISION.
       PROGRAM-ID.  TWESCOFI.
       DATE-COMPILED.
      ************************************************************
      ** THIS PROGRAM CREATES AN AS400 FILE FOR WESCO THAT      **
      ** CONTAINS CSIS INFORMATION. IT WILL BE UPLOADED TO      **
      ** A FLOPPY DISK AND GIVEN TO THEM TO CREATE A FILE       **
      ** TO BE USED FOR PARTS CONSOLIDATION.                    **
      ************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN OF COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DMANPART
               ASSIGN TO DATABASE-MCFLCS3603
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT DPORECD
               ASSIGN TO DATABASE-MCFLCS0901
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MPLTINFO
               ASSIGN TO DATABASE-MCFLCS0501
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM
               ASSIGN TO DATABASE-MCFLCS0201
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT MSTORERM-DATA
               ASSIGN TO DATABASE-MCFPWESCOF
               ORGANIZATION IS SEQUENTIAL
               ACCESS MODE IS SEQUENTIAL
               FILE STATUS IS FILE-STATUS.

           SELECT PRINT-FILE ASSIGN TO PRINTER-MCPRT.

           SELECT USAGEFIL
               ASSIGN TO DATABASE-MCFLCSUSAG
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD  DMANPART
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DMANPART-REC.
       01  DMANPART-REC.
           COPY DDS-MCRPCS3600  OF MCFLCS3603.

       FD  DPORECD
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS DPORECD-REC.
       01  DPORECD-REC.
           COPY DDS-MCRPCS0900  OF MCFLCS0901.

       FD  MPLTINFO
           LABEL RECORDS ARE STANDARD.
       01  MPLTINFO-REC.
           COPY DDS-MCRPCS0500  OF MCFLCS0501.

       FD  MSTORERM
           LABEL RECORDS ARE STANDARD.
       01  MSTORERM-REC.
           COPY DDS-MCRPCS0200  OF MCFLCS0201.

       FD  MSTORERM-DATA
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS MSTORERM-DATA-REC.
       01  MSTORERM-DATA-REC.
           05  MDR-PLANT-CODE            PIC X(3).
           05  MDR-CORP-CODE             PIC X(8).
           05  MDR-USAGE-LAST-12MOS      PIC 9(12).
           05  MDR-YEAR-TO-DATE          PIC 9(12).
           05  MDR-ONHAND-QTY            PIC 9(8).
           05  MDR-AVG-COST              PIC 9(12)V9999.
           05  MDR-MKT-COST              PIC 9(12)V9999.
           05  MDR-DESC OCCURS 5 TIMES.
               10  MDR-DES               PIC X(80).
           05  MDR-LAST-PURCH            PIC X(6).
           05  MDR-LAST-PO               PIC X(10).
           05  MDR-BIN-LOC               PIC X(12).
           05  MDR-UNIT-OF-MEAS          PIC XX.
           05  MDR-MINIMUM               PIC 9(8).
           05  MDR-MAXIMUM               PIC 9(8).
           05  MDR-EXPEDITE              PIC 9(8).
           05  MDR-DFLT-DEPT             PIC X(6).
           05  MDR-PART-NAME             PIC X(26).
           05  MDR-PART-NUMBER           PIC X(20).
           05  FILLER                    PIC X(19).

       FD  PRINT-FILE
           LABEL RECORDS ARE OMITTED
           RECORD CONTAINS 132 CHARACTERS
           DATA RECORD IS PRINT-REC.
       01  PRINT-REC                     PIC X(132).

       FD  USAGEFIL
           LABEL RECORDS ARE STANDARD.
       01  USAGEFIL-REC.
           COPY DDS-MCRPCSUSAG  OF MCFLCSUSAG.

       WORKING-STORAGE SECTION.
       77  LINE-CTR                      PIC 99.
       77  RET-RECS-CTR                  PIC 9(5).
       77  SAVE-PLANT-CODE               PIC X(3).
       77  TOT-RECS-CTR                  PIC 9(5).
       01  HANDLE-BLOWUP-FLAG            PIC X(1)  VALUE "Y".

062200 01  BUF-USAGEFIL.
           05  FILLER                    PIC XX.
           05  K-CORP-CODE               PIC X(8).
062500     05  K-MONTHS                 OCCURS 14 TIMES.
               10  K-MTH-USAGE           PIC S9(9) COMP-4.
062700
       01  CODE-ARG                      PIC X(8).

       01  PO-ARG.
           05  FILLER                    PIC X     VALUE "P".
           05  MSTORERM-PO               PIC X(10).
           05  FILLER                    PIC XXX   VALUE "000".

       COPY VCOMAREA IN COPYLIB.
      *****************************************************************
      **                                                             **
      **  S U B P R O G R A M   A R E A                              **
      **                                                             **
      *****************************************************************
       COPY CCRTFILE IN COPYLIB.

       COPY CDESC    IN COPYLIB.

       COPY TBLOWUP  IN COPYLIB.

       COPY TDATECHK IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   W O R K                                  **
      **                                                             **
      *****************************************************************
       01  BASE                          PIC X(10)  VALUE "  STORES;".
       COPY FILESTAT   IN COPYLIB.
       COPY DBSTAT     IN COPYLIB.
       COPY OVRPFDATA  IN COPYLIB.

      *****************************************************************
      **                                                             **
      **  D A T A B A S E   B U F F E R S                            **
      **                                                             **
      *****************************************************************
       COPY DMANPART   IN COPYLIB.

       COPY DPORECD    IN COPYLIB.

       COPY MPLTINFO   IN COPYLIB.

       COPY MSTORERM   IN COPYLIB.

       PROCEDURE DIVISION.
       START-PGM.
           OPEN INPUT  DMANPART.
           OPEN INPUT  DPORECD.
           OPEN INPUT  MPLTINFO.
           OPEN INPUT  MSTORERM.
      *------ CALL CCRTFILE TO CREATE 'MCFPWESCOF'
           MOVE "*CURLIB"     TO CCRTFILE-LIBRARY.
           MOVE "MCFPWESCOF"  TO CCRTFILE-FILE.
           MOVE "0600"        TO CCRTFILE-RECORD-LENGTH.
           MOVE "10000"       TO CCRTFILE-NO-RECORDS.
           MOVE "01000"       TO CCRTFILE-INCREMENT-AMT.
           MOVE "03"          TO CCRTFILE-NO-INCREMENTS.
           CALL "CCRTFILE" USING CCRTFILE-LIBRARY,
                                 CCRTFILE-FILE,
                                 CCRTFILE-RECORD-LENGTH,
                                 CCRTFILE-NO-RECORDS,
                                 CCRTFILE-INCREMENT-AMT,
                                 CCRTFILE-NO-INCREMENTS,
                                 CCRTFILE-STATUS.
           IF CCRTFILE-STATUS NOT = "00"
               DISPLAY "CCRTFILE CREATE OF 'MCFPWESCOF' FAILED"
               GOBACK.
           OPEN OUTPUT MSTORERM-DATA.
           OPEN INPUT  USAGEFIL.
           MOVE "MCPRT" TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
           OPEN OUTPUT PRINT-FILE.
           MOVE 61 TO LINE-CTR.
           MOVE 0 TO RET-RECS-CTR, TOT-RECS-CTR.
           MOVE "P 01" TO PLTINFOKEY OF MPLTINFO-REC.
           READ MPLTINFO INTO BUF-MPLTINFO
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "111" TO SAVE-PLANT-CODE
           ELSE
           MOVE MPLTINFO-COMPANY TO SAVE-PLANT-CODE.
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           CLOSE DMANPART.
           CLOSE DPORECD.
           CLOSE MPLTINFO.
           CLOSE MSTORERM.
           CLOSE MSTORERM-DATA.
           CLOSE PRINT-FILE.
           CLOSE USAGEFIL.
           GOBACK.

       2100-BLOWUP.
076300     MOVE "TWESCOFI" TO BU-PGM-NAME.
076400     CALL "TBLOWUP" USING BASE BU-PGM-NAME STATUS-AREA
076500                      VIEW-COMAREA DUMMY-KSAM-STAT
076600                      BU-DISPLAY-MSG BU-DISPLAY-FLDS.

       6000-MAIN.
           PERFORM 9999-GETSER-MSTORERM.
           IF END-OF-FILE
               DISPLAY "TOTAL RECORDS ON FILE = " TOT-RECS-CTR
               GO TO 6990-MAIN-X.
           ADD 1 TO TOT-RECS-CTR.
           IF SAVE-PLANT-CODE = "211" OR "281" OR "285"
               IF ST-CLASS = "116" OR "285" OR "400" OR "520" OR "521"
                   NEXT SENTENCE
               ELSE
               GO TO 6000-MAIN
           ELSE
           IF ST-CLASS = "316" OR "336" OR "357"
               NEXT SENTENCE
           ELSE
           GO TO 6000-MAIN.
           MOVE SAVE-PLANT-CODE TO  MDR-PLANT-CODE.
           MOVE CORP-CODE       TO  MDR-CORP-CODE,
                                    CODE-ARG.
           MOVE STR-ONHAND      TO  MDR-ONHAND-QTY.
           MOVE STR-AVG-COST    TO  MDR-AVG-COST.
           MOVE STR-LAST-PO-RLSE TO MSTORERM-PO.
           MOVE STR-LOC (1)     TO  MDR-BIN-LOC.
           MOVE STR-UM          TO  MDR-UNIT-OF-MEAS.
           MOVE STR-REORDER     TO  MDR-MINIMUM.
           MOVE STR-MAX         TO  MDR-MAXIMUM.
           MOVE STR-EXPEDITE    TO  MDR-EXPEDITE.
           MOVE STR-DFLT-DEPT   TO  MDR-DFLT-DEPT.
           MOVE STR-MKT-COST    TO  MDR-MKT-COST.
           MOVE PO-ARG          TO  PORCVNO OF DPORECD-REC.
           READ DPORECD INTO BUF-DPORECD
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           MOVE PO-DATE         TO  MDR-LAST-PURCH.
           MOVE STR-LAST-PO-RLSE TO MDR-LAST-PO.
           MOVE "F"             TO  CDESC-DESC-OPTION.
           MOVE 5               TO  CDESC-LINES-TO-GET.
           MOVE "N"             TO  CDESC-LOCAL-DESC-OPTION.
126000     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
126100       BU-DISPLAY-MSG, CODE-ARG, CDESC-DATA.
126200     IF BU-DISPLAY-MSG-1 NOT = SPACES
126300         PERFORM 2100-BLOWUP.
           MOVE CDESC (1)       TO  MDR-DES (1).
           MOVE CDESC (2)       TO  MDR-DES (2).
           MOVE CDESC (3)       TO  MDR-DES (3).
           MOVE CDESC (4)       TO  MDR-DES (4).
           MOVE CDESC (5)       TO  MDR-DES (5).
           MOVE CODE-ARG TO CORPCDE OF USAGEFIL-REC.
           READ USAGEFIL INTO BUF-USAGEFIL
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
               COMPUTE MDR-YEAR-TO-DATE = K-MTH-USAGE (1) +
                   K-MTH-USAGE (2) + K-MTH-USAGE (3) +
                   K-MTH-USAGE (4) + K-MTH-USAGE (5) +
                   K-MTH-USAGE (6) + K-MTH-USAGE (7)
               COMPUTE MDR-USAGE-LAST-12MOS = K-MTH-USAGE (1) +
                   K-MTH-USAGE (2) + K-MTH-USAGE (3) + K-MTH-USAGE (4)
                   + K-MTH-USAGE (5) + K-MTH-USAGE (6) +
                   K-MTH-USAGE (7) + K-MTH-USAGE (8) +
                   K-MTH-USAGE (9) + K-MTH-USAGE (10) +
                   K-MTH-USAGE (11) + K-MTH-USAGE (12).
           MOVE CODE-ARG        TO  CORPCDE OF DMANPART-REC.
           READ DMANPART INTO BUF-DMANPART
               INVALID KEY    MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE SPACES      TO  MDR-PART-NUMBER
           ELSE
           MOVE MAN-NAME        TO  MDR-PART-NAME.
           MOVE MAN-PARTNO      TO  MDR-PART-NUMBER.
           WRITE MSTORERM-DATA-REC.
           ADD 1 TO LINE-CTR.
           IF LINE-CTR > 60
               PERFORM 6999-HEADER.
           MOVE SPACES TO PRINT-REC.
           STRING "CORPORATE CODE ", CORP-CODE
               " HAS BEEN WRITTEN TO FILE"
               DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           GO TO 6000-MAIN.

       6990-MAIN-X.
           EXIT.

       6999-HEADER.
           MOVE SPACES TO  PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING NEW-PAGE.
           STRING "CORPORATE CODES WITH AUTHORIZATION FLAG SET "
             DELIMITED BY SIZE INTO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1.
           MOVE ALL "-" TO PRINT-REC.
           WRITE PRINT-REC AFTER ADVANCING 1 LINES.
           MOVE 4 TO LINE-CTR.

       COPY OVRPFCALL IN COPYLIB.

       9999-GETSER-MSTORERM.
           MOVE 0 TO COND-WORD.
           READ MSTORERM NEXT INTO BUF-MSTORERM
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS-1 = "1"
               MOVE 11 TO COND-WORD
           ELSE
           IF FILE-STATUS NOT = "00"
               MOVE 99 TO COND-WORD
               IF HANDLE-BLOWUP-FLAG = "Y"
                   MOVE "GETSER ERR 9999-GETSER-MSTORERM"
                       TO BU-MSG-AREA
                   PERFORM 2100-BLOWUP.

