000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.      TWOBYEQP.
      *C
      *C  09/10/1996    CA YODER
      *C    RE-COMPILED PROGRAM TO PICK UP CENTURY DATABASE CHANGES.
      *C
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SOURCE-COMPUTER.   AS400.
000700 OBJECT-COMPUTER.   AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DISPLAY-FILE
               ASSIGN TO WORKSTATION-ZINQUIRY-SI
               ORGANIZATION IS TRANSACTION
               FILE STATUS IS DSPLY-STATUS
               CONTROL-AREA IS WS-CONTROL.
           SELECT WO-BASIC-FILE
               ASSIGN TO DATABASE-MCFLMM1003
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WBF-STATUS.
           SELECT WO-PLANNED-FILE
               ASSIGN TO DATABASE-MCFLMM1103
               ORGANIZATION IS INDEXED
               ACCESS IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY WITH DUPLICATES
               FILE STATUS IS WPF-STATUS.
001000 DATA DIVISION.
       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DSPLY-REC                   PIC X(2000).
       FD  WO-BASIC-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WBFREC.
       01  WBFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1003.
       FD  WO-PLANNED-FILE
           LABEL RECORDS ARE STANDARD
           DATA RECORD IS WPFREC.
       01  WPFREC.
           COPY DDS-ALL-FORMATS OF MCFLMM1103.
001100 WORKING-STORAGE SECTION.
001200 77  LINE-CTR                  PIC 99 VALUE 0.
       COPY CATREAD IN COPYLIB.
       COPY CPYIND  IN COPYLIB.
003100 01  DETAIL-LINE.
003200     05  DETAIL-EQP-BUFF  PIC X(6).
003300     05  DL OCCURS 18 TIMES.
003400         10  FILLER  PIC XXX.
003500         10  WO-DET  PIC X(10).
003600         10  FILLER  PIC XX.
003700         10  EQ-DET  PIC X(6).
003800         10  FILLER  PIC XXXX.
003900         10  ST-DET  PIC XX.
004000         10  FILLER  PIC X(5).
004100         10  DR-DET  PIC X(6).
004200         10  FILLER  PIC X(5).
004300         10  DS-DET  PIC X(6).
004400         10  FILLER  PIC X(5).
004500         10  DC-DET  PIC X(6).
           05  DETAIL-MSG-LINE       PIC X(79).
           05  DETAIL-CMD-LINE       PIC X(79).
           05  DETAIL-ERR-LINE       PIC X(79).
005100 01  EQP-BUFF.
005200     05  EQP-NUMBER.
005400         10  EQP1              PIC X.
005500         10  EQP2              PIC X.
005600         10  EQP3              PIC X.
005700         10  EQP4              PIC X.
005800         10  EQP5              PIC X.
005900         10  EQP6              PIC X.
           05  EQP-CMD-LINE          PIC X(79).
           05  EQP-MSG-LINE          PIC X(79).
006700 01  EQUIP-NUM-CHECK.
006800     05  EQ1                   PIC X.
006900     05  EQ2                   PIC X.
007000     05  EQ3                   PIC X.
007100     05  EQ4                   PIC X.
007200     05  EQ5                   PIC X.
007300     05  EQ6                   PIC X.
008400 01  ERROR-BUFFER              PIC X(80).
       01  FILE-STATUSES.
           05  DSPLY-STATUS          PIC XX.
           05  WBF-STATUS            PIC XX.
           05  WPF-STATUS            PIC XX.
       COPY DBSTAT OF COPYLIB.
       COPY VCOMAREA OF COPYLIB.
010000 01  WO-BASIC-DATA.      COPY DWOBASIC OF COPYLIB.
010100 01  WO-PLANNED-DATA.    COPY DWOPLAN OF COPYLIB.
       COPY WSCONTROL IN COPYLIB.
010200 PROCEDURE DIVISION.
010300 START-PROCESSING.
010400     PERFORM 1-HSK.
010500     PERFORM 6-MAIN.
010600 2-EOJ.
           CLOSE DISPLAY-FILE.
           CLOSE WO-BASIC-FILE.
           CLOSE WO-PLANNED-FILE.
011000     GOBACK.
011100 1-HSK.
           OPEN I-O    DISPLAY-FILE.
           OPEN INPUT  WO-BASIC-FILE.
           OPEN INPUT  WO-PLANNED-FILE.
011200     MOVE LOW-VALUES TO STATUS-AREA.
016400     MOVE "FQ14INQ" TO VIEW-CFNAME.
016900 6-MAIN.
017000     PERFORM 60-PROCESS-REQUEST THRU 60-PR-EXIT.
017100     PERFORM 61-READ-WO-BASIC THRU 61-RWB-EXIT.
017300     PERFORM 62-READ-WO-PLANNED THRU 62-RWP-EXIT.
017400 60-PROCESS-REQUEST.
018200     MOVE SPACES TO EQP-BUFF.
           MOVE EQP-BUFF TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
           MOVE DSPLY-REC TO EQP-BUFF.
           IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
020900     MOVE "FQ14INQ2" TO VIEW-CFNAME.
022100 60-PR-EXIT.     EXIT.
022200 61-READ-WO-BASIC.
           MOVE 0 TO COND-WORD.
           MOVE EQP-NUMBER TO EQPNUM OF WBFREC.
           START WO-BASIC-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
022500     IF COND-WORD = 17 GO TO 61-RWB-EXIT.
       61-RWB-LOOP.
           READ WO-BASIC-FILE NEXT INTO WO-BASIC-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WBF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF EQP-NUMBER NOT = EQPNUM OF WBFREC MOVE 15 TO COND-WORD.
           IF COND-WORD = 15 GO TO 61-RWB-EXIT.
023200     MOVE EQUIP-NUM TO EQUIP-NUM-CHECK.
023600     IF EQUIP-NUM = EQP-NUMBER
023700         NEXT SENTENCE
023800     ELSE
023900     IF EQP1 = EQ1 OR SPACE
024000       IF EQP2 = EQ2 OR SPACE
024100         IF EQP3 = EQ3 OR SPACE
024200           IF EQP4 = EQ4 OR SPACE
024300             IF EQP5 = EQ5 OR SPACE
024400               IF EQP6 = EQ6 OR SPACE
024500                   NEXT SENTENCE
024600               ELSE
024700               GO TO 61-RWB-LOOP
024800             ELSE
024900             GO TO 61-RWB-LOOP
025000           ELSE
025100           GO TO 61-RWB-LOOP
025200         ELSE
025300         GO TO 61-RWB-LOOP
025400       ELSE
025500       GO TO 61-RWB-LOOP
025600     ELSE
025700     GO TO 61-RWB-LOOP.
025800     ADD 1 TO LINE-CTR.
025900     MOVE WO-NUM TO WO-DET (LINE-CTR).
026000     MOVE EQUIP-NUM TO EQ-DET (LINE-CTR).
026100     MOVE WO-STATUS TO ST-DET (LINE-CTR).
026200     MOVE DATE-RECD TO DR-DET (LINE-CTR).
026300     MOVE DATE-STRT TO DS-DET (LINE-CTR).
026400     MOVE DATE-COMP TO DC-DET (LINE-CTR).
026500     IF LINE-CTR > 17
026600         MOVE 0 TO LINE-CTR
026700     ELSE
026800     GO TO 61-RWB-LOOP.
           MOVE EQP-NUMBER TO DETAIL-EQP-BUFF.
           MOVE 66125 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO DETAIL-MSG-LINE.
           MOVE DETAIL-LINE TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
031000     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE SPACES TO DETAIL-LINE.
           GO TO 61-RWB-LOOP.
034000 61-RWB-EXIT.    EXIT.
034100 62-READ-WO-PLANNED.
           MOVE 0 TO COND-WORD.
           MOVE EQP-NUMBER TO EQPNUM OF WPFREC.
           START WO-PLANNED-FILE KEY IS = EXTERNALLY-DESCRIBED-KEY
               INVALID KEY    MOVE 17 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 17 TO COND-WORD.
           IF COND-WORD = 17
               MOVE EQP-NUMBER TO DETAIL-EQP-BUFF
               MOVE 66122 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO DETAIL-MSG-LINE
               MOVE DETAIL-LINE TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               GO TO 62-RWP-EXIT.
       62-RWP-LOOP.
           READ WO-PLANNED-FILE NEXT INTO WO-PLANNED-DATA
               AT END    MOVE 15 TO COND-WORD.
           IF WPF-STATUS NOT = "00" MOVE 15 TO COND-WORD.
           IF EQUIP-NUM-P NOT = EQP-NUMBER MOVE 15 TO COND-WORD.
           IF COND-WORD = 15
               MOVE EQP-NUMBER TO DETAIL-EQP-BUFF
               MOVE 66122 TO CATREAD-MSG-NUMBER
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE ERROR-BUFFER TO DETAIL-MSG-LINE
               MOVE DETAIL-LINE TO DSPLY-REC
               PERFORM 99-SCREEN-WRITE
               PERFORM 98-SCREEN-READ
               GO TO 62-RWP-EXIT.
039900     MOVE EQUIP-NUM-P TO EQUIP-NUM-CHECK.
040300     IF EQUIP-NUM-P = EQP-NUMBER
040400         NEXT SENTENCE
040500     ELSE
040600     IF EQP1 = EQ1 OR SPACE
040700       IF EQP2 = EQ2 OR SPACE
040800         IF EQP3 = EQ3 OR SPACE
040900           IF EQP4 = EQ4 OR SPACE
041000             IF EQP5 = EQ5 OR SPACE
041100               IF EQP6 = EQ6 OR SPACE
041200                   NEXT SENTENCE
041300               ELSE
041400               GO TO 62-RWP-LOOP
041500             ELSE
041600             GO TO 62-RWP-LOOP
041700           ELSE
041800           GO TO 62-RWP-LOOP
041900         ELSE
042000         GO TO 62-RWP-LOOP
042100       ELSE
042200       GO TO 62-RWP-LOOP
042300     ELSE
042400     GO TO 62-RWP-LOOP.
042500     ADD 1 TO LINE-CTR.
042600     MOVE WO-NUM-PLANNED TO WO-DET (LINE-CTR).
042700     MOVE EQUIP-NUM-P TO EQ-DET (LINE-CTR).
042800     MOVE WO-STATUS-P TO ST-DET (LINE-CTR).
042900     MOVE DATE-RECD-P TO DR-DET (LINE-CTR).
043000     MOVE DATE-STRT-P TO DS-DET (LINE-CTR).
043100     MOVE DATE-COMP-P TO DC-DET (LINE-CTR).
043200     IF LINE-CTR > 17
043300         MOVE 0 TO LINE-CTR
043400     ELSE
043500     GO TO 62-RWP-LOOP.
           MOVE EQP-NUMBER TO DETAIL-EQP-BUFF.
           MOVE 66125 TO CATREAD-MSG-NUMBER.
           PERFORM 999-CATREAD THRU 999-CATREAD-EXIT.
           MOVE ERROR-BUFFER TO DETAIL-MSG-LINE.
           MOVE DETAIL-LINE TO DSPLY-REC.
           PERFORM 99-SCREEN-WRITE.
           PERFORM 98-SCREEN-READ.
047000     IF VIEW-LASTKEY = 3 GO TO 2-EOJ.
           MOVE SPACES TO DETAIL-LINE.
           GO TO 62-RWP-LOOP.
050000 62-RWP-EXIT.    EXIT.

       98-SCREEN-READ.
           READ DISPLAY-FILE INDIC IS INDICS
               MOVE FUNCTION-NUM TO VIEW-LASTKEY
               MOVE ALL B"0" TO INDICS.
       99-SCREEN-WRITE.
           WRITE DSPLY-REC FORMAT IS VIEW-CFNAME
               INDIC IS INDICS.

       999-CATREAD.
           MOVE SPACES TO ERROR-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO ERROR-BUFFER.
       999-CATREAD-EXIT.    EXIT.

