000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID.          TWSOUTP.
000400 AUTHOR.              C HILLES.
000500 DATE-WRITTEN.        MARCH, 1985.
000600 DATE-COMPILED.
000700*INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
000800*SECURITY.
000900*REMARKS.
001000*    THIS PROGRAM PRINTS A REPORT OF ANY WORKSHEETS THAT HAVE
001100*    NOT YET BEEN PROCESSED.  THE PURPOSE IS TO LET THE
001200*    STOREROOM SUPERVISOR OR OTHER PERSONNEL MAKE SURE THAT
001300*    NON OF THE STOREKEEPERS HAS FORGOTTEN TO PROCESS A
001400*    WORKSHEET.  THE PROGRAM CAN ALSO BE RUN BY THE STOREKEEPER
001500*    HIMSELF - IT WILL PRINT ON ANY PRINTER ON THE SYSTEM.
001600*    THIS PROGRAM MAKES USE OF THE REPORT OPTION SCREEN PROGRAM
001700*    "XRSCREEN" TO INPUT THE ROUTING DATA FROM THE USER.
001800*    CIH.
001900*
002000*    06/17/86.
002100*      REPLACED CALL TO "TFDESC" WITH CALL TO "CDESC".  "CDESC"
002200*      HAS MORE OPTIONS, AND HANDLES THE DATA SETS "DMANPART" - USING
002300*      THE MANUFACTURER ENTRIES AS PART OF DESCRIPTION. CIH.
      *C
      *C  06/06/96     JEFF BUNGO
      *C     EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
002400*
002500 ENVIRONMENT DIVISION.
002600 CONFIGURATION SECTION.
002700 SOURCE-COMPUTER.  HP-3000.
002800 OBJECT-COMPUTER.  HP-3000.
002900 SPECIAL-NAMES. C01 IS NEW-PAGE.
003100
003200 INPUT-OUTPUT SECTION.
003300 FILE-CONTROL.
003400     SELECT RPT-FILE ASSIGN TO PRINTER-MCPRT.
           SELECT DWLITEM-I
                  ASSIGN TO DATABASE-MCFLCS1501
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MWRKLIST-I
                  ASSIGN TO DATABASE-MCFLCS0301
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

003500
003600 DATA DIVISION.
003700 FILE SECTION.
003800
003900 FD  RPT-FILE
004000     RECORD CONTAINS 132 CHARACTERS.
004100 01  RPT-REC.
004300     05  RPT-REC-DATA              PIC X(132).
004400
       FD  DWLITEM-I
           LABEL RECORDS ARE STANDARD.
       01  DWLITEM-REC-I.
           COPY DDS-MCRPCS1500  OF MCFLCS1501.

       FD  MWRKLIST-I
           LABEL RECORDS ARE STANDARD.
       01  MWRKLIST-REC-I.
           COPY DDS-MCRPCS0300  OF MCFLCS0301.

004500 WORKING-STORAGE SECTION.
004600
004700 77  LINE-K                        PIC S9(4) COMP-4 VALUE 0.
004800 77  PAGE-K                        PIC S9(4) COMP-4 VALUE 0.
004900 77  SUB                           PIC S9(4) COMP-4 VALUE 0.
005000 77  TOTAL-QTY                     PIC S9(8) VALUE 0.

       01  WS-WRKLIST-KEY.
           05  WL-LIT                    PIC X(2).
           05  WL-KEY-NO                 PIC X(4).
005200
005300*************************************************************
005400**                                                          **
005500**          C O M M U N I C A T I O N S   A R E A S         **
005600**                                                          **
005700**************************************************************
005800
005900 COPY TBLOWUP IN COPYLIB.
006000 COPY VIEWDUM IN COPYLIB.
006100 COPY CDESC IN COPYLIB.
006200 COPY TDATECHK IN COPYLIB.
       COPY OVRPFDATA IN COPYLIB.
       COPY CCHKOBJ IN COPYLIB.
006300
006400*---------- PARMS FOR CALL TO "THDPRT2".
006500 01  HD-RET-CODE                   PIC S9(4) COMP-4 VALUE 0.
006600 01  HD-FILE-NAME                  PIC X(17) VALUE "DHDWSOUT.PUB".
006800 01  FNUM                          PIC S9(4) COMP-4 VALUE 0.
006900
007000 COPY ESCNAM2 IN COPYLIB.
007100
007200
007300**************************************************************
007400**                                                          **
007500**            D A T A B A S E   W O R K                     **
007600**                                                          **
007700**************************************************************
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".
007800
007900 01  BASE                       PIC X(10) VALUE "  STORES;".
008000 01  PASSWORD                   PIC X(5)  VALUE "JADE;".
008100 01  ALL-ITEM-LIST              PIC X(2)  VALUE "@;".
008200 01  WRKLIST-SEARCH             PIC X(7)  VALUE "WL-KEY;".
008300 01  WS-ARG                     PIC X(6)  VALUE SPACES.
008400
008500
       COPY DBSTAT IN COPYLIB.
009500 01  DSET-NAMES.
009600     05  DSET-MWRKLIST          PIC X(16)  VALUE "MWRKLIST;".
009700     05  DSET-DWLITEM           PIC X(16)  VALUE "DWLITEM;".
009800
009900 01  MODE-AREA.
010000     05  MODE1                  PIC S9(4)   COMP       VALUE 1.
010100     05  MODE2                  PIC S9(4)   COMP       VALUE 2.
010200     05  MODE3                  PIC S9(4)   COMP       VALUE 3.
010300     05  MODE5                  PIC S9(4)   COMP       VALUE 5.
010400     05  MODE7                  PIC S9(4)   COMP       VALUE 7.
010500
010600**************************************************************
010700**                                                          **
010800**           D A T A B A S E   B U F F E R S                **
010900**                                                          **
011000**************************************************************
011100
       COPY MWRKLIST IN COPYLIB.
011700
011800*******************************************************
011900**   NOTE THAT THE LAST  LOCATION IN DWLITEM IS USED **
012000**   TO HOLD EXP CLASS.  ALL OTHER LOCS ARE INGNORED **
012100**   BY SUBSEQUENT PROGRAMS.                         **
012200*******************************************************
012300
012400 01  BUF-DWLITEM.
012500     05  WL-KEY                 PIC X(6).
012600     05  WL-RCD-DATA.
012700         10  WL-CODE            PIC X(8).
012800         10  WL-CHARGE-DEPT     PIC X(6).
012900         10  WL-WO.
013000             15  FILLER         PIC X(10).
013100             15  WL-WORK-CENTER PIC X(2).
013200         10  WL-EMPL            PIC X(4).
013300         10  WL-UM              PIC X(2).
013400         10  WL-BINDATA.
013500             15  WL-BIN-LINE OCCURS 6 TIMES.
013600                 20  WL-LOC        PIC X(12).
013700                 20  WL-LOC-ONHAND PIC S9(8).
013800         10  WL-REQ-DEPT        PIC X(4).
013900
014000 01  HEADER-1.
014100     05  FILLER  PIC X(7)  VALUE "TWSOUTP".
014200     05  FILLER  PIC X(3)  VALUE SPACES.
014300     05  FILLER  PIC X(4)  VALUE "PAGE".
014400     05  PRT-PG  PIC ZZZ9.
014500     05  FILLER  PIC X(9)  VALUE SPACES.
014600     05  FILLER  PIC X(21) VALUE "O U T S T A N D I N G".
014700     05  FILLER  PIC X(20) VALUE "   S T O R E R O O M".
014800     05  FILLER  PIC X(22) VALUE "   W O R K S H E E T S".
014900     05  FILLER  PIC X(13) VALUE SPACES.
015000     05  FILLER  PIC X(5)  VALUE "DATE ".
015100     05  PRT-DT  PIC X(8).
015200     05  FILLER  PIC X(7)  VALUE "  TIME ".
015300     05  PRT-TM  PIC X(8).
015400
015500 01  HEADER-2.
015600     05  FILLER  PIC X(25) VALUE SPACES.
015700     05  FILLER  PIC X(11) VALUE "WORKSHEET #".
015800     05  PRT-WS  PIC X(6).
015900     05  FILLER  PIC X(12) VALUE "   PREPARED ".
016000     05  PRT-WD  PIC X(8).
016100
016200 01  HEADER-3.
016300     05  FILLER  PIC X(5)  VALUE SPACES.
016400     05  FILLER  PIC X(7)  VALUE "CORPCOD".
016500     05  FILLER  PIC X(10) VALUE "  QUANTITY".
016600     05  FILLER  PIC X(4)  VALUE "  UM".
016700     05  FILLER  PIC X(14) VALUE "   DESCRIPTION".
016800     05  FILLER  PIC X(42) VALUE SPACES.
016900     05  FILLER  PIC X(4)  VALUE "EMPL".
017000     05  FILLER  PIC X(12) VALUE "   WORKORDER".
017100     05  FILLER  PIC X(8)  VALUE "    RQST".
017200     05  FILLER  PIC X(7)  VALUE "   CHRG".
017300     05  FILLER  PIC X(9)  VALUE "  ACCOUNT".
017400
017500 01  DETAIL-LINE.
017600     05  FILLER                    PIC X(5)  VALUE SPACES.
017700     05  PRT-CORP-CODE             PIC X(7).
017800     05  FILLER                    PIC X(2)  VALUE SPACES.
017900     05  PRT-QUANTITY              PIC ZZZZZZZ9.
018000     05  FILLER                    PIC X(2)  VALUE SPACES.
018100     05  PRT-UM                    PIC X(2).
018200     05  FILLER                    PIC X(3)  VALUE SPACES.
018300     05  PRT-DESC                  PIC X(50).
018400     05  FILLER                    PIC X(3)  VALUE SPACES.
018500     05  PRT-EMPL                  PIC X(4).
018600     05  FILLER                    PIC X(3)  VALUE SPACES.
018700     05  PRT-WO                    PIC X(10).
018800     05  FILLER                    PIC X(3)  VALUE SPACES.
018900     05  PRT-REQ-DEPT              PIC X(4).
019000     05  FILLER                    PIC X(3)  VALUE SPACES.
019100     05  PRT-CHRG-DEPT             PIC X(4).
019200     05  FILLER                    PIC X(2)  VALUE SPACES.
019300     05  PRT-ACCOUNT               PIC X(6).
019400
       LINKAGE SECTION.
       COPY THDPRTB IN COPYLIB.
       01  DUMMY-REC  PIC X(161).
019500 PROCEDURE DIVISION USING HD-ROUTE-DATA, DUMMY-REC.
019600 1000-HOUSEKEEP SECTION.
       1010-HOUSEKEEPING.
           MOVE ZERO TO LINE-K, PAGE-K, SUB, TOTAL-QTY.
           OPEN INPUT DWLITEM-I, MWRKLIST-I.
019700     MOVE "TWSOUTP"                TO  BU-PGM-NAME.
020200
           DISPLAY HD-ROUTE-DATA.

021000     MOVE 1                        TO  DATE-MODE.
021100     CALL "TDATECHK" USING DATE-CHECK-AREA.
021200     MOVE DATE-SLASH-OUT           TO  PRT-DT.
021300     MOVE DATE-FORMATTED-TIME-OUT  TO  PRT-TM.
021400
021500     PERFORM 6000-MAIN THRU 6990-MAIN-X.
021600
021700 2000-EOJ.
           CLOSE DWLITEM-I, MWRKLIST-I.
021900     GOBACK.
022000
022100 2100-BLOWUP.
022200     CALL "TBLOWUP" USING BASE BU-PGM-NAME
022300       STATUS-AREA VIEW-COMAREA FILE-STATUS
022400       BU-DISPLAY-MSG BU-DISPLAY-FLDS.
022500
022600 6000-MAIN.
           MOVE HD-SPOOLER-NUMBER TO OVRPRTF-TOFILE-NUM.
           MOVE "*YES"            TO OVRPRTF-SHARED.
           MOVE HD-NO-OF-COPIES   TO OVRPRTF-COPIES.
           MOVE "MCPRT"           TO OVRPRTF-FILE.
           PERFORM 996-OVERRIDE-PRINT-FILE.
022700     OPEN OUTPUT RPT-FILE.
022900     CALL "THDPRT2" USING HD-RET-CODE, HD-FILE-NAME, FNUM,
023000       HD-ROUTE-DATA, ESC-NAME.
023100     IF HD-RET-CODE NOT = 0
023200         MOVE "THDPRT2 ERR 6000-MAIN" TO BU-DISPLAY-MSG
023300         PERFORM 2100-BLOWUP.

pdr        CALL "TESCSEQ" USING ESC-NAME.
pdr
pdr        IF NOT PAPER-IS-132-COLS
pdr           WRITE RPT-REC FROM CHAR-1636PI AFTER ADVANCING 0 LINES.

023400
023500     PERFORM 6500-PAGE-HEADERS.
023600
           MOVE SPACES TO WLKEY OF MWRKLIST-REC-I.
           START MWRKLIST-I KEY >= WLKEY OF MWRKLIST-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
               MOVE "START ERROR ON MWRKLIST" TO BU-DISPLAY-MSG
               PERFORM 2100-BLOWUP.

023700 6100-DBGET-LOOP.
023800*    CALL "DBGET" USING BASE, DSET-MWRKLIST, MODE2, STATUS-AREA,
023900*      ALL-ITEM-LIST, BUF-MWRKLIST, WS-ARG.
           READ MWRKLIST-I NEXT INTO BUF-MWRKLIST
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
024100         GO TO 6700-CLOSE-PRINT.

           MOVE WRKLIST-KEY TO WS-WRKLIST-KEY.
024600
024700*---------- REJECT ALL CONTROL KEYS, ETC IN THE WORKSHEET DATA SETS,
024800*---------- AND USE ONLY ACTUAL RETURN OR ISSUE WORKSHEETS.
024900     IF WL-LIT = "SW" OR "ST"
025000         NEXT SENTENCE
025100     ELSE
025200         GO TO 6100-DBGET-LOOP.
025300
025400     IF WL-KEY-NO = "0000"
025500         GO TO 6100-DBGET-LOOP.
025600
025700     MOVE WRKLIST-KEY TO WS-ARG.
025800*    CALL "DBFIND" USING BASE, DSET-DWLITEM, MODE1, STATUS-AREA,
025900*      WRKLIST-SEARCH, WS-ARG.
           MOVE WS-ARG TO WLKEY OF DWLITEM-REC-I.
           START DWLITEM-I KEY = WLKEY OF DWLITEM-REC-I
               INVALID KEY MOVE 17 TO COND-WORD.
           IF (FILE-STATUS NOT = "00") AND (FILE-STATUS-1 NOT = "2")
026100         MOVE "DBFIND ERR 6100-DL" TO BU-DISPLAY-MSG
026200         PERFORM 2100-BLOWUP.
026300
026400     PERFORM 6550-WS-HEADERS.
026500
026600 6200-DBGET-DWLITEM-LOOP.
026700     IF LINE-K > 60
026800         PERFORM 6500-PAGE-HEADERS
026900         PERFORM 6550-WS-HEADERS.
027000
027100*    CALL "DBGET" USING BASE, DSET-DWLITEM, MODE5, STATUS-AREA,
027200*      ALL-ITEM-LIST, BUF-DWLITEM, WRKLIST-KEY.
           MOVE 0 TO COND-WORD.
           READ DWLITEM-I NEXT INTO BUF-DWLITEM
               AT END MOVE 15 TO COND-WORD.
           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS = "10" OR "14" OR "46"
                   MOVE 15 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.
           IF WLKEY OF DWLITEM-REC-I NOT = WS-ARG
               MOVE 15 TO COND-WORD.
027300     IF COND-WORD = 15
027400         GO TO 6100-DBGET-LOOP
027500     ELSE
027600     IF COND-WORD NOT = 0
027700         MOVE "DBGET ERR 6200-DDL" TO BU-DISPLAY-MSG
027800         PERFORM 2100-BLOWUP.
027900
028000     MOVE WL-CODE                  TO  PRT-CORP-CODE.
028100     MOVE WL-CHARGE-DEPT           TO  PRT-CHRG-DEPT.
028200     MOVE WL-WO                    TO  PRT-WO.
028300     MOVE WL-EMPL                  TO  PRT-EMPL.
028400     MOVE WL-UM                    TO  PRT-UM.
028500     MOVE 0                        TO  TOTAL-QTY.
028600     MOVE 0                        TO  SUB.
028700     PERFORM 6400-ADD-LOCS 6 TIMES.
028800     MOVE TOTAL-QTY                TO  PRT-QUANTITY.
028900     MOVE WL-REQ-DEPT              TO  PRT-REQ-DEPT.
029000     MOVE WL-LOC (6)               TO  PRT-ACCOUNT.
029100
029200*---------- GET JUST KEYWORD AND ADJECTIVE FOR THE PRINTOUT
029300     MOVE "K"                      TO  CDESC-DESC-OPTION.
029400     CALL "CDESC" USING CDESC-RET-CODE, BASE, STATUS-AREA,
029500       BU-DISPLAY-MSG, WL-CODE, CDESC-DATA.
029600     MOVE CDESC (1)                TO  PRT-DESC.
029700
           WRITE RPT-REC FROM DETAIL-LINE AFTER ADVANCING 1.
030000     ADD 1                         TO  LINE-K.
030100
030200     GO TO 6200-DBGET-DWLITEM-LOOP.
030300
030400 6400-ADD-LOCS.
030500     ADD 1                         TO  SUB.
030600     ADD WL-LOC-ONHAND (SUB)       TO  TOTAL-QTY.
030700
030800 6500-PAGE-HEADERS.
030900     ADD 1                         TO  PAGE-K.
031000     MOVE PAGE-K                   TO  PRT-PG.
031100     MOVE 4                        TO  LINE-K.
031200
           WRITE RPT-REC FROM HEADER-1 AFTER ADVANCING NEW-PAGE.
031700     PERFORM 7000-WRITE-SPACE-LINE.
031800 6550-WS-HEADERS.
031900     MOVE 4                        TO  DATE-MODE.
032000     MOVE WRKLIST-DATE             TO  DATE-VALIDATE-IN.
032100     CALL "TDATECHK" USING DATE-CHECK-AREA.
032200     MOVE DATE-SLASH-OUT           TO  PRT-WD.
032300
032400     MOVE WRKLIST-KEY              TO  PRT-WS.
032500     PERFORM 7000-WRITE-SPACE-LINE.
           WRITE RPT-REC FROM HEADER-2 AFTER ADVANCING 1.
           WRITE RPT-REC FROM HEADER-3 AFTER ADVANCING 1.
033000     ADD 3                         TO  LINE-K.
033100
033200 6700-CLOSE-PRINT.
pdr        WRITE RPT-REC FROM CHAR-10PI AFTER ADVANCING 0 LINES.
033300      CLOSE RPT-FILE.
033400
033500 6990-MAIN-X.
033600     EXIT.

       COPY OVRPFCALL IN COPYLIB.
033700 7000-WRITE-SPACE-LINE.
033800     MOVE SPACES                   TO  RPT-REC.
           WRITE RPT-REC AFTER ADVANCING 1.
