001100 IDENTIFICATION DIVISION.
001200 PROGRAM-ID.    TZBILL.
001300 AUTHOR.        BUNN/ BARBARA WINTER.
001400 DATE-WRITTEN.  MARCH 9, 1983.
001500 DATE-COMPILED.
001600*INSTALLATION.  GOODYEAR.
001800*    ASSIGNING A MEMO Z-BILL TO A PURCHASE ORDER
001900*
002000*       THIS PROGRAM ALLOWS THE USER TO ASSIGN A MEMO Z-BILL
002100*    TO A SPECIFIC PURCHASE ORDER. THERE IS ALSO A CAPABILITY OF
002200*    CHANGING, DELETING, AND INQUIRYING ABOUT A ZBILL NUMBER
002300*    PER PURCHASE ORDER.
002400*
002500*      PROCESSING OUTLINE:
002600*      1.  THE SCREEN IS WRITTEN REQUESTING THE P.O. NUMBER,
002700*          THE MEMO Z-BILL NUMBER, AND A CODE.  (A FOR ADD,
002800*          C FOR CHANGE, I FOR INQUIRY, AND D FOR DELETE).
002900*      2.  THE P.O. NUMBER AND CODE ARE VALIDATED.
003000*      3.  FOR AN ADD OR CHANGE, THE ZBILL IS ENTERED IN THE
003100*          DPORECD PADDING FOR THAT PARTICULAR PURCHASE ORDER.
003200*      4.  IF THE PO HAS MULTIPLE Z-BILLS, THE FIRST ZBILL NUMBER
003300*          IS WRITTEN TO THE DPORECD PADDING. A FLAG OF
003400*          "Z" WILL BE ENTERED IN THE BTYE FOLLOWING THE PO-FLAG
003500*          NUMBER; SIGNIFYING THAT THERE IS MORE THAN ONE Z-BILL
003600*          FOR THIS PURCHASE ORDER.
003700*
      ******************************************************************
      *
003800*    ON OCTOBER 10, 1983, THE FORMFILE NAME WAS CHANGED TO
003900*         FZBILL.PUB.   LMB.
004000*
004100*    ON FEBRUARY 15, 1984, ADDED PLANT 5 AND 9.  LMB.
      *
      * 2/20/1997    CA YODER
      *    CONVERTED THIS PROGRAM FROM THE HP-3000 TO THE AS/400
      *    DUE TO AKRON'S CONVERSION TO THE AS/400.
      *
      ******************************************************************
004200
004300 ENVIRONMENT DIVISION.
004400 CONFIGURATION SECTION.
004500 SOURCE-COMPUTER.    IBM-AS400.
004600 OBJECT-COMPUTER.    IBM-AS400.
       SPECIAL-NAMES. I-O-FEEDBACK IS I-O-FEEDBACK-AREA.
004700
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZZBILL-SI
                  ORGANIZATION IS TRANSACTION
                    ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

           SELECT DPORECD-O
                  ASSIGN TO DATABASE-MCFLCS0901
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                    WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.
       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC                   PIC X(1500).

       FD  DPORECD-O
           LABEL RECORDS ARE STANDARD.
       01  DPORECD-REC-O.
           COPY DDS-ALL-FORMATS  OF MCFLCS0901.

004900 WORKING-STORAGE SECTION.
005000 77  PO-ARG                     PIC X(14)  VALUE SPACES.
005200 77  BASE-SUB                   PIC S9(4)  COMP VALUE ZERO.

       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

005700 01  FILENAME                   PIC X(11)  VALUE SPACES.
005800 01  FORMFILE.
005900     05  FORM-NAME              PIC X(6)  VALUE "FZBILL".
006000     05  FILLER                    PIC X     VALUE ".".
006100     05  FORM-GNAME.
006200         10  FORM-GNAME1           PIC X(5)  VALUE "FLANG".
006300         10  FORM-GNAME2           PIC X(3)  VALUE SPACES.
006400     05  FILLER                    PIC X(19) VALUE SPACES.
006500
006600 01  BASE-LAYOUT.
006700     05  BASE-1          PIC X(6) VALUE "MCPRD1".
006800     05  BASE-2          PIC X(6) VALUE "MCPRD2".
006900     05  BASE-5          PIC X(6) VALUE "MCPRD5".
007000     05  BASE-9          PIC X(6) VALUE "MCPRD9".
007100
007200 01  BASE-AREA REDEFINES BASE-LAYOUT.
007300     05  BASES OCCURS 4 TIMES.
007400         10  BASE        PIC X(6).
007500
007600 COPY DPORECD OF COPYLIB.
007700
007800 COPY DBSTAT   OF COPYLIB.
009800
009900 COPY TBLOWUP OF COPYLIB.
010000*********************************
010100*  ZBILL SCREEN BUFFER AREA     *
010200*********************************
010300 01  DE-PO-ZBILL-SCREEN.
010400     05  DE-PO-RLSE.
010500         10  DE-PO              PIC X(7).
010600         10  DE-RLSE            PIC X(3).
010700     05  DE-ACTION-CODE         PIC X.
010800     05  DE-ZBILL               PIC X(6).
           05  DE-MESSAGE             PIC X(79).
010900
011000*********************************
011100*  PURCHASE ORDER WORKAREA      *
011200*********************************
011300 01  WS-PO-WORKAREA.
011400     05  WS-PO-INDIC        PIC X(1)  VALUE "P".
011500     05  WS-PO              PIC X(7)  VALUE SPACES.
011600     05  WS-RLSE            PIC X(3)  VALUE SPACES.
011700     05  WS-RS              PIC X(3)  VALUE SPACES.
011800
013500 COPY VCOMAREA OF COPYLIB.

       01  COMMAND-WORK               PIC X(70).
       01  COMMAND-LEN                PIC S9(10)V9(5)  COMP-3 VALUE 70.

015000 COPY LANGUAGE OF COPYLIB.
015100 COPY ESCNAM2 OF COPYLIB.
       COPY TSHWRDFM  OF COPYLIB.
       COPY DISPDAT2  OF COPYLIB.
       COPY IOFEEDBACK OF COPYLIB.

015300*********************************
015400*       PROCEDURE DIVISION      *
015500*********************************
015600 PROCEDURE DIVISION.
015700 HOUSEKEEP SECTION 01.
015800
015900 010-OPEN-FILES.
           OPEN I-O   DISPLAY-FILE.
021900
022000     PERFORM 6-MAIN THRU 699-EXIT.
022100
022200********************************
022300*   CLOSE FORM & DATABASES     *
022400********************************

           CLOSE DISPLAY-FILE
                 DPORECD-O.

023200     GOBACK.
023300
023400 6-MAIN.
023500*************************************************************
023600*         DISPLAY SCREEN AND ALLOW USER TO ENTER DATA       *
023700*************************************************************
023800 050-SHOW-MAIN-SCREEN.
           MOVE SPACES         TO  DE-PO-ZBILL-SCREEN.
           MOVE ZEROS          TO  DE-RLSE.
023900     MOVE "ZBILL"        TO  VIEW-NFNAME.
025300
025400 055-SHOW-FORM.
           MOVE DE-PO-ZBILL-SCREEN     TO  DISPLAY-REC.
           PERFORM 998-WRITE-SCREEN.
           PERFORM 998-READ-SCREEN.
           MOVE DISPLAY-REC            TO  DE-PO-ZBILL-SCREEN.

026600     IF VIEW-LASTKEY = 7
026700         GO TO 6-MAIN.
026800
027900     IF VIEW-LASTKEY = 3
028000         GO TO 699-EXIT.
028100
      *---------- INVALID FUNCTION KEY.
028200     IF VIEW-LASTKEY EQUAL 1 OR
028300        VIEW-LASTKEY EQUAL 2 OR
028400        VIEW-LASTKEY EQUAL 4 OR
028500        VIEW-LASTKEY EQUAL 5 OR
028600        VIEW-LASTKEY EQUAL 6 OR
              VIEW-LASTKEY EQUAL 8
028700        MOVE "INVALID FUNCTION KEY ENTERED" TO  DE-MESSAGE
              MOVE B"1"  TO  IND (99)
028900        GO TO 055-SHOW-FORM.

029000*---------- EDIT DATA IN DATA BUFFER
           IF DE-PO-RLSE = SPACES
               MOVE "ENTER PO NUMBER"             TO  DE-MESSAGE
               MOVE B"1"  TO  IND(10)  IND(99)
               GO TO 055-SHOW-FORM.

           IF DE-ACTION-CODE NOT = "A" AND  DE-ACTION-CODE NOT = "D" AND
              DE-ACTION-CODE NOT = "I" AND  DE-ACTION-CODE NOT = "C"
               MOVE "INVALID CODE ENTERED"  TO  DE-MESSAGE
               MOVE B"1"  TO  IND(12)  IND(99)
               GO TO 055-SHOW-FORM.

           IF DE-ACTION-CODE = "A" AND DE-ZBILL = SPACES
               MOVE "ENTER MEMO Z-BILL"  TO  DE-MESSAGE
               MOVE B"1"  TO  IND(13)  IND(99)
               GO TO 055-SHOW-FORM.

030600********************************
030700*        LOCK DPORECD          *
030800*  FOR A CHANGE, ADD OR DELETE *
030900********************************
      *---------- IF A FILE WAS ALREADY OPEN, CLOSE IT BEFORE
      *---------- DOING ANOTHER INQUIRY.
           IF BASE-SUB > 1
               CLOSE DPORECD-O
               MOVE "DLTOVR FILE(MCFLCS0901)"  TO  COMMAND-WORK
               CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

031000     MOVE 1           TO  BASE-SUB.
031100
032000 FIND-DPORECD.
032100     IF DE-RLSE = SPACES
032200         MOVE ZEROS TO DE-RLSE.
032300
032400     MOVE DE-PO        TO WS-PO.
032500     MOVE DE-RLSE      TO WS-RLSE.
032600     MOVE ZEROS        TO WS-RS
                                COND-WORD.
032700
           STRING "OVRDBF FILE(MCFLCS0901) TOFILE(" DELIMITED BY SIZE,
               BASE (BASE-SUB) DELIMITED BY SPACES,
               "/MCFLCS0901) SHARE(*NO)" DELIMITED BY SIZE
             INTO COMMAND-WORK.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           OPEN I-O DPORECD-O.

032800     MOVE WS-PO-WORKAREA TO PO-ARG.
032900
           MOVE PO-ARG TO PORCVNO OF DPORECD-REC-O.
           START DPORECD-O KEY = PORCVNO OF DPORECD-REC-O
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.

           IF FILE-STATUS NOT = "00"
               IF FILE-STATUS-1 = "2"
                   MOVE 17 TO COND-WORD
               ELSE
                   MOVE 99 TO COND-WORD.

033200     IF COND-WORD NOT = 0
033300         IF COND-WORD = 17
033400             IF BASE-SUB = 4
                       MOVE "PO DOES NOT EXIST"        TO DE-MESSAGE
                       MOVE B"1"   TO  IND(10)  IND(99)
                       GO TO 055-SHOW-FORM
034200             ELSE
                       CLOSE DPORECD-O
                       MOVE "DLTOVR FILE(MCFLCS0901)"  TO  COMMAND-WORK
                       CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN
034400                 ADD 1 TO BASE-SUB
034500                 GO TO FIND-DPORECD
                   END-IF
034600         ELSE
034700             MOVE "DBFIND DPORECD TZBILL" TO BU-DISPLAY-MSG
034800             PERFORM 990-BLOWUP THRU 999-EXIT
               END-IF
           END-IF.
034900
035000 GET-DPORECD.
           READ DPORECD-O NEXT INTO BUF-DPORECD
               AT END MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "READ DPORECD * 61-UD" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.

035700********************************
035800*     MOVE Z-BILL DATA         *
035900********************************
036000     IF DE-ACTION-CODE = "A"
036100         IF PO-ZBILL = SPACES
036200             MOVE DE-ZBILL    TO PO-ZBILL
036300         ELSE
036400             MOVE "Z"         TO PO-MULTI-ZBILL.
036500
036600     IF DE-ACTION-CODE = "C"
036700         MOVE DE-ZBILL        TO PO-ZBILL.
036800
036900     IF DE-ACTION-CODE = "I"
037000         GO TO FILL-FIELDS.
037100
037200     IF DE-ACTION-CODE = "D"
037300         IF PO-ZBILL = DE-ZBILL
037400             MOVE SPACES TO PO-ZBILL
037500             MOVE SPACES TO PO-MULTI-ZBILL
037600         ELSE
037700             MOVE B"1"  TO  IND(13)  IND(99)
037900             MOVE "ZBILL NUMBER DOES NOT EXIST" TO  DE-MESSAGE
038200             GO TO 055-SHOW-FORM.
038300
038400********************************
038500*         UPDATE DPORECD       *
038600*  FOR A CHANGE, ADD OR DELETE *
038700********************************
038800 UPDATE-DPORECD.
           REWRITE DPORECD-REC-O FROM BUF-DPORECD
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               MOVE "REWRITE-DPORECD *61-PUD" TO BU-DISPLAY-MSG
               PERFORM 990-BLOWUP THRU 999-EXIT.

040700********************************
040800*  FILL THE FIELDS BEFORE SHOW *
040900********************************
041000 FILL-FIELDS.
041100     IF DE-ACTION-CODE = "I"
041200         MOVE PO-ZBILL                  TO  DE-ZBILL
041300         IF PO-ZBILL = SPACES
041400             MOVE B"1" TO IND(10)  IND(99)
041600             MOVE "P.O. HAS NO ZBILLS"  TO  DE-MESSAGE
                   GO TO 055-SHOW-FORM
041800         ELSE
041900         IF PO-MULTI-ZBILL = "Z"
                   MOVE B"1" TO IND(10)  IND(99)
042200             MOVE "P.O. HAS MULTIPLE ZBILLS"  TO DE-MESSAGE
                   GO TO 055-SHOW-FORM.
042400
042500     IF DE-ACTION-CODE = "A" OR "C" OR "D"
042600         MOVE SPACES TO DE-ZBILL, DE-PO-RLSE, DE-ACTION-CODE.
042700
043500     IF DE-ACTION-CODE = "I"
043600        GO TO 055-SHOW-FORM
043700     ELSE
043800        GO TO 6-MAIN.
043900
044000 699-EXIT.  EXIT.
044100
048100************************************************************
048200*                    B L O W U P                           *
048300*     CHECK FOR IMAGE, VIEW, OR SPOOL ERROR.  CLOSE        *
048400*     FILES, GET OUT OF BLOCK MODE, AND DISPLAY            *
048500*     APPROPRIATE ERROR MESSAGE ON SCREEN.                 *
048600*                                                          *
048700*     ALSO APPENDS THE ERROR MESSAGE TO A FILE CALLED      *
048800*     BLOWUP.PUB.  TO READ THIS FILE, RUN "XBLPRT.OBJECT". *
048900*                                                          *
049000*         !!!  PROGRAM IS ABORTED IN TBLOWUP  !!!          *
049100************************************************************
049200 990-BLOWUP.
049300     MOVE "TZBILL" TO BU-PGM-NAME.
049400     MOVE VIEW-NFNAME TO BU-DISPLAY-FLD (1).
049500     MOVE PO-ARG TO BU-DISPLAY-FLD (2).
049600     CALL "TBLOWUP" USING BASE (BASE-SUB), BU-PGM-NAME,
049700           STATUS-AREA, VIEW-COMAREA, DUMMY-KSAM-STAT,
049800           BU-DISPLAY-MSG, BU-DISPLAY-FLDS.
049900 999-EXIT.  EXIT.
       COPY DISPCALL   IN COPYLIB.
