       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TZEROBUFF.
       AUTHOR.
            KURT MOVSESIAN.

      ******************************************************
      *                                                    *
      *   T Z E R O B U F F                                *
      *   FOR CSAS FILES                                   *
      *   THIS PROGRAM WILL CHECK TO MAKE SURE ALL NUMERIC *
      *   DEFINED FIELDS ARE NUMERIC. IF A FIELD IS FOUND  *
      *   NOT TO BE NUMERIC THEN ZEROS IS MOVED IN.        *
      ******************************************************

      *C
      *C   7/7/93.    M. L. MITCHELL    REQUEST PAR D. PLUM, #
      *C     REMOVE ALL REFERENCE TO DSET DAAPLFRT (MCFLCA0800).
      *C     ALL LOGICAL, COPYLIB AND WORKING STORAGE REFERENCES
      *C     WERE DELETED.
      *C
      *C   28FEB1994    DAVE PLUM
      *C     ADDED CALL TO THE COBOL ERROR HANDLER - MCXCBLERR.
      *C
      *C   09/03/1996   CA YODER
      *C     RE-COMPILED TO PICK UP CENTURY DATABASE CHANGES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  HP-3000.
       OBJECT-COMPUTER.  HP-3000.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT DTRANS-O
                  ASSIGN TO DATABASE-MCFLCA0701
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                     WITH DUPLICATES
                  FILE STATUS IS FILE-STATUS.

           SELECT MCLASS-O
                  ASSIGN TO DATABASE-MCFLCS4901
                  ORGANIZATION IS INDEXED
                      ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT MMATL-ACCUM-O
                  ASSIGN TO DATABASE-MCFLCA0601
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  DTRANS-O
           LABEL RECORDS ARE STANDARD.
       01  DTRANS-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCA0701.
       FD  MCLASS-O
           LABEL RECORDS ARE STANDARD.
       01  MCLASS-REC-O.
           COPY DDS-ALL-FORMATS OF MCFLCS4901.

       FD  MMATL-ACCUM-O
           LABEL RECORDS ARE STANDARD.
       01  MMATL-ACCUM-REC.
           COPY DDS-ALL-FORMATS OF MCFLCA0601.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  ERROR-RECORD-CTR             PIC 9(8) COMP-4 VALUE ZEROS.
       01  ERR-SW                       PIC X  VALUE SPACES.
       01  UPDATE-SWITCH                PIC X  VALUE SPACES.
       01  MCXCBLERR-SCOPE              PIC X(1)  VALUE "C".

      **************************************************************
      **************************************************************
      **                                                          **
      **                DATABASE I/O BUFFER AREA                  **
      **                                                          **
      **************************************************************
      **************************************************************

       COPY DTRANS   IN COPYLIB.
       COPY MCLASS   IN COPYLIB.
       COPY MATLACUM IN COPYLIB.

       COPY DBSTAT IN COPYLIB.

       01  BASE   PIC X(10) VALUE SPACES.

       COPY TBLOWUP IN COPYLIB.
       COPY VIEWDUM IN COPYLIB.

       PROCEDURE DIVISION.

       BEGIN-HERE.
           MOVE "C" TO MCXCBLERR-SCOPE.
           CALL "MCXCBLERR" USING MCXCBLERR-SCOPE.

           DISPLAY "     Z E R O   C S A S   B U F F E R S ".
           DISPLAY "UPDATE (U) OR DISPLAY ONLY (D) RECORDS?".
           ACCEPT UPDATE-SWITCH.

           OPEN I-O DTRANS-O

           DISPLAY "BEGINNING DTRANS  1 OF  3 DATASETS".
           PERFORM 6-MAIN  THRU  6-M-X.

           CLOSE DTRANS-O.
           DISPLAY "BEGINNING MCLASS   2 OF 3 DATASETS".
           OPEN I-O MCLASS-O.
           PERFORM 62-MAIN THRU 62-M-X.
           CLOSE MCLASS-O.

           DISPLAY "BEGINNING MMATL-ACCUM 3 OF 3 DATASETS".
           OPEN I-O MMATL-ACCUM-O.
           PERFORM 63-MAIN THRU 63-M-X.
           CLOSE MMATL-ACCUM-O.

           GOBACK.

      *******************************************************
      **                                                   **
      **   BLOWUP  ROUTINE                                 **
      **                                                   **
      *******************************************************

       2-BLOWUP.
           MOVE "TZEROBUFF"      TO  BU-PGM-NAME.
           CALL "TBLOWUP" USING BASE, BU-PGM-NAME, STATUS-AREA,
               VIEW-COMAREA, FILE-STATUS, BU-DISPLAY-MSG,
                   BU-DISPLAY-FLDS.

       6-MAIN.
           READ DTRANS-O FIRST RECORD INTO BUF-DTRANS
               AT END GO TO 6-M-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST DTRANS   *6-MAIN" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE ZERO TO ERROR-RECORD-CTR.
           PERFORM 61-READ-FILE THRU 61-RF-X.

           DISPLAY "TOTAL NO. OF RCDS WITH NON-NUMERIC DATA = ".
           DISPLAY ERROR-RECORD-CTR.

       6-M-X.
           EXIT.

       61-READ-FILE.
           MOVE SPACES TO ERR-SW.
           IF TRANS-QTY NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO TRANS-QTY.
           IF TRANS-VALUE NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO TRANS-VALUE.
           IF TRANS-BALANCE-QTY  NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO TRANS-BALANCE-QTY.

           IF ERR-SW = "Y"
               ADD 1 TO ERROR-RECORD-CTR
               IF UPDATE-SWITCH = "U"
               REWRITE DTRANS-REC-O FROM BUF-DTRANS
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DTRANS 61-RF" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ DTRANS-O NEXT RECORD INTO BUF-DTRANS
               AT END GO TO 61-RF-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ NEXT DTRANS *61-RF" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           GO TO 61-READ-FILE.

       61-RF-X.
           EXIT.

       62-MAIN.
           READ MCLASS-O FIRST RECORD INTO BUF-MCLASS
               AT END GO TO 62-M-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST MCLASS  *6-MAIN" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE ZERO TO ERROR-RECORD-CTR.
           PERFORM 62-READ-FILE THRU 62-RF-X.

           DISPLAY "TOTAL NO. OF RCDS WITH NON-NUMERIC DATA = ".
           DISPLAY ERROR-RECORD-CTR.

       62-M-X.
           EXIT.

       62-READ-FILE.
           MOVE SPACES TO ERR-SW.
           IF MCLASS-DCHG-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MCLASS-DCHG-DOLLARS.
           IF MCLASS-ONDOCK-CARRY NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MCLASS-ONDOCK-CARRY.
           IF ERR-SW = "Y"
               ADD 1 TO ERROR-RECORD-CTR
               IF UPDATE-SWITCH = "U"
               REWRITE MCLASS-REC-O FROM BUF-MCLASS
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE MCLASS  61-RF" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ MCLASS-O NEXT RECORD INTO BUF-MCLASS
               AT END GO TO 62-RF-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ NEXT MCLASS   *61-RF" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           GO TO 62-READ-FILE.

       62-RF-X.
           EXIT.

       63-MAIN.
           READ MMATL-ACCUM-O FIRST RECORD INTO BUF-MATLACUM
               AT END GO TO 63-M-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ FIRST MATLACUM*6-MAIN" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           MOVE ZERO TO ERROR-RECORD-CTR.
           PERFORM 63-READ-FILE THRU 63-RF-X.

           DISPLAY "TOTAL MATLACUM RCDS WITH NON-NUMERIC DATA = ".
           DISPLAY ERROR-RECORD-CTR.

       63-M-X.
           EXIT.

       63-READ-FILE.
           MOVE SPACES TO ERR-SW.
           IF MATL-BEG-BAL-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-BEG-BAL-DOLLARS.
           IF MATL-BEG-BAL-UNITS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-BEG-BAL-UNITS.
           IF MATL-INV-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-INV-DOLLARS.
           IF MATL-RCPT-UNITS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RCPT-UNITS.
           IF MATL-ISSUE-UNITS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-ISSUE-UNITS.
           IF MATL-RTN-UNITS     NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RTN-UNITS.
           IF MATL-ADJ-UNITS   NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-ADJ-UNITS.
           IF MATL-RTN-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RTN-DOLLARS.
           IF MATL-RCPT-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RCPT-DOLLARS.
           IF MATL-UNITS-RCVD-NOT-INV NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-UNITS-RCVD-NOT-INV.
           IF MATL-INV-DOL-NOT-RCVD NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-INV-DOL-NOT-RCVD.
           IF MATL-UNITS-INV-NOT-RCVD  NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-UNITS-INV-NOT-RCVD.
           IF MATL-INTRANSIT-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-INTRANSIT-DOLLARS.
           IF MATL-ACCTG-UNIT-CORR NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-ACCTG-UNIT-CORR.
           IF MATL-ACCTG-DOLLAR-CORR NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-ACCTG-DOLLAR-CORR.
           IF MATL-INTRANSIT-UNITS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-INTRANSIT-UNITS.
           IF MATL-WDOWN-PERC NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-WDOWN-PERC.
           IF MATL-TOT-ISS-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-TOT-ISS-DOLLARS.
           IF MATL-TOT-ADJ-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-TOT-ADJ-DOLLARS.
           IF MATL-RTNVAL-UNITS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RTNVAL-UNITS.
           IF MATL-RTNVAL-DOLLARS NOT NUMERIC
               MOVE "Y" TO ERR-SW
               MOVE ZEROS TO MATL-RTNVAL-DOLLARS.
           IF ERR-SW = "Y"
               ADD 1 TO ERROR-RECORD-CTR
               IF UPDATE-SWITCH = "U"
               REWRITE MMATL-ACCUM-REC FROM BUF-MATLACUM
               IF FILE-STATUS NOT = "00"
                   MOVE "REWRITE DINVACCT 61-RF" TO BU-DISPLAY-MSG
                   GO TO 2-BLOWUP.

           READ MMATL-ACCUM-O NEXT RECORD INTO BUF-MATLACUM
               AT END GO TO 63-RF-X.
           IF FILE-STATUS NOT = "00"
               MOVE "READ NEXT MATLACCUM*61-RF" TO BU-DISPLAY-MSG
               GO TO 2-BLOWUP.

           GO TO 63-READ-FILE.

       63-RF-X.
           EXIT.
