       IDENTIFICATION DIVISION.
       PROGRAM-ID. TZONECHG.
       AUTHOR.                 W. ROXBURY.
      *C
      *C 09/05/96  JEFF BUNGO
      *C    EXPAND DATE FIELDS FOR YEAR 2000 COMPLIANCE.
      *C    RECOMPILE TO PICK UP DATABASE CHANGES.
      *C
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.        IBM-AS400.
       OBJECT-COMPUTER.        IBM-AS400.
       SPECIAL-NAMES.          I-O-FEEDBACK     IS I-O-FEEDBACK-AREA
                               REQUESTOR        IS WORK-STATION
                               SYSTEM-CONSOLE   IS CONSOLE
                               LOCAL-DATA       IS LOCAL-DATA-AREA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PER-PERSONNEL
               ASSIGN TO DATABASE-MCFLMM0301
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
               FILE STATUS IS FILE-STAT.

           SELECT WO-ZONE-PRTY
                  ASSIGN TO DATABASE-MCFLMM0501
                  ORGANIZATION IS INDEXED
                  ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STAT.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-ZCORLESS-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS SCREEN-STATUS
                  MAJOR-MINOR
                  CONTROL-AREA IS SCREEN-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       FD  PER-PERSONNEL
           LABEL RECORDS ARE STANDARD.
       01  PP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0301.

       FD  WO-ZONE-PRTY
           LABEL RECORDS ARE STANDARD.
       01  WZP-REC.
           COPY DDS-ALL-FORMATS OF MCFLMM0501.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC         PIC X(2000).

       WORKING-STORAGE SECTION.
       77  CFT-BUF                 PIC XX.
       77  TRUE-VAL                PIC 1       VALUE B"1".

       01  PASSWORD-INFORMATION.
           05  NAME-OF-PROGRAM     PIC X(08) VALUE "TZONECHG".
           05  PROGRAM-TYPE        PIC X(02) VALUE "UP".
           05  PROGRAM-RELEASE     PIC X(12) VALUE " E0100010001".
           05  PROGRAM-DESCRIPTION.
               10  PROG-DESC-A     PIC X(60) VALUE
         "ALLOWS SUPERVISORS TO TEMPORARILY ASSIGN A CRAFTSMAN TO     ".
               10  PROG-DESC-B     PIC X(60) VALUE
         "ANOTHER ZONE FOR AUTOMATIC ASSIGNMENT FROM THE WO QUEUE.    ".
               10  PROG-FUNCTION   PIC X(60) VALUE
         "RUNS FROM f7 KEY OF SUPERVISOR UPDATE PROGRAM.              ".
           05  PASSWORD-FLAG       PIC X.

       01  FILE-STAT.
           05 FILE-STAT-1      PIC X   VALUE "0".
           05 FILE-STAT-2      PIC X   VALUE "0".

       01  ZONE-ARGUMENT.
           05  Z-ARG          PIC X(4).
           05  FILLER         PIC XX   VALUE "1 ".

       01  SCREEN-DATA.
           05  CC-NUM-BUF                              PIC X(04).
           05  CC-NAME-BUF                             PIC X(16).
           05  CC-CRAFT-BUF                            PIC XX.
           05  CC-PERM-ZONE                            PIC X(04).
           05  CC-TEMP-ZONE                            PIC X(04).
           05  TEMP-ZONE-BUF                           PIC X(04).
           05  CMDMSG                                  PIC X(79).
           05  ERRMSG                                  PIC X(79).

       01  DB-ERROR.
           05  DB-FUNC   PIC X(10) VALUE SPACES.
           05  DB-FILE   PIC X(18) VALUE SPACES.
           05  FILLER    PIC X(20) VALUE "ERROR - FILE-STAT = ".
           05  CON-WORD  PIC XX.

           COPY SCREENIO       IN COPYLIB.

           COPY CATREAD        IN COPYLIB.

           COPY JCWAREA        IN COPYLIB.

       01  WO-PERS-DATA.
           COPY MPERSONL       IN COPYLIB.

       01  ZONE-DATA.
           COPY MZONPRTY       IN COPYLIB.

       01  MESSAGE-BUFFER-DATA.
           COPY ERRORLIN       IN COPYLIB.

       LINKAGE SECTION.
       01  DBPARAMETERS.
           COPY DBPARMS        IN COPYLIB.

       PROCEDURE DIVISION USING DBPARAMETERS.
       CHECK-PASSWORD.
           CALL "TPWORD" USING PASSWORD-INFORMATION.
           IF PASSWORD-FLAG NOT = "N"
               GO TO 6-MAIN.
           GOBACK.

       2-EOJ.
           CLOSE               PER-PERSONNEL.
           CLOSE               WO-ZONE-PRTY.
           CLOSE               DISPLAY-FILE.
           GOBACK.

       6-MAIN.
           OPEN I-O            PER-PERSONNEL.
           OPEN INPUT          WO-ZONE-PRTY.
           OPEN I-O            DISPLAY-FILE.
           MOVE 1              TO FIELD-NUMBER.
           MOVE "VTEMPZONE"    TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA ZONE-DATA WO-PERS-DATA.

       61-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO 2-EOJ
           ELSE
           IF KEY-HIT NOT = 0
               GO TO 61-SHOWFORM.

           IF CC-NUM-BUF = "NEWS" OR "9999"
      **********************************************************************
      **    MESSAGE 035/047:
      **  INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM.

           MOVE CC-NUM-BUF     TO PERCCNUM OF PER-PERSONNEL.
           READ PER-PERSONNEL  INTO WO-PERS-DATA.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/047:
      **  INVALID CLOCK CARD NUMBER
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  47        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               PERFORM 65-ERROR
               GO TO 61-SHOWFORM.

       62-MAIN.
           MOVE "VTEMPZONESON" TO SCREEN-NAME.
           MOVE SPACES         TO SCREEN-DATA MESSAGE-BUFFER.

       62-WRITE-SCREEN.
           MOVE PER-CC-NUM     TO CC-NUM-BUF.
           MOVE PER-EMP-NAME   TO CC-NAME-BUF.
           MOVE PER-CRAFT      TO CC-CRAFT-BUF.
           MOVE PER-MAINT-ZONE TO CC-PERM-ZONE.
           MOVE PER-TEMP-ZONE  TO CC-TEMP-ZONE.

       62-SHOWFORM.
           MOVE "00"           TO SCREEN-STATUS.
           MOVE SCREEN-DATA    TO DISPLAY-REC.

           WRITE DISPLAY-REC  FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS.
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN WRITE ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           READ  DISPLAY-FILE FORMAT IS SCREEN-NAME
               INDIC ARE SCREEN-INDICATORS
           IF SCREEN-STATUS NOT = "00"
               DISPLAY "SCREEN READ ERROR.  SCREEN-STATUS IS "
                        SCREEN-STATUS
               GO TO 2-EOJ.

           MOVE DISPLAY-REC    TO SCREEN-DATA.
           MOVE ALL B"0"       TO SCREEN-INDICATORS.

           IF KEY-HIT = 1 OR 3
               GO TO 2-EOJ.

           IF KEY-HIT = 2
               GO TO 6-MAIN.

           IF KEY-HIT NOT = 0
               GO TO 62-SHOWFORM.

           IF TEMP-ZONE-BUF = SPACES
               GO TO 62-DB-UPDATE.

           MOVE TEMP-ZONE-BUF  TO Z-ARG.
           MOVE ZONE-ARGUMENT  TO ZONEPRTY OF WO-ZONE-PRTY.
           READ WO-ZONE-PRTY INTO ZONE-DATA.
           IF FILE-STAT NOT = "00"
      **********************************************************************
      **    MESSAGE 035/044:
      **  INVALID ZONE
      **********************************************************************
               MOVE  35        TO CATREAD-MSG-SET
               MOVE  44        TO CATREAD-MSG-NUM
               PERFORM 999-CATREAD THRU 999-CATREAD-EXIT
               MOVE 6          TO FIELD-NUMBER
               PERFORM 65-ERROR
               GO TO 62-SHOWFORM.

       62-DB-UPDATE.
           MOVE ZONE-FIELD     TO PER-TEMP-ZONE.
           REWRITE PP-REC      FROM WO-PERS-DATA.
           IF FILE-STAT NOT = "00"
               MOVE FILE-STAT  TO CON-WORD
               MOVE "REWRITE " TO DB-FUNC
               MOVE "PER-PERSONNEL" TO DB-FILE
               MOVE DB-ERROR   TO MESSAGE-BUFFER
               PERFORM 65-ERROR
               GO TO 62-SHOWFORM.

           GO TO 6-MAIN.

       65-ERROR.
           MOVE MESSAGE-BUFFER TO ERRMSG.
           MOVE TRUE-VAL       TO IND(FIELD-NUMBER) IND(99).

       999-CATREAD.
           MOVE SPACES         TO MESSAGE-BUFFER.
           CALL "CCATREAD" USING CATREAD-PARMS.
           MOVE CATREAD-MSG-TEXT TO MESSAGE-BUFFER.

       999-CATREAD-EXIT.    EXIT.

