       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCASCII2.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   07/25/88.
       DATE-COMPILED.  07/25/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-S38.
       OBJECT-COMPUTER. IBM-S38.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT INPUT-FILE ASSIGN TO DATABASE-INPUT
                   FILE STATUS IS INPUT-SK.
            SELECT OUTPUT-FILE ASSIGN TO DATABASE-OUTPUT
                   FILE STATUS IS OUTPUT-SK.
            SELECT QADSPFFD-FILE ASSIGN TO DATABASE-QADSPFFD
                   FILE STATUS IS QADSPFFD-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE
           LABEL RECORDS ARE STANDARD.
       01  INPUT-RECORD.
           03  I-BYTE OCCURS 32767 TIMES INDEXED BY INDX-I
                                       PIC X.
       FD  OUTPUT-FILE
           LABEL RECORDS ARE STANDARD.
       01  OUTPUT-RECORD.
           03  O-BYTE OCCURS 32767 TIMES INDEXED BY INDX-O
                                       PIC X.
       FD  QADSPFFD-FILE
           LABEL RECORDS ARE STANDARD.
       01  QADSPFFD-RECORD.
           COPY DDS-ALL-FORMATS OF QADSPFFD.
       WORKING-STORAGE SECTION.
       01  SWITCHES.
           03  SW-ON                   PIC 1 VALUE B"1".
           03  SW-OFF                  PIC 1 VALUE B"0".
           03  TREC-SW                 PIC 1 VALUE B"0".
               88  TRANSLATE-RECORD    VALUE B"1".
               88  TRANSLATE-FIELDS    VALUE B"0".
       01  FIELD.
           03  M-BYTE OCCURS 32767 TIMES INDEXED BY INDX-M
                                       PIC X.
       01  CONSTANTS-N-SAVES.
           03  MAX-TBL                 PIC S9(5) COMP-3 VALUE +256.
           03  MAX-REC                 PIC S9(5) COMP-3 VALUE +32767.
           03  SPOS                    PIC S9(5) COMP-3 VALUE ZERO.
           03  EPOS                    PIC S9(5) COMP-3 VALUE ZERO.
           03  FLDLEN                  PIC S9(5) COMP-3 VALUE ZERO.
           03  TBL                     PIC X(10) VALUE "QEBCDIC".
           03  LIB                     PIC X(10) VALUE "QSYS".
           03  WHRLEN-WS               PIC S9(5) COMP-3 VALUE ZERO.
       01  FILE-STATUS-KEYS.
           03  INPUT-SK                PIC X(2)  VALUE ZERO.
           03  OUTPUT-SK               PIC X(2)  VALUE ZERO.
           03  QADSPFFD-SK             PIC X(2)  VALUE ZERO.
       01  QADSPFFD-TABLE.
           03  QADSPFFD-TBL OCCURS 256 TIMES INDEXED BY INDX-T.
               05  WHFOBO-T                PIC S9(5) COMP-3.
               05  WHFLDB-T                PIC S9(5) COMP-3.
               05  WHFLDT-T                PIC X.
       PROCEDURE DIVISION.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       INPUT-SK NOT = ZERO.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.
       000-INIT.
           OPEN INPUT INPUT-FILE.
           OPEN OUTPUT OUTPUT-FILE.
           MOVE SW-ON  TO TREC-SW.
           MOVE HIGH-VALUES TO QADSPFFD-TABLE.
           OPEN INPUT QADSPFFD-FILE.
           PERFORM 010-LOAD-TABLE THRU 010-EXIT
                   VARYING INDX-T FROM 1 BY 1
                           UNTIL QADSPFFD-SK NOT = ZERO
                                 OR INDX-T > MAX-TBL.
           CLOSE QADSPFFD-FILE.
           PERFORM 900-READ-INPUT THRU 900-EXIT.
       000-EXIT.
           EXIT.

       010-LOAD-TABLE.
           READ QADSPFFD-FILE
                AT END
                     GO TO 010-EXIT.
           MOVE WHFOBO TO WHFOBO-T (INDX-T).
           MOVE WHFLDB TO WHFLDB-T (INDX-T).
           MOVE WHFLDT TO WHFLDT-T (INDX-T).
           MOVE WHRLEN TO WHRLEN-WS.
           IF WHFLDT-T (INDX-T) = "A"
             OR WHFLDT-T (INDX-T) = "S"
              NEXT SENTENCE
           ELSE
              MOVE SW-OFF TO TREC-SW.
       010-EXIT.
           EXIT.

       500-CALL-QDCXLATE.
           CALL "QDCXLATE" USING FLDLEN FIELD TBL LIB.
       500-EXIT.
           EXIT.

       600-MOVE-OUTPUT.
           MOVE M-BYTE (INDX-M) TO O-BYTE (INDX-O).
           IF INDX-O < MAX-REC
              SET INDX-O UP BY 1.
       600-EXIT.
           EXIT.

       700-MOVE-INPUT.
           MOVE I-BYTE (INDX-I) TO M-BYTE (INDX-M).
           IF INDX-M < MAX-REC
              SET INDX-M UP BY 1.
       700-EXIT.
           EXIT.

       800-FFD.
           SET INDX-M TO +1.
           MOVE WHFOBO-T (INDX-T) TO SPOS.
           COMPUTE EPOS = WHFOBO-T (INDX-T) + WHFLDB-T (INDX-T).
           MOVE WHFLDB-T (INDX-T) TO FLDLEN.
           MOVE SPACES            TO FIELD.
           PERFORM 700-MOVE-INPUT THRU 700-EXIT
                   VARYING INDX-I FROM SPOS BY 1
                     UNTIL INDX-I > EPOS.
           IF WHFLDT-T (INDX-T) = "A"
              OR WHFLDT-T (INDX-T) = "S"
               PERFORM 500-CALL-QDCXLATE THRU 500-EXIT.
           PERFORM 600-MOVE-OUTPUT THRU 600-EXIT
                   VARYING INDX-M FROM 1 BY 1
                     UNTIL INDX-M > FLDLEN
                        OR INDX-M > MAX-REC.
       800-EXIT.
           EXIT.

       900-MAIN.
           IF TRANSLATE-FIELDS
              SET INDX-O TO +1
              PERFORM 800-FFD THRU 800-EXIT
                      VARYING INDX-T FROM 1 BY 1
                              UNTIL INDX-T > MAX-TBL
                           OR WHFLDT-T (INDX-T) = HIGH-VALUES
           ELSE
              MOVE WHRLEN-WS    TO FLDLEN
              MOVE INPUT-RECORD TO FIELD
              PERFORM 500-CALL-QDCXLATE THRU 500-EXIT
              MOVE FIELD TO OUTPUT-RECORD.
           WRITE OUTPUT-RECORD.
       900-READ-INPUT.
           READ INPUT-FILE
                AT END
                     GO TO 900-EXIT.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE INPUT-FILE
                 OUTPUT-FILE.
       999-EXIT.
           EXIT.
