       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCCVCF.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
      *
      *  COPY COPY FILE TO SOURCE MEMBER
      *
       DATE-WRITTEN.   08/11/86.
       DATE-COMPILED.  08/11/86.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT CPYSRC-FILE ASSIGN TO DATABASE-CPYSRC
                   ORGANIZATION IS SEQUENTIAL
                   ACCESS IS SEQUENTIAL
                   FILE STATUS IS CPYSRC-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  CPYSRC-FILE
           LABEL RECORDS ARE STANDARD.
       01  CPYSRC-RECORD.
           03  FILLER                  PIC X(11).
           03  FILLER                  PIC X.
               88  COPY-P1             VALUE ".".
           03  FILLER                  PIC X.
               88  COPY-P2             VALUE ".".
           03  FILLER                  PIC X(59).
           03  COPY-MBR                PIC X(8).
       WORKING-STORAGE SECTION.
       01  SAVE-AREA.
           03  FROMRCD                 PIC 9(7)  VALUE ZERO.
           03  TORCD                   PIC 9(7)  VALUE ZERO.
           03  RECNO                   PIC 9(7)  VALUE ZERO.
           03  MBR                     PIC X(10).
           03  MBR-WS                  PIC X(10).
       01  FILE-STATUS-KEYS.
           03  CPYSRC-SK                PIC X(2)  VALUE ZERO.
       PROCEDURE DIVISION.
       A-BEGIN.
           PERFORM 000-INITIALIZE THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       CPYSRC-SK NOT = ZERO.
       Z-END.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INITIALIZE.
           OPEN INPUT CPYSRC-FILE.
           MOVE ZERO TO RECNO.
           PERFORM 010-READ-CPYSRC THRU 010-EXIT.
       000-EXIT.
           EXIT.

       010-READ-CPYSRC.
           READ CPYSRC-FILE
                AT END
                     GO TO 010-EXIT.
           ADD +1 TO RECNO.
       010-EXIT.
           EXIT.

       900-MAIN.
           IF COPY-P1  OR  COPY-P2
              COMPUTE FROMRCD = RECNO + 1
           ELSE
              MOVE RECNO TO FROMRCD.
           MOVE COPY-MBR TO MBR
                            MBR-WS.
           INSPECT MBR-WS REPLACING ALL "-" BY "@".
           PERFORM 010-READ-CPYSRC THRU 010-EXIT
                   UNTIL
                       CPYSRC-SK NOT = ZERO
                    OR MBR NOT = COPY-MBR
                      AND COPY-MBR NOT = SPACES.
           IF CPYSRC-SK = ZERO
              COMPUTE TORCD = RECNO - 1
           ELSE
              MOVE RECNO TO TORCD.
           CALL "UTXCVCF2" USING MBR-WS FROMRCD TORCD.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE CPYSRC-FILE.
       999-EXIT.
           EXIT.
