       IDENTIFICATION DIVISION.
       PROGRAM-ID.          UTCENABSYS.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        1/09/91.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *REMARKS.   ENABLE A SYSTEM IN GLOBAL MENU SYSTEM.
      *
      *    THIS IS A SIMPLE CL PROGRAM THAT ALLOWS ANY SYSTEM IN THE
      *    GLOBAL MENU SYSTEM TO BE ENABLED OR DISABLED FROM A BATCH
      *    JOB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN IN COPYCSIS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      * 3  *** SYSTEM IDENTIFICATION ***
           SELECT UTFLMSI1-A
                  ASSIGN TO DATABASE-UTFLMSI1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

018500 DATA DIVISION.
018600 FILE SECTION.
018700
      *--- 3
       FD  UTFLMSI1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMSI1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMSI1.

       FD  UTFLMSI1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMSI1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMSI1.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       LINKAGE SECTION.
       01  SYSTEM-NAME          PIC X(10).
       01  ENABLE-DISABLE-FLAG  PIC X(7).

       PROCEDURE DIVISION USING SYSTEM-NAME, ENABLE-DISABLE-FLAG.
       6000-MAIN.
           OPEN INPUT UTFLMSI1-A.
           MOVE SYSTEM-NAME    TO UTFLMSI1-A-REC.
           READ UTFLMSI1-A INVALID-KEY
               MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS NOT = "00"
               DISPLAY "*** UTCENABSYS BAD READ OF SYSTEM ",
                 SYSTEM-NAME, " FILE STATUS ", FILE-STATUS, " ***"
           ELSE
           IF ENABLE-DISABLE-FLAG = "ENABLE"
               IF SIACTF = "Y"
                   DISPLAY "*** SYSTEM ", SYSTEM-NAME,
                     " ALREADY ENABLED ***"
               ELSE
                   REWRITE UTFLMSI1-A-REC INVALID-KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                   END-REWRITE
                   IF FILE-STATUS NOT = "00"
                       DISPLAY "*** UTCENABSYS REWRITE ERROR OF SYS ",
                         SYSTEM-NAME, " FILE STATUS ", FILE-STATUS,
                         ", ENABLE FAILED ***"
                   ELSE
                       DISPLAY "*** SYSTEM ", SYSTEM-NAME,
                         " ENABLED SUCCESSFULLY ***"
           ELSE
           IF ENABLE-DISABLE-FLAG = "DISABLE "
               IF SIACTF = "N"
                   DISPLAY "*** SYSTEM ", SYSTEM-NAME,
                     " ALREADY DISABLED ***"
               ELSE
                   REWRITE UTFLMSI1-A-REC INVALID-KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                   END-REWRITE
                   IF FILE-STATUS NOT = "00"
                       DISPLAY "*** UTCENABSYS REWRITE ERROR OF SYS ",
                         SYSTEM-NAME, " FILE STATUS ", FILE-STATUS,
                         ", DISABLE FAILED ***"
                   ELSE
                       DISPLAY "*** SYSTEM ", SYSTEM-NAME,
                         " ENABLED SUCCESSFULLY ***"
           ELSE
               DISPLAY "*** ENABLE/DISABLE FLAG MUST BE ",
                 " 'ENABLE' OR 'DISABLE' (2CD PARM)".

           CLOSE UTFLMSI1-A.
       6990-MAIN-X.
           GOBACK.

