       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCSCHEMA5.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   11/11/88.
       DATE-COMPILED.  11/11/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-S38.
       OBJECT-COMPUTER. IBM-S38.
       SPECIAL-NAMES. I-O-FEEDBACK IS IO-FEEDBACK.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDS-FILE ASSIGN TO DATABASE-UTFPHPDS
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDS-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDS-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDS.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  UTFPHPDS-SK             PIC X(2)  VALUE ZERO.
       01  UTXSCHEMA2-PARMS.
           03  DSSET-WS                PIC X(16).
           03  DSSSET-WS               PIC X(10).
           03  DSCAP-WS                PIC S9(7) COMP-3 VALUE ZERO.
       LINKAGE SECTION.
       01  TSF-LS                      PIC X(10).
       01  TSL-LS                      PIC X(10).
       01  TSM-LS                      PIC X(10).
       01  FILE-PFX-LS                 PIC X(2).
       01  DB-PFX-LS                   PIC X(2).
       01  CRTOBJ-LS                   PIC X(4).
       PROCEDURE DIVISION USING TSF-LS TSL-LS TSM-LS FILE-PFX-LS
                                DB-PFX-LS CRTOBJ-LS.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       UTFPHPDS-SK NOT = ZERO
                    OR TSM-LS NOT = DSNAME.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INIT.
           OPEN INPUT  UTFPHPDS-FILE.
           MOVE TSM-LS TO DSNAME.
           MOVE SPACES TO DSSET.
           START UTFPHPDS-FILE KEY > EXTERNALLY-DESCRIBED-KEY.
           IF UTFPHPDS-SK = ZERO
              PERFORM 900-READ-UTFPHPDS THRU 900-EXIT.
       000-EXIT.
           EXIT.

       900-MAIN.
           MOVE DSSET  TO DSSET-WS.
           MOVE DSSSET TO DSSSET-WS.
           MOVE DSCAP  TO DSCAP-WS.
           CALL "UTXSCHEMA2" USING TSF-LS
                                   TSL-LS
                                   TSM-LS
                                   FILE-PFX-LS
                                   DB-PFX-LS
                                   CRTOBJ-LS
                                   DSSET-WS
                                   DSSSET-WS
                                   DSCAP-WS.
       900-READ-UTFPHPDS.
           READ UTFPHPDS-FILE NEXT RECORD
                AT END
                     GO TO 900-EXIT.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE UTFPHPDS-FILE.
       999-EXIT.
           EXIT.
