       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCSHARE2.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   12/06/88.
       DATE-COMPILED.  12/06/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. AS400.
       OBJECT-COMPUTER. AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDI-FILE ASSIGN TO DATABASE-UTFPHPDI
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDI-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDI-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDI-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDI.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  UTFPHPDI-SK             PIC X(2)  VALUE ZERO.
       01  QCMDEXC-PARMS.
           03  CMD-WS                  PIC X(40)
               VALUE "DSPRCDLCK FILE(*LIBL/UTFPHPDI)".
           03  CMD-LEN              PIC S9(10)V9(5) COMP-3 VALUE +40.
       PROCEDURE DIVISION.
       A-BEGIN.
           OPEN I-O    UTFPHPDI-FILE.
           DISPLAY "OPEN I-O SHARE2".
           READ UTFPHPDI-FILE FIRST RECORD.
           CALL "QCMDEXC" USING CMD-WS CMD-LEN.
           CLOSE UTFPHPDI-FILE.

           OPEN INPUT  UTFPHPDI-FILE.
           DISPLAY "OPEN INPUT SHARE2"
           READ UTFPHPDI-FILE FIRST RECORD.
           CALL "QCMDEXC" USING CMD-WS CMD-LEN.
           CLOSE UTFPHPDI-FILE.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

