       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCSCHEMA1.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   08/08/88.
       DATE-COMPILED.  08/08/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-S38.
       OBJECT-COMPUTER. IBM-S38.
       SPECIAL-NAMES. I-O-FEEDBACK IS IO-FEEDBACK.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDI-FILE ASSIGN TO DATABASE-UTFPHPDI
                   ORGANIZATION IS INDEXED
                   ACCESS IS SEQUENTIAL
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDI-SK.
            SELECT SOURCE-FILE   ASSIGN TO DATABASE-SOURCE
                   FILE STATUS IS SOURCE-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDI-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDI-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDI.
       FD  SOURCE-FILE
           LABEL RECORDS ARE STANDARD.
       01  SOURCE-RECORD.
           COPY DDS-ALL-FORMATS OF QDDSSRC.
       01  SOURCE-RECORD-RDF.
           05  FILLER                    PIC X(12).
           05  SEQUENCE-NO               PIC X(5).
           05  FORM-TYPE                 PIC X(1).
           05  COMMENT-INDICATOR         PIC X(1).
           05  CONDITIONING              PIC X(9).
           05  NAME-TYPE                 PIC X(1).
           05  FILLER                    PIC X(1).
           05  FLD-NAME                  PIC X(10).
           05  FLD-REFERENCE             PIC X(1).
           05  FLD-LENGTH                PIC ZZZZ9.
           05  FLD-DATA-TYPE             PIC X(1).
           05  FLD-DEC-POS               PIC ZZ.
           05  FLD-USAGE                 PIC X(1).
           05  FLD-LOC.
               10  FLD-LINE              PIC S9(3).
               10  FLD-POS               PIC S9(3).
           05  FLD-FUNCTION              PIC X(36).
       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  SOURCE-SK                 PIC X(2)  VALUE ZERO.
           03  UTFPHPDI-SK               PIC X(2)  VALUE ZERO.
       01  SRCSEQ-WS                     PIC S9(4)V9(2) VALUE ZERO.
       01  DICNT-WS                      PIC S999       VALUE ZERO.
       01  DISITM-WS.
           03  FILLER                    PIC X(4).
           03  DISITM-CNT-WS             PIC S9(2)      VALUE ZERO.
       LINKAGE SECTION.
       01  DBNAME-LS                   PIC X(10).
       01  FILE-PFX-LS                 PIC X(2).
       01  DB-PFX-LS                   PIC X(2).
       PROCEDURE DIVISION USING DBNAME-LS FILE-PFX-LS DB-PFX-LS.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       UTFPHPDI-SK NOT = ZERO
                    OR DBNAME-LS NOT = DINAME.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INIT.
           OPEN INPUT  UTFPHPDI-FILE
           OPEN OUTPUT SOURCE-FILE.
           MOVE DBNAME-LS TO DINAME.
           MOVE SPACES    TO DIITEM.
           START UTFPHPDI-FILE KEY > EXTERNALLY-DESCRIBED-KEY.
           IF UTFPHPDI-SK = ZERO
              PERFORM 900-READ-SCHEMA THRU 900-EXIT
              MOVE +1     TO SRCSEQ-WS
              PERFORM 600-INIT-SOURCE THRU 600-EXIT
              MOVE "R"    TO NAME-TYPE
              STRING "R"    DELIMITED BY SIZE
                     DINAME DELIMITED BY SPACES
                INTO FLD-NAME
              WRITE SOURCE-RECORD.
       000-EXIT.
           EXIT.

       600-INIT-SOURCE.
           ADD  +1     TO SRCSEQ-WS.
           MOVE SRCSEQ-WS TO SRCSEQ.
           MOVE ZERO   TO SRCDAT.
           MOVE SPACES TO SRCDTA.
           MOVE "A"    TO FORM-TYPE.
       600-EXIT.
           EXIT.

       700-ITEM.
           IF DITYPE = "P"
              MOVE "P" TO FLD-DATA-TYPE
              COMPUTE FLD-LENGTH = DILEN - 1
           ELSE
           IF DITYPE = "J" OR "I"
              MOVE "B" TO FLD-DATA-TYPE
              IF DILEN = 1
                 MOVE +4  TO FLD-LENGTH
              ELSE
              IF DILEN = 2
                 MOVE +9  TO FLD-LENGTH
              ELSE
                 MOVE +18 TO FLD-LENGTH
           ELSE
           IF DITYPE = "Z"
              MOVE "S"   TO FLD-DATA-TYPE
              MOVE DILEN TO FLD-LENGTH
           ELSE
              MOVE "A" TO FLD-DATA-TYPE
              MOVE DILEN TO FLD-LENGTH.
           INSPECT FLD-FUNCTION REPLACING ALL "-" BY "_".
           MOVE ZERO TO FLD-DEC-POS.
           WRITE SOURCE-RECORD.
       700-EXIT.
           EXIT.

       800-ITEMS.
            PERFORM 600-INIT-SOURCE THRU 600-EXIT.
            MOVE DISITM    TO DISITM-WS.
            MOVE DICNT-WS  TO DISITM-CNT-WS.
            MOVE DISITM-WS TO FLD-NAME.
            STRING "ALIAS("  DELIMITED BY SIZE
                   DIITEM    DELIMITED BY SPACES
                   "-"       DELIMITED BY SIZE
                   DISITM-CNT-WS DELIMITED BY SIZE
                   ")"       DELIMITED BY SIZE
              INTO FLD-FUNCTION.
           PERFORM 700-ITEM THRU 700-EXIT.
       800-EXIT.
           EXIT.

       900-MAIN.
           IF DICNT = 1
              PERFORM 600-INIT-SOURCE THRU 600-EXIT
              MOVE DISITM TO FLD-NAME
              STRING "ALIAS("  DELIMITED BY SIZE
                     DIITEM    DELIMITED BY SPACES
                     "_"       DELIMITED BY SIZE
                     DB-PFX-LS DELIMITED BY SIZE
                     ")"       DELIMITED BY SIZE
                INTO FLD-FUNCTION
              PERFORM 700-ITEM THRU 700-EXIT
           ELSE
              PERFORM 800-ITEMS THRU 800-EXIT
                      VARYING DICNT-WS FROM 1 BY 1
                        UNTIL DICNT-WS > DICNT
                           OR DICNT-WS > 99.
       900-READ-SCHEMA.
           READ UTFPHPDI-FILE NEXT RECORD
                AT END
                     GO TO 900-EXIT.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE SOURCE-FILE
                 UTFPHPDI-FILE.
       999-EXIT.
           EXIT.
