       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCSCHEMA2.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   08/08/88.
       DATE-COMPILED.  08/08/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-S38.
       OBJECT-COMPUTER. IBM-S38.
       SPECIAL-NAMES. I-O-FEEDBACK IS IO-FEEDBACK.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDI-FILE ASSIGN TO DATABASE-UTFPHPDI
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDI-SK.
            SELECT UTFPHPDE-FILE ASSIGN TO DATABASE-UTFPHPDE
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDE-SK.
            SELECT SOURCE-FILE   ASSIGN TO DATABASE-SOURCE
                   FILE STATUS IS SOURCE-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDI-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDI-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDI.
       FD  UTFPHPDE-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDE-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDE.
       FD  SOURCE-FILE
           LABEL RECORDS ARE STANDARD.
       01  SOURCE-RECORD.
           COPY DDS-ALL-FORMATS OF QDDSSRC.
       01  SOURCE-RECORD-RDF.
           05  FILLER                    PIC X(12).
           05  SEQUENCE-NO               PIC X(5).
           05  FORM-TYPE                 PIC X(1).
           05  COMMENT-INDICATOR         PIC X(1).
           05  CONDITIONING              PIC X(9).
           05  NAME-TYPE                 PIC X(1).
           05  FILLER                    PIC X(1).
           05  FLD-NAME                  PIC X(10).
           05  FILLER REDEFINES FLD-NAME.
               10  FILLER                PIC X(2).
               10  FLD-NAME-R            PIC X.
               10  FILLER                PIC X(7).
           05  FLD-REFERENCE             PIC X(1).
           05  FLD-LENGTH                PIC ZZZZ9.
           05  FLD-DATA-TYPE             PIC X(1).
           05  FLD-DEC-POS               PIC ZZ.
           05  FLD-USAGE                 PIC X(1).
           05  FLD-LOC.
               10  FLD-LINE              PIC S9(3).
               10  FLD-POS               PIC S9(3).
           05  FLD-FUNCTION              PIC X(36).
       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  SOURCE-SK               PIC X(2)  VALUE ZERO.
           03  UTFPHPDI-SK             PIC X(2)  VALUE ZERO.
           03  UTFPHPDE-SK             PIC X(2)  VALUE ZERO.
       01  SRCSEQ-WS                     PIC S9(4)V9(2) VALUE ZERO.
       01  DICNT-WS                      PIC S999       VALUE ZERO.
       01  DISITM-WS.
           03  FILLER                    PIC X(5).
           03  DISITM-CNT-WS             PIC S9(2)      VALUE ZERO.
       LINKAGE SECTION.
       01  DSNAME                      PIC X(6).
       01  DSSET                       PIC X(16).
       01  DSSSET                      PIC X(10).
       PROCEDURE DIVISION USING DSNAME DSSET DSSSET.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       DSNAME NOT = DENAME
                    OR DSSET  NOT = DESET
                    OR UTFPHPDE-SK NOT = ZERO.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INIT.
           OPEN INPUT  UTFPHPDI-FILE
                       UTFPHPDE-FILE.
           OPEN OUTPUT SOURCE-FILE.
           MOVE DSNAME TO DENAME.
           MOVE DSSET  TO DESET.
           MOVE ZERO   TO DESEQ.
           START UTFPHPDE-FILE KEY > EXTERNALLY-DESCRIBED-KEY.
           IF UTFPHPDE-SK = ZERO
              PERFORM 900-READ-UTFPHPDE THRU 900-EXIT
              IF UTFPHPDE-SK = ZERO
                 NEXT SENTENCE
              ELSE
                 GO TO 000-EXIT
           ELSE
              GO TO 000-EXIT.
           MOVE ZERO   TO SRCSEQ-WS.
           PERFORM 600-INIT-SOURCE THRU 600-EXIT.
           STRING "REF("  DELIMITED BY SIZE
                  DSNAME  DELIMITED BY SPACES
                  ")"     DELIMITED BY SIZE
             INTO FLD-FUNCTION.
           WRITE SOURCE-RECORD.
           PERFORM 600-INIT-SOURCE THRU 600-EXIT.
           MOVE DSSSET    TO FLD-NAME.
           MOVE "R"       TO NAME-TYPE
                             FLD-NAME-R.
           WRITE SOURCE-RECORD.
       000-EXIT.
           EXIT.

       600-INIT-SOURCE.
           ADD  +1     TO SRCSEQ-WS.
           MOVE SRCSEQ-WS TO SRCSEQ.
           MOVE ZERO   TO SRCDAT.
           MOVE SPACES TO SRCDTA.
           MOVE "A"    TO FORM-TYPE.
       600-EXIT.
           EXIT.

       700-ITEM.
           MOVE "R"       TO FLD-REFERENCE.
           WRITE SOURCE-RECORD.
       700-EXIT.
           EXIT.

       800-ITEMS.
           PERFORM 600-INIT-SOURCE THRU 600-EXIT.
           MOVE DISITM    TO DISITM-WS.
           MOVE DICNT-WS  TO DISITM-CNT-WS.
           MOVE DISITM-WS TO FLD-NAME.
           PERFORM 700-ITEM THRU 700-EXIT.
       800-EXIT.
           EXIT.


       900-MAIN.
           MOVE DENAME TO DINAME.
           MOVE DEITEM TO DIITEM.
           READ UTFPHPDI-FILE.
           IF UTFPHPDI-SK = ZERO
              NEXT SENTENCE
           ELSE
              GO TO 900-READ-UTFPHPDE.
           IF DICNT = 1
              PERFORM 600-INIT-SOURCE THRU 600-EXIT
              MOVE DISITM    TO FLD-NAME
              PERFORM 700-ITEM THRU 700-EXIT
           ELSE
              PERFORM 800-ITEMS THRU 800-EXIT
                      VARYING DICNT-WS FROM 1 BY 1
                        UNTIL DICNT-WS > DICNT
                           OR DICNT-WS > 99.
       900-READ-UTFPHPDE.
           READ UTFPHPDE-FILE NEXT RECORD.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE SOURCE-FILE
                 UTFPHPDI-FILE
                 UTFPHPDE-FILE.
       999-EXIT.
           EXIT.
