       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCSCHEMA3.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   08/08/88.
       DATE-COMPILED.  08/08/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-S38.
       OBJECT-COMPUTER. IBM-S38.
       SPECIAL-NAMES. I-O-FEEDBACK IS IO-FEEDBACK.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDI-FILE ASSIGN TO DATABASE-UTFPHPDI
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDI-SK.
            SELECT UTFPHPDS-FILE ASSIGN TO DATABASE-UTFPHPDS
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDI-SK.
            SELECT UTFPHPDE-FILE ASSIGN TO DATABASE-UTFPHPDE
                   ORGANIZATION IS INDEXED
                   ACCESS IS SEQUENTIAL
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDE-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDI-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDI-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDI.
       FD  UTFPHPDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDS-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDS.
       FD  UTFPHPDE-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDE-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDE.
       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  UTFPHPDI-SK             PIC X(2)  VALUE ZERO.
           03  UTFPHPDS-SK             PIC X(2)  VALUE ZERO.
           03  UTFPHPDE-SK             PIC X(2)  VALUE ZERO.
       01  UTXSCHEMA4-PARMS.
           03  DSSSET-WS               PIC X(10).
           03  DSLSET-WS.
               05  FILLER              PIC X(3).
               05  DSLSET-LIT-WS       PIC X.
               05  FILLER              PIC X(3).
               05  DSLSET-CTR-WS       PIC S9.
               05  FILLER              PIC X(2).
           03  DSTYPE-WS               PIC X.
           03  DISITM-K1-WS            PIC X(10).
           03  DISITM-K2-WS            PIC X(10).
           03  DSSET-WS                PIC X(16).
       LINKAGE SECTION.
       01  TSF-LS                      PIC X(10).
       01  TSL-LS                      PIC X(10).
       01  TSM-LS                      PIC X(10).
       01  FILE-PFX-LS                 PIC X(2).
       01  DB-PFX-LS                   PIC X(2).
       01  CRTOBJ-LS                   PIC X(4).
       PROCEDURE DIVISION USING TSF-LS TSL-LS TSM-LS FILE-PFX-LS
                                DB-PFX-LS CRTOBJ-LS.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT
                   UNTIL
                       UTFPHPDE-SK NOT = ZERO
                    OR TSM-LS NOT = DENAME.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INIT.
           OPEN INPUT  UTFPHPDI-FILE
                       UTFPHPDS-FILE
                       UTFPHPDE-FILE.
           MOVE LOW-VALUES TO DSSET-WS.
           MOVE TSM-LS TO DENAME.
           MOVE SPACES TO DESET.
           MOVE ZERO   TO DESEQ.
           START UTFPHPDE-FILE KEY > EXTERNALLY-DESCRIBED-KEY.
           IF UTFPHPDE-SK = ZERO
              PERFORM 900-READ-UTFPHPDE THRU 900-EXIT.
       000-EXIT.
           EXIT.

       900-MAIN.
           IF DEKEYF = "Y"
              NEXT SENTENCE
           ELSE
              GO TO 900-READ-UTFPHPDE.
           MOVE DENAME TO DSNAME.
           MOVE DESET  TO DSSET.
           READ UTFPHPDS-FILE.
           IF UTFPHPDS-SK = ZERO
              NEXT SENTENCE
           ELSE
              GO TO 900-READ-UTFPHPDE.
           IF DSSET NOT = DSSET-WS
              MOVE DSSSET TO DSLSET-WS
                             DSSSET-WS
              MOVE DSSET  TO DSSET-WS
              MOVE DSTYPE TO DSTYPE-WS
              MOVE "L"    TO DSLSET-LIT-WS.
           IF DSTYPE-WS = "D"
              ADD +1 TO DSLSET-CTR-WS.
           MOVE DENAME TO DINAME.
           MOVE DEITEM TO DIITEM.
           READ UTFPHPDI-FILE.
           IF UTFPHPDI-SK = ZERO
              MOVE DISITM TO DISITM-K1-WS
           ELSE
              GO TO 900-READ-UTFPHPDE.
           IF DSTYPE = "D"
             AND DESORT NOT = SPACES
              MOVE DENAME TO DINAME
              MOVE DESORT TO DIITEM
              READ UTFPHPDI-FILE
              IF UTFPHPDI-SK = ZERO
                 MOVE DISITM TO DISITM-K2-WS
              ELSE
                 GO TO 900-READ-UTFPHPDE
           ELSE
              MOVE SPACES TO DISITM-K2-WS.
           CALL "UTXSCHEMA4" USING TSF-LS
                                   TSL-LS
                                   DSSSET-WS
                                   DSLSET-WS
                                   DSTYPE-WS
                                   DISITM-K1-WS
                                   DISITM-K2-WS
                                   DSSET-WS
                                   CRTOBJ-LS.
       900-READ-UTFPHPDE.
           READ UTFPHPDE-FILE NEXT RECORD
                AT END
                     GO TO 900-EXIT.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE UTFPHPDI-FILE
                 UTFPHPDS-FILE
                 UTFPHPDE-FILE.
       999-EXIT.
           EXIT.
