       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTCCTDB.
       AUTHOR.     W. H. JENKINS.
       INSTALLATION.  GOODYEAR TIRE & RUBBER CO.
       DATE-WRITTEN.   11/08/88.
       DATE-COMPILED.  11/08/88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-AS400.
       OBJECT-COMPUTER. IBM-AS400.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT UTFPHPDS-FILE ASSIGN TO DATABASE-UTFPHPDS
                   ORGANIZATION IS INDEXED
                   ACCESS IS DYNAMIC
                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                   FILE STATUS IS UTFPHPDS-SK.
       DATA DIVISION.
       FILE SECTION.
       FD  UTFPHPDS-FILE
           LABEL RECORDS ARE STANDARD.
       01  UTRPHPDS-RECORD.
           COPY DDS-ALL-FORMATS OF UTFPHPDS.

       WORKING-STORAGE SECTION.
       01  FILE-STATUS-KEYS.
           03  UTFPHPDS-SK             PIC X(2)  VALUE ZERO.
       LINKAGE SECTION.
       01  CTNAME-LS                   PIC X(6).
       01  CTSET-LS                    PIC X(16).
       01  DSSSET-LS                   PIC X(10).
       PROCEDURE DIVISION USING CTNAME-LS CTSET-LS DSSSET-LS.
       A-BEGIN.
           PERFORM 000-INIT THRU 000-EXIT.
           PERFORM 900-MAIN THRU 900-EXIT.
           PERFORM 999-EOJ THRU 999-EXIT.
       COBOL-EXIT.
           EXIT PROGRAM.
       RPG-CL-EXIT.
           STOP RUN.

       000-INIT.
           OPEN INPUT UTFPHPDS-FILE.
       000-EXIT.
           EXIT.

       900-MAIN.
           MOVE CTNAME-LS TO DSNAME.
           MOVE CTSET-LS  TO DSSET.
           READ UTFPHPDS-FILE.
           IF UTFPHPDS-SK = ZERO
              MOVE DSSSET TO DSSSET-LS
           ELSE
              MOVE SPACES TO DSSSET-LS.
       900-EXIT.
           EXIT.

       999-EOJ.
           CLOSE UTFPHPDS-FILE.
       999-EXIT.
           EXIT.
