       IDENTIFICATION DIVISION.
       PROGRAM-ID.          UTCUPMENU.
       AUTHOR.              C HILLES.
       DATE-WRITTEN.        4/20/90.
       DATE-COMPILED.
      *INSTALLATION.        GOODYEAR TIRE AND RUBBER - AKRON.
      *REMARKS.   UPDATE GLOBAL MENU SYSTEM WITH NEW SYSTEM RELEASE.
      *
      *    THIS PROGRAM UPDATES THE GLOBAL MENU SYSTEM FILES WITH
      *    NEW AND/OR CHANGED TRANSACTIONS FOR A NEW SYSTEM RELEASE.
      *    THE NEW MENU SYSTEM FILES ARE KEPT IN THE APPLICATION'S
      *    LIBRARY (SAY, 'MCPRD' FOR CSIS/MMIS), AND RESTORED FROM
      *    TAPE.  THEN ANY NEW TRANSACTIONS ARE ADDED FROM THE
      *    APPLICATION'S LIBRARY TO THE MENU SYSTEM LIBRARY (UTPRD).
      *    THEN, THE MENU SYSTEM FILES SHOULD BE DELETED FROM THE
      *    APPLICATION'S LIBRARY.
      *
      *    THIS PROGRAM CAN ALSO BE USED TO CREATE A DUPLICATE
      *    APPLICATION FOR USE IN MULTIPLE DATABASE SITUATIONS.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       COPY SPECIALN IN COPYLIB.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ONLINE-PRT ASSIGN TO PRINTER-MCPRT.

      * 1  *** MENU DESCRIPTIONS ***
           SELECT UTFLMDS1-A
                  ASSIGN TO DATABASE-UTFLMDS1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMDS1-B
                  ASSIGN TO DATABASE-UTFLMDS1B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 2  *** MENU DEFINITIONS ***
           SELECT UTFLMMD1-A
                  ASSIGN TO DATABASE-UTFLMMD1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMMD1-B
                  ASSIGN TO DATABASE-UTFLMMD1B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 3  *** SYSTEM IDENTIFICATION ***
           SELECT UTFLMSI1-A
                  ASSIGN TO DATABASE-UTFLMSI1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMSI1-B
                  ASSIGN TO DATABASE-UTFLMSI1B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 4  *** TRANSACTION FILE ***
           SELECT UTFLMTR1-A
                  ASSIGN TO DATABASE-UTFLMTR1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMTR1-B
                  ASSIGN TO DATABASE-UTFLMTR1B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 5  *** USER-MENU AUTHORITY ***
           SELECT UTFLMUM2-A
                  ASSIGN TO DATABASE-UTFLMUM2A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMUM2-B
                  ASSIGN TO DATABASE-UTFLMUM2B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 6  *** USER PROFILE DEFINITION ***
           SELECT UTFLMUP1-A
                  ASSIGN TO DATABASE-UTFLMUP1A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMUP1-B
                  ASSIGN TO DATABASE-UTFLMUP1B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 7  *** USER-SYSTEM AUTHORITY ***
           SELECT UTFLMUS2-A
                  ASSIGN TO DATABASE-UTFLMUS2A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMUS2-B
                  ASSIGN TO DATABASE-UTFLMUS2B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      * 8  *** USER-TRANSACTION AUTHORITY ***
           SELECT UTFLMUT2-A
                  ASSIGN TO DATABASE-UTFLMUT2A
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT UTFLMUT2-B
                  ASSIGN TO DATABASE-UTFLMUT2B
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

      **************************************************************

           SELECT UTFLMMM1
                  ASSIGN TO DATABASE-UTFLMMM1
                  ORGANIZATION IS INDEXED
                    ACCESS MODE IS DYNAMIC
                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
                  FILE STATUS IS FILE-STATUS.

           SELECT DISPLAY-FILE
                  ASSIGN TO WORKSTATION-UTFDUPMENU-SI
                  ORGANIZATION IS TRANSACTION
                  ACCESS IS SEQUENTIAL
                  FILE STATUS IS DISPLAY-STATUS
                  CONTROL-AREA IS WS-CONTROL.

018500 DATA DIVISION.
018600 FILE SECTION.
018700
018800 FD  ONLINE-PRT
018900     LABEL RECORDS ARE OMITTED
019000     RECORD CONTAINS 132 CHARACTERS
019100     DATA RECORD IS PRINT-RCD.
019200 01  PRINT-RCD.
019300     05  PRINT-LINE           PIC X(132).
019400
      *--- 1
       FD  UTFLMDS1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMDS1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMDS1.

       FD  UTFLMDS1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMDS1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMDS1.

      *--- 2
       FD  UTFLMMD1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMMD1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMMD1.

       FD  UTFLMMD1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMMD1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMMD1.

      *--- 3
       FD  UTFLMSI1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMSI1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMSI1.

       FD  UTFLMSI1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMSI1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMSI1.

      *--- 4
       FD  UTFLMTR1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMTR1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMTR1.

       FD  UTFLMTR1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMTR1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMTR1.

      *--- 5
       FD  UTFLMUM2-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUM2-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUM2.

       FD  UTFLMUM2-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUM2-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUM2.

      *--- 6
       FD  UTFLMUP1-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUP1-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUP1.

       FD  UTFLMUP1-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUP1-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUP1.

      *--- 7
       FD  UTFLMUS2-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUS2-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUS2.

       FD  UTFLMUS2-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUS2-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUS2.

      *--- 8
       FD  UTFLMUT2-A
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUT2-A-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUT2.

       FD  UTFLMUT2-B
           LABEL RECORDS ARE STANDARD.
       01  UTFLMUT2-B-REC.
           COPY DDS-ALL-FORMATS OF UTFLMUT2.

      *------ MENU MANAGER FILE
       FD  UTFLMMM1
           LABEL RECORDS ARE STANDARD.
       01  UTFLMMM1-REC.
           COPY DDS-ALL-FORMATS OF UTFLMMM1.

       FD  DISPLAY-FILE
           LABEL RECORDS ARE OMITTED.
       01  DISPLAY-REC.
           COPY DDS-MCFDUPMEN1-I OF UTFDUPMENU.

       WORKING-STORAGE SECTION.

       01  FILES-OPENED-FLAG            PIC X(1).
       01  END-OF-FILE                  PIC X(1).
       01  FILE-STATUS.
           05  FILE-STATUS-1            PIC X  VALUE "0".
           05  FILE-STATUS-2            PIC X  VALUE "0".

       01  WORK-LINE                    PIC X(80) VALUE SPACES.
       01  SRF-INDICATORS.
           05  IND OCCURS 99 TIMES PIC 1 INDICATOR 01.

      *************************************************************
      **                                                          **
      **          S U B P R O G R A M   A R E A S                 **
      **                                                          **
      **************************************************************

       COPY IOFEEDBACK IN COPYLIB.
       COPY DISPDAT2   IN COPYLIB.
       COPY COMMAND    IN COPYLIB.


       PROCEDURE DIVISION.
       0000-START.
           PERFORM 1000-HOUSEKEEPING
           PERFORM 6000-MAIN THRU 6990-MAIN-X.
           PERFORM 2000-EOJ
           GOBACK.

       1000-HOUSEKEEPING.
           OPEN I-O DISPLAY-FILE.
           MOVE "N" TO FILES-OPENED-FLAG.

       2000-EOJ.
           CLOSE DISPLAY-FILE.
           IF FILES-OPENED-FLAG = "Y"
               CLOSE UTFLMDS1-A
               CLOSE UTFLMDS1-B
               CLOSE UTFLMMD1-A
               CLOSE UTFLMMD1-B
               CLOSE UTFLMSI1-A
               CLOSE UTFLMSI1-B
               CLOSE UTFLMTR1-A
               CLOSE UTFLMTR1-B
               CLOSE UTFLMUM2-A
               CLOSE UTFLMUM2-B
               CLOSE UTFLMUP1-A
               CLOSE UTFLMUP1-B
               CLOSE UTFLMUS2-A
               CLOSE UTFLMUS2-B
               CLOSE UTFLMUT2-A
               CLOSE UTFLMUT2-B.

           MOVE "DLTOVR FILE(UTFLMDS1A UTFLMDS1B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMMD1A UTFLMMD1B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMSI1A UTFLMSI1B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMTR1A UTFLMTR1B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMUM2A UTFLMUM2B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMUP1A UTFLMUP1B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMUS2A UTFLMUS2B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
           MOVE "DLTOVR FILE(UTFLMUT2A UTFLMUT2B)" TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

       6000-MAIN.
           MOVE "MCFDUPMEN1" TO FORMAT-NAME.
       6010-SHOWFORM.
           WRITE DISPLAY-REC FORMAT IS FORMAT-NAME
               INDIC ARE SRF-INDICATORS.
           MOVE ALL B"0" TO SRF-INDICATORS.
           READ DISPLAY-FILE FORMAT IS FORMAT-NAME
               INDIC ARE SRF-INDICATORS.
           ACCEPT IOFEEDBACK FROM I-O-FEEDBACK-AREA.
           MOVE ALL B"0" TO SRF-INDICATORS.
           IF FUNCTION-NUM = 3
               GO TO 6990-MAIN-X.

      *------ IF USER WANTS TO, CREATE ALL THE GLOBAL MENU SYSTEM
      *------ FILE IN THE DESTINATION LIBRARY.
           IF CREATEFIL = "Y"
               CALL "UTXCRTMENF" USING DESTLIB.

      *------ NOW OVERRIDE THE INPUT AND THE I-O FILES TO THE SOURCE
      *------ AND DESTINATION LIBRARIES RESPECTIVELY.
           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMDS1A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMDS1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMDS1B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMDS1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMMD1A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMMD1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMMD1B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMMD1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMSI1A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMSI1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMSI1B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMSI1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMTR1A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMTR1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMTR1B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMTR1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUM2A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMUM2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUM2B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMUM2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUP1A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMUP1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUP1B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMUP1)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUS2A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMUS2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUS2B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMUS2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUT2A) TOFILE(" DELIMITED BY SIZE,
                  SOURCELIB DELIMITED BY SPACES,
                  "/UTFLMUT2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.

           MOVE SPACES TO WORK-LINE.
           STRING "OVRDBF FILE(UTFLMUT2B) TOFILE(" DELIMITED BY SIZE,
                  DESTLIB DELIMITED BY SPACES,
                  "/UTFLMUT2)" DELIMITED BY SIZE
           INTO WORK-LINE.
           MOVE WORK-LINE TO COMMAND.
           CALL "QCMDEXC" USING COMMAND-WORK, COMMAND-LEN.
      ****************************

           OPEN INPUT UTFLMDS1-A.
           OPEN I-O   UTFLMDS1-B.
           OPEN INPUT UTFLMMD1-A.
           OPEN I-O   UTFLMMD1-B.
           OPEN INPUT UTFLMSI1-A.
           OPEN I-O   UTFLMSI1-B.
           OPEN INPUT UTFLMTR1-A.
           OPEN I-O   UTFLMTR1-B.
           OPEN INPUT UTFLMUM2-A.
           OPEN I-O   UTFLMUM2-B.
           OPEN INPUT UTFLMUP1-A.
           OPEN I-O   UTFLMUP1-B.
           OPEN INPUT UTFLMUS2-A.
           OPEN I-O   UTFLMUS2-B.
           OPEN INPUT UTFLMUT2-A.
           OPEN I-O   UTFLMUT2-B.
           MOVE "Y" TO FILES-OPENED-FLAG.

      *------ NOW READ EACH INPUT FILE.  IF THE RECORD IS IN THE
      *------ OUTPUT FILE, UPDATE IT.  IF IT'S NOT THERE, ADD IT.
      *------ BUT ONLY FOR THE SYSTEM WE ARE WORKING WITH.  FOR
      *------ EFFECIENCY WE START AT THE GIVEN SYSTEM AND WORK
      *------ UNTIL THE SYSTEM CHANGES.  THE EXCEPTION IS THE
      *------ USER PROFILE DEFINITION FILE, WHICH DOES NOT GO BY
      *------ SYSTEM.

      *------ 1.  MENU DESCRIPTIONS
           MOVE "N" TO END-OF-FILE.
           MOVE SYSNAME TO DSSYS OF UTFLMDS1-A-REC.
           START UTFLMDS1-A KEY >= DSSYS OF UTFLMDS1-A-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
              PERFORM UNTIL END-OF-FILE = "Y" OR
              DSSYS OF UTFLMDS1-A-REC > SYSNAME
                 READ UTFLMDS1-A NEXT AT END
                    MOVE "Y" TO END-OF-FILE
                 END-READ
                 IF END-OF-FILE = "N"
                 AND DSSYS OF UTFLMDS1-A-REC = SYSNAME
                    MOVE SPACES TO UTFLMDS1-B-REC
                    MOVE UTFLMDS1-A-REC TO UTFLMDS1-B-REC
                    MOVE NEWSYS TO DSSYS OF UTFLMDS1-B-REC
                    READ UTFLMDS1-B INVALID KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                    END-READ
                    IF FILE-STATUS = "00"
                       IF UPDATECHG = "Y"
                         REWRITE UTFLMDS1-B-REC FROM UTFLMDS1-A-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-REWRITE
                       END-IF
                    ELSE
                       IF ADDNEW = "Y"
                         WRITE UTFLMDS1-B-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-WRITE
                       END-IF
                    END-IF
                 END-IF
              END-PERFORM.

      *------ 2. MENU DEFINITIONS
           MOVE "N" TO END-OF-FILE.
           MOVE SYSNAME TO MDSYS OF UTFLMMD1-A-REC.
           START UTFLMMD1-A KEY >= MDSYS OF UTFLMMD1-A-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
              PERFORM UNTIL END-OF-FILE = "Y" OR
              MDSYS OF UTFLMMD1-A-REC > SYSNAME
                 READ UTFLMMD1-A NEXT AT END
                    MOVE "Y" TO END-OF-FILE
                 END-READ
                 IF END-OF-FILE = "N"
                 AND MDSYS OF UTFLMMD1-A-REC = SYSNAME
                    MOVE SPACES TO UTFLMMD1-B-REC
                    MOVE UTFLMMD1-A-REC TO UTFLMMD1-B-REC
                    MOVE NEWSYS TO MDSYS OF UTFLMMD1-B-REC
                    READ UTFLMMD1-B INVALID KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                    END-READ
                    IF FILE-STATUS = "00"
                       IF UPDATECHG = "Y"
                         REWRITE UTFLMMD1-B-REC FROM UTFLMMD1-A-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-REWRITE
                       END-IF
                    ELSE
                       IF ADDNEW = "Y"
                         WRITE UTFLMMD1-B-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-WRITE
                       END-IF
                    END-IF
                 END-IF
              END-PERFORM.

      *------ 3.  SYSTEM IDENTIFICATION
           MOVE "N" TO END-OF-FILE.
           MOVE SYSNAME TO SISYS OF UTFLMSI1-A-REC.
           START UTFLMSI1-A KEY >= SISYS OF UTFLMSI1-A-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
              PERFORM UNTIL END-OF-FILE = "Y" OR
              SISYS OF UTFLMSI1-A-REC > SYSNAME
                 READ UTFLMSI1-A NEXT AT END
                    MOVE "Y" TO END-OF-FILE
                 END-READ
                 IF END-OF-FILE = "N"
                 AND SISYS OF UTFLMSI1-A-REC = SYSNAME
                    MOVE UTFLMSI1-A-REC TO UTFLMSI1-B-REC
                    MOVE NEWSYS TO SISYS OF UTFLMSI1-B-REC
                    READ UTFLMSI1-B INVALID KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                    END-READ
                    IF FILE-STATUS = "00"
                       IF UPDATECHG = "Y"
                         REWRITE UTFLMSI1-B-REC FROM UTFLMSI1-A-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-REWRITE
                       END-IF
                    ELSE
                       IF ADDNEW = "Y"
                         WRITE UTFLMSI1-B-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-WRITE
                       END-IF
                    END-IF
                 END-IF
              END-PERFORM.

      *------ 4. TRANSACTION FILE
           MOVE "N" TO END-OF-FILE.
           MOVE SYSNAME TO TRSYS OF UTFLMTR1-A-REC.
           START UTFLMTR1-A KEY >= TRSYS OF UTFLMTR1-A-REC
               INVALID KEY MOVE FILE-STATUS TO FILE-STATUS.
           IF FILE-STATUS = "00"
              PERFORM UNTIL END-OF-FILE = "Y" OR
              TRSYS OF UTFLMTR1-A-REC > SYSNAME
                 READ UTFLMTR1-A NEXT AT END
                    MOVE "Y" TO END-OF-FILE
                 END-READ
                 IF END-OF-FILE = "N"
                 AND TRSYS OF UTFLMTR1-A-REC = SYSNAME
                    MOVE UTFLMTR1-A-REC TO UTFLMTR1-B-REC
                    MOVE NEWSYS TO TRSYS OF UTFLMTR1-B-REC
                    READ UTFLMTR1-B INVALID KEY
                      MOVE FILE-STATUS TO FILE-STATUS
                    END-READ
                    IF FILE-STATUS = "00"
                       IF UPDATECHG = "Y"
                         REWRITE UTFLMTR1-B-REC FROM UTFLMTR1-A-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-REWRITE
                       END-IF
                    ELSE
                       IF ADDNEW = "Y"
                         WRITE UTFLMTR1-B-REC
                           INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                         END-WRITE
                       END-IF
                    END-IF
                 END-IF
              END-PERFORM.

      *------ 5.  USER-MENU AUTHORITY
           IF UPDATEAUTH = "Y"
               MOVE "N" TO END-OF-FILE
               MOVE SYSNAME TO UMSYS OF UTFLMUM2-A-REC
               START UTFLMUM2-A KEY >= UMSYS OF UTFLMUM2-A-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
                  PERFORM UNTIL END-OF-FILE = "Y" OR
                  UMSYS OF UTFLMUM2-A-REC > SYSNAME
                     READ UTFLMUM2-A NEXT AT END
                        MOVE "Y" TO END-OF-FILE
                     END-READ
                     IF END-OF-FILE = "N"
                     AND UMSYS OF UTFLMUM2-A-REC = SYSNAME
                        MOVE UTFLMUM2-A-REC TO UTFLMUM2-B-REC
                        MOVE NEWSYS TO UMSYS OF UTFLMUM2-B-REC
                        READ UTFLMUM2-B INVALID KEY
                          MOVE FILE-STATUS TO FILE-STATUS
                        END-READ
                        IF FILE-STATUS NOT = "00"
                        OR UTFLMUM2-B-REC NOT = UTFLMUM2-A-REC
                           WRITE UTFLMUM2-B-REC
                            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                           END-WRITE
                        END-IF
                     END-IF
                 END-PERFORM.

      *------ 6.  USER PROFILE DEFINITION
      *------ NOTE: NO SYS KEY FOR USER PROFILE FILE
           IF UPDATEAUTH = "Y" AND (SOURCELIB NOT = DESTLIB)
               MOVE "N" TO END-OF-FILE
               MOVE SPACES TO UPUSER OF UTFLMUP1-A-REC
               START UTFLMUP1-A KEY >= UPUSER OF UTFLMUP1-A-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
                  PERFORM UNTIL END-OF-FILE = "Y"
                     READ UTFLMUP1-A NEXT AT END
                        MOVE "Y" TO END-OF-FILE
                     END-READ
                     IF END-OF-FILE = "N"
                        MOVE UTFLMUP1-A-REC TO UTFLMUP1-B-REC
                        READ UTFLMUP1-B INVALID KEY
                          MOVE FILE-STATUS TO FILE-STATUS
                        END-READ
                        IF FILE-STATUS NOT = "00"
                        OR UTFLMUP1-B-REC NOT = UTFLMUP1-A-REC
                           WRITE UTFLMUP1-B-REC
                            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                           END-WRITE
                        END-IF
                     END-IF
                  END-PERFORM.

      *------ 7. USER-SYSTEM AUTHORITY
           IF UPDATEAUTH = "Y"
               MOVE "N" TO END-OF-FILE
               MOVE SYSNAME TO USSYS OF UTFLMUS2-A-REC
               START UTFLMUS2-A KEY >= USSYS OF UTFLMUS2-A-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
                  PERFORM UNTIL END-OF-FILE = "Y" OR
                  USSYS OF UTFLMUS2-A-REC > SYSNAME
                     READ UTFLMUS2-A NEXT AT END
                        MOVE "Y" TO END-OF-FILE
                     END-READ
                     IF END-OF-FILE = "N"
                     AND USSYS OF UTFLMUS2-A-REC = SYSNAME
                        MOVE UTFLMUS2-A-REC TO UTFLMUS2-B-REC
                        MOVE NEWSYS TO USSYS OF UTFLMUS2-B-REC
                        READ UTFLMUS2-B INVALID KEY
                          MOVE FILE-STATUS TO FILE-STATUS
                         END-READ
                         IF FILE-STATUS NOT = "00"
                         OR UTFLMUS2-B-REC NOT = UTFLMUS2-A-REC
                            WRITE UTFLMUS2-B-REC
                            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                           END-WRITE
                        END-IF
                     END-IF
                  END-PERFORM.

      *------ 8.  USER-TRANSACTION AUTHORITY
           IF UPDATEAUTH = "Y"
               MOVE "N" TO END-OF-FILE
               MOVE SYSNAME TO UTSYS OF UTFLMUT2-A-REC
               START UTFLMUT2-A KEY >= UTSYS OF UTFLMUT2-A-REC
                   INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
               END-START
               IF FILE-STATUS = "00"
                  PERFORM UNTIL END-OF-FILE = "Y" OR
                  UTSYS OF UTFLMUT2-A-REC > SYSNAME
                     READ UTFLMUT2-A NEXT AT END
                        MOVE "Y" TO END-OF-FILE
                     END-READ
                     IF END-OF-FILE = "N"
                     AND UTSYS OF UTFLMUT2-A-REC = SYSNAME
                        MOVE UTFLMUT2-A-REC TO UTFLMUT2-B-REC
                        MOVE NEWSYS TO UTSYS OF UTFLMUT2-B-REC
                        READ UTFLMUT2-B INVALID KEY
                          MOVE FILE-STATUS TO FILE-STATUS
                        END-READ
                        IF FILE-STATUS NOT = "00"
                           WRITE UTFLMUT2-B-REC
                            INVALID KEY MOVE FILE-STATUS TO FILE-STATUS
                           END-WRITE
                        END-IF
                     END-IF
                  END-PERFORM.

       6990-MAIN-X.
           EXIT.

      *9954-SETERROR.
      *    MOVE B"1" TO IND (99).
      *    MOVE B"1" TO IND (FIELD-NUMBER).
      *    MOVE MESSAGE-BUFFER TO DE-MESSAGE-LINE.
      *

