     A          R RBUDGET
     A            AKRAPPRDTE     6A         ALIAS(AKRAPPRDTE_BG)
     A                                      TEXT('AKRON APPROVAL DATE')
     A            AUTHPAD       24A         ALIAS(AUTHPAD_BG)
     A                                      TEXT('PAD AREA')
     A            BCAPALARM      4A         ALIAS(BCAPALARM_BG)
     A                                      TEXT('BUDGET CAPITAL ALARM POINT')
     A            BCAPCUTOFF     4A         ALIAS(BCAPCUTOFF_BG)
     A                                      TEXT('BUDGET CAPITAL CUTOFF POINT')
     A            BCDEPT         4A         ALIAS(BCDEPT_BG)
     A                                      TEXT('DEPARTMENT')
     A            BEXPALARM      4A         ALIAS(BEXPALARM_BG)
     A                                      TEXT('BUDGET EXPENSE ALARM POINT')
     A            BEXPCUTOFF     4A         ALIAS(BEXPCUTOFF_BG)
     A                                      TEXT('BUDGET EXPENSE CUTOFF POINT')
     A            BUDGETNUM     16A         ALIAS(BUDGETNUM_BG)
     A                                      TEXT('BUDGET NUMBER')
     A            BUDPONUM      10A         ALIAS(BUDPONUM_BG)
     A                                      TEXT('PO NUMBER')
     A            BUDREQNUM     10A         ALIAS(BUDREQNUM_BG)
     A                                      TEXT('REQUISITION NUMBER')
     A            BUSINCENT      4A         ALIAS(BUSINCENT_BG)
     A                                      TEXT('BUSINESS CENTER')
     A            BVTAPPR       10A         ALIAS(BVTAPPR_BG)
     A                                      TEXT('BOOK VALUE TRANSFER')
     A            BVTFLAG        2A         ALIAS(BVTFLAG_BG)
     A                                      TEXT('BOOK VALUE TRANSFER')
     A            CAPAPPR       10A         ALIAS(CAPAPPR_BG)
     A                                      TEXT('APPROVED CAPITAL DOLLARS')
     A            CAPCMTD       10A         ALIAS(CAPCMTD_BG)
     A                                      TEXT('COMMITTED CAPITAL DOLLARS')
     A            CAPEXPFLAG     2A         ALIAS(CAPEXPFLAG_BG)
     A            CCAPALARM      4A         ALIAS(CCAPALARM_BG)
     A                                      TEXT('WO CAPITAL ALARM POINT')
     A            CCAPCUTOFF     4A         ALIAS(CCAPCUTOFF_BG)
     A                                      TEXT('WO CAPITAL CUTOFF POINT')
     A            CDATESTAMP     6A         ALIAS(CDATESTAMP_BG)
     A                                      TEXT('DATE')
     A            CEXPALARM      4A         ALIAS(CEXPALARM_BG)
     A                                      TEXT('WO EXPENSE ALARM POINT')
     A            CEXPCUTOFF     4A         ALIAS(CEXPCUTOFF_BG)
     A                                      TEXT('WO EXPENSE CUTOFF POINT')
     A            CHANGENUM      4A         ALIAS(CHANGENUM_BG)
     A                                      TEXT('CHANGE NUMBER')
     A            CHARGETYPE     2A         ALIAS(CHARGETYPE_BG)
     A                                      TEXT('CHARGE TYPE')
     A            CHRGALARM      4A         ALIAS(CHRGALARM_BG)
     A                                      TEXT('CHARGE ALARM')
     A            CHRGCUTOFF     4A         ALIAS(CHRGCUTOFF_BG)
     A                                      TEXT('CHARGE CUTOFF')
     A            CTIMESTAMP     4A         ALIAS(CTIMESTAMP_BG)
     A                                      TEXT('TIME')
     A            DATEACLOSE     6A         ALIAS(DATEACLOSE_BG)
     A                                      TEXT('ACCOUNTING CLOSE DATE')
     A            DATEECLOSE     6A         ALIAS(DATEECLOSE_BG)
     A                                      TEXT('ENGINEERING CLOSE DATE')
     A            DATEOPENED     6A         ALIAS(DATEOPENED_BG)
     A                                      TEXT('DATE OPENED')
     A            DBVERSDATE     6A         ALIAS(DBVERSDATE_BG)
     A            DBVERSION     10A         ALIAS(DBVERSION_BG)
     A            DBVERSPAD     40A         ALIAS(DBVERSPAD_BG)
     A            DBVERSTIME     4A         ALIAS(DBVERSTIME_BG)
     A            DEFBUDNUM     16A         ALIAS(DEFBUDNUM_BG)
     A                                      TEXT('DEFAULT "P" BUDGET NUMBER')
     A            DEFLABEST     10A         ALIAS(DEFLABEST_BG)
     A                                      TEXT('DEFAULT LABOR ESTIMATE')
     A            DEFPUREST     10A         ALIAS(DEFPUREST_BG)
     A                                      TEXT('DEFAULT PURCHASED ESTIMATE')
     A            DEFSTREST     10A         ALIAS(DEFSTREST_BG)
     A                                      TEXT('DEFAULT STORES ESTIMATE')
     A            DESC1         60A         ALIAS(DESC1_BG)
     A                                      TEXT('DESCRIPTION')
     A            DESC2         60A         ALIAS(DESC2_BG)
     A            DESC3         60A         ALIAS(DESC3_BG)
     A            DESC4         60A         ALIAS(DESC4_BG)
     A            DESC5         60A         ALIAS(DESC5_BG)
     A            ERRORCODE      2A         ALIAS(ERRORCODE_BG)
     A                                      TEXT('ERROR CODE')
     A            ERRORMSG      76A         ALIAS(ERRORMSG_BG)
     A                                      TEXT('ERROR MESSAGE')
     A            EXPAPPR       10A         ALIAS(EXPAPPR_BG)
     A                                      TEXT('APPROVED EXPENSE DOLLARS')
     A            EXPCMTD       10A         ALIAS(EXPCMTD_BG)
     A                                      TEXT('COMMITTED EXPENSE DOLLARS')
     A            FLAGA          2A         ALIAS(FLAGA_BG)
     A                                      TEXT('AUTHORIZATION FLAG A')
     A            FLAGB          2A         ALIAS(FLAGB_BG)
     A                                      TEXT('AUTHORIZATION FLAG B')
     A            FLAGC          2A         ALIAS(FLAGC_BG)
     A                                      TEXT('AUTHORIZATION FLAG C')
     A            FLAGD          2A         ALIAS(FLAGD_BG)
     A                                      TEXT('AUTHORIZATION FLAG D')
     A            FLAGE          2A         ALIAS(FLAGE_BG)
     A                                      TEXT('AUTHORIZATION FLAG E')
     A            FLAGF          2A         ALIAS(FLAGF_BG)
     A                                      TEXT('AUTHORIZATION FLAG F')
     A            INVAMT        10A         ALIAS(INVAMT_BG)
     A                                      TEXT('INVOICE AMOUNT')
     A            INVCOST       10A         ALIAS(INVCOST_BG)
     A                                      TEXT('INVOICE COST')
     A            INVSTAMP       6A         ALIAS(INVSTAMP_BG)
     A                                      TEXT('INVOICE DATE')
     A            LABORCOM      10A         ALIAS(LABORCOM_BG)
     A                                      TEXT('COMMITTED LABOR')
     A            LABOREST      10A         ALIAS(LABOREST_BG)
     A                                      TEXT('ESTIMATED LABOR')
     A            LABORSTAMP     6A         ALIAS(LABORSTAMP_BG)
     A                                      TEXT('LABOR DATE')
     A            NEWWORKNUM     8A         ALIAS(NEWWORKNUM_BG)
     A                                      TEXT('NEWWORK NUMBER')
     A            PAD10         10A         ALIAS(PAD10_BG)
     A            PADFIELD      30A         ALIAS(PADFIELD_BG)
     A            PARTSTAMP      6A         ALIAS(PARTSTAMP_BG)
     A                                      TEXT('DATE PART WITHDRAWN')
     A            PERSID         4A         ALIAS(PERSID_BG)
     A                                      TEXT('CLOCK CARD NUMBER')
     A            PERSNAME      16A         ALIAS(PERSNAME_BG)
     A                                      TEXT('NAME')
     A            PLTAPPRDTE     6A         ALIAS(PLTAPPRDTE_BG)
     A                                      TEXT('PLANT APPROVAL DATE')
     A            POCOST        10A         ALIAS(POCOST_BG)
     A                                      TEXT('PO COST')
     A            POITEMNUM      4A         ALIAS(POITEMNUM_BG)
     A                                      TEXT('PO ITEM NUMBER')
     A            POSTAMP        6A         ALIAS(POSTAMP_BG)
     A                                      TEXT('PO DATE')
     A            PROJECTNUM    14A         ALIAS(PROJECTNUM_BG)
     A                                      TEXT('PROJECT FILE')
     A            PURCHAMT      10A         ALIAS(PURCHAMT_BG)
     A                                      TEXT('PURCHASED AMOUNT')
     A            PURCHCOM      10A         ALIAS(PURCHCOM_BG)
     A                                      TEXT('PURCHASED DOLLARS COMMITTED')
     A            PURCHEST      10A         ALIAS(PURCHEST_BG)
     A                                      TEXT('PURCHASED DOLLARD ESTIMATED')
     A            PWODESC       30A         ALIAS(PWODESC_BG)
     A                                      TEXT('WO DESCRIPTION')
     A            PWOEXPCLS      8A         ALIAS(PWOEXPCLS_BG)
     A                                      TEXT('EXP.CLASS/NEWWORK')
     A            PWONUM        10A         ALIAS(PWONUM_BG)
     A                                      TEXT('WORKORDER/CHARGE RECORD')
     A            PWOPAD        20A         ALIAS(PWOPAD_BG)
     A            PWOREQUEST    12A         ALIAS(PWOREQUEST_BG)
     A                                      TEXT('REQUEST NUMBER')
     A            REGAPPRDTE     6A         ALIAS(REGAPPRDTE_BG)
     A                                      TEXT('REGIONAL APPROVAL DATE')
     A            REQCOST       10A         ALIAS(REQCOST_BG)
     A                                      TEXT('REQUISITION COST')
     A            REQDAMT       10A         ALIAS(REQDAMT_BG)
     A                                      TEXT('REQUISITION AMOUNT')
     A            REQSTAMP       6A         ALIAS(REQSTAMP_BG)
     A                                      TEXT('REQUISITION DATE')
     A            SINVAMT       10A         ALIAS(SINVAMT_BG)
     A                                      TEXT('SAVE INVOICE AMOUNT')
     A            SLABORCOM     10A         ALIAS(SLABORCOM_BG)
     A                                      TEXT('SAVE COMMITTED LABOR')
     A            SLABOREST     10A         ALIAS(SLABOREST_BG)
     A                                      TEXT('SAVE LABOR ESTIMATE')
     A            SPURCHAMT     10A         ALIAS(SPURCHAMT_BG)
     A                                      TEXT('SAVE PURCHASED AMOUNT')
     A            SPURCHCOM     10A         ALIAS(SPURCHCOM_BG)
     A                                      TEXT('SAVE PURCHASED COMMITTED')
     A            SPURCHEST     10A         ALIAS(SPURCHEST_BG)
     A                                      TEXT('SAVE PURCHASED ESTIMATE')
     A            SREQDAMT      10A         ALIAS(SREQDAMT_BG)
     A                                      TEXT('SAVE REQUISITION AMOUNT')
     A            SSTRMCOM      10A         ALIAS(SSTRMCOM_BG)
     A                                      TEXT('SAVE STOREROOM COMMITED')
     A            SSTRMEST      10A         ALIAS(SSTRMEST_BG)
     A                                      TEXT('SAVE STOREROOM ESTIMATE')
     A            STRMCOM       10A         ALIAS(STRMCOM_BG)
     A                                      TEXT('COMMITED PARTS WITHDRAWAL')
     A            STRMEST       10A         ALIAS(STRMEST_BG)
     A                                      TEXT('ESTIMATED PARTS WITHDRAWAL')
     A            SYSSWITCH      2A         ALIAS(SYSSWITCH_BG)
     A                                      TEXT('SYSTEM SWITCH')
     A            TITLE         60A         ALIAS(TITLE_BG)
     A                                      TEXT('TITLE')
     A            TSIGN          2A         ALIAS(TSIGN_BG)
     A                                      TEXT('SIGN')
     A            UPDATEKEY     16A         ALIAS(UPDATEKEY_BG)
     A                                      TEXT('UPDATE KEY')
     A            UPDATETYPE     2A         ALIAS(UPDATETYPE_BG)
     A                                      TEXT('UPDATE TYPE')
