     A                                      REF(STORES)
     A          R CHEMINVFL
     A            PLANT          3A
     A            DATE          10A
     A            KEYWORDADJR
     A            ONHAND         8A
     A            UM             2A
     A            CORPCDE7  R
