     A          R RCSACCT
     A            ACCAMOUNT     14S         ALIAS(ACCAMOUNT_CA)
     A                                      TEXT('                    ')
     A            ACCOUNT        6A         ALIAS(ACCOUNT_CA)
     A                                      TEXT('EXPENSE/NEW WORK    ')
     A            ACTDOLCOR     14S         ALIAS(ACTDOLCOR_CA)
     A                                      TEXT('                    ')
     A            ACTGCLASS      4A         ALIAS(CLASS_CA)
     A                                      TEXT('ACCOUNTING CLASS    ')
     A            ACTGMMYY       4A         ALIAS(ACTGMMYY_CA)
     A                                      TEXT('ACCOUNTING MONTH/YEAR')
     A            ACTGUNTCOR    10S         ALIAS(ACTGUNTCOR_CA)
     A                                      TEXT('                    ')
     A            AREABUDGET    14S         ALIAS(AREABUDGET_CA)
     A                                      TEXT('                    ')
     A            AVGCSTUPD      2A         ALIAS(AVGCSTUPD_CA)
     A                                      TEXT('                    ')
     A            BALQTY        10S         ALIAS(BALQTY_CA)
     A                                      TEXT('                    ')
     A            BEGBALDOL     14S         ALIAS(BEGBALDOL_CA)
     A                                      TEXT('BEGINNING MONTH DOLLARS')
     A            BEGBALUNT     10S         ALIAS(BEGBALUNT_CA)
     A                                      TEXT('BEGINNING MONTH UNITS')
     A            BUSCTR         4A         ALIAS(BUSCTR_CA)
     A                                      TEXT('BUSINESS CENTER     ')
     A            CLSDCHGVAL    14S         ALIAS(CLSDCHGVAL_CA)
     A                                      TEXT('                    ')
     A            CONSIGNFLG     1A         ALIAS(CONSIGNFLG_CA)
     A                                      TEXT('CONSIGNMENT FLAG    ')
     A            DAPPLPAD      20A         ALIAS(DAPPLPAD_CA)
     A                                      TEXT('                    ')
     A            DAPPLRTCRR     4A         ALIAS(DAPPLRTCRR_CA)
     A                                      TEXT('                    ')
     A            DATLSTUPD      8A         ALIAS(DATLSTUPD_CA)
     A                                      TEXT('                    ')
     A            DEPT           6A         ALIAS(DEPT_CA)
     A                                      TEXT('DEPARTMENT NUMBER   ')
     A            DEPTTYPE       2A         ALIAS(DEPTTYPE_CA)
     A                                      TEXT('                    ')
     A            DESCR         60A         ALIAS(DESCR_CA)
     A                                      TEXT('                    ')
     A            DESCR56       56A         ALIAS(DESCR56_CA)
     A                                      TEXT('                    ')
     A            DOCNO         12A         ALIAS(DOCNO_CA)
     A                                      TEXT('DOCUMENT NUMBER     ')
     A            EMPGROUP       4A         ALIAS(EMPGROUP_CA)
     A                                      TEXT('                    ')
     A            EMPTYPE        2A         ALIAS(EMPTYPE_CA)
     A                                      TEXT('                    ')
     A            ENDBALDOL     14S         ALIAS(ENDBALDOL_CA)
     A                                      TEXT('ENDING MONTH DOLLARS')
     A            ENDBALUNT     10S         ALIAS(ENDBALUNT_CA)
     A                                      TEXT('ENDING MONTH UNITS  ')
     A            FRTBILLDTE     6A         ALIAS(FRTBILLDTE_CA)
     A                                      TEXT('                    ')
     A            FRTBILLNO     16A         ALIAS(FRTBILLNO_CA)
     A                                      TEXT('PRO NUMBER          ')
     A            FRTCARRIER     4A         ALIAS(FRTCARRIER_CA)
     A                                      TEXT('CARRIER CODE        ')
     A            FRTCRRNAM     30A         ALIAS(FRTCRRNAM_CA)
     A                                      TEXT('CARRIER NAME        ')
     A            FRTPAIDAMT    14S         ALIAS(FRTPAIDAMT_CA)
     A                                      TEXT('FREIGHT PAID AMOUNT ')
     A            FRTPAIDDTE     6A         ALIAS(FRTPAIDDTE_CA)
     A                                      TEXT('FREIGHT PAID DATE   ')
     A            FRTPROCDTE     6A         ALIAS(FRTPROCDTE_CA)
     A                                      TEXT('FREIGHT PROCESSED DATE')
     A            FRTPRONO      16A         ALIAS(FRTPRONO_CA)
     A                                      TEXT('FREIGHT PRO NUMBER  ')
     A            FRTRAILCAR    10A         ALIAS(FRTRAILCAR_CA)
     A                                      TEXT('RAIL CAR NUMBER     ')
     A            FRTRATAMT     14S         ALIAS(FRTRATAMT_CA)
     A                                      TEXT('FREIGHT RATED AMOUNT')
     A            FRTSHPDTE      6A         ALIAS(FRTSHPDTE_CA)
     A                                      TEXT('SHIPPED DATE        ')
     A            FRTSTATDTE     8A         ALIAS(FRTSTATDTE_CA)
     A                                      TEXT('STATUS CHANGED DATE ')
     A            FRTSTATUS      2A         ALIAS(FRTSTATUS_CA)
     A                                      TEXT('STATUS OF FRT BILL  ')
     A            FRTTERMS       2A         ALIAS(FRTTERMS_CA)
     A                                      TEXT('TERMS OF PAYMENT    ')
     A            FRTUSETAX     14S         ALIAS(FRTUSETAX_CA)
     A                                      TEXT('FREIGHT TAX AMOUNT  ')
     A            INFODATA      60A         ALIAS(INFODATA_CA)
     A                                      TEXT('MISCELLANEOUS DATA  ')
     A            INFOKEY        4A         ALIAS(INFOKEY_CA)
     A                                      TEXT('KEYS FOR MISC. DATA ')
     A            INTRNDOL      14S         ALIAS(INTRNDOL_CA)
     A                                      TEXT('                    ')
     A            INVDOLNRCV    14S         ALIAS(INVDOLNRCV_CA)
     A                                      TEXT('                    ')
     A            ITEMNUMBER     4A         ALIAS(ITEMNUMBER_CA)
     A                                      TEXT('ITEM NUMBER         ')
     A            KEYWORDADJ    50A         ALIAS(KEYWORDADJ_CA)
     A                                      TEXT('KEYWORD/ADJECTIVE   ')
     A            LEDGER         4A         ALIAS(LEDGER_CA)
     A                                      TEXT('                    ')
     A            MATLCODE       8A         ALIAS(MATLCODE_CA)
     A                                      TEXT('STORES CORPORATE CODE')
     A            MEMAMTCHG     10S         ALIAS(MEMAMTCHG_CA)
     A                                      TEXT('                    ')
     A            MEMDATE        6A         ALIAS(MEMDATE_CA)
     A                                      TEXT('                    ')
     A            MEMITMNO       4A         ALIAS(MEMITMNO_CA)
     A                                      TEXT('                    ')
     A            MEMPOQTY      10S         ALIAS(MEMPOQTY_CA)
     A                                      TEXT('                    ')
     A            MEMQTYRCV     10S         ALIAS(MEMQTYRCV_CA)
     A                                      TEXT('                    ')
     A            MEMRECSLIP     4A         ALIAS(MEMRECSLIP_CA)
     A                                      TEXT('                    ')
     A            MEMZNO        10A         ALIAS(MEMZNO_CA)
     A                                      TEXT('                    ')
     A            MULTIPOFLG     2A         ALIAS(MULTIPOFLG_CA)
     A                                      TEXT('FRT APPL TO MULTI POS')
     A            ONDCKCARRY    14S         ALIAS(ONDCKCARRY_CA)
     A                                      TEXT('                    ')
     A            PAD10         10A         ALIAS(PAD10_CA)
     A                                      TEXT('10 BYTE FILLER AREA ')
     A            PONUM         10A         ALIAS(PONUM_CA)
     A                                      TEXT('PO NUMBER           ')
     A            PORCVNO       14A         ALIAS(PORCVNO_CA)
     A                                      TEXT('PO/RECEIVING SLIP NUMBER ')
     A            QUANTITY      10S         ALIAS(QUANTITY_CA)
     A                                      TEXT('QTY PAID FOR MONTHLY')
     A            RCVRNUM        4A         ALIAS(RCVRNUM_CA)
     A                                      TEXT('RECEIVING SLIP NUMBER')
     A            RPTCODE        2A         ALIAS(RPTCODE_CA)
     A                                      TEXT('                    ')
     A            RTAPLDT        8A         ALIAS(RTAPLDT_CA)
     A                                      TEXT('RATED APPLIED DATE')
     A            RTAPLTIME      6A         ALIAS(RTAPLTIME_CA)
     A                                      TEXT('RATED APPLIED TIME')
     A            RTCARRIER      4A         ALIAS(RTCARRIER_CA)
     A                                      TEXT('RATED CARRIER')
     A            RTFRTAMT      14S         ALIAS(RTFRTAMT_CA)
     A                                      TEXT('RATED FREIGHT AMT')
     A            RTPRONO       16A         ALIAS(RTPRONO_CA)
     A                                      TEXT('RATED PRO NUMBER')
     A            RTRCVDT        8A         ALIAS(RTRCVDT_CA)
     A                                      TEXT('RATED REC RECVD DATE  ')
     A            PDAPLDT        8A         ALIAS(PDAPLDT_CA)
     A                                      TEXT('PAID APPLIED DATE ')
     A            PDAPLTIME      6A         ALIAS(PDAPLTIME_CA)
     A                                      TEXT('PAID APPLIED TIME ')
     A            PDCARRIER      4A         ALIAS(PDCARRIER_CA)
     A                                      TEXT('PAID CARRIER')
     A            PDFRTAMT      14S         ALIAS(PDFRTAMT_CA)
     A                                      TEXT('PAID FREIGHT AMT')
     A            PDFRTTAX      14S         ALIAS(PDFRTTAX_CA)
     A                                      TEXT('PAID FREIGHT AMT')
     A            PDPRONO       16A         ALIAS(PDPRONO_CA)
     A                                      TEXT('PAID PRO NUMBER')
     A            PDRCVDT        8A         ALIAS(PDRCVDT_CA)
     A                                      TEXT('PAID REC RECVD DATE   ')
     A            PLTCODE        3A         ALIAS(PLTCODE_CA)
     A                                      TEXT('PLANT CODE          ')
     A            SHPADR1       30A         ALIAS(SHPADR1_CA)
     A                                      TEXT('SHIP TO ADDRESS 1   ')
     A            SHPADR2       30A         ALIAS(SHPADR2_CA)
     A                                      TEXT('SHIP TO ADDRESS 2   ')
     A            SHPCITY       24A         ALIAS(SHPCITY_CA)
     A                                      TEXT('SHIP TO CITY        ')
     A            SHPSTATE       2A         ALIAS(SHPSTATE_CA)
     A                                      TEXT('SHIP TO STATE       ')
     A            SHPZIP        10A         ALIAS(SHPZIP_CA)
     A                                      TEXT('SHIP TO ZIPCODE     ')
     A            STRAVGCOST    15P         ALIAS(STRAVGCOST_CA)
     A                                      TEXT('AVERAGE COST        ')
     A            STRSTDCOST    15P         ALIAS(STRSTDCOST_CA)
     A                                      TEXT('STANDARD COST       ')
     A            TOTADJDOL     14S         ALIAS(TOTADJDOL_CA)
     A                                      TEXT('TOTAL ADJUSTED DOLLARS')
     A            TISPAIDDT      8A         ALIAS(TISPAIDDT_CA)
     A                                      TEXT('TIS PAID DATE         ')
     A            TISSHIPDT      8A         ALIAS(TISSHIPDT_CA)
     A                                      TEXT('TIS SHIP DATE         ')
     A            TOTADJUNT     10S         ALIAS(TOTADJUNT_CA)
     A                                      TEXT('TOTAL ADJUSTED UNITS')
     A            TOTINVDOL     14S         ALIAS(TOTINVDOL_CA)
     A                                      TEXT('TOTAL INVOICE DOLLARS')
     A            TOTISSDOL     14S         ALIAS(TOTISSDOL_CA)
     A                                      TEXT('TOTAL ISSUED DOLLARS')
     A            TOTISSUNT     10S         ALIAS(TOTISSUNT_CA)
     A                                      TEXT('TOTAL ISSUED UNITS  ')
     A            TOTRCTDOL     14S         ALIAS(TOTRCTDOL_CA)
     A                                      TEXT('TOTAL RECEIVED UNITS')
     A            TOTRCTUNT     10S         ALIAS(TOTRCTUNT_CA)
     A                                      TEXT('TOTAL RECEIVED UNITS')
     A            TOTRTNDOL     14S         ALIAS(TOTRTNDOL_CA)
     A                                      TEXT('TOTAL RETURNED DOLLARS')
     A            TOTRTNUNT     10S         ALIAS(TOTRTNUNT_CA)
     A                                      TEXT('TOTAL RETURNED UNITS')
     A            TOTRTNVDOL    14S         ALIAS(TOTRTNVDOL_CA)
     A                                      TEXT('VALUE OF RETURNED DOLLARS')
     A            TOTRTNVUNT    10S         ALIAS(TOTRTNVUNT_CA)
     A                                      TEXT('VALUE OF RETURNED UNITS')
     A            TRANSCODE      4A         ALIAS(TRANSCODE_CA)
     A                                      TEXT('TRANSACTION RECORD TYPE')
     A            TRANSDATA     68A         ALIAS(TRANSDATA_CA)
     A                                      TEXT('                    ')
     A            TRANSDATE      8A         ALIAS(TRANSDATE_CA)
     A                                      TEXT('TRANSACTION DATE    ')
     A            TRANSEMP       4A         ALIAS(TRANSEMP_CA)
     A                                      TEXT('EMPLOYEE            ')
     A            TRANSTIME      6A         ALIAS(TRANSTIME_CA)
     A                                      TEXT('TRANSACTION TIME    ')
     A            UNTINVNRCV    10S         ALIAS(UNTINVNRCV_CA)
     A                                      TEXT('UNITS INVOICED-NOT RECVD')
     A            UNTMEASURE     2A         ALIAS(UNTMEASURE_CA)
     A                                      TEXT('UNIT OF MEASURE     ')
     A            UNTRCVNINV    10S         ALIAS(UNTRCVNINV_CA)
     A                                      TEXT('                    ')
     A            VALUE         14S         ALIAS(VALUE_CA)
     A                                      TEXT('VALUE OF TRANSACTION')
     A            VENITMDTA     44A         ALIAS(VENITMDTA_CS)
     A                                      TEXT('VENDOR ITEM COMMENT      ')
     A            WRTDWNFLAG     2A         ALIAS(WRTDWNFLAG_CA)
     A                                      TEXT('WRITE DOWN FLAG     ')
     A            WRTDWNPRC      6S         ALIAS(WRTDWNPRC_CA)
     A                                      TEXT('DATE OF WRITE DOWN  ')
     A            WRTOFFDTE      6A         ALIAS(WRTOFFDTE_CA)
     A                                      TEXT('WRITE OFF DATE      ')
     A            WRTOFFFLAG     2A         ALIAS(WRTOFFFLAG_CA)
     A                                      TEXT('WRITE OFF FLAG      ')
