     A          R RDOCREF
     A            CRTCEN         1A         ALIAS(CRTCEN_DS)
     A                                      TEXT('CENTURY OUTFILE CREATED     ')
     A            CRTDAT         6A         ALIAS(CRTDAT_DS)
     A                                      TEXT('YYMMDD OUTFILE CREATED      ')
     A            CRTTIM         6A         ALIAS(CRTTIM_DS)
     A                                      TEXT('HHMMSS OUTFILE CREATED      ')
     A            DESC          44A         ALIAS(DESC_DS)
     A                                      TEXT('DOCUMENT DESCRIPTION OUTFILE')
     A            DOCNAM        12A         ALIAS(DOCNAM_DS)
     A                                      TEXT('DOCUMENT NAME OUTFILE       ')
     A            DOCTYP         8A         ALIAS(DOCTYP_DS)
     A                                      TEXT('DOCUMENT TYPE OUTFILE       ')
     A            DOCUMENT      10A         ALIAS(DOCUMENT_DS)
     A                                      TEXT('DOCUMENT NAME SUBSYS DETAIL ')
     A            FLRNAM        63A         ALIAS(FLRNAM_DS)
     A                                      TEXT('FOLDER PATH NAME OUTFILE    ')
     A            INCLSUB        1A         ALIAS(INCLSUB_DS)
     A                                      TEXT('INCLUDE SUBSYS IN DOC SYS   ')
     A            LASTRV         8A         ALIAS(LASTRV_DS)
     A                                      TEXT('LAST REVISED MMDDYY DOC OUTF')
     A            SEQDTE         8S 0       ALIAS(SEQDTE_DS)
     A                                      TEXT('DATE ENHANCEMENT IN SYSTEM  ')
     A            SEQNUM         2S 0       ALIAS(SEQNUM_DS)
     A                                      TEXT('SEQ NUMBER FOR ENHANCEMENT  ')
     A            SEQTITLE      60A         ALIAS(SEQTITLE_DS)
     A                                      TEXT('ENHANCEMENT TITLE FOR SEQ   ')
     A            SUBSYS         8A         ALIAS(SUBSYS_DS)
     A                                      TEXT('SUB-SYSTEM NAME             ')
     A            SUBSYSDESC    60A         ALIAS(SUBSYSDESC_DS)
     A                                      TEXT('SUB-SYSTEM DESCRIPTION      ')
     A            SYSNAM         8A         ALIAS(SYSNAM_DS)
     A                                      TEXT('SYSTEM OUTFILE CREATED ON   ')
     A            SYSTEM         5A         ALIAS(SYSTEM_DS)
     A                                      TEXT('PRIMARY SYSTEM NAME         ')
