     A          R REDI867REF
     A            PLDATA        10A         ALIAS(PLDATA_EDI867)
     A                                      TEXT('PL DATA')
     A            PLANT          3A         ALIAS(PLANT_EDI867)
     A                                      TEXT('PLANT')
     A            FRANID         1A         ALIAS(FRANID_EDI867)
     A                                      TEXT('FRANID')
     A            ABSTFILE       5A         ALIAS(ABSTFILE_EDI867)
     A                                      TEXT('ABSTFILE SEQ#')
     A            DATE           6A         ALIAS(DATE_EDI867)
     A                                      TEXT('DATE (YYMMDD)')
     A            TIME           6A         ALIAS(TIME_EDI867)
     A                                      TEXT('TIME (HHMMSS)')
     A            PLANT2         3A         ALIAS(PLANT2_EDI867)
     A                                      TEXT('PLANT')
     A            CORPCODE       7A         ALIAS(CORPCODE_EDI867)
     A                                      TEXT('CORPORATE CODE')
     A            DEPTCHGD       4A         ALIAS(DEPTCHGD_EDI867)
     A                                      TEXT('DEPT CHARGED')
     A            EMPLOYEE       4A         ALIAS(EMPLOYEE_EDI867)
     A                                      TEXT('EMPLOYEE')
     A            QUANTITY       8S 0       ALIAS(QUANTITY_EDI867)
     A                                      TEXT('QUANTITY')
     A            COST          13S 2       ALIAS(COST_EDI867)
     A                                      TEXT('COST')
     A            UM             2A         ALIAS(UM_EDI867)
     A                                      TEXT('UNIT OF MEASURE')
     A            EXPCLASS       6A         ALIAS(EXPCLASS_EDI867)
     A                                      TEXT('EXPENSE CLASS')
     A            DEPTRQST       4A         ALIAS(DEPTRQST_EDI867)
     A                                      TEXT('REQUESTING DEPT')
     A            CLASS          3A         ALIAS(CLASS_EDI867)
     A                                      TEXT('CLASS')
     A            CURRENCY       3A         ALIAS(CURRENCY_EDI867)
     A                                      TEXT('CURRENCY CODE')
