     A                                      REF(EDI867REF)
     A          R EDI867FILR
     A            PLDATA    R
     A            PLANT     R
     A            FRANID    R
     A            ABSTFILE  R
     A            DATE      R
     A            TIME      R
     A            PLANT2    R
     A            CORPCODE  R
     A            DEPTCHGD  R
     A            EMPLOYEE  R
     A            QUANTITY  R
     A            COST      R
     A            UM        R
     A            EXPCLASS  R
     A            DEPTRQST  R
     A            CLASS     R
     A            CURRENCY  R
