     A          R REQPREF
     A            EQRCORPTYP     8A         ALIAS(EQRCORPTYP_ER)
     A            EQRCOR1       66A         ALIAS(EQRCOR1_ER)
     A            EQRCOR2       66A         ALIAS(EQRCOR2_ER)
     A            EQRCOR3       66A         ALIAS(EQRCOR3_ER)
     A            EQRCOR4       66A         ALIAS(EQRCOR4_ER)
     A            EQRCOR5       66A         ALIAS(EQRCOR5_ER)
     A            EQRCOR6       66A         ALIAS(EQRCOR6_ER)
     A            EQRDBVERS     10A         ALIAS(EQRDBVERS_ER)
     A            EQRFLD1       16A         ALIAS(EQRFLD1_ER)
     A            EQRFLD2       16A         ALIAS(EQRFLD2_ER)
     A            EQRFLD3       16A         ALIAS(EQRFLD3_ER)
     A            EQRFLD4       16A         ALIAS(EQRFLD4_ER)
     A            EQRFLD5       16A         ALIAS(EQRFLD5_ER)
     A            EQRFLD6       16A         ALIAS(EQRFLD6_ER)
     A            EQRFLD7       16A         ALIAS(EQRFLD7_ER)
     A            EQRFLD8       16A         ALIAS(EQRFLD8_ER)
     A            EQRFNAMEIG    16A         ALIAS(EQRFNAMEIG_ER)
     A            EQRFNAMFIV    16A         ALIAS(EQRFNAMFIV_ER)
     A            EQRFNAMFOU    16A         ALIAS(EQRFNAMFOU_ER)
     A            EQRFNAMONE    16A         ALIAS(EQRFNAMONE_ER)
     A            EQRFNAMSEV    16A         ALIAS(EQRFNAMSEV_ER)
     A            EQRFNAMSIX    16A         ALIAS(EQRFNAMSIX_ER)
     A            EQRFNAMTHR    16A         ALIAS(EQRFNAMTHR_ER)
     A            EQRFNAMTWO    16A         ALIAS(EQRFNAMTWO_ER)
     A            EQRMFG        16A         ALIAS(EQRMFG_ER)
     A            EQRMOD        16A         ALIAS(EQRMOD_ER)
     A            EQRNAME1      16A         ALIAS(EQRNAME1_ER)
     A            EQRNAME2      16A         ALIAS(EQRNAME2_ER)
     A            EQRNAME3      16A         ALIAS(EQRNAME3_ER)
     A            EQRNAME4      16A         ALIAS(EQRNAME4_ER)
     A            EQRNAME5      16A         ALIAS(EQRNAME5_ER)
     A            EQRNAME6      16A         ALIAS(EQRNAME6_ER)
     A            EQRNAME7      16A         ALIAS(EQRNAME7_ER)
     A            EQRNAME8      16A         ALIAS(EQRNAME8_ER)
     A            EQROPS1       66A         ALIAS(EQROPS1_ER)
     A            EQROPS2       66A         ALIAS(EQROPS2_ER)
     A            EQROPS3       66A         ALIAS(EQROPS3_ER)
     A            EQROPS4       66A         ALIAS(EQROPS4_ER)
     A            EQROPS5       66A         ALIAS(EQROPS5_ER)
     A            EQROPS6       66A         ALIAS(EQROPS6_ER)
     A            EQRPROPNUM     8A         ALIAS(EQRPROPNUM_ER)
     A            EQRREM1       66A         ALIAS(EQRREM1_ER)
     A            EQRREM10      66A         ALIAS(EQRREM10_ER)
     A            EQRREM11      66A         ALIAS(EQRREM11_ER)
     A            EQRREM12      66A         ALIAS(EQRREM12_ER)
     A            EQRREM2       66A         ALIAS(EQRREM2_ER)
     A            EQRREM3       66A         ALIAS(EQRREM3_ER)
     A            EQRREM4       66A         ALIAS(EQRREM4_ER)
     A            EQRREM5       66A         ALIAS(EQRREM5_ER)
     A            EQRREM6       66A         ALIAS(EQRREM6_ER)
     A            EQRREM7       66A         ALIAS(EQRREM7_ER)
     A            EQRREM8       66A         ALIAS(EQRREM8_ER)
     A            EQRREM9       66A         ALIAS(EQRREM9_ER)
     A            EQRSER        16A         ALIAS(EQRSER_ER)
     A            EQRSUBKEY     10A         ALIAS(EQRSUBKEY_ER)
     A            EQRTYCOR1     66A         ALIAS(EQRTYCOR1_ER)
     A            EQRTYCOR2     66A         ALIAS(EQRTYCOR2_ER)
     A            EQRTYCOR3     66A         ALIAS(EQRTYCOR3_ER)
     A            EQRTYCOR4     66A         ALIAS(EQRTYCOR4_ER)
     A            EQRTYCOR5     66A         ALIAS(EQRTYCOR5_ER)
     A            EQRTYCOR6     66A         ALIAS(EQRTYCOR6_ER)
     A            EQRTYFLD1     16A         ALIAS(EQRTYFLD1_ER)
     A            EQRTYFLD2     16A         ALIAS(EQRTYFLD2_ER)
     A            EQRTYFLD3     16A         ALIAS(EQRTYFLD3_ER)
     A            EQRTYFLD4     16A         ALIAS(EQRTYFLD4_ER)
     A            EQRTYFLD5     16A         ALIAS(EQRTYFLD5_ER)
     A            EQRTYFLD6     16A         ALIAS(EQRTYFLD6_ER)
     A            EQRTYFLD7     16A         ALIAS(EQRTYFLD7_ER)
     A            EQRTYFLD8     16A         ALIAS(EQRTYFLD8_ER)
     A            EQRTYMFG      16A         ALIAS(EQRTYMFG_ER)
     A            EQRTYMOD      16A         ALIAS(EQRTYMOD_ER)
     A            EQRTYNAM1     16A         ALIAS(EQRTYNAM1_ER)
     A            EQRTYNAM2     16A         ALIAS(EQRTYNAM2_ER)
     A            EQRTYNAM3     16A         ALIAS(EQRTYNAM3_ER)
     A            EQRTYNAM4     16A         ALIAS(EQRTYNAM4_ER)
     A            EQRTYNAM5     16A         ALIAS(EQRTYNAM5_ER)
     A            EQRTYNAM6     16A         ALIAS(EQRTYNAM6_ER)
     A            EQRTYNAM7     16A         ALIAS(EQRTYNAM7_ER)
     A            EQRTYNAM8     16A         ALIAS(EQRTYNAM8_ER)
     A            EQRTYOPS1     66A         ALIAS(EQRTYOPS1_ER)
     A            EQRTYOPS2     66A         ALIAS(EQRTYOPS2_ER)
     A            EQRTYOPS3     66A         ALIAS(EQRTYOPS3_ER)
     A            EQRTYOPS4     66A         ALIAS(EQRTYOPS4_ER)
     A            EQRTYOPS5     66A         ALIAS(EQRTYOPS5_ER)
     A            EQRTYOPS6     66A         ALIAS(EQRTYOPS6_ER)
     A            EQRTYPROPN     8A         ALIAS(EQRTYPROPN_ER)
     A            EQRTYREM1     66A         ALIAS(EQRTYREM1_ER)
     A            EQRTYREM10    66A         ALIAS(EQRTYREM10_ER)
     A            EQRTYREM11    66A         ALIAS(EQRTYREM11_ER)
     A            EQRTYREM12    66A         ALIAS(EQRTYREM12_ER)
     A            EQRTYREM2     66A         ALIAS(EQRTYREM2_ER)
     A            EQRTYREM3     66A         ALIAS(EQRTYREM3_ER)
     A            EQRTYREM4     66A         ALIAS(EQRTYREM4_ER)
     A            EQRTYREM5     66A         ALIAS(EQRTYREM5_ER)
     A            EQRTYREM6     66A         ALIAS(EQRTYREM6_ER)
     A            EQRTYREM7     66A         ALIAS(EQRTYREM7_ER)
     A            EQRTYREM8     66A         ALIAS(EQRTYREM8_ER)
     A            EQRTYREM9     66A         ALIAS(EQRTYREM9_ER)
     A            EQRTYSER      16A         ALIAS(EQRTYSER_ER)
     A            EQRTYSUBK     12A         ALIAS(EQRTYSUBK_ER)
     A            EQRVERSDAT     8A         ALIAS(EQRVERSDAT_ER)
     A            EQRVERSPAD    40A         ALIAS(EQRVERSPAD_ER)
     A            EQRVERSTIM     4A         ALIAS(EQRVERSTIM_ER)
