     A                                      REF(STORES)
     A          R MCRPCS4800
     A            EDILOGRECNR
     A            EDILOGTYPER
     A            EDILOGKEY R
     A            CENTURY1       2A         DFT('19')
     A            EDILOGINDAR
     A            EDILOGINTIR
     A            CENTURY2       2A         DFT('19')
     A            EDILOGSEDAR
     A            EDILOGSETIR
     A            EDILOGSEQSR
     A            EDILOGVEAKR
     A            EDILOGTRAKR
     A            EDILOGFLGSR
     A            EDILOGVENDR
     A            EDILOGTRINR
     A            EDILOGBANOR
     A            EDILOGITMNR
     A            EDILOGPGMNR
     A            EDILOGFILLR
