     A                                      REF(MMISA)
     A          R MCRPMM0300
     A            PERCCNUM  R
     A            PERNAME   R
     A            PERCRAFT  R
     A            PERZONE   R
     A            PERTMPZONER
     A            PERDEPT   R
     A            PERCOST   R
     A            PERRATING R
     A            PERSHFCREWR
     A            CENTURY1       2A         DFT('19')
     A            PERCSD    R
     A            PERAYEAR1 R
     A            PERAYEAR2 R
     A            PERAYEAR3 R
     A            PERPWORD  R
     A            PERPAD    R
