     A                                      REF(STORES)
     A          R MCRPCS2000
     A            REQNO     R
     A            REQRELSTATR
     A            CENTURY1       2A         DFT('19')
     A            REQRLMCDTER
     A            RCVDEPT   R
     A            FORDEPT   R
     A            CENTURY2       2A         DFT('19')
     A            REQDTE    R
     A            CENTURY3       2A         DFT('19')
     A            REQDTEWTD R
     A            CENTURY4       2A         DFT('19')
     A            SHIPDTE   R
     A            ACCTGINFO R
     A            BUDGETNO  R
     A            BUDGETAMT R
     A            REQSTS    R
     A            PAYTERMS  R
     A            ADDLINFO  R
     A            REQORIG   R
     A            FOB       R
     A            HOLDSTSCDER
     A            HOLDSTATUSR
     A            STAGELOC  R
     A            ITMFLGS   R
     A            PAD20     R
