     A                                      REF(CSACCT)
     A          R MCRPCAMTD
     A            MATLCODE  R
     A            ACTGCLASS R
     A            DEPT      R
     A            ACCOUNT   R
     A            PONUM     R
     A            RCVRNUM   R
     A            ITEMNUMBERR
     A            TRANSCODE R
     A            CENTURY1       2A         DFT('19')
     A            TRANSDATE R
     A            TRANSTIME R
     A            TRANSEMP  R
     A            QUANTITY  R
     A            VALUE     R
     A            DOCNO     R
     A            UNTMEASURER
     A            BALQTY    R
