     A          R MCFRCSTERM
     A            CENTURY1       2A         DFT('19')
     A            KTERMDAT       6A
     A            KTERMTIM       6A
     A            KTERMVEN      10A
     A            KTERMPO       14A
     A            KTERMPOTRM     1A
     A            KTERMRCVRT     1A
