     A                                      REF(EQPREF)
     A          R MCRPER0800
     A            EQRDBVERS R
     A            CENTURY1       2A         DFT('19')
     A            EQRVERSDATR
     A            EQRVERSTIMR
     A            EQRVERSPADR
