     A                                      REF(STORES)
     A          R MCRPCS2400
     A            PORCVNO   R
     A            FRTTYPE   R
     A            EMPLOYID  R
     A            FRTPACKSLPR
     A            FRTCARRIERR
     A            FRTBILLNO R
     A            FRTCHRGS  R
     A            CENTURY1       2A         DFT('19')
     A            FRTBILLDTER
     A            CENTURY2       2A         DFT('19')
     A            DTERCVD   R
     A            FRTDTEARR R
     A            FRTSPLC   R
     A            FRTCARRWT R
     A            FRTOURWT  R
     A            FRTRAILCARR
     A            FRTSEALS  R
     A            FRTOSD    R
     A            FRTREFERBKR
     A            REGISTERNOR
     A            PAD04     R
     A            FRTLOT    R
     A            FRTOSDCLM R
