     A                                      REF(MMISA)
     A          R MCRPMM1100
     A            WONUM     R
     A            WOSTATUS  R
     A            REOPENDEL R
     A            CENTURY1       2A         DFT('19')
     A            DATERECD  R
     A            TIMERECD  R
     A            APPRVLCOD R
     A            REQUESTER R
     A            EQPNUM    R
     A            EQPNAME   R
     A            EQPTYPE   R
     A            EQPDEPT   R
     A            ZONEPRTY  R
     A            EQPLOC    R
     A            EQPDOWN   R
     A            EXPCLASS  R
     A            RIME      R
     A            CENTURY2       2A         DFT('19')
     A            DATEREQD  R
     A            TIMEREQD  R
     A            DESCRIPT1 R
     A            DESCRIPT2 R
     A            DESCRIPT3 R
     A            SPECLINSTRR
     A            SPECLEQUIPR
     A            SAFETYNOTER
     A            ENGINEER  R
     A            ENGRIND   R
     A            PLANNER   R
     A            PLNRIND   R
     A            SCHEDULER R
     A            SCHDIND   R
     A            CENTURY3       2A         DFT('19')
     A            DATESCHD  R
     A            TIMESCHD  R
     A            BUDGETNO  R
     A            REQUESTNO R
     A            CENTURY4       2A         DFT('19')
     A            DATESTRT  R
     A            TIMESTRT  R
     A            FAILCODE  R
     A            CENTURY5       2A         DFT('19')
     A            DATECOMP  R
     A            TIMECOMP  R
     A            SAVEHISTSWR
     A            LASTJOBSEQR
     A            STRTSTATUSR
     A            LASTSUFFIXR
     A            PLDSEQNUM R
     A            CENTURY6       2A         DFT('19')
     A            PLDDELDATER
     A            PLDPAD    R
     A            PMJOBPKEY R
     A            PMSCHEDKEYR
