     A                                      REF(STHIST)
     A          R MCRPST5400
     A            PORCVNO   R
     A            ITMNO     R
     A            CORPCDE   R
     A            CENTURY1       2A         DFT('19')
     A            DTECORRECTR
     A            RCVCORRECTR
