     A                                      REF(STORES)
     A          R MCRPCS0300
     A            WLKEY     R
     A            CENTURY1       2A         DFT('19')
     A            WLDTE     R
