     A                                      REF(MMISA)
     A          R MCRPMM1300
     A            WONUM     R
     A            LBRCCNUM  R
     A            LBRNAME   R
     A            LBRCRAFT  R
     A            LBRHOURS  R
     A            CENTURY1       2A         DFT('19')
     A            LBRDATE   R
     A            LBRSHIFT  R
     A            LBRCOST   R
     A            CENTURY2       2A         DFT('19')
     A            LBRSTDATE R
     A            LBRSTTIME R
     A            CENTURY3       2A         DFT('19')
     A            LBRCPDATE R
     A            LBRCPTIME R
     A            LBRCREW   R
     A            LBRPAD    R
