     A                                      REF(MMISA)
     A          R MCRPMM2600
     A            WONUM     R
     A            CENTURY1       2A         DFT('19')
     A            DATESTAMP R
     A            TIMESTAMP R
     A            WOTYPESTATR
     A            USERNAME  R
     A            USERTERM  R
     A            USERID    R
     A            CLOCKCARD R
     A            WOSTATUS  R
     A            TRANSTATUSR
     A            PROGRAM   R
