     A                                      REF(MMISA)
     A          R MCRPMM1000
     A            WONUM     R
     A            WOSTATUS  R
     A            CENTURY1       2A         DFT('19')
     A            DATERECD  R
     A            TIMERECD  R
     A            APPRVLCOD R
     A            REQUESTER R
     A            EQPNUM    R
     A            EQPNAME   R
     A            EQPTYPE   R
     A            EQPDEPT   R
     A            ZONEPRTY  R
     A            EQPLOC    R
     A            EQPDOWN   R
     A            EXPCLASS  R
     A            DESCRIPT1 R
     A            DESCRIPT2 R
     A            CRAFTREQD1R
     A            CRAFTREQD2R
     A            CRAFTREQD3R
     A            CRAFTSMEN1R
     A            CRAFTSMEN2R
     A            CRAFTSMEN3R
     A            CENTURY2       2A         DFT('19')
     A            DATESTRT  R
     A            TIMESTRT  R
     A            FAILCODE  R
     A            CENTURY3       2A         DFT('19')
     A            DATECOMP  R
     A            TIMECOMP  R
     A            STRTSTATUSR
     A            BASSEQNUM R
     A            CENTURY4       2A         DFT('19')
     A            BASDELDATER
     A            BASPAD    R
