     A                                      REF(STORES)
     A          R MCRPCS0800
     A            VENCDE    R
     A            LEADTIMES1R
     A            LEADTIMES2R
     A            LEADTIMES3R
     A            CORPCDE   R
     A            VENOFRCD  R
     A            VENPRICE  R
     A            PRICEUM   R
     A            CENTURY1       2A         DFT('19')
     A            VENPRICEDTR
     A            VENDSCT   R
     A            PAYTERMS  R
     A            FOB       R
     A            VENESTLT  R
     A            QUOTENUM  R
     A            BUYERCDE  R
     A            VENLOWQTY1R
     A            VENLOWQTY2R
     A            VENLOWQTY3R
     A            VENHGHQTY1R
     A            VENHGHQTY2R
     A            VENHGHQTY3R
     A            VENQTYUM1 R
     A            VENQTYUM2 R
     A            VENQTYUM3 R
     A            VENWRKPRC1R
     A            VENWRKPRC2R
     A            VENWRKPRC3R
     A            VENTXTFLG R
     A            CENTURY2       2A         DFT('19')
     A            EXPECTDTE R
     A            CENTURY3       2A         DFT('19')
     A            VENRTNDTE R
     A            CENTURY4       2A         DFT('19')
     A            VENDTERCVDR
     A            VENBIDQTY R
     A            VENSPLC   R
     A            QTYUM     R
     A            ITEMNO    R
     A            REQNO     R
     A            VENDSCTPCTR
     A            VENSURCHRGR
     A            VENREFER  R
     A            PAD08     R
