     A                                      REF(MMISA)
     A          R MCRPMM1600
     A            PERCCNUM  R
     A            WONUM     R
     A            CENTURY1       2A         DFT('19')
     A            STARTDATE R
     A            STARTTIME R
     A            CENTURY2       2A         DFT('19')
     A            COMPLDATE R
     A            COMPLTIME R
     A            CURSTATPADR
