     A                                      REF(MMISA)
     A          R MCRPMM2400
     A            CENTURY1       2A         DFT('19')
     A            DATEINIT  R
     A            TIMEINIT  R
     A            FROMCC    R
     A            FROMSIGNONR
     A            TOCC      R
     A            TOWO      R
     A            MESSAGE1  R
     A            MESSAGE2  R
     A            MESSAGE3  R
     A            MESSAGE4  R
     A            MESSAGE5  R
     A            MESSAGEPADR
