     A          R KELLYINVFL
     A            PLANT          1A
     A                                      TEXT('KELLY PLANT ID           ')
     A            CORPCDE        7A
     A                                      TEXT('CORP CODE                ')
     A            ONHAND         9S
     A                                      TEXT('ONHAND                   ')
     A            UNITCOST       9S
     A                                      TEXT('UNIT COST                ')
     A            DLTFLAG        1A
     A                                      TEXT('PRAPS DELETE FLAG        ')
