     A                                      REF(MACOS)
     A          R MACOSDTL
     A            PLANTID   R
     A            PLANT     R
     A            DATE      R
     A            DATERECD  R
     A            MATERIAL  R
     A            VENDORNAMER
     A            UM        R
     A            QTYRCVD   R
     A            UMORIG    R
     A            QTYORIG   R
     A            PO        R
     A            RCVR      R
     A            ITEM      R
     A            VENDORCODER
     A            CORPCODE  R
     A            PAD44     R
