     A          R MCRPCS6500                PFILE(MCFPCS6500)
     A          K FRANID
     A          K ABSTSEQNO
     A          K DATECYMD
     A          K DLYTCTIME
