     A                                      UNIQUE
     A          R MCRPCS5800                PFILE(MCFPCS5800)
     A          K VENCDE
     A          K VENCALTKEY
