     A                                      UNIQUE
     A          R DOCDTL                    PFILE(MCFPDS0300)
     A          K FLRNAM
     A          K DOCNAM
