     A*--------------------------------------------------------------*
     A*  Source Retrieval from Retrieve Database Source (RTVDBSRC)   *
     A*                                                              *
     A*                           \\\\\\\                            *
     A*                          ( o   o )                           *
     A*---------------------oOOO----(_)----OOOo----------------------*
     A*                                                              *
     A*  Logical file . . . :  MCFLSC0104                            *
     A*  Text . . . . . . . :  SAFETY-CONTACT  Logical file (SCDA    *
     A*  Date . . . . . . . :  March 5, 2003                         *
     A*                                                              *
     A*                   OOOOO              OOOOO                   *
     A*                   (    )             (    )                  *
     A*--------------------(   )-------------(   )-------------------*
     A*                     (_)               (_)                    *
     A*                                                              *
     A* MODIFICATION LOG :                                           *
     A*                                                              *
     A*            Task   Programmer/                                *
     A*   Date      No.   Description                                *
     A* ========  ======  ========================================== *
     A* 03/05/03          Creation Date                              *
     A*                                                              *
     A*--------------------------------------------------------------*
      *
     A          R MCRPSC0100
     A                                      PFILE(MCFPSC0100)
      *
     A            SCDATESTMP     8A         TEXT('SAFETY CONTACT DATE STAMP')
     A                                      COLHDG('SCDATESTMP')
     A                                      ALIAS(SCDATESTAMP)
     A            SCTIMESTMP     4A         TEXT('SAFETY CONTACT TIME STAMP')
     A                                      COLHDG('SCTIMESTMP')
     A                                      ALIAS(SCTIMESTAMP)
     A            SCINITCC       4A         TEXT('SAFETY CONTACT INITIATOR')
     A                                      COLHDG('SCINITCC')
     A                                      ALIAS(SCCLOCKCARD)
     A            SCINITIATE    16A         TEXT('SAFETY CONTACT INITIATOR')
     A                                      COLHDG('SCINITIATE')
     A                                      ALIAS(SCINITIATOR)
     A            SCEQPNUM       6A         TEXT('SAFETY CONTACT EQUIPMENT')
     A                                      COLHDG('SCEQPNUM')
     A                                      ALIAS(SCEQUIPNUM)
     A            SCEQPNAME     50A         TEXT('SAFETY CONTACT EQUIP NAME')
     A                                      COLHDG('SCEQPNAME')
     A                                      ALIAS(SCEQUIPNAME)
     A            SCZONE         4A         TEXT('SAFETY CONTACT ZONE')
     A                                      COLHDG('SCZONE')
     A                                      ALIAS(SCEQPZONE)
     A            SCDESCONE     30A         TEXT('SAFETY CONTACT LOCATION')
     A                                      COLHDG('SCDESCONE')
     A                                      ALIAS(SCDESCRIPTION1)
     A            SCDESCTWO    132A         TEXT('OBSERVATION/ACTION')
     A                                      COLHDG('SCDESCTWO')
     A                                      ALIAS(SCDESCRIPTION2)
     A            SCDELDATE      8A         TEXT('SAFETY CONTACT PURGE DATE')
     A                                      COLHDG('SCDELDATE')
     A                                      ALIAS(SCPURGEDATE)
      *
     A          K SCDATESTMP
     A          K SCDESCONE
     A          K SCTIMESTMP
