     A                                      UNIQUE
     A          R MCFPCSPRNT                PFILE(MCFPCSPRNT)
     A          K KPRTUSER
     A          K KPRTTERM
