      ***************************************************************
      * FILE NAME : MCFPAB1900
      *
      * PURPOSE   : DATAQ PARAMETER FILE
      *
      * CREATED   : 11/26/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      ***************************************************************
      * SPECIAL NOTES: XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB1900
     A            DQNAME    R               COLHDG('DATAQ' 'NAME')
     A                                      TEXT('DTAQ NAME')
     A            DQPRC     R               COLHDG('PROCESS' 'NAME')
     A                                      TEXT('DTAQ PROCESS')
     A            DQPGM     R               COLHDG('DATAQ' 'PROGRAM')
     A                                      TEXT('DATAQ PROGRAM')
     A            DQLIBR    R               REFFLD(DQLIBR)
     A                                      COLHDG('DATAQ' 'LIBRARY')
     A                                      TEXT('DATAQ LIBRARY')
     A            DQSLEN    R               COLHDG('SEND' 'DATAQ LENGTH')
     A                                      TEXT('SEND DATAQ LENGTH')
     A            DQRLEN    R               COLHDG('RCV' 'DATAQ LENGTH')
     A                                      TEXT('RCV DATAQ LENGTH')
     A            DQWAIT    R               COLHDG('DATAQ' 'WAIT TIME')
     A                                      TEXT('DATAQ WAIT TIME')
     A            DQKEYOR   R               COLHDG('DATAQ' 'KEY ORDER')
     A                                      TEXT('DATAQ KEY ORDER')
     A            DQSNDKL   R               REFFLD(DQKEYLN)
     A                                      ALIAS(DATAQ_SEND_KEYLN_CS)
     A                                      COLHDG('SEND' 'DATAQ KEY LENGTH')
     A                                      TEXT('SEND DATAQ KEY LENGTH')
     A            DQRCVKL   R               REFFLD(DQKEYLN)
     A                                      ALIAS(DATAQ_RCV_KEYLN_CS)
     A                                      COLHDG('RCV' 'DATAQ KEY LENGTH')
     A                                      TEXT('RCV DATAQ KEY LENGTH')
     A            DQSNDRLN  R               COLHDG('RCV' 'SNDR DTA LEN')
     A                                      TEXT('RCV SENDER DATA LENGTH')
     A            DQRMVMSG  R               COLHDG('REMOVE PARM')
     A                                      TEXT('REMOVE PARM')
     A            DQASYNCRQ R               COLHDG('ASYNC RQST')
     A                                      TEXT('ASYNC RQST')
     A            DQRCVRSZ  R               COLHDG('RECEIVER SIZE')
     A                                      TEXT('RECEIVER SIZE')
