     A                                      REF(STORES)
     A          R MCRPCS1300
     A            CORPCDE   R
     A            RSVWONO   R
     A            RSVQTY    R
     A            RSVMACH   R
     A            RSVMACHSUBR
     A            STAGELOC  R
     A            RSVUSEDEPTR
     A            RSVDTE    R
     A            PAD24     R
