     A                                      REF(MMISA)
     A          R MCRPMM2500
     A            SHIFTZONE R
     A            SHIFTCODE R
     A            FRSTSHIFT R
     A            SCNDSHIFT R
     A            THRDSHIFT R
     A            FRTHSHIFT R
     A            SHIFTPAD  R
