     A                                      REF(STORES)
     A          R MCRPCS3400
     A            KEYWORDADJR
     A            CORPCDE   R
     A            LNGUAGEINDR
