     A                                      REF(STHIST)
     A          R MCRPST0200
     A            VENCDE    R
     A            VENITMNO  R
     A            VENITMDTA R
