     A                                      REF(BUDGET)
     A          R MCRPBG1100
     A            BUDGETNUM R
     A            PWONUM    R
     A            LABORCOM  R
     A            TSIGN     R
     A            LABORSTAMPR
     A            PAD10     R
