     A                                      REF(STORES)
     A          R MCRPCS2800
     A            CORPCDE   R
     A            REQINDXSTSR
     A            REQNUMMMISR
