     A          R MCRPCSUSAG
     A            DELETEFLAG     2A
     A            CORPCDE        8A
     A            USAGJAN        9B
     A            USAGFEB        9B
     A            USAGMAR        9B
     A            USAGAPR        9B
     A            USAGMAY        9B
     A            USAGJUN        9B
     A            USAGJUL        9B
     A            USAGAUG        9B
     A            USAGSEP        9B
     A            USAGOCT        9B
     A            USAGNOV        9B
     A            USAGDEC        9B
     A            USAGMTD        9B
     A            USAGYES        9B
     A            USAGJANDD      9B
     A            USAGFEBDD      9B
     A            USAGMARDD      9B
     A            USAGAPRDD      9B
     A            USAGMAYDD      9B
     A            USAGJUNDD      9B
     A            USAGJULDD      9B
     A            USAGAUGDD      9B
     A            USAGSEPDD      9B
     A            USAGOCTDD      9B
     A            USAGNOVDD      9B
     A            USAGDECDD      9B
     A            USAGMTDDD      9B
     A            USAGYESDD      9B
