      ***************************************************************
      * FILE NAME : MCFPAB2700
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : ARIBA CATALOG OVERRIDE FILE
      *             USED TO PRESERVE ITEM PREFERRENCE OVERRIDES
      *
      * CREATED   : 10/09/2003
      * AUTHOR    : EXLTECH, LLC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES: 1) SEE COBOL COPYMBR DARIBOVR
      *
      *                2) THIS FILE IS ALMOST A MIRROR IMAGE OF THE
      *                   CATALOG FILE. THE ONLY EXCEPTION IS THE
      *                   FIELD "ACTFLG" HAS BEEN ADDED TO THE END.
      *                   OVERRIDE IS ACTIVE - ACTFLG = "Y" OR "N"
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB2700
     A            CORPCDE   R
     A            MANUFACT  R               REFFLD(MANUFACT50)
     A            MANPARTNO R               REFFLD(PARTNO50)
     A                                      COLHDG('MANUFACT PART NBR')
     A                                      TEXT('MANUFACT PART NBR')
     A                                      ALIAS(MANPARTNO_CS)
     A            VENCDE    R
     A            VENPARTNO R
     A            VENAUXID  R               REFFLD(AUXID)
     A                                      COLHDG('VENDOR AUXILLARY ID')
     A                                      TEXT('VENDOR AUXILLARY ID')
     A                                      ALIAS(VENAUXID_CS)
     A**
     A            VENPRICE  R               REFFLD(PRICE15C3)
     A                                      COLHDG('VENDOR PRICE')
     A                                      TEXT('VENDOR PRICE')
     A                                      ALIAS(VENPRICE_CS)
     A**
     A            CNVPRICE  R               REFFLD(PRICE15C3)
     A                                      COLHDG('CONVER PRICE')
     A                                      TEXT('CONVER PRICE')
     A                                      ALIAS(CNVPRICE_CS)
     A**
     A            EMPPRICE  R               REFFLD(PRICE15C3)
     A                                      COLHDG('EMPTY PRICE')
     A                                      TEXT('EMPTY PRICE')
     A                                      ALIAS(EMPTY_PRICE_CS)
     A**
     A            VENUOM    R               REFFLD(UOM)
     A                                      COLHDG('VENDOR UM')
     A                                      TEXT('VENDOR UM')
     A                                      ALIAS(VENUM_CS)
     A**
     A            STRUOM    R               REFFLD(UOM)
     A                                      COLHDG('STOREROOM UM')
     A                                      TEXT('STOREROOM UM')
     A                                      ALIAS(STOREROOM_UM_CS)
     A**
     A            QTYUOM    R               REFFLD(QTYUM)
     A**
     A            CURRCODE  R               REFFLD(CURRNCYCDE)
     A                                      COLHDG('CURR CODE')
     A                                      TEXT('CURR CODE')
     A                                      ALIAS(CURR_CODE_CS)
     A**
     A            HOMECURRCDR               REFFLD(CURRNCYCDE)
     A                                      COLHDG('HOME CURR CODE')
     A                                      TEXT('HOME CURR CODE')
     A                                      ALIAS(HOME_CURR_CODE_CS)
     A**
     A            PREFFLAG  R               REFFLD(FLAG1)
     A                                      COLHDG('PREFERNCE FLAG')
     A                                      TEXT('PREF FLAG')
     A                                      ALIAS(PREF_FLAG_CS)
     A**
     A            OVRFLAG   R               REFFLD(FLAG1)
     A                                      COLHDG('OVRD FLAG')
     A                                      TEXT('OVER RIDE FLAG')
     A                                      ALIAS(OVER_FLAG_CS)
     A**
     A            RSNCODE   R               REFFLD(RSNCDE)
     A                                      COLHDG('REASON CODE')
     A                                      TEXT('REASON CODE')
     A                                      ALIAS(RSNCODE_CS)
     A**
     A            DATETIME14R
     A**
     A            ACTFLAG   R               REFFLD(FLAG1)
     A                                      COLHDG('ACTIVE FLAG')
     A                                      TEXT('ACTIVE_FLAG')
     A                                      ALIAS(ACTIVE_FLAG_CS)
     A            PAD04     R
