     A                                      REF(STORES)
     A          R MCRPCS5500
     A            CORPCDE   R
     A            CHATNO    R
     A            MANUFACT  R
     A            TRADENM   R
