     A                                      REF(STORES)
     A          R MCRPCS3100
     A            CORPCDE   R
     A            DESCIDNUM R
     A            DESCDTA   R
