     A                                      REF(MMISA)
     A          R MCRPMM1400
     A            PMEQPNUM  R
     A            PMEQPRIME R
     A            WONUM     R
     A            PMLEVEL   R
     A            PMCYCLE   R
     A            PMOPSHOURSR
     A            PMPCCOUNT R
     A            PMADLCYCLER
     A            PMCRITICALR
     A            PMLOKAHEADR
     A            PMPREREL  R
     A            PMPRIORITYR
     A            PMLASTREL R
     A            PMNEXTREL R
     A            PMSCHEDDT R
     A            PMLASTCOMPR
     A            PMEFFLAGS R
     A            PMPAD     R
