     A                                      REF(MMISA)
     A          R MCRPMM1700
     A            HIERKEY   R
     A            HIERDSPCODR
     A            HIERSUBNAMR
