     A          R ECCRECORD                 TEXT('ECCFILE / PHYSICAL')
     A            ECCTYPCODE     6A         COLHDG('EEC CODE')
     A            ECCDESC       50A         COLHDG('CODE DESC')
     A            ECCERRNO       6A         COLHDG('ERROR NUM')
                K ECCTYPCODE
