     A                                      REF(STORES)
     A          R MCRPCS6500
     A            FRANID    R
     A            ABSTSEQNO R
     A            DATECYMD  R
     A            DLYTCTIME R
     A            CORPCDE   R
     A            DEPTCHGD  R
     A            OVERCTR   R
     A            WONO      R
     A            WOWRKCTR  R
     A            EMPLOYID  R
     A            STRWITHQTYR
     A            STRMKTCOSTR
     A            QTYUM     R
     A            EXPCLASS  R
     A            DEPTRQST  R
     A            CLSS      R
     A            TC        R
