     A                                      REF(MMISA)
     A          R MCRPMM4300
     A            PMSCHEDKEYR
     A            PMLEVEL   R
     A            PMCYCLE   R
     A            PMCRITICALR
     A            PMLOKAHEADR
     A            PMPREREL  R
     A            PMPRIORITYR
     A            PMEFFLAGS R
     A            CREATOR   R
     A            CHANGER   R
     A            DATESTAMP8R
     A            PMPAD     R
