      ***************************************************************
      * FILE NAME : MCFPAB1200
      *
      * PURPOSE   : PROCESSES TO MONITOR
      *
      * CREATED   : 11/27/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************

      **@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
      * THIS FILE RESIDES IN LIBRARY MCPRD0 ONLY  -  COMMON FILE
      **@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB1200
     A            MPPROCESS R               REFFLD(JOBNAME)
     A                                      ALIAS(MP_JOBPROC_CS)
     A                                      COLHDG('JOB PROCESS')
     A                                      TEXT('JOB PROCESS')
     A            MPACTIVEF R               REFFLD(JOBCALLFL)
     A                                      ALIAS(MP_ACTIVEF_CS)
     A                                      COLHDG('ACTIVE FLAG')
     A                                      TEXT('ACTIVE FLAG')
