     A                                      REF(BUDGET)
     A          R MCRPBG0400
     A            PROJECTNUMR
     A            TITLE     R
     A            DESC1     R
     A            DESC2     R
     A            DESC3     R
     A            DESC4     R
     A            DESC5     R
     A            DATEOPENEDR
     A            PADFIELD  R
