     A                                      REF(BUDGET)
     A          R MCRPBG0100
     A            DBVERSION R
     A            DBVERSDATER
     A            DBVERSTIMER
     A            SYSSWITCH R
     A            DEFBUDNUM R
     A            DEFLABEST R
     A            DEFSTREST R
     A            DEFPUREST R
     A            DBVERSPAD R
