     A                                      REF(EQPREF)
     A          R MCRPER0400
     A            EQRTYSUBK R
     A            EQRTYREM1 R
     A            EQRTYREM2 R
     A            EQRTYREM3 R
     A            EQRTYREM4 R
     A            EQRTYREM5 R
     A            EQRTYREM6 R
     A            EQRTYREM7 R
     A            EQRTYREM8 R
     A            EQRTYREM9 R
     A            EQRTYREM10R
     A            EQRTYREM11R
     A            EQRTYREM12R
