     A                                      REF(STORES)
     A          R MCRPCS2100
     A            REQNO     R
     A            PORCVNO   R
     A            VENCDE    R
     A            BUYERCDE  R
     A            WONO      R
     A            ITEMNO    R
     A            WOITEMNO  R
     A            PAD04     R
