     A                                      REF(MMISA)
     A          R MCRPMM2700
     A            NEWSKEY   R
     A            NEWS1     R
     A            NEWS2     R
     A            NEWS3     R
     A            NEWS4     R
     A            NEWS5     R
     A            NEWS6     R
     A            NEWS7     R
     A            NEWS8     R
     A            NEWS9     R
     A            NEWS10    R
