     A                                      REF(STORES)
     A          R MCRPCS7000
     A            CORPCDE   R
     A            DESCIDNUM R
     A            DESCDTA   R
