      ***************************************************************
      * FILE NAME : MCFPAB3200
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : PIN DOWNLOAD UPDATE RESULTS LOG FILE
      *             GOODYEAR COPY
      *
      * CREATED   : 11/05/2003
      * AUTHOR    : COPIED FROM MCFPAB1400
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB3200
     A            SFLAG          1A
     A            MESSAGE       80A
     A            CIFRECRD     300A
     A            DATETIME14R
