     A                                      REF(STORES)
     A          R MCRPCS6200
     A            PORCVNO   R
     A            QUOTENUM  R
     A            APPRSTAT  R
     A            FAXIND    R
     A            FAXNO     R
     A            FAXTIMSTMPR
     A            PAD10     R
