     A                                      REF(MMISA)
     A          R MCRPMM3600
     A            GJOBPSEQ  R
     A            GJOBPDESC R
     A            GJOBPDOWN R
     A            GJOBPCRAFTR
     A            GJOBPMEN  R
     A            GJOBPEST  R
     A            GJOBPLINE R
