     A                                      REF(MMISA)
     A          R MCRPMM3800
     A            GPRTPNAME R
     A            GPRTPSTAT R
     A            GPRTPESTQ R
     A            GPRTPCODE R
     A            GPRTPUM   R
     A            GPRTPUCOSTR
     A            GPRTPPRIMER
     A            GPRTPSUB  R
     A            GPRTPSTAGER
     A            GPRTPCC   R
     A            GPRTPINFO R
     A            GPRTPVEND R
     A            GPRTPDESC1R
     A            GPRTPDESC2R
     A            GPRTPDESC3R
     A            GPRTPDESC4R
     A            GPRTPDESC5R
     A            GPRTPREM1 R
     A            GPRTPREM2 R
     A            GPRTPESTC R
