     A                                      REF(STHIST)
     A          R MCRPST06XX
     A            PORCVNO   R
     A            ITMNO     R
     A            CORPCDE   R
     A            ITMQTYDLVRR
     A            DTERCVD   R
     A            ITMQTYSTOR    12S
     A            ITMDTESTO R
     A            ITMFLAGS  R
     A            ITMKLYQTY R
     A            ITMKLYPOUMR
     A            ITEMUM    R
     A            COMMNT    R
     A            PAD18     R
     A            EECCNTRYORR
     A            EECNETMASSR
     A            EECSUPUNTSR
     A            EECQUAL   R
     A            EECQUALCD R
