     A                                      REF(BUDGET)
     A          R MCRPBG0900
     A            BUDGETNUM R
     A            CHANGENUM R
     A            PERSID    R
     A            PERSNAME  R
     A            CDATESTAMPR
     A            CTIMESTAMPR
     A            TITLE     R
     A            DESC1     R
     A            DESC2     R
     A            DESC3     R
     A            DESC4     R
     A            DESC5     R
     A            PLTAPPRDTER
     A            REGAPPRDTER
     A            AKRAPPRDTER
     A            CAPAPPR   R
     A            CAPCMTD   R
     A            BCAPALARM R
     A            BCAPCUTOFFR
     A            EXPAPPR   R
     A            EXPCMTD   R
     A            BEXPALARM R
     A            BEXPCUTOFFR
     A            BVTAPPR   R
     A            PADFIELD  R
