      ***************************************************************
      * FILE NAME : MCFPDREQ2G
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
      *
      * CREATED   : 10/15/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      * BASED ON HP3000 DATASET DREQLOG DETAIL
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRDREQ2G
     A            REQNO     R
     A            CORPCDE   R
     A            POPLT     R
     A            POORDID   R
