     A                                      REF(DRWFIL)
     A          R MCRPDF0100
     A            DRWNUM    R
     A            DRWREVNUM R
     A            DRWCODEA  R
     A            DRWCODEB  R
     A            DRWDESC   R
     A            DRWEQPNUM R
     A            DRWTYPNUM R
     A            DRWSUBSYS R
     A            DRWZONE   R
     A            DRWDEPT   R
     A            DRWBLDG   R
     A            DRWINITDATR
     A            DRWREVDAT R
     A            DRWKEYLST R
     A            DRWLOC    R
     A            DRWVENCOD R
     A            DRWPAD    R
