     A                                      REF(EQPREF)
     A          R MCRPER0500
     A            EQRSUBKEY R
     A            EQROPS1   R
     A            EQROPS2   R
     A            EQROPS3   R
     A            EQROPS4   R
     A            EQROPS5   R
     A            EQROPS6   R
     A            EQRCOR1   R
     A            EQRCOR2   R
     A            EQRCOR3   R
     A            EQRCOR4   R
     A            EQRCOR5   R
     A            EQRCOR6   R
