     A                                      REF(STORES)
     A          R MCRPCS6600
     A            WLKEY     R
     A            CORPCDE   R
     A            USERID    R
     A            CONTAINNUMR
     A            LOCATION  R
     A            DATECYMD  R
     A            DLYTCTIME R
