     A                                      REF(EQPREF)
     A          R MCRPER0300
     A            EQRSUBKEY R
     A            EQRREM1   R
     A            EQRREM2   R
     A            EQRREM3   R
     A            EQRREM4   R
     A            EQRREM5   R
     A            EQRREM6   R
     A            EQRREM7   R
     A            EQRREM8   R
     A            EQRREM9   R
     A            EQRREM10  R
     A            EQRREM11  R
     A            EQRREM12  R
