     A                                      REF(DOCREF)
     A          R DOCDTL
     A            FLRNAM    R
     A            DOCNAM    R
     A            DESC      R
     A            LASTRV    R
     A            DOCTYP    R
     A            CRTCEN    R
     A            CRTDAT    R
     A            CRTTIM    R
     A            SYSNAM    R
