     A                                      REF(DOCREF)
     A          R MCRPDS0100
     A            SYSTEM    R
     A            SUBSYS    R
     A            SUBSYSDESCR
     A            INCLSUB   R
