     A                                      REF(MMISA)
     A          R MCRPMM1900
     A            ZONEPRTY  R
     A            WONUM     R
     A            EQPDOWN   R
     A            PERCCNUM  R
     A            RIMEXPRTY R
     A            EQPNUM    R
     A            DESCRIPT  R
     A            CRAFTREQD1R
     A            CRAFTREQD2R
     A            CRAFTREQD3R
     A            QUEUEPAD  R
