     A                                      REF(STORES)
     A          R MCRPCS0700
     A            VENCDE    R
     A            VENITMNO  R
     A            VENITMDTA R
