      ***************************************************************
      * FILE NAME : MCFPAB1800
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : PO RECEIVING LOG - COPY #2 FOR AUDIT TRAIL
      *             GOODYEAR COPY
      *
      * CREATED   : 12/27/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB1800
     A            POPLT     R
     A            PORCVNO   R
     A            OLDPONO   R
     A            ITEMNO    R
     A            PORCVQTY  R
     A            PROGNAME  R
     A            DATETIME14R
