     A                                      REF(STORES)
     A          R MCRPCS6400
     A            PORCVNO   R
     A            ITEMNO    R
     A            SEQNO     R
     A            VENCDE    R
     A            CORPCDE   R
     A            ITMQTYORD R
     A            EXPECTDTE R
     A            EARLYDAYS R
     A            LATEDAYS  R
     A            RCVSLIP   R
     A            FRTCARRIERR
     A            ITMQTYDLVRR
     A            DTERCVD   R
     A            CORRACTIONR
     A            PAD10     R
