     A                                      REF(STORES)
     A          R MCRPCS4500
     A            PORCVNO   R
     A            ITEMSEQNO R
     A            SHIPDTE   R
     A            EXPECTDTE R
     A            ITMQTYORD R
     A            PAD20     R
