      ***************************************************************
      * FILE NAME : MCFPAB2500
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : CHECKBOOK DOWNLOAD STAGING FILE
      *             STORES CHECKBOOK DATA PUSHED DOWN FROM ARIBA
      *
      * CREATED   : 12/19/2003
      * AUTHOR    : EXLTECH, LLC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB2500
     A            CBPLT     R               REFFLD(POPLT)
     A            CBREQNO   R               REFFLD(REQNO)
     A**********  CBREQLIN  R    4A         COLHDG('REQ LINE#')
     A**********                            TEXT('REQ LINE#')
     A**********                            ALIAS(REQ_LINENO_CS)
     A            CBUSERID      30A         COLHDG('USER ID')
     A                                      TEXT('USER ID')
     A                                      ALIAS(USER_ID30_CS)
     A            CBREQDTE  R               REFFLD(REQDTE)
     A            CBADDLDTA R               REFFLD(ADDLDTA)
     A            CBACTCLS  R               REFFLD(ACTGCLASS)
     A            CBSUBDTL  R               REFFLD(SUBDETAIL)
     A            CBORDQTY  R               REFFLD(REQQTYTOOR)
     A            CBPRCUOM  R               REFFLD(PRICEUM)
     A            CBPRICE       12S 4       COLHDG('TOT PRICE')
     A                                      TEXT('TOT PRICE')
     A                                      ALIAS(REQ_PRICE_CS)
     A            CBDESC    R               REFFLD(REQDESC)
     A            CBMANUF   R               REFFLD(MANUFACT50)
     A            CBMANPN   R               REFFLD(PARTNO50)
     A            CBCORPCDE R               REFFLD(CORPCDE)
     A            CBPORCVNO R               REFFLD(PORCVNO)
     A            CBSTATUS  R               REFFLD(FLAG1)
     A                                      COLHDG('REQ STATUS')
     A                                      TEXT('REQ STATUS')
     A                                      ALIAS(REQ_STATUS_CS)
     A            CBVENDOR  R               REFFLD(ARBVNDNO)
     A**
     A            DATETIME14R
