     A                                      REF(MMISA)
     A          R MCRPMM2000
     A            ZONEPRTY  R
     A            EQPNUM    R
     A            STARTDATE R
     A            STARTTIME R
     A            ENDDATE   R
     A            ENDTIME   R
     A            REMARKS   R
     A            HOTCODEPADR
