     A                                      REF(MMISA)
     A          R MCRPMM4100
     A            PMJOBPKEY R
     A            JOBPSEQLINR
     A            JOBPWOSEQ R
     A            JOBPDESC  R
     A            JOBPDOWNT R
     A            CRAFTREQD1R
     A            CRAFTREQD2R
     A            CRAFTREQD3R
     A            JOBPMEN   R
     A            JOBPESTHRSR
     A            JOBPLEVEL R
     A            JOBPFLAG  R
     A            JOBPSS    R
     A            PRTNUMBER R
     A            PRTESTQTY R
     A            PRTUM     R
     A            PRTSTATUS R
     A            PRTTEXT   R
     A            PMPAD     R
