     A          R MCFRCSTERM
     A            KTERMDAT       8A
     A            KTERMTIM       6A
     A            KTERMVEN      10A
     A            KTERMPO       14A
     A            KTERMPOTRM     1A
     A            KTERMRCVRT     1A
