     A                                      REF(CSACCT)
     A          R MCRPCA0600
     A            MATLCODE  R
     A            ACTGCLASS R
     A            BEGBALDOL R
     A            BEGBALUNT R
     A            TOTINVDOL R
     A            TOTRCTUNT R
     A            TOTISSUNT R
     A            TOTRTNUNT R
     A            TOTADJUNT R
     A            TOTRTNDOL R
     A            TOTRCTDOL R
     A            UNTRCVNINVR
     A            INVDOLNRCVR
     A            UNTINVNRCVR
     A            INTRNDOL  R
     A            ACTGUNTCORR
     A            ACTDOLCOR R
     A            ACCAMOUNT R
     A            WRTDWNFLAGR
     A            WRTDWNPRC R
     A            UNTMEASURER
     A            DATLSTUPD R
     A            DEPT      R
     A            ACCOUNT   R
     A            RPTCODE   R
     A            TOTISSDOL R
     A            TOTADJDOL R
     A            AVGCSTUPD R
     A            TOTRTNVUNTR
     A            TOTRTNVDOLR
