     A                                      REF(MMISA)
     A          R MCRPMM2200
     A            NOTEKEY   R
     A            MACHNOTE  R
     A            NOTEPAD   R
