     A                                      REF(BUDGET)
     A          R MCRPBG0200
     A            BCAPALARM R
     A            BEXPALARM R
     A            BCAPCUTOFFR
     A            BEXPCUTOFFR
     A            CCAPALARM R
     A            CEXPALARM R
     A            CCAPCUTOFFR
     A            CEXPCUTOFFR
