     A                                      REF(STORES)
     A          R MCRPCS5900
     A            DATECYMD  R
     A            CORPCDE   R
     A            STRWITHQTYR
     A            STRDIRCHRGR
     A            STREXPCLSSR
     A            EMPLOYID  R
     A            STRONH    R
     A            STRUM     R
     A            STRAVGCOSTR
     A            MTDUSAGE  R
     A            STRMAX    R
     A            STRREORDERR
