     A                                      REF(STORES)
     A          R MCRPCS0100
     A            PORCVNO   R
     A            PORCVSTAT R
     A            PORCVSEQ  R
