      ***************************************************************
      * FILE NAME : MCFPAB1600
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : CATALOG SELECTION EXCEPTION FILE
      *
      * CREATED   : 09/18/2003
      * AUTHOR    : EXLTECH, LLC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB1600
     A            REQNO     R
     A            CORPCDE   R
     A            POPLT     R
     A            USERID    R
     A            REQQTY    R               REFFLD(ITMQTYORD)
     A                                      COLHDG('REQ QTY ORDER')
     A                                      TEXT('REQ QTY ORDER')
     A                                      ALIAS(REQ_QTY_ORDER_CS)
     A            REQQTYUM  R               REFFLD(UOM)
     A                                      COLHDG('REQ QTY UOM')
     A                                      TEXT('REQ QTY UOM')
     A                                      ALIAS(REQ_QTY_UOM_CS)
      *========================================
      *= PREFERRED ITEM DATA
      *========================================
     A            PRFMANFNAMR               REFFLD(MANUFACT50)
     A                                      COLHDG('PRF MANF NAME')
     A                                      TEXT('PRF MANF NAME')
     A                                      ALIAS(PRF_MANF_NAME_CS)
     A            PRFMANPARTR               REFFLD(PARTNO50)
     A                                      COLHDG('PRF MANF PARTNO')
     A                                      TEXT('PRF MANF PARTNO')
     A                                      ALIAS(PRF_MANF_PARTNO_CS)
     A            PRFVENCDE R               REFFLD(VENCDE)
     A                                      COLHDG('PRF VENDOR CODE')
     A                                      TEXT('PRF VENDOR CODE')
     A                                      ALIAS(PRF_VENDOR_CODE_CS)
     A            PRFVENPARTR               REFFLD(PARTNO50)
     A                                      COLHDG('PRF VENDOR PARTNO')
     A                                      TEXT('PRF VENDOR PARTNO')
     A                                      ALIAS(PRF_VENDOR_PARTNO_CS)
     A            PRFVENAUX R               REFFLD(AUXID)
     A                                      COLHDG('PRF VENDOR AUXID')
     A                                      TEXT('PRF VENDOR AUXID')
     A                                      ALIAS(PRF_VENDOR_AUXID_CS)
     A            PRFVENPRC R               REFFLD(PRICE15C3)
     A                                      COLHDG('PRF VENDOR PRICE')
     A                                      TEXT('PRF VENDOR PRICE')
     A                                      ALIAS(PRF_VENDOR_PRICE)
     A            PRFCURCDE R               REFFLD(CURRNCYCDE)
     A                                      COLHDG('PRF VNDR CURR CD')
     A                                      TEXT('PRF VNDR CURR CD')
     A                                      ALIAS(PRF_VNDR_CURRCD_CS)
      *========================================
      *= EXCEPTION ITEM DATA
      *========================================
     A            EXPMANFNAMR               REFFLD(MANUFACT50)
     A                                      COLHDG('EXP MANF NAME')
     A                                      TEXT('EXP MANF NAME')
     A                                      ALIAS(EXP_MANF_NAME_CS)
     A            EXPMANPARTR               REFFLD(PARTNO50)
     A                                      COLHDG('EXP MANF PARTNO')
     A                                      TEXT('EXP MANF PARTNO')
     A                                      ALIAS(EXP_MANF_PARTNO_CS)
     A            EXPVENCDE R               REFFLD(VENCDE)
     A                                      COLHDG('EXP VENDOR CODE')
     A                                      TEXT('EXP VENDOR CODE')
     A                                      ALIAS(EXP_VENDOR_CODE_CS)
     A            EXPVENPARTR               REFFLD(PARTNO50)
     A                                      COLHDG('EXP VENDOR PARTNO')
     A                                      TEXT('EXP VENDOR PARTNO')
     A                                      ALIAS(EXP_VENDOR_PARTNO_CS)
     A            EXPVENAUX R               REFFLD(AUXID)
     A                                      COLHDG('EXP VENDOR AUXID')
     A                                      TEXT('EXP VENDOR AUXID')
     A                                      ALIAS(EXP_VENDOR_AUXID_CS)
     A            EXPVENPRC R               REFFLD(PRICE15C3)
     A                                      COLHDG('EXP VENDOR PRICE')
     A                                      TEXT('EXP VENDOR PRICE')
     A                                      ALIAS(EXP_VENDOR_PRICE)
     A            EXPCURCDE R               REFFLD(CURRNCYCDE)
     A                                      COLHDG('EXP VNDR CURR CD')
     A                                      TEXT('EXP VNDR CURR CD')
     A                                      ALIAS(EXP_VNDR_CURRCD_CS)
      *========================================
      *= MISCELLANEOUS DATA ITEMS
      *========================================
     A            QTYORDER  R               REFFLD(ITMQTYORD)
     A                                      COLHDG('QTY ORDERED')
     A                                      TEXT('QTY ORDERED')
     A                                      ALIAS(QTY_ORDERED_CS)
     A            RSNCDE    R               REFFLD(RSNCDE)
     A            RSNTXT    R               REFFLD(RSNTXT)
     A            DATETIME14R
