     A                                      REF(MMISA)
     A          R MCRPMM4500
     A            PMRLSEDATER
     A            PMRLSEYRMOR
     A            PMRECTYPE R
     A            PMEQPNUM  R
     A            WONUM     R
     A            ZONE      R
     A            PRIORITY  R
     A            PMLEVEL   R
     A            PMCRITICALR
     A            PMCYCLE   R
     A            PMLOKAHEADR
     A            PMPREREL  R
     A            PMPRIORITYR
     A            PMRESTRICTR
     A            PMPRERELDTR
     A            PMPAD     R
