     A                                      REF(STORES)
     A          R MCRPCS1400
     A            CORPCDE   R
     A            DESCIDNUM R
     A            DESCDTA   R
