     A                                      REF(STORES)
     A          R MCRPCS4700
     A            TALLY     R
     A            PORCVNO   R
     A            ITEMNO    R
     A            CORPCDE   R
