     A                                      REF(STORES)
     A          R MCFRCSAUTH
     A            USERNOTIFYR
     A            USERPRISW R
     A            PAD09     R
