     A                                      REF(STORES)
     A          R MCRPCS1100
     A            PORCVNO   R
     A            ITEMSEQNO R
     A            DTAITEM   R
