     A                                      REF(STORES)
     A          R MCRPCSSPRQ
     A            REQNO     R
     A            PORLSE    R
     A            ITEMNO    R
     A            CORPCDE   R
     A            ITMQTYORD R
     A            QTYUM     R
     A            UNITPRICE R
     A            PRICEUM   R
     A            CURRCDE3  R
     A            PODTE     R
     A            EXPECTDTE R
     A            VENCDE    R
     A            VENITMDTA R
     A            POBUYER   R
