     A                                      REF(STORES)
     A          R MCRPCS1700
     A            VALDTAKEY R
     A            VALDTADESCR
     A            VALDTACOPRR
     A            VALDTADEPSR
