     A                                      REF(STORES)
     A          R MCRPCS0200
     A            CORPCDE   R
     A            CLSS      R
     A            STRDIRCHRGR
     A            STRINITDTER
     A            STRACTDTE R
     A            STRAUTHOR R
     A            STREOQ    R
     A            STRREORDERR
     A            STRMAX    R
     A            STREXPED  R
     A            STRSTDCOSTR
     A            STRAVGCOSTR
     A            STRPREVAVGR
     A            STRUM     R
     A            STRUM1    R
     A            STRUM1CF  R
     A            STRUM2    R
     A            STRUM2CF  R
     A            STRESTLT  R
     A            STRDSBINSTR
     A            STRPREVCDER
     A            STRLSTIDTER
     A            STRLSTCHRGR
     A            LEADTIMES1R
     A            LEADTIMES2R
     A            LEADTIMES3R
     A            STRINVCYL R
     A            STRINVDTE R
     A            STRDFLTDPTR
     A            STRMKTCOSTR
     A            OUTREPRCSTR
     A            MTREPRCST R
     A            STRSTSAR01R
     A            STRSTSAR02R
     A            STRSTSAR03R
     A            STRSTSAR04R
     A            STRSTSAR05R
     A            STRSTSAR06R
     A            STRSTSAR07R
     A            STRSTSAR08R
     A            STRSTSAR09R
     A            STRSTSAR10R
     A            STRSTSAR11R
     A            STRSTSAR12R
     A            STRMTHFCSTR
     A            STRONH    R
     A            STRONORER R
     A            STRRESERVDR
     A            STRRSVONORR
     A            STRLOC1   R
     A            STRLOC1ONHR
     A            STRLOC2   R
     A            STRLOC2ONHR
     A            STRLOC3   R
     A            STRLOC3ONHR
     A            STRLOC4   R
     A            STRLOC4ONHR
     A            STRLOC5   R
     A            STRLOC5ONHR
     A            STRLOC6   R
     A            STRLOC6ONHR
     A            STRLSTPO  R
     A            STRLSTVENDR
     A            STREXPCLSSR
     A            REQNO     R
     A            REQDTE    R
     A            TAXCDE    R
     A            STRTAXPCT R
     A            STDINSTRS R
     A            BUYERCDE  R
     A            STRHIGHUSER
     A            STRSOQ    R
     A            PAD20     R
     A            RCVSTDINS R
     A            CDEOWNER  R
     A            BINOWNER  R
