     A                                      REF(STORES)
     A          R MCRPCS4400
     A            REQNO     R
     A            EMPLOYID  R
     A            QUETYPE   R
     A            QUEDTE    R
     A            QUEAPPDTE R
     A            QUECOMMNT1R
     A            QUECOMMNT2R
     A            QUEFLGS1  R
     A            QUEFLGS2  R
     A            QUEFLGS3  R
     A            QUEFLGS4  R
     A            QUEFLGS5  R
     A            QUEFLGS6  R
     A            EMPLOYORIGR
     A            LEVELNUM  R
     A            EMPLQUEDSTR
     A            EMPLORIGSTR
     A            PAD20     R
     A            QUEORDER  R
