     A                                      REF(STORES)
     A          R MCRPCS3800
     A            QUOTENUM  R
     A            ITEMNO    R
     A            DESCIDNUM R
     A            QTETXTDTA R
