      ***************************************************************
      * FILE NAME : MCFPAB1300
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : CATALOG UPDATE RESULTS LOG FILE
      *
      * CREATED   : 09/10/2003
      * AUTHOR    : EXLTECH, LLC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB1300
     A            SFLAG          1A
     A            MESSAGE       80A
     A            CIFRECRD     300A
     A            DATETIME14R
