     A          R MCFPPICT
     A            CODE           7A
     A                                      TEXT('CSIS CODE                ')
     A            MATLNAME      30A
     A                                      TEXT('MATERIAL NAME            ')
     A            UM             2A
     A                                      TEXT('UNIT OF MEASURE          ')
     A            AMT            8S
     A                                      TEXT('AMOUNT                   ')
     A            FILLER        33A
     A                                      TEXT('FILLER                   ')
