     A                                      REF(STORES)
     A          R MCRPCS4900
     A            ACTGCLASS R
     A            DESCR     R
     A            CLSDCHGVALR
     A            ONDCKCARRYR
     A            INVTRNFLG R
