      ***************************************************************
      * FILE NAME : MCFPAB2600
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : REASON CODE DESCRIPTION
      *
      * CREATED   : 09/25/2003
      * AUTHOR    : EXLTECH, LLC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      UNIQUE
     A                                      REF(STORES)
     A          R MCFRAB2600
     A            RCODE          4A
     A            RDESC         74A
      * KEY
     A          K RCODE
