     A                                      REF(STORES)
     A          R MCRPCS1600
     A            DLYTCDTE  R
     A            DLYTCTIME R
     A            DLYTCPLT  R
     A            DAILYTC   R
