     A                                      REF(STORES)
     A          R MCRPCS3900
     A            PATHNUM   R
     A            PATHDESC  R
     A            PATHMINVALR
     A            PATHMAXVALR
     A            PATHWOAPPVR
     A            PATHLEVELSR
     A            PAD20     R
