     A                                      REF(DOCREF)
     A          R MCRPDS0200
     A            SYSTEM    R
     A            SUBSYS    R
     A            SEQNUM    R
     A            SEQTITLE  R
     A            SEQDTE    R
     A            DOCUMENT  R
