     A                                      REF(STORES)
     A          R MCRPCS6700
     A            RPTPROG   R
     A            RPTDESC   R
     A            RPTIDENT  R
     A            RPTKEYDESCR
     A            RPTSWITCH R
     A            PAD08     R
