     A                                      REF(STORES)
     A          R MCRPPOFILE
     A            DATECYMD  R
     A            POFLRETRN R
     A            POAKBUF   R
     A            POERRBUF  R
