     A                                      REF(STORES)
     A          R MCRPCS6900
     A            CORPCDE   R
     A            DESCIDNUM R
     A            DESCDTA   R
