      ***************************************************************
      * FILE NAME : MCFPAB3000
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : PIN CATALOG STAGING FILE  - GOODYEAR COPY
      *
      * CREATED   : 11/06/2003
      * AUTHOR    : COPIED FROM MCFPAB2200
      *
      ***************************************************************
      * SPECIAL NOTES:    SEE COBOL COPYMBR DARIBAC2F
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB3000
     A            VENCDE    R
     A            CORPCDE   R
     A            POPLT     R
     A            MANUFACT  R               REFFLD(MANUFACT50)
     A            MANPARTNO R               REFFLD(PARTNO50)
     A                                      COLHDG('MANUFACT PART NBR')
     A                                      TEXT('MANUFACT PART NBR')
     A                                      ALIAS(MANPARTNO_CS)
     A            VENPARTNO R
     A            VENAUXID  R               REFFLD(AUXID)
     A                                      COLHDG('AUXILLARY ID')
     A                                      TEXT('AUXILLARY ID')
     A                                      ALIAS(VENAUXID_CS)
     A            VENPRICE  R               REFFLD(PRICE15C3)
     A                                      COLHDG('VENDOR PRICE')
     A                                      TEXT('VENDOR PRICE')
     A                                      ALIAS(VENPRICE_CS)
     A            PRICEUM   R               REFFLD(UOM)
     A                                      COLHDG('PRICE UM')
     A                                      TEXT('PRICE UM')
     A                                      ALIAS(PRICE_UM_CS)
     A            CURRCODE  R               REFFLD(CURRNCYCDE)
     A                                      COLHDG('CURR CODE')
     A                                      TEXT('CURR CODE')
     A                                      ALIAS(CURR_CODE_CS)
