     A                                      REF(STORES)
     A          R MCRPCSNFTA
     A            PORCVNO   R
     A            VENCDE    R
     A            DATECYMD  R
     A            DLYTCTIME R
     A            PAD08     R
