     A                                      REF(MMISA)
     A          R MCRPMM3100
     A            PERABSCCYRR
     A            PERABSCODER
     A            PERABSDATER
     A            PERABSHRS R
