     A                                      UNIQUE
     A          R CURCDRCD                  TEXT('CURCDEFL / PHYSICAL')
     A            CURCDEID       2A         COLHDG('CURRENCY CODE')
     A            CURCDEDESC    12A         COLHDG('CURRENCY DESC')
     A            CURCDEEDI      4A         COLHDG('EDI CURR CODE')
                K CURCDEID
