     A                                      REF(STHIST)
     A          R MCRPST0800
     A            REGISTERNOR
     A            PORCVNO   R
     A            MANIFESTNOR
     A            INVOICESTSR
     A            VENCDE    R
     A            INVOICENO R
     A            INVDTE    R
     A            INVINDTE  R
     A            INVDUEDTE R
     A            INVMODDTE R
     A            INVCHKDTE R
     A            INVCHKNO  R
     A            TERMS     R
     A            INVIMATXT R
     A            INVPMATXT R
     A            INVPAYIND R
     A            INVADDVFRTR
     A            INVADDTAX R
     A            INVADDCTNRR
     A            INVADDINS R
     A            INVADDOTHRR
     A            TAXCDE    R
     A            INVCE01   R
     A            INVCE03   R
     A            INVCE04   R
     A            INVCE05   R
     A            INVCE06   R
     A            INVCE07   R
     A            INVCE08   R
     A            INVCE09   R
     A            INVCEX1   R
     A            INVCEX2   R
     A            INVCPWCDE R
     A            INVNETVENDR
     A            INVOTCFRT R
     A            INVADJATX1R
     A            INVADJATX2R
     A            INVADJATX3R
     A            INVADJATX4R
     A            INVADJOTHRR
     A            INVDSTCOSTR
     A            INVADDCLRKR
     A            INVMODCLRKR
     A            INVITINDICR
     A            INVFREEVRBR
     A            PAD10     R
