     A                                      REF(STORES)
     A          R MCRPCS2200
     A            REQNO     R
     A            CORPCDE   R
     A            ITEMNO    R
     A            QTYUM     R
     A            REQQTYTOORR
     A            PRICEUM   R
     A            REQUPRICE R
     A            SUBDETAIL R
     A            ADDLDTA   R
     A            SHIPDTE   R
     A            BUDGETNO  R
     A            BUDGETAMT R
     A            PAYTERMS  R
     A            FOB       R
     A            REQNOTE   R
     A            CURRNCYCDER
     A            REQUPRICE2R
     A            PAD06     R
