      ***************************************************************
      * FILE NAME : MCFPAB0800
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : REQUISITION LOG FILE - GOODYEAR COPY
      *
      * CREATED   : 10/15/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      * BASED ON HP3000 DATASET DREQLOG DETAIL
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRAB0800
     A            REQNO     R
     A            CORPCDE   R
     A            POPLT     R
     A            MANUFACT50R
     A            MANPARTNO R               REFFLD(PARTNO50)
     A                                      ALIAS(MANPART50_CS)
     A            VENCDE    R
     A            VENPARTNO R               REFFLD(PARTNO50)
     A                                      ALIAS(VENPART50_CS)
     A            VENAUXID  R               REFFLD(AUXID)
     A            PRICEUM   R
     A            POORDID   R
