     A                                      REF(STORES)
     A          R MCRPCSPCAT
     A            PAD01     R
     A            CATNUM    R
     A            VENCDE    R
     A            CORPCDE7  R
     A            UNITPRICE R
     A            UNITQTY   R
     A            PRICEUM   R
     A            CURRCDE3  R
     A            EFFECTDATER
     A            DATECYMD  R
     A            DLYTCTIME R
     A            APPLYDATE R
     A            APPLYTIME R
