     A                                      REF(BUDGET)
     A          R MCRPBG0600
     A            UPDATEKEY R
     A            UPDATETYPER
     A            BUDGETNUM R
     A            NEWWORKNUMR
     A            PWONUM    R
     A            CHARGETYPER
     A            BUDREQNUM R
     A            BUDPONUM  R
     A            BCDEPT    R
     A            PWODESC   R
     A            PWOREQUESTR
     A            LABOREST  R
     A            STRMEST   R
     A            PURCHEST  R
     A            INVAMT    R
     A            PURCHAMT  R
     A            REQDAMT   R
     A            LABORCOM  R
     A            STRMCOM   R
     A            PURCHCOM  R
     A            SLABOREST R
     A            SSTRMEST  R
     A            SPURCHEST R
     A            SINVAMT   R
     A            SPURCHAMT R
     A            SREQDAMT  R
     A            SLABORCOM R
     A            SSTRMCOM  R
     A            SPURCHCOM R
