     A                                      REF(STORES)
     A          R MCRPCS4200
     A            EMPLOYID  R
     A            LEVELNUM  R
     A            ACTFLG    R
     A            INVFLG    R
     A            CRTRQFLG  R
     A            APPRQFLG  R
     A            REQSTPFLG R
     A            FORWARDCAPR
     A            BYPASSCAP R
     A            MODIFYCAP R
     A            RETURNCAP R
     A            EMPFLG10  R
     A            EMPFLG11  R
     A            EMPFLG12  R
     A            EMPFLG13  R
     A            EMPFLG14  R
     A            EMPFLG15  R
     A            EMPFLG16  R
     A            APPBUCK1  R
     A            APPBUCK2  R
     A            APPBUCK3  R
     A            USERID    R
