     A          R MCFPCSPRNT
     A            KPRTUSER      16A
     A            KPRTTERM      10A
     A            KPRTSPOOL1     4S
     A            KPRTSPOOL2     4S
     A            KPRTSPOOL3     4S
     A            KPRTSPOOL4     4S
     A            KPRTSPOOL5     4S
     A            KPRTPAD       20A
