     A                                      REF(MMISA)
     A          R MCRPMM3200
     A            PERCCNUM  R
     A            PERPAGE   R
     A            PERLINE   R
     A            PERDATA   R
