     A                                      REF(EQPREF)
     A          R MCRPER0700
     A            EQRFNAMONER
     A            EQRFNAMTWOR
     A            EQRFNAMTHRR
     A            EQRFNAMFOUR
     A            EQRFNAMFIVR
     A            EQRFNAMSIXR
     A            EQRFNAMSEVR
     A            EQRFNAMEIGR
