     A                                      REF(PWORD)
     A          R MCRPPW0100
     A            PWPROGID  R
     A            PWPROGTYPER
     A            PWDBVERS  R
     A            PWDBRLSE  R
     A            PWPROGRLSER
     A            PWPROGCOMPR
     A            PWPROGDESCR
     A            PWPROGFUNCR
     A            PWDATEINITR
     A            PWTIMEINITR
     A            PWLASTDATUR
     A            PWLASTIMEUR
