     A                                      REF(STORES)
     A          R MCRPCS0900
     A            PORCVNO   R
     A            REQNO     R
     A            RCVDEPT   R
     A            FORDEPT   R
     A            PODTE     R
     A            SHIPDTE   R
     A            EXPECTDTE R
     A            POPLT     R
     A            POBLDG    R
     A            ACCTGINFO R
     A            TAXCDE    R
     A            BUDGETNO  R
     A            BUDGETAMT R
     A            POSTS     R
     A            PAYTERMS  R
     A            POBUYER   R
     A            ADDLINFO  R
     A            VIA       R
     A            POFOB     R
     A            VENCDE    R
     A            BUYERCDE  R
     A            POFLGS    R
     A            POLASTPAY R
     A            CURRNCYCDER
     A            ZBILLNO   R
     A            POFLUPDA  R
     A            POFLUPCO  R
     A            POCRTTYP  R
     A            POINVIND  R
     A            EDITRANMODR
     A            EDITRANCHGR
     A            EDITRANDELR
     A            PAD12     R
