     A                                      REF(BUDGET)
     A          R MCRPBG1500
     A            UPDATEKEY R
     A            BUDGETNUM R
     A            NEWWORKNUMR
     A            PWONUM    R
     A            UPDATETYPER
     A            BUDREQNUM R
     A            BUDPONUM  R
     A            BCDEPT    R
     A            PWODESC   R
     A            PWOREQUESTR
     A            LABOREST  R
     A            STRMEST   R
     A            PURCHEST  R
     A            INVAMT    R
     A            PURCHAMT  R
     A            REQDAMT   R
     A            LABORCOM  R
     A            STRMCOM   R
     A            PURCHCOM  R
     A            ERRORCODE R
     A            ERRORMSG  R
