     A                                      REF(STORES)
     A          R MCRPCS6300
     A            AUTHLEVEL R
     A            AUTHAPPRVRR
     A            ACTUAPPRVRR
     A            PAD10     R
