     A                                      REF(EQPREF)
     A          R MCRPER0800
     A            EQRDBVERS R
     A            EQRVERSDATR
     A            EQRVERSTIMR
     A            EQRVERSPADR
