     A          R RMMISA
     A            APPRVLCOD      2A         ALIAS(APPRVLCOD_MM)
     A                                      TEXT('WORKORDER APPROVAL CODE  ')
     A            AUDITDATE      8A         ALIAS(AUDITDATE_MM)
     A                                      TEXT('AUDIT DATE YYYYMMDD      ')
     A            AUDITDESC     30A         ALIAS(AUDITDESC_MM)
     A                                      TEXT('DESCRIPTION OF AUDIT     ')
     A            AUDITTIME      4A         ALIAS(AUDITTIME_MM)
     A                                      TEXT('TIME OF AUDIT HHMM       ')
     A            AUDITTRANS     2A         ALIAS(AUDITTRANS_MM)
     A                                      TEXT('TRANSACTION RECORDED     ')
     A            AUDITYRMO      6A         ALIAS(AUDITYRMO_MM)
     A                                      TEXT('AUDIT YEAR,MONTH  YYYYMM ')
     A            BASDELDATE     8A         ALIAS(BASDELDATE_MM)
     A                                      TEXT('DATE WO CAN BE DELETED   ')
     A            BASPAD         4A         ALIAS(BASPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            BASSEQNUM      4A         ALIAS(BASSEQNUM_MM)
     A                                      TEXT('IBM TRANSMISSION SEQUENCE')
     A            BUDGETNO      16A         ALIAS(BUDGETNO_MM)
     A                                      TEXT('WORKORDER BUDGET NUMBER  ')
     A            CCLINK         8A         ALIAS(CCLINK_MM)
     A                                      TEXT('CORPORATE CODE LINK      ')
     A            CHANGER        4A         ALIAS(CHANGER_MM)
     A                                      TEXT('CHANGER CLOCK CARD       ')
     A            CLOCKCARD      4A         ALIAS(CLOCKCARD_MM)
     A                                      TEXT('CRAFTSMAN CLOCK CARD #   ')
     A            COMPLDATE      8A         ALIAS(COMPLDATE_MM)
     A                                      TEXT('CRAFTSMAN COMPLETE DATE  ')
     A            COMPLTIME      4A         ALIAS(COMPLTIME_MM)
     A                                      TEXT('CRAFTSMAN COMPLETE TIME  ')
     A            CRAFTFLAG      2A         ALIAS(CRAFTFLAG_MM)
     A                                      TEXT('PLANT WIDE CRAFT FLAG    ')
     A            CRAFTPAD      12A         ALIAS(CRAFTPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            CRAFTREQD      2A         ALIAS(CRAFTREQD_MM)
     A                                      TEXT('CRAFT REQUIRED ON WO     ')
     A            CRAFTREQD1     2A         ALIAS(CRAFTREQD1_MM)
     A                                      TEXT('1ST CRAFT REQUIRED       ')
     A            CRAFTREQD2     2A         ALIAS(CRAFTREQD2_MM)
     A                                      TEXT('2ND CRAFT REQUIRED       ')
     A            CRAFTREQD3     2A         ALIAS(CRAFTREQD3_MM)
     A                                      TEXT('3RD CRAFT REQUIRED       ')
     A            CRAFTSMEN1     4A         ALIAS(CRAFTSMEN1_MM)
     A                                      TEXT('1ST CRAFTSMAN TO RESPOND ')
     A            CRAFTSMEN2     4A         ALIAS(CRAFTSMEN2_MM)
     A                                      TEXT('2ND CRAFTSMAN TO RESPOND ')
     A            CRAFTSMEN3     4A         ALIAS(CRAFTSMEN3_MM)
     A                                      TEXT('3RD CRAFTSMAN TO RESPOND ')
     A            CREATOR        4A         ALIAS(CREATOR_MM)
     A                                      TEXT('CREATOR CLOCK CARD       ')
     A            CREWMASTER     2A         ALIAS(CREWMASTER_MM)
     A                                      TEXT('CREW VALIDATION ENTRY    ')
     A            CURSTATPAD     6A         ALIAS(CURSTATPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            DATE           8A         ALIAS(DATE_MM)
     A                                      TEXT('KEY OF WORKORDER DATE    ')
     A            DATECOMP       8A         ALIAS(DATECOMP_MM)
     A                                      TEXT('DATE WO IS COMPLETE      ')
     A            DATEFLAG       2A         ALIAS(DATEFLAG_MM)
     A                                      TEXT('1=MMDDYY 3=DDMMYY        ')
     A            DATEINIT       8A         ALIAS(DATEINIT_MM)
     A                                      TEXT('DATE MESSAGE WAS INPUT   ')
     A            DATERECD       8A         ALIAS(DATERECD_MM)
     A                                      TEXT('DATE WO WAS INPUT TO MMIS')
     A            DATEREQD       8A         ALIAS(DATEREQD_MM)
     A                                      TEXT('DATE PARTS/LABOR IS NEEDED')
     A            DATESCHD       8A         ALIAS(DATESCHD_MM)
     A                                      TEXT('DATE WO SCHEDULED TO BE DONE')
     A            DATESTAMP      8A         ALIAS(DATESTAMP_MM)
     A                                      TEXT('DATE TRACKING RECORD WRITTEN')
     A            DATESTAMP8     8A         ALIAS(DATESTAMP8_MM)
     A                                      TEXT('8 DIGIT DATE YYYYMMDD    ')
     A            DATESTRT       8A         ALIAS(DATESTRT_MM)
     A                                      TEXT('DATE WO WAS STARTED      ')
     A            DBFIXCOMP      6A         ALIAS(DBFIXCOMP_MM)
     A                                      TEXT('DATABASE FIX COMPILE     ')
     A            DBRELEASE      2A         ALIAS(DBRELEASE_MM)
     A                                      TEXT('DATABASE RELEASE         ')
     A            DBVERSDATE     8A         ALIAS(DBVERSDATE_MM)
     A                                      TEXT('DATE VERSION INITIALIZED ')
     A            DBVERSION      2A         ALIAS(DBVERSION_MM)
     A                                      TEXT('DATABASE VERSION         ')
     A            DBVERSTIME     4A         ALIAS(DBVERSTIME_MM)
     A                                      TEXT('TIME VERSION INITIALIZED ')
     A            DESCRIPT      30A         ALIAS(DESCRIPT_MM)
     A                                      TEXT('WORKORDER DESCRIPTION    ')
     A            DESCRIPT1     30A         ALIAS(DESCRIPT1_MM)
     A                                      TEXT('SHORT WORKORDER DESCRIPT ')
     A            DESCRIPT2    132A         ALIAS(DESCRIPT2_MM)
     A                                      TEXT('ADDITIONAL WO DESCRIPTION')
     A            DESCRIPT3    132A         ALIAS(DESCRIPT3_MM)
     A                                      TEXT('ADDITIONAL WO DESCRIPTION')
     A            ENDDATE        8A         ALIAS(ENDDATE_MM)
     A                                      TEXT('DATE HOT CODE ENDS       ')
     A            ENDTIME        4A         ALIAS(ENDTIME_MM)
     A                                      TEXT('TIME HOT CODE ENDS       ')
     A            ENGINEER       4A         ALIAS(ENGINEER_MM)
     A                                      TEXT('ENGINEER PROCESSING WO   ')
     A            ENGRIND        2A         ALIAS(ENGRIND_MM)
     A                                      TEXT('RESPONSIBILITY INDICATOR ')
     A            EQPCORPCOD    50A         ALIAS(EQPCORPCOD_MM)
     A                                      TEXT('CORPORATE DESC OF EQUIPMENT')
     A            EQPDEPT        4A         ALIAS(EQPDEPT_MM)
     A                                      TEXT('DEPARTMENT OF EQUIPMENT  ')
     A            EQPDOWN        2A         ALIAS(EQPDOWN_MM)
     A                                      TEXT('EQUIPMENT DOWN INDICATOR ')
     A            EQPDWNCOST     6A         ALIAS(EQPDWNCOST_MM)
     A                                      TEXT('DOWNTIME COST OF EQUIPMENT')
     A            EQPEXCLASS     8A         ALIAS(EQPEXCLASS_MM)
     A                                      TEXT('EQUIPMENT EXPENSE CLASS  ')
     A            EQPLOC         8A         ALIAS(EQPLOC_MM)
     A                                      TEXT('EQUIPMENT LOCATION       ')
     A            EQPNAME       50A         ALIAS(EQPNAME_MM)
     A                                      TEXT('LOCAL EQUIPMENT NAME     ')
     A            EQPNUM         6A         ALIAS(EQPNUM_MM)
     A                                      TEXT('LOCAL EQUIPMENT NUMBER   ')
     A            EQPPAD         6A         ALIAS(EQPPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            EQPRIME        2A         ALIAS(EQPRIME_MM)
     A                                      TEXT('RIME VALUE OF EQUIPMENT  ')
     A            EQPTYPE        8A         ALIAS(EQPTYPE_MM)
     A                                      TEXT('CORPORATE EQUIPMENT TYPE ')
     A            EQPZONE        4A         ALIAS(EQPZONE_MM)
     A                                      TEXT('LOCATION OF ZONE EQUIPMENT')
     A            EXPCLASS       8A         ALIAS(EXPCLASS_MM)
     A                                      TEXT('EXPENSE CLASS ON WO      ')
     A            FAILCODE       6A         ALIAS(FAILCODE_MM)
     A                                      TEXT('WORKORDER FAILURE CODE   ')
     A            FROMCC         4A         ALIAS(FROMCC_MM)
     A                                      TEXT('CLOCK CARD ISSUING MESSAGE')
     A            FROMSIGNON    28A         ALIAS(FROMSIGNON_MM)
     A                                      TEXT('SIGNON ISSUING MESSAGE   ')
     A            FRSTSHIFT      4A         ALIAS(FRSTSHIFT_MM)
     A                                      TEXT('TIME FIRST SHIFT BEGINS  ')
     A            FRTHSHIFT      4A         ALIAS(FRTHSHIFT_MM)
     A                                      TEXT('TIME FOURTH SHIFT BEGINS ')
     A            GJOBPCC        4A         ALIAS(GJOBPCC_MM)
     A                                      TEXT('GENERIC JOBPLAN ORIGINATOR')
     A            GJOBPCRAFT     2A         ALIAS(GJOBPCRAFT_MM)
     A                                      TEXT('GENERIC CRAFT REQUIRED ')
     A            GJOBPDESC     50A         ALIAS(GJOBPDESC_MM)
     A                                      TEXT('GENERIC JOBPLAN DESCRIPTION')
     A            GJOBPDOWN      4A         ALIAS(GJOBPDOWN_MM)
     A                                      TEXT('GENERIC ESTIMATED DOWNTIME')
     A            GJOBPEST       4A         ALIAS(GJOBPEST_MM)
     A                                      TEXT('GENERIC ESTIMATED JOB HOURS')
     A            GJOBPLINE      4A         ALIAS(GJOBPLINE_MM)
     A                                      TEXT('GENERIC LINE NUMBER SEQUENCE')
     A            GJOBPLTSEQ     4A         ALIAS(GJOBPLTSEQ_MM)
     A                                      TEXT('INTERNAL GENERIC JOBPLAN SEQ')
     A            GJOBPMEN       2A         ALIAS(GJOBPMEN_MM)
     A                                      TEXT('NUMBER OF MEN / GENERIC JOB')
     A            GJOBPNAME     10A         ALIAS(GJOBPNAME_MM)
     A                                      TEXT('GENERIC JOBPLAN NAME     ')
     A            GJOBPSEQ      14A         ALIAS(GJOBPSEQ_MM)
     A                                      TEXT('GENERIC WO PLUS SEQUENCE ')
     A            GJOBPTITLE    30A         ALIAS(GJOBPTITLE_MM)
     A                                      TEXT('GENERIC JOB PLAN TITLE   ')
     A            GPRTPCC        4A         ALIAS(GPRTPCC_MM)
     A                                      TEXT('GENERIC PART PLAN ORIGINATOR')
     A            GPRTPCODE      8A         ALIAS(GPRTPCODE_MM)
     A                                      TEXT('GENERIC PART PLAN CODE   ')
     A            GPRTPDESC1    80A         ALIAS(GPRTPDESC1_MM)
     A                                      TEXT('GENERIC PART PLAN DESCRIP')
     A            GPRTPDESC2    80A         ALIAS(GPRTPDESC2_MM)
     A                                      TEXT('GENERIC PART PLAN DESCRIP')
     A            GPRTPDESC3    80A         ALIAS(GPRTPDESC3_MM)
     A                                      TEXT('GENERIC PART PLAN DESCRIP')
     A            GPRTPDESC4    80A         ALIAS(GPRTPDESC4_MM)
     A                                      TEXT('GENERIC PART PLAN DESCRIP')
     A            GPRTPDESC5    80A         ALIAS(GPRTPDESC5_MM)
     A                                      TEXT('GENERIC PART PLAN DESCRIP')
     A            GPRTPESTC     16A         ALIAS(GPRTPESTC_MM)
     A                                      TEXT('GENERIC ESTIMATED COST   ')
     A            GPRTPESTQ      8A         ALIAS(GPRTPESTQ_MM)
     A                                      TEXT('GENERIC ESTIMATED QTY    ')
     A            GPRTPINFO     14A         ALIAS(GPRTPINFO_MM)
     A                                      TEXT('GENERIC PARTPLAN ADDL INFO')
     A            GPRTPNAME     10A         ALIAS(GPRTPNAME_MM)
     A                                      TEXT('GENERIC PARPLAN NAME     ')
     A            GPRTPPRIME     4A         ALIAS(GPRTPPRIME_MM)
     A                                      TEXT('GENERIC PARTPLAN PRIME   ')
     A            GPRTPREM1     80A         ALIAS(GPRTPREM1_MM)
     A                                      TEXT('GENERIC PARTPLAN REMARKS ')
     A            GPRTPREM2     80A         ALIAS(GPRTPREM2_MM)
     A                                      TEXT('GENERIC PARTPLAN REMARKS ')
     A            GPRTPSTAGE     4A         ALIAS(GPRTPSTAGE_MM)
     A                                      TEXT('GENERIC PARTPLAN STAGE AREA')
     A            GPRTPSTAT      2A         ALIAS(GPRTPSTAT_MM)
     A                                      TEXT('GENERIC PARTPLAN STATUS  ')
     A            GPRTPSUB       4A         ALIAS(GPRTPSUB_MM)
     A                                      TEXT('GENERIC PARTPLAN SUB DETAIL')
     A            GPRTPTITLE    30A         ALIAS(GPRTPTITLE_MM)
     A                                      TEXT('GENERIC PARTPLAN TITLE   ')
     A            GPRTPUCOST    16A         ALIAS(GPRTPUCOST_MM)
     A                                      TEXT('GENERIC PARTPLAN UNIT COST')
     A            GPRTPUM        2A         ALIAS(GPRTPUM_MM)
     A                                      TEXT('GENERIC UNIT OF MEASURE  ')
     A            GPRTPVEND     30A         ALIAS(GPRTPVEND_MM)
     A                                      TEXT('GENERIC PARTPLAN VENDOR  ')
     A            HIERDSPCOD     6A         ALIAS(HIERDSPCOD_MM)
     A                                      TEXT('HIERARCHY DISPLAY CODE   ')
     A            HIERKEY       14A         ALIAS(HIERKEY_MM)
     A                                      TEXT('HIERARCHY KEY            ')
     A            HIERSUBNAM    50A         ALIAS(HIERSUBNAM_MM)
     A                                      TEXT('HIERARCH SUBSYSTEM NAME  ')
     A            HOTCODEPAD    20A         ALIAS(HOTCODEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            JOBPCC         4A         ALIAS(JOBPCC_MM)
     A                                      TEXT('JOBPLAN CREATOR/EDITOR CC')
     A            JOBPCRAFT      2A         ALIAS(JOBPCRAFT_MM)
     A                                      TEXT('CRAFT REQUIRED FOR JOB   ')
     A            JOBPDATE       8A         ALIAS(JOBPDATE_MM)
     A                                      TEXT('JOBP CREATE/CHANGE DATE  ')
     A            JOBPDESC      50A         ALIAS(JOBPDESC_MM)
     A                                      TEXT('JOBPLAN DESCRIPTION LINE ')
     A            JOBPDOWNT      4A         ALIAS(JOBPDOWNT_MM)
     A                                      TEXT('JOBPLAN ESTIMATED DOWNTIME')
     A            JOBPESTHRS     4A         ALIAS(JOBPESTHRS_MM)
     A                                      TEXT('ESTIMATED HOURS TO DO JOB')
     A            JOBPFLAG       2A         ALIAS(JOBPFLAG_MM)
     A                                      TEXT('PM FLAG                  ')
     A            JOBPLEVEL      2A         ALIAS(JOBPLEVEL_MM)
     A                                      TEXT('PM LEVEL                 ')
     A            JOBPLINE       4A         ALIAS(JOBPLINE_MM)
     A                                      TEXT('LINE NUMBER WITHIN SEQUENCE')
     A            JOBPMEN        2A         ALIAS(JOBPMEN_MM)
     A                                      TEXT('NUMBER OF MEN TO DO JOB  ')
     A            JOBPSEQLIN     8A         ALIAS(JOBPSEQLIN_MM)
     A                                      TEXT('JOB PLAN SEQ AND LINE NUM')
     A            JOBPSS         4A         ALIAS(JOBPSS_MM)
     A                                      TEXT('PM SUBSYSTEM             ')
     A            JOBPTIME       6A         ALIAS(JOBPTIME_MM)
     A                                      TEXT('JOBP CREATE/CHANGE TIME  ')
     A            JOBPWOSEQ     14A         ALIAS(JOBPWOSEQ_MM)
     A                                      TEXT('WORKORDER PLUS SEQUENCE  ')
     A            KEYPAD        50A         ALIAS(KEYPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            LASTJOBSEQ     4A         ALIAS(LASTJOBSEQ_MM)
     A                                      TEXT('HIGHEST JOBPLAN ON WO    ')
     A            LASTSUFFIX     4A         ALIAS(LASTSUFFIX_MM)
     A                                      TEXT('LAST SUFFIX NUMBER USED  ')
     A            LASTWONUM      6A         ALIAS(LASTWONUM_MM)
     A                                      TEXT('LAST WORKORDER ASSIGNED  ')
     A            LASTWOPAD     30A         ALIAS(LASTWOPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            LASTYRUSED     2A         ALIAS(LASTYRUSED_MM)
     A                                      TEXT('YEAR DESIGNATOR ON WO    ')
     A            LBRCCNUM       4A         ALIAS(LBRCCNUM_MM)
     A                                      TEXT('LABOR CLOCKCARD NUMBER   ')
     A            LBRCOST       12A         ALIAS(LBRCOST_MM)
     A                                      TEXT('CALCULATED COST OF WORK  ')
     A            LBRCPDATE      8A         ALIAS(LBRCPDATE_MM)
     A                                      TEXT('COMPLETED LABOR DATE BY CC')
     A            LBRCPTIME      4A         ALIAS(LBRCPTIME_MM)
     A                                      TEXT('COMPLETED LABOR TIME BY CC')
     A            LBRCRAFT       2A         ALIAS(LBRCRAFT_MM)
     A                                      TEXT('CRAFT LABOR BY CLOCKCARD ')
     A            LBRCREW        2A         ALIAS(LBRCREW_MM)
     A                                      TEXT('LABOR CREW               ')
     A            LBRDATE        8A         ALIAS(LBRDATE_MM)
     A                                      TEXT('DATE LABOR WAS PERFORMED ')
     A            LBRHOURS       4A         ALIAS(LBRHOURS_MM)
     A                                      TEXT('HOURS REPORTED BY CLOCKCARD')
     A            LBRNAME       16A         ALIAS(LBRNAME_MM)
     A                                      TEXT('EMPLOYEED NAME DOING LABOR')
     A            LBRPAD         4A         ALIAS(LBRPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            LBRSHIFT       2A         ALIAS(LBRSHIFT_MM)
     A                                      TEXT('SHIFT LABOR WAS PERFORMED')
     A            LBRSTDATE      8A         ALIAS(LBRSTDATE_MM)
     A                                      TEXT('DATE LABOR STARTED BY CC ')
     A            LBRSTTIME      4A         ALIAS(LBRSTTIME_MM)
     A                                      TEXT('TIME LABOR STARTED BY CC ')
     A            LOCATION       8A         ALIAS(LOCATION_MM)
     A                                      TEXT('EQUIPMENT LOCATION ON WO ')
     A            MACHNOTE      76A         ALIAS(MACHNOTE_MM)
     A                                      TEXT('NOTE ON MACHINE IN CC-LINK')
     A            MESSAGEPAD    10A         ALIAS(MESSAGEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            MESSAGE1      70A         ALIAS(MESSAGE1_MM)
     A                                      TEXT('1ST LINE OF MESSAGE      ')
     A            MESSAGE2      70A         ALIAS(MESSAGE2_MM)
     A                                      TEXT('2ND LINE OF MESSAGE      ')
     A            MESSAGE3      70A         ALIAS(MESSAGE3_MM)
     A                                      TEXT('3RD LINE OF MESSAGE      ')
     A            MESSAGE4      70A         ALIAS(MESSAGE4_MM)
     A                                      TEXT('4TH LINE OF MESSAGE      ')
     A            MESSAGE5      70A         ALIAS(MESSAGE5_MM)
     A                                      TEXT('5TH LINE OF MESSAGE      ')
     A            MSGCODE        2A         ALIAS(MSGCODE_MM)
     A                                      TEXT('CODE KEY FOR ASBESTOS MSG')
     A            MSGFLAGS      16A         ALIAS(MSGFLAGS_MM)
     A                                      TEXT('PM MESSAGE SWITCHES      ')
     A            NEWSKEY        6A         ALIAS(NEWSKEY_MM)
     A                                      TEXT('KEY ITEM FOR NEWS RETRIEVAL')
     A            NEWS1         70A         ALIAS(NEWS1_MM)
     A                                      TEXT('1ST LINE OF NEWS         ')
     A            NEWS10        70A         ALIAS(NEWS10_MM)
     A                                      TEXT('10TH LINE OF NEWS        ')
     A            NEWS2         70A         ALIAS(NEWS2_MM)
     A                                      TEXT('2ND LINE OF NEWS         ')
     A            NEWS3         70A         ALIAS(NEWS3_MM)
     A                                      TEXT('3RD LINE OF NEWS         ')
     A            NEWS4         70A         ALIAS(NEWS4_MM)
     A                                      TEXT('4TH LINE OF NEWS         ')
     A            NEWS5         70A         ALIAS(NEWS5_MM)
     A                                      TEXT('5TH LINE OF NEWS         ')
     A            NEWS6         70A         ALIAS(NEWS6_MM)
     A                                      TEXT('6TH LINE OF NEWS         ')
     A            NEWS7         70A         ALIAS(NEWS7_MM)
     A                                      TEXT('7TH LINE OF NEWS         ')
     A            NEWS8         70A         ALIAS(NEWS8_MM)
     A                                      TEXT('8TH LINE OF NEWS         ')
     A            NEWS9         70A         ALIAS(NEWS9_MM)
     A                                      TEXT('9TH LINE OF NEWS         ')
     A            NOTEKEY       22A         ALIAS(NOTEKEY_MM)
     A                                      TEXT('CLOCKCARD NOTE MASTER KEY')
     A            NOTEPAD       10A         ALIAS(NOTEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            PERABSCCYR     6A         ALIAS(PERABSCCYR_MM)
     A                                      TEXT('KEY INTO ABSENCE SET     ')
     A            PERABSCODE     2A         ALIAS(PERABSCODE_MM)
     A                                      TEXT('PERSONNEL ABSENCE CODE   ')
     A            PERABSDATE     8A         ALIAS(PERABSDATE_MM)
     A                                      TEXT('DATE OF ABSENCE          ')
     A            PERABSDESC    30A         ALIAS(PERABSDESC_MM)
     A                                      TEXT('ABSENCE CODE DESCRIPTION ')
     A            PERABSHRS      2A         ALIAS(PERABSHRS_MM)
     A                                      TEXT('HOURS OF ABSENCE         ')
     A            PERAYEAR1      2A         ALIAS(PERAYEAR1_MM)
     A                                      TEXT('CC ABSENCE DATA FOR YEAR ')
     A            PERAYEAR2      2A         ALIAS(PERAYEAR2_MM)
     A                                      TEXT('CC ABSENCE DATA FOR YEAR ')
     A            PERAYEAR3      2A         ALIAS(PERAYEAR3_MM)
     A                                      TEXT('CC ABSENCE DATA FOR YEAR ')
     A            PERCCNUM       4A         ALIAS(PERCCNUM_MM)
     A                                      TEXT('PERSONNEL CLOCKCARD NUMBER')
     A            PERCONFDEF    30A         ALIAS(PERCONFDEF_MM)
     A                                      TEXT('PERSONNEL ITEM DEFINITION')
     A            PERCONFITM     2A         ALIAS(PERCONFITM_MM)
     A                                      TEXT('PERSONNEL ITEM NUMBER    ')
     A            PERCONFVAL    20A         ALIAS(PERCONFVAL_MM)
     A                                      TEXT('PERSONNEL ITEM VALUE     ')
     A            PERCOST       10A         ALIAS(PERCOST_MM)
     A                                      TEXT('PERSONNEL LABOR COST     ')
     A            PERCRAFT       2A         ALIAS(PERCRAFT_MM)
     A                                      TEXT('PERSONNEL CRAFT ASSIGNED ')
     A            PERCSD         8A         ALIAS(PERCSD_MM)
     A                                      TEXT('CONTINUOUS SERVICE DATE  ')
     A            PERDATA       66A         ALIAS(PERDATA_MM)
     A                                      TEXT('VALUE OF FREE DATA LINE  ')
     A            PERDEPT        4A         ALIAS(PERDEPT_MM)
     A                                      TEXT('DEPARTMNT PERSON ASSIGNED TO')
     A            PERLINE        2A         ALIAS(PERLINE_MM)
     A                                      TEXT('LINE # OF FREE DATA LINE')
     A            PERNAME       16A         ALIAS(PERNAME_MM)
     A                                      TEXT('PERSONNEL NAME OF CC     ')
     A            PERPAD         6A         ALIAS(PERPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            PERPAGE        2A         ALIAS(PERPAGE_MM)
     A                                      TEXT('PAGE # OF FREE DATA LINE ')
     A            PERPWORD       8A         ALIAS(PERPWORD_MM)
     A                                      TEXT('INDIVIDUAL PASSWORD/DATE ')
     A            PERRATING      2A         ALIAS(PERRATING_MM)
     A                                      TEXT('RATING AMOUNG PEERS      ')
     A            PERSHFCREW     2A         ALIAS(PERSHFCREW_MM)
     A                                      TEXT('SHIFT/CREW ASSIGNED      ')
     A            PERTMPZONE     4A         ALIAS(PERTMPZONE_MM)
     A                                      TEXT('TEMPORARY ZONE ASSIGNMENT')
     A            PERUSRID      10A         ALIAS(PERUSRID_MM)
     A                                      TEXT('GEMS USERID              ')
     A            PERZONE        4A         ALIAS(PERZONE_MM)
     A                                      TEXT('MAINTENANCE ZONE FOR CC  ')
     A            PLANNER        4A         ALIAS(PLANNER_MM)
     A                                      TEXT('PLANNER ASSIGNED TO WO   ')
     A            PLANTIDENT     4A         ALIAS(PLANTIDENT_MM)
     A                                      TEXT('PLANT IDENTIFICATION CODE')
     A            PLDDELDATE     8A         ALIAS(PLDDELDATE_MM)
     A                                      TEXT('DATE WO CAN BE DELETED   ')
     A            PLDPAD         4A         ALIAS(PLDPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            PLDSEQNUM      4A         ALIAS(PLDSEQNUM_MM)
     A                                      TEXT('TRANSMISSION SEQ # TO IBM')
     A            PLNRIND        2A         ALIAS(PLNRIND_MM)
     A                                      TEXT('PLANNER RESPONSIBILITY FLAG')
     A            PMADLCYCLE     4A         ALIAS(PMADLCYCLE_MM)
     A                                      TEXT('PM ADDITIONAL CYCLE DAYS ')
     A            PMCRITICAL     4A         ALIAS(PMCRITICAL_MM)
     A                                      TEXT('PM CRITICAL TIME         ')
     A            PMCYCLE        4A         ALIAS(PMCYCLE_MM)
     A                                      TEXT('PM CYCLE IN DAYS         ')
     A            PMEFFLAGS      2A         ALIAS(PMEFFLAGS_MM)
     A                                      TEXT('PM WO EXECUTION FLAGS    ')
     A            PMEQPNUM       6A         ALIAS(PMEQPNUM_MM)
     A                                      TEXT('PM EQUIPMENT NUMBER      ')
     A            PMEQPRIME      2A         ALIAS(PMEQPRIME_MM)
     A                                      TEXT('                         ')
     A            PMINIT         4A         ALIAS(PMINIT_MM)
     A                                      TEXT('PM INITIATION VALUE      ')
     A            PMJOBPKEY     10A         ALIAS(PMJOBPKEY_MM)
     A                                      TEXT('PM JOBPLAN NAME          ')
     A            PMLEVEL        2A         ALIAS(PMLEVEL_MM)
     A                                      TEXT('PM FREQUENCY IDENTIFIER  ')
     A            PMLOKAHEAD     4A         ALIAS(PMLOKAHEAD_MM)
     A                                      TEXT('PM LOOK AHEAD TIME       ')
     A            PMOPSHOURS     4A         ALIAS(PMOPSHOURS_MM)
     A                                      TEXT('PM OPERATING HOURS       ')
     A            PMPAD         10A         ALIAS(PMPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            PMPCCOUNT      4A         ALIAS(PMPCCOUNT_MM)
     A                                      TEXT('PM PRODUCTION PC COUNT   ')
     A            PMPREREL       4A         ALIAS(PMPREREL_MM)
     A                                      TEXT('PM PRE-RELEASE CYCLE TIME')
     A            PMPRERELDT     8A         ALIAS(PMPRERELDT_MM)
     A                                      TEXT('PM PRE-RELEASE DATE      ')
     A            PMPRIORITY     2A         ALIAS(PMPRIORITY_MM)
     A                                      TEXT('PM LEVEL PRIORITY        ')
     A            PMRECTYPE      4A         ALIAS(PMRECTYPE_MM)
     A                                      TEXT('PM RECORD TYPE           ')
     A            PMREINIT       4A         ALIAS(PMREINIT_MM)
     A                                      TEXT('PM RE-INITIATION VALUE   ')
     A            PMRESTRICT     4A         ALIAS(PMRESTRICT_MM)
     A                                      TEXT('PM CALENDAR RESTRICTIONS ')
     A            PMRLSEDATE     8A         ALIAS(PMRLSEDATE_MM)
     A                                      TEXT('PM RELEASE DATE YYYYMMDD ')
     A            PMRLSEYRMO     6A         ALIAS(PMRLSEYRMO_MM)
     A                                      TEXT('PM RLSE YEAR,MONTH YYYYMM')
     A            PMSCHEDKEY    10A         ALIAS(PMSCHEDKEY_MM)
     A                                      TEXT('PM MASTER SCHEDULE NAME  ')
     A            PRIMEWONUM     8A         ALIAS(PRIMEWONUM_MM)
     A                                      TEXT('1ST 6 NUMERIC DIGITS OF WO')
     A            PRIORITY       2A         ALIAS(PRIORITY_MM)
     A                                      TEXT('ZONE PRIORITY')
     A            PROCESSFLG     2A         ALIAS(PROCESSFLG_MM)
     A                                      TEXT('RENUMBERING PROCESS FLAG  ')
     A            PROGRAM        8A         ALIAS(PROGRAM_MM)
     A                                      TEXT('PGM WRITING TRACKING RECORD')
     A            PRTACTCST     16A         ALIAS(PRTACTCST_MM)
     A                                      TEXT('ACTUAL COST OF PARTS USED')
     A            PRTACTQTY      8A         ALIAS(PRTACTQTY_MM)
     A                                      TEXT('ACTUAL QTY OF PARTS USED ')
     A            PRTCCNUM       4A         ALIAS(PRTCCNUM_MM)
     A                                      TEXT('PART ORIGINATOR          ')
     A            PRTDATE        8A         ALIAS(PRTDATE_MM)
     A                                      TEXT('DATE PART WAS USED       ')
     A            PRTDESC1      80A         ALIAS(PRTDESC1_MM)
     A                                      TEXT('PART DESCRIPTION         ')
     A            PRTDESC2      80A         ALIAS(PRTDESC2_MM)
     A                                      TEXT('PART DESCRIPTION         ')
     A            PRTDESC3      80A         ALIAS(PRTDESC3_MM)
     A                                      TEXT('PART DESCRIPTION         ')
     A            PRTDESC4      80A         ALIAS(PRTDESC4_MM)
     A                                      TEXT('PART DESCRIPTION         ')
     A            PRTDESC5      80A         ALIAS(PRTDESC5_MM)
     A                                      TEXT('PART DESCRIPTION         ')
     A            PRTESTCST     16A         ALIAS(PRTESTCST_MM)
     A                                      TEXT('ESITMATED COST OF PARTS  ')
     A            PRTESTQTY      8A         ALIAS(PRTESTQTY_MM)
     A                                      TEXT('ESTIMATED QTY OF PARTS   ')
     A            PRTFLAG        2A         ALIAS(PRTFLAG_MM)
     A                                      TEXT('PM FLAG                  ')
     A            PRTINFO       14A         ALIAS(PRTINFO_MM)
     A                                      TEXT('PART INFORMATION         ')
     A            PRTITEMNO      4A         ALIAS(PRTITEMNO_MM)
     A                                      TEXT('PART ITEM NUMBER         ')
     A            PRTLEVEL       2A         ALIAS(PRTLEVEL_MM)
     A                                      TEXT('PM LEVEL                 ')
     A            PRTNUMBER      8A         ALIAS(PRTNUMBER_MM)
     A                                      TEXT('CSIS PART NUMBER         ')
     A            PRTPAD        12A         ALIAS(PRTPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            PRTPONO       10A         ALIAS(PRTPONO_MM)
     A                                      TEXT('CSIS PURCHASE ORDER NUMBER')
     A            PRTPRIME       4A         ALIAS(PRTPRIME_MM)
     A                                      TEXT('CSIS PRIME NUMBER        ')
     A            PRTQTYFLAG     2A         ALIAS(PRTQTYFLAG_MM)
     A                                      TEXT('ESTIMATED AFTER APPROVAL FLG')
     A            PRTREMARK1    80A         ALIAS(PRTREMARK1_MM)
     A                                      TEXT('FREE FORMAT PARTS REMARK ')
     A            PRTREMARK2    80A         ALIAS(PRTREMARK2_MM)
     A                                      TEXT('FREE FORMAT PARTS REMARK ')
     A            PRTREQNO      12A         ALIAS(PRTREQNO_MM)
     A                                      TEXT('CSIS ASSIGNED REQUISITION #')
     A            PRTSS          4A         ALIAS(PRTSS_MM)
     A                                      TEXT('CSIS SUBSYSTEM           ')
     A            PRTSTAGE       4A         ALIAS(PRTSTAGE_MM)
     A                                      TEXT('AREA TO STAGE PARTS      ')
     A            PRTSTATUS      2A         ALIAS(PRTSTATUS_MM)
     A                                      TEXT('PART STATUS M,X,S OR U   ')
     A            PRTSUB         4A         ALIAS(PRTSUB_MM)
     A                                      TEXT('CSIS SUB CLASS           ')
     A            PRTTEXT       40A         ALIAS(PRTTEXT_MM)
     A                                      TEXT('PART NUMBER TEXT         ')
     A            PRTUM          2A         ALIAS(PRTUM_MM)
     A                                      TEXT('CSIS UNIT OF MEASURE     ')
     A            PRTUNITCST    16A         ALIAS(PRTUNITCST_MM)
     A                                      TEXT('CSIS PART UNIT COST      ')
     A            PRTVENDOR     30A         ALIAS(PRTVENDOR_MM)
     A                                      TEXT('PART VENDOR              ')
     A            QUEUEPAD      20A         ALIAS(QUEUEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            RECKEY         6A         ALIAS(RECKEY_MM)
     A                                      TEXT('JOBPLAN KEY RECORD TYPE  ')
     A            REMARKS       30A         ALIAS(REMARKS_MM)
     A                                      TEXT('FREE-FORMATTED PARTS REMARKS')
     A            REOPENDEL      2A         ALIAS(REOPENDEL_MM)
     A                                      TEXT('FIELD NOT USED ANYMORE   ')
     A            REQUESTER     16A         ALIAS(REQUESTER_MM)
     A                                      TEXT('REQUESTOR FOR WO         ')
     A            REQUESTNO     12A         ALIAS(REQUESTNO_MM)
     A                                      TEXT('ACCOUNTING REQUEST NUMBER')
     A            RIME           2A         ALIAS(RIME_MM)
     A                                      TEXT('RIME NUMBER              ')
     A            RIMEXPRTY      2A         ALIAS(RIMEXPRTY_MM)
     A                                      TEXT('RIME TIMES PRIORITY      ')
     A            SAFETYNOTE    66A         ALIAS(SAFETYNOTE_MM)
     A                                      TEXT('PLANNED WO SAFETY NOTE   ')
     A            SAVEHISTSW     2A         ALIAS(SAVEHISTSW_MM)
     A                                      TEXT('PLANNED WO SAVE SWITCH   ')
     A            SCHDCRFT       2A         ALIAS(SCHDCRFT_MM)
     A                                      TEXT('SCHEDULED CRAFT          ')
     A            SCHDDATE       8A         ALIAS(SCHDDATE_MM)
     A                                      TEXT('DATE WO IS SCHEDULED     ')
     A            SCHDHRS        4A         ALIAS(SCHDHRS_MM)
     A                                      TEXT('SCHEDULED WORK HRS/CRAFT ')
     A            SCHDIND        2A         ALIAS(SCHDIND_MM)
     A                                      TEXT('SCHEDULER INDICATOR      ')
     A            SCHDPAD       20A         ALIAS(SCHDPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            SCHDQTY        2A         ALIAS(SCHDQTY_MM)
     A                                      TEXT('QTY CRAFTSMEN SCHEDULED  ')
     A            SCHDREM       30A         ALIAS(SCHDREM_MM)
     A                                      TEXT('SCHEDULE RECORD REMARKS  ')
     A            SCHDSHIFT      2A         ALIAS(SCHDSHIFT_MM)
     A                                      TEXT('SHIFT SCHEDULED          ')
     A            SCHEDULER      4A         ALIAS(SCHEDULER_MM)
     A                                      TEXT('PLANNED WO SCHEDULER     ')
     A            SCNDSHIFT      4A         ALIAS(SCNDSHIFT_MM)
     A                                      TEXT('2ND SHIFT START TIME     ')
     A            SHIFTCODE      2A         ALIAS(SHIFTCODE_MM)
     A                                      TEXT('2,3,OR 4 SHIFTS PER 24HRS')
     A            SHIFTPAD      30A         ALIAS(SHIFTPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            SHIFTZONE      4A         ALIAS(SHIFTZONE_MM)
     A                                      TEXT('SPECIAL SHIFT ASSIGNMENTS')
     A            SPECLEQUIP    66A         ALIAS(SPECLEQUIP_MM)
     A                                      TEXT('PLANNED WO SPECIAL EQUIPMENT')
     A            SPECLINSTR   132A         ALIAS(SPECLINSTR_MM)
     A                                      TEXT('WO SPECIAL INSTRUCTIONS  ')
     A            STARTDATE      8A         ALIAS(STARTDATE_MM)
     A                                      TEXT('DATE PWO STARTED         ')
     A            STARTTIME      4A         ALIAS(STARTTIME_MM)
     A                                      TEXT('TIME PWO STARTED         ')
     A            STATHIST1      2A         ALIAS(STATHIST1_MM)
     A                                      TEXT('VERBAL WO STATUS CHANGE  ')
     A            STATHIST2      2A         ALIAS(STATHIST2_MM)
     A                                      TEXT('VERBAL WO STATUS CHANGE 2')
     A            STATHIST3      2A         ALIAS(STATHIST3_MM)
     A                                      TEXT('VERBAL WO STATUS CHANGE 3')
     A            STATUSPAD     12A         ALIAS(STATUSPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            STRTSTATUS     2A         ALIAS(STRTSTATUS_MM)
     A                                      TEXT('LOOP WO STARTED AND EXISTS')
     A            SUFFIXPAD     12A         ALIAS(SUFFIXPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            TABLEPAD      12A         ALIAS(TABLEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            TASKNUMBER     4A         ALIAS(TASKNUMBER_MM)
     A                                      TEXT('TASK NUMBER              ')
     A            TASKRENUM      4A         ALIAS(TASKRENUM_MM)
     A                                      TEXT('TASK NUMBER FOR RENUMBER ')
     A            THRDSHIFT      4A         ALIAS(THRDSHIFT_MM)
     A                                      TEXT('THIRD SHIFT START TIME   ')
     A            TIMECOMP       4A         ALIAS(TIMECOMP_MM)
     A                                      TEXT('TIME WO WAS COMPLETED    ')
     A            TIMEHIST1      4A         ALIAS(TIMEHIST1_MM)
     A                                      TEXT('VERBAL WO TIME STATUS CHGED')
     A            TIMEHIST2      4A         ALIAS(TIMEHIST2_MM)
     A                                      TEXT('VERBAL WO TIME STATUS CHGED')
     A            TIMEHIST3      4A         ALIAS(TIMEHIST3_MM)
     A                                      TEXT('VERBAL WO TIME STATUS CHGED')
     A            TIMEINIT       4A         ALIAS(TIMEINIT_MM)
     A                                      TEXT('VERBAL WO TIME STATUS CHGED')
     A            TIMERECD       4A         ALIAS(TIMERECD_MM)
     A                                      TEXT('TIME WO WAS INPUT TO MMIS')
     A            TIMEREQD       4A         ALIAS(TIMEREQD_MM)
     A                                      TEXT('TIME WO PARTS/LABOR REQUIRED')
     A            TIMESCHD       4A         ALIAS(TIMESCHD_MM)
     A                                      TEXT('TIME WO IS SCHEDULED     ')
     A            TIMESTAMP      4A         ALIAS(TIMESTAMP_MM)
     A                                      TEXT('TIME TRACKING RCD IS WRITTEN')
     A            TIMESTRT       4A         ALIAS(TIMESTRT_MM)
     A                                      TEXT('TIME WO IS STARTED       ')
     A            TOCC           4A         ALIAS(TOCC_MM)
     A                                      TEXT('CLOCK CARD MESSAGE SENT TO')
     A            TOWO          10A         ALIAS(TOWO_MM)
     A                                      TEXT('WO MESSAGE SENT TO       ')
     A            TRANSTATUS     2A         ALIAS(TRANSTATUS_MM)
     A                                      TEXT('TRANSFER STATUS IN TRACKING')
     A            USERID         4A         ALIAS(USERID_MM)
     A                                      TEXT('USER ID IN WO TRACKING   ')
     A            USERNAME       8A         ALIAS(USERNAME_MM)
     A                                      TEXT('USER NAME IN WO TRACKING ')
     A            USERTERM       4A         ALIAS(USERTERM_MM)
     A                                      TEXT('USER TERMINAL IN WO TRACKING')
     A            WONUM         10A         ALIAS(WONUM_MM)
     A                                      TEXT('11,12,13,14/15,63        ')
     A            WOSTATUS       2A         ALIAS(WOSTATUS_MM)
     A                                      TEXT('WORK ORDER STATUS        ')
     A            WOTYPESTAT     2A         ALIAS(WOTYPESTAT_MM)
     A                                      TEXT('TRACKING STATUS INFORMATION')
     A            ZONE           4A         ALIAS(ZONE_MM)
     A                                      TEXT('ZONE')
     A            ZONEPAD       12A         ALIAS(ZONEPAD_MM)
     A                                      TEXT('PAD AREA                 ')
     A            ZONEPRTY       6A         ALIAS(ZONEPRTY_MM)
     A                                      TEXT('ZONE (4) AND PRIORITY (2)')
