     A          R NRCVFILE
     A            PLT            3A
     A            INVNO         14A
     A            INVDATE        8A
     A            CHKDTE         8A
     A            MFSTNO         3A
     A            MFSTYR         2A
     A            PORLSE        10A
     A            PODTE          8A
     A            VENCDE        10A
     A            VENNAME       44A
     A            VENADDR       44A
     A            VENCITY       24A
     A            VENSTATE       2A
     A            VENZIP         9A
     A            CURRCODE       2A
     A            FRTAMT        10S 2
     A            NETDUEVEN     15S 2
     A            SALESTAX      15S 2
     A            ACCRTAX       12S 2
     A            REGNO          6A
     A            ACCT          16A
     A            ITEMNO         4A
     A            CCODE          7A
     A            DESC          50A
     A            QTYPD         12S 4
     A            UM             2A
     A            ITMAMT        14S 4
