      ***************************************************************
      * FILE NAME : MCFPARPO2D
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : ARIBA PO DETAIL SHADOW FILE
      *
      * CREATED   : 11/18/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      * BASED ON HP3000 DATASET DARIBAPO DETAIL
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRARPO2D
     A            ARBPONO   R
     A            ARBRECIND R
     A            OLDPONO   R
     A            ARBRECIFO R
