      ***************************************************************
      * FILE NAME : MCFPMONJP
      *
      * PURPOSE   : MONITOR JOB PARMS
      *
      * CREATED   : 11/25/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRMONJP
     A            MJJOBPROC R               REFFLD(JOBNAME)
     A                                      ALIAS(MJ_JOBPROC_CS)
     A                                      COLHDG('JOB PROCESS')
     A                                      TEXT('JOB PROCESS')
     A            MJJOBNAME R               REFFLD(JOBNAME)
     A                                      COLHDG('JOB NAME')
     A                                      TEXT('JOB NAME')
     A            MJJOBDESC R               REFFLD(JOBDESC)
     A                                      COLHDG('JOB DESCRIPTION')
     A                                      TEXT('JOB DESCRIPTION')
     A            MJJOBPROG R               REFFLD(JOBPROG)
     A                                      COLHDG('JOB PGM CALLED')
     A                                      TEXT('JOB PGM CALLED')
     A            MJJOBTYPE R               REFFLD(JOBCALLFL)
     A                                      ALIAS(MJ_JOBTYPE_CS)
     A                                      COLHDG('JOB TYPE')
     A                                      TEXT('JOB TYPE')
     A            MJCALLFL  R               REFFLD(JOBCALLFL)
