      ***************************************************************
      * FILE NAME : MCFPARPOD
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : ARIBA PO DETAIL
      *
      * CREATED   : 10/15/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      * BASED ON HP3000 DATASET DARIBAPO DETAIL
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRARPOD
     A            ARBPONO   R
     A            ARBRECIND R
     A            OLDPONO   R
     A            ARBRECIFO R
