      ***************************************************************
      * FILE NAME : MCFPARRS2T
      * FILE TYPE : PHYSICAL FILE
      *
      * PURPOSE   : ARIBA RESULTS FILE - GOODYEAR COPY
      *
      * CREATED   : 11/19/2002
      * AUTHOR    : EXLTECH, INC - DAN RAUCH
      *
      ***************************************************************
      * SPECIAL NOTES:
      ***************************************************************
     A                                      REF(STORES)
     A          R MCFRARRS2T
     A            ARBPONO   R
     A            SFFLAG    R
     A            OLDPONO   R
     A            DATETIME14R
     A            DESCDTA   R
