     A          R PAVFP66
     A            RPTYEAR        4A
     A                                      TEXT('REPORT YEAR              ')
     A            RPTMM          2A
     A                                      TEXT('REPORT MONTH             ')
     A            PLANTID        2A
     A                                      TEXT('PLANT ID                 ')
     A            WORKDAY        3S
     A                                      TEXT('WORK DAYS                ')
     A            TIREDAY        7S
     A                                      TEXT('TIRES PER DAY            ')
     A            TIREMONTH      9S
     A                                      TEXT('TIRES PER MONTH          ')
     A            TONMONTH       7S
     A                                      TEXT('TONS PER MONTH           ')
     A            TONDAY         6S
     A                                      TEXT('TONS PER DAY             ')
     A            FILLER         5A
     A                                      TEXT('FILLER                   ')
