     A          R PAW00000
     A            PREVCODE      11A         ALIAS(PREVCODE_CS)
     A                                      TEXT('PREVIOUS CODE            ')
     A            CORPCODE       7A         ALIAS(CORPCODE_CS)
     A                                      TEXT('CORPORATE CODE           ')
     A            KEYMOD        50A         ALIAS(DESCR_CA)
     A                                      TEXT('KEYWORD/MODIFIER         ')
     A            FILLER1        1A         ALIAS(FILLER1_CS)
     A                                      TEXT('FILLER                   ')
     A            FILLER6        6A         ALIAS(FILLER6_CS)
     A                                      TEXT('FILLER                   ')
     A            FILLER58      58A         ALIAS(FILLER58_CS)
     A                                      TEXT('FILLER                   ')
