     A                                      REF(PAW00000)
     A          R PAWCODESX
     A            FILLER1   R
     A            PREVCODE  R
     A            CORPCODE  R
     A            FILLER6   R
     A            KEYMOD    R
     A            FILLER58  R
