     A                                      REF(STORES)
     A          R R3UMRPTFL
     A            CORPCDE   R
     A            KEYWORDADJR
     A            PLTR3UM        2A
     A            PLT131UM       2A
     A            PLT153UM       2A
     A            PLT112UM       2A
     A            PLT126UM       2A
     A            PLT129UM       2A
     A            PLT133UM       2A
     A            PLT155UM       2A
     A            PLT629UM       2A
     A            PLT631UM       2A
     A            PLT637UM       2A
