     A          R RSAFETY
     A            SCDATESTMP     8A         ALIAS(SCDATESTAMP)
     A                                      TEXT('SAFETY CONTACT DATE STAMP')
     A            SCTIMESTMP     4A         ALIAS(SCTIMESTAMP)
     A                                      TEXT('SAFETY CONTACT TIME STAMP')
     A            SCINITCC       4A         ALIAS(SCCLOCKCARD)
     A                                      TEXT('SAFETY CONTACT INITIATOR ')
     A            SCINITIATE    16A         ALIAS(SCINITIATOR)
     A                                      TEXT('SAFETY CONTACT INITIATOR ')
     A            SCEQPNUM       6A         ALIAS(SCEQUIPNUM)
     A                                      TEXT('SAFETY CONTACT EQUIPMENT ')
     A            SCEQPNAME     50A         ALIAS(SCEQUIPNAME)
     A                                      TEXT('SAFETY CONTACT EQUIP NAME')
     A            SCZONE         4A         ALIAS(SCEQPZONE)
     A                                      TEXT('SAFETY CONTACT ZONE      ')
     A            SCDESCONE     30A         ALIAS(SCDESCRIPTION1)
     A                                      TEXT('SAFETY CONTACT LOCATION  ')
     A            SCDESCTWO    132A         ALIAS(SCDESCRIPTION2)
     A                                      TEXT('OBSERVATION/ACTION       ')
     A            SCDELDATE      8A         ALIAS(SCPURGEDATE)
     A                                      TEXT('SAFETY CONTACT PURGE DATE')
