     A          R RSTHIST
     A            ADDLDTA       16A         ALIAS(ADDLDTA_ST)
     A                                      TEXT('ADDITIONAL DATA             ')
     A            BUDGETAMT     11P         ALIAS(BUDGETAMT_ST)
     A                                      TEXT('BUDGET AMOUNT               ')
     A            BUDGETNO      12A         ALIAS(BUDGETNO_ST)
     A                                      TEXT('BUDGET NUMBER               ')
     A            BUYERCDE       4A         ALIAS(BUYERCDE_ST)
     A                                      TEXT('BUYER CODE                  ')
     A            COMMNT        70A         ALIAS(COMMNT_ST)
     A                                      TEXT('COMMENT IN RECEIVING SLIP')
     A            CORPCDE        8A         ALIAS(CORPCDE_ST)
     A                                      TEXT('CORPORATE CODE              ')
     A            CORRACTION     2A         ALIAS(CORRACTION_ST)
     A                                      TEXT('CORRECTIVE ACTION           ')
     A            DTERCVD        8A         ALIAS(DTERCVD_ST)
     A                                      TEXT('DATE RECEIVED ON DOCK    ')
     A            DTECORRECT     8A         ALIAS(DTECORRECT_ST)
     A                                      TEXT('DATE OF CORRECTION       ')
     A            EARLYDAYS      4S         ALIAS(EARLYDAYS_ST)
     A                                      TEXT('EARLY DAYS RANGE         ')
     A            EDITRANMOD     2A         ALIAS(EDITRANMOD_ST)
     A                                      TEXT('EDI TRANSPORTATION MODE     ')
     A            EDITRANCHG     2A         ALIAS(EDITRANCHG_ST)
     A                                      TEXT('EDI TRANSPORATION CHARGE    ')
     A            EDITRANDEL     4A         ALIAS(EDITRANDEL_ST)
     A                                      TEXT('EDI TRANS. DELIVERY TERMS   ')
     A            EECCOMCODE    12A         ALIAS(EECCOMCODE_ST)
     A                                      TEXT('EEC COMMODITY CODE       ')
     A            EECCNTRYOR     4A         ALIAS(EECCNTRYOR_ST)
     A                                      TEXT('EEC COUNTRY OF ORIGIN    ')
     A            EECNETMASS     8S         ALIAS(EECNETMASS_ST)
     A                                      TEXT('EEC NET MASS             ')
     A            EECQUAL       12A         ALIAS(EECQUAL_ST)
     A                                      TEXT('EEC QUALIFIER DESCRIPTION')
     A            EECQUALCD      4A         ALIAS(EECQUALCD_ST)
     A                                      TEXT('EEC QUALIFIER CODE')
     A            EECSUPUNTS     8S         ALIAS(EECSUPUNTS_ST)
     A                                      TEXT('EEC SUPPLEMENTARY UNITS  ')
     A            EMPLOYID       4A         ALIAS(EMPLOYID_ST)
     A                                      TEXT('EMPLOYEE ENTERING FRT ON RCV')
     A            EXPECTDTE      9B         ALIAS(EXPECTDTE_ST)
     A                                      TEXT('EXPECT DATE OF ORDER        ')
     A            FOB            2A         ALIAS(FOB_ST)
     A                                      TEXT('FREIGHT ON BOARD            ')
     A            FRTBILLDTE     9B         ALIAS(FRTBILLDTE_ST)
     A                                      TEXT('DATE OF FREIGHT BILL        ')
     A            FRTBILLNO     16A         ALIAS(FRTBILLNO_ST)
     A                                      TEXT('FREIGHT BILL (PRO) NUMBER   ')
     A            FRTCARRIER     4A         ALIAS(FRTCARRIER_ST)
     A                                      TEXT('CARRIER CODE                ')
     A            FRTCARRWT      9B         ALIAS(FRTCARRWT_ST)
     A                                      TEXT('CARRIERS WEIGHT OF FREIGHT  ')
     A            FRTCHRGS      15P         ALIAS(FRTCHRGS_ST)
     A                                      TEXT('FREIGHT CHARGES             ')
     A            FRTDTEARR      9B         ALIAS(FRTDTEARR_ST)
     A                                      TEXT('DATE FREIGHT ARRIVED        ')
     A            FRTDTERCV      9B         ALIAS(FRTDTERCV_ST)
     A                                      TEXT('DATE FRT RECEIVED ON DOCK   ')
     A            FRTLOT         8A         ALIAS(FRTLOT_ST)
     A                                      TEXT('LOT NUMBER ON FREIGHT       ')
     A            FRTOSD         4A         ALIAS(FRTOSD_ST)
     A                                      TEXT('OSD NUMBER FOR FREIGHT      ')
     A            FRTOSDCLM     68A         ALIAS(FRTOSDCLM_ST)
     A                                      TEXT('OSD COMMNT FOR FREIGHT      ')
     A            FRTOURWT       9B         ALIAS(FRTOURWT_ST)
     A                                      TEXT('GOODYEARS WEIGHT OF FREIGHT ')
     A            FRTPACKSLP    12A         ALIAS(FRTPACKSLP_ST)
     A                                      TEXT('PACKING SLIP NUMBER         ')
     A            FRTRAILCAR    10A         ALIAS(FRTRAILCAR_ST)
     A                                      TEXT('RAIL CAR NUMBER OF FREIGHT  ')
     A            FRTREFERBK    14A         ALIAS(FRTREFERBK_ST)
     A                                      TEXT('1ST PO TO RECEIVE FREIGHT')
     A            FRTSEALS      68A         ALIAS(FRTSEALS_ST)
     A                                      TEXT('FREIGHT COMMENT FIELD    ')
     A            FRTSPLC       10A         ALIAS(FRTSPLC_ST)
     A                                      TEXT('SPLC CODE                   ')
     A            FRTTYPE        2A         ALIAS(FRTTYPE_ST)
     A                                      TEXT('TYPE OF FREIGHT             ')
     A            INVACCTDTA    16A         ALIAS(INVACCTDTA_ST)
     A                                      TEXT('INVOICE ACCOUNTING DATA     ')
     A            INVACCTPCT     9B         ALIAS(INVACCTPCT_ST)
     A                                      TEXT('INVOICE DISTRIBUTION PERCENT')
     A            INVADDCLRK     4A         ALIAS(INVADDCLRK_ST)
     A                                      TEXT('INVOICE ADD CLERK           ')
     A            INVADDCTNR    15P         ALIAS(INVADDCNTR_ST)
     A                                      TEXT('INVOICE ADD CONTAINER       ')
     A            INVADDINS     15P         ALIAS(INVADDINS_ST)
     A                                      TEXT('INVOICE ADD INSURANCE       ')
     A            INVADDOTHR    15P         ALIAS(INVADDOTHR_ST)
     A                                      TEXT('INVOICE ADD OTHER           ')
     A            INVADDTAX     15P         ALIAS(INVADDTAX_ST)
     A                                      TEXT('INVOICE ADD TAX             ')
     A            INVADDVFRT    15P         ALIAS(INVADDVFRT_ST)
     A                                      TEXT('INVOICE ADD FREIGHT         ')
     A            INVADJATX1    22A         ALIAS(INVADJATX1_ST)
     A                                      TEXT('INVOICE ACCRUED TAX         ')
     A            INVADJATX2    22A         ALIAS(INVADJATX2_ST)
     A                                      TEXT('INVOICE ACCRUED TAX         ')
     A            INVADJATX3    22A         ALIAS(INVADJATX3_ST)
     A                                      TEXT('INVOICE ACCRUED TAX         ')
     A            INVADJATX4    22A         ALIAS(INVADJATX4_ST)
     A                                      TEXT('INVOICE ACCRUED TAX         ')
     A            INVADJOTHR    15P         ALIAS(INVADJOTHR_ST)
     A                                      TEXT('INVOICE OTHER ADJUSTMENTS   ')
     A            INVCEX1       22A         ALIAS(INVCEX1_ST)
     A                                      TEXT('PREPAYMENT                  ')
     A            INVCEX2       22A         ALIAS(INVCEX2_ST)
     A                                      TEXT('                            ')
     A            INVCE01       22A         ALIAS(INVCE01_ST)
     A                                      TEXT('VENDOR"S INVOICE            ')
     A            INVCE03       22A         ALIAS(INVCE03_ST)
     A                                      TEXT('TRANSPORTATION DEDUCTION    ')
     A            INVCE04       22A         ALIAS(INVCE04_ST)
     A                                      TEXT('INSURANCE DEDUCTION         ')
     A            INVCE05       22A         ALIAS(INVCE05_ST)
     A                                      TEXT('TRANSPORTATION DEDUCTION    ')
     A            INVCE06       22A         ALIAS(INVCE06_ST)
     A                                      TEXT('EXTENSION ERROR             ')
     A            INVCE07       22A         ALIAS(INVCE07_ST)
     A                                      TEXT('PRICE ERROR                 ')
     A            INVCE08       22A         ALIAS(INVCE08_ST)
     A                                      TEXT('CORRECTION NOTICE           ')
     A            INVCE09       22A         ALIAS(INVCE09_ST)
     A                                      TEXT('CASH DISCOUNT               ')
     A            INVCHKDTE      9B         ALIAS(INVCHKDTE_ST)
     A                                      TEXT('INVOICE CHECK DATE          ')
     A            INVCHKNO       8A         ALIAS(INVCHKNO_ST)
     A                                      TEXT('INVOICE DUE DATE            ')
     A            INVCPWCDE      4A         ALIAS(INVCPWCDE_ST)
     A                                      TEXT('INVOICE CPW CODE            ')
     A            INVDSTCOST    15P         ALIAS(INVDSTCOST_ST)
     A                                      TEXT('DISTRIBUTED COST            ')
     A            INVDTE         9B         ALIAS(INVDTE_ST)
     A                                      TEXT('INVOICE DATE                ')
     A            INVDUEDTE      9B         ALIAS(INVDUEDTE_ST)
     A                                      TEXT('INVOICE DUE DATE            ')
     A            INVFREEVRB    20A         ALIAS(INVFREEVRB_ST)
     A                                      TEXT('INVOICE COMMENTS         ')
     A            INVIMATXT     15P         ALIAS(INVIMATXT_ST)
     A                                      TEXT('INVOICE MATERIAL EXTENSION  ')
     A            INVINDTE       9B         ALIAS(INVINDTE_ST)
     A                                      TEXT('INVOICE DATE                ')
     A            INVIQTYPD     15P         ALIAS(INVIQTYPD_ST)
     A                                      TEXT('INVOICE QUANTITY PAID       ')
     A            INVITEMNO      4A         ALIAS(INVITEMNO_ST)
     A                                      TEXT('INVOICE ITEM NUMBER         ')
     A            INVITEMSTS     2A         ALIAS(INVITEMSTS_ST)
     A                                      TEXT('INVOICE ITEM STATUS         ')
     A            INVITINDIC     2A         ALIAS(INVITINDIC_ST)
     A                                      TEXT('INVOICE IT INDICATOR        ')
     A            INVIUPRICE    15P         ALIAS(INVIUPRICE_ST)
     A                                      TEXT('INVOICE UNIT PRICE          ')
     A            INVLINENO      2A         ALIAS(INVLINENO_ST)
     A                                      TEXT('INVOICE LINE NUMBER         ')
     A            INVMODCLRK     4A         ALIAS(INVMODCLRK_ST)
     A                                      TEXT('INVOICE MODIFY CLERK        ')
     A            INVMODDTE      9B         ALIAS(INVMODDTE_ST)
     A                                      TEXT('INVOICE MODIFY DATE         ')
     A            INVNETVEND    15P         ALIAS(INVNETVEND_ST)
     A                                      TEXT('NET DUE VENDOR              ')
     A            INVOICENO     14A         ALIAS(INVOICENO_ST)
     A                                      TEXT('INVOICE NUMBER              ')
     A            INVOICESTS     2A         ALIAS(INVOICESTS_ST)
     A                                      TEXT('INVOICE STATUS              ')
     A            INVOTCFRT     15P         ALIAS(INVOTCFRT_ST)
     A                                      TEXT('TOTAL COLLECT FREIGHT       ')
     A            INVPAYIND      2A         ALIAS(INVPAYIND_ST)
     A                                      TEXT('INVOICE PAYMENT INDICATOR   ')
     A            INVPMATXT     15P         ALIAS(INVPMATXT_ST)
     A                                      TEXT('PO MATERIAL EXTENSION       ')
     A            INVPQTYPD     15P         ALIAS(INVPQTYPD_ST)
     A                                      TEXT('INVOICE PO QUANTITY PAID    ')
     A            INVPRUM        2A         ALIAS(INVPRUM_ST)
     A                                      TEXT('INVOICE PRICE UM            ')
     A            INVPUPRICE    15P         ALIAS(INVPUPRICE_ST)
     A                                      TEXT('INVOICE PO UNIT PRICE       ')
     A            ITEMUM         2A         ALIAS(ITEMUM_ST)
     A                                      TEXT('PO ITEM UM                  ')
     A            ITEMSEQNO      6A         ALIAS(ITEMSEQNO_ST)
     A                                      TEXT('ITEM SEQUENCE NUMBER        ')
     A            ITMACTINFO    16A         ALIAS(ITMACTINFO_ST)
     A                                      TEXT('ITEM ACCOUNTING INFORMATION ')
     A            ITMDTEARR      6A         ALIAS(ITMDTEARR_ST)
     A                                      TEXT('                            ')
     A            ITMDTERCV      9B         ALIAS(ITMDTERCV_ST)
     A                                      TEXT('DATE ITEM IS RECEIVED       ')
     A            ITMDTESTO      8A         ALIAS(ITMDTESTO_ST)
     A                                      TEXT('DATE RECEIVED IN STOREROOM  ')
     A            ITMFLAGS       4A         ALIAS(ITMFLAGS_ST)
     A                                      TEXT('COMPLETE,CONTAINER,DESC     ')
     A            ITMKLYPOUM     2A         ALIAS(ITMKLYPOUM_ST)
     A                                      TEXT('KELLY PO UNIT OF MEASURE ')
     A            ITMKLYQTY     12S         ALIAS(ITMKLYQTY_ST)
     A                                      TEXT('KELLY PO ITEM QUANTITY   ')
     A            ITMNO          4A         ALIAS(ITMNO_ST)
     A                                      TEXT('ITEM NUMBER                 ')
     A            ITMQTYDLVR    15P         ALIAS(ITMQTYDLVR_ST)
     A                                      TEXT('ITEM QUANTITY DELIVERED     ')
     A            ITMQTYORD     15P         ALIAS(ITMQTYORD_ST)
     A                                      TEXT('ITEM QUANTITY ORDERED       ')
     A            ITMQTYPAID    15P         ALIAS(ITMQTYPAID_ST)
     A                                      TEXT('ITEM QUANTITY PAID          ')
     A            ITMQTYSTOR    12P         ALIAS(ITMQTYSTOR_ST)
     A                                      TEXT('QUANTITY RECEIVED IN STORES')
     A            ITMQTYSTR     15P         ALIAS(ITMQTYSTR_ST)
     A                                      TEXT('ITEM QUANTITY STORED       ')
     A            ITMUPRICE     15P         ALIAS(ITMUPRICE_ST)
     A                                      TEXT('ITEM UNIT PRICE             ')
     A            ITMWT          9B         ALIAS(ITMWT_ST)
     A                                      TEXT('ITEM WEIGHT                 ')
     A            ITMZBILVAL    11P         ALIAS(ITMZBILVAL_ST)
     A                                      TEXT('VALUE OF ITEMS FOR REPAIR   ')
     A            LATEDAYS       4S         ALIAS(LATEDAYS_ST)
     A                                      TEXT('LATE DAYS RANGE             ')
     A            MANIFESTNO     6A         ALIAS(MANIFESTNO_ST)
     A                                      TEXT('MANIFEST NUMBER             ')
     A            PAD04          4A         ALIAS(PAD04_ST)
     A                                      TEXT('                         ')
     A            PAD08          8A         ALIAS(PAD08_ST)
     A                                      TEXT('                         ')
     A            PAD10         10A         ALIAS(PAD10_ST)
     A                                      TEXT('                         ')
     A            PAD12         12A         ALIAS(PAD12_ST)
     A                                      TEXT('                         ')
     A            PAD18         18A         ALIAS(PAD18_ST)
     A                                      TEXT('                         ')
     A            PAD20         20A         ALIAS(PAD20_ST)
     A                                      TEXT('                         ')
     A            PAYTERMS       2A         ALIAS(PAYTERMS_ST)
     A                                      TEXT('PAYMENT TERMS               ')
     A            PLTINFODTA    60A         ALIAS(PLTINFODTA_ST)
     A                                      TEXT('PLANT INFORMATION           ')
     A            PLTINFOKEY     4A         ALIAS(PLTINFOKEY_ST)
     A                                      TEXT('KEY FOR NAME,ADDRESS,ETC    ')
     A            POACTINFO     22A         ALIAS(POACTINFO_ST)
     A                                      TEXT('PO ACCOUNTING DATA          ')
     A            POBLDG         4A         ALIAS(POBLDG_ST)
     A                                      TEXT('PO BUILDING NUMBER          ')
     A            POBUYER       18A         ALIAS(POBUYER_ST)
     A                                      TEXT('BUYER NAME=15 TYPIST=3      ')
     A            POCRTTYP       1A         ALIAS(POCRTTYP_ST)
     A                                      TEXT('PO CREATE TYPE              ')
     A            POCURCDE       2A         ALIAS(POCURCDE_ST)
     A                                      TEXT('CURRENCY CODE               ')
     A            PODELDTE       9B         ALIAS(PODELDTE_ST)
     A                                      TEXT('DATE PO IS DELETED          ')
     A            PODTE          9B         ALIAS(PODTE_ST)
     A                                      TEXT('DATE PO IS CREATED          ')
     A            POEXPDTE       9B         ALIAS(POEXPDTE_ST)
     A                                      TEXT('EXPECT DATE OF PO           ')
     A            POFLAG         6A         ALIAS(POFLAG_ST)
     A                                      TEXT('TYP,BLNKT,REMIT,ZBILL,NONRCV')
     A            POFLUPCO       2A         ALIAS(POFLUPCO_ST)
     A                                      TEXT('PO FOLLOWUP COUNT           ')
     A            POFLUPDA       8A         ALIAS(POFLUPDA_ST)
     A                                      TEXT('PO FOLLOWUP DATE            ')
     A            POFOB         20A         ALIAS(POFOB_ST)
     A                                      TEXT('PO FOB TERMS                ')
     A            POFORDEPT      6A         ALIAS(POFORDEPT_ST)
     A                                      TEXT('FOR DEPARTMENT              ')
     A            POINVIND       1A         ALIAS(POINVIND_ST)
     A                                      TEXT('PO INVOICELESS INDICATOR    ')
     A            POITEMDESC    80A         ALIAS(POITEMDESC_ST)
     A                                      TEXT('PO ITEM DESCRIPTION         ')
     A            POITEMSEQ      6A         ALIAS(POITEMSEQ_ST)
     A                                      TEXT('SEQUENCE NUMBER             ')
     A            POLASTPAY      6A         ALIAS(POLASTPAY_ST)
     A                                      TEXT('LAST PAYMENT DATE YYMM      ')
     A            POLASTRCVR     4A         ALIAS(POLASTRCVR_ST)
     A                                      TEXT('LAST RECEIVER FOR PO        ')
     A            PONO          10A         ALIAS(PONO_ST)
     A                                      TEXT('PO NUMBER                   ')
     A            POPLT          4A         ALIAS(POPLT_ST)
     A                                      TEXT('PO PLANT CODE               ')
     A            PORCVDEPT      6A         ALIAS(PORCVDEPT_ST)
     A                                      TEXT('RECEIVING DEPARTMENT        ')
     A            PORCVNO       14A         ALIAS(PORCVNO_ST)
     A                                      TEXT('PO-RELEASE-RECEIVING SLIP # ')
     A            POREQNO       12A         ALIAS(POREQNO_ST)
     A                                      TEXT('PO REQ NUMBER               ')
     A            POSTS          2A         ALIAS(POSTS_ST)
     A                                      TEXT('STATUS S=CODED N=NONCODED   ')
     A            POVIA         20A         ALIAS(POVIA_ST)
     A                                      TEXT('SHIPPED VIA...              ')
     A            PRICEUM        2A         ALIAS(PRICEUM_ST)
     A                                      TEXT('PRICE UNIT OF MEASURE       ')
     A            RCVRSEQNO      6A         ALIAS(RCVRSEQNO_ST)
     A                                      TEXT('RECEIVER SEQUENCE NUMBER    ')
     A            RCVSLIP       14A         ALIAS(RCVSLIP_ST)
     A                                      TEXT('RECEIVING SLIP NUMBER       ')
     A            RCVCORRECT   142A         ALIAS(RCVCORRECT_ST)
     A                                      TEXT('RCVG CORRECTION REASON      ')
     A            REGISTERNO     6A         ALIAS(REGISTERNO_ST)
     A                                      TEXT('REGISTER NUMBER             ')
     A            REQNO         12A         ALIAS(REQNO_ST)
     A                                      TEXT('REQUISITION NUMBER          ')
     A            SEQNO          4S         ALIAS(SEQNO_ST)
     A                                      TEXT('SEQUENCE NUMBER             ')
     A            SHIPDTE        9B         ALIAS(SHIPDTE_ST)
     A                                      TEXT('SHIPPING DATE OF ORDER      ')
     A            STDINSTRS     12A         ALIAS(STDINSTRS_ST)
     A                                      TEXT('STANDARD INSTRUCTIONS       ')
     A            TAXCDE         2A         ALIAS(TAXCDE_ST)
     A                                      TEXT('TAX CODE                    ')
     A            TERMS          2A         ALIAS(TERMS_ST)
     A                                      TEXT('PAYMENT TERMS               ')
     A            VENCDE        10A         ALIAS(VENCDE_ST)
     A                                      TEXT('VENDOR CODE                 ')
     A            VENITMDTA     44A         ALIAS(VENITMDTA_ST)
     A                                      TEXT('VENDOR COMMENT              ')
     A            VENITMNO       2A         ALIAS(VENITMNO_ST)
     A                                      TEXT('ITEM NUMBER                 ')
     A            ZBILLNO        6A         ALIAS(ZBILLNO_ST)
     A                                      TEXT('ZBILL NUMBER                ')
