      ***************************************************************
      * FILE NAME : STORES
      * FILE TYPE : REFERENCE FILE
      *
      * PURPOSE   : DATA DICTIONARY
      ***************************************************************
      *                 M O D I F I C A T I O N S
      ***************************************************************
      * MODID     WHEN   WHO        DESCRIPTION
      * -----  --------- ---------  ---------------------------------
      * DCR01  20021015  D.RAUCH    MODS PER ARIBA BUYER PROJECT
      * DCR02  20030904  D.RAUCH    ADD FLDS FOR INVENTORY REPLEN
      * DCR03  20031210  D.RAUCH    ADD FLDS FOR CHECKBOOK DATA
      ***************************************************************
     A          R RSTORES
     A            ABSTSEQNO      5A         ALIAS(ABSTSEQNO_CS)
     A                                      TEXT('ABSTFILE SEQ NUMBER')
     A            ACCTGINFO     22A         ALIAS(ACCTGINFO_CS)
     A                                      TEXT('CO,PRIME,CLASS,SUBD,ADL DATA')
     A            ACCTNAME       8A         ALIAS(ACCTNAME_CS)
     A                                      TEXT('ACCOUNT NAME')
     A            ACTFLG         1A         ALIAS(ACTFLG_CS)
     A                                      TEXT('                         ')
     A            ACTGCLASS      4A         ALIAS(CLASS_CA)
     A                                      TEXT('ACCOUNTING CLASS    ')
     A            ADDLDTA        8A         ALIAS(ADDLDTA_CS)
     A                                      TEXT('ADDITIONAL DATA          ')
     A            ADDLINFO      16A         ALIAS(ADDLINFO_CS)
     A                                      TEXT('PO HEADER INFORMATION    ')
     A            APPBUCK1       8A         ALIAS(APPBUCK1_CS)
     A                                      TEXT('APPROVER DAILY   DOLLARS ')
     A            APPBUCK2       8A         ALIAS(APPBUCK2_CS)
     A                                      TEXT('APPROVER WEEKLY  DOLLARS ')
     A            APPBUCK3       8A         ALIAS(APPBUCK3_CS)
     A                                      TEXT('APPROVER MONTHLY DOLLARS ')
     A            APPLYDATE      8A         ALIAS(APPLYDATE_CS)
     A                                      TEXT('PRICE APPLY DATE CYMD    ')
     A            APPLYTIME      6A         ALIAS(APPLYTIME_CS)
     A                                      TEXT('PRICE APPLY TIME         ')
     A            APPRQFLG       1A         ALIAS(APPFLG_CS)
     A                                      TEXT('                         ')
     A            APPRSTAT       2A         ALIAS(APPRSTAT_CS)
     A                                      TEXT('FAX APPROVAL STATUS      ')
DCR01 *==============================================================
DCR01 **** NEW ARIBA FIELDS
DCR01A            ARBPONO       50A         ALIAS(ARBPONO_CS)
DCR01A                                      TEXT('ARIBA PO NUMBER          ')
DCR01A            ARBRECIND      2A         ALIAS(ARBRECIND_CS)
DCR01A                                      TEXT('ARIBA RECORD INDICATOR   ')
DCR01A            ARBRECIFO    194A         ALIAS(ARBRECIFO_CS)
DCR01A                                      TEXT('ARIBA RECORD INFO        ')
DCR01A            ARBVNDNO      10A         ALIAS(ARBVNDNO_CS)
DCR01A                                      TEXT('ARIBA VENDOR NUMBER      ')
DCR02A            AUXID         50A         ALIAS(AUXID_CS)
DCR02A                                      TEXT('AUXILLARY ID             ')
DCR01 *==============================================================
     A            ASNQTY        12S         ALIAS(ASNQTY_CS)
     A                                      TEXT('ASN QUANTITY IN TRANSIT  ')
     A            ASNDATE        8A         ALIAS(ASNDATE_CS)
     A                                      TEXT('ASN DATE NOTIFIED        ')
     A            ACTUAPPRVR     4A         ALIAS(ACTUAPPRVR_CS)
     A                                      TEXT('ACTUAL PO APPROVER       ')
     A            AUTHAPPRVR     4A         ALIAS(AUTHAPPRVR_CS)
     A                                      TEXT('AUTHORIZED PO APPROVER   ')
     A            AUTHLEVEL      2A         ALIAS(AUTHLEVEL_CS)
     A                                      TEXT('AUTHORIZED PO LEVEL      ')
     A            BINOWNER      24A         ALIAS(BINOWNER_CS)
     A                                      TEXT('BIN OWNER AREA           ')
     A            BUDGETAMT     11P         ALIAS(BUDGETAMT_CS)
     A                                      TEXT('BUDGET AMOUNT            ')
     A            BUDGETC       11A         ALIAS(BUDGETC_CS)
     A                                      TEXT('BUDGET AMOUNT IN CHARS   ')
     A            BUDGETNO      12A         ALIAS(BUDGETNO_CS)
     A                                      TEXT('BUDGET NUMBER            ')
     A            BUYERCDE       4A         ALIAS(BUYERCDE_CS)
     A                                      TEXT('BUYER CODE               ')
     A            BUYERNAME     16A         ALIAS(BUYERNAME_CS)
     A                                      TEXT('BUYER NAME               ')
     A            BUYERPHON     26A         ALIAS(BUYERPHON_CS)
     A                                      TEXT('BUYER PHONE              ')
     A            BUYERDOLS      8A         ALIAS(BUYERDOLS_CS)
     A                                      TEXT('BUYER DOLLAR LIMIT       ')
     A            BYPASSCAP      1A         ALIAS(BYPASSCAP_CS)
     A                                      TEXT('                         ')
     A            CATNUM        10A         ALIAS(CATNUM_CS)
     A                                      TEXT('CATALOG NUMBER           ')
     A            CDEOWNER       4A         ALIAS(CDEOWNER_CS)
     A                                      TEXT('CORPORATE CODE OWNER')
     A            CHATNO         6A         ALIAS(CHATNO_CS)
     A                                      TEXT('CHESS CHAT NUMBER   ')
     A            CLSDCHGVAL    14S         ALIAS(CLSDCHGVAL_CA)
     A                                      TEXT('                    ')
     A            CLSS           4A         ALIAS(CLSS_CS)
     A                                      TEXT('CLASS                    ')
DCR01A            CMD           12A         ALIAS(CMD_CS)
DCR01A                                      TEXT('NEW RECORD INSERT        ')
     A            COMMNT        70A         ALIAS(COMMNT_CS)
     A                                      TEXT('COMMENT IN RECEIVING SLIP')
DCR01A            COMMCDFLN      1A         ALIAS(COMMCDFLN_CS)
DCR01A                                      TEXT('COMMODITY CODE FILTER LEN')
DCR01A            COMMCD         7A         ALIAS(COMMCD_CS)
DCR01A                                      TEXT('COMMODITY CODE')
     A            CONTAINNUM     8A         ALIAS(CONTAINNUM_CS)
     A                                      TEXT('CONTAINER NUMBER         ')
     A            CORPALTKEY    40A         ALIAS(CORPALTKEY_CS)
     A                                      TEXT('CORPORATE CODE ALTERNATE KEY')
     A            CORPCDE        8A         ALIAS(CORPCDE_CS)
     A                                      TEXT('STORES CORPORATE CODE    ')
     A            CORPCDE7       7A         ALIAS(CORPCDE7_CS)
     A                                      TEXT('STORES CORP CODE 7 DIGITS')
     A            CORPLOT       12A         ALIAS(CORPLOT_CS)
     A                                      TEXT('CODE (8) AND LOT # (4)   ')
     A            CORRACTION     2A         ALIAS(CORRACTION_CS)
     A                                      TEXT('CORRECTIVE ACTION TAKEN  ')
     A            CRTRQFLG       1A         ALIAS(CRTRQFLG_CS)
     A                                      TEXT('                         ')
     A            CURRCDE3       3A         ALIAS(CURRCDE3_CS)
     A                                      TEXT('CURRENCY CODE            ')
     A            CURRNCYCDE     2A         ALIAS(CURRNCYCDE_CS)
     A                                      TEXT('VALID CURRENCY CODE      ')
     A            DAILYTC       62A         ALIAS(DAILYTC_CS)
     A                                      TEXT('TRANSACTION CODE DATA    ')
     A            DATECYMD       8A         ALIAS(DATECYMD_CS)
     A                                      TEXT('DATE CYMD                ')
     A            DATCYMD        8B         ALIAS(DATCYMD_CS)
     A                                      TEXT('DATE CYMD, BINARY        ')
     A            DATTIMSTMP    12A         ALIAS(DATETIME_CS)
     A                                      TEXT('DATE/TIME STAMP')
DCR01A            DATETIME14    14A         ALIAS(DATETIME14_CS)
DCR01A                                      TEXT('DATE/TIME STAMP')
     A            DCOMDTA       82A         ALIAS(DCOMDTA_CS)
     A                                      TEXT('PURCHASE ORDER COMMENTS  ')
     A            DCOMLINENO     4A         ALIAS(DCOMLINENO_CS)
     A                                      TEXT('COMMENT LINE NUMBERS     ')
     A            DEPTCHGD       4A         ALIAS(DEPTCHGD_CS)
     A                                      TEXT('DEPT CHARGED')
     A            DEPTRQST       4A         ALIAS(DEPTRQST_CS)
     A                                      TEXT('REQUESTING DEPT')
     A            DESCDTA       80A         ALIAS(DESCDTA_CS)
     A                                      TEXT('CODE DESCRIPTION LINE    ')
     A            DESCDTA1      80A         ALIAS(DESCDTA1_CS)
     A                                      TEXT('CODE DESCRIPTION LINE1   ')
     A            DESCDTA2      80A         ALIAS(DESCDTA2_CS)
     A                                      TEXT('CODE DESCRIPTION LINE2   ')
     A            DESCDTA3      80A         ALIAS(DESCDTA3_CS)
     A                                      TEXT('CODE DESCRIPTION LINE3   ')
     A            DESCDTA4      80A         ALIAS(DESCDTA4_CS)
     A                                      TEXT('CODE DESCRIPTION LINE4   ')
     A            DESCDTA5      80A         ALIAS(DESCDTA5_CS)
     A                                      TEXT('CODE DESCRIPTION LINE5   ')
     A            DESCIDNUM      2A         ALIAS(DESCIDNUM_CS)
     A                                      TEXT('DESCRIPTION LINE COUNTER ')
     A            DESCR         60A         ALIAS(DESCR_CA)
     A                                      TEXT('                    ')
     A            DLYTCDTE       6A         ALIAS(DLYTCDTE_CS)
     A                                      TEXT('TRANSACTION DATE         ')
     A            DLYTCPLT       6A         ALIAS(DLYTCPLT_CS)
     A                                      TEXT('TRANSACTION CODE & PLANT ')
     A            DLYTCTIME      6A         ALIAS(DLYTCTIME_CS)
     A                                      TEXT('TRANSACTION TIME         ')
     A**DATAQ FIELDS *********************************************
     A            DQPGM         10A         ALIAS(DATAQ_PGM_CS)
     A                                      TEXT('DATAQ PROGRAM')
     A            DQPRC         10A         ALIAS(DATAQ_PROCESS_CS)
     A                                      TEXT('DATAQ PROCESS')
     A            DQNAME        10A         ALIAS(DATAQ_NAME_CS)
     A                                      TEXT('DATAQ NAME')
     A            DQLIBR        10A         ALIAS(DATAQ_LIBR_CS)
     A                                      TEXT('DATAQ LIBRARY')
     A            DQSLEN         5P 0       ALIAS(DATAQ_SENDLEN_CS)
     A                                      TEXT('DATAQ SEND LENGTH')
     A            DQRLEN         5P 0       ALIAS(DATAQ_RCVLEN_CS)
     A                                      TEXT('DATAQ RCV LENGTH')
     A            DQKEYOR        2A         ALIAS(DATAQ_KEY_ORD_CS)
     A                                      TEXT('DATAQ KEY ORDER')
     A            DQKEYLN        5P 0       ALIAS(DATAQ_KEY_LENGTH_CS)
     A                                      TEXT('DATAQ KEY LENGTH')
     A            DQWAIT         5P 0       ALIAS(DATAQ_WAIT_TIME_CS)
     A                                      TEXT('DATAQ WAIT TIME')
     A            DQSNDRLN       3P 0       ALIAS(DATAQ_SNDDTA_LEN_CS)
     A                                      TEXT('DATAQ SENDER DATA LENGTH')
     A            DQRMVMSG      10A         ALIAS(DATAQ_REMOVE_MSG_CS)
     A                                      TEXT('DATAQ REMOVE MESSAGE')
     A            DQASYNCRQ     10A         ALIAS(DATAQ_ASYNC_RQST_CS)
     A                                      TEXT('DATAQ ASYNC REQUEST')
     A            DQRCVRSZ       5P 0       ALIAS(DATAQ_RECEIVER_SZ_CS)
     A                                      TEXT('DATAQ RECEIVER SIZE')
     A**DATAQ FIELDS *********************************************
     A            DTAITEM       80A         ALIAS(DTAITEM_CS)
     A                                      TEXT('PO DESCRIPTION LINES     ')
     A            DTERCVD        8A         ALIAS(DTERCVD_CS)
     A                                      TEXT('DATE RECEIVED ON DOCK    ')
     A            DTECORRECT     8A         ALIAS(DTECORRECT_CS)
     A                                      TEXT('DATE OF CORRECTION       ')
     A            EARLYDAYS      4S         ALIAS(EARLYDAYS_CS)
     A                                      TEXT('EARLY DAYS RANGE         ')
     A            EDILOGBANO     8A         ALIAS(EDIDOCBANO_CS)
     A                                      TEXT('EDI DOCUMENT BATCHNO     ')
     A            EDILOGFILL    32A         ALIAS(EDIDOCFILL_CS)
     A                                      TEXT('EDI DOCUMENT FILLER      ')
     A            EDILOGFLGS     6A         ALIAS(EDIDOCFLGS_CS)
     A                                      TEXT('EDI DOCUMENT FLAGS       ')
     A            EDILOGINDA     8A         ALIAS(EDIDOCINDA_CS)
     A                                      TEXT('EDI DOCUMENT INIT DATE   ')
     A            EDILOGINTI     6A         ALIAS(EDIDOCINTI_CS)
     A                                      TEXT('EDI DOCUMENT INIT TIME   ')
     A            EDILOGITMN     4A         ALIAS(EDIDICITMN_CS)
     A                                      TEXT('EDI DOCUMENT ITEM NUMBER ')
     A            EDILOGKEY     14A         ALIAS(EDIDOCKEY_CS)
     A                                      TEXT('EDI DOCUMENT KEY         ')
     A            EDILOGPGMN     8A         ALIAS(EDIDOCPGMN_CS)
     A                                      TEXT('EDI DOCUMENT PROG NAME   ')
     A            EDILOGRECN     8A         ALIAS(EDIDOCRECN_CS)
     A                                      TEXT('EDI DOCUMENT RECORD NO.  ')
     A            EDILOGSEDA     8A         ALIAS(EDIDOCSEDA_CS)
     A                                      TEXT('EDI DOCUMENT SEND DATE   ')
     A            EDILOGSEQS     4A         ALIAS(EDIDOCSEQS_CS)
     A                                      TEXT('EDI DOCUMENT SEND SEQ    ')
     A            EDILOGSETI     6A         ALIAS(EDIDOCSETI_CS)
     A                                      TEXT('EDI DOCUMENT SEND TIME   ')
     A            EDILOGTRAK    10A         ALIAS(EDIDOCTRAK_CS)
     A                                      TEXT('EDI TRANSLATOR ACK       ')
     A            EDILOGTRIN     2A         ALIAS(EDIDOCTRIN_CS)
     A                                      TEXT('EDI TRANSLATOR INDICATOR ')
     A            EDILOGTYPE     2A         ALIAS(EDIDOCTYPE_CS)
     A                                      TEXT('EDI DOCUMENT TYPE        ')
     A            EDILOGVEND    10A         ALIAS(EDIDOCVEND_CS)
     A                                      TEXT('EDI VENDOR               ')
     A            EDILOGVEAK    10A         ALIAS(EDIDOCVEAK_CS)
     A                                      TEXT('EDI VENDOR ACK           ')
     A            EDITRANMOD     2A         ALIAS(EDITRANMOD_CS)
     A                                      TEXT('EDI TRANSPORTATION MODE  ')
     A            EDITRANCHG     2A         ALIAS(EDITRANCHG_CS)
     A                                      TEXT('EDI TRANSPORTATION CHARGE')
     A            EDITRANDEL     4A         ALIAS(EDITRANDEL_CS)
     A                                      TEXT('EDI TRANS. DELIVERY TERMS')
     A            EECCOMCODE    12A         ALIAS(EECCOMCODE_CS)
     A                                      TEXT('EEC COMMODITY CODE       ')
     A            EECCNTRYOR     4A         ALIAS(EECCNTRYOR_CS)
     A                                      TEXT('EEC COUNTRY OF ORIGIN    ')
     A            EECNETMASS     8S         ALIAS(EECNETMASS_CS)
     A                                      TEXT('EEC NET MASS             ')
     A            EECQUAL       12A         ALIAS(EECQUAL_CS)
     A                                      TEXT('EEC QUALIFIER DESCRIPTION')
     A            EECQUALCD      4A         ALIAS(EECQUALCD_CS)
     A                                      TEXT('EEC QUALIFIER CODE')
     A            EECSUPUNTS     8S         ALIAS(EECSUPUNTS_CS)
     A                                      TEXT('EEC SUPPLEMENTARY UNITS  ')
     A            EFFECTDATE     8A         ALIAS(EFFECTDATE_CS)
     A                                      TEXT('EFFECTIVE DATE           ')
     A            EMPFLG10       1A         ALIAS(EMPFLG10_CS)
     A                                      TEXT('                         ')
     A            EMPFLG11       1A         ALIAS(EMPFLG11_CS)
     A                                      TEXT('                         ')
     A            EMPFLG12       1A         ALIAS(EMPFLG12_CS)
     A                                      TEXT('                         ')
     A            EMPFLG13       1A         ALIAS(EMPFLG13_CS)
     A                                      TEXT('                         ')
     A            EMPFLG14       1A         ALIAS(EMPFLG14_CS)
     A                                      TEXT('                         ')
     A            EMPFLG15       1A         ALIAS(EMPFLG15_CS)
     A                                      TEXT('                         ')
     A            EMPFLG16       1A         ALIAS(EMPFLG16_CS)
     A                                      TEXT('                         ')
     A            EMPLORIGST     6A         ALIAS(EMPLORIGST_CS)
     A                                      TEXT('ORIGINATOR + REQ STATUS  ')
     A            EMPLOYID       4A         ALIAS(EMPLOYID_CS)
     A                                      TEXT('STORES WORKSHEET CREATOR ')
     A            EMPLOYORIG     4A         ALIAS(EMPLOYORIG_CS)
     A                                      TEXT('ORIGINATOR OF REQUISITION')
     A            EMPLQUEDST     6A         ALIAS(EMPLQUEDST_CS)
     A                                      TEXT('APPROVER + REQ STATUS    ')
     A            EXTCOST       16A         ALIAS(EXTENDCOST_CS)
     Q                                      TEXT('EXTENDED COST            ')
     A            EXTPRICE      15S         ALIAS(EXTPRICE_CS)
     A                                      TEXT('EXTENDED PRICE           ')
     A            EXPCLASS       6A         ALIAS(EXPCLASS_CS)
     A                                      TEXT('EXPENSE CLASS')
     A            EXPECTDTE      8A         ALIAS(EXPECTDTE_CS)
     A                                      TEXT('EXPECTED PO DELIVERY DATE')
DCR02A            FLAG1          1A         ALIAS(FLAG1_CS)
DCR02A                                      TEXT('FLAG1                    ')
     A            FAXIND         2A         ALIAS(FAXIND_CS)
     A                                      TEXT('FAX INDICATOR            ')
     A            FAXNO         26A         ALIAS(FAXNO_CS)
     A                                      TEXT('FAX NUMBER               ')
     A            FAXTIMSTMP    16A         ALIAS(FAXTIMSTMP_CS)
     A                                      TEXT('FAX TIME STAMP           ')
     A            FOB            2A         ALIAS(FOB_CS)
     A                                      TEXT('FREIGHT ON BOARD         ')
     A            FORDEPT        6A         ALIAS(FORDEPT_CS)
     A                                      TEXT('PURCHASING DEPARTMENT    ')
     A            FORWARDCAP     1A         ALIAS(FORWARDCAP_CS)
     A                                      TEXT('                         ')
     A            FRANID         1A         ALIAS(FRANID_CS)
     A                                      TEXT('FRANCHISE ID')
     A            FRTBILLDTE     8A         ALIAS(FRTBILLDTE_CS)
     A                                      TEXT('FREIGHT BILLING DATE     ')
     A            FRTBILLNO     16A         ALIAS(FRTBILLNO_CS)
     A                                      TEXT('FREIGHT PRO NUMBER       ')
     A            FRTCARRIER     4A         ALIAS(FRTCARRIER_CS)
     A                                      TEXT('FREIGHT CARRIER CODE     ')
     A            FRTCARRWT      9B         ALIAS(FRTCARRWT_CS)
     A                                      TEXT('CARRIER"S WEIGHT         ')
     A            FRTCHRGS      15P         ALIAS(FRTCHRGS_CS)
     A                                      TEXT('FREIGHT CHARGE           ')
     A            FRTDTEARR      6A         ALIAS(FRTDTEARR_CS)
     A                                      TEXT('FREIGHT ARRIVAL DATE     ')
     A            FRTLOT         8A         ALIAS(FRTLOT_CS)
     A                                      TEXT('FREIGHT LOT NUMBER       ')
     A            FRTOSD         4A         ALIAS(FRTOSD_CS)
     A                                      TEXT('OSD CLAIM NUMBER         ')
     A            FRTOSDCLM     68A         ALIAS(FRTOSDCLM_CS)
     A                                      TEXT('OSD CLAIM COMMENT        ')
     A            FRTOURWT       9B         ALIAS(FRTOURWT_CS)
     A                                      TEXT('GOODYEAR"S WEIGHT        ')
     A            FRTPACKSLP    12A         ALIAS(FRTPACKSLP_CS)
     A                                      TEXT('PACKING SLIP NUMBER      ')
     A            FRTRAILCAR    10A         ALIAS(FRTRAILCAR_CS)
     A                                      TEXT('RAIL CAR NUMBER          ')
     A            FRTREFERBK    14A         ALIAS(FRTREFERBK_CS)
     A                                      TEXT('1ST PO TO RECEIVE FREIGHT')
     A            FRTSEALS      68A         ALIAS(FRTSEALS_CS)
     A                                      TEXT('FREIGHT COMMENT FIELD    ')
     A            FRTSPLC       10A         ALIAS(FRTSPLC_CS)
     A                                      TEXT('SHIPPING POINT LOCATION  ')
     A            FRTTYP         1A         ALIAS(FRTTYP_CS)
     A                                      TEXT('FREIGHT TYPE-COLLECT,ETC ')
     A            FRTTYPE        2A         ALIAS(FRTTYPE_CS)
     A                                      TEXT('FREIGHT TYPE-COLLECT,ETC ')
     A            GRPNAME        8A         ALIAS(GRPNAME_CS)
     A                                      TEXT('GROUP NAME')
     A            HOLDSTATUS    10A         ALIAS(HOLDSTATUS_CS)
     A                                      TEXT('REQ HOLD STATUS DESCRIPTION')
     A            HOLDSTSCDE     2A         ALIAS(HOLDSTSCDE_CS)
     A                                      TEXT('REQ HOLD STATUS CODE     ')
     A            HOMEGRP        8A         ALIAS(HOMEGRP_CS)
     A                                      TEXT('HOME GROUP NAME')
     A            INVACCTDTA    16A         ALIAS(INVACCTDTA_CS)
     A                                      TEXT('INVOICE ACCOUNTING DATA  ')
     A            INVACCTPCT     6S         ALIAS(INVACCTPCT_CS)
     A                                      TEXT('INVOICE DISTRIBUTION %   ')
     A            INVADDCLRK     4A         ALIAS(INVADDCLRK_CS)
     A                                      TEXT('INVOICE ADD CLERK        ')
     A            INVADDCTNR    15P         ALIAS(INVADDCTNR_CS)
     A                                      TEXT('INVOICE ADD CONTAINER    ')
     A            INVADDINS     15P         ALIAS(INVADDINS_CS)
     A                                      TEXT('INVOICE ADD INSURANCE    ')
     A            INVADDOTHR    15P         ALIAS(INVADDOTHR_CS)
     A                                      TEXT('INVOICE ADD OTHER        ')
     A            INVADDTAX     15P         ALIAS(INVADDTAX_CS)
     A                                      TEXT('INVOICE ADD TAX          ')
     A            INVADDVFRT    15P         ALIAS(INVADDVFRT_CS)
     A                                      TEXT('INVOICE ADD FREIGHT      ')
     A            INVADJATX1    22A         ALIAS(INVADJATX1_CS)
     A                                      TEXT('INVOICE ACCRUED TAX      ')
     A            INVADJATX2    22A         ALIAS(INVADJATX2_CS)
     A                                      TEXT('INVOICE ACCRUED TAX      ')
     A            INVADJATX3    22A         ALIAS(INVADJATX3_CS)
     A                                      TEXT('INVOICE ACCRUED TAX      ')
     A            INVADJATX4    22A         ALIAS(INVADJATX4_CS)
     A                                      TEXT('INVOICE ACCRUED TAX      ')
     A            INVADJOTHR    15P         ALIAS(INVADJOTHR_CS)
     A                                      TEXT('INVOICE OTHER ADJUSTMENTS')
     A            INVCE01       22A         ALIAS(INVCE01_CS)
     A                                      TEXT('VENDOR"S INVOICE         ')
     A            INVCE03       22A         ALIAS(INVCE03_CS)
     A                                      TEXT('TRANSPORTATION DEDUCTION ')
     A            INVCE04       22A         ALIAS(INVCE04_CS)
     A                                      TEXT('INSURANCE DEDUCTION      ')
     A            INVCE05       22A         ALIAS(INVCE05_CS)
     A                                      TEXT('TRANSPORTATION DEDUCTION ')
     A            INVCE06       22A         ALIAS(INVCE06_CS)
     A                                      TEXT('EXTENSION ERROR          ')
     A            INVCE07       22A         ALIAS(INVCE07_CS)
     A                                      TEXT('PRICE ERROR              ')
     A            INVCE08       22A         ALIAS(INVCE08_CS)
     A                                      TEXT('CORRECTION NOTICE        ')
     A            INVCE09       22A         ALIAS(INVCE09_CS)
     A                                      TEXT('CASH DISCOUNT            ')
     A            INVCEX1       22A         ALIAS(INVCE1X_CS)
     A                                      TEXT('PREPAYMENT               ')
     A            INVCEX2       22A         ALIAS(INVCE2X_CS)
     A                                      TEXT('                         ')
     A            INVCHKDTE      8A         ALIAS(INVCHKDTE_CS)
     A                                      TEXT('INVOICE CHECK DATE       ')
     A            INVCHKNO       8A         ALIAS(INVCHKNO_CS)
     A                                      TEXT('INVOICE CHECK NUMBER     ')
     A            INVCPWCDE      4A         ALIAS(INVCPWCDE_CS)
     A                                      TEXT('INVOICE CPW CODE         ')
     A            INVDSTCOST    15P         ALIAS(INVDSTCOST_CS)
     A                                      TEXT('DISTRIBUTED COST         ')
     A            INVDTE         8A         ALIAS(INVDTE_CS)
     A                                      TEXT('INVOICE DATE             ')
     A            INVDUEDTE      8A         ALIAS(INVDUEDTE_CS)
     A                                      TEXT('INVOICE DUE DATE         ')
     A            INVFLG         1A         ALIAS(INVFLG_CS)
     A                                      TEXT('                         ')
     A            INVFREEVRB    20A         ALIAS(INVFREEVRB_CS)
     A                                      TEXT('INVOICE COMMENTS         ')
     A            INVIMATXT     15P         ALIAS(INVIMATXT_CS)
     A                                      TEXT('INVOICE MATERIAL EXTENSION')
     A            INVINDTE       8A         ALIAS(INVINDTE_CS)
     A                                      TEXT('INVOICE ENTRY DATE       ')
     A            INVIQTYPD     12S         ALIAS(INVIQTYPD_CS)
     A                                      TEXT('INVOICE QUANTITY PAID    ')
     A            INVITEMSTS     2A         ALIAS(INVITEMSTS_CS)
     A                                      TEXT('INVOICE ITEM STATUS      ')
     A            INVITINDIC     2A         ALIAS(INVITINDIC_CS)
     A                                      TEXT('INVOICE IT INDICATOR     ')
     A            INVIUPRICE    15P         ALIAS(INVIUPRICE_CS)
     A                                      TEXT('INVOICE UNIT PRICE       ')
     A            INVMODCLRK     4A         ALIAS(INVMODCLRK_CS)
     A                                      TEXT('INVOICE MODIFY CLERK     ')
     A            INVMODDTE      8A         ALIAS(INVMODDTE_CS)
     A                                      TEXT('INVOICE MODIFY DATE      ')
     A            INVNETVEND    15P         ALIAS(INVNETVEND_CS)
     A                                      TEXT('NET DUE VENDOR           ')
     A            INVOICENO     14A         ALIAS(INVOICENO_CS)
     A                                      TEXT('INVOICE NUMBER           ')
     A            INVOICESTS     2A         ALIAS(INVOICESTS_CS)
     A                                      TEXT('INVOICE STATUS           ')
     A            INVPAYIND      2A         ALIAS(INVPAYIND_CS)
     A                                      TEXT('INVOICE PAYMENT INDICATOR')
     A            INVPMATXT     15P         ALIAS(INVPMATXT_CS)
     A                                      TEXT('PO MATERIAL EXTENTION    ')
     A            INVPQTYPD     12S         ALIAS(INVPQTYPD_CS)
     A                                      TEXT('INVOICE PO QUANTITY PAID ')
     A            INVPUPRICE    15P         ALIAS(INVPUPRICE_CS)
     A                                      TEXT('INVOICE PO UNIT PRICE    ')
     A            INVTOTCFRT    15P         ALIAS(INVTOTCFRT_CS)
     A                                      TEXT('TOTAL COLLECT FREIGHT    ')
     A            INVTRNFLG      2A         ALIAS(INVTRNFLG_CS)
     A                                      TEXT('INV TURN RPT FLG FOR CLSS')
     A            ITEMNO         4A         ALIAS(ITEMNO_CS)
     A                                      TEXT('ITEM NUMBER ON DOCUMENTS ')
     A            ITEMSEQNO      6A         ALIAS(ITEMSEQNO_CS)
     A                                      TEXT('DESCRIPTION SEQUENCE NUMBER')
     A            ITMCOMP        1A         ALIAS(ITMCOMP_CS)
     A                                      TEXT('ITEM COMPLETION FLAG     ')
     A            ITMCONTQTY    12P         ALIAS(ITMCONTQTY_CS)
     A                                      TEXT('CONTAINER QUANTITY(PACKED)')
     A            ITMCONTUM      2A         ALIAS(ITMCONTUM_CS)
     A                                      TEXT('CONTAINER UM      (PACKED)')
     A            ITMDTEARR      6A         ALIAS(ITMDTEARR_CS)
     A                                      TEXT('ITEM ARRIVAL DATE        ')
     A            ITMDTESTOR     8A         ALIAS(ITMDTESTOR_CS)
     A                                      TEXT('DATE RECEIVED IN STOREROOM')
     A            ITMFLGS        4A         ALIAS(ITMFLGS_CS)
     A                                      TEXT('COMPLETE,CONTAINER,DESC  ')
     A            ITMKLYPOUM     2A         ALIAS(ITMKLYPOUM_CS)
     A                                      TEXT('KELLY PO UNIT OF MEASURE ')
     A            ITMKLYQTY     12S         ALIAS(ITMKLYQTY_CS)
     A                                      TEXT('KELLY PO ITEM QUANTITY   ')
     A            ITMMOLD        1A         ALIAS(ITMMOLD_CS)
     A                                      TEXT('TIRE MOLD FLAG            ')
     A            ITMQTYDLVR    12S         ALIAS(ITMQTYDLVR_CS)
     A                                      TEXT('QUANTITY DELIVERED TO DOCK')
     A            ITMQTYDLVP    12P         ALIAS(ITMQTYDLVP_CS)
     A                                      TEXT('QUANTITY DELIVERED(PACKED)')
     A            ITMQTYORD     12S         ALIAS(ITMQTYORD_CS)
     A                                      TEXT('QUANTITY ORDERED FROM PO ')
     A            ITMQTYPAID    12S         ALIAS(ITMQTYPAID_CS)
     A                                      TEXT('PO QUANTITY PAID         ')
     A            ITMQTYSTOR    12S         ALIAS(ITMQTYSTOR_CS)
     A                                      TEXT('QUANTITY RECEIVED IN STORES')
     A            ITMUPRICE     15P         ALIAS(ITMUPRICE_CS)
     A                                      TEXT('PO UNIT PRICE            ')
     A            ITMWT          9B         ALIAS(ITMWT_CS)
     A                                      TEXT('ITEM WEIGHT              ')
     A            ITMQTYC        8A         ALIAS(ITMQTYC_CS)
     A                                      TEXT('ITEM QTY IN CHARACTERS   ')
     A            ITMUPRIC      16A         ALIAS(ITMUPRIC_CS)
     A                                      TEXT('ITEM UPRICE IN CHARACTERS')
     A            ITMZBILVAL    11P         ALIAS(ITMZBILVAL_CS)
     A                                      TEXT('VALUE OF ITEMS FOR REPAIR')
     A            JOBNAME       10A         ALIAS(JOBNAME_CS)
     A                                      TEXT('JOB NAME')
     A            JOBDESC       10A         ALIAS(JOBDESC_CS)
     A                                      TEXT('JOB DESCRIPTION')
     A            JOBPROG       10A         ALIAS(JOBPROG_CS)
     A                                      TEXT('PROGRAM TO CALL')
     A            JOBCALLFL      1A         ALIAS(JOBCALLFL_CS)
     A                                      TEXT('CALL FLAG Y/N')
     A            KEYWORDADJ    50A         ALIAS(KEYWORDADJ_CS)
     A                                      TEXT('KEYWORD/ADJECTIVE        ')
     A            LATEDAYS       4S         ALIAS(LATEDAYS_CS)
     A                                      TEXT('LATE DAYS RANGE          ')
     A            LEADTIMES1     4B         ALIAS(LEADTIMES1_CS)
     A                                      TEXT('VENDOR LEAD TIME IN DAYS ')
     A            LEADTIMES2     4B         ALIAS(LEADTIMES2_CS)
     A                                      TEXT('VENDOR LEAD TIME IN DAYS ')
     A            LEADTIMES3     4B         ALIAS(LEADTIMES3_CS)
     A                                      TEXT('VENDOR LEAD TIME IN DAYS ')
     A            LEVELDESC     36A         ALIAS(LEVELDESC_CS)
     A                                      TEXT('APPROVAL LEVEL DESCRIPTION')
     A            LEVELFLG1      1A         ALIAS(LEVELFLG1_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELFLG2      1A         ALIAS(LEVELFLG2_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELFLG3      1A         ALIAS(LEVELFLG3_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELFLG4      1A         ALIAS(LEVELFLG4_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELFLG5      1A         ALIAS(LEVELFLG5_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELFLG6      1A         ALIAS(LEVELFLG6_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            LEVELNUM       2A         ALIAS(LEVELNUM_CS)
     A                                      TEXT('REQUISITION APPROVAL LEVEL')
     A            LNGUAGEIND     2A         ALIAS(LNGUAGEIND_CS)
     A                                      TEXT('1=PRIMARY LANGUAGE 2=SECOND')
     A            LOCATION      13A         ALIAS(LOCATION_CS)
     A                                      TEXT('BLDG, ROOM, LOC3, LOC4   ')
     A            LOTNUM         4A         ALIAS(LOTNUM_CS)
     A                                      TEXT('LOT NUMBER               ')
     A            LOWITMNUM      4A         ALIAS(LOWITMNUM_CS)
     A                                      TEXT('LOWEST COST ITEM NUMBER  ')
     A            LOWPONUM       8A         ALIAS(LOWPONUM_CS)
     A                                      TEXT('LOWEST COST PO NUMBER    ')
     A            LOWPRICE      15P         ALIAS(LOWPRICE_CS)
     A                                      TEXT('LOWEST COST PO PRICE     ')
     A            LOWUM          2A         ALIAS(LOWUM_CS)
     A                                      TEXT('LOWEST COST PO UM        ')
     A            LOWVENCDE     10A         ALIAS(LOWVENCDE_CS)
     A                                      TEXT('LOWEST COST VENDOR CODE  ')
     A            MANIFESTNO     8A         ALIAS(MANIFESTNO_CS)
     A                                      TEXT('MANIFEST NUMBER          ')
     A            MANPARTNO     20A         ALIAS(MANPARTNO_CS)
     A                                      TEXT('MANUFACTURER"S PART NUMBER')
     A            MANPARTYPE     2A         ALIAS(MANPARTYPE_CS)
     A                                      TEXT('PART NUMBER TYPE         ')
     A            MANUFACT      26A         ALIAS(MANUFACT_CS)
     A                                      TEXT('MANUFACTURER NAME        ')
DCR02A            MANUFACT50    50A         ALIAS(MANUFACT50_CS)
DCR02A                                      TEXT('MANUFACTURER NAME        ')
     A            MSTRSTOCK      8A         ALIAS(MSTRSTOCK_CS)
     A                                      TEXT('MASTER STOCK NUMBER      ')
     A            MCOMCOMMNT     4A         ALIAS(MCOMCOMMNT_CS)
     A                                      TEXT('TXXX=TAX MSG;CXXX=COMMENT')
     A            MCOMSUBCOD     4A         ALIAS(MCOMSUBCOD_CS)
     A                                      TEXT('FREE TEXT SUBJECT CODE   ')
     A            MCORPSTAT      2A         ALIAS(MCORPSTAT_CS)
     A                                      TEXT('CORPORATE REQ STATUS     ')
     A            MODIFYCAP      1A         ALIAS(MODIFYCAP_CS)
     A                                      TEXT('                         ')
     A            MTDUSAGE       9B         ALIAS(MTDUSAGE_CS)
     A                                      TEXT('MONTH TO DATE USAGE      ')
     A            MTREPRCST     15P         ALIAS(MTREPRCST_CS)
     A                                      TEXT('MAINTENANCE REPAIR COST  ')
     A            OITMQTYORD    12S         ALIAS(OITMQTYORD_CS)
     A                                      TEXT('OLD QTY ORDERED FROM PO')
     A            OITMUPRICE    15P         ALIAS(OITMUPRICE_CS)
     A                                      TEXT('OLD PO UNIT PRICE')
DCR01A            OLDPONO       14A         ALIAS(OLD_OLDPONO_CS)
DCR01A                                      TEXT('OLD PO NUMBER')
     A            ONDCKCARRY    14S         ALIAS(ONDCKCARRY_CA)
     A                                      TEXT('                    ')
     A            ONORDER        9A         ALIAS(ONORDER_CS)
     A                                      TEXT('NAPANEE ONORDER QTY      ')
DCR01A*--------------------------------------------------------------
DCR01A**** DATE AND TIME STAMP FIELD - CCYYMMDDHHMMSS
DCR01A            ORDERID       14A         ALIAS(ORDERID_CS)
DCR01A                                      TEXT('TIMESTAMP                ')
DCR01A*--------------------------------------------------------------
     A            ORIGIN         9A         ALIAS(ORIGIN_CS)
     A                                      TEXT('ORIGIN                   ')
     A            OSDNUMBER      3A         ALIAS(OSDNUMBER_CS)
     A                                      TEXT('OSD NUMBER               ')
     A            OUTREPRCST    15P         ALIAS(OUTREPRCST_CS)
     A                                      TEXT('OUTSIDE REPAIR COST      ')
     A            OVERCTR        2A         ALIAS(OVERCTR_CS)
     A                                      TEXT('OVERHEAD COUNTER')
     A            PAD01          1A         ALIAS(PAD01_CS)
     A                                      TEXT('                         ')
     A            PAD02          2A         ALIAS(PAD02_CS)
     A                                      TEXT('                         ')
     A            PAD03          3A         ALIAS(PAD03_CS)
     A                                      TEXT('                         ')
     A            PAD04          4A         ALIAS(PAD04_CS)
     A                                      TEXT('                         ')
     A            PAD05          5A         ALIAS(PAD05_CS)
     A                                      TEXT('                         ')
     A            PAD06          6A         ALIAS(PAD06_CS)
     A                                      TEXT('                         ')
     A            PAD08          8A         ALIAS(PAD08_CS)
     A                                      TEXT('                         ')
     A            PAD09          9A         ALIAS(PAD09_CS)
     A                                      TEXT('                         ')
     A            PAD10         10A         ALIAS(PAD10_CS)
     A                                      TEXT('                         ')
     A            PAD12         12A         ALIAS(PAD12_CS)
     A                                      TEXT('                         ')
     A            PAD18         18A         ALIAS(PAD18_CS)
     A                                      TEXT('                         ')
     A            PAD20         20A         ALIAS(PAD20_CS)
     A                                      TEXT('                         ')
     A            PAD24         24A         ALIAS(PAD24_CS)
     A                                      TEXT('                         ')
     A            PAD112       112A         ALIAS(PAD112_CS)
     A                                      TEXT('                         ')
DCR02A            PARTNO50      50A         ALIAS(PART_NUMBER_CS)
DCR02A                                      TEXT('PART NUMBER')
     A            PATHDESC      30A         ALIAS(PATHDESC_CS)
     A                                      TEXT('DESCRIPTION REQ PATH     ')
     A            PATHLEVELS   120A         ALIAS(PATHLEVELS_CS)
     A                                      TEXT('HOLDS 20 LEVELS PER PATH ')
     A            PATHMAXVAL    14A         ALIAS(PATHMAXVAL_CS)
     A                                      TEXT('MAX VALUE FOR REQ PATH   ')
     A            PATHMINVAL    14A         ALIAS(PATHMINVAL_CS)
     A                                      TEXT('MIN VALUE FOR REQ PATH   ')
     A            PATHNUM        4A         ALIAS(PATHNUM_CS)
     A                                      TEXT('PATH NUMBER OF REQ APPROVAL')
     A            PATHWOAPPV     2A         ALIAS(PATHWOAPPV_CS)
     A                                      TEXT('WORKORDER APPROVAL REQUIRED')
     A            PAYTERMS       2A         ALIAS(PAYTERMS_CS)
     A                                      TEXT('PAYMENT TERMS            ')
     A            PDHIGH        14A         ALIAS(PDHIGH_CS)
     A                                      TEXT('HIGH VALUE FOR PATH      ')
     A            PDINCEX        2A         ALIAS(PDINCEX_CS)
     A                                      TEXT('PATH DEF INCLUDE/EXCLUDE FLG')
     A            PDKEY         18A         ALIAS(PDKEY_CS)
     A                                      TEXT('DEPT KEY FOR PATH DEF    ')
     A            PDLOW         14A         ALIAS(PDLOW_CS)
     A                                      TEXT('LOW VALUE FOR PATH       ')
     A            PDTYPE         2A         ALIAS(PDTYPE_CS)
     A                                      TEXT('PATH DEF TYPE;DEPT CLASS ETC')
     A            PLTINFODTA    60A         ALIAS(PLTINFODTA_CS)
     A                                      TEXT('PLANT NAME/ADDRESS DATA  ')
     A            PLTINFOKEY     4A         ALIAS(PLTINFOKEY_CS)
     A                                      TEXT('KEY FOR NAME, ADDRESS,ETC')
     A            POAKBUF      133A         ALIAS(POAKBUF_CS)
     A                                      TEXT('PO FILE AKPOFILE BUFFER')
     A            POBLDG         4A         ALIAS(POBLDG_CS)
     A                                      TEXT('PO BUILDING NUMBER       ')
     A            POBUYER       18A         ALIAS(POBUYER_CS)
     A                                      TEXT('BUYERS NAME=15 TYPIST=3  ')
     A            POCRTTYP       1A         ALIAS(POCRTTYP_CS)
     A                                      TEXT('PO CREATE TYPE           ')
     A            PODTE          8A         ALIAS(PODTE_CS)
     A                                      TEXT('PO CREATE DATE           ')
     A            POERRBUF      60A         ALIAS(POERRBUF_CS)
     A                                      TEXT('PO FILE ERROR BUFFER')
     A            POFLGS         6A         ALIAS(POFLGS_CS)
     A                                      TEXT('TYP,BLNKT,REMIT,ZBILL,NONRCV')
     A            POFLRETRN      1A         ALIAS(POFLRETRN_CS)
     A                                      TEXT('PO RETRANS FLAG')
     A            POFLUPCO       2A         ALIAS(POFLUPCO_CS)
     A                                      TEXT('PO FOLLOUP COUNT            ')
     A            POFLUPDA       8A         ALIAS(POFLUPDA_CS)
     A                                      TEXT('PO FOLLOWUP DATE            ')
     A            POFOB         20A         ALIAS(POFOB_CS)
     A                                      TEXT('PO FOB TERMS             ')
     A            POINVIND       1A         ALIAS(POINVIND_CS)
     A                                      TEXT('PO INVOICELESS INDICATOR ')
     A            POLASTPAY      6A         ALIAS(POLASTPAY_CS)
     A                                      TEXT('LAST PAYMENT DATE YYMM   ')
     A            POPLT          4A         ALIAS(POPLT_CS)
     A                                      TEXT('PO PLANT CODE            ')
     A            PORCVNO       14A         ALIAS(PORCVNO_CS)
     A                                      TEXT('PO/RECEIVING SLIP NUMBER ')
DCR01A*--------------------------------------------------------------
DCR01A**** DATE AND TIME STAMP FIELD - CCYYMMDDHHMMSS
DCR01A            POORDID       14A         ALIAS(POORDID_CS)
DCR01A                                      TEXT('PO/ORDER ID              ')
DCR01A*--------------------------------------------------------------
     A            PORCVSEQ       6A         ALIAS(PORCVSEQ_CS)
     A                                      TEXT('RECEIVING SEQUENCE NUMBER')
     A            PORCVSTAT      4A         ALIAS(PORCVSTAT_CS)
     A                                      TEXT('RECEIPT STATUS           ')
     A            PORLSE        10A         ALIAS(PORLSE_CS)
     A                                      TEXT('PO AND RELEASE NUMBER    ')
     A            PORCVQTY      12S 4       ALIAS(PORCVQTY_CS)
     A                                      TEXT('PO RCV QTY - IN PO UM    ')
     A            POSTS          2A         ALIAS(POSTS_CS)
     A                                      TEXT('STATUS S=CODED N=NONCODED')
     A            POTRLCOML      4A         ALIAS(POTRLCOML_CS)
     A                                      TEXT('PO TRAILER COMMENTS LINE#')
     A            POTRLCOMS     70A         ALIAS(POTRLCOMS_CS)
     A                                      TEXT('PO TRAILER COMMENTS      ')
     A            PRICEUM        2A         ALIAS(PRICEUM_CS)
     A                                      TEXT('PRICE UNIT OF MEASURE    ')
DCR02A            PRICE15C3     15P         ALIAS(PRICE_CS)
     A                                      TEXT('PRICE')
     A            PROGNAME      10A         ALIAS(PROGRAM_NAME)
     A                                      TEXT('PROGRAM NAME')
     A            QTETXTDTA     80A         ALIAS(QTETXTDTA_CS)
     A                                      TEXT('QUOTE TEXT DATA          ')
     A            QTYUM          2A         ALIAS(QTYUM_CS)
     A                                      TEXT('QUANTITY UNIT OF MEASURE ')
     A            QUEAPPDTE      8A         ALIAS(QUEAPPDTE_CS)
     A                                      TEXT('REQ APPROVAL DATE        ')
     A            QUECOMMNT1    36A         ALIAS(QUECOMMNT1_CS)
     A                                      TEXT('REQ QUEUE COMMENT        ')
     A            QUECOMMNT2    36A         ALIAS(QUECOMMNT2_CS)
     A                                      TEXT('2ND QUEUE COMMMENT       ')
     A            QUEDTE         8A         ALIAS(QUEDTE_CS)
     A                                      TEXT('DATE REQ QUEUED FOR APPROVAL')
     A            QUEFLGS1       1A         ALIAS(QUEFLGS1_CS)
     A                                      TEXT('BYPASS FLAG              ')
     A            QUEFLGS2       1A         ALIAS(QUEFLGS2_CS)
     A                                      TEXT('ORIGINATOR FLAG          ')
     A            QUEFLGS3       1A         ALIAS(QUEFLGS3_CS)
     A                                      TEXT('IN ORDER-SIMULTANEOUS    ')
     A            QUEFLGS4       1A         ALIAS(QUEFLGS4_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            QUEFLGS5       1A         ALIAS(QUEFLGS5_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            QUEFLGS6       1A         ALIAS(QUEFLGS6_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            QUEORDER       4A         ALIAS(QUEORDER_CS)
     A                                      TEXT('KEEPS DREQQUE IN ORDER   ')
     A            QUETYPE        2A         ALIAS(QUETYPE_CS)
     A                                      TEXT('QUEUED TYPE R=REQ Q=DOCK ')
     A            QUOTENUM      10A         ALIAS(QUOTENUM_CS)
     A                                      TEXT('VENDOR QUOTE NUMBER      ')
     A            RCVDEPT        6A         ALIAS(RCVDEPT_CS)
     A                                      TEXT('PO RECEIVING DEPARTMENT  ')
     A            RCVCORRECT   142A         ALIAS(RCVCORRECT_CS)
     A                                      TEXT('RCVG CORRECTION REASON   ')
     A            RCVSLIP       14A         ALIAS(RCVSLIP_CS)
     A                                      TEXT('RECEIVING SLIP NUMBER    ')
     A            RCVSTDINS     12A         ALIAS(RCVSTDINS_CS)
     A                                      TEXT('RECEIVING INSTRUCTIONS   ')
     A            RECORDTYPE     4A         ALIAS(RECORDTYPE_CS)
     A                                      TEXT('RECORD TYPE INDICATOR    ')
     A            REGISTERNO     6A         ALIAS(REGISTERNO_CS)
     A                                      TEXT('REGISTER NUMBER          ')
     A            RELITEMNO      6A         ALIAS(RELITEMNO_CS)
     A                                      TEXT('RELEASE ITEM NUMBER      ')
     A            RELLINEDTA    70A         ALIAS(RELLINEDTA_CS)
     A                                      TEXT('SHIPPING RELEASE BATCH DATA')
     A            RELNUM         8A         ALIAS(RELNUM_CS)
     A                                      TEXT('BATCH FILE REQUIREMENT # ')
     A            REQAPPLEFT     2A         ALIAS(REQAPPLEFT_CS)
     A                                      TEXT('REQ APPROVALS LEFT       ')
     A            REQAUTHFLG     1A         ALIAS(REQAUTHFLG_CS)
     A                                      TEXT('REQ AUTHORITY CODE FLAG  ')
     A            REQDEPT        4A         ALIAS(REQDEPT_CS)
     A                                      TEXT('REQ DEPARTMENT           ')
     A            REQDESC       80A         ALIAS(REQDESC_CS)
     A                                      TEXT('DESCRIPTIONS FOR REQS    ')
     A            REQDTE         8A         ALIAS(REQDTE_CS)
     A                                      TEXT('REQ CREATED DATE         ')
     A            REQDTERET      8A         ALIAS(REQDTERET_CS)
     A                                      TEXT('REQ DATE RETURNED        ')
     A            REQDTEWTD      8A         ALIAS(REQDTEWTD_CS)
     A                                      TEXT('REQ DATE WANTED          ')
     A            REQDTWTFLG     1A         ALIAS(REQDTWTFLG_CS)
     A                                      TEXT('REQ DATE WANTED FLAG     ')
     A            REQEMPL        4A         ALIAS(REQEMPL_CS)
     A                                      TEXT('REQ EMPLOYEE             ')
     A            REQFROMSYS     1A         ALIAS(REQFROMSYS_CS)
     A                                      TEXT('REQ FROM SYSTEM          ')
     A            REQINDXSTS     2A         ALIAS(REQINDXSTS_CS)
     A                                      TEXT('STATUS:MMIS,BELOW REORD/EXP')
     A            REQMMISNO     12A         ALIAS(REQMMISNO_CS)
     A                                      TEXT('MMIS REQ NUMBER          ')
     A            REQNO         12A         ALIAS(REQNO_CS)
     A                                      TEXT('REQUISITION NUMBER       ')
     A            REQNOTE       30A         ALIAS(REQNOTE_CS)
     A                                      TEXT('REQUISITION NOTE         ')
     A            REQNUMMMIS    12A         ALIAS(REQNUMMMIS_CS)
     A                                      TEXT('MMIS REQUISITION NUMBER  ')
     A            REQORIG       20A         ALIAS(REQORIG_CS)
     A                                      TEXT('REQ ORIGINATOR           ')
     A            REQPATH        3A         ALIAS(REQPATH_CS)
     A                                      TEXT('REQ PATH                 ')
     A            REQQTYTOOR    12S         ALIAS(REQQTYTOOR_CS)
     A                                      TEXT('REQ QUANTITY TO ORDER    ')
     A            REQRELSTAT     2A         ALIAS(REQRELSTAT_CS)
     A                                      TEXT('REQ RELEASE STATUS       ')
     A            REQRLMCDTE     8A         ALIAS(REQRLMCDTE_CS)
     A                                      TEXT('DATE REQ RELEASED TO MC  ')
     A            REQSTPFLG      1A         ALIAS(REQSTPFLG_CS)
     A                                      TEXT('                         ')
     A            REQSTS         2A         ALIAS(REQSTS_CS)
     A                                      TEXT('REQUISITION STATUS       ')
     A            REQUPRICE     15P         ALIAS(REQUPRICE_CS)
     A                                      TEXT('REQ UNIT PRICE           ')
     A            REQUPRICE2    15P         ALIAS(REQUPRICE2_CS)
     A                                      TEXT('FORGN CURR REQ UNIT PRICE')
DCR02A            RSNCDE         4A         ALIAS(RSNCDE_CS)
DCR02A                                      TEXT('REASON CODE              ')
DCR02A            RSNTXT        80A         ALIAS(RSNTXT_CS)
DCR02A                                      TEXT('REASON TEXT              ')
     A            RESTRICT    1845A         ALIAS(RESTRICT_CS)
     A                                      TEXT('CODE WITHDRAWAL RESTRICT ')
     A            RETURNCAP      1A         ALIAS(RETURNCAP_CS)
     A                                      TEXT('REQ RETURN CAPABILITY    ')
     A            RPTIDENT       4A         ALIAS(RPTIDENT_CS)
     A                                      TEXT('RPT DISTRIBUTION IDENTIF ')
     A            RPTDESC       40A         ALIAS(RPTDESC_CS)
     A                                      TEXT('RPT DISTRIBUTION DESCRIP ')
     A            RPTKEY        10A         ALIAS(RPTKEY_CS)
     A                                      TEXT('RPT DISTRIBUTION KEY  ')
     A            RPTKEYDESC    10A         ALIAS(RPTKEYDESC_CS)
     A                                      TEXT('RPT DISTRIBUTION KEY DESC')
     A            RPTPRINT       2A         ALIAS(RPTPRINT_CS)
     A                                      TEXT('RPT DISTRIBUTION PRINTER ')
     A            RPTPROG        8A         ALIAS(RPTPROG_CS)
     A                                      TEXT('RPT DISTRIBUTION PROGRAM ')
     A            RPTSWITCH      1A         ALIAS(RPTSWITCH_CS)
     A                                      TEXT('RPT DISTRIBUTION SWITCH  ')
     A            RSVDTE         8A         ALIAS(RSVDTE_CS)
     A                                      TEXT('DATE RESERVED            ')
     A            RSVMACH        8A         ALIAS(RSVMACH_CS)
     A                                      TEXT('RESERVED FOR MACHINE     ')
     A            RSVMACHSUB     4A         ALIAS(RSVMACHSUB_CS)
     A                                      TEXT('RESERVED FOR MACHINE     ')
     A            RSVQTY         8S         ALIAS(RSVQTY_CS)
     A                                      TEXT('RESERVED QUANTITY        ')
     A            RSVUSEDEPT     6A         ALIAS(RSVUSEDEPT_CS)
     A                                      TEXT('RESERVE USING DEPARTMENT ')
     A            RSVWONO       12A         ALIAS(RSVWONO_CS)
     A                                      TEXT('RESERVED WORKORDER NUMBER')
     A            SEALS         63A         ALIAS(SEALS_CS)
     A                                      TEXT('SEALS                    ')
     A            SEQNO          4S         ALIAS(SEQNO_CS)
     A                                      TEXT('SEQUENCE NUMBER          ')
     A            SFFLAG         1A         ALIAS(SFFLAG_CS)
     A                                      TEXT('SUCCESS/FAILURE FLAG     ')
     A            SHIPDTE        8A         ALIAS(SHIPDTE_CS)
     A                                      TEXT('SHIPPING DATE OF ORDER   ')
     A            STAGELOC       4A         ALIAS(STAGELOC_CS)
     A                                      TEXT('STAGING LOCATION FOR REQS')
     A            STDINSTRS     12A         ALIAS(STDINSTRS_CS)
     A                                      TEXT('STANDARD INSTRUCTIONS    ')
     A            STRACTDTE      8A         ALIAS(STRACTDTE_CS)
     A                                      TEXT('LAST ACTIVITY DATE OF CODE')
     A            STRAUTHOR     10A         ALIAS(STRAUTHOR_CS)
     A                                      TEXT('CREATOR OF CORPORATE CODE')
     A            STRAVGCOST    15P         ALIAS(STRAVGCOST_CS)
     A                                      TEXT('AVERAGE COST OF CODE     ')
     A            STRDFLTDPT     6A         ALIAS(STRDFLTDPT_CS)
     A                                      TEXT('DEFAULT DEPARTMENT       ')
     A            STRDIRCHRG     4A         ALIAS(STRDIRCHRG_CS)
     A                                      TEXT('STOREROOM DIRECT CHARGE DPT')
     A            STRDSBINST    30A         ALIAS(STRDSBINST_CS)
     A                                      TEXT('DISBURSEMENT INSTRUCTIONS')
     A            STREOQ         9B         ALIAS(STREOQ_CS)
     A                                      TEXT('ECONOMIC ORDER QUANTITY  ')
     A            STRESTLT       4B         ALIAS(STRESTLT_CS)
     A                                      TEXT('ESTIMATED LEAD TIME      ')
     A            STREXPCLSS     8A         ALIAS(STREXPCLSS_CS)
     A                                      TEXT('DEFAULT EXPENSE CLASS    ')
     A            STREXPED       9B         ALIAS(STREXPED_CS)
     A                                      TEXT('EXPEDITE ORDER POINT     ')
     A            STRHIGHUSE    12A         ALIAS(STRHIGHUSE_CS)
     A                                      TEXT('HIGH USAGE AREA          ')
     A            STRINITDTE     8A         ALIAS(STRINITDTE_CS)
     A                                      TEXT('DATE ITEM IS INITIALIZED ')
     A            STRINVCYL      4A         ALIAS(STRINVCYL_CS)
     A                                      TEXT('INVENTORY CYCLE IN DAYS  ')
     A            STRINVDTE      8A         ALIAS(STRINVDTE_CS)
     A                                      TEXT('LAST INVENTORY DATE      ')
     A            STRLOC1       12A         ALIAS(STRLOC1_CS)
     A                                      TEXT('STOREROOM LOCATION 1     ')
     A            STRLOC1ONH     9B         ALIAS(STRLOC1ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 1    ')
     A            STRLOC2       12A         ALIAS(STRLOC2_CS)
     A                                      TEXT('STOREROOM LOCATION 2     ')
     A            STRLOC2ONH     9B         ALIAS(STRLOC2ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 2    ')
     A            STRLOC3       12A         ALIAS(STRLOC3_CS)
     A                                      TEXT('STOREROOM LOCATION 3     ')
     A            STRLOC3ONH     9B         ALIAS(STRLOC3ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 3    ')
     A            STRLOC4       12A         ALIAS(STRLOC4_CS)
     A                                      TEXT('STOREROOM LOCATION 4     ')
     A            STRLOC4ONH     9B         ALIAS(STRLOC4ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 4    ')
     A            STRLOC5       12A         ALIAS(STRLOC5_CS)
     A                                      TEXT('STOREROOM LOCATION 5     ')
     A            STRLOC5ONH     9B         ALIAS(STRLOC5ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 5    ')
     A            STRLOC6       12A         ALIAS(STRLOC6_CS)
     A                                      TEXT('STOREROOM LOCATION 6     ')
     A            STRLOC6ONH     9B         ALIAS(STRLOC6ONH_CS)
     A                                      TEXT('ONHAND FOR LOCATION 6    ')
     A            STRLSTCHRG    10A         ALIAS(STRLSTCHRG_CS)
     A                                      TEXT('LAST CHARGE DEPARTMENT   ')
     A            STRLSTIDTE     8A         ALIAS(STRLSTIDTE_CS)
     A                                      TEXT('LAST ISSUE DATE          ')
     A            STRLSTPO      10A         ALIAS(STRLSTPO_CS)
     A                                      TEXT('LAST PO FOR CODE         ')
     A            STRLSTVEND    10A         ALIAS(STRLSTVEND_CS)
     A                                      TEXT('VENDOR LAST ORDERED FROM ')
     A            STRMAX         9B         ALIAS(STRMAX_CS)
     A                                      TEXT('MAX QUANTITY FOR CODE    ')
     A            STRMKTCOST    15P         ALIAS(STRMKTCOST_CS)
     A                                      TEXT('MARKET COST FOR CODE     ')
     A            STRMTHFCST     9B         ALIAS(STRMTHFCST_CS)
     A                                      TEXT('AVERAGE MONTHLY USAGE    ')
     A            STRONH         9B         ALIAS(STRONH_CS)
     A                                      TEXT('STOREROOM ONHAND         ')
     A            STRONORER      9B         ALIAS(STRONORER_CS)
     A                                      TEXT('TOTAL ONORDER QUANTITY   ')
     A            STRPREVAVG    15P         ALIAS(STRPREVAVG_CS)
     A                                      TEXT('                         ')
     A            STRPREVCDE    12A         ALIAS(STRPREVCDE_CS)
     A                                      TEXT('PREVIOUS CODE BEFORE CORP')
     A            STRREORDER     9B         ALIAS(STRREORDER_CS)
     A                                      TEXT('REORDER POINT            ')
     A            STRRESERVD     9B         ALIAS(STRRESERVD_CS)
     A                                      TEXT('QTY RESERVED BY WORKORDER')
     A            STRRSVONOR     9B         ALIAS(STRRSVONOR_CS)
     A                                      TEXT('ONORDER RESERVED QUANTITY')
     A            STRSOQ         9B         ALIAS(STRSOQ_CS)
     A                                      TEXT('STANDARD ORDER QUANTITY  ')
     A            STRSTDCOST    15P         ALIAS(STRSTDCOST_CS)
     A                                      TEXT('STANDARD COST            ')
     A            STRSTSAR01     1A         ALIAS(STRSTSAR01_CS)
     A                                      TEXT('X=WRITEDOWN ITEM         ')
     A            STRSTSAR02     1A         ALIAS(STRSTSAR02_CS)
     A                                      TEXT('X=INSRNCE C=CRITICAL B=BOTH')
     A            STRSTSAR03     1A         ALIAS(STRSTSAR03_CS)
     A                                      TEXT('ORDER-ENGINEER           ')
     A            STRSTSAR04     1A         ALIAS(STRSTSAR04_CS)
     A                                      TEXT('OUTSIDE REPAIR           ')
     A            STRSTSAR05     1A         ALIAS(STRSTSAR05_CS)
     A                                      TEXT('MAINTENANCE              ')
     A            STRSTSAR06     1A         ALIAS(STRSTSAR06_CS)
     A                                      TEXT('RELEASE                  ')
     A            STRSTSAR07     1A         ALIAS(STRSTSAR07_CS)
     A                                      TEXT('STOCK OUT                ')
     A            STRSTSAR08     1A         ALIAS(STRSTSAR08_CS)
     A                                      TEXT('F=FROZEN FOR INVENTORY   ')
     A            STRSTSAR09     1A         ALIAS(STRSTSAR09_CS)
     A                                      TEXT('CONSIGNMENT INDICATOR    ')
     A            STRSTSAR10     1A         ALIAS(STRSTSAR10_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            STRSTSAR11     1A         ALIAS(STRSTSAR11_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            STRSTSAR12     1A         ALIAS(STRSTSAR12_CS)
     A                                      TEXT('RESERVED FOR FUTURE USE  ')
     A            STRTAXPCT      4B         ALIAS(STRTAXPCT_CS)
     A                                      TEXT('TAX PERCENTAGE-KELLY ONLY')
     A            STRUM          2A         ALIAS(STRUM_CS)
     A                                      TEXT('UNIT OF MEASURE          ')
     A            STRUM1         2A         ALIAS(STRUM1_CS)
     A                                      TEXT('FIRST ALTERNATE UM       ')
     A            STRUM1CF      10S         ALIAS(STRUM1CF_CS)
     A                                      TEXT('FIRST CONVERSTION FACTOR ')
     A            STRUM2         2A         ALIAS(STRUM2_CS)
     A                                      TEXT('SECOND ALTERNATE UM      ')
     A            STRUM2CF      10S         ALIAS(STRUM2CF_CS)
     A                                      TEXT('SECOND CONVERSION FACTOR ')
     A            STRWITHQTY     9B         ALIAS(STRWITHQTY_CS)
     A                                      TEXT('STORE WITHDRAWAL QUANTITY')
     A            SUBDETAIL      4A         ALIAS(SUBDETAIL_CS)
     A                                      TEXT('SUB DETAIL               ')
     A            TALLY          4A         ALIAS(TALLY_CS)
     A                                      TEXT('TALLY NUMBER             ')
     A            TAXCDE         2A         ALIAS(TAXCDE_CS)
     A                                      TEXT('TAX CODE                 ')
     A            TAXPCT1        6S         ALIAS(TAXPCT1_CS)
     A                                      TEXT('TAX PERCENT 1            ')
     A            TAXPCT2        6S         ALIAS(TAXPCT2_CS)
     A                                      TEXT('TAX PERCENT 2            ')
     A            TAXPCT3        6S         ALIAS(TAXPCT3_CS)
     A                                      TEXT('TAX PERCENT 3            ')
     A            TAXPCT4        6S         ALIAS(TAXPCT4_CS)
     A                                      TEXT('TAX PERCENT 4            ')
     A            TAXTYPE1       2A         ALIAS(TAXTYPE1_CS)
     A                                      TEXT('TAX TYPE INDICATOR 1     ')
     A            TAXTYPE2       2A         ALIAS(TAXTYPE2_CS)
     A                                      TEXT('TAX TYPE INDICATOR 2     ')
     A            TAXTYPE3       2A         ALIAS(TAXTYPE3_CS)
     A                                      TEXT('TAX TYPE INDICATOR 3     ')
     A            TAXTYPE4       2A         ALIAS(TAXTYPE4_CS)
     A                                      TEXT('TAX TYPE INDICATOR 4     ')
     A            TRADENM       80A         ALIAS(TRADENM_CS)
     A                                      TEXT('MANUFACTURER"S TRADE NAME')
     A            TC             3A         ALIAS(TC_CS)
     A                                      TEXT('TRANSACTION CODE')
DCR02A            UOM            2A         ALIAS(UOM_CS)
     A                                      TEXT('UNIT OF MEASURE')
     A            UNITPRICE     15S         ALIAS(UNITPRICE_CS)
     A                                      TEXT('UNIT PRICE               ')
     A            UNITQTY       15S         ALIAS(UNITQTY_CS)
     A                                      TEXT('UNIT QUANTITY            ')
DCR03A            USERID10      10A         ALIAS(USERID10_CS)
     A                                      TEXT('USER SIGNON ID')
     A            USERID         8A         ALIAS(USERID_CS)
     A                                      TEXT('USER SIGNON ID')
     A            USERNAME       8A         ALIAS(USERNAME_CS)
     A                                      TEXT('USER NAME')
     A            USERNOTIFY    10A         ALIAS(USERNOTIFY_CS)
     A                                      TEXT('USER NOTIFY ID')
     A            USERPRISW      1A         ALIAS(USERPRISW_CS)
     A                                      TEXT('USER PRICE SWITCH')
     A            USERTERM       4A         ALIAS(USERTERM_CS)
     A                                      TEXT('USER TERMINAL NUMBER')
     A            VALDTADESC    10A         ALIAS(VALDTADESC_CS)
     A                                      TEXT('VALID DATA DESCRIPTION   ')
     A            VALDTAKEY     10A         ALIAS(VALDTAKEY_CS)
     A                                      TEXT('VALID DPT,EXP CLSS,NEW WORK')
     A            VALDTACOPR     6A         ALIAS(VALDTACOPR_CS)
     A                                      TEXT('VALID DPT,COMPANY,PRIME  ')
     A            VALDTADEPS    40A         ALIAS(VALDTADEPS_CS)
     A                                      TEXT('VALID EXPLODE DEPARTMENTS')
     A            VALIDUM        2A         ALIAS(VALIDUM_CS)
     A                                      TEXT('VALID UNIT OF MEASURE    ')
     A            VALIDUMEDI     4A         ALIAS(VALIDUMEDI_CS)
     A                                      TEXT('VALID EDI UNIT OF MEASURE')
     A            VALIDUMDSC    12A         ALIAS(VALIDUMDSC_CS)
     A                                      TEXT('UNIT OF MEASURE DESCRIPTION')
     A            VENBIDQTY     11P         ALIAS(VENBIDQTY_CS)
     A                                      TEXT('QUOTE BID QTY PER ITEM   ')
     A            VENCALTKEY    10A         ALIAS(VENCALTKEY_CS)
     A                                      TEXT('VENDOR CODE ALTERNATE KEY')
     A            VENCDE        10A         ALIAS(VENCDE_CS)
     A                                      TEXT('VENDOR QUOTE             ')
DCR02A            VENPARTNO     50A         ALIAS(VENPARTNO_CS)
     A                                      TEXT('VENDOR"S PART NUMBER')
     A            VENDSCT       50A         ALIAS(VENDSCT_CS)
     A                                      TEXT('DISCOUNT FREE VERBAGE    ')
     A            VENDSCTPCT     6A         ALIAS(VENDSCTPCT_CS)
     A                                      TEXT('DISCOUNT PERCENT 99.9999 ')
     A            VENDTERCVD     8A         ALIAS(VENDTERCVD_CS)
     A                                      TEXT('DATE VENDOR RETURNED QUOTE')
     A            VENESTLT       4B         ALIAS(VENESTLT_CS)
     A                                      TEXT('ESTIMATED LEAD TIME      ')
     A            VENHGHQTY1    11P         ALIAS(VENHGHQTY1_CS)
     A                                      TEXT('DISCOUNT HIGH QTY RANGE 1')
     A            VENHGHQTY2    11P         ALIAS(VENHGHQTY2_CS)
     A                                      TEXT('DISCOUNT HIGH QTY RANGE 2')
     A            VENHGHQTY3    11P         ALIAS(VENHGHQTY3_CS)
     A                                      TEXT('DISCOUNT HIGH QTY RANGE 3')
     A            VENITMDTA     44A         ALIAS(VENITMDTA_CS)
     A                                      TEXT('VENDOR ITEM COMMENT      ')
     A            VENITMNO       2A         ALIAS(VENITMNO_CS)
     A                                      TEXT('ITEM NUMBER              ')
     A            VENITMCHAT     6A         ALIAS(VENITMCHAT_CS)
     A                                      TEXT('ITEM CHAT NUMBER         ')
     A            VENLOWQTY1    11P         ALIAS(VENLOWQTY1_CS)
     A                                      TEXT('DISCOUNT LOW QTY RANGE 1 ')
     A            VENLOWQTY2    11P         ALIAS(VENLOWQTY2_CS)
     A                                      TEXT('DISCOUNT LOW QTY RANGE 2 ')
     A            VENLOWQTY3    11P         ALIAS(VENLOWQTY3_CS)
     A                                      TEXT('DISCOUNT LOW QTY RANGE 3 ')
     A            VENOFRCD       2A         ALIAS(VENOFRCD_CS)
     A                                      TEXT('" Q" IF A QUOTE          ')
     A            VENPRICE      15P         ALIAS(VENPRICE_CS)
     A                                      TEXT('PRICE OF ITEM ON QUOTE   ')
     A            VENPRICEDT     8A         ALIAS(VENPRICEDTE_CS)
     A                                      TEXT('QUOTE EXPIRATION DATE    ')
     A            VENQTYUM1      2A         ALIAS(VENQTYUM1_CS)
     A                                      TEXT('UM IN DISCOUNT RANGE 1   ')
     A            VENQTYUM2      2A         ALIAS(VENQTYUM2_CS)
     A                                      TEXT('UM IN DISCOUNT RANGE 2   ')
     A            VENQTYUM3      2A         ALIAS(VENQTYUM3_CS)
     A                                      TEXT('UM IN DISCOUNT RANGE 3   ')
     A            VENREFER       4A         ALIAS(VENREFER_CS)
     A                                      TEXT('# FOR SAME QUOTE/MANY VENDRS')
     A            VENRTNDTE      8A         ALIAS(VENRTNDTE_CS)
     A                                      TEXT('DATE VENDOR TO RETURN QUOTE')
     A            VENSPLC       10A         ALIAS(VENSPLC_CS)
     A                                      TEXT('SHIPPING LOCATION FOR QUOTE')
     A            VENSURCHRG    15P         ALIAS(VENSURCHRG_CS)
     A                                      TEXT('SURCHARGE PER ITEM       ')
     A            VENTXTFLG      2A         ALIAS(VENTXTFLG_CS)
     A                                      TEXT('STANDARD/UNIQUE QUOTE TEXT')
     A            VENWRKPRC1    15P         ALIAS(VENWRKPRC1_CS)
     A                                      TEXT('PRICE FOR DISCOUNT RANGE 1')
     A            VENWRKPRC2    15P         ALIAS(VENWRKPRC2_CS)
     A                                      TEXT('PRICE FOR DISCOUNT RANGE 2')
     A            VENWRKPRC3    15P         ALIAS(VENWRKPRC3_CS)
     A                                      TEXT('PRICE FOR DISCOUNT RANGE 3')
     A            VIA           20A         ALIAS(VIA_CS)
     A                                      TEXT('MEANS OF SHIPMENT        ')
     A            VLDCODETYP     6A         ALIAS(VALID_CODE_TYPE)
     A                                      TEXT('MASTER AND DETAIL TYPE CODE')
     A            VLDCODEKEY    12A         ALIAS(VALID_CODE_KEY)
     A                                      TEXT('DETAIL DATASET CODE KEY')
     A            VLDCODEDES    30A         ALIAS(VALID_CODE_DESC)
     A                                      TEXT('DETAIL SET CODE DESCRIPTION')
     A            VLDTYPEDES    50A         ALIAS(VALID_TYPE_DESC)
     A                                      TEXT('MASTER SET CODE DESCRIPTION')
     A            VLDERRNUM      6A         ALIAS(ERR_MSG_NO)
     A                                      TEXT('MASTER SET ERROR NUMBER')
     A            WLBIN1        12A         ALIAS(WLBIN1_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 1 ')
     A            WLBIN1QTY      8S         ALIAS(WLBIN1QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 1       ')
     A            WLBIN2        12A         ALIAS(WLBIN2_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 2 ')
     A            WLBIN2QTY      8S         ALIAS(WLBIN2QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 2       ')
     A            WLBIN3        12A         ALIAS(WLBIN3_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 3 ')
     A            WLBIN3QTY      8S         ALIAS(WLBIN3QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 3       ')
     A            WLBIN4        12A         ALIAS(WLBIN4_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 4 ')
     A            WLBIN4QTY      8S         ALIAS(WLBIN4QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 4       ')
     A            WLBIN5        12A         ALIAS(WLBIN5_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 5 ')
     A            WLBIN5QTY      8S         ALIAS(WLBIN5QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 5       ')
     A            WLBIN6        12A         ALIAS(WLBIN6_CS)
     A                                      TEXT('WORKSHEET BIN LOCATION 6 ')
     A            WLBIN6QTY      8S         ALIAS(WLBIN6QTY_CS)
     A                                      TEXT('QUANTITY FOR BIN 6       ')
     A            WLCHRG         6A         ALIAS(WLCHRG_CS)
     A                                      TEXT('WORKSHEET CHARGE DEPARTMENT')
     A            WLDTE          8A         ALIAS(WLDTE_CS)
     A                                      TEXT('ISSUES/RETURNS MASTER DATES')
     A            WLKEY          6A         ALIAS(WLKEY_CS)
     A                                      TEXT('ISSUES/RETURNS NUMBERS   ')
     A            WLREQDEPT      4A         ALIAS(WLREQDEPT_CS)
     A                                      TEXT('WORKSHEET REQUESTING DEPT')
     A            WLWRKORDER    12A         ALIAS(WLWRKORDER_CS)
     A                                      TEXT('WORKSHEET WORKORDER NUMBER')
     A            WOITEMNO       4A         ALIAS(WOITEMNO_CS)
     A                                      TEXT('WORK ORDER ITEM NUMBER   ')
     A            WONO          10A         ALIAS(WONO_CS)
     A                                      TEXT('WORK ORDER NUMBER        ')
     A            WOWRKCTR       2A         ALIAS(WOWRKCTR_CS)
     A                                      TEXT('WORK ORDER WORK CENTER   ')
     A            ZBILLNO        6A         ALIAS(ZBILLNO_CS)
     A                                      TEXT('ZBILL NUMBER             ')
