     A          R RZONPRT
     A            SPOOLNUME      2A         ALIAS(SPOOLNUME_ZP)
     A            SPOOLNUMM      2A         ALIAS(SPOOLNUMM_ZP)
     A            SPOOLNUMP      2A         ALIAS(SPOOLNUMP_ZP)
     A            SPOOLNUMV      2A         ALIAS(SPOOLNUMV_ZP)
     A            SPOOLNUMX      2A         ALIAS(SPOOLNUMX_ZP)
     A            ZONEKEY        4A         ALIAS(ZONEKEY_ZP)
