     A          R MCRPMM1100                PFILE(MCFPMM1100)
     A            WONUM
     A            WOSTATUS
     A            HSTATUS        1   I      SST(WOSTATUS 1)
     A            DATERECD
     A            TIMERECD
     A            APPRVLCOD
     A            REQUESTER
     A            EQPNUM
     A            EQPNAME
     A            EQPTYPE
     A            EQPDEPT
     A            ZONEPRTY
     A            EQPLOC
     A            EQPDOWN
     A            EXPCLASS
     A            RIME
     A            DATEREQD
     A            TIMEREQD
     A            DESCRIPT1
     A            DESCRIPT2
     A            DESCRIPT3
     A            SPECLINSTR
     A            SPECLEQUIP
     A            SAFETYNOTE
     A            ENGINEER
     A            ENGRIND
     A            PLANNER
     A            PLNRIND
     A            SCHEDULER
     A            SCHDIND
     A            DATESCHD
     A            TIMESCHD
     A            BUDGETNO
     A            REQUESTNO
     A            DATESTRT
     A            TIMESTRT
     A            FAILCODE
     A            DATECOMP
     A            TIMECOMP
     A            SAVEHISTSW
     A            LASTJOBSEQ
     A            STRTSTATUS
     A            LASTSUFFIX
     A            PLDSEQNUM
     A            PLDDELDATE
     A            PLDPAD
     A            PMJOBPKEY
     A            PMSCHEDKEY
     A          K DATERECD
     A          K TIMERECD
     A          O DATERECD                  COMP(LT '20070000')
     A          S WOSTATUS                  COMP(EQ 'OO')
     A          S WOSTATUS                  COMP(EQ 'SD')
     A          S HSTATUS                   COMP(EQ 'H')
