     A          R MCRFMM1014                PFILE(MCFPMM1010)
     A            MMWONUM
     A            MXDATERECD
     A            MXTIMERECD
     A            MXDATESTRT
     A            MXTIMESTRT
     A            MXDATECOMP
     A            MXTIMECOMP
     A            MXZONE
     A            MXPRTY
     A            MMPRODDTRC
     A            MMMODRECD
     A            MMSHFTRC
     A            MMCREWRC
     A            MMPRODSTRT
     A            MMMODSTRT
     A            MMSHFTSTRT
     A            MMCREWSTRT
     A            MMPRODCOMP
     A            MMMODCOMP
     A            MMSHFTCOMP
     A            MMCREWCOMP
     A            MMRESPONSE
     A            MMWRENCH
     A            MMTOTAL
     A            MM1020
     A            MM1030A
     A            MM1030B
     A            MM1030C
     A            MMEXCLUDE
     A          K MMPRODCOMP
     A          K MMWONUM
     A          O MM1030C                   COMP(EQ 'Y')
