     A          R MCRPMM1000                TEXT('WORK ORDERS')
     A                                      JFILE(MCFPMM1000 MCFPMM2400)
     A*---------------------------------------------------------------------
     A* JOIN
     A          J                           JOIN(1 2)
     A                                      JFLD(WONUM TOWO)
     A*---------------------------------------------------------------------
     A            WONUM                     JREF(1)
     A            DATERECD                  JREF(1)
     A            ZONEPRTY                  JREF(1)
     A            X1                        CONCAT(REQUESTER EQPNUM EQPNAME -
     A                                      EQPDEPT ZONEPRTY DESCRIPT1 -
     A                                      DESCRIPT2 DATERECD WOSTATUS -
     A                                      CRAFTSMEN1 CRAFTSMEN2 -
     A                                      CRAFTSMEN3 FAILCODE EQPTYPE)
     A
     A            X2                        CONCAT(FROMCC FROMSIGNON TOCC -
     A                                      MESSAGE1 MESSAGE2 MESSAGE3 -
     A                                      MESSAGE4  MESSAGE5)
     A*
     A*
     A          K WONUM
     A          O DATERECD                  COMP(LT '20070000')
