     A          R MCRPMM1010                PFILE(MCFPMM1010)
     A          K MXDATERECD
     A          K MMWONUM
     A          O MM1020                    COMP(EQ 'Y')
