     A                                      REF(MMISA)
     A          R MCRP10JEDW
     A            PLANTIDENTR
     A            WONUM     R
     A            WOSTATUS  R
     A            DATERECD  R
     A            TIMERECD  R
     A            APPRVLCOD R
     A            REQUESTER R
     A            EQPNUM    R
     A            EQPNAME   R
     A            EQPTYPE   R
     A            EQPDEPT   R
     A            ZONEPRTY  R
     A            EQPLOC    R
     A            EQPDOWN   R
     A            EXPCLASS  R
     A            DESCRIPT1 R
     A            DESCRIPT2 R
     A            CRAFTREQD1R
     A            CRAFTREQD2R
     A            CRAFTREQD3R
     A            CRAFTSMEN1R
     A            CRAFTSMEN2R
     A            CRAFTSMEN3R
     A            DATESTRT  R
     A            TIMESTRT  R
     A            FAILCODE  R
     A            DATECOMP  R
     A            TIMECOMP  R
     A            STRTSTATUSR
     A            BASSEQNUM R
     A            BASDELDATER
     A            BASPAD    R
     A*
     A            MXZONE         4          COLHDG('ZONE')
     A            MXPRTY         2          COLHDG('PRIORITY')
     A            MMPRODDTRC     8          COLHDG('PROD' 'DATE' 'RECD')
     A            MMMODRECD      4S 0       COLHDG('MINUTE OF DAY' 'RECD')
     A            MMSHFTRC       1          COLHDG('PROD' 'SHIFT' 'RECD')
     A            MMCREWRC       1          COLHDG('PROD' 'CREW' 'RECD')
     A            MMPRODSTRT     8          COLHDG('PROD' 'DATE' 'STARTED')
     A            MMMODSTRT      4S 0       COLHDG('MINUTE OF DAY' 'STARTED')
     A            MMSHFTSTRT     1          COLHDG('PROD' 'SHIFT' 'STARTED')
     A            MMCREWSTRT     1          COLHDG('PROD' 'CREW' 'STARTED')
     A            MMPRODCOMP     8          COLHDG('PROD' 'DATE' 'COMPLETED')
     A            MMMODCOMP      4S 0       COLHDG('MINUTE OF DAY' 'COMPLETED')
     A            MMSHFTCOMP     1          COLHDG('PROD' 'SHIFT' 'COMPLETED')
     A            MMCREWCOMP     1          COLHDG('PROD' 'CREW' 'COMPLETED')
     A            MMRESPONSE     7S 0       COLHDG('RESPONSE' 'TIME' 'MINUTES')
     A            MMWRENCH       7S 0       COLHDG('WORK' 'TIME' 'MINUTES')
     A            MMTOTAL        7S 0       COLHDG('TOTAL' 'TIME' 'MINUTES')
     A            MM1020         1          COLHDG('MM1020' 'FILE' 'PROCESSED')
     A            MM1030A        1          COLHDG('MM1030A' 'FILE PROCESSED')
     A            MM1030B        1          COLHDG('MM1030B' 'FILE PROCESSED')
     A            MM1030C        1          COLHDG('MM1030C' 'FILE PROCESSED')
     A            MMEXCLUDE      1          COLHDG('EXCLUDE' 'FROM REPORTING')
