     A                                      UNIQUE
     A          R MCRPMM1060
     A            CT60DATE       8          COLHDG('PRODUCTION DATE' 'YYYYMMDD')
     A            CT60START      4S 0       COLHDG('START OF DAY')
     A*
     A          K CT60DATE                  DESCEND
