     A
     A          R MCRPMM1090
     A            M9EQPNUM       6
     A            M9FAIL         6
     A            M9DIV          4
     A            M9MTTR         7  0
     A            M9MTTF         7  0
     A*
     A          K M9EQPNUM
     A          K M9FAIL
