     A
     A          R MCRPMM1091
     A            MWEQPNUM       6
     A            MWFAIL         6
     A            MWDATEC        8
     A            MWDIV          4
     A            MWMTTR         7  0
     A            MWMTTF         7  0
     A*
     A          K MWEQPNUM
     A          K MWFAIL
     A          K MWDATEC
