     A          R MCRPMM1110
     A            MMWONUM       10          COLHDG('WO NUMBER')
     A            MXDATERECD     8          COLHDG('DATE WO WAS INPUT')
     A            MXTIMERECD     4          COLHDG('TIME WO WAS INPUT')
     A            MXDATEREQD     8          COLHDG('DATE PARTS REQUIRED')
     A            MXTIMEREQD     4          COLHDG('TIME PARTS REQUIRED')
     A            MXDATESCHD     8          COLHDG('DATE WO WAS SCHED')
     A            MXTIMESCHD     4          COLHDG('TIME WO WAS SCHED')
     A            MXDATESTRT     8          COLHDG('DATE WO WAS STARTED')
     A            MXTIMESTRT     4          COLHDG('TIME WO IS STARTED')
     A            MXDATECOMP     8          COLHDG('DATE WO WAS COMPLETE')
     A            MXTIMECOMP     4          COLHDG('TIME WO COMPLETED')
     A            MXZONE         4          COLHDG('ZONE')
     A            MXPRTY         2          COLHDG('PRIORITY')
     A            MMPRODDTRC     8          COLHDG('PROD' 'DATE' 'RECD')
     A            MMMODRECD      4S 0       COLHDG('MINUTE OF DAY' 'RECD')
     A            MMSHFTRC       1          COLHDG('PROD' 'SHIFT' 'RECD')
     A            MMCREWRC       1          COLHDG('PROD' 'CREW' 'RECD')
     A            MMPRODDTRQ     8          COLHDG('PROD' 'DATE' 'REQD')
     A            MMMODREQD      4S 0       COLHDG('MINUTE OF DAY' 'REQD')
     A            MMSHFTRQ       1          COLHDG('PROD' 'SHIFT' 'REQD')
     A            MMCREWRQ       1          COLHDG('PROD' 'CREW' 'REQD')
     A            MMPRODDTSD     8          COLHDG('PROD' 'DATE' 'SCHD')
     A            MMMODSCHD      4S 0       COLHDG('MINUTE OF DAY' 'SCHD')
     A            MMSHFTSD       1          COLHDG('PROD' 'SHIFT' 'SCHD')
     A            MMCREWSD       1          COLHDG('PROD' 'CREW' 'SCHD')
     A            MMPRODSTRT     8          COLHDG('PROD' 'DATE' 'STARTED')
     A            MMMODSTRT      4S 0       COLHDG('MINUTE OF DAY' 'STARTED')
     A            MMSHFTSTRT     1          COLHDG('PROD' 'SHIFT' 'STARTED')
     A            MMCREWSTRT     1          COLHDG('PROD' 'CREW' 'STARTED')
     A            MMPRODCOMP     8          COLHDG('PROD' 'DATE' 'COMPLETED')
     A            MMMODCOMP      4S 0       COLHDG('MINUTE OF DAY' 'COMPLETED')
     A            MMSHFTCOMP     1          COLHDG('PROD' 'SHIFT' 'COMPLETED')
     A            MMCREWCOMP     1          COLHDG('PROD' 'CREW' 'COMPLETED')
     A            MMWRENCH       7S 0       COLHDG('WORK' 'TIME' 'MINUTES')
     A            MM1130         1          COLHDG('MM1030' 'FILE' 'PROCESSED')
     A            MM1130A        1          COLHDG('MM1030A' 'FILE PROCESSED')
     A            MM1130B        1          COLHDG('MM1030B' 'FILE PROCESSED')
     A            MM1130C        1          COLHDG('MM1030C' 'FILE PROCESSED')
     A            MMEXCLUDE      1          COLHDG('EXCLUDE' 'FROM REPORTING')
     A*
