     A                                      REF(STORES)
     A          R MCRP140EDW
     A            PLTINFOKEYR
     A            CORPCDE   R
     A            DESCIDNUM R
     A            DESCDTA   R
