     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      INDARA
     A                                      PRINT
     A  98                                  INVITE
     A          R EARQADD
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A                                  2  4'REQUISITION NUMBER: '
     A            REQNUM        12A  B  2 25DSPATR(PR)
     A                                      OVRDTA
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  5 47'.'
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A            PDEC2          4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  8 65'MATERIAL:'
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                  9 36'CLASS    DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME (SUB)   (SUBD)'
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 11  6'-'
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                 11 11'-'
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 11 16'-'
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PRM            3A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CLS            3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6Y 0B 11 53DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13  1'DESCRIPTION'
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 19  1'REMARKS'
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A            USERID        10A  B 22 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                 22 50'LINK REQ TO W/O'
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A*%%GP SCREEN1    01
     A          R EARQADD1
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS    DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME (SUB)   (SUBD)'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32
     AO 97 96                               DSPATR(PC)
     A            CODE           7A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY            8A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  5 26DSPATR(PR)
     A                                      OVRDTA
     A            PRICE         11A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            PDEC           4D  B  5 49DSPATR(PR)
     A                                      OVRDTA
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            PDEC2          4D  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            CURR2          2A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            STAG           4A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            DATEW          8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            VENDOR        30A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            SRVCFLG        1X  B  8 75DSPATR(PR)
     A                                      OVRDTA
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B 11 13DSPATR(PR)
     A                                      OVRDTA
     A            B4             3A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            CO             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 11 37DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            ADDTL         14A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(PR)
     A                                      OVRDTA
     A            DESC          78A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         78A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         78A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         78A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         78A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            REM1          78A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            REM2          78A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            USERID        10A  B 22 34DSPATR(PR)
     A                                      OVRDTA
     A            WONO          10A  B 22 67DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADD1L
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS/   DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME EXP TYPE'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32
     AO 97 96                               DSPATR(PC)
     A            CODE           7A  B  5  3DSPATR(PR)
     A                                      OVRDTA
     A            QTY            8A  B  5 15DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  5 26DSPATR(PR)
     A                                      OVRDTA
     A            PRICE         11A  B  5 35DSPATR(PR)
     A                                      OVRDTA
     A            PDEC           4D  B  5 49DSPATR(PR)
     A                                      OVRDTA
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11A  B  6 35DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            PDEC2          4D  B  6 49DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            CURR2          2A  B  6 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            STAG           4A  B  8  3DSPATR(PR)
     A                                      OVRDTA
     A            DATEW          8A  B  8 15DSPATR(PR)
     A                                      OVRDTA
     A            VENDOR        30A  B  8 30DSPATR(PR)
     A                                      OVRDTA
     A            SRVCFLG        1X  B  8 75DSPATR(PR)
     A                                      OVRDTA
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(PR)
     A                                      OVRDTA
     A            B2             2A  B 11  8DSPATR(PR)
     A                                      OVRDTA
     A            B3             2A  B 11 13DSPATR(PR)
     A                                      OVRDTA
     A            B4             3A  B 11 18DSPATR(PR)
     A                                      OVRDTA
     A            CO             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 11 38DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B 11 45DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B 11 53DSPATR(PR)
     A                                      OVRDTA
     A            ADDTL         14A  B 11 65DSPATR(PR)
     A                                      OVRDTA
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(PR)
     A                                      OVRDTA
     A            DESC          78A  B 14  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC2         78A  B 15  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC3         78A  B 16  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC4         78A  B 17  2DSPATR(PR)
     A                                      OVRDTA
     A            DESC5         78A  B 18  2DSPATR(PR)
     A                                      OVRDTA
     A            REM1          78A  B 20  2DSPATR(PR)
     A                                      OVRDTA
     A            REM2          78A  B 21  2DSPATR(PR)
     A                                      OVRDTA
     A            USERID        10A  B 22 35DSPATR(PR)
     A                                      OVRDTA
     A            WONO          10A  B 22 67DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADD2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS    DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME (SUB)   (SUBD)'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            PDESC2         4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PRM            3A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CLS            3A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6Y 0B 11 53DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            USERID        10A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADD2L
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS/   DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME EXP TYPE'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            PDESC2         4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            PRM            3A  B 11 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            CLS            3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6Y 0B 11 53DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            USERID        10A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADDL
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS/   DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME EXP TYPE'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            PDESC2         4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            USERID        10A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADDLE
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER: '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS/   DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME EXP TYPE'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            REQNUM        12A  B  2 25DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            PDESC2         4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6A  B 11 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            USERID        10A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQADDLEP
     A*%%TS  SD  19961204  130529  A257947     REL-V3R6M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 29'REQUISITION'
     A                                  2  4'REQUISITION NUMBER:  '
     A                                  4  4'CODE'
     A                                  4 15'QUANTITY'
     A                                  4 26'UM      ESTIMATED UNIT PRICE'
     A                                  4 56'CURRENCY'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  5 47'.'
     A                                  6 47'.'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  6 63'(OTHER CURRENCY)'
     A  40                                  DSPATR(ND)
     A                                      OVRATR
     A                                  7  2'STAGING     DATE WANTED'
     A                                  7 36'SUGGESTED VENDOR'
     A                                  7 65'SERVICE/REPAIR'
     A                                  8 65'MATERIAL:'
     A                                  9 36'CLASS/   DEPT'
     A                                 10  5'BUDGET NUMBER'
     A                                 10 25'CO   PRIME EXP TYPE     ¦'
     A                                 11  6'-'
     A                                 11 11'-'
     A                                 11 16'-'
     A                                 13  1'DESCRIPTION'
     A                                 19  1'REMARKS'
     A                                 22  1'USERID TO NOTIFY FOR REQUISITION'
     A                                 22 51'LINK REQ TO W/O'
     A            FUNCTION       8A  B  1 41DSPATR(PR)
     A                                      OVRDTA
     A            E             12A  B  2 26DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  5  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            QTY            8Y 0B  5 15DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            UM             2A  B  5 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            PRICE         11Y 0B  5 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            PDEC           4D 0B  5 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            CURR           2A  B  5 59DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  40                                  DSPATR(ND)
     A            WO            10A  B  5 69DSPATR(PR)
     A                                      OVRDTA
     A            PRICE2        11Y 0B  6 35DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            PDESC2         4D 0B  6 49DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            CURR2          2A  B  6 59DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A  40                                  DSPATR(ND)
     A  40                                  DSPATR(PR)
     A            STAG           4A  B  8  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            DATEW          8A  B  8 15DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            VENDOR        30A  B  8 30DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            SRVCFLG        1X  B  8 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A            HDG1          28A  B  9 51DSPATR(PR)
     A                                      OVRDTA
     A            HDG2          28A  B 10 51DSPATR(PR)
     A                                      OVRDTA
     A            BUD            3A  B 11  2DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            B2             2A  B 11  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            B3             2A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            B4             3A  B 11 18DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            CO             3A  B 11 25DSPATR(PR)
     A                                      OVRDTA
     A            PRM            3A  B 11 31DSPATR(PR)
     A                                      OVRDTA
     A            CLS            3A  B 11 38DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            DEPT           4A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP            6Y 0B 11 53DSPATR(UL)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            ADDTL         14A  B 11 65DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 13 45'LINK TO REQ - '
     A            LINKREQ       12A  B 13 60DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A            DESC          78A  B 14  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            DESC2         78A  B 15  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            DESC3         78A  B 16  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            DESC4         78A  B 17  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            DESC5         78A  B 18  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            REM1          78A  B 20  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            REM2          78A  B 21  2CHGINPDFT(LC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            USERID        10A  B 22 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            WONO          10A  B 22 67DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R EARQMENU
     A*%%TS  DD  20030417  162439  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1 27'REQUISITION MENU'
     A                                  4 24'f1  ADD REQUISITION'
     A                                  6 24'f2  MODIFY REQUISITION'
     A                                  8 24'f3  EXIT PROGRAM'
     A                                 10 24'f6  REQUISITION INQUIRY'
     A                                 12 24'f8  DELETE REQUISITION'
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R FEARQEXIST
     A*%%TS  DD  20030417  162439  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  3  4'OPEN REQ '
     A                                  3 28'ALREADY EXISTS FOR CODE '
     A                                  5  4'STATUS '
     A                                  7  4'DATE '
     A                                  7 21'DATE WANTED '
     A                                  7 45'QTY '
     A                                  7 61'UM '
     A                                  9  4'ORIGINATOR '
     A                                  9 42'FOR DEPT '
     A                                 11  4'WORKORDER '
     A                                 13  4'PRESS "ENTER" IF YOU STILL DESIRE'
     A                                 13 38'ANOTHER REQUISITION'
     A                                 14  4'PRESS "f3" TO CANCEL'
     A            REQ           12A  B  3 14DSPATR(PR)
     A                                      OVRDTA
     A            CODE           7A  B  3 53DSPATR(PR)
     A                                      OVRDTA
     A            STATUS        29A  B  5 12DSPATR(PR)
     A                                      OVRDTA
     A            DATE           8A  B  7 10DSPATR(PR)
     A                                      OVRDTA
     A            DATEWANT       8A  B  7 34DSPATR(PR)
     A                                      OVRDTA
     A            QUANTITY       8A  B  7 50DSPATR(PR)
     A                                      OVRDTA
     A            UM             2A  B  7 65DSPATR(PR)
     A                                      OVRDTA
     A            ORIG           4A  B  9 16DSPATR(PR)
     A                                      OVRDTA
     A            ORIGNAME      16A  B  9 23DSPATR(PR)
     A                                      OVRDTA
     A            DEPT           4A  B  9 52DSPATR(PR)
     A                                      OVRDTA
     A            WO            10A  B 11 15DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PERPASS1
     A*%%TS  DD  20030417  162439  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 22DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PERPASS2
     A*%%TS  DD  20030417  162439  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03
     AO 97 96                               DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
     A          R PERPASS3
     A*%%TS  DD  20030417  162439  QUSER       REL-V5.1    iSeries WDT
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CA03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2  3'ID: '
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  8DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07
     AO 97 96                               DSPATR(PC)
     A            NAME          16A  B  2 21DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1OVRDTA
     A  99        MESSAGELN1    79   M      OVRDTA
