     A*%%TS  SD  20121009  123306  A257947     REL-V6R1M0  5761-WDS
     A*  90/06/29  12:35:30    T881S28     REL-R02M00  5728-PW1
     A*            19:39:35    T881S28     VISSCRWS.HPTO38.CME
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INDARA
     A  98                                  INVITE
     A*  90/06/28  12:58:51    T881S28     REL-R02M00  5728-PW1
     A          R CRAFTSMAN
     A*%%TS  SD  20121009  123306  A257947     REL-V6R1M0  5761-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'INPUT DATA AND PRESS "ENTER" OR PR-
     A                                      ESS "f3" TO END PROGRAM, "f2" FOR'
     A                                  3 69'MATERIAL'
     A                                  4  1'STATUS INQUIRY, "f8" FOR MANUFACTU-
     A                                      RER INQUIRY, OR "f6" FOR KEYWORD/MO-
     A                                      D INQUIRY'
     A                                  6  1'EMPL'
     A                                  6 13'MMIS WO#'
     A                                  6 31'REQ DEPT'
     A                                  6 46'CHARGE DEPT     EXP CLASS'
     A                                  9  4'CORP CODE'
     A                                  9 23'QUANTITY      HU'
     A                                  9 42'EXP CLASS (Uses above EXP CLASS'
     A                                 10 53'if not entered for code)'
     A                                 20  1'PLANNER DATA'
     A                                 21  1'(NOTE FOR STOREROOM)'
     A                                 21 30'(PRESS "f1" TO TAB TO PLANNER DATA'
     A                                 21 65'- PUT "X" IN'
     A                                 22 31'LAST POSITION FOR EXTRA PRINTOUT)'
     A            EMPL           4A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            MMISWO        10A  B  7 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  7 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CHRG           4A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CC             2A  B  7 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EXP            6A  B  7 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  7 74DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B  7 77DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  8  6DSPATR(PR)
     A                                      OVRDTA
     A            CODE1          7A  B 10  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B 10 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B 10 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CODE2          7A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 11 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 12  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 12 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 12 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 13 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 13 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 14  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 14 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 14 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 14 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 15  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 15 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 15 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 16 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 16 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 17 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 17 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            PLANNER       59A  B 20 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 20 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            PGMMSG        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*  90/06/28  12:58:51    T881S28     REL-R02M00  5728-PW1
     A          R CRAFTSMANA
     A*%%TS  SD  19980128  092813  A193138     REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'TYPE DATA AND PRESS "ENTER"; "f2"'
     A                                  3 35'FOR MATERIAL STATUS INQUIRY; "f3"'
     A                                  3 69'TO END'
     A                                  5  1'EMPL    MMIS WO#    ORD DEPT   CHA-
     A                                      RGE DEPT   CHARGE TYPE   CHARGE ACC-
     A                                      T  CENTER'
     A                                  8  1'STOREROOM'
     A                                  8 26'QUANTITY'
     A                                  8 45'CHARGE ACCT (Uses above CHARGE ACC-
     A                                      T'
     A                                  9 57'if not entered for code)'
     A                                 18  1'PLANNER DATA'
     A                                 19  1'(NOTE FOR STOREROOM, PRESS f1 TO T-
     A                                      AB TO PLANNER, X AT END FOR ADDITIO-
     A                                      NAL PRINT)'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A            EMPL           4A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WO            10A  B  6  9DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  6 24DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DEPT           4A  B  6 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C              1A  B  6 51DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            X              1A  B  6 55DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B  6 63DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  6 72DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B  6 75DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            XX             2A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE1          7A  B  9 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B  9 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B  9 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CODE2          7A  B 10 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 10 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 11 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 12 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 12 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 13 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 13 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 14 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 14 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 14 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 15 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 15 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 15 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 16 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 16 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 16 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            PLANNER       59A  B 18 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 18 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            PGMMSG        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                 21  2'Charge type: 1--R&D 2--Eng. Expens-
     A                                      e 3--Eng. Repair 4--New Work'
     A                                 22 15'5--Machine Design'
     A                                 22 35'Blank--Operating & Process Items'
     A                                  8 12'CORP CODE'
     A                                  8 39'HU'
     A*  90/06/29  12:35:30    T881S28     REL-R02M00  5728-PW1
     A          R CRAFTSMANM
     A*%%TS  SD  20121009  123306  A257947     REL-V6R1M0  5761-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'INPUT DATA AND PRESS "ENTER" OR PR-
     A                                      ESS "f3" TO END PROGRAM, "f2" FOR'
     A                                  3 69'MATERIAL'
     A                                  4  1'STATUS INQUIRY, "f8" FOR MANUFACTU-
     A                                      RER INQUIRY, OR "f6" FOR KEYWORD/MO-
     A                                      D INQUIRY'
     A                                  6  1'EMPL'
     A                                  6 13'MMIS WO#'
     A                                  6 31'REQ DEPT'
     A                                  6 46'CHARGE DEPT     EXP CLASS'
     A                                  9  2'STOREROOM'
     A                                  9 26'QUANTITY'
     A                                  9 46'EXP CLASS (Uses above EXP CLASS'
     A                                 10 57'if not entered for code)'
     A                                 20  1'PLANNER DATA'
     A                                 21  1'(NOTE FOR STOREROOM)'
     A                                 21 30'(PRESS "f1" TO TAB TO PLANNER DATA'
     A                                 21 65'- PUT "X" IN'
     A                                 22 31'LAST POSITION FOR EXTRA PRINTOUT)'
     A            EMPL           4A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MMISWO        10A  B  7 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  7 33DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CHRG           4A  B  7 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CC             2A  B  7 53DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EXP            6A  B  7 64DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  7 73DSPATR(PR)
     A                                      OVRDTA
     A            CN             2A  B  7 76DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B 10  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE1          7A  B 10 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B 10 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            CODE2          7A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 11 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 12 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 12 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 12 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 13 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 13 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 14 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 14 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 14 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 15 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 15 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 15 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 16 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 16 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 16 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 17 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 17 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 17 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 17 48DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A            PLANNER       59A  B 20 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 20 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            FLD001        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A                                  9 12'CORP CODE'
     A                                  9 39'HU'
     A          R PERPASS1
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS2
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(PR)
     A                                      OVRDTA
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(PR)
     A                                      OVRDTA
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A          R PERPASS3
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  2 35'Type PASSWORD and press the "ENTER-
     A                                      " key.'
     A                                  4  3'Enter your personal PASSWORD:  '
     A                                  8  3'If you have problems or need help,'
     A                                  8 38'please contact'
     A            CC             4A  B  2  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            NAME          16A  B  2 11DSPATR(PR)
     A                                      OVRDTA
     A            PW             6A  B  4 35DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            IVPMSG        30A  B  4 45DSPATR(PR)
     A                                      OVRDTA
     A            PWMSG         56A  B  6  3DSPATR(PR)
     A                                      OVRDTA
     A            NPW            6A  B  6 62DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            HELP          26A  B  8 53DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('                           -
     A                                                                         -
     A                                                       ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA

     A*         R CRAFTSMAN
     A          R CRAFTSSAP
     A*%%TS  SD  20050426  163748  A257947     REL-V5R2M0  5722-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'INPUT DATA AND PRESS "ENTER" OR PR-
     A                                      ESS "f3" TO END PROGRAM, "f2" FOR'
     A                                  3 69'MATERIAL'
     A                                  4  1'STATUS INQUIRY, "f8" FOR MANUFACTU-
     A                                      RER INQUIRY, OR "f6" FOR KEYWORD/MO-
     A                                      D INQUIRY'
     A                                  5 53'SAP INT ORD #'
     A                                  6  1'EMPL'
     A                                  6 13'MMIS WO#'
     A                                  6 27'REQ DEPT'
     A                                  6 38'CHARGE DEPT'
     A                                  6 54'(CWIP/EWIP)'
     A                                  6 68'PM/BD/OTHER'
     A            EMPL           4A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01
     AO 97 96                               DSPATR(PC)
     A            MMISWO        10A  B  7 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  7 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CHRG           4A  B  7 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CC             2A  B  7 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EXP            6A  B  7 56DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  7 70DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CN             2A  B  7 76DSPATR(PR)
     A                                      OVRDTA
     A            ST             2A  B  8  6DSPATR(PR)
     A                                      OVRDTA
     A                                  8 41'SAP INT ORD #'
     A                                  9  4'CORP CODE'
     A                                  9 23'QUANTITY      HU'
     A                                  9 42'(CWIP/EWIP)'
     A                                  9 55'(Uses above SAP INT ORD #'
     A            CODE1          7A  B 10  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B 10 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B 10 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B 10 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                 10 56'if not entered for code)'
     A            CODE2          7A  B 11  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 11 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 11 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 11 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 12  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 12 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 12 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 12 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 13  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 13 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 13 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 13 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 14  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 14 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 14 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 14 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 15  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 15 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 15 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 15 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 16  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 16 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 16 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 16 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 17  5DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 17 23DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 17 37DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 17 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 20  1'PLANNER DATA'
     A            PLANNER       59A  B 20 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 20 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 21  1'(NOTE FOR STOREROOM)'
     A                                 21 30'(PRESS "f1" TO TAB TO PLANNER DATA'
     A                                 21 65'- PUT "X" IN'
     A                                 22 31'LAST POSITION FOR EXTRA PRINTOUT)'
     A            PGMMSG        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*         R CRAFTSMANA
     A          R CRAFTSSAPA
     A*%%TS  SD  20121009  115156  A257947     REL-V6R1M0  5761-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'TYPE DATA AND PRESS "ENTER"; "f2"'
     A                                  3 35'FOR MATERIAL STATUS INQUIRY; "f3"'
     A                                  3 69'TO END'
     A                                  4 53'SAP INT ORD #'
     A                                  5  1'EMPL'
     A                                  5  7'MMIS WO#'
     A                                  5 18'ORD DEPT'
     A                                  5 28'CHARGE DEPT'
     A                                  5 41'CHARGE TYPE'
     A                                  5 54'(CWIP/EWIP)'
     A                                  5 67'PM/BD/OTHER'
     A                                  5 74'CENTER'
     A            EMPL           4A  B  6  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            WO            10A  B  6  7DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  6 20DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DEPT           4A  B  6 31DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            C              1A  B  6 44DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            X              1A  B  6 50DSPATR(PR)
     A                                      OVRDTA
     A            EXP            6A  B  6 57DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  6 69DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CN             2A  B  6 76DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                  7 43'SAP INT ORD #'
     A                                  8  1'STOREROOM'
     A                                  8 12'CORP CODE'
     A                                  8 26'QUANTITY'
     A                                  8 39'HU'
     A                                  8 43'(CWIP/EWIP) (Uses above SAP INT OR-
     A                                      D #'
     A            XX             2A  B  9  3DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE1          7A  B  9 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B  9 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B  9 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B  9 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  9 56'if not entered for code)'
     A            CODE2          7A  B 10 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 10 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 10 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 11 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 11 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 12 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 12 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 12 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 13 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 13 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 13 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 14 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 14 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 14 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 15 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 15 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 15 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 16 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 16 40DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 16 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 18  1'PLANNER DATA'
     A            PLANNER       59A  B 18 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 18 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 19  1'(NOTE FOR STOREROOM, PRESS f1 TO T-
     A                                      AB TO PLANNER, X AT END FOR ADDITIO-
     A                                      NAL PRINT)'
     A                                 20  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                 21  2'Charge type: 1--R&D 2--Eng. Expens-
     A                                      e 3--Eng. Repair 4--New Work'
     A                                 22 15'5--Machine Design'
     A                                 22 35'Blank--Operating & Process Items'
     A            PGMMSG        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
     A*         R CRAFTSMANM
     A          R CRAFTSSAPM
     A*%%TS  SD  20121009  115807  A257947     REL-V6R1M0  5761-WDS
     A                                      PUTOVR
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                  1  9'S T O R E R O O M   W I T H D R A'
     A                                  1 43'W A L   W O R K S H E E T'
     A                                  3  1'INPUT DATA AND PRESS "ENTER" OR PR-
     A                                      ESS "f3" TO END PROGRAM, "f2" FOR'
     A                                  3 69'MATERIAL'
     A                                  4  1'STATUS INQUIRY, "f8" FOR MANUFACTU-
     A                                      RER INQUIRY, OR "f6" FOR KEYWORD/MO-
     A                                      D INQUIRY'
     A                                  5 54'SAP INT ORD #'
     A                                  6  1'EMPL'
     A                                  6 10'MMIS WO#'
     A                                  6 27'REQ DEPT'
     A                                  6 40'CHARGE DEPT    (CWIP/EWIP)'
     A                                  6 69'PM/BD/OTHER'
     A            EMPL           4A  B  7  1DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            MMISWO        10A  B  7 10DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            REQ            4A  B  7 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            CHRG           4A  B  7 42DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            CC             2A  B  7 47DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            EXP            6A  B  7 58DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            PMBD           2A  B  7 71DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A            CN             2A  B  7 77DSPATR(PR)
     A                                      OVRDTA
     A                                  8 42'SAP INT ORD #'
     A                                  9  2'STOREROOM'
     A                                  9 12'CORP CODE'
     A                                  9 26'QUANTITY'
     A                                  9 38'HU'
     A                                  9 43'(CWIP/EWIP)'
     A                                  9 56'(Uses above SAP IN ORD #'
     A            ST             2A  B 10  4DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            CODE1          7A  B 10 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            QTY1           8A  B 10 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H              1A  B 10 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            EXP1           6A  B 10 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                 10 57'if not entered for code)'
     A            CODE2          7A  B 11 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            QTY2           8A  B 11 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            I              1A  B 11 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            EXP2           6A  B 11 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            CODE3          7A  B 12 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            QTY3           8A  B 12 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            J              1A  B 12 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            EXP3           6A  B 12 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            CODE4          7A  B 13 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            QTY4           8A  B 13 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            K              1A  B 13 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            EXP4           6A  B 13 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            CODE5          7A  B 14 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            QTY5           8A  B 14 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            L              1A  B 14 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            EXP5           6A  B 14 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            CODE6          7A  B 15 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A            QTY6           8A  B 15 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            M              1A  B 15 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            EXP6           6A  B 15 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            CODE7          7A  B 16 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            QTY7           8A  B 16 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            N              1A  B 16 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A            EXP7           6A  B 16 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            CODE8          7A  B 17 13DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            QTY8           8A  B 17 26DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            O              1A  B 17 39DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            EXP8           6A  B 17 45DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 20  1'PLANNER DATA'
     A            PLANNER       59A  B 20 14DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            EXTRAPRT       1A  B 20 74DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 21  1'(NOTE FOR STOREROOM)'
     A                                 21 30'(PRESS "f1" TO TAB TO PLANNER DATA'
     A                                 21 65'- PUT "X" IN'
     A                                 22 31'LAST POSITION FOR EXTRA PRINTOUT)'
     A            FLD001        78A  B 23  2DSPATR(PR)
     A                                      OVRDTA
     A            COMMANDLN1    79A  B 24  1DFTVAL('f1-TAB TO PLANNER f2-MATERI-
     A                                      AL INQUIRY f3-EXIT F6-KEYWORD INQ F-
     A                                      8-MFG INQ')
     A                                      DSPATR(PR)
     A                                      OVRDTA
     A  99        MESSAGELN1    79   M
     A  99                                  OVRDTA
